{
    "summary": "  * WE POUR THE DRINKS. YOU ENJOY YOURSELF.®\n  *  __419.740.0513\n  *  __info@premierpour.com\n\n  * __\n  * __\n  * __\n  * __\n  * __\n  * __\n\n__\n\n  * Home\n  * Services\n    * Our Services __\n      * Custom Bar Design\n__\n\n    * Weddings\n    * Corporate Events\n    * Private Parties\n    * Fundraisers\n    * How it Works\n  * Price Quote\n  * About\n    * Our Team\n    * FAQ\n    * Contact Us __\n      * Schedule Consultation\n__\n\n    * Testimonials\n    * Media\n  * VIP\n    * Client Portal Access\n  * Blog\n\n✕\n\nPremier Pour Bartending\n\n# The Ultimate Mobile Bar + Bartending Service for Weddings, Corporate Events,\nPrivate Parties, Fundraisers, + more...\n\nWe pour the drinks. You enjoy yourself.®\n\n __Request a Quote\n\nSPECIAL EVENT BARTENDING, MADE SIMPLE.\n\n## Your Full Service Mobile Bartending Solution\n\nWe know how much this occasion means to you. You’ve been hard at work planning\nthe details, and you want everything to go perfectly. Most importantly, you\nwant your guests to be entertained, served well, and taken care of. Among all\nthe components you’re concerned with, we’re here to handle one of the most\nvital parts of your event for you, the drink service.\n\nWhether you’re hosting your company’s holiday party or a sophisticated wedding\nreception, Premier Pour is dedicated to creating an experience your guests be\ntalking about long after the lights turn up for closing time. Relax & enjoy\nyourself as we create your cocktail menu, entertain your guests and provide\nincredible drinks & service.\n\n#### Relax. Let Us Do All The Work\n\nWhen it comes to serving drinks for your party, we’ll take care of it all.\nFrom alcohol estimates and costing to menu planning and custom cocktail\ncreation, you’ll be comforted knowing that the details of your beverage\nservice are being handled by professionals. With Premier Pour, you can loosen\nup and enjoy your event, worry-free.\n\nLearn more\n\n#### Serious Cocktail Craftsmanship\n\nSometimes, beer and wine just won’t do for everyone. From an exceptionally\nmade Old Fashioned or martinis to rounds of custom specialty cocktails, your\nguests appreciate having a wide range of drink options. You’ll make your\nguests feel special, not just because you’re awesome, but because you’ve\nprovided them with exactly what you knew they wanted, a delicious, handcrafted\ncocktail.\n\nLearn more\n\n#### Bring The Party To You\n\nHosting with professional bartenders takes your event to the next level. A\nfull-service bar adds an exciting dynamic to your event that can’t be\nreplicated by other means. You’ll be happy to know your guests are in good\nhands, being entertained and served by our hand-picked, professional staff.\n(Witty bartender banter included at no extra charge).\n\nLearn more\n\nReady to host an amazing event?\n\n __\n\nRequest your price quote today to get the process + party started!\n\n### Cost Efficient Drink Services\n\nWe’ve set out to bring you the best party imaginable while being cost-\nefficient for your event, so you come in under budget. Next to hiring a\nchainsaw juggling circus clown, there isn’t much else that will entertain your\nguests, create a lively party, and give you as much value for the cost. Most\nimportantly, our entertainment comes in the form of crafting ridiculously good\ndrinks exclusively for you and your guests. Don't hesitate, contact us today!\n\n### Our Simple Process Makes Your Event Planning Easy\n\nWorking with us is as straightforward as filling out a form and having a quick\nconversation to solidify the details. We come to your event, bring the best\ndrinks and even better service, and leave you and your guest imbibed and\nsatisfied. With over 10 years of experience throwing parties, from small\nprivate parties to giant wedding receptions, we have our methods down to a\nscience. We’ll make sure your event is efficient and amazing.\n\n### The Mobile Bartending Service Everyone Is Talking About\n\nDon’t just take our word for it. We started out as a one-man-show, helping a\nfew friends add some flair to their events as the dedicated bartender, and\nsince then, Premier Pour Bartending has grown into the best bartending service\nfor hire in the greater Toledo, Ohio and Southern Michigan areas. We’ve helped\nturn hundreds of events, large and small, into exceptional experiences, and we\nhave the track record to prove it. We travel, too!\n\nRequest a Quote __\n\n#### There Are A Lot Of Reasons Why We’re The Best Bartending Service In\nNorthwest Ohio, Southeast Michigan, Toledo, Ann Arbor, and Detroit, And The\nSurrounding Areas\n\n✪ We take the pressure off your shoulders\n\nYou’ll have a blast knowing we’re entertaining your guests and have all the\nbeverage details covered\n\n✪ Instantly raise the energy level of your event\n\nLet us charm, wow and treat your guests with our professional, energetic staff\n\n✪ Keep your guests entertained\n\nThere’s an allure to watching a bartender work their magic, and although we\nwon’t be juggling chainsaws like that clown you wanted to hire, we’ll make\nsure to put on a show\n\n✪ You can relax\n\nWe’ll show up early and pump up the party throughout the event, staying as\nlate as the party goes and until everything is fully cleaned\n\n✪ Freedom to select your perfect venue\n\nWith our multiple, efficient, state of the art, portable yet sizable bars,\nwe’ll show up and hydrate your guests anywhere, anytime. It doesn’t matter if\nthere isn’t room for a bar, we’ll make room\n\nRequest a Quote __\n\n## Professional Bartending Services\n\nHere’s a look at what we can do for you. Just take a look, and if you don’t\nsee a service that fits your needs, just send us a message for a custom quote!\n\nView All Services\n\n### premierpour\n\n🍾 Mobile bar and bartending service for parties, weddings, corporate events,\nand more. 🥂  \n📍OH | MI | FL | 🛩 Beyond  \n🔹$1MM Liquor & GL Ins.  \n🗓️ EST. 2006\n\nDid you know that Premier Pour Bartending offers a\n\nLast night, we celebrated the holiday spirit and n\n\nWe rang in the New Year in style with Lauren & Rya\n\nCheers to a New Year! 🍾 🍾 ⁠ ⁠ The Premie\n\n🎄✨ Merry Christmas from the Premier Pour Bart\n\n🥂 Cheers to a year filled with some great memor\n\n🍸 Sip, Savor, and Celebrate with Premier Pour B\n\nRaising our glasses and toasting to forever! 🥂\n\n🍻 Drumroll, please! Get ready to sip, savor, an\n\nFrom witnessing the groundbreaking ceremony to the\n\n🎉 GIVEAWAY ALERT! 🎉 ⁠ ⁠ Get ready for an\n\nHere’s to love, laughter, and the perfect drinks\n\nLoad More... Follow us on Instagram!\n\n##### Find us here:\n\n+1 419.740.0513  \ninfo@premierpour.com\n\n __\n\n __\n\n __\n\n __\n\n __\n\n© 2024 | Premier Pour Bartending  \nAll Rights Reserved\n\n##### Headquarters:\n\nPremier Pour Bartending  \n129 W Sophia St. STE 4  \nMaumee, OH 43537\n\n__\n\n  * __\n  * __\n  * __\n  * __\n  * __\n  * __\n\n",
    "links": "[{\"link\": \"https://premierpour.com/\", \"text\": \"Home\"}, {\"link\": \"https://premierpour.com/services/\", \"text\": \"\"}, {\"link\": \"https://premierpour.com/services/custom-bar-design/\", \"text\": \"Custom Bar Design\"}, {\"link\": \"https://premierpour.com/services/weddings/\", \"text\": \"Weddings\"}, {\"link\": \"https://premierpour.com/services/corporate/\", \"text\": \"Corporate Events\"}, {\"link\": \"https://premierpour.com/services/privateparties/\", \"text\": \"Private Parties\"}, {\"link\": \"https://premierpour.com/services/fundraisers/\", \"text\": \"Fundraisers\"}, {\"link\": \"https://premierpour.com/services/how-it-works/\", \"text\": \"How it Works\"}, {\"link\": \"https://premierpour.com/quote/\", \"text\": \"Price Quote\"}, {\"link\": \"https://premierpour.com/team/\", \"text\": \"Our Team\"}, {\"link\": \"https://premierpour.com/faq/\", \"text\": \"FAQ\"}, {\"link\": \"https://premierpour.com/contact-us/\", \"text\": \"\"}, {\"link\": \"https://premierpour.com/contact-us/schedule-consultation/\", \"text\": \"Schedule Consultation\"}, {\"link\": \"https://premierpour.com/testimonials-2/\", \"text\": \"Testimonials\"}, {\"link\": \"https://premierpour.com/media/\", \"text\": \"Media\"}, {\"link\": \"https://premierpour.com/client-access/\", \"text\": \"Client Portal Access\"}, {\"link\": \"https://premierpour.com/blog/\", \"text\": \"Blog\"}, {\"link\": \"https://premierpour.com/quote\", \"text\": \"\"}, {\"link\": \"https://premierpour.com/services\", \"text\": \"Learn more\"}, {\"link\": \"https://premierpour.com/services\", \"text\": \"Learn more\"}, {\"link\": \"https://premierpour.com/services\", \"text\": \"Learn more\"}, {\"link\": \"https://premierpour.com/quote\", \"text\": \"\"}, {\"link\": \"https://premierpour.com/quote\", \"text\": \"\"}, {\"link\": \"https://premierpour.com/quote\", \"text\": \"\"}, {\"link\": \"https://premierpour.com/services/\", \"text\": \"View All Services\"}]"
}