{
    "summary": "  * WE POUR THE DRINKS. YOU ENJOY YOURSELF.®\n  *  __419.740.0513\n  *  __info@premierpour.com\n\n  * __\n  * __\n  * __\n  * __\n  * __\n  * __\n\n__\n\n  * Home\n  * Services\n    * Our Services __\n      * Custom Bar Design\n__\n\n    * Weddings\n    * Corporate Events\n    * Private Parties\n    * Fundraisers\n    * How it Works\n  * Price Quote\n  * About\n    * Our Team\n    * FAQ\n    * Contact Us __\n      * Schedule Consultation\n__\n\n    * Testimonials\n    * Media\n  * VIP\n    * Client Portal Access\n  * Blog\n\n✕\n\nPremier Pour Bartending\n\n# The Ultimate Mobile Bar + Bartending Service for Weddings, Corporate Events,\nPrivate Parties, Fundraisers, + more...\n\nWe pour the drinks. You enjoy yourself.®\n\n __Request a Quote\n\nSPECIAL EVENT BARTENDING, MADE SIMPLE.\n\n## Your Full Service Mobile Bartending Solution\n\nWe know how much this occasion means to you. You’ve been hard at work planning\nthe details, and you want everything to go perfectly. Most importantly, you\nwant your guests to be entertained, served well, and taken care of. Among all\nthe components you’re concerned with, we’re here to handle one of the most\nvital parts of your event for you, the drink service.\n\nWhether you’re hosting your company’s holiday party or a sophisticated wedding\nreception, Premier Pour is dedicated to creating an experience your guests be\ntalking about long after the lights turn up for closing time. Relax & enjoy\nyourself as we create your cocktail menu, entertain your guests and provide\nincredible drinks & service.\n\n#### Relax. Let Us Do All The Work\n\nWhen it comes to serving drinks for your party, we’ll take care of it all.\nFrom alcohol estimates and costing to menu planning and custom cocktail\ncreation, you’ll be comforted knowing that the details of your beverage\nservice are being handled by professionals. With Premier Pour, you can loosen\nup and enjoy your event, worry-free.\n\nLearn more\n\n#### Serious Cocktail Craftsmanship\n\nSometimes, beer and wine just won’t do for everyone. From an exceptionally\nmade Old Fashioned or martinis to rounds of custom specialty cocktails, your\nguests appreciate having a wide range of drink options. You’ll make your\nguests feel special, not just because you’re awesome, but because you’ve\nprovided them with exactly what you knew they wanted, a delicious, handcrafted\ncocktail.\n\nLearn more\n\n#### Bring The Party To You\n\nHosting with professional bartenders takes your event to the next level. A\nfull-service bar adds an exciting dynamic to your event that can’t be\nreplicated by other means. You’ll be happy to know your guests are in good\nhands, being entertained and served by our hand-picked, professional staff.\n(Witty bartender banter included at no extra charge).\n\nLearn more\n\nReady to host an amazing event?\n\n __\n\nRequest your price quote today to get the process + party started!\n\n### Cost Efficient Drink Services\n\nWe’ve set out to bring you the best party imaginable while being cost-\nefficient for your event, so you come in under budget. Next to hiring a\nchainsaw juggling circus clown, there isn’t much else that will entertain your\nguests, create a lively party, and give you as much value for the cost. Most\nimportantly, our entertainment comes in the form of crafting ridiculously good\ndrinks exclusively for you and your guests. Don't hesitate, contact us today!\n\n### Our Simple Process Makes Your Event Planning Easy\n\nWorking with us is as straightforward as filling out a form and having a quick\nconversation to solidify the details. We come to your event, bring the best\ndrinks and even better service, and leave you and your guest imbibed and\nsatisfied. With over 10 years of experience throwing parties, from small\nprivate parties to giant wedding receptions, we have our methods down to a\nscience. We’ll make sure your event is efficient and amazing.\n\n### The Mobile Bartending Service Everyone Is Talking About\n\nDon’t just take our word for it. We started out as a one-man-show, helping a\nfew friends add some flair to their events as the dedicated bartender, and\nsince then, Premier Pour Bartending has grown into the best bartending service\nfor hire in the greater Toledo, Ohio and Southern Michigan areas. We’ve helped\nturn hundreds of events, large and small, into exceptional experiences, and we\nhave the track record to prove it. We travel, too!\n\nRequest a Quote __\n\n#### There Are A Lot Of Reasons Why We’re The Best Bartending Service In\nNorthwest Ohio, Southeast Michigan, Toledo, Ann Arbor, and Detroit, And The\nSurrounding Areas\n\n✪ We take the pressure off your shoulders\n\nYou’ll have a blast knowing we’re entertaining your guests and have all the\nbeverage details covered\n\n✪ Instantly raise the energy level of your event\n\nLet us charm, wow and treat your guests with our professional, energetic staff\n\n✪ Keep your guests entertained\n\nThere’s an allure to watching a bartender work their magic, and although we\nwon’t be juggling chainsaws like that clown you wanted to hire, we’ll make\nsure to put on a show\n\n✪ You can relax\n\nWe’ll show up early and pump up the party throughout the event, staying as\nlate as the party goes and until everything is fully cleaned\n\n✪ Freedom to select your perfect venue\n\nWith our multiple, efficient, state of the art, portable yet sizable bars,\nwe’ll show up and hydrate your guests anywhere, anytime. It doesn’t matter if\nthere isn’t room for a bar, we’ll make room\n\nRequest a Quote __\n\n## Professional Bartending Services\n\nHere’s a look at what we can do for you. Just take a look, and if you don’t\nsee a service that fits your needs, just send us a message for a custom quote!\n\nView All Services\n\n### premierpour\n\n🍾 Mobile bar and bartending service for parties, weddings, corporate events,\nand more. 🥂  \n📍OH | MI | FL | 🛩 Beyond  \n🔹$1MM Liquor & GL Ins.  \n🗓️ EST. 2006\n\nDid you know that Premier Pour Bartending offers a\n\nLast night, we celebrated the holiday spirit and n\n\nWe rang in the New Year in style with Lauren & Rya\n\nCheers to a New Year! 🍾 🍾 ⁠ ⁠ The Premie\n\n🎄✨ Merry Christmas from the Premier Pour Bart\n\n🥂 Cheers to a year filled with some great memor\n\n🍸 Sip, Savor, and Celebrate with Premier Pour B\n\nRaising our glasses and toasting to forever! 🥂\n\n🍻 Drumroll, please! Get ready to sip, savor, an\n\nFrom witnessing the groundbreaking ceremony to the\n\n🎉 GIVEAWAY ALERT! 🎉 ⁠ ⁠ Get ready for an\n\nHere’s to love, laughter, and the perfect drinks\n\nLoad More... Follow us on Instagram!\n\n##### Find us here:\n\n+1 419.740.0513  \ninfo@premierpour.com\n\n __\n\n __\n\n __\n\n __\n\n __\n\n© 2024 | Premier Pour Bartending  \nAll Rights Reserved\n\n##### Headquarters:\n\nPremier Pour Bartending  \n129 W Sophia St. STE 4  \nMaumee, OH 43537\n\n__\n\n  * __\n  * __\n  * __\n  * __\n  * __\n  * __\n\n",
    "links": "[{\"link\": \"https://premierpour.com/\", \"text\": \"Home\"}, {\"link\": \"https://premierpour.com/services/\", \"text\": \"\"}, {\"link\": \"https://premierpour.com/services/custom-bar-design/\", \"text\": \"Custom Bar Design\"}, {\"link\": \"https://premierpour.com/services/weddings/\", \"text\": \"Weddings\"}, {\"link\": \"https://premierpour.com/services/corporate/\", \"text\": \"Corporate Events\"}, {\"link\": \"https://premierpour.com/services/privateparties/\", \"text\": \"Private Parties\"}, {\"link\": \"https://premierpour.com/services/fundraisers/\", \"text\": \"Fundraisers\"}, {\"link\": \"https://premierpour.com/services/how-it-works/\", \"text\": \"How it Works\"}, {\"link\": \"https://premierpour.com/quote/\", \"text\": \"Price Quote\"}, {\"link\": \"https://premierpour.com/team/\", \"text\": \"Our Team\"}, {\"link\": \"https://premierpour.com/faq/\", \"text\": \"FAQ\"}, {\"link\": \"https://premierpour.com/contact-us/\", \"text\": \"\"}, {\"link\": \"https://premierpour.com/contact-us/schedule-consultation/\", \"text\": \"Schedule Consultation\"}, {\"link\": \"https://premierpour.com/testimonials-2/\", \"text\": \"Testimonials\"}, {\"link\": \"https://premierpour.com/media/\", \"text\": \"Media\"}, {\"link\": \"https://premierpour.com/client-access/\", \"text\": \"Client Portal Access\"}, {\"link\": \"https://premierpour.com/blog/\", \"text\": \"Blog\"}, {\"link\": \"https://premierpour.com/quote\", \"text\": \"\"}, {\"link\": \"https://premierpour.com/services\", \"text\": \"Learn more\"}, {\"link\": \"https://premierpour.com/services\", \"text\": \"Learn more\"}, {\"link\": \"https://premierpour.com/services\", \"text\": \"Learn more\"}, {\"link\": \"https://premierpour.com/quote\", \"text\": \"\"}, {\"link\": \"https://premierpour.com/quote\", \"text\": \"\"}, {\"link\": \"https://premierpour.com/quote\", \"text\": \"\"}, {\"link\": \"https://premierpour.com/services/\", \"text\": \"View All Services\"}]",
    "priceAndPlans": "  * WE POUR THE DRINKS. YOU ENJOY YOURSELF.®\n  *  __419.740.0513\n  *  __info@premierpour.com\n\n  * __\n  * __\n  * __\n  * __\n  * __\n  * __\n\n__\n\n  * Home\n  * Services\n    * Our Services __\n      * Custom Bar Design\n__\n\n    * Weddings\n    * Corporate Events\n    * Private Parties\n    * Fundraisers\n    * How it Works\n  * Price Quote\n  * About\n    * Our Team\n    * FAQ\n    * Contact Us __\n      * Schedule Consultation\n__\n\n    * Testimonials\n    * Media\n  * VIP\n    * Client Portal Access\n  * Blog\n\n✕\n\n# Services & Pricing\n\nAt Premier Pour Bartending, we understand that no two events are alike. Your\nspecial occasion is as unique as you are, and that's why we take pride in\noffering personalized bartending services that cater to your individual needs.\nOur commitment to excellence is reflected in our transparent pricing model,\nensuring you receive exceptional service without any hidden costs.\n\n __Request a Quote\n\n## Services We Provide\n\nUnleash Unforgettable Moments: Premier Pour Bartending Services – Elevate Your\nEvents with Professionalism, Style, and Infinite Possibilities!\n\n### Your Full Service Mobile Bartending Solution\n\nWelcome to Premier Pour Bartending, where we bring a touch of excellence to\nyour events with our comprehensive range of services. From insurance-backed\nprofessionalism to top-notch bar equipment, we've got every aspect covered for\nan exceptional experience.\n\n#### Insurance + Certification\n\n  *  __Fully insured with $1MM commercial general + liquor liability insurance with blanket venue coverage + W2 employees covered by workers compensation insurance.\n  *  __ServSafe Alcohol® trained + certified bartenders.\n\n#### Professional Bar Equipment\n\n  *  __Multiple portable bars | Customization + branding options.\n  *  __Shaker tins, strainers, mixing glasses, speed pourers, jiggers.\n  *  __Garnish trays, cutting boards, knives, bottle openers.\n  *  __Ice scoops, bar mats, towels, coolers + more.\n\n#### Standard Included Supplies\n\n  * __9oz + 12oz clear plastic drinkware, bar tools.\n  *  __Coke, Diet Coke, 7UP, Ginger Ale, Club Soda, Tonic.\n  *  __Bottled water, cranberry juice, orange juice.\n  *  __Lemon + lime garnishes.\n  *  __Grenadine, lime juice, simple syrup, sour mix.\n\n#### Infinite Possibilities\n\n  *  __Elevate your event with our specialty cocktail service, featuring premium + gourmet supplies.\n  *  __Opt for an upscale touch with our selection of upgraded Tossware® drinkware options.\n  *  __Explore a multitude of additional options to personalize + enhance your bartending + beverage experience.\n\n#### Additional Service Options\n\n  *  __Multiple bar area service + access additional bartenders, bar backs + cocktail servers to tailor your event staffing.\n  *  __Leverage our network of preferred suppliers for a seamless + high-quality service.\n  *  __Consult with us for professional guidance on alcohol selection + purchasing, with convenient delivery options available.\n  *  __Inquire about a variety of service options to customize + elevate your bartending + beverage experience based on your unique preferences + event requirements.\n\n#### The Legal Side of Things...\n\nDue to state liquor laws, the event host is required to purchase + provide all\nalcoholic beverages which leads to substantial cost savings. We work with the\nevent host to create a drink menu + detailed beverage plan to complement each\nand every event. We also work with a network of preferred suppliers to\nfacilitate + coordinate the purchase + delivery of alcohol.\n\n## Custom Bar Graphics + Design\n\n#### Custom Graphics\n\nLooking to upgrade the style and vibe of your event? Elevate your event's\nstyle with our diverse, customizable options. Whether it's a corporate\nfunction or a wedding, we cater to your unique needs. Let us guide you through\ncountless possibilities for an unforgettable experience that exceeds all\nexpectations.\n\n#### Event Branding\n\nWant to impress your guests? We can showcase your brand, or tailor the color,\ntheme, and branding to match your theme. Sleek LED lighting can add a stylish\ntouch, ensuring a memorable experience for your guests. Contact us now to make\nyour event uniquely unforgettable! Cheers to customization!\n\nLearn More\n\nRequest a Quote __\n\nService Areas\n\nWondering where Premier Pour Bartending provides services?\n\nWe provide service in Northwest Ohio including Toledo, Maumee, Perrysburg,\nSylvania, Bowling Green, Whitehouse, Findlay, Lima, Sandusky, Marblehead, Port\nClinton, Fremont, Huron, Vermilion, and surrounding areas. We also provide\nservices in Southeast Michigan including Ann Arbor, Chelsea, Dexter, Detroit,\nRoyal Oak, Oakland, Dearborn, Clarklake, Devils Lake, Brooklyn, Lansing,\nTecumseh, Adrian, Monroe, and more. We are available to provide services\nthroughout the entire state of Ohio and Michigan, as well as Florida.\n\n##### Where else?\n\nIt’s possible for us to work events outside of our regular service areas\ndepending on a number of factors, including size of the party, travel\ndistance, and available bartenders nearby. There will likely be extra costs\nfor travel time and expenses, but we’re more than happy to work out an\nagreement. Click here to contact us and discuss the details.\n\nIf you’re ready to reserve us for your next event, or just want to find out\nmore information, click the button below to get a quote for your party.\n\nRequest a Quote __\n\nEvents We Service\n\nLooking for the perfect addition to your special event?\n\nWhether you're hosting a wedding, corporate event, fundraiser, private party,\nbirthday party, holiday party, graduation, networking event, or any other type\nof event, Premier Pour Bartending is here to provide top-notch bartending\nservices that will make your event a success.\n\n __ __Weddings\n\nAt Premier Pour Bartending, we know that your wedding day is one of the most\nimportant days of your life. That's why we provide top-notch bartending\nservices that will make your big day even more special. Our team of\nprofessional bartenders is highly skilled and experienced in crafting\ndelicious cocktails and providing exceptional service that will leave your\nguests impressed.\n\n____Corporate Events\n\nIf you're hosting a corporate event, you want everything to go smoothly, and\nthat includes the bar service. At Premier Pour Bartending, we understand the\nimportance of impressing your clients and colleagues. Our team of professional\nbartenders will create a custom cocktail menu that will suit the theme and\ntone of your event perfectly.\n\n____Fundraisers\n\nIf you're hosting a fundraiser, you want to make sure that your guests have a\ngreat time while supporting your cause. At Premier Pour Bartending, we can\nhelp you do just that! Our team of professional bartenders will keep the\ndrinks flowing and the atmosphere lively, ensuring that your guests have a\ngreat time and are more likely to donate to your cause.\n\n____Private Parties\n\nWhether you're hosting a small gathering of friends or a large celebration,\nPremier Pour Bartending is here to make sure that your party is a success. Our\nteam of professional bartenders will work with you to create a custom cocktail\nmenu that will suit your taste and budget. From craft cocktails to classic\ndrinks, we've got you covered.\n\n____Birthday Parties\n\nAt Premier Pour Bartending, we know that your birthday is a special occasion.\nThat's why we provide top-notch bartending services that will make your party\neven more memorable. Our team of professional bartenders is highly skilled and\nexperienced in crafting delicious cocktails and providing exceptional service\nthat will leave your guests impressed.\n\n____Holiday Parties\n\nThe holiday season is a time for celebration, and Premier Pour Bartending is\nhere to help you make the most of it. Our team of professional bartenders will\ncreate a custom cocktail menu that will suit the theme and tone of your party\nperfectly. From festive drinks to classic cocktails, we've got you covered.\n\n____Graduation Parties\n\nGraduating is a major accomplishment, and it deserves to be celebrated in\nstyle. Premier Pour Bartending is here to help you do just that! Our team of\nprofessional bartenders will work with you to create a custom cocktail menu\nthat will suit your taste and budget. From craft cocktails to classic drinks,\nwe've got you covered.\n\n____Networking Events\n\nNetworking events are all about making connections, and Premier Pour\nBartending can help you do just that. Our team of professional bartenders will\nkeep the drinks flowing and the atmosphere lively, ensuring that your guests\nhave a great time and are more likely to make valuable connections with one\nanother.\n\n____Concerts + Festivals\n\nIf you're hosting a music festival or concert, you want to make sure that your\nguests have access to quality drinks and exceptional service. Premier Pour\nBartending can provide experienced bartenders, customized drink menus, and\nprofessional bar equipment to help you elevate the guest experience. Whether\nit's 500 guests or 20,000 - we've got you covered!\n\n____Other Types of Events\n\nArt Shows and Exhibitions Pop-up Events Food and Wine Festivals Film Festivals\nGalas and Award Ceremonies Trade Shows and Conferences Product Launches\nFashion Shows Charity Events Cocktail Parties Bar/Bat Mitzvahs Baby Showers\nBridal Showers Engagement Parties Anniversaries Retirement Parties Reunions\nSporting Events Boat Parties VIP Events Conventions and Expos Cultural\nFestivals Housewarming Parties Launch Parties\n\n##### Find us here:\n\n+1 419.740.0513  \ninfo@premierpour.com\n\n __\n\n __\n\n __\n\n __\n\n __\n\n© 2024 | Premier Pour Bartending  \nAll Rights Reserved\n\n##### Headquarters:\n\nPremier Pour Bartending  \n129 W Sophia St. STE 4  \nMaumee, OH 43537\n\n__\n\n  * __\n  * __\n  * __\n  * __\n  * __\n  * __\n\n"
}