{
    "summary": "#\n\n##\n\n\n\n\n\n\n\n##  \n\n##  \n\n##  \n\n###\n\n\n\n\n\n\n\n# smaller event Packages\n\n## Under 100 Guests\n\n\n\n### Beer and Wine Bartending Service\n\nHorse Trailer Bar\n\n5 hours of Bartending Service\n\n1-2 Bartenders\n\nGeneral & Liquor Liability Insurance\n\nAll ice for chilling and consumption\n\nMix & Match Vintage Glassware\n\n1 hour FREE Alcohol Shopping Consultation!\n\n **$1075**\n\n ** _*this does not include any alcohol_**\n\n ** _*we do NOT offer keg service at this time._**\n\n### BEER, WINE & FULL BARtending service\n\nHorse Trailer Bar\n\n5 hours of Bartending Service\n\n1-2 Bartenders\n\nGeneral & Liquor Liability Insurance\n\nAll ice for chilling and consumption\n\nMix & Match Vintage Glassware\n\nAll Mixers: Tonic Water, Soda Water, Coke, Diet Coke, Sprite, Ginger ale,\nJuices and anything else needed!\n\nGarnishes: Lemons, limes and oranges wedges & wheels, cherries, olives and\nanything else needed.\n\n1 hour FREE Alcohol Shopping Consultation\n\n **$1375**\n\n ** _*this does not include any alcohol_**\n\n ** _*we do NOT offer keg service at this time._**\n\n\n\n# Larger Event Packages\n\n## 100-200 Guests\n\n\n\n### Beer & Wine Service Only\n\nCamper Bar or Horse Trailer Bar\n\n5 hours of Bartending Service\n\n2 Certified Bartenders\n\nAll ice\n\nMix & Match Vintage Glassware\n\n1 hour FREE Alcohol Shopping Consultation!\n\n **$1,625**\n\n ** _*this does not include any alcohol_**\n\n### Beer, Wine & Full Bar\n\nCamper Bar or Horse Trailer Bar\n\n5 hours of Bartending Service\n\n2 Certified Bartenders\n\nAll ice\n\nMix & Match Vintage Glassware\n\nAll Mixers: Tonic Water, Soda Water, Coke, Diet Coke, Sprite, Ginger ale,\nJuices and anything else needed!\n\nGarnishes: Lemons, limes and oranges wedges & wheels, cherries, olives and\nanything else needed.\n\n1 hour FREE Alcohol Shopping Consultation!\n\n **$1,875**\n\n ** _*this does not include any alcohol_**\n\n## Is alcohol included?\n\nNO. We do not sell any alcohol out of our mobile bars.. You must supply all of\nyour beer, wine, liquor for the event. Our job is to serve your guests and\nmake sure the event is memorable.\n\nYou provide the alcohol and we provide EVERYTHING else!\n\nBUT! I can shop for you! Please ask me about this new service!\n\n* * *\n\n## How far will you travel?\n\nAt this time, we are traveling within 30-45 miles of Columbus, Ohio\n\n* * *\n\n# Reviews\n\nHere what people are saying about our service!\n\nJonathan Barnes Architecture and Design - 25th Anniversary Party\n\n### JBAD 25th Anniversary Party -  June 15, 2018\n\nWe were extremely pleased with you all at our party! You made everything so\npainless and easy. There was nothing but nice and wonderful things said about\nyou all!\n\nHonestly you seem to have it down to a science! I’m trying to find something\nto suggest and I truly cannot think of anything, we loved getting to have you\nat our party!  \n\nEmma Tappel\n\nAdministrative Assistant, JBAD\n\n\n\n\n\n\n\nWedding of Sarah and Jason\n\n### Wedding of Sarah and Jason - June 23, 2018\n\nEveryone loved the camper. Thought it was absolutely the coolest thing and set\nup. Everyone raved over how nice and efficient you guys were!   One of the\nbiggest hits of the night and I can’t thank you enough!!!\n\n-Sarah\n\n### House Party at the Ryan's -August 18th 2018\n\nSunshine Wine Mobile Bar was the best party we have had with our friends!  It\nwas so easy to work with Christine Leonard and her bringing all the amenities!\nShe pulled up in the driveway, set up and all ready to start serving the\nguests wonderful drinks. We will have the Sunshine Wine Mobile Bar back again\nnext summer!\n\n-Sarah Ryan\n\n\n\n# …more reviews\n\n\n\n\n\nJulliette and Eddie\n\n### September 13th, 2020\n\nChristine was so great to work with. She offers very flexible bartending\nservices. We used the horse trailer for our barn wedding and it was so cute!\nOur guests loved the experience she provided too. She always responded quickly\nto our questions and was patient with us as we made changes. - Julliette\n\n\n\n### September 2019\n\nThe cutest addition to our wedding!! Christine was beyond helpful and so kind.\nSo many compliments from our guests and such a unique touch to our reception.\nCould not recommend enough! - Kayla\n\n\n\n### September 19th, 2020\n\nThank you for being a part of our wedding. It was amazing. We received so many\ncompliments on the mobile bar, drinks and how kind the bartenders were!! -\nMichaela\n\n\n\n### **Mobile Bar Sunshine Wine Launches This Month  **\n\n### February 12, 2018 11:52 am\n\nThe mobile business isn’t just for food trucks anymore; liquor, beer and wine\nhave entered the scene. Although state law has yet to catch up, mobile bars\nlike Sunshine Wine, which launched just this month, are now available for\nbooking at corporate parties, weddings, and other private events. Should\nSunshine Wine owner Christine Leonard break through the legal barriers, even\nmore opportunities for the new business model could open up within the next\nfew years.\n\nLeonard first conceptualized her business last May, imagining a vintage camper\nsupplying liquor, beer and wine for rural weddings on outdoor farms and in\nbarns. Because liquor licenses are currently unavailable for mobile\nbusinesses, booking Sunshine Wine means customers will purchase their own\nbeverages, and Leonard will bring the supplies and bartenders to fulfill the\nservice. Events also must take place on private property or with the property\nowner’s permission. That all might change, though, as Leonard is currently\nworking to change Ohio law.\n\n“Liquor control, they know, the state knows it’s coming, so we’re just trying\nto get ahead of it and craft it so that it not only meets my needs but also\njust is smart for the state,” Leonard said. “We’re just trying to make the\npermit make sense so it’s better for everybody.”\n\nAlthough no names were disclosed, Leonard is currently working with someone\nformerly with the Ohio Division of Liquor Control, who’s a liaison between\nLeonard and the legislature. Conversations are just starting to happen, but\nLeonard said everything should come together in another year or so.\n\nCurrently in phase one of her business, Leonard hopes that by the time\nlegislation passes, she’ll have an entire Sunshine Wine fleet, with a second\ncamper and a horse trailer to complete it. She’s been in the hospitality\nbusiness since college, cooking at and managing restaurants, and currently\nselling beer and wine for Natural-State Wine and Craft Beer. And, on her own\ntime, she’s always been the host of all the parties — it’s all led her to this\nmoment in her career.\n\n“One thing has just kind of led to the next thing, and this is probably the\nmost exciting and most fun new venture for me,” Leonard said. “I enjoy hosting\nparties of my own, too, so I have a lot of party gear. It just kind of made\nsense.”\n\n### Lauren Saga\n\nLauren Sega is a staff reporter for Columbus Underground covering political\nissues on the local, state and national levels, as well as local food and\nrestaurant news. She grew up near Cleveland, graduated from Ohio University's\nScripps School of Journalism, and loves running, traveling and hiking.\n\n\n\n### **Have wine will travel: Rolling, rentable bar hits the road**\n\n614NOW  February 14, 2018\n\nThe theory of Sunshine Wine is about as whimsical as its name. This teeny,\nmobile bar service for hire is your ticket to boozing up your outdoor\nevent—the only hitch is the state doesn’t allow liquor licenses for mobile\nbusinesses.\n\nYet.\n\nRight now, you can rent Sunshine Wine and they’ll provide you with a\nbartender, plastic or glassware, napkins, mixers, and non-alcoholic beverages.\nYou are responsible for supplying the alcohol, that is, until Sunshine Wine\ncan get Ohio law to change. The owner Christine Leonard expects Ohio liquor\nlaws to accommodate rollin’ booze bizzes within a year or so, she told\nColumbus Underground. By that time, Leonard hopes to have a second camper and\na horse trailer to fill out her Sunshine Wine fleet.\n\n> “We take care of serving your guests out of our camper, clean up and leave\n> without a trace,” reads the website. “Leave the work to us, we know what\n> we’re doing and we love doing it!”\n>\n>  \n\n\n\n###  \n_Please contact me anytime to inquire about reserving our services_\n\n###  _614.204.8359_\n\n###  _or_\n\n###  _christine.sunshinewine@gmail.com_\n\nBack To Top\n\nMobile Bar Sunshine Wine Launches This Month\n\nWelcome\n\nPowered by Squarespace\n\n­\n\n­\n\n",
    "links": "[{\"link\": \"https://www.sunshinewinebar.com/\", \"text\": \"\"}, {\"link\": \"https://www.sunshinewinebar.com/\", \"text\": \"website\"}, {\"link\": \"https://www.sunshinewinebar.com/\", \"text\": \"\"}]"
}