{
    "summary": "top of page\n\nMIXOLOGY INCORPORATED\n\nSpecializing in the Art of Mixology\n\n  * Home\n\n  * What We Offer\n\n  * Contact\n\n  * About\n\n  * What We Offer\n\n  * Events_Multiple\n\n  * Our Drinks\n\n  * Image\n\n  * More\n\nUse tab to navigate through the menu items.\n\n# WELCOME TO MIXOLOGY INCORPORATED!\n\nCourses, mobile baretending, rentals and more!\n\nHome: Welcome\n\n## OUR HISTORY\n\nAbout This Vendor\n\nThe Perfect Cocktail of Expertise and Exuberance\n\nMixology Incorporated is a mobile beverage and bartending company based in\nCleveland, OH, and specializes in wedding events. The expert team comprises\nversatile mixologists and experienced bar staff who delight in elevating the\nambiance at any celebration.\n\n  \n\nMixology Incorporated was founded by Paula Stewart over five years ago and in\nthat time she has garnered a dedicated team of cocktail connoisseurs. Her\nmission is to combine delicious drinks with vibrant presentations in the form\nof colorful concoctions. Together with her enthusiastic team, she delivers\npremium service at corporate events, private parties, and special occasions.\n\n  \n\nTo-be-weds can treat their guests to signature selections and lavish libations\nat their cocktail hour and reception also they can collaborate with Paula to\ncurate a menu that complements their tastes and their wedding vibe.\n\n  \n\nAn eclectic selection of refreshments is available with Mixology Incorporated.\nYou can choose to serve beer, wine, cocktails, non-alcoholic options, and fine\nliquors at your soirée. Every detail is customized to customer’s preferences,\nfrom mouth-watering flavors to aesthetically-pleasing displays. Whether you\ndesire a dessert-style creation complete with cream and cherries or a fruity\nblend to tantalize tastebuds, these professionals will curate the perfect mix.\n\nContact\n\nHome: About\n\n## SERVICES\n\n### Mobile Bartending Services\n\nLocal Favorite\n\nRated in the top 5% of wedding vendors in the nation, we have a staff that is\nready to exceed your expectations for your special day\n\n### Elegance table\n\nA True Classic\n\nSkip the bartender and request a customized elegance table guaranteed to wow\nyour guest. this table can come with cocktails or mocktails for our non\ndrinkers. we also offer a smoke show that will leave your event the talk of\nthe town! Request a consultation today\n\n### Add Ons\n\nSimple and Special\n\nChampagne walls, Champagne fountains and shooter towers are just a few things\nyou can add to your special event\n\nHome: Our Drinks\n\n## Margarita bar\n\nLocal Favorite\n\nIt’s always Margarita time. Sit back and watch our professional bartenders as\nthey mix, shake and pour this delicious drink into your glass. Now sip it\nslowly and enjoy. many flavors to choose from\n\n## Paint and Sip\n\nFun At Our Office\n\nBook a fun evening at the office with you and a few friends. We will provide\neverything you need for a very fun paint and sip\n\n## Mix and Sip\n\ndrink making party\n\nGrab the crew and learn 2-4 drinks in 2 hours! This is a party for all! A\nperfect way to celebrate birthdays or to just do something different in the\ncity! You can bring in food. We will provide the music!\n\n## The Ultimate Ladies Night\n\nLocal Favorite\n\nGrab some girls and party with Pure Romance by Tiffany Mattox and Mixology\nincorporated! Its a party like no other! choose a theme for your night or let\nus recommend some ideas for you! a great way to bond with your girls!\n\n## Mixology kids and Teens\n\nA True Classic\n\nfrom signature sundae bars to mocktails, lemonade stands and signature hot\nchocolate and apple cider bars! Our kids has something for every season for\nall of your kid and teen parties! book a kid or Teen tender for you childs\ngraduation party, birthday party and more! we have bouncy houses, cotton candy\nmachines, snow cone machines, popcorn machines, characters and more!\n\n## Bar training\n\nUpgrade your space\n\nFrom Sylks to Bartini factory, showcase bar and grill and many more  \nlet us come and train your staff and create you your own signature coctail\nmenu TODAY!  \nrequest your consultation\n\nHome: Our Drinks\n\nHome: Our Drinks\n\nHome: Image\n\nNo upcoming events at the moment\n\nHome: Events_Multiple\n\n## CONTACT US\n\nFollow us on Instagram  \n@mixology_incorporated  \n@theschoolofmixology  \n@mixologyinckids\n\n1647 Lee rd  \nCleveland Heights Ohio 44118\n\ninfo@mysite.com\n\n  *   *   * \n\nName\n\nEmail\n\nPhone\n\nAddress\n\nSubject\n\nMessage\n\nSubmit\n\nThanks for submitting!\n\nHome: Contact\n\nHome: Opening Hours\n\nFollow\n\n  *   *   * \n\n©2023 by Mixology Incorporate. Proudly created with Wix.com\n\nbottom of page\n\n",
    "links": "[]"
}