{
    "summary": "top of page\n\n216-469-2619\n\n## Call to Schedule Your Event!\n\n  * Professional Bartending Services\n\n  * Corporate Events & Private Parties\n\n  * Serving All of Greater Cleveland\n\n## Now Hiring ALL Positions for  \nWhiskey Island Marina\n\nSee Application Instructions\n\n  * Home\n\n  * Whiskey Island Employment\n\n  * Corporate Events & More\n\n    * Whiskey Island Corporate Events\n    * Private Parties\n    * In-Home Events\n    * Event Centers\n  * Specialty Drink Menus\n\n  * Our Staff\n\n  * Contact\n\n    * Plan Your Event\n    * About Us\n  * More\n\nUse tab to navigate through the menu items.\n\n# In-Home Private Parties\n\n## Entertaining in your home is the very definition of hospitality.\n\n##  \n\n## You have created the atmosphere, now relax and enjoy it while we provide\nhospitality to you and your\n\n## guests alike.\n\n##  \n\nYou deserve it! Your guests want to spend time with you! A casual party for 20\nor a backyard wedding with 200+, we understand the stress involved when\nentertaining large groups in your home. Especially if you entertain often for\nholidays and social occasions, once you've had the experience of working with\na private event bartender you will wonder how you ever managed before.\n\n\n\nOur experience working behind full functioning bars allows us the insight to\nhelp you set up your in-home bar area with the best efficiency and ease of use\neven when not in proximity to sinks or drainage, keep your beverages cold and\nhelp to avoid messy cleanups.\n\n\n\nOur bartenders will arrive at your home prepared with basic bartending tools\nincluding a shaker, mixing glass, wine key and bottle opener and our attire is\nalways based on the tasteful formality or theme of your event.\n\n\n\nPlan Your Event!\n\nMore About Specialty Drink Menus\n\nIt is our pleasure to help you plan your trip to the liquor store for basic\nalcohol choices and necessities! Learn more about our option to create a\nspecialty drink menu for your event by clicking the link MORE ABOUT SPECIALTY\nDRINK MENUS. Collaborating with our clients about the tastes and preferences\nof their guests is as enjoyable for us as it will be for you! We are always\nexcited to share our product knowledge and introduce clients to the many new\nand exciting products on the market. Commemorate your event with a unique\ncocktail created especially for your family and friends!\n\n## Navigating the Liquor Store\n\nThe trick to navigating the liquor store is planning! There are thousands of\ndifferent wines and spirits, mixes and garnishes! to choose from!\n\n\n\n\n\n\n\n\n\n## Common Questions:\n\nWhat should I serve? Beer, wine, mixed drinks?\n\n\n\nHow much of each should I buy to accommodate my guest list?\n\n\n\nWhat's the difference in brands & price and does it really matter?\n\n\n\nHow much liquor should I buy for drinks like margaritas?\n\n\n\nHow much and what types of juice and soda should I offer?\n\n\n\nIs it better to buy smaller quantities or liters?\n\n\n\nHow much ice do I need?\n\n\n\nWhat types of garnishes do I need and how much?\n\n\n\nWhat type of glassware and how many?\n\nWhen you hire a Cleveland Event Bartender we will assist you with setting up a\nbasic bar within your specified budget to accommodate your specified number of\nguests and provide answers to the most common question about setting up a home\nbar.\n\n© 2014-2024 by Cleveland Event Bartenders\n\n  * \n\nbottom of page\n\n",
    "links": "[{\"link\": \"https://www.clevelandeventbartenders.com/in-home\", \"text\": \"In-Home Events\"}]"
}