{
    "summary": "Skip to main content\n\n  * Subscribe\n\nOpen Navigation Menu\n\nMenu\n\nStory Saved\n\nTo revisit this article, visit My Profile, then View saved stories\n\nClose Alert\n\n  * Fashion\n  * Grooming\n  * Culture\n  * Watches\n  * Recommends\n  * Lifestyle\n  * GQ Sports\n  * Fitness\n  * MOTY\n\nOpen Navigation Menu\n\nMenu\n\nStory Saved\n\nTo revisit this article, visit My Profile, then View saved stories\n\nClose Alert\n\n  * Subscribe\n\nGet 3 issues of GQ for £1SUBSCRIBE NOW\n\n  * Search\n  * Subscribe\n  * Newsletter\n\n  * Fashion\n  * Grooming\n  * Culture\n  * Watches\n  * Recommends\n  * Lifestyle\n  * GQ Sports\n  * Fitness\n  * MOTY\n\n  * Cars\n  * Food & Drink\n  * Tech\n  * Politics\n  * GQ Sports\n  * GQ Shops\n  * MOTY\n  * GQ Video\n  * GQ Heroes\n\nFollow us\n\n  * Facebook\n\n  * Instagram\n\n  * X\n\n  * YouTube\n\n  * VERO\n\nFitness\n\n# How compression sportswear actually works\n\nCompression sportswear is a modern miracle. It builds confidence, helps you\nrecover from injury and makes you work harder... and the advantages don’t end\nwith fitness, says GQ’s snugly fitted scribe\n\nBy Tony Parsons\n\n3 August 2020\n\nIvan Ryabokon / Alamy Stock Vector\n\nCompression sportswear is nipple-crunching, stomach-flattening, scrotum-\nlifting, -buttock- clenching, spine-straightening tight. As tight as a full-\nbody condom. As tight as the Dark Knight’s underpants. Tighter than anything\nyou have ever worn in your life. Once only seen on elite -athletes,\ncompression sportswear is suddenly turning up everywhere.\n\nThe weekend runner in the park, the commuter cyclist hurtling through a red\nlight, the weekend footballer who would not dream of wearing a jockstrap under\nhis shorts – you see skintight compression sportswear -everywhere these days,\non ordinary gym rats as much as elite athletes. And whatever else it may do,\nthere’s no doubting that just putting on compression sportswear seriously\nchanges your mood. “There’s no room for punks in suits,”says Aaron Taylor-\nJohnson in _Kick-Ass 2_. “Just real heroes. Who can really kick ass.”\n\nCompression sportswear is empowering, enabling. You put it on and you\nimmediately banish your inner Clark Kent and embrace your secret Superman. You\ncan’t slob out on the sofa in compression sportswear. You peel it on – it can\ntake a while – and don’t feel like ordering a takeaway pizza and turning on\nthe football. Not in gear so tight that it literally changes your posture.\n\n“Go harder, go longer, go again,” it says on the box my Skins compression kit\ncame in and you never doubt that you will. Donning compression sportswear will\nnot turn you into Usain Bolt. It will not mean you are never -physically\nexhausted. But you will be energised, in both your body and mind. It makes you\nfeel better – about everything. Even if you are only going to the gym, you\nwill look at yourself in a full-length mirror and feel, quite frankly, like\nfighting evil.\n\nMy knee went. That is how I came to compression sportswear. Desperate,\nlimping, frustrated that strained medial ligaments in my knee had sent my\nusual training routine right out the window. And afraid that this is what my\nfuture looked like.\n\nSo I tried compression gear. I looked like a Stan Lee character – but my knee\ngot better\n\nYou have to learn to listen to your body. That is the great secret to managing\nthe cruel passage of time. Listen to your body and it will tell you when it\nneeds rest, when it needs ice, when it needs to be stretched. Listen to your\nbody and you will live long and have a good-looking corpse. And my body told\nme – you should start wearing that compression sportswear.\n\nWe already know that compression is crucial for any soft-tissue injuries.\nThere it stands in the acronym RICE – rest, ice, compression and elevation.\nThe compression kit that you can buy from specialists such as Skins, Under\nArmour, 2XU, Zensah and Lurbel, or indeed Nike and Adidas, is not exactly the\nsame as the compressionwear doctors recommend after surgery because some of\nthat stuff is so tight that it requires a prescription. But the principle\nremains exactly the same.\n\nPressure reduces inflammation, increases blood circulation, lessens lactic\nacid and improves recovery rate. So I tried compression gear – socks at first,\nthen shorts, then a T-shirt, then a long-sleeve shirt and pants. I looked like\na Stan Lee character. But my knee got better.\n\nMany are the fads and fashion of sportswear. Liverpool’s Robbie Fowler once\nwore an anti-snoring nose plaster, all the better to open his nasal passages.\nArsenal’s Patrick Vieira once took to the pitch with a dollop of vapour rub\nstaining the front of his shirt to help those midfielder’s muscles get as much\noxygen as possible. But what footballer wears a nose plaster on his hooter\nthese days? And who sticks vapour rub on their shirt now? Until compression\ncame along, the most successful sportswear trend in recent years was Kinesio\ntape – those strips of often brightly coloured tape that are meant to relieve\npain and ease muscles in movement. Invented by a Japanese doctor called Kenzo\nKase 30 years ago, it was enormously popular with footballers. Mario Balotelli\nwore Kinesio tape on his back, David Beckham wore it on his ribs and Gareth\nBale wore it on his thighs when he was at Spurs. And at London 2012, it was\nall over the aching limbs of the track and field athletes. Today’s hot\nsportswear fad can quickly become yesterday’s lukewarm fashion accessory.\nFowler’s nose plaster and Vieira’s vapour rub now look as fanciful as Eric\nCantona wearing his shirt collar turned up or John Terry sporting his socks\nabove his knee, a moment in time as fleeting as footballers in Alice bands,\nsnoods and headbands.\n\nCompression sportswear is a bit different because the science behind it has\nbeen around for almost a century. And it was developed not to enable superstar\nsportsmen. But to heal the sick.\n\nFrom the middle of the 20th century, doctors and physicians used compression\ngarments to treat patients who were recovering from surgery, fractures, burns,\nlymphedema, arthritis, varicose veins and deep vein thrombosis. For more than\n60 years, the world has known the benefits of compression. And then somebody\nsmart asked - if it works for the infirm, then why wouldn’t it work for the\nfit?\n\nCompression sportswear really began life in 1987 when a study in the American\nJournal Of Physical Medicine by two doctors called Michael J Berry and Robert\nG McMurray revealed that athletes wearing -compression stockings recovered a\nlot faster than -athletes not wearing compression stockings.\n\nToday an Olympic athlete in his physical prime and the pensioner who just had\nsurgery on his varicose veins wear compression stockings for the same reason –\nto get the blood pumping and to aid recovery. The athletes who demand the most\nfrom their bodies became the poster boys and girls of compression sportswear –\nlong-distance runners, cyclists and triathletes. Especially triathletes.\n\nNowhere has compression sportswear made such an impact as among the elite\nendurance athletes of the ironman triathlon, where they are so fit that a\n2.4-mile swim, a 112-mile bike ride and a full marathon of 26.2 miles is their\nidea of just one event. “Compression garments have infiltrated endurance\nsports,” reported triathlete.com. “Triathletes of all levels are wearing the\nskintight pants, socks, tops and sleeves.”\n\nAnd does it really work? Nobody doubts that compression aids recovery, but\ndoes it really improve -performance? “What makes it tough is it’s so\nsubjective,” says professional triathlete Andy Potts, who wears it both during\nand after races.\n\n“Personally, I notice a difference. I started wearing it in 2008 for recovery.\nPutting the socks on after pushing so hard is part of the process, one of the\ntriggers to relax.”\n\nWhen you see ironman competitors, the toughest and fittest athletes on the\nplanet, almost all of them squeezed into compression sportswear, it is\ndifficult to doubt the benefits. But beyond the triathlon community,- there\nare plenty of top athletes who use it simply as an aid to recovery. Andrew\nOsagie, London 2012 Olympic 800m finalist, wears calf-length compression socks\nbetween races, not during them.\n\n“When I’m competing, I wear them between rounds but otherwise it’s usually\nonly after intense training -sessions,” says Osagie. “I will put them on as\nsoon as possible after competing or training and will keep them on for as long\nas possible, taking them off before I go to bed. The main benefit I feel is\nthat my legs don’t feel as heavy. I never wear them during training. When I\ndid use them I seemed to get more tired towards the end of my sessions. That\nsaid, I think they are great for recovery.”\n\nAt London 2012, the Australian equestrian team put their horses in brightly\ncoloured compression wear when they were back at the stables. Olympic gold\nmedallist Stuart Tinney said, “I am confident it helps the horses’ muscles\nrelax and recover after exercise.”\n\nIt works best if you believe it works. And believing is the most powerful\nthing in the world\n\nAustralians love compression – Skins and 2XU are both Australian companies –\nbut one Aussie study said, “While the theoretical effects [of compression\nsportswear] have been shown in trials, this doesn’t -necessarily translate\ninto better performance. However, many people love the feel of them – the feel\nof the material- and the pressure on the skin, as well as the feeling of\nsupport and reduced ‘wobble’. Anecdotally, many people who try them find they\nprovide a performance boost and they feel better afterwards.”\n\nMost Popular\n\n  * Fashion\n\nOf course, Ben Affleck owns the Air Jordan 4 SE ‘Black Canvas’\n\nBy Adam Cheung\n\n  * Fashion\n\nThe Air Jordan 3 ‘Green Glow’ is a soft reboot of an '80s classic\n\nBy Adam Cheung\n\n  * Culture\n\nClitoris light-switches, hybrid animals and brain slices: How the bizarre,\nbeautiful world of _Poor Things_ was made\n\nBy Xuanlin Tham\n\n  * \n\nThis kit works best if you believe it works. And -believing is the most\npowerful thing in the world.\n\nEvery vision of tomorrow’s world over the last century has imagined future\nwoman dressing like Lieutenant Uhura, and future man looking like a superhero.\nWhen it comes to retro--futurism, nipple-crushing clothes are more of a cliché\nthan flying cars. And as compression sportswear enters the mainstream, it\nsuddenly feels like the future is here. Shaun Ryder and the Happy Mondays got\nit wrong. Don’t need no baggies in my wardrobe today. It’s got to be a tight\nfit.\n\nBut a perfect fit is crucial. The manufacturer Skins is meticulous about\nmaking sure you have the correct degree of pressure, and one blogger warned,\n“A compression garment that exerts too much pressure may constrict blood flow\nso you must make sure that you are wearing a garment that is the right size\nfor you and that has the technology necessary to apply a gradient and\ncontrolled level of compression. If you are wearing a compression garment and\nthe area under the garment feels numb, starts turning cold or turns blue,\n-discontinue use immediately.”\n\nCompression sportswear is a bit like drugs. If you find yourself or a\ncompanion turning blue, then something bad is happening. You have to get over\nyour shyness to wear this stuff. There’s definitely a blush barrier to break\nthrough. Even after carefully calibrating the correct size, it still looks\nimpossibly, ridiculously- small when you first take it out of the box.\nSuddenly dressing like a superhero is not something any man can do lightly.\nYou have to peel it on, like putting on a pair of tights. This is not\nsomething that comes -naturally to most men.\n\nAnd compression sportswear is not exactly comfortable. But it is enormously\nflattering. Rather than -emphasising your little physical defects, it smooths\nthem down, lifts them up and packs them in. The first time you see yourself in\nfull-body compression gear will not be a disappointing moment. I now wear it\nwhen working, finding that it sharpens my mind, keeps me focused and more\nimmersed in the moment. And oh yes – it does give you enormous erections.\n\nForget Viagra and Cialis. If you want erections that you can hang your hat on,\nthe kind of unbidden boner you got around the time of your GCSEs, then nothing\nbeats compression sportswear and the absurdly -invigorating effect it has on\nyour blood circulation.\n\nThe improved blood circulation you get with -compression sportswear means\nbetter brain function, enhanced cell growth and upgraded organ function –\nincluding the most vital organ of all. Now every man can be a superhero. But\nis that a batphone in your pocket or are you just pleased to see me?\n\nNow read\n\n **Fitness experts on the best home workouts to keep you motivated**\n\n **How to change your nutrition while working out from home**\n\n **Experts on the best arm exercises to keep in shape**\n\nKeywordsLifestyleFitness\n\nRead More\n\nShopping\n\n31 clothing essentials for every man’s wardrobe\n\nMen’s clothing essentials: Give your wardrobe a firm foundation with these 31\ntimeless menswear essentials\n\nBy Aaron Toumazou\n\nShopping\n\nThe best finds from the men’s fashion sales this week\n\nIt takes a seasoned shopper to effectively navigate the men’s sales racks.\nHere’s what’s in GQ’s basket\n\nBy Heidi Quill\n\nFashion\n\nThe fraught, frenzied, maybe impossible race to build a sustainable sneaker\n\nFrom carbon-neutral wool to freaky fruit leathers and emission-eating\noutsoles, it feels like every footwear brand is fighting to build the world’s\nmost sustainable shoes. Are any of their solutions actually better?\n\nBy Oliver Franklin-Wallis\n\nShopping\n\nThe best jeans for men, from skinny fit to wide leg\n\nGQ’s pick of the best jeans for men to form the foundation of your everyday\nlook. Those dark indigo selvedge jeans hanging in your wardrobe are superb,\nbut there’s a whole new wave of denim out there\n\nBy Heidi Quill\n\nShopping\n\nThe best running gear for 5Ks, marathons and everything in between\n\nWhether you're a seasoned pro or a beginner runner, making sure you have the\nright gear is essential. From the best running shoes to our favourite running\nbrands and some training basics, consider this your go-to guide for everything\nrunning.\n\nBy Daphne Bugler\n\nFitness\n\nThe best running brands to make a catwalk of your next parkrun\n\nFrom Nike and Adidas to Hoka, Satisfy, Brooks and more, these are the best\nrunning brands to take you from the start line to the finish line quickly,\ncomfortably and stylishly\n\nBy Lucy Gornall\n\nShopping\n\nThe best January sales for a New Year bargain\n\nThe January sales are in full swing, with discounts on everything from\ndesigner clothing and trainers to homeware, mattresses, gadgets and fitness\nkit. Get 2024 off to a flying start with GQ's pick of the best January sales\nto shop\n\nBy Jessie Atkinson\n\nCulture\n\nHere are the ultimate must-read books of 2024\n\nFrom high concept sci-fi murder mysteries to Miranda July’s first novel in a\ndecade, here are GQ's 2024 picks\n\nBy Daisy Jones\n\n  * Facebook\n\n  * Instagram\n\n  * X\n\n  * YouTube\n\n  * VERO\n\nSee More Stories\n\n  * Fashion\n  * Grooming\n  * Culture\n  * Watches\n  * Recommends\n  * Lifestyle\n  * GQ Sports\n  * Fitness\n  * GQ Heroes\n  * Gift Guides\n\nCondé Nast Britain\n\n  * CN Traveller\n  * Glamour\n  * House & Garden\n  * Johansens\n  * Tatler\n  * Vanity Fair\n  * Vogue\n  * Wired\n  * World of Interiors\n\n  * Privacy Policy & Cookie statement\n  * Code of conduct\n  * Terms & Conditions\n  * Contact\n  * Editorial Complaints Policy\n  * Careers\n  * Newsletter\n  * Subscribe\n  * Manage Preferences\n\n© 2024 Condé Nast\n\n###### Select international site\n\nBritainLargeChevron\n\n  * Australia\n  * Brasil\n  * China\n  * España\n  * France\n  * Germany\n  * India\n  * Italia\n  * Japan\n  * Korea\n  * México\n  * Middle East\n  * Portugal\n  * South Africa\n  * Taiwan\n  * Thailand\n  * Türkiye\n  * United States\n\n## We Care About Your Privacy\n\nWe and our 150 partners store and/or access information on a device, such as\nunique IDs in cookies to process personal data. You may accept or manage your\nchoices by clicking below, including your right to object where legitimate\ninterest is used, or at any time in the privacy policy page. These choices\nwill be signaled to our partners and will not affect browsing data.More\ninformation about your privacy\n\n### We and our partners process data to provide:\n\nUse precise geolocation data. Actively scan device characteristics for\nidentification. Store and/or access information on a device. Personalised\nadvertising and content, advertising and content measurement, audience\nresearch and services development.  List of Partners (vendors)\n\nI Accept\n\nShow Purposes\n\n",
    "links": "[{\"link\": \"https://www.gq-magazine.co.uk/\", \"text\": \"\"}, {\"link\": \"https://www.gq-magazine.co.uk/subscribe\", \"text\": \"Subscribe\"}, {\"link\": \"https://www.gq-magazine.co.uk/account/saved\", \"text\": \"View saved stories\"}, {\"link\": \"https://www.gq-magazine.co.uk/fashion\", \"text\": \"Fashion\"}, {\"link\": \"https://www.gq-magazine.co.uk/grooming\", \"text\": \"Grooming\"}, {\"link\": \"https://www.gq-magazine.co.uk/culture\", \"text\": \"Culture\"}, {\"link\": \"https://www.gq-magazine.co.uk/watches\", \"text\": \"Watches\"}, {\"link\": \"https://www.gq-magazine.co.uk/shopping\", \"text\": \"Recommends\"}, {\"link\": \"https://www.gq-magazine.co.uk/lifestyle\", \"text\": \"Lifestyle\"}, {\"link\": \"https://www.gq-magazine.co.uk/sport\", \"text\": \"GQ Sports\"}, {\"link\": \"https://www.gq-magazine.co.uk/fitness\", \"text\": \"Fitness\"}, {\"link\": \"https://www.gq-magazine.co.uk/tags/men-of-the-year\", \"text\": \"MOTY\"}, {\"link\": \"https://www.gq-magazine.co.uk/account/saved\", \"text\": \"View saved stories\"}, {\"link\": \"https://www.gq-magazine.co.uk/\", \"text\": \"\"}, {\"link\": \"https://www.gq-magazine.co.uk/subscribe\", \"text\": \"Subscribe\"}, {\"link\": \"https://www.gq-magazine.co.uk/search\", \"text\": \"Search\"}, {\"link\": \"https://www.gq-magazine.co.uk/subscribe\", \"text\": \"Subscribe\"}, {\"link\": \"https://www.gq-magazine.co.uk/newsletters\", \"text\": \"Newsletter\"}, {\"link\": \"https://www.gq-magazine.co.uk/fashion\", \"text\": \"Fashion\"}, {\"link\": \"https://www.gq-magazine.co.uk/grooming\", \"text\": \"Grooming\"}, {\"link\": \"https://www.gq-magazine.co.uk/culture\", \"text\": \"Culture\"}, {\"link\": \"https://www.gq-magazine.co.uk/watches\", \"text\": \"Watches\"}, {\"link\": \"https://www.gq-magazine.co.uk/shopping\", \"text\": \"Recommends\"}, {\"link\": \"https://www.gq-magazine.co.uk/lifestyle\", \"text\": \"Lifestyle\"}, {\"link\": \"https://www.gq-magazine.co.uk/sport\", \"text\": \"GQ Sports\"}, {\"link\": \"https://www.gq-magazine.co.uk/fitness\", \"text\": \"Fitness\"}, {\"link\": \"https://www.gq-magazine.co.uk/tags/men-of-the-year\", \"text\": \"MOTY\"}, {\"link\": \"https://www.gq-magazine.co.uk/cars\", \"text\": \"Cars\"}, {\"link\": \"https://www.gq-magazine.co.uk/food-drink\", \"text\": \"Food & Drink\"}, {\"link\": \"https://www.gq-magazine.co.uk/technology\", \"text\": \"Tech\"}, {\"link\": \"https://www.gq-magazine.co.uk/politics\", \"text\": \"Politics\"}, {\"link\": \"https://www.gq-magazine.co.uk/sport\", \"text\": \"GQ Sports\"}, {\"link\": \"https://www.gq-magazine.co.uk/gq-shops\", \"text\": \"GQ Shops\"}, {\"link\": \"https://www.gq-magazine.co.uk/tags/men-of-the-year\", \"text\": \"MOTY\"}, {\"link\": \"https://www.gq-magazine.co.uk/video\", \"text\": \"GQ Video\"}, {\"link\": \"https://www.gq-magazine.co.uk/partnerships/gq-heroes\", \"text\": \"GQ Heroes\"}, {\"link\": \"https://www.gq-magazine.co.uk/profile/tony-parsons\", \"text\": \"Tony Parsons\"}, {\"link\": \"https://www.gq-magazine.co.uk/tags/lifestyle\", \"text\": \"Lifestyle\"}, {\"link\": \"https://www.gq-magazine.co.uk/tags/fitness\", \"text\": \"Fitness\"}, {\"link\": \"https://www.gq-magazine.co.uk/\", \"text\": \"\"}, {\"link\": \"https://www.gq-magazine.co.uk/fashion\", \"text\": \"Fashion\"}, {\"link\": \"https://www.gq-magazine.co.uk/grooming\", \"text\": \"Grooming\"}, {\"link\": \"https://www.gq-magazine.co.uk/culture\", \"text\": \"Culture\"}, {\"link\": \"https://www.gq-magazine.co.uk/watches\", \"text\": \"Watches\"}, {\"link\": \"https://www.gq-magazine.co.uk/shopping\", \"text\": \"Recommends\"}, {\"link\": \"https://www.gq-magazine.co.uk/lifestyle\", \"text\": \"Lifestyle\"}, {\"link\": \"https://www.gq-magazine.co.uk/sport\", \"text\": \"GQ Sports\"}, {\"link\": \"https://www.gq-magazine.co.uk/fitness\", \"text\": \"Fitness\"}, {\"link\": \"https://www.gq-magazine.co.uk/tags/gq-heroes\", \"text\": \"GQ Heroes\"}, {\"link\": \"https://www.gq-magazine.co.uk/collection/gift-guides\", \"text\": \"Gift Guides\"}, {\"link\": \"https://www.gq-magazine.co.uk/article/contact-us\", \"text\": \"Contact\"}, {\"link\": \"https://www.gq-magazine.co.uk/newsletters\", \"text\": \"Newsletter\"}, {\"link\": \"https://www.gq-magazine.co.uk/subscribe\", \"text\": \"Subscribe\"}]"
}