{
    "summary": "  * Home\n  * Cars for Sale \n    * Used Cars for Sale \n    * New Cars for Sale \n  * CARFAX Reports\n  * My Car Maintenance \n    * Find a Service Shop \n    * Track Your Car's Maintenance \n  * Used Car Values\n  * Research\n  * Help\n\nLog In  Sign Up\n\n# Free Car Maintenance Tracker\n\n## Access vehicle history, get service reminders & more!\n\nSign Up for Free  Log In\n\n### Everything you need to maintain your car and preserve its value in one\nconvenient place.\n\n  * Open Recall Alerts\n\nBe the first to know about open recalls for your car.\n\n  * Service Reminders\n\nKeep your vehicle well maintained with timely service reminders.\n\n  * Vehicle Service History\n\nAutomatically track and store your service history in one place.\n\n  * Trusted Service Shops\n\nFind trusted service shops near you based on verified reviews.\n\n  * History Based Value\n\nKnow the value of your car so you can make smart ownership decisions.\n\n### Download the Car Care mobile app today!\n\n#### The reminders, history, and tools to manage your car, all at your\nfingertips.\n\n### What People Are Saying\n\n> Really great seeing what happened & what is coming up!\n>\n> 5.0\n>\n> I am happy that CARFAX keeps track of all the services, registration, tire\n> rotation and more which gets lost in time. It is really great to see what\n> has happened and what is coming up! Thank you!!\n>\n> JamesOfScotland\n\n> Track of all our family's cars with this free app!\n>\n> 5.0\n>\n> I can keep track of all our cars in the family with this free app! Tells me\n> when service is due and if any recalls have been announced. It even shows\n> each car's trade in value. And if a registration needs to be renewed, I can\n> do it from my phone. Thanks, CARFAX!!\n>\n> GSN Girl\n\n> Car Care does all the work for you!\n>\n> 5.0\n>\n> Nice little app. It actually shows almost all of the things that have been\n> done on my car in the last 7 years. It is useful to fill in the gaps in my\n> memory.\n>\n> IOS Review\n\n> LOVE this app.\n>\n> 5.0\n>\n> Best maintenance tracker I've ever used!\n>\n> IOS Review\n\n> 7 Years of Vehicle History\n>\n> 5.0\n>\n> Automatically loaded my car info including service intervals and maintenance\n> history just off my license plate!\n>\n> Barr kids\n\n> Records my car history for me\n>\n> 5.0\n>\n> Very useful! I use to write down everything I do to the car, but with this,\n> i do not have to. It also records my car history when I go to the\n> dealership. This is a very useful app!!\n>\n> IOS Review\n\n> Keeping my car's glovebox clean\n>\n> 5.0\n>\n> Now I do not have to keep a glove box full of service receipts. I just take\n> a picture on the CARFAX app and all my records are easy to pull up.\n>\n> IOS Review\n\n> It's all right here in one place!\n>\n> 5.0\n>\n> This is so cool! And handy! I'll never struggle to remember when I need to\n> perform essential maintenance on my car cause it's all right here in one\n> place!\n>\n> Android Review\n\n> No longer bad at maintenance\n>\n> 5.0\n>\n> I'm bad about my maintenance. This app has really helped me stay on track.\n> As soon as I got the notice about my tires I was in the shop.\n>\n> IOS Review\n\n> Highly recommend for anybody!\n>\n> 5.0\n>\n> Awesome app. It has updated me on accurate maintenance history that was done\n> on my new vehicle and it keeps track of recent maintenance work I have done\n> to my vehicle for future references. Thank you CARFAX and I highly recommend\n> for anybody!\n>\n> Android Review\n\n> See maintenance from past owners\n>\n> 5.0\n>\n> I've found this application to be very useful for checking out the\n> maintenance that past owners did on the cars I've owned, allowing me to\n> determine what needed to be done.\n>\n> Josh B.\n\n> This is a game changer\n>\n> 5.0\n>\n> This app is perfect for me to track and monitor all my maintenance needs. It\n> also has all services done at dealerships. Since I can do multiple cars this\n> is a game changer.\n>\n> Douglas L.\n\nProducts\n\n  * Used Cars for Sale \n  * CARFAX Car Care \n  * CARFAX Value \n  * CARFAX Reports \n  * Sell My Car \n\nResources\n\n  * Car Research \n  * Recalls \n  * Find a Dealer \n  * Find a Service Shop \n  * Sample Report \n  * Resources \n\nAbout Us\n\n  * About CARFAX \n  * Blog \n  * Press Room \n  * Careers We're Hiring!\n  * Help Center \n\nLearn More\n\n  * CARFAX for Dealers \n  * CARFAX for Service Shops \n  * Partner with CARFAX \n  * CARFAX Banking & Insurance \n\nContact Us\n\n  * Customer Support \n  * Dealer Support \n\n© 2024 CARFAX, Inc.\n\n  *   *   *   *   *   * \n\n  * Terms of Use\n  * Privacy Statement\n  * Your Privacy Choices \n  * Ad Choices\n\nCARFAX Vehicle History products and services are based only on information\nsupplied to CARFAX. CARFAX does not have the complete history of every\nvehicle. Use the CARFAX search as one important tool, along with a vehicle\ninspection and test drive, to make a better decision about your next used car.\n\n",
    "links": "[{\"link\": \"https://www.carfax.com/Service/\", \"text\": \"\\n                  Track Your Car's Maintenance\\n                \"}, {\"link\": \"https://www.carfax.com/Service/\", \"text\": \"\\n                CARFAX Car Care\\n                \\n              \"}]"
}