{
    "summary": "__ Storage __ Search the TechTarget Network __\n\nLogin Register\n\nExplore the Network\n\n  * TechTarget Network\n  * Disaster Recovery\n  * Data Backup\n  * Data Center\n  * Sustainability and ESG\n\n  * Storage\n\n  *     * Architecture & Strategy\n    * Cloud Storage\n    * Flash \n    * Management & Analytics\n    * Primary Storage Devices\n    * More Topics __\n\n      * System & Application Software\n\nOther Content\n\n    * News\n    * Features\n    * Tips\n    * Webinars\n    * 2023 IT Salary Survey Results\n    * More __\n\n      * Answers\n      * Conference Guides\n      * Definitions\n      * Opinions\n      * Podcasts\n      * Quizzes\n      * Tech Accelerators\n      * Tutorials\n      * Videos\n      * Sponsored Communities\n\n  * Follow:\n  * __\n  * __\n  * __\n  * __\n  * __\n\n  * Home\n  * Storage architecture and strategy\n\nDefinition\n\n# cloud hosting\n\n  * Share this item with your network:\n  * __\n  * __\n  * __\n  * __\n  * __\n\n  * __\n  * __\n  * __\n    * __\n    * __\n    * __\n    * __\n\nBy\n\n  * Sonia Lelii, TechTarget\n  * Erin Sullivan, Site Editor\n\n## __What is cloud hosting?\n\nCloud hosting is the process of outsourcing an organization's computing and\nstorage resources to a service provider that offers its infrastructure\nservices in a utility model.\n\nThe cloud provider oversees the setup, cloud infrastructure, security and\nmaintenance. The provider sometimes allows clients to customize hardware and\napplications and scale servers online. Compute and storage resources are\nspread out across hundreds of virtual machines that load balance input/output\ndemands in a cloud infrastructure configuration.\n\nThe cloud hosting model is a cheaper alternative to the traditional dedicated\nserver model that requires companies to build and manage their own data\ncenters. In the traditional model, servers and storage, with dedicated\nhardware and virtual resources, reside on premises and can be a costly capital\nand operating expense for organizations.\n\n## __Cloud hosting benefits\n\nCloud hosting provides significant capital and operational savings to\norganizations because they don't have to spend a lot on the initial upfront\ncapital cost associated with owning and managing data centers. In addition,\nlong-term data retention becomes a more simplified process, eliminating the\ncostly management of disks and tape systems.\n\nCompanies using a cloud hosting service get data protection benefits such as\nhigh availability and disaster recovery. Many organizations prefer a hybrid\nmodel that mixes compute and storage resources residing on premises with\ncompute and storage in a cloud provider's environment.\n\nOne of the main benefits of using cloud hosting services is flexible and more\ncost-efficient scalability in building applications, websites and other\nservices. Because users can scale as needed, they are charged only for the\nservices they use and do not pay for any unused capacity. This payment system\nmakes cloud hosting a relatively inexpensive method of storage.\n\nBut drawbacks exist. Security issues with the cloud have gained more attention\nas the cloud adoption rate has grown. With data leaving the company data\ncenter, organizations run the risk of intellectual property theft and loss,\ncompliance violations, lack of oversight over rogue employees' actions, and\ndata breaches.\n\nAdditional aspects to consider include high availability, recovery point\nobjective and recovery time objective.\n\n## __Top vendors/providers\n\nCloud hosting services have fueled a rise in the infrastructure-as-a-service\nmodel, in which a third-party provider offers the hardware, software, servers,\nstorage and networking resources to a customer, typically with a pay-per-use\nmethod.\n\nPopular cloud hosting offerings include Amazon Web Services (AWS), the Google\nCloud Platform and Microsoft Azure. AWS is the dominant player in the market,\noffering extensive computing services and more regions and zones than other\ncloud providers. However, Azure and Google have gained traction in recent\nyears.\n\n__Categories of cloud computing services.\n\n__\n\nAmazon offers its Elastic Compute Cloud to handle compute services. S3 is\namong the AWS storage types. Google offers its Google Compute Engine and\nGoogle Cloud Storage for the enterprise. Microsoft Azure includes blob, file\nand queue storage. Its Microsoft 365 is a popular cloud service.\n\nAll three major public cloud providers offer products that support containers,\nincluding Amazon's Elastic Container Service, Google's Kubernetes Engine and\nAzure's own container services.\n\n**Editor's note:** _This article was revised in 2024 by TechTarget editors to\nimprove the reader experience._\n\nThis was last updated in January 2024\n\n####  __Continue Reading About cloud hosting\n\n  * SaaS vs. IaaS vs. PaaS: Differences, Pros, Cons and Examples\n\n####  Related Terms\n\ndedicated cloud\n\n    A dedicated cloud is a single-tenant cloud infrastructure, which essentially acts as an isolated, single-tenant public cloud. See complete definition __\nFibre Channel over Ethernet (FCoE)\n\n    Fibre Channel over Ethernet (FcoE) is a storage protocol that enables Fibre Channel (FC) communications to run directly over ... See complete definition __\nhybrid backup\n\n    A hybrid backup is typically when organizations use both on-premises storage and the public cloud as data backup destinations, ... See complete definition __\n\n####  __Dig Deeper on Storage architecture and strategy\n\n  * ##### cloud computing\n\nBy: Kinza Yasar\n\n  * ##### What is public cloud? Everything you need to know\n\nBy: Stephen Bigelow\n\n  * ##### virtual private cloud (VPC)\n\nBy: Alexander Gillis\n\n  * ##### IaaS vs. PaaS options on AWS, Azure and Google Cloud Platform\n\nBy: Chris Tozzi\n\n__Sponsored News\n\n  * Simplify Cloud Migrations with Dell and VMware –Dell Technologies\n  * A New Vision for Storage and Data Management: DataOps –HPE\n  * See More\n\n__Vendor Resources\n\n  * Multi-Cloud Kubernetes with Rancher –SUSE __\n\nLatest TechTarget resources\n\n  * Disaster Recovery ____\n  * Data Backup ____\n  * Data Center ____\n  * Sustainability and ESG ____\n\nDisaster Recovery\n\n  * __The emerging role of the chief resilience officer in BCDR\n\nBusiness continuity, disaster recovery and resilience are often managed by a\nvariety of different personnel. Appointing a chief ...\n\n  * __High availability and resiliency: A DR strategy needs both\n\nAn organization's resiliency during and after a crisis depends on many\nfactors. High availability is one aspect of overall ...\n\n  * __Build and maintain digital resilience for a stronger DR program\n\nA digital resilience program builds on existing preventive and restorative\nactivities by identifying the ways an organization's ...\n\nData Backup\n\n  * __Ransomware prevention a focus for storage stewards in 2024\n\nIn 2024, generative AI and machine learning, along with employee education,\nare important tools to prevent the spread of ...\n\n  * __Tutorial: Use Linux rsync backup to protect files\n\nRsync is a file transfer utility designed to move data from one Linux network\nhost to another, which has made it a popular option...\n\n  * __Tutorial: How to use Linux Deja Dup to back up and restore files\n\nDeja Dup isn't advertised as a backup tool, but that doesn't mean you can't\nuse it for data protection. Find out how to use Linux...\n\nData Center\n\n  * __How to manage data center water usage sustainably\n\nData centers use large amounts of water to maintain equipment. This\nconsumption is causing water pollution and scarcity. ...\n\n  * __How 2024 GenAI investment will transform data centers\n\nCompanies are quickly adopting generative AI, and with this, the focus has\nshifted toward hybrid cloud environments, which spans ...\n\n  * __Top data center infrastructure management software in 2024\n\nDCIM tools can improve data center management and operation. Learn how six\nprominent products can help organizations control ...\n\nSustainability and ESG\n\n  * __How to shrink your IT carbon footprint and why it matters\n\nOrganizations are shifting IT priorities toward efficient resource\nconsumption. Learn how strategies prioritizing sustainability ...\n\n  * __Sustainability efforts grow in IT, but challenges remain\n\nAs cloud computing and digital reliance grow, so too does the need to focus on\nsustainability. Here's a look at some of the ...\n\n  * __Regulatory requirements intensify with EU's CSRD\n\nCompanies that operate in the European Union will need to conduct more\nextensive ESG reporting in 2024 to meet requirements of ...\n\n  * About Us\n  * Editorial Ethics Policy\n  * Meet The Editors\n  * Contact Us\n  * Advertisers\n  * Partner with Us\n  * Media Kit\n  * Corporate Site\n\n  * Contributors\n  * Reprints\n  * Answers\n  * Definitions\n  * E-Products\n  * Events\n  * Features\n\n  * Guides\n  * Opinions\n  * Photo Stories\n  * Quizzes\n  * Tips\n  * Tutorials\n  * Videos\n\nAll Rights Reserved,  Copyright 2000 - 2024, TechTarget  \n  \nPrivacy Policy  \nCookie Preferences  \nCookie Preferences  \nDo Not Sell or Share My Personal Information\n\nClose\n\n",
    "links": "[]"
}