{
    "summary": "Subscribe Now\n\n0\n\nSkip to Content\n\nFeatures\n\nPricing\n\nDemo\n\nLogin  Sign Up\n\nOpen Menu Close Menu\n\nFeatures\n\nPricing\n\nDemo\n\nLogin  Sign Up\n\nOpen Menu Close Menu\n\nFeatures\n\nPricing\n\nDemo\n\nLogin  Sign Up\n\n# How to Use Instagram for Micro-blogging\n\nTools and Tech\n\nJul 14\n\nWritten By Jennifer Barcelos\n\n**If you want proof that the speed of innovation is rapidly increasing,\nconsider this:** Blogging, a communication medium that emerged in the 90s, has\nalready begun to change dramatically. Although there are still blogs that\nfocus on long-form writing, many have shifted to image-heavy designs and\ncontent.\n\nSome blogs have shuttered altogether in favor of other social media platforms,\nespecially video and photo-centric Instagram. Others have chosen to combine\nelements of blogging with the ease of sharing Instagrammed images in a hybrid\nmedium called micro-blogging.\n\nHere at Hey Marvelous, we are BIG fans of microblogging as a clever, effective\nway to engage and interact with your online community!\n\n## What is micro-blogging?\n\nJust as you might expect from its name,  **micro-blogging is the practice of\ncreating information-packed, short-form blog posts that accompany Facebook,\nInstagram, or even Pinterest posts.  **\n\nDoing this allows you to convey important news, helpful tips, and other rich\ncontent quickly and effectively, without cooking up a traditional, 500-800\nword blog post. Research shows that users tend to read only 20% of the content\nthey’re shown, so short and sweet is definitely the way to go. **Pairing a\nquick, information-packed story with compelling visuals increases your chances\nof capturing audience members’ attention.**\n\nSince Instagram is still experiencing rapid, exponential growth, we’re\nfocusing today on micro-blogging via Instagram. Although this practice can be\napplied to many social media platforms, we believe that it has the most\npotential for impact on Instagram.\n\n## How to Micro-blog With Instagram\n\nIf you want to adopt micro-blogging as an ongoing practice, our first piece of\nadvice would be to ensure that your content is unique and original. Yes, you\ncan link up all of your social accounts and post the same images and info\neverywhere, but doing so makes you look a tiny bit lazy. When you start adding\nmeaty, engaging captions to your Instagram posts, try using stories, tips, and\ninformation that you’re not sharing anywhere else.\n\nSound challenging? It might be, especially if you’ve gotten used to sharing\neverything you post across multiple platforms.  **Many entrepreneurs use their\nblogs and websites for business-only posts and tend to get a bit more personal\non Instagram, which creates a natural delineation of content.  **You don’t\nhave to share the inner workings of your love life or health issues, but if\nyou’re comfortable being a little more vulnerable in your Instagram posts, go\nfor it. That honesty and openness will likely build loyalty among your\nfollowers.\n\n#### A few tips for micro-blogging on Instagram:\n\n **Lead with the most important information:**  Although Instagram allows\n2,200 characters per caption, most of that text won’t be shown until a user\nclicks “more.” This means that a cute or clever first sentence for your\ncaption might actually prevent fans from clicking to read the rest! Open with\nsomething akin to a headline so everyone knows exactly what they’ll be reading\nabout.\n\n **Encourage comments and interaction:  **Ask questions in your captions, and\nALWAYS reply to your comments. Request input and opinions, and thank anyone\nwho chimes in. Insta’s algorithm pushes posts with lots of comments and\nengagement to the top, so do what you can to drive conversation!\n\n **Share relevant tips and tricks:**  Although personal stories and insights\nare always welcome, mini-tutorials, insider tricks, and life hacks are also\ngreat ways to draw people into your posts. The accompanying image can include\ntext referring to the info in the caption, or you can just use those first few\ncharacters to set up the post content.\n\n **Offer a peek behind the curtain:**  People LOVE getting behind-the-scenes\naccess! Show them your office, your messy laundry room, and your renovations\nin progress, and you’ll win their hearts. Since social media tends to be\nheavily edited to show only the best, most highlight-worthy moments of our\nlives, being honest about imperfections creates instant trust.\n\n **Run a contest:  **Nothing drives engagement like a shot at a freebie. If\nyou’re in a position to offer free coaching, limited access to your video\narchive, a one-on-one session, or even branded swag, consider setting up a\ncontest. The best way to do this is to encourage followers to create and post\ncontent of their own, using a contest-specific hashtag. Then you can select\nthe winner from among the contestants.\n\n## What Else can I do to Make my Instagram Posts Engaging?\n\nWriting a strategic but authentic micro-blog caption should top your list, but\nthere are several other steps you can take to ensure your Instagram posts\nperform well:\n\n **Use location tags:  **Whenever you can (and feel comfortable doing so)\nforego mentioning location in your caption and simply use the geotagging\nfeature instead. Users love to know both what they’re seeing, and where it is\nin the world. Plus location tagging increases engagement by 79%.\n\n **Lean on “link in bio”:**  Although Instagram makes you work for it, putting\nin the extra effort to direct people from your posts to your business website\npays off. At the end of each caption, include the words “link in bio” then\ncreate a trackable, unique URL with a free tool like marvelous.bio so you can\nmonitor traffic flow from your Insta posts to your site.\n\n**Use hashtags:**  Yeah, we know, hashtags are kind of a pain. But they’re\nalso a great way to get your content in front of people who aren’t following\nyou yet! Using hashtags allows your posts to appear in search results with all\nother posts sporting the same hashtag, exposing your brand to a wider\naudience. Start typing related keywords and Instagram will show you the most\npopular related hashtags.\n\nInterested in checking out some active Instagram micro-bloggers? Here are some\nof our faves:\n\nYes and Yes\n\nWit and Delight\n\nMedia Marmalade\n\nLocal Milk\n\nEven if you truly enjoy writing long, thoughtful blog posts, micro-blogging on\nInstagram can be a great way to build your business. It piques the interest of\na different segment of your audience, engages them less deeply but more\nfrequently, and gives you the opportunity to share ideas and content that\nmight not fit neatly into your primary brand.\n\n\n\n##  Get your Marvelous.bio URL while it's still available!\n\n###  The link in bio alternative that puts your voice front and center.\n\nCheck out Marvelous.bio ›\n\ninstagrammicro-bloggingsocial mediablogging\n\nJennifer Barcelos http://www.jenniferbarcelos.com\n\n###  Comments (0)\n\nNewest First Oldest First Newest First Most Liked Least Liked\n\nPreview Post Comment…\n\nPrevious\n\nPrevious\n\n## How to Pre-Sell Your Online Programs\n\nNext\n\nNext\n\n## Why use Squarespace to Build Your Website\n\nWe are Changemakers, Female Founders, Feminists, and Future Thinkers focused\non helping creators make more money and transform more lives through online\neducation.\n\nAbout Us   /  Blog   /  Affiliates  /  Marvelous.bio\n\n  \n\nCopyright © 2024 Marvelous®. By using this site or any part of Marvelous®,\nyou’re agreeing to our Terms of Service and Privacy Policy.\n\n­\n\n­\n\n",
    "links": "[{\"link\": \"https://www.heymarvelous.com/cart\", \"text\": \"\"}, {\"link\": \"https://www.heymarvelous.com/\", \"text\": \"\"}, {\"link\": \"https://www.heymarvelous.com/features\", \"text\": \"\\n        Features\\n      \"}, {\"link\": \"https://www.heymarvelous.com/pricing\", \"text\": \"\\n        Pricing\\n      \"}, {\"link\": \"https://www.heymarvelous.com/demo\", \"text\": \"\\n        Demo\\n      \"}, {\"link\": \"https://www.heymarvelous.com/\", \"text\": \"\"}, {\"link\": \"https://www.heymarvelous.com/features\", \"text\": \"\\n        Features\\n      \"}, {\"link\": \"https://www.heymarvelous.com/pricing\", \"text\": \"\\n        Pricing\\n      \"}, {\"link\": \"https://www.heymarvelous.com/demo\", \"text\": \"\\n        Demo\\n      \"}, {\"link\": \"https://www.heymarvelous.com/features\", \"text\": \"\"}, {\"link\": \"https://www.heymarvelous.com/pricing\", \"text\": \"\"}, {\"link\": \"https://www.heymarvelous.com/demo\", \"text\": \"\"}, {\"link\": \"https://www.heymarvelous.com/blog/category/Tools+and+Tech\", \"text\": \"Tools and Tech\"}, {\"link\": \"https://www.heymarvelous.com/blog?author=56c8b8a962cd943a1530065b\", \"text\": \"Jennifer Barcelos\"}, {\"link\": \"https://www.heymarvelous.com/blog/tag/instagram\", \"text\": \"instagram\"}, {\"link\": \"https://www.heymarvelous.com/blog/tag/micro-blogging\", \"text\": \"micro-blogging\"}, {\"link\": \"https://www.heymarvelous.com/blog/tag/social+media\", \"text\": \"social media\"}, {\"link\": \"https://www.heymarvelous.com/blog/tag/blogging\", \"text\": \"blogging\"}, {\"link\": \"https://www.heymarvelous.com/blog?author=56c8b8a962cd943a1530065b\", \"text\": \"\"}, {\"link\": \"https://www.heymarvelous.com/blog/how-to-pre-sell-your-online-programs\", \"text\": \"\"}, {\"link\": \"https://www.heymarvelous.com/blog/why-use-squarespace\", \"text\": \"\"}, {\"link\": \"https://www.heymarvelous.com/about-us\", \"text\": \"About Us\"}, {\"link\": \"https://www.heymarvelous.com/blog\", \"text\": \"Blog\"}, {\"link\": \"https://www.heymarvelous.com/affiliates\", \"text\": \"Affiliates\"}, {\"link\": \"https://www.heymarvelous.com/terms\", \"text\": \"Terms of Service\"}, {\"link\": \"https://www.heymarvelous.com/privacy\", \"text\": \"Privacy Policy.\"}]",
    "priceAndPlans": "Subscribe Now\n\n0\n\nSkip to Content\n\nFeatures\n\nPricing\n\nDemo\n\nLogin  Sign Up\n\nOpen Menu Close Menu\n\nFeatures\n\nPricing\n\nDemo\n\nLogin  Sign Up\n\nOpen Menu Close Menu\n\nFeatures\n\nPricing\n\nDemo\n\nLogin  Sign Up\n\n## Unlimited courses.  \nUnlimited memberships.  \nUnlimited revenue potential.  \nEverything in one place.\n\n### We believe in fair, transparent pricing and 0% revenue fees.\n\nAnnual (Save 20%) Monthly\n\nAnnual (Save 20%) Monthly span\n\n## Essentials\n\n### $48/mo Paid Annually\n\nStart Now\n\n### $57/mo Paid Monthly\n\nStart Now\n\nNo hidden fees.\n\nAll basic features, plus:\n\n  * Livestream classes\n  * Sell unlimitied products \n  * 1 community group\n  * Upload 10 videos\n  * Embed Youtube, Vimeo, Wistia, VadooTV, Adilo + VideoAsk Videos\n  * Embed TypeForm forms\n  * Mobile Marvelous app (beta)\n  * Unlimited Marvelous Mail emails\n  * SMS sotifications (Twilio)\n  * Flodesk integration\n  * Mailchimp integration\n  * ConvertKit integration\n\n## Solo\n\n### $104/mo Paid Annually\n\nStart Now\n\n### $125/mo Paid Monthly\n\nStart Now\n\nNo hidden fees.\n\nAll Essentials features, plus:\n\n  * Zapier integration\n  * Unlimited video storage\n  * Unlimited quizzes\n  * 2 community groups\n  * Sales pages & Magic pages\n  * Custom domain\n  * Deadline Funnel integration\n\nBest Value\n\n## Pro\n\n### $149/mo Paid Annually\n\nStart Now\n\n### $179/mo Paid Monthly\n\nStart Now\n\nNo hidden fees.\n\nAll Solo features, plus:\n\n  * Multiple Zoom accounts\n  * Multiple Google Calendar connections\n  * 15 instructors\n  * 5 community groups\n\n## Growth\n\n### $208/mo Paid Annually\n\nStart Now\n\n### $250/mo Paid Monthly\n\nStart Now\n\nNo hidden fees.\n\nAll Pro features, plus:\n\n  * Priority support\n  * 25 instructors\n  * 10 community groups\n\n  \nCompare Plans\n\nIncluded in all plans\n\n## Basic Features:\n\n  * Unlimited Zoom Live-streaming\n\n  * Instant Payouts\n\n  * No Revenue Share\n\n  * Unlimited Marvelous Mail Emails\n\n  * Event SMS Notifications (Twilio)\n\n  * Stripe + PayPal Integration\n\n  * Replays of Livestream\n\n  * Create Secret Products\n\n  * Unlimited Coupons\n\n  * Unlimited Students\n\n  * Set up Substitute Instructors\n\n  * Marvelous Scheduling\n\n  * Create Marketing Assets\n\n  * Landing Page Builder\n\n  * Marvelous Magic Pages™ \n\n  * Private Community and Direct Message Chat\n\n  * Unlimited ClassCard™ Products\n\n  * Unlimited Course Products\n\n  * Unlimited Memberships\n\n  * Unlimited Bundles\n\n  * Unlimited 1:1 Coaching Products\n\n  * Product Waitlists\n\n  * Gift Your Products\n\n  * Tip Jar\n\n  * Manual Student Check-in\n\n  * Sales Tax\n\n  * Beautifully-designed Homepage Templates\n\n  * One or More Instructors\n\n  * Detailed Reporting + Exports\n\n  * Marvelous.bio Single-link Sharing\n\n  * Integration with Flodesk, ConvertKit and Mailchimp  \n\nNeed help deciding? Contact our team or click the chat icon below.\n\n  * ## I joined Marvelous earlier this month. Within a few days I did a 'soft launch' of my meditation membership section to some of my current and past students. Within one week I doubled by initial investment!!!\n\n— Tony, Meditation Instructor\n\n  * ## I've launched my online studio membership and have 22 paying clients on a monthly subscription! Never thought I could conquer the tech, but the help and support here has been amazing!\n\n— Sara, Pilates Instructor\n\n  * ## Has anyone else had the experience of watching folks try and do cool online things *without* using Marvelous and realized how much harder they are working for customer experience? It makes me appreciate the software a lot more. \n\nRebecca, Yoga Studio\n\nItem 1 of 3\n\n## Still wondering if Marvelous is right for you?\n\n  * ####  How do I link my website with Marvelous? \n\nIf you already have a website, you can simply create a button on your website\nand add a hyperlink from that button to your Marvelous login page (or you\ncould put the link in your menu or header). Once your students arrive at your\nlogin page, they can peruse your products, watch your welcome video, and\ncreate a free account (which will allow them to access any of your free\ncontent and/or purchase your available classes and training packages). If\nyou’re technically savvy, you can choose to map your Marvelous site to a\ncustom domain that you’ve purchased outside of Marvelous.\n\n  * ####  Can I create a membership? \n\nYes! You can bundle or package your content in any way you’d like! Combine\nyour video, audio, and document files, plus any live-streaming sessions in any\nway you can imagine. You could create a beginner yoga product with ten\ninstructional videos and two audio meditations. Or you could package three\nhealthy cooking videos with three private live-streaming sessions or do a\ntwenty audio file package. Anything is possible!\n\n  * ####  Can I bundle my content and sell it? \n\nYes! You can bundle or package your content in any way you’d like! Combine\nyour video, audio, and document files, plus any live-streaming sessions in any\nway you can imagine. You could create a beginner yoga product with ten\ninstructional videos and two audio meditations. Or you could package three\nhealthy cooking videos with three private live-streaming sessions or do a\ntwenty audio file package. Anything is possible!\n\n  * ####  How do I get paid? \n\nYou choose your own pricing structure and your students will purchase your\nproducts inside of your site, where they will be able to securely enter their\ncredit card information. You will choose to integrate with either a PayPal\nBusiness or a Stripe account, and the money will be deposited through your\nchosen payment processor into your bank account. We do not share in your\nrevenue (at all) and there is no delay in receiving your funds. (Stripe and\nPayPal do both charge a processing fee of approximately 2.9% + $.30 per\ntransaction.)\n\n  * ####  Can I drip content to my students? \n\nFirst, you set the start and end date of the entire course and the you decide\nif each lesson appears after a certain time period or only after the student\ncompletes the previous lesson.\n\nYou can also add multiple media files (video, audio, pdf) and live-streaming\nsessions within each lesson.\n\n  * ####  Do I still own all of my content? \n\nYes, whatever content (video, audio, PDF files) you upload to Marvelous, is\nyours. Just make sure you keep your own copies of your files.\n\n  * ####  How does live-streaming work? \n\nYou can live-stream private client sessions, broadcast your classes, or host\ncollaborative group sessions with our live-streaming feature.\n\n **Collaborative Group Sessions**\n\nYou can create a live-stream for a group of students, where they can see and\ntalk to each other. This works well for yoga teacher training, continuing\neducation, or other group work where you want your participants to interact\nwith one another. You will need a paid Zoom account and the maximum number of\npeople for this feature is 100 (including you).\n\n **1-on-1 Private Sessions**\n\nThis is just like it sounds: you and one client having a private lesson. Half\nthe screen will be you and the other half will be your client.\n\n**Broadcasts**\n\nYou can also create a ‘broadcast.’ In this scenario, you can teach to an\nunlimited number of students. They can all see you (of course!) but you cannot\nsee them and they cannot see each other. This is much like Facebook Live (or\neven television).\n\n **Live-stream Recordings**\n\nFor all of the above situations, you have the choice to record the session,\nand if you do, the recording will appear in your students’ sites (but only the\nstudent(s) that registered for that particular session). Your live-streams can\nbecome additional videos in your site with the click of a button.\n\n **Live-Streaming Minutes**\n\nThe number of live-streaming minute is calculated by multiplying the number of\nparticipants by the number of minutes you are live-streaming. For example, if\nyou have 20 people participating in a 30-minute live-stream, that is 600 live-\nstreaming minutes. Live-streaming minutes applies to broadcast and private\nlive-streams only. (If you create a group live-stream you are using your own\npaid Zoom account and the max number of participants allowed is based on your\nZoom plan and any add-ons).\n\n  * ####  Can I use Marvelous as my main website? \n\nYes! Marvelous has a customizable homepage that can function as your basic\nwebsite. You can upload your logo and a cover photo, select your brand color,\nadd your “About” section, add a welcome video, and pull in a mosiac of your\nlive Instagram feed. If you need just a basic website (with no blogging\nfunction), this is all you need!\n\n  * ####  Are there any transaction fees with Marvelous? \n\nWhen you create and sell your products on Marvelous, you keep all of the\nrevenue you earn (aside from the current Stripe or PayPal processing fees). We\ndon't charge additional transaction or revenue fees. Ever.\n\n# I’m Ready to Teach Online.\n\n### Your OWN beautiful platform is just a click away.\n\nSign me up!\n\nWe are Changemakers, Female Founders, Feminists, and Future Thinkers focused\non helping creators make more money and transform more lives through online\neducation.\n\nAbout Us   /  Blog   /  Affiliates  /  Marvelous.bio\n\n  \n\nCopyright © 2024 Marvelous®. By using this site or any part of Marvelous®,\nyou’re agreeing to our Terms of Service and Privacy Policy.\n\n­\n\n­\n\n"
}