{
    "summary": "We use cookies to provide you with the best possible experience on our\nwebsite. By continuing to use this website, you accept that you agree to our\nuse of cookies. Learn more\n\nGot it!\n\n  * __scwsupport@procaresoftware.com\n  * __(888) 466-8296\n\n  * __Provider Login\n  * __Connect Portal\n\n__\n\n  * Home\n  * Pricing\n  * About Us\n    * FAQs\n    * News\n    * Careers\n  * Contact Us\n\n  \n  \n\n# **Online Childcare Management Software**\n\n__Request a Demo Now\n\n#### DayCare Works™\n\nDayCare Works™ provides a cloud-based Service-as-a-Software (SaaS) flexible\nsolution for your childcare program needs. Whether you are a private childcare\nfacility, franchised childcare centers, montessori schools, preschools, faith-\nbased, public and private schools, DayCare Works™ can scale to help manage\nyour program!\n\nChildcare software now provides an online service for both childcare\nproviders/facilities and parents. DayCare Works™ is an innovative way to keep\ntrack of daycare activities and keeping the parents involved. Keep track of\nstatements, payment activity, children, caregivers and so much more.\n\nDayCare Works™ offers the most comprehensive cloud-based software platform for\nmanaging multi-site childcare operations.\n\n__\n\n__\n\n# **Provider Edition**\n\n**DayCare Works™ Provider Edition** is an innovative, web-based application\ndesigned for child care administrators to easily manage the unique\ncomplexities of their business. Run your business the way you want and save\ntime using DayCare Works™.\n\n__\n\n#### Real-Time Recordkeeping\n\nAccess real-time information across your multiple sites or drill down to the\nprogram, site and family levels. DayCare Works™ provides you with a\nconsolidated dashboard to view things like your total number of enrollments,\nlive caregiver to student ratios, attendance and receivables.\n\n__\n\n#### Streamline Government Reporting\n\nIntegrated billing and state third party subsidy and food program management\ntools save time and speed up your collections. Assign subsidy payments in one\nstep to multiple families and create invoices for outstanding subsidy\npayments. Use our automated state specific forms and free up your staff from\ntime intensive paperwork.\n\n__\n\n#### Attendance and Meal Program Tracking\n\nOffer an efficient and effective web portal for teachers and caregivers\ncomplete with all of the information they need for their specific room—without\nthe sensitive data they don’t need—to quickly take attendance, track meals,\nupdate communications and more.\n\n__\n\n#### Simplify Program Management\n\nGet more done with less effort. DayCare Works™ is designed with your workflow\nin mind. Manage your day-to-day operations, scheduling, billing and\nreceivables, communications and much more from a central location or from each\nlocation.\n\n__\n\n#### Automate Billing\n\nAutomatically schedule your family billing and save valuable time and costly\nerrors. DayCare Works™ takes care of the rest including things like automating\nadjustments for vacation time and family discounts.\n\n__\n\n#### Mobile Apps\n\nCheck In/Out via DayCare Works™ InSite Select and InSite Provider applications\navailable for Android, Apple and Microsoft tablets.\n\n__\n\n#### Integrate with Other Systems\n\nDayCare Works™ can easily interface with your other business systems including\nCRM, payroll, e-marketing and accounting systems.\n\n# **Connect Edition**\n\nAdd the **DayCare Works™ Connect Edition** and extend important time saving\nand convenient communication tools to your families, staff and third party\nproviders.\n\n__\n\n#### Online Registration\n\nProvide families with a customized enrollment process. You control the text\nthat is displayed and the required information for registration.\n\n__\n\n#### Connect with Your Families\n\nOffer your families the convenience of a family portal to include parents in\ntheir child’s progress. Parents can easily connect with you to view their\nfamily account information and submit updates to their records.\n\n__\n\n#### Online and Mobile Payments\n\nAutomatically generate billing statements that parents can view and pay online\nusing their credit card, debit card or checking account. Families can view\npayment history and print their invoices including year-end and flexible\nspending account statements. And if they need a reminder, DayCare Works™ can\nautomatically generate and deliver reminders.\n\n__\n\n#### Organize Calendars\n\nEasy-to-use features help you to customize and organize your calendars. Add\ndaily activities, special events, lunch menus and more. Then share with\nparents and print calendars for your classrooms.\n\n__\n\n#### Simplify Communications\n\nCommunications are a key component of running a quality program. DayCare\nWorks™ provides your staff and parents with a secure and convenient way to\ncommunicate. Post updates to calendars, scrapbooks and important reminders or\nannouncements. Parents can update schedule changes and vacation requests\nallowing you to adjust your rooms and staffing more proactively.\n\n__\n\n#### Connect Your Third Party Providers\n\nGive your third party providers secure access to manage their class or program\nincluding classroom rosters, student-staff ratios, emergency cards and\ndirectories.\n\nGet Started Today\n\n## **DayCare Works™** is the single best investment for your childcare\ncompany!\n\nTo learn more and to get a personalized demo of any of our products, contact\nus today.\n\n# **Our Promise with Every Solution**\n\nProcare Software takes our mission seriously. We are here to build **the best\nsolutions** , so you can focus on providing great programs and enriching the\nlives of individuals and families in the communities you serve. That is why\nyou can count on us for proven performance for every solution we provide.\n\n__\n\n#### Security\n\nProtecting your data is our top priority. Our platforms use hardened security\nstandards like strong data encryption, individual account and password\nauthentications, role-based security authorization and complete change control\nauditing.\n\n__\n\n#### Hosting\n\nWe maintain multiple hosting facilities to keep your site available 24/7/365.\nOur state of the art SOC certified hosting facilities operate with multiple\nredundant internet connections, power backup and system failover capabilities\nensuring maximum uptime.\n\n__\n\n#### Administration\n\nYou can easily create as many administration users as you need without any\nadditional cost, and grant each user access to just the right information they\nneed to do their job.\n\n__\n\n#### Mobile and Tablet Apps\n\nTake your program management, center operations and customer interactions to\nthe next level with our easy to use apps, available for Android and\niPhone/iPad.\n\n__\n\n#### Updates\n\nAt Procare Software, we believe that continually improving our software means\nincreased value and happy customers. All regular platform upgrades are\nprovided automatically, without additional fees or lengthy software deployment\ncycles.\n\n__\n\n#### Customer Service\n\nWe are committed to maintaining a superior level of customer support and\nservice. All solutions come with comprehensive help documentation, training\nvideos, customized web training and access to our full featured support\nportal.\n\n__\n\n#### Integration Support\n\nOur platforms support an open integration and a proven reliability for\nconnecting many external information systems like CRM, ERP, financial, human\nresource, LDAP directory, payroll and student information systems.\n\n#### Company Links\n\n  * Home \n\n  * About Us \n\n  * Contact Us \n\n#### Solutions\n\n  *   * \n\n####\n\nDaycare/Schoolcare Works is a flexible solution for before and after school\nprograms, franchises, Montessori, faith-based, and public and private schools.\n\n  * Phone Number: (888) 466-8296\n  * Email: scwsupport@procaresoftware.com\n  * Website: www.procaresoftware.com/\n\n#### Follow Us\n\n  * __\n  * __\n\n© 2024 Procare Software - All Rights Reserved\n\n  * Sitemap\n  * Privacy Policy\n  * Contact\n\n__\n\n",
    "links": "[{\"link\": \"https://www.daycareworks.com/cg/secure_login.jsp\", \"text\": \"\"}, {\"link\": \"https://www.daycareworks.com/cg/index.jsp\", \"text\": \"Home\"}, {\"link\": \"https://www.daycareworks.com/cg/pricing.jsp\", \"text\": \"Pricing\"}, {\"link\": \"https://www.daycareworks.com/cg/faq.jsp\", \"text\": \"FAQs\"}, {\"link\": \"https://www.daycareworks.com/cg/contact.jsp\", \"text\": \"Contact Us\"}, {\"link\": \"https://www.daycareworks.com/cg/index.jsp\", \"text\": \"Home \"}, {\"link\": \"https://www.daycareworks.com/cg/contact.jsp\", \"text\": \"Contact Us \"}, {\"link\": \"https://www.daycareworks.com/cg/sitemap.jsp\", \"text\": \"Sitemap\"}, {\"link\": \"https://www.daycareworks.com/cg/contact.jsp\", \"text\": \"Contact\"}]",
    "priceAndPlans": "We use cookies to provide you with the best possible experience on our\nwebsite. By continuing to use this website, you accept that you agree to our\nuse of cookies. Learn more\n\nGot it!\n\n  * __scwsupport@procaresoftware.com\n  * __(888) 466-8296\n\n  * __Provider Login\n  * __Connect Portal\n\n__\n\n  * Home\n  * Pricing\n  * About Us\n    * FAQs\n    * News\n    * Careers\n  * Contact Us\n\n        \n  \n\n# Easy-to-Use Easy-to-Use Mobile-Friendly Customizable Intuitive Cloud-Based\nSoftware  \nReady to Manage Your **Multi-Site** childcare and afterschool programs.\n\n__See Our Solutions\n\n# Which Software Edition is Right for **Your Program**?\n\nCirrus Group prides ourselves on providing flexible solutions. We understand\neach program has specific requirements, needs and budgets. This is why we have\ndesigned our cloud-based solutions to be flexible and expandable. We would\nlove to learn more about your needs, set up a demonstration and walk you\nthrough how our software can work for you.\n\n#### Request a Demo\n\nI'm ready to ...\n\nSchedule A Demo Request A Price Quote Ask For More Information\n\nThe Platform I'm interested in is ...\n\nDayCare Works SchoolCare Works\n\nEmpower My Center\n\n  \n  \n\nIf you are a parent, family member, or class participant you should contact\nyour school, company or association **directly** for support.\n\n#### Company Links\n\n  * Home \n\n  * About Us \n\n  * Contact Us \n\n#### Solutions\n\n  *   * \n\n####\n\nDaycare/Schoolcare Works is a flexible solution for before and after school\nprograms, franchises, Montessori, faith-based, and public and private schools.\n\n  * Phone Number: (888) 466-8296\n  * Email: scwsupport@procaresoftware.com\n  * Website: www.procaresoftware.com/\n\n#### Follow Us\n\n  * __\n  * __\n\n© 2024 Procare Software - All Rights Reserved\n\n  * Sitemap\n  * Privacy Policy\n  * Contact\n\n__\n\n"
}