{
    "summary": "__\n\n  * Software Categories\n  * Blog\n  * About Us\n  * For Vendors\n\n __\n\n __\n\nHome\n\nDaycare Software\n\n# Find the best Daycare Software\n\nOverview\n\nON THIS PAGE\n\n  1. Popular Comparisons\n\n  2. FrontRunners\n\n  3. Buyers Guide\n\nON THIS PAGE\n\n  1. Popular Comparisons\n\n  2. FrontRunners\n\n  3. Buyers Guide\n\n##### Filter products\n\n93 results\n\n### Filter products\n\n __\n\n#### Industry\n\nSelect your industry\n\n __ __\n\n#### Company Size\n\n  * Self-Employed\n\n  * 2-10\n\n  * 11-50\n\n  * 51-200\n\n  * 201-500\n\n  * 501-1000\n\n  * 1000+\n\n  * \\+ Show all\n\n#### Pricing Options\n\n  * $$$$$\n\n  * $$$$$\n\n  * $$$$$\n\n  * $$$$$\n\n  * $$$$$\n\n#### Sort by\n\n __\n\n **Recommendations** : Sorts listings by the number of recommendations our\nadvisors have made over the past 30 days. Our advisors assess buyers’ needs\nfor free and only recommend products that meet buyers’ needs. Vendors pay\nSoftware Advice for these referrals.  \n **Reviews** : Sorts listings by the number of user reviews we have published,\ngreatest to least.  \n **Sponsored** : Sorts listings by software vendors running active bidding\ncampaigns, from the highest to lowest bid. Vendors who have paid for placement\nhave a ‘Visit Website’ button, whereas unpaid vendors have a ‘Learn More’\nbutton.  \n **Avg Rating** : Sorts listings by overall star rating based on user reviews,\nhighest to lowest.  \n **A to Z** : Sorts listings by product name from A to Z.\n\n  * Sponsored\n\n  * # of User Reviews\n\n  * Average Rating\n\n  * Alphabetically (A-Z)\n\n  * Frontrunners\n\nClearShow 93 Products\n\n## Compare Products\n\nShowing 1 - 20 of 93 products\n\n __Sort and Filter\n\nSort by\n\n __\n\n **Recommendations** : Sorts listings by the number of recommendations our\nadvisors have made over the past 30 days. Our advisors assess buyers’ needs\nfor free and only recommend products that meet buyers’ needs. Vendors pay\nSoftware Advice for these referrals.  \n **Reviews** : Sorts listings by the number of user reviews we have published,\ngreatest to least.  \n **Sponsored** : Sorts listings by software vendors running active bidding\ncampaigns, from the highest to lowest bid. Vendors who have paid for placement\nhave a ‘Visit Website’ button, whereas unpaid vendors have a ‘Learn More’\nbutton.  \n **Avg Rating** : Sorts listings by overall star rating based on user reviews,\nhighest to lowest.  \n **A to Z** : Sorts listings by product name from A to Z.\n\nSponsored __\n\n### Procare Solutions\n\n### Procare Solutions\n\n __FrontRunners 2021\n\nProcare Solutions is the #1 child care management software – modern, best\nsupported, feature-rich solution for child care centers. For over 30 years,\nProcare has been the most trusted name in child care business management\nsoftwar...Read more about Procare Solutions\n\n **4.6** (2084 reviews)\n\nStarting Price: Available upon request\n\n __Free version unavailable\n\n __Free trial available\n\nCompare\n\nVisit Website\n\n### Famly\n\n### Famly\n\n __FrontRunners 2021\n\nForget ordinary childcare software. From digital enrollment to automatic\nbilling to instant message translation, Famly is the time-saving solution that\ngoes the extra mile for your ECE business needs. We've got all the must-have\n...Read more about Famly\n\n **4.7** (228 reviews)\n\nStarting Price: Available upon request\n\n __Free version available\n\n __Free trial available\n\nCompare\n\nVisit Website\n\n### brightwheel\n\n### brightwheel\n\n __FrontRunners 2021\n\nbrightwheel is a software solution built to modernize all childcare, daycare,\nand preschool programs by helping operate more smoothly, manage with less\nmanual work, and most importantly, give back time to those looking after the\nw...Read more about brightwheel\n\n **4.7** (3120 reviews)\n\nStarting Price: Available upon request\n\n __Free version available\n\n __Free trial available\n\nCompare\n\nVisit Website\n\n### Lillio\n\n### Lillio\n\n __FrontRunners 2021\n\nLillio - the building blocks for high-quality childcare. Trusted by childcare\ncenters worldwide, Lillio is a mission-driven, certified B corporation\ncommitted to helping childcare centers improve the quality of their programs.\nLil...Read more about Lillio\n\n **4.6** (3600 reviews)\n\nStarting Price: Available upon request\n\n __Free version unavailable\n\n __Free trial available\n\nCompare\n\nVisit Website\n\n### Sawyer\n\n### Sawyer\n\nSawyer is a cloud-based camp and activity management solution that offers\nbooking and scheduling services for children's after school class providers,\ncamps and events. The solution also offers an online marketplace, where\nparents...Read more about Sawyer\n\n **4.5** (280 reviews)\n\nStarting Price: Available upon request\n\n __Free version unavailable\n\n __Free trial available\n\nCompare\n\nVisit Website\n\n### EdOptim\n\n### EdOptim\n\nEdOptim is a web-based student information management system designed to help\nbusinesses in the education industry streamline communication with students\nand parents. It lets teachers share various information with parents,\ninclud...Read more about EdOptim\n\nNo reviews yet\n\nStarting Price: Available upon request\n\n __Free version unavailable\n\n __Free trial unavailable\n\nVisit Website\n\n### Alliance CORE\n\n### Alliance CORE\n\nAlliance CORE is a licensing complaint management system that allows providers\nto track record keeping, keep up with children's attendance, remain compliant\nwith licensing, manage enrollment and subsidies, and so much more. ...Read\nmore about Alliance CORE\n\n **4.5** (55 reviews)\n\nStarting Price: $25.00 per month\n\n __Free version unavailable\n\n __Free trial available\n\nCompare\n\nVisit Website\n\n### Jackrabbit Care\n\n### Jackrabbit Care\n\nJackrabbit Care is a cloud-based child care management solution for child care\ncenters, after-school programs and preschool programs. This solution helps\nusers manage enrollment, attendance, scheduling, billing and\ncommunications....Read more about Jackrabbit Care\n\n **4.3** (40 reviews)\n\nStarting Price: $69.00 per month\n\n __Free version unavailable\n\n __Free trial available\n\nCompare\n\nVisit Website\n\n### Kangarootime\n\n### Kangarootime\n\n __FrontRunners 2021\n\nKangarootime is an automated child care management solution designed for\ndirectors, owners and parents. The solution is deployed in the cloud and\noffers features including recordkeeping, employee management, class management\nand a...Read more about Kangarootime\n\n **4.4** (79 reviews)\n\nStarting Price: Available upon request\n\n __Free version unavailable\n\n __Free trial available\n\nCompare\n\nVisit Website\n\n### Playground\n\n### Playground\n\nLower your costs with Playground, the modern child care management software\nthat eliminates admin busywork and delights families. Our top-rated software\nincludes essential features like billing, family engagement, digital\npaperwor...Read more about Playground\n\n **5.0** (44 reviews)\n\nStarting Price: Available upon request\n\n __Free version available\n\n __Free trial available\n\nCompare\n\nVisit Website\n\n### KidGenius\n\n### KidGenius\n\nKidGenius is software designed to assist childcare centers of all sizes to\nstreamline operations related to photo sharing, attendance tracking, activity\nmonitoring, child profiles, parent messaging, and other administrative\noperat...Read more about KidGenius\n\n **4.6** (20 reviews)\n\nStarting Price: Available upon request\n\n __Free version unavailable\n\n __Free trial available\n\nLearn More\n\n### KidKare Food Program\n\n### KidKare Food Program\n\nKidkare is a cloud-based childcare management solution designed to help\ndaycare centers and sponsors manage operations related to meal planning,\nadmissions and Child and Adult Care Food Program (CACFP) claim processing.\nFeatures i...Read more about KidKare Food Program\n\n **4.7** (384 reviews)\n\nStarting Price: Available upon request\n\n __Free version available\n\n __Free trial unavailable\n\nCompare\n\nLearn More\n\n### Cheqdin\n\n### Cheqdin\n\nCheqdin is a cloud-based childcare solution that helps businesses manage\nbilling and invoicing operations in nurseries, day care centers and\nafterschool programs. Key features include parent portal, photo gallery,\nimmunization rec...Read more about Cheqdin\n\n **4.7** (38 reviews)\n\nStarting Price: $12.00 per month\n\n __Free version available\n\n __Free trial available\n\nCompare\n\nLearn More\n\n### myKidzDay\n\n### myKidzDay\n\nmyKidzDay is a cloud-based daycare solution designed for teachers, parents and\ndaycare owners. The solution provides communication between parents and child\ncare providers. Key features include reporting, attendance management,\nd...Read more about myKidzDay\n\n **4.3** (46 reviews)\n\nStarting Price: $1.50 per month\n\n __Free version available\n\n __Free trial available\n\nCompare\n\nLearn More\n\n### Tuition Express\n\n### Tuition Express\n\nTuition Express by Procare is a user-friendly and safe child care billing\nsoftware, making tuition collection seamless for child care providers. Tuition\nExpress, a PCI compliant direct processor, gives child care centers all of\nth...Read more about Tuition Express\n\n **4.8** (170 reviews)\n\nStarting Price: Available upon request\n\n __Free version unavailable\n\n __Free trial unavailable\n\nCompare\n\nLearn More\n\n### Whally\n\n### Whally\n\nWhally is a school management platform that helps educational institutions\nmanage staff members and students. The system stores student records in a\ncentralized repository to prevent duplication. Parents can update their\nchildren'...Read more about Whally\n\nNo reviews yet\n\nStarting Price: $3.00 per month\n\n __Free version unavailable\n\n __Free trial available\n\nLearn More\n\n### SchoolCare Works\n\n### SchoolCare Works\n\nProcare’s SchoolCare Works is the before and after school management software\nthat enables you to keep track of activities, registrations, classes, billing\nand payment activity, third-party subsidy payments, student and staff\nsche...Read more about SchoolCare Works\n\n **5.0** (1 reviews)\n\nStarting Price: Available upon request\n\n __Free version unavailable\n\n __Free trial unavailable\n\nLearn More\n\n### Jovial\n\n### Jovial\n\nJovial is a cloud-based child care management solution designed specifically\nfor parent-run, co-op preschools. Key features include enrollment management,\nrecordkeeping, tuition accounting and requirements tracking. The solution\nt...Read more about Jovial\n\n **4.5** (2 reviews)\n\nStarting Price: Available upon request\n\n __Free version available\n\n __Free trial available\n\nLearn More\n\n### Kaymbu\n\n### Kaymbu\n\n __FrontRunners 2021\n\nKaymbu is a cloud-based family engagement and classroom documentation solution\ndesigned for parents, schools and teachers. Key features include\ndocumentation, assessment, messaging and photobooks. It connects parents with\neducator...Read more about Kaymbu\n\n **4.6** (142 reviews)\n\nStarting Price: Available upon request\n\n __Free version available\n\n __Free trial available\n\nCompare\n\nLearn More\n\n### ACTIVE Educate\n\n### ACTIVE Educate\n\nACTIVE Educate is a cloud-based class registration solution designed for\nstudios of all sizes. It offers online registration, marketing and online\nmembership management functionalities within a suite. ACTIVE Educate features\n...Read more about ACTIVE Educate\n\n **4.6** (14 reviews)\n\nStarting Price: Available upon request\n\n __Free version unavailable\n\n __Free trial unavailable\n\nLearn More\n\nView all products\n\n## Popular Comparisons\n\nLillio\n\n _VS_\n\nbrightwheel\n\nProcare Solutions\n\n _VS_\n\nMarketing 360\n\nKidKare Food Program\n\n _VS_\n\nRegpack\n\nSawyer\n\n _VS_\n\nSmartcare\n\n## Your Guide to Top Daycare Software, March 2021\n\nSoftware Advice uses reviews from real software users to highlight the top-\nrated Daycare Software products in North America.\n\nLearn how products are chosen\n\n#### Explore FrontRunners\n\nHistory:March 2021 (current)November 2020\n\n  * Sandbox ChildCare Management\n  * Famly\n  * EZCare\n  * TimeSavr\n  * Lillio\n  * brightwheel\n  * Kaymbu\n  * Procare Online\n  * Bloomz\n  * ChildcareCRM\n  * Illumine\n  * Procare Solutions\n  * iClassPro\n  * Kangarootime\n  * Tadpoles\n  * Smartcare\n  * Marketing 360\n  * Regpack\n  * LifeCubby\n  * Amilia\n  * Xplor Education\n\n“Usability” includes user ratings for Functionality and Ease of Use.\n\n“Customer Satisfaction” includes user ratings for Customer Support, Likelihood\nto Recommend and Value for Money.\n\nReviews analysis period: The reviews analysis period spans two years and ends\nthe 15th of the month prior to publication.\n\n## Buyers Guide\n\nLast Updated: November 07, 2023\n\nIt’s not easy running a child care center. Even after administrators have met\nlicensing requirements, determined a legal structure, found the perfect\nlocation and hired staff, they still have to handle a variety of daily tasks\nto keep kids (and their parents) happy.\n\nChild care software helps users manage the day-to-day aspects of running a\ndaycare center or preschool. Among other things, these systems can automate\nadministrative tasks, keep attendance records, store parents’ contact\ninformation, track children’s health data and help users schedule classes and\nappointments.\n\nThis guide can help potential buyers find the best solution for their needs.\nHere’s what we’ll cover:\n\nWhat Is Child Care Software?\n\nCommon Functionality of Child Care Software\n\nBenefits of Child Care Management Software\n\nPricing: Web-Based vs. On-Premise\n\nIndustry Trends\n\n## What Is Child Care Software?\n\nChild care professionals are busy, and it can be difficult for them to not\nonly keep up with their young charges, but stay on top of administrative,\nscheduling and financial duties, as well. That’s where child care management\nsoftware comes in: It helps child care workers simplify and streamline the\nmanual processes they do every day, including recordkeeping, billing,\nattendance and immunization tracking.\n\nChild care management software is also known as “child care administrative\nsoftware” or “daycare management software.” The technology is useful for all\nkinds of child care centers, including:\n\n  * Day-care centers\n\n  * Licensed family child care homes\n\n  * Early childhood education programs/preschools\n\n  * After-school programs\n\n  * Drop-in programs\n\nOnce an organization is ready to open its doors to potential clients, it’s\nnever too early to invest in a software system. Doing so can ensure they’re\norganized from the start and set up for success.\n\nFor example, some center administrators think a single-application software,\nsuch as an accounting program from an industry-agnostic vendor, will be enough\nto fulfill their needs. However, that isn’t ideal for long-term growth. It’s\nusually better to get a dedicated child care management solution because it\nlets you streamline every aspect of the business, eliminating the need to buy\ndifferent applications from multiple vendors that don’t interface with one\nanother.\n\n## Common Functionality of Child Care Management Software\n\nMost child care management systems will come with some or all of the following\ncapabilities:\n\n **Admissions and scheduling**\n\n|\n\nProvides widgets and calendars for scheduling classes as well as enrollment\nand registration.  \n  \n---|---  \n  \n **Billing and payments**\n\n|\n\nAllows users to perform billing and invoicing, track account balances and\npast-due payments, create and print payment reports and statements and post\npayment in batches. Offers support for multiple online and in-person payment\nmethods, including cash, check, money order and credit cards.  \n  \n **Immunization tracking**\n\n|\n\nTracks and stores children’s immunization records, including past, current and\ncompleted vaccinations and immunization due dates.  \n  \n **Reporting**\n\n|\n\nGenerates reports of and provides alerts for children’s birthdays. Also\ncreates reports on revenue summaries, class statistics (e.g., class type and\nsize), attendance and financial transactions.  \n  \n **Employee management/time and attendance**\n\n|\n\nFacilitates staff check-in and check-out; manages employee hours; stores pay\nrates and other staffing information at organization-wide and location-\nspecific levels.  \n  \n **Communication**\n\n|\n\nAllows users to keep parents informed about their child’s activities via\nmobile application alerts, emails or text messages.  \n  \n **Meal management**\n\n|\n\nSome systems offer menu planning, meal tracking and nutrition analysis\nfunctionality.  \n  \n **Activity planning**\n\n|\n\nEnables staff to create lesson plans or activity plans in advance.  \n  \n## Benefits of Child Care Management Software\n\nDaycare and preschool facilities can realize many benefits as a result of\nadopting child care management software, including:\n\n **Less administrative work.** Generally, staff in a daycare or preschool\nfacility handles both administrative and physical child care duties. This\nsoftware automates administrative tasks, such as online registration, so\nemployees can focus their energy on the children themselves.\n\n **Improved communication with parents.** Working parents don’t need to worry\nor inquire about their children. With child care management software, your\nfacility can send parents notifications about their child throughout the day\nvia native mobile apps or text messaging.\n\n **Advanced meal and nutrition planning.** Some vendors offer tools for\ntracking the number of provided meals, as well as for planning breakfast,\nlunch and snacks based on the nutritional requirements of each child. With\nthis functionality, child care centers can give growing kids the nourishment\nthey need.\n\n **Greater staff coordination.** As opposed to paper-based records, digital\nsystems are accessible to multiple users in separate locations. This makes it\neasier for employees to update any necessary documentation and for the\nbusiness to scale.\n\n## Pricing: Cloud-Based vs. On-Premise\n\nThere are two main pricing models prevalent in this market. Select the one\nthat best fits your budget and business model:\n\nCloud-based **software.** These solutions are typically priced on a monthly or\nan annual subscription basis. They require low or no upfront investment, and\nvendors handle system maintenance and updates. This option is often best for\nsmall and midsize businesses that may not have the resources to invest in and\nmanage an on-premise system.\n\n **On-premise software.** These systems typically require purchasing a\nperpetual license for a substantial upfront fee. There are no recurring\nlicense fees, but extra fees may apply for implementation assistance,\nmaintenance, support and updates.\n\nNo matter which system you choose, over a period of time, pricing for these\ntwo models tends to converge.\n\n## Industry Trends\n\n **Mobile device integration.** Systems are starting to introduce native apps\nfor mobile devices that can be used for administrative purposes or to connect\nwith parents. For example, some apps may allow you to track child arrivals and\ndepartures by asking parents to check in and out of your center with a tablet\nplaced near the entrance. On the other hand, some apps are meant to be\ndownloaded by parents and can be used as a platform to exchange pictures and\nmessages about their children with your staff.\n\n **Staff training and development.** If you want to attract and retain great\nemployees, you may want to consider offering them professional development\nopportunities, such as enrolling them in online child care courses. Software\ncan help you keep track of which staff members have completed training\nprograms and received certifications.\n\n  * About Us\n\n  * Careers\n\n  * Vendors\n\n  * Blog\n\n  * View All Categories\n\n  * © 2006-2024 Software Advice, Inc.\n\n  * User Terms\n\n  * Vendor Terms\n\n  * Community Guidelines\n\n  * Content Policy\n\n  * Content Policy FAQs\n\n  * Cookie Policy\n\n  * Privacy Policy\n\n  * Data Protection Agreement\n\n",
    "links": "[{\"link\": \"https://www.softwareadvice.com/child-care/procare-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/procare-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/procare-profile/reviews/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/famly-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/famly-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/famly-profile/reviews/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/brightwheel-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/brightwheel-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/brightwheel-profile/reviews/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/himama-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/himama-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/himama-profile/reviews/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/sawyer-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/sawyer-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/sawyer-profile/reviews/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/edoptim-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/edoptim-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/alliance-core-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/alliance-core-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/alliance-core-profile/reviews/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/jackrabbit-care-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/jackrabbit-care-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/jackrabbit-care-profile/reviews/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/kangarootime-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/kangarootime-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/kangarootime-profile/reviews/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/playground-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/playground-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/playground-profile/reviews/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/kidgenius-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/kidgenius-profile/\", \"text\": \"KidGenius\"}, {\"link\": \"https://www.softwareadvice.com/child-care/kidgenius-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/kidgenius-profile/reviews/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/kidkare-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/kidkare-profile/\", \"text\": \"KidKare Food Program\"}, {\"link\": \"https://www.softwareadvice.com/child-care/kidkare-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/kidkare-profile/reviews/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/cheqdin-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/cheqdin-profile/\", \"text\": \"Cheqdin\"}, {\"link\": \"https://www.softwareadvice.com/child-care/cheqdin-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/cheqdin-profile/reviews/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/mykidzday-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/mykidzday-profile/\", \"text\": \"myKidzDay\"}, {\"link\": \"https://www.softwareadvice.com/child-care/mykidzday-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/mykidzday-profile/reviews/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/tuition-express-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/tuition-express-profile/\", \"text\": \"Tuition Express\"}, {\"link\": \"https://www.softwareadvice.com/child-care/tuition-express-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/tuition-express-profile/reviews/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/whally-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/whally-profile/\", \"text\": \"Whally\"}, {\"link\": \"https://www.softwareadvice.com/child-care/whally-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/daycare-works-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/daycare-works-profile/\", \"text\": \"SchoolCare Works\"}, {\"link\": \"https://www.softwareadvice.com/child-care/daycare-works-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/daycare-works-profile/#reviews\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/jovial-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/jovial-profile/\", \"text\": \"Jovial\"}, {\"link\": \"https://www.softwareadvice.com/child-care/jovial-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/jovial-profile/#reviews\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/kaymbu-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/kaymbu-profile/\", \"text\": \"Kaymbu\"}, {\"link\": \"https://www.softwareadvice.com/child-care/kaymbu-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/kaymbu-profile/reviews/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/active-educate-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/active-educate-profile/\", \"text\": \"ACTIVE Educate\"}, {\"link\": \"https://www.softwareadvice.com/child-care/active-educate-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/active-educate-profile/reviews/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/p/all/\", \"text\": \"View all products\"}, {\"link\": \"https://www.softwareadvice.com/child-care/brightwheel-profile/vs/himama/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/marketing-360-profile/vs/procare/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/kidkare-profile/vs/regpack/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/sawyer-profile/vs/smartcare/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/sandbox-child-care-management-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/sandbox-child-care-management-profile/\", \"text\": \"Sandbox ChildCare Management\"}, {\"link\": \"https://www.softwareadvice.com/child-care/famly-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/famly-profile/\", \"text\": \"Famly\"}, {\"link\": \"https://www.softwareadvice.com/child-care/ez-care-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/ez-care-profile/\", \"text\": \"EZCare\"}, {\"link\": \"https://www.softwareadvice.com/child-care/timesavr-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/timesavr-profile/\", \"text\": \"TimeSavr\"}, {\"link\": \"https://www.softwareadvice.com/child-care/himama-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/himama-profile/\", \"text\": \"Lillio\"}, {\"link\": \"https://www.softwareadvice.com/child-care/brightwheel-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/brightwheel-profile/\", \"text\": \"brightwheel\"}, {\"link\": \"https://www.softwareadvice.com/child-care/kaymbu-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/kaymbu-profile/\", \"text\": \"Kaymbu\"}, {\"link\": \"https://www.softwareadvice.com/child-care/kinderlime-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/kinderlime-profile/\", \"text\": \"Procare Online\"}, {\"link\": \"https://www.softwareadvice.com/child-care/bloomz-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/bloomz-profile/\", \"text\": \"Bloomz\"}, {\"link\": \"https://www.softwareadvice.com/child-care/childcarecrm-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/childcarecrm-profile/\", \"text\": \"ChildcareCRM\"}, {\"link\": \"https://www.softwareadvice.com/child-care/illumine-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/illumine-profile/\", \"text\": \"Illumine\"}, {\"link\": \"https://www.softwareadvice.com/child-care/procare-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/procare-profile/\", \"text\": \"Procare Solutions\"}, {\"link\": \"https://www.softwareadvice.com/child-care/kangarootime-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/kangarootime-profile/\", \"text\": \"Kangarootime\"}, {\"link\": \"https://www.softwareadvice.com/child-care/tadpoles-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/tadpoles-profile/\", \"text\": \"Tadpoles\"}, {\"link\": \"https://www.softwareadvice.com/child-care/smartcare-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/smartcare-profile/\", \"text\": \"Smartcare\"}, {\"link\": \"https://www.softwareadvice.com/child-care/marketing-360-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/marketing-360-profile/\", \"text\": \"Marketing 360\"}, {\"link\": \"https://www.softwareadvice.com/child-care/regpack-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/regpack-profile/\", \"text\": \"Regpack\"}, {\"link\": \"https://www.softwareadvice.com/child-care/lifecubby-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/lifecubby-profile/\", \"text\": \"LifeCubby\"}, {\"link\": \"https://www.softwareadvice.com/child-care/xplor-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/child-care/xplor-profile/\", \"text\": \"Xplor Education\"}]"
}