{
    "summary": "Turn on more accessible mode\n\nTurn off more accessible mode\n\nAgency Directory  Online Services\n\n__ Facebook __ Instagram __ Twitter  \n__ Linkedin __ YouTube\n\nToggle navigationMenu __\n\n  * Consumers\n  * Agents/Agencies\n  * Companies\n  * Regulation\n  * Funds\n  * About OCI\n  * Complaints\n\nSearch Office of the Commissioner of Insurance Go\n\nOCI > Public Adjuster\n\n#  Public Adjuster\n\nContent_Area1\n\n​​​​​​​​​​​​​​​​​​​ _​​​Last Updated: November 21,​\n2023_​​​​​​​​​​​​​​​​​​​​​​​​​  \n\nJump to Section: Public Adjuster Registration​ | Resident Initial |\nNonresident Initial | Bond Requirements | Resident Renewal and CE |\nNonresident Renewal and CE | Reporting Requirements | List of Registered\nPublic Adjusters | ​​Public Adjuster Contract Re​quirements​\n\n* * *\n\n​\n\n###  ​​Public Adjuster Registration  \n\nEffective July 1, 2020, the Office of the Commissioner of Insurance will\nregister public adjusters in Wisconsin per Wisconsin Act 129 _  ​_​​​. ​  \n\nA public adjuster is defined as an individual who engages in adjusting\nservices in this state and in the case of an individual who is not a resident\nof this state, has registered with the commission under s. 629.02 ​​​(2), Wis.\nStat. _  ​_​​, but does not include any of the following:  \n\n  * ​An attorney​ admitted to practice in this state while acting in his or her professional capacity as an attorney.  \n\n  * An individual who negotiates or settles claims arising under a life insurance policy, a policy of disability insurance, as defined in s. 645.675(1)(h), Wis. Stat. _  ​_​, or an annuity contract.  \n\n  * An individual employed solely for the purpose of obtaining facts surrounding a loss of furnishing technical assistance to the public adjuster, including a photographer, estimator, private investigator, engineer, or handwriting expert.  \n\n  * An individual who settles subrogation claims between insurers.  \n\n  * An individual who is licensed as an intermediary under s. 628.04, Wis. Stat _  ​_​. or s. 628.09, Wis. Stat _  ​_​​. while acting in his or her professional capacity as an intermediary.  \n\n  * An individual who represents an insurer in negotiations for the settlement of a claim against the insurer arising out of the coverage provided by an insurance policy.  \n\n​Adjusting services means to act on behalf of an insured, exchange for\ncompensation, with the preparation, completion, or filing of a first-party\nclaim including by negotiating values, damages, or depreciation or by applying\nthe loss circumstances to insurance policy provisions.\n\n​  \n\nFor more information, please refer to s. 629, Wis. Stat. and the F​AQs.\n\n​\n\n​​[Back to Top]  \n  \n\n### Resident Initial Application Requirements  \n\nResidents of Wisconsin may (but are not required to) apply for a public\nadjuster registration following the steps below:​\n\n\n\n  1. Download and review the Wisconsin Candidate Information Bulletin​ for detailed information. \n  2. ​Contact PSI to schedule an exam reservation. The exam Fee is $​50. The easiest way to register is online at PSI WI exams _  ​_​​ or by phone at 800-733-9267.\n  3. Review the examination content outline for public adjuster located in the Wisconsin Candidate Information Bulletin​. You may also take practice tests _  ​_​​ prior to taking your state exam.\n  4. You must bring at least two forms of identification to the test center in order to take the exam. The exam score result(s) will be available after completing the exam(s).\n  5. Apply for your registration via NIPR at nipr.com​  _  ​_​​ or through an authorized NIPR business partner. The application fee is $50 plus a NIPR processing fee. You must wait 48 to 72 hours after passing the examination for exam scores to be recorded with NIPR before you will be allowed to submit the electronic application.​\n\n> If you cannot find the selection you wish to apply for, make sure any\n> previous order(s) are removed/deleted. Start the NIPR application process\n> again, and Public Adjuster should appear. If not, please contact NIPR\n> Customer Service for assistance.  \n>\n>\n>  \n> If you have administrative action against you in any state, even if they are\n> not recent, be sure to disclose them on the application. Also disclose any\n> child support or tax delinquencies, or any criminal charges or convictions.\n> If you are unsure whether something needs to be reported, we encourage you\n> to err on the side of reporting. You will avoid an application denial based\n> on your failure to report.\n\n  \n\nOnce the application has been submitted, the following is **required** to be\nsubmitted before the application will be processed:\n\n\n\n  1. A new **original** performance bond (signed and sealed). See bond requirements section.  \n\n  2. Applicant must submit the following to ociagentlicensing@wisconsin.gov\n\n    * ​Address of home office in state of residence  \n\n    * A written statement attesting to your availability to the public through reasonable appointment or regular business hours.​​  \n\nOnce your application has been submitted to OCI, you will have 90 days to\nsubmit any required information/requirements. Failure to supply the required\ndocumentation will cause your application to be CLOSED as EXPIRED. Fees are\nnon-refundable.\n\n  \n\nIf you applied for a license or registration type in error, you will need to\nsubmit a written request to our office requesting the withdrawal of the\napplication. The application process and the withdrawal of the application\nrepresent an administrative expense for the agency and, therefore, the fees\nare non-refundable.  \n  \n\n​[Back to Top]  \n\n  \n\n​​\n\n### Nonresident Initial Application Requirements  \n\nNonresidents are **required  ** ****​to be registered in Wisconsin prior to\nengaging in adjusting services in this state.​\n\n  \nNonresident applicants must have passed a written examination in their home\nstate to obtain registration in Wisconsin or if your home state does not\nlicense/register public adjusters, individuals must then complete the\nWisconsin public adjuster exam through PSI (see above). The commissioner may\nrequest proof of a passing exam in order to verify examination requirement.  \n\n\n\nNonresidents of Wisconsin may apply for public adjuster registration by\nsubmitting an application via NIPR at  nipr.com _  ​_​​ or through an\nauthorized business partner. The application fee is $50 plus a NIPR processing\nfee.\n\n\n\nOnce the application has been submitted, the following is required to be\nsubmitted before the application will be processed:  \n\n  1. A new **original** performance bond (signed and sealed). See bond requirements section.  \n\n  2. Applicant must submit the following to ociagentlicensing@wisconsin.gov.​\n\n    * ​Address of home office in state of residence  \n\n    * A written statement attesting to your availability to the public through reasonable appointment or regular business hours.​​​  \n\n​[Back to Top]  \n  \n\n### ​Bond Requirements  \n\nPrior to the registration approval as a public adjuster and for the duration\nof the registration, the applicant shall secure evidence of financial\nresponsibility in a format prescribed by the insurance commissioner through\nbond per s. 629.082, Wis. Stat.  _  ​_​.  \n\nA bond executed and issued by an insurer authorized to issue surety bonds in\nthis state, which bond:\n\n  * Shall be in the minimum amount of $20,0000;  \n\n  * Shall be favor of this state and shall specifically authorize recovery by the commissioner on behalf of any person in this state who sustained damages as the results of erroneous acts, failure to act, conviction of fraud, or conviction of unfair practices in his or her capacity as a public adjuster; and  \n\n  * Shall not be terminated unless at least 30 days prior written notice will have been filed with the commissioner and given to the registrant.  \n\nAn OCI Bond Template​​​ has been created and can be used to satisfy the bond\nrequirement.  \n\n​[Back to Top]  \n  \n\n###  ​Resident Renewal of Registration and Continuing Education Requirements  \n\nPublic adjusters renew every two years from the date of issuance on the last\nday of that month. Resident public adjuster must complete on a biennial basis,\na minimum of 15 credits of continuing education (CE), including three credits\nof ethics per s. 629.11, Wis. Sta​t. ​​ _  ​_​.  \n\nPublic adjusters are encouraged to complete CE courses online to avoid delay\nin renewing their registration. The following link contains information\nregarding online CE options: sbs.naic.org/solar-external-lookup _  ​_​​.  \n\nPublic adjuster registrations are available to renew 60 days prior to the\nregistration expiration date. CE must be completed and submitted to OCI by the\neducation providers prior to submitting your renewal application. The renewal\napplication can be submitted via NIPR at nipr.com _  ​_​​. The renewal fee is\n$50 plus a NIPR processing fee.​  \n\nPlease note: If you hold both a public adjuster registration and intermediary\n(producer) individual license, CE completed will count towards both CE\nrequirements. For example, a completed course for your producer license will\nalso count towards your public adjuster CE requirements. ​  \n\nPublic adjuster registrations are **not**  eligible for reinstatement. If the\nrenewal is not paid by the expiration date, the registration will be canceled\nand you must re-take the examination, ​re-apply, pay applicable fees, and\nsubmit required documentation.  \n\n​[Back to Top]​\n\n  \n\n### Nonresident Renewal of Registration and Continuing Education Requirements  \n\nNonresident public adjuster renew every two years from the date of issuance on\nthe last day of that month. Nonresident public adjusters who comply with CE\nrequirements in their home state that are substantially similar to the\nrequirements in Wisconsin will satisfy CE requirement in this state per s.\n629.11 (2), Wis. Stat.​  _  ​_​​.\n\nIf your resident state does NOT have CE requirements, you must complete\nWisconsin CE requirements in order to renew your registration. You will be\nrequired to complete 15 credits of CE, including 3 credits of ethics per s.\n629.11, Wis. Stat.​  _  ​_​.  \n\nThe following link contains information regarding online CE options:\nsbs.naic.org/solar-external-lookup _  ​_​​​.\n\nPublic adjuster registrations are available to renew 60 days prior to the\nregistration expiration date. CE must be completed and submitted to OCI by the\neducation provider prior to submitting your renewal application. The renewal\napplication can be submitted via NIPR at nipr.com​  ​​​​. The renewal fee is\n$50 plus a NIPR processing fee.\n\nPublic adjuster registrations are not eligible for reinstatement. If the\nrenew​al is not paid by the expiration date, the registration will be canceled\nand you must reapply, pay applicable fees, and submit required documentation.  \n\n[Back to Top]  \n  \n\n###  Reporting Requirements​​  \n\nAll public adjusters working in Wisconsin must report the following within 30\ndays per s.629.12 Wis​. Stat​.  _  ​_​.  \n\n  * Any administrative action related to the business of insurance that is taken against the public adjuster by a governmental agency or regulatory body. The report shall be made no later than 30 days after the final disposition of the matter and shall include a copy of the order, consent to order, or similar document.\n\n  * Any criminal prosecution taken against the public adjuster in any jurisdiction. The report shall be made no later than 30 days after the date of the initial pretrial hearing and shall include a copy of the complaint, the order from the hearing, and any other information required by the commissioner.\n\n  * OCI recommends all adjusters report any address changes, name changes, or any other changes that were initially submitted on original registration application to be reported within 30 days.  \n\n​​​[Back to Top]​  \n  \n\n### Li​st of Registered Public Adjus​​ters\n\nOCI is required by s. 629.02 (1), Wis. Stat. to maintain a list of public\nadjusters registered with our office available to the public. ​  \n\nNonresident public adjusters are required to obtain the registration and will\nbe listed. Wisconsin resident public adjusters will not appear on the list\nunless they chose to apply for registration with OCI. If you are a resident\npublic adjuster and you would like your name to appear on this list, follow\nthe instructions to obtain a registration.  \n\n**To look up look up registered public adjusters in Wisconsin**  click here​\n**​.**  You must enter the Jurisdiction (Wisconsin), the Search Type\n(Licensee), and Entity Type (Individual or Business Entity). Enter one of more\nfields asking for name or license number. Select Advanced Criteria, choose\nLicense Type (Public Adjuster) and License Status (A​ctive).  \n\n​[Back to Top]  \n\n  \n\n### ​Public Adjuster Contract Requirements​  \n\n​Public adjusters are required to file their contracts with OCI prior to\nperforming any adjusting service for an insured per s. 629.04 (1), Wis. Stat.\nPlease refer to the Policy Forms and Rates Filings portion of our website for\na guide on submitting the contract filing to our office. Select the Public\nAdjuster Form Filing Checklist for details on specific filing requirements.\nContracts should be emailed to ocipublicadjusters@wisconsin.gov.​​​  \n\n​[Back to Top]  \n\nContent_Area2\n\n​\n\n  \n  Chat with an Agent  \nLicensing Representative\n\nMo​​nday and​ W​ednes​day  \n7:45 a.m. - 4:30 p.m.​​​​\n\n​  \n  \n  \n\n#### Street Address\n\n  * Office of the Commissioner of Insurance   \n125 South Webster St.  \nMadison, WI 53703-3474\n\n  * __ (608) 266-3585 \n  * __ Contact Us \n\n#### Stay Connected\n\nSign up to receive agency news, announcements, regulations, and more.  \n  \nSubscribe\n\n#### OCI Complaints\n\n  * __ 1-800-236-8517 \n  * File a Complaint \n\n#### Additional Information\n\n  * Disclaimer \n  * Access to Public Records \n  * Support \n  * Wisconsin Insurance Laws and Regulations \n  * Translation Disclaimer \n  * Select Language​▼\n\nOriginal text\n\nRate this translation\n\nYour feedback will be used to help improve Google Translate\n\n",
    "links": "[{\"link\": \"https://oci.wi.gov/pages/homepage.aspx\", \"text\": \"\"}, {\"link\": \"https://oci.wi.gov/Pages/ConsumersHome.aspx\", \"text\": \"Consumers\"}, {\"link\": \"https://oci.wi.gov/Pages/AgentsHome.aspx\", \"text\": \"Agents/Agencies\"}, {\"link\": \"https://oci.wi.gov/Pages/CompaniesHome.aspx\", \"text\": \"Companies\"}, {\"link\": \"https://oci.wi.gov/Pages/RegulationHome.aspx\", \"text\": \"Regulation\"}, {\"link\": \"https://oci.wi.gov/Pages/FundsHome.aspx\", \"text\": \"Funds\"}, {\"link\": \"https://oci.wi.gov/Pages/AboutOCIHome.aspx\", \"text\": \"About OCI\"}, {\"link\": \"https://oci.wi.gov/Pages/Consumers/Types-of-Complaints.aspx\", \"text\": \"Complaints\"}, {\"link\": \"https://oci.wi.gov/Pages/Homepage.aspx\", \"text\": \"OCI\"}, {\"link\": \"https://oci.wi.gov/Documents/AgentsAgencies/PublicAdjusterFAQ.pdf\", \"text\": \"F​AQs\"}, {\"link\": \"https://oci.wi.gov/Documents/AgentsAgencies/ALWisconsinCandidateBulletin.pdf\", \"text\": \"Wisconsin Candidate Information Bulletin​\"}, {\"link\": \"https://oci.wi.gov/Documents/AgentsAgencies/ALWisconsinCandidateBulletin.pdf\", \"text\": \"Wisconsin Candidate Information Bulletin\"}, {\"link\": \"https://oci.wi.gov/Pages/Agents/PublicAdjuster.aspx\", \"text\": \"\"}, {\"link\": \"https://oci.wi.gov/Documents/AgentsAgencies/ALPublicAdjusterBondTemplate.pdf\", \"text\": \"\"}, {\"link\": \"https://oci.wi.gov/Pages/Companies/PolicyFormsAndRateFilings.aspx\", \"text\": \"Policy Forms and Rates Filings\"}, {\"link\": \"https://oci.wi.gov/Pages/Agents/OCI-Agent-Licensing-Live-Chat.aspx\", \"text\": \"\"}, {\"link\": \"https://oci.wi.gov/Pages/AboutOCI/OCIAddPhone.aspx\", \"text\": \"\"}, {\"link\": \"https://oci.wi.gov/Pages/AboutOCI/ListServe.aspx\", \"text\": \"\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\tSubscribe\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n                                                \\n                                                \\n                                                \\n                                                \\n                                                \\n                                                \\n                                                \\n                                                \\n                                                \\n                                                \\n                                                \\n                                                \\n                                                \"}, {\"link\": \"https://oci.wi.gov/Pages/Consumers/Types-of-Complaints.aspx\", \"text\": \"\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\tFile a Complaint\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n                                                        \\n                                                        \\n                                                        \\n                                                        \\n                                                        \\n                                                        \\n                                                        \\n                                                        \\n                                                        \\n                                                        \\n                                                        \\n                                                        \\n                                                        \"}, {\"link\": \"https://oci.wi.gov/Pages/AboutOCI/Disclaimer.aspx\", \"text\": \"Disclaimer\\n                                                        \\n                                                        \\n                                                        \\n                                                        \\n                                                        \\n                                                        \\n                                                        \\n                                                        \\n                                                        \\n                                                        \\n                                                        \\n                                                        \\n                                                        \"}, {\"link\": \"https://oci.wi.gov/Pages/AboutOCI/OpenRecords.aspx\", \"text\": \"Access to Public Records\\n                                                        \\n                                                        \\n                                                        \\n                                                        \\n                                                        \\n                                                        \\n                                                        \\n                                                        \\n                                                        \\n                                                        \\n                                                        \\n                                                        \\n                                                        \"}, {\"link\": \"https://oci.wi.gov/Pages/WebSupport.aspx\", \"text\": \"Support\\n                                                        \\n                                                        \\n                                                        \\n                                                        \\n                                                        \\n                                                        \\n                                                        \\n                                                        \\n                                                        \\n                                                        \\n                                                        \\n                                                        \\n                                                        \"}, {\"link\": \"https://oci.wi.gov/Pages/Regulation/WisInsLawsandRegulations.aspx\", \"text\": \"Wisconsin Insurance Laws and Regulations\\n                                                        \\n                                                        \\n                                                        \\n                                                        \\n                                                        \\n                                                        \\n                                                        \\n                                                        \\n                                                        \\n                                                        \\n                                                        \\n                                                        \\n                                                        \"}, {\"link\": \"https://oci.wi.gov/Pages/Translate.aspx\", \"text\": \"\"}]"
}