{
    "summary": "Available by Phone 24/7:     401-200-4045\n\n__\n\n###  Have A Claim?\n\nClick For Status\n\nget_a_qoute REQUEST FREE CONSULTATION\n\n  * Home\n  * Services __\n    * Fire Damage\n    * Smoke & Soot Damage\n    * Water Damage __\n      * Plumbing Leaks\n    * Storm Damage __\n      * Roof Damage\n    * Mold Damage\n    * Roof Leak Damage __\n      * Ice Dam\n    * Business Interruption\n    * Vandalism Damage\n  * About Us __\n    * About Us\n    * FAQs\n    * Blog\n  * Testimonials\n  * Learning Center __\n    * What Is A Public Adjuster?\n  * Contact\n\nX\n\n__\n\n__\n\n###  Call Us\n\n__\n\n__\n\n__ Edit Content\n\n# What Is A Public Adjuster?\n\nYou may have just sustained property damage to your home, investment property,\nor business. Now all of your friends and family keep telling you to **hire a\npublic adjuster**. But what’s a public adjuster?\n\nIn short, a public adjuster is someone who is licensed and trained to help\nhome and business owners alike get the most money for their property damage\ninsurance claim. They  are hired by the property owner to work on their behalf\nfor their property damage. Since many homeowners don’t know that they have the\nright to a fair settlement by hiring an experienced public adjuster, we wanted\nto give you as much information as possible in this article.\n\nA public adjuster works as your advocate throughout the entire claims process.\nThey are trained to know how each and every state law and regulation works in\nregards to property damage. This includes local building codes and ordinances\nthat may apply to an insurance claim. Having the expertise of an insurance\nprofessional on your side can help you get a fair settlement for your damages\nwhile saving thousands on repairs if hired early enough after an incident\ntakes place.\n\nPublic adjusters charge a percentage fee but we feel it’s worth every penny\nwhen dealing with insurance companies who have no interest in taking care of\nyou fairly!\n\nAs always, please contact our office at any time so that one of our insurance\nclaim experts can answer any questions you might have about this article or\nanything else related to public adjusting.\n\nAs a homeowner, you should know that you have the option to hire a public\nadjuster when you have any kind of damage to your property. Read on to learn\nmore.\n\n####  Table of Contents\n\n  * __What Is A Public Adjuster?\n\n  *  __What Kind Of Claims Can A Public Adjuster Handle?\n\n  *  __What's The Difference Between A Public Adjuster, A Company Adjuster, and An Independent Adjuster?\n\n    *  __What Is A Company Adjuster?\n\n    *  __What Is An Independent Insurance Adjuster?\n\n  *  __When Should I Hire A Public Adjuster?\n\n  *  __What If I Already Filed A Claim?\n\n  *  __Should I Use A Public Adjuster If I Already Got Paid? (And Didn't Get Enough Money)\n\n  *  __How Much Does A Public Adjuster Cost?\n\n  *  __How Do Public Adjusters Determine Damage?\n\n  *  __When Should I Use A Lawyer To Fight My Insurance Company?\n\n  *  __What Should You Expect When Hiring A Public Adjuster?\n\n    *  __Insurance Claim Process\n\n  *  __How To Pick A Public Adjuster?\n\n  *  __About Performance Adjusting\n\n## What Is A Public Adjuster?\n\nA public adjuster, also known as a claims adjuster or public insurance\nadjuster, is someone that represents the homeowner in an insurance loss. They\nare not employed by the insurance company; they work on the homeowner’s\nbehalf. A claims adjuster negotiates with the insurance company in order to\nobtain a fair settlement to get the property back to its prior condition\nbefore the property loss took place.\n\nFrom the moment you call until the very last claim check has been sent out, a\npublic adjuster is there to handle the _entire_ claims process. They are\nlicensed professionals who will work on your behalf and handle any and all\ncommunications with the insurance carrier, conduct inspections of the\nproperty, and advise you on what should or shouldn’t be done to fix your\nproperty.\n\n## What Kind Of Claims Can A Public Adjuster Handle?\n\nA public adjuster can handle all property damage insurance claims. This means\nthey work with homeowners, investment property owners, and business owners\nwhen there is damage to the building or contents inside of it. Public\nadjusters advocate for the insured to ensure they receive proper compensation\nfor their insurance claim. At Performance Adjusting we help with:\n\n  * __ Fire Damage\n  * __ Soot & Smoke Damage\n  * __ Water Damage\n  * __ Mold Damage\n  * __ Wind & Storm Damage\n  * __ Roof Leak Damage\n  * __ Vandalism\n  * __ Business Interruption\n  * __ Vehicle Strike/Collision Damage\n  * __ Ice Dam Damage\n  * __ Plumbing Leak Damage\n\nPublic adjusters can be hired right after the damage occurs or even after a\nhomeowner has filed a claim. Hiring a claims adjuster will ensure that an\ninsured will receive a fair settlement from their insurance company.\n\n## What's The Difference Between A Public Adjuster, A Company Adjuster, and An\nIndependent Adjuster?\n\nAlthough these three titles sound very similar and self-explanatory, there is\na huge difference between leaving it up to your company or independent\nadjuster and using a public adjuster when you have property damage.\n\n### What Is A Company Adjuster?\n\nCompany adjusters work directly for a particular insurance company. A company\nadjuster will visit your home to assess all damages and losses from any peril\nthat may have occurred. A company adjuster will come after your claim has been\ncalled in and will provide an estimate to the insurance company they work for.\nGiven that a company adjuster works for the insurance company, they do not go\nthe extra mile to ensure the insured has enough money to repair their\nproperty. The payout of a claim may be _extremely different_ depending on\nwhether you use the adjuster provided by insurance carriers or a public\nadjusting firm.\n\n### What Is An Independent Insurance Adjuster?\n\nAn independent insurance adjuster is an adjuster who works for an insurance\ncompany to settle claims. Unlike a company adjuster, they are subcontractors\nand are hired on a per claim basis. Given that an independent adjuster is\nhired by the insurance company, they do not have the insured in mind when\nconducting their assessment. Independent adjusters do not detail a claim as a\npublic adjuster would, which may lead to an insufficient settlement.\n\n## When Should I Hire A Public Adjuster?\n\nYou wouldn’t go to court without a lawyer, so don’t file a property insurance\nclaim without a public adjuster. Regardless of the size of the damage, a\npublic adjuster will be able to help you with your claim. You have homeowners\ninsurance for a reason, so you shouldn’t leave it up to your insurance\ncompany’s adjuster.\n\nEven what seems like a small amount of damage, can be a lot larger than you\nwould think. Like this picture to the right, it may look like a small leak\ncoming through the ceiling from a burst pipe. But what about replacing the\nceiling? Or the contents (personal property) the water has damaged? Or maybe\nthat water yields secondary damage such as mold?\n\nPublic adjusters will not take more than the agreed-upon fee so that you can\nuse the total cost of the damage to fix your property. You will forget about\nthe small fee once you receive your insurance settlement check!\n\nIt is _important_ to know the extent of your property damage. What may seem\nsmall could be a fairly large claim in the end. A public adjuster can assess\nthis for you, look at your insurance policy, and determine if you should file\na claim.\n\n## What If I Already Filed A Claim?\n\nEven if you’ve already filed a claim, _you can still hire a public adjuster to\nrepresent you_. It’s almost never too late to get the help you need from\npublic adjusters to obtain a proper settlement from your insurance company.\n\nMany public adjusters offer a free assessment of your property damage, so you\ncan get an idea of what to expect from the claim and how much it will payout.\n\n## Should I Use A Public Adjuster If I Already Got Paid? (And Didn't Get\nEnough Money)\n\nThe _final_ settlement check doesn’t actually mean _final!_ Depending on how\nlong ago your date of loss was (the day you had the property damage) and the\nstatute of limitations in your state, you can still reopen your claim by using\npublic insurance adjusters. By doing so, you’ll be able to retrieve the money\nyou need to fix your damages even after you’ve been paid by your insurance\ncompany.\n\nHiring a public insurance adjuster is the best way to make sure you get all of\nyour money from insurance claims. Insurance companies aren’t always on your\nside, but public insurance adjusters will be!\n\n## How Much Does A Public Adjuster Cost?\n\nNot only are public adjusters hired to get you the most money to benefit you,\nbut it also benefits the adjuster. Public adjusters take on average 10% of the\nfinal settlement. Although sometimes you’ll see higher fees, up to 20%!\nNothing comes out of pocket and nothing gets taken away from the money you\nneed to fix your home or business back to pre-loss conditions. It makes sense\nto hire a public adjuster even though they cost a small percentage because\npublic adjusters can often get you more money than an insurance company.\n\nPublic adjusters are there to help you every step of the way, and they should\nbe able to tell you if it’s worth filing an insurance claim or not.\n\n## How Do Public Adjusters Determine Damage?\n\nPublic insurance adjusters use high-quality technology and proven techniques\nto uncover even the smallest damage for smaller claims. They’ll use tools like\nmoisture meters, laser tapes, soot sponges, and more to find everything that\nyour insurance company should pay out for your claim.\n\nWhen claim adjusters go through a property, they make sure to look at every\ndetail. They’ll be looking for things like fire damage, smoke stains, water\ndamage from burst pipes or flooding, wind damage from storms with high winds\nthat may have torn roofs off homes or ripped trees out of the ground, and\nother signs of damage.\n\nFrom taking pictures to going through the entire property room by room, public\nadjusters will make sure that your insurance company knows exactly what\nhappened and how much it’s going to take to fix everything.\n\n## When Should I Use A Lawyer To Fight My Insurance Company?\n\nWhen dealing with property damage, sometimes a policyholder hires an attorney\nor a lawyer to fight their claim instead of a licensed public adjuster. Most\nof the time it’s because they don’t know that they have the option to hire a\npublic insurance adjuster.\n\nThe only reasonable time to hire a lawyer for your insurance claim is if it is\ndenied or you believe the insurance carrier has demonstrated _bad faith_. If\nyour claim is denied, we as public adjusters can’t do anything about it. A\nlawyer can help you with this. If your claim is not denied, hiring a public\nadjuster is your best bet. It is more cost-effective and generally a better\nidea than the hassle and a higher fee associated with hiring a lawyer.\n\n## What Should You Expect When Hiring A Public Adjuster?\n\nWhen you choose to hire a public adjuster, they will work on the claim\npersonally, comparing cost estimates with the insurance company’s insurance\nclaims adjusters. Here is our process:\n\n### Insurance Claim Process\n\n  * __\n\n#### Insurance Policy Review\n\nOur licensed public adjusters will look at your insurance policy to determine\nhow we can help you recover financially.\n\n  * __\n\n#### Temporary Relocation\n\nIf you need a place to stay, we will find one. In the event that your home is\ndeemed “unsafe to inhabit”, we’ll connect you with a cozy temporary home.\n\n  * __\n\n#### On-Site Analysis\n\nUsing our advanced technology and techniques, we visit the site to prepare a\ndetailed estimate of the reparation costs and physical losses.\n\n  * __\n\n#### Photo Inventory\n\nWhile on-site, we will document everything to prove to the insurance companies\nthat the estimates we want them to pay are fair and accurate.\n\n  * __\n\n#### Communications\n\nWe handle all of the communication with the insurance company. Seriously. You\nwon’t get a phone call, text, or email (Unless we need to reach you).\n\n  * __\n\n#### Fight\n\nInsurance companies can be pesky when you try to get them to pay for your\ndamages, but we won’t back down. We will fight for every aspect of your claim,\nincluding dwelling (the physical structure of your home), other structures on\nyour property (fences, sheds, garages), damaged contents, business income, and\nloss of use (additional living expenses, business interruption, etc.).\n\n## How To Pick A Public Adjuster?\n\nIt’s pretty easy to find a public adjuster near you. But to find a good one,\nyou’ll need to do your research.\n\n  *  **How long have they been in business?** _(We’ve been around for 16 years!)_\n  *  **How many licensed adjusters do they have on staff?** _(We have 6 licensed adjusters!)_\n  *  **How are their connections to contractors to fix your property damage after you get your claim check?** _(Ours are great!)_\n  *  **How much of a fee are they going to take?** _(We only take 10%!)_\n\n## About Performance Adjusting\n\nPerformance Adjusting is a public adjusting firm located in North Providence,\nRhode Island. We have licensed insurance professionals who have been helping\nhomeowners get more money for their property damage and resuming business\noperations since 2005. Our adjusters attend continuing education on updates to\ninsurance policies, staying up to date with state law in the state they are\nlicensed in, and learn about all things homeowners insurance.\n\nUnlike other public adjusting companies, we have someone dedicated to every\nstep in the claims process from calling in your claim to handing you your\ncheck. We are licensed to help property owners with their property damage in\nRhode Island, Massachusetts, Connecticut, and Florida. Hiring our firm will\nsave you from dealing with a time-consuming home insurance claim so you can\nfeel confident that you got the settlement you deserved from your insurance\ncompany.\n\nWe offer free, no-strings-attached consultations for any amount of property\ndamage. One of our licensed public insurance adjusters will come out to your\ndamaged property to assess the damages, look at your insurance policy, and see\nhow we can help you.\n\nWe will help you understand your insurance coverage and advise on the best\ncourse of action. You can always request a public adjuster, but it is not\nrequired to hire one if you want to file a claim with your insurance carrier.\n\nWe have helped thousands of Rhode Island property owners get more money for\ntheir losses through claims negotiation or litigation against their insurers.\n\nGive us a call at 401-200-4045 or fill out our contact form to get started!\nWhether you have new property damage or are already struggling through the\ninsurance claim process, our public insurance adjusters will be happy to help\nyou.\n\n### Our Company\n\n  * Our Story\n  * News & Blog\n  * Careers\n  * Customer Support\n  * Contact Us\n  * Website Accessibility\n\n### Corporate Info\n\n  * Auto Insurance\n  * Home Insurance\n  * Claims\n  * Agent Locator\n  * Express Access\n  * Money Back Policy\n  * Life Insurance Companies\n\n### Get in touch\n\nWe’re here to listen:\n\n  * __ 2390 NW 2nd Ave, Miami FL 33127, USA\n  * __ **+1 (305) 677-3952**\n  * __ 9am to 7pm EST Monday to Friday\n\n### Newsletter\n\nReceive resources & tools that can help you prepare for the future. You can\ncancel anytime.\n\n__Subscribe Now\n\n###  Need help with your insurance claim?  \nCall us at 401-200-4045 for a **free, no-strings-attached** consultation!\n\n###  Need help with your insurance claim?  Call us at 401-200-4045 for a\n**free, no-strings-attached** consultation!\n\nThe highest settlement for your residential or commercial insurance claim in\nRhode Island, Massachusetts, Connecticut, and Florida. We take your stress\naway!\n\nSitemap\n\n  * Home\n  * Services\n  * About Us\n  * FAQs\n  * Blog\n  * Testimonials\n  * Contact\n\nServices\n\n  * Fire Damage\n  * Water Damage\n  * Smoke & Soot Damage\n  * Mold Damage\n  * Storm Damage\n  * Roof Leak Damage\n  * Vandalism\n  * Business Interruption\n\nContact us\n\n  * 401-200-4045\n  * Consultation Form\n  * 1525 Old Louisquisset Pike   \nLincoln, RI 02865\n\n© 2023 Performance Adjusting, All Rights Reserved\n\nFacebook __ Instagram __ Twitter __ Linkedin-in __ Youtube __\n\nEnglish Spanish\n\nEnglish\n\n",
    "links": "[{\"link\": \"https://performanceadjusting.com/\", \"text\": \"\"}, {\"link\": \"https://performanceadjusting.com/learn/what-is-a-public-adjuster/\", \"text\": \"What Is A Public Adjuster?\"}]",
    "priceAndPlans": "Error: Timeout 30000ms exceeded. =========================== logs\n=========================== navigating to\n\"http://web.archive.org/web/20230906172102/https://performanceadjusting.com/\",\nwaiting until \"load\"\n============================================================\n\n"
}