{
    "summary": "  * Home\n  * About\n    * Back\n    * Our Mission\n    * Staff\n    * Board\n    * Supporters\n    * Recognition\n    * Work with UP\n    * Volunteer with UP\n    * Contact UP\n  * Media\n    * Back\n    * UPdates\n      * Back\n      * UP in the News\n      * Tip of the Month\n      * Bach Talk\n      * Guest Blogs\n      * Catch UP\n      * Print News\n      * eNews\n    * Surveys\n    * Studies & Reports\n    * Share your story with the media\n  * Recovery Help\n    * Back\n    * Roadmap to Recovery®\n    * Disaster Recovery Help\n    * Claim Guidance Library\n    * State by State Help\n    * Sample Letters and Claim Documents\n    * Professional “Find Help” Directory\n    * Ask An Expert\n  * Get Prepared\n    * Back\n    * Roadmap to Preparedness\n    * Buying Tips Library\n    * WRAP Resource Center – Wildfire Mitigation Help\n    * Dropped by your home Insurer?\n    * Wise UP\n  * Advocacy\n    * Back\n    * How We Advocate\n    * Amicus Library\n    * Legislation\n    * Regulation\n    * UP at the NAIC\n  * Events\n    * Back\n    * Program Events\n    * Fundraising Events\n      * Back\n      * Online Auction\n  * Community\n    * Back\n    * Ask An Expert\n    * Forums\n  * Support UP\n\n  * Log In \n  * Ask An Expert\n  * Forums\n\nSearch for:\n\n  * Home\n  * About\n    * Our Mission\n    * Staff\n    * Board\n    * Supporters\n    * Recognition\n    * Work with UP\n    * Volunteer with UP\n    * Contact UP\n  * Media\n    * UPdates\n      * UP in the News\n      * Tip of the Month\n      * Bach Talk\n      * Guest Blogs\n      * Catch UP\n      * Print News\n      * eNews\n    * Surveys\n    * Studies & Reports\n    * Share your story with the media\n  * Recovery Help\n    * Roadmap to Recovery®\n    * Disaster Recovery Help\n    * Claim Guidance Library\n    * State by State Help\n    * Sample Letters and Claim Documents\n    * Professional “Find Help” Directory\n    * Ask An Expert\n  * Get Prepared\n    * Roadmap to Preparedness\n    * Buying Tips Library\n    * WRAP Resource Center – Wildfire Mitigation Help\n    * Dropped by your home Insurer?\n    * Wise UP\n  * Advocacy\n    * How We Advocate\n    * Amicus Library\n    * Legislation\n    * Regulation\n    * UP at the NAIC\n  * Events\n    * Program Events\n    * Fundraising Events\n      * Online Auction\n  * Community\n    * Ask An Expert\n    * Forums\n  * Support UP\n\n  *   * \n\n# Claim Guidance Library\n\n  * Browse:\n  * Home\n  * Claim Guidance\n  * Questions to Ask Before Hiring a Public Adjuster\n\n  * Fire\n  * Hail\n  * Homeowners\n  * Hurricane\n  * Smoke and Extreme Heat\n  * Water Damage\n  * Windstorm\n\n  * __ Share\n\n    * __\n    * __\n    * __\n\n  * __ Print\n  * __ PDF\n\nRoadmap to Recovery __\n\nTaking Care of Yourself Along the Way\n\nGetting help if/when you need it\n\nWorking with Your Mortgage Company\n\n# Questions to Ask Before Hiring a Public Adjuster\n\n**Many people describe their experience with an insurance claim after a large\nloss as a full-time job.   The claim process involves legwork, paper work,\nmath, insurance rules, and negotiation.   Listing, describing and valuing\neverything that was damaged or destroyed, meeting with adjusters, inspectors\nand contractors and reviewing reports and estimates is time-consuming and\nlabor-intensive.  On top of that, negotiating a fair claim settlement can be\nvery challenging – especially after an emotionally devastating catastrophe.\nUP offers tips and tools to help you handle your claim on your own.  After\nall, the insurance protection you paid for includes good claim service.**\n\nBut insurance is big business, and you are not on a level playing field with a\nbig insurance company.  You may find that learning the lingo, doing the math\nand making sure your claim is being fully investigated and fairly paid is too\nmuch for you to handle on your own.   Depending on your situation; work\ncommitments, health, car pool duty, an uncooperative insurer, etc., it may\njust not be practical to try.  Each person’s experience and situation is a\nlittle different, so when it comes to making the decision whether or not to\nhire a professional to take the insurance claim challenges off your plate, the\nonly “right” choice is the one that works for your personal situation.\n\nIf you are having problems with your insurer, or if your personal or\nprofessional situation is making it hard for you to deal with all the details,\nyou can hire a claim help professional.   In most parts of the U.S. today, you\ncan hire a licensed public adjuster on a “contingent” (percentage) fee basis\nwho will take over handling your claim and negotiate a settlement on your\nbehalf.  A public adjuster is a claim help professional you can hire to\nrepresent you in documenting and negotiating your insurance claim.   A public\nadjuster works only for policyholders, not insurers.\n\nThere are two other types of adjusters: Company, or “staff” adjusters who are\nemployed by your insurance company, and so-called “independent” adjusters who\nwork only for insurance companies on a contract hiring basis. Company/staff\nand independent adjusters are hired and paid by and report only to insurance\ncompanies, not policyholders. They will be assigned by your insurance company\nto work on your claim, but they are there as the insurance company’s\nrepresentative… not yours.\n\nOnce you decide you want to hire claim help, the key is to find an experienced\npublic adjuster with good references who will take you on as a client for a\nfair price.  The larger your claim, the easier it will be to find someone who\nfits that bill.   Many of the most experienced public adjusters prefer to\nhandle large dollar and commercial claims because they generate higher fees.\nBe extra careful checking references before hiring a public adjuster for a\nsmaller dollar loss.  Smaller losses can be just as time-consuming as larger\nlosses, so you want to make sure the person you hire isn’t going to sign you\nup then spend their time on larger losses and leave you hanging.  As with all\nprofessionals, it’s important to check references carefully and hire someone\nyou trust and feel comfortable working with.   You can use United\nPolicyholders’ “Find Help” directory, to locate professionals in your area.\n\nYour insurance company may assign one or many different adjusters to your\nclaim over the course of time. Each one may have a different approach and\nlevel of experience. One may have very little experience and be difficult to\ncommunicate with, another may be very friendly and have a lot of experience.\nMany people report to United Policyholders that their first adjuster offered\nthem a settlement sum, then left the company or was reassigned and when a new\nadjuster came on, that new adjuster rescinded the offer or made them start\nfrom scratch on the claim. We refer to that problem as “rotating adjusters.”\nUnited Policyholders has helped pass laws that require insurers to provide\nclaim status reports to protect consumers from frustration, delays and\nconfusion due to rotating adjusters.\n\nWhen you file a claim, you may be fine on your own, or you may do better by\nhiring help.  It’s an individual decision you should make based on your own\ncircumstances.  A licensed Public Adjuster can be your representative and\nadvocate in the process of getting your claim “adjusted” (processed) and\n“settled”, (paid). As with any professional, some Public Adjusters are better\nthan others. The last thing you need when you’ve suffered a major loss is\nextra problems, so screen carefully before you hire. Resist high-pressure\nsales pitches and don’t hire prematurely.\n\n### **Questions to Ask Before Hiring a Public Adjuster**\n\n  1. **Are you licensed to practice public adjusting in my state?   **Be sure you are hiring a  _licensed_  Public Adjuster. Ask to see their individual Public Adjuster’s license.  Some Public Adjusters work under the license of another individual or firm, rather than becoming qualified and credentialed individually.  Ideally the public adjuster you hire should be experienced, local or affiliated with a reputable local company, and have a clean record with the authorities.\n  2. **Will you be handling my claim personally?   **Are you interviewing the individual(s) who will actually be adjusting the loss?  Or is the person simply a sales rep, who will hand off your claim to someone else?\n  3. **How many other claims have you signed up in this area?   **(post disaster) If a public adjuster takes on more claims than he/she can handle, you won’t get the attention and care you need.\n  4. **Tell me about your claim adjusting and construction estimating skills, credentials and experience?**  How many years have they been licensed as a Public Adjuster, and how long have they been practicing in your state?\n  5. **Please give me at least three references of local clients who were satisfied with your work.   **Ask the Public Adjuster you are interviewing to give you a list of references for claims he or she has personally handled in the past 3 years. (Some adjusters move around among companies and have short-lived associations with the firm they currently represent.)\n  6. **Let’s talk about the fee contract.   **Most Public Adjusters work on contingency fees that range from 5% to 15% of the monies the insurer pays on your claim. These fees are capped in some states and negotiable in all states. The fee you agree to pay a Public Adjuster should take into account the size and type of your loss and the status of your claim. Make sure you agree up front on whether or not the Public Adjuster will get a percentage of monies the insurer already agreed in writing to pay but has not actually paid yet.  If you only want the public adjuster to handle portions – not all – of your claim, you need to negotiate that up front.\n  7. ** ** **If I hire you, can I still communicate with the insurer/company adjuster?   **  If you want to stay involved in your claim, discuss that fact with the public adjuster before hiring him/her.\n  8. **Will your/your company’s name be on every check the insurance company issues after I hire you?   **Some public adjusters will not take a fee on Additional Living Expense and/or other categories of insurance benefits.  Make sure you reach an understanding on this before you enter into a contract.\n  9.   **If for some reason I want to terminate the contract before a settlement has been finalized, can I, and how much will I owe you?**\n  10. **Will you be working with a specific attorney/law firm on my claim?**\n\nNote: In some states Public Adjusters cannot charge contingent fees unless\nthey are associated with an attorney because it is considered the unauthorized\npractice of law.\n\n**Things to consider before entering into the contract:**\n\n  1.  Is the adjuster a good fit?  You may be working closely with this person for many months, and they will be representing you with your insurer, so you should be comfortable with their communication style and personality.\n  2. Do they have good references and are they genuine?  Before hiring a public adjuster, call and speak directly with at least two of their references.  Here are a few of the questions you should ask the references: \n    * Did ________ adjuster personally work on your claim?\n    * Did you feel reasonably good about the result?\n    * Did __________ stay in touch with you, answer your questions and keep you informed?\n    * Did he/she take the load off you and add value/get you a fair settlement?\n    * Did he/she charge a fee on all categories of coverage or just dwelling and contents?\n    * How was the fee calculated?\n  3. Don’t be rushed into hiring someone before you are ready to.  Especially after disasters, you may be hit with aggressive sales pitches from contractors, adjusters and others.   Resist the pressure and make an informed decision.  Many states now restrict post-catastrophe solicitations.  Ask all the questions you need to ask until you feel confident in your decision and selection of a public adjuster.  They will be part of your insurance recovery process for as long as it takes to settle the claim and recover all the financial benefits you are entitled to under the terms and conditions of your policy and the laws in your state.\n  4. Contractors and social service agency Case Managers are not authorized to represent you in insurance claim negotiations, nor are they professionally licensed or regulated by your state insurance department/agency to do so.  A lawyer can represent you in claim negotiations, but generally speaking, it doesn’t make economic sense to hire one to adjust your loss.\n  5. If you get into a dispute with your public adjuster, do your best to resolve it informally with them and with help from their trade association in your state. If there is no Public Adjuster trade association in your state, contact the National Association of Public Insurance Adjusters, (NAPIA) and seek their help resolving the dispute. If that doesn’t help, file a complaint with your state regulator. Public adjusters are regulated by state insurance regulators.If you’re still undecided on whether or not you need a public adjuster, visit our Professional Help Directory and read; “Hiring a Public Adjuster – The Inside Scoop”. \n\n  6. Claim adjusting is art, not science.  If you rely completely on your insurance company to calculate the amount of damage and what you’re owed, you’re unlikely to recover a full or fair settlement.   The insurance company sends out their own staff adjuster or “independent” adjuster, and their handpicked contractor, whose job it is to define a scope of the damage and estimate the costs to repair or rebuild your home. They measure the loss for the insurance company, not for you. This matters because big dollars are at stake and your financial goals and the insurers’ financial goals are not the same.   You want your loss to be accurately measured, you want to maximize your insurance coverage and recover every dime you’re owed.  Many people hire their own experts/contractors to measure and value damage independently from the insurance company.\n\n**Recap:**\n\nDocumenting and navigating a catastrophic property loss is time-consuming and\nburdensome to even the most sophisticated insured.  It is hard for you, the\ninsured, to know whether you are getting all that is owed under your insurance\npolicy. Your policy may actually give you extended coverages beyond the stated\ndollar limits on the policy and way more than the insurer offers you.  An\nexperienced claim advocate on your side can be a strong voice for you in the\nprocess and give you much more input and negotiating leverage on your final\ninsurance settlement than you’d have on your own.   Instead of relying on the\ninsurance company to decide how much you get to rebuild your home, hiring a\ngood public adjuster can help you receive the best possible settlement.\n\nIt’s essential to check references and agree on fees and terms before entering\ninto a contract with a public adjuster.   Once the contract is executed, you\nare obligated to pay for services rendered during the contract term.\n\nVisit the United Policyholders Claim Help Library, read your policy and\nendorsements, (extras), and make sure to review the policy with any public\nadjuster you are considering hiring before you actually hire them.\n\n**More resources:**\n\nNAPIA:  A respected trade association, the National Association of Public\nInsurance Adjusters: www.napia.com.  Offers a search feature for finding a\nmember near you.  Membership is voluntary and does not affect license status.\n21165 Whitfield Place, #105 – Potomac Falls, VA. 20165. Tel (703) 433-9217 Fax\n(703) 433-0369.\n\nYour state’s insurance regulator and/or the National Association of Insurance\nCommissioners (NAIC); www.naic.org   All state insurance regulators belong to\nthis association.   Use UP’s State by State Assistance tool to find yours and\nlearn about rules and consumer protections related to public adjusters.\n\n* * *\n\nThe above tip sheet was prepared by Amy Bach, co-founder of United\nPolicyholders and Robert Crown. Robert is a UP volunteer and a licensed public\nadjuster based in the San Francisco Bay Area with Crown Adjusting, LLC\n\n  * Home\n  * About\n  * Media\n  * Recovery Help\n  * Get Prepared\n  * Advocacy\n  * Events\n  * Community\n  * Support UP\n\n© 2023 United Policyholders The material on this site is for informational\npurposes only and is not a substitute for legal advice.\n\n  * Privacy Policy\n  * Terms of Use\n  * Contact UP\n  * Log In\n\nPowered by WordPress & Inti Foundation\n\n  * __\n  * __\n  * __\n  * __\n  * __\n\n__\n\nThis is part of the roadmap to recovery timeline. Navigation from the steps\nbelow for information dealing with your situation.\n\n",
    "links": "[{\"link\": \"https://www.twitter.com/share?url=https%3A%2F%2Ftinyurl.com%2Fyattuqk4&text=Questions+to+Ask+Before+Hiring+a+Public+Adjuster&via=uphelp\", \"text\": \"\"}, {\"link\": \"https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Fuphelp.org%2Fclaim-guidance-publications%2Fquestions-to-ask-before-hiring-a-public-adjuster%2F&t=Questions+to+Ask+Before+Hiring+a+Public+Adjuster\", \"text\": \"\"}, {\"link\": \"https://www.linkedin.com/cws/share?url=https%3A%2F%2Fuphelp.org%2Fclaim-guidance-publications%2Fquestions-to-ask-before-hiring-a-public-adjuster%2F\", \"text\": \"\"}, {\"link\": \"https://uphelp.org/claim-guidance-publications/questions-to-ask-before-hiring-a-public-adjuster/?print=print\", \"text\": \"\"}, {\"link\": \"https://uphelp.org/claim-guidance-publications/questions-to-ask-before-hiring-a-public-adjuster/?print=pdf\", \"text\": \"\"}]"
}