{
    "summary": "Skip to main content\n\nLeave this field blank\n\n  * News\n  * Events\n  * Board of Supervisors\n\nTranslate\n\n  * ##### Residents\n\n    * ##### Find\n\n      * COVID-19 Information\n      * Farmers' Markets\n      * Hospitals\n      * Libraries\n      * My Supervisorial District\n      * Parks\n      * Public WiFi Locations\n      * Recycling Drop-Off\n      * Services Near Me (SMC Connect)\n      * Voting Information\n    * ##### Pay\n\n      * Child Support\n      * Parking/Traffic Ticket\n      * Property Taxes\n      * Tax Lien\n      * Unsecured Taxes\n      * Utility Bills\n    * ##### Report\n\n      * Child Abuse and Neglect\n      * Crime\n      * Elder or Dependent Adult Abuse\n      * Housing Complaint\n      * Noise Complaint\n      * Pests & Wildlife Complaint\n      * Pothole\n      * Storm Drain Overflow\n      * Street Light Outage\n      * Unsanitary Food Conditions\n    * ##### Check Status\n\n      * Child Support Payments\n      * County Projects\n      * Jury Duty\n      * Road Closures\n      * Tax Payment\n    * ##### Register\n\n      * Pet License\n      * To Vote\n    * ##### Apply For\n\n      * Child Support\n      * Financial Assistance\n      * Food Assistance\n      * Health Insurance\n      * Jobs & Internships\n      * Marriage License\n      * Permits\n      * Section 8 Housing\n    * ##### Request a Copy Of\n\n      * Birth Certificate\n      * Death Certificate\n      * Marriage Certificate\n      * Property Tax History\n      * Public Records\n    * ##### For Youth\n\n      * Educational Programs\n      * Jobs for Youth\n      * Youth Resource Hub\n    * ##### For Seniors\n\n      * Aging Services\n      * Great Plates Delivered\n      * Health Insurance\n    * ##### For Veterans\n\n      * Career Transitions\n      * Employment Opportunities\n      * Navigating Benefits\n      * Unemployment Assistance\n      * Veterans Crisis Line\n\nView More Services\n\n  * ##### Business\n\n    * ##### Find\n\n      * Business Owner Information\n      * Fictitious Business Name \n      * Open RFPs\n      * Recorded Property Maps\n      * Tax Laws\n      * Water Efficient Landscape Ordinance (WELO)\n      * Zoning District\n      * Zoning Regulations\n    * ##### Pay\n\n      * Business License Fee\n      * Transient Occupancy Tax\n      * Unsecured Property Tax\n      * Vehicle Rental License Fee\n    * ##### Check Status\n\n      * Permits\n      * Subpoenas\n      * Vendor Payment\n    * ##### Register\n\n      * Accessory Dwelling Unit (ADU)\n      * County Vendor\n      * Fictitious Business Name \n      * Licensed Contractor\n      * Pest Control Business Registration\n      * Process Server\n      * Section 8 Housing Provider\n    * ##### Apply For\n\n      * Business License\n      * Certified Producer's Certificate (CPC)\n      * Permits\n    * ##### Request\n\n      * Construction Project Inspection\n      * Property Tax History\n      * Real Estate Records\n\nView More Services\n\n  * ##### County Government\n\n    * ##### Elected Officials\n\n      * Assessor - County Clerk - Recorder\n      * Board of Supervisors\n      * Controller\n      * Coroner\n      * District Attorney\n      * Sheriff\n      * Tax Collector - Treasurer\n    * ##### Boards & Commissions\n\n      * All Boards & Commissions\n      * Vacancies and Apply Online\n    * ##### Projects\n\n      * Active Projects\n      * Open to Bid\n    * ##### Departments\n\n      * Agriculture / Weights and Measures\n      * Assessor - County Clerk - Recorder & Elections\n      * Board of Supervisors\n      * Child Support Services\n      * Controller\n      * Coroner\n      * County Attorney's Office\n      * County Executive’s Office\n      * Court\n      * District Attorney\n      * Emergency Management\n      * Health (San Mateo County Health)\n      * Housing (Department of Housing)\n      * Human Resources Department\n      * Human Services Agency\n      * Information Services Department\n      * Libraries (San Mateo County Library)\n      * Parks Department\n      * Planning and Building\n      * Probation\n      * Public Safety Communications\n      * Public Works\n      * Revenue Services\n      * SamCERA (Retirement)\n      * San Mateo County Fire\n      * Sheriff's Office\n      * Sustainability Office\n      * Tax Collector\n      * Treasurer\n    * ##### About SMC\n\n      * Fast Facts\n      * Finding County Center\n    * ##### Contact Us\n\n      * Department Directory\n    * ##### Maps & Data\n\n      * County Budget\n      * County GIS & Maps\n      * Open Data\n  * ##### Emergency Services\n\n    * ##### Emergency Assistance\n\n      * 911 / Public Safety Communications\n      * Animal Control\n      * Coroner\n      * Fire Protection Services\n      * Health (San Mateo County Health)\n      * Sheriff's Office\n    * ##### Preparedness\n\n      * Earthquake Safety\n      * Emergency Management\n      * Flooding Resources\n      * Multi-Jurisdictional Hazard Mitigation Plan\n      * Storms (Sandbag Pickup)\n    * ##### Stay Informed\n\n      * County Email Updates\n      * Newsroom\n      * SMC Alert System\n      * Water Quality Notifications (Beach/Creek)\n\nWhat can we help you find?\n\n#### Department of Emergency Management\n\nDepartment Menu\n\n  * Home\n  *   * Prepare\n  * Emergency Information\n  * Recover\n  * SMC Alert\n  * Governance and Authority\n    * Joint Powers Authority\n    * Governance and Emergency Services Council\n\nLearn More\n\nDepartment of Emergency Management DEM Learning and Resources Recovery\n\nPublic Insurance Adjusters\n\nA public insurance adjuster is an insurance adjuster that may be hired\ndirectly by the insured to represent them against their insurance company for\nthe purpose of settling the insurance claim. Typically a public adjuster will\ncharge a percentage of the claim proceeds for their services as their fee. In\nthe State of California, a public adjuster must be licensed with the\nCalifornia Department of Insurance and abide by the laws that govern them,\nprimarily found in the California Insurance Code. After a fire or disaster,\nyou may be solicited by a public adjuster offering their services. Before you\nconsider signing a contract, take the time to become thoroughly informed.\n\nNote: Don’t allow yourself to be pressured by salespeople into making a hasty\ndecision or signing a contract prematurely. Especially on the day of the\ndisaster.\n\nThe California Department of Insurance has issued an informational booklet\nentitled \"Don't Get Burned After A Disaster\" recommending you attempt to\nsettle your claim directly with your insurance company before hiring a public\nadjuster or an attorney. To request a hardcopy to be sent to you, call\n1-800-927-HELP (4357).\n\nThere are three types of insurance adjusters. Brief definitions of the three\ntypes are as follows:\n\n**Company or Staff Adjusters** are insurance claims adjusters who are employed\nby the insurance company. They represent the insurance company's interests.\nThey will not charge the insured a fee and they do not need to be individually\nlicensed by the State of California.\n\n**Independent Adjusters** are insurance claims adjusters who are hired by the\ninsurance company as independent contractors. Similar to Company or Staff\nAdjusters, Independent Adjusters represent the insurance company's interests\nand are paid by the insurance company. Independent Adjusters must be licensed\nand will not charge the insured a fee.\n\n**Public Adjusters** are insurance claims adjusters who do not work for\ninsurance companies. They work solely for the insured, to assist in the\npreparation, presentation, and settlement of the claim. Public adjusters are\ncompensated by charging a percentage of the amount they recover from the\ninsurance claim settlement. This percentage can range from 2 percent to 25\npercent or more, depending on the size and complexity of the claim. Public\nadjusters are required to be licensed, bonded, and tested by the State of\nCalifornia.\n\n**A public adjuster may be able to assist in the following capacities:**\n\n  * Preparation and presentation of the insurance claim\n  * Investigation and interpretation of applicable coverage available in the policy\n  * Provide advice on claim related issues to maximize benefits and attempt to resolve coverage disputes\n  * Negotiate and settle any amounts due in connection with the property and/or personal property elements of the claim\n\nOn complex or large property damage claims, insurance adjusters usually rely\non outside experts to provide them with the information they need to settle\nthe claim. To maximize the recovery benefits of your policy coverage, you will\nneed to provide detailed documentation and support from contractors,\nengineers, personal property experts, and any other resources available to\nsupport your claim.\n\nNote: If your insurance company adjuster or independent adjuster gives you\nwhat appears to be an incomplete or low estimate, it may only be a preliminary\nestimate without all the details. If you are concerned about any estimate\nprovided by your adjuster, ask for clarification.\n\nThe California Insurance Code governs the activities of public adjusters. Some\nof the laws applicable to public adjusters, found in Section 15027 of the\nInsurance Code, are as follows:\n\n  * Public adjusters cannot solicit your business while the loss is underway, or between the hours of 6 p.m. and 8 a.m\n  * Your \"Public Adjuster Contract,\" with a public adjuster representing you, should clearly indicate the amount of the fee you will be paying to your public adjuster. Your contract, with this fee percentage, should be acknowledged by your initials on the \"Public Adjuster Contract.\" The salary, fee, commission, or other consideration is to be paid by you (the insured), not the insurance company (insurer)\n  * You have the right to cancel the contract with your public adjuster, without any penalty or obligation, within three business days from the date the contract is signed. If you cancel the contract with your public adjuster, any money or other consideration paid by you will be returned within five business days following the receipt of your cancellation notice, and any security interest arising out of the transaction will be canceled. To cancel the contract with your public adjuster, mail or deliver by certified mail, return receipt requested, or other form of mailing which provides proof of mailing, a signed and dated copy of the cancellation notice, or any other written notice, or send a telegram to the public adjuster at the address in the contract\n  * You have the right to, and may, communicate with your insurance company at any time if you feel the need during the claims process\n  * If you have any concerns or questions, the officers at the California Department of Insurance Consumer Hotline are there to help you. Please call them at 1-800-927 HELP (4357), or visit their website at: www.insurance.ca.gov\n  * No later than three business days after the cancellation has expired, the public adjuster shall notify the insurer, its adjuster, or its attorney, that he or she has entered into a written contract with the insured\n  * If a public adjuster misrepresents or conceals a material fact from the insured prior to execution of the contract, the insured is entitled to rescind the contract without time limit\n\nFor a partial list of the laws and regulations that govern public adjusters,\nrefer to the California Insurance Code Section 15006 -15027.\n\nCalifornia Insurance Code Section 15027.1 States the Following Regarding\nDeclared Disasters:\n\n(a) Notwithstanding subdivision (e) of Section 15027, a licensee shall not\nsolicit a contract of engagement for residential properties under this chapter\nuntil seven calendar days have elapsed after the occurrence of a disaster. (b)\nSubdivision (a) shall not apply if the licensee is contacted directly by the\ninsured or the insured's representative. (c) For the purposes of this section,\n\"disaster\" means a loss-producing event that damages or destroys more than 25\ndwellings, or a \"disaster\" as that term is defined in subdivision (b) of\nSection 1689.14 of the Civil Code.\n\nCalifornia Civil Code Section 1689.14 Regarding Declared Disasters:\n\n(a) Any home solicitation contract or offer for the repair or restoration of\nresidential premises signed by the buyer on or after the date on which a\ndisaster causes damage to the residential premises, but not later than\nmidnight of the seventh business day after this date, shall be void, unless\nthe buyer or his or her agent or insurance representative solicited the\ncontract or offer at the appropriate trade premises of the seller. Any\ncontract covered by this subdivision shall not be void if solicited by the\nbuyer or his or her agent or insurance representative regardless of where the\ncontract is made. For purposes of this section, buyer solicitation includes a\ntelephone call from the buyer to the appropriate trade premises of the seller\nwhether or not the call is in response to a prior home solicitation. (b) As\nused in this section and Section 1689.6, \"disaster\" means an earthquake,\nflood, fire, hurricane, riot, storm, tidal wave, or other similar sudden or\ncatastrophic occurrence for which a state of emergency has been declared by\nthe President of the United States or the Governor or for which a local\nemergency has been declared by the executive officer or governing body of any\ncity, county, or city and county.\n\n**Where does the public adjuster's fee come from?**\n\nIf your insurance company has denied your claim, underestimated the cost to\nrepair or replace your damaged property, or has otherwise handled your claim\npoorly, a public adjuster may be able to help. But you must understand the\npotential risks and benefits of using a public adjuster.\n\nFirst, the public adjuster will be your advocate with the insurance company,\nbut they also will charge you for their service. Typically, the public\nadjuster will charge a fee that is equal to a certain percentage of your\ninsurance recovery. The adjuster will be motivated to obtain a good result for\nyou because their fee increases with their own success. But the public\nadjusters' contract should clearly state the basis for the fee and, if it is\nbased upon a percentage of the recovery, it should identify both the\npercentage and the part of your recovery to which the percentage will be\napplied. Will it be applied to the total recovery or only the amount by which\nthe adjuster can increase the recovery? Will it be applied to the dwelling\ncoverage only, or will it be applied to all of the coverages, including the\npersonal property, debris removal, landscape repairs, loss of use, and so\nforth? The contract also should state whether you must pay costs in addition\nto the fees. If so, it should detail those costs in advance.\n\nSecond, remember that the public adjuster's fee probably is not the only\nfactor that will reduce your total recovery. It probably will be reduced by\nyour insurance policy deductible, by exclusions and sub-limits in the policy,\nby non-recoverable depreciation, expert fees, and so forth. A good public\nadjuster will review your policy and make you aware of these issues before\nthey ask you to sign their contract, so you can assess whether, despite the\nadjuster's aid, you might not recover enough to repair or replace all of your\ndamaged property.\n\nThird, watch out for razzle-dazzle sales pitches. Some public adjusters may\nsuggest they will increase your recovery enough to cover their fee. If the fee\nis based solely upon the amount of the increase, or if the adjuster's contract\nguarantees that the increased recovery will be sufficient to cover the fee,\nthat may be fine. If not, you must view the adjuster's sales pitch with\nskepticism. Other public adjusters may suggest that you don't really pay their\nfee because it will come from your repair contractor's overhead and profit,\nnot from any line items associated with the actual repairs. These suggestions\nare seldom of any value. The public adjuster probably cannot ensure that the\nfee comes from the contractor's overhead and profit. Even if the adjuster can\ndo so, it can cause a serious financial problem for the contractor who must\nperform the work. Seldom will a legitimate restoration contractor charge less\nthan 20 percent for overhead and profit. In fact, reputable restoration\ncontractors' operating overhead alone can exceed 30 percent of the project\ncost. If the contractor is forced to accept lower overhead and profit, the\ncontractor may try to recover this shortfall in some other way, such as\nreducing the amount of work to be done, lowering the quality of certain\nmaterials, or requiring the homeowner to pay out of their pocket to complete\nthe work.\n\nFinally, if the public adjuster assists with your personal property claim, the\nfee is likely to be based on the amount recovered for your personal property.\nConsider carefully whether the public adjuster's assistance on this part of\nthe claim is worth the cost. Your recovery for any given item of personal\nproperty may be reduced by the insurance company for depreciation, at least\nuntil you produce a receipt showing replacement of the item, and that you will\nhave to pay the public adjuster's fee out of that reduced payment, resulting\nin a further reduction in your net recovery.\n\n_If you are considering hiring a public adjuster to represent you, you need to\nclearly understand the risks and costs associated with making this decision._\n\n**Here is one example of how hiring a public adjuster prematurely may not be\nbeneficial:**\n\nMr. Jones just had a fire, and he doesn't know what his policy limits are or\nwhat to do. He feels like he needs someone who knows insurance to represent\nhim and decides to hire a public adjuster for a fee of 10 percent. Later, he\nfinds out that he has a $250,000 policy limit on his dwelling and a $100,000\npolicy limit on his personal property. His insurance company adjuster visits\nthe home and looks at the structural damages and decides that the damages have\nexceeded the policy limits and writes a check for the limits. Later, upon\ncompleting the inventory of his personal property, it is revealed that the\nreplacement costs for the personal property exceeded the $100,000 policy limit\nhere as well. The total combined amount available in the policy was $350,000.\nSince Mr. Jones decided to hire the public adjuster and later realized that he\nwas under insured, he still has to come up with $35,000 to pay for the public\nadjuster's services, which at this point may not have amounted to much. That\nmeans Mr. Jones may have to find a contractor willing to rebuild the home for\na lot less than the repairs are worth, omit items from the scope of work, or\ndo some of the work himself. He may even have to secure a loan to finance the\nbalance of the repairs. This also means that Mr. Jones won't have enough money\nto replace all of his personal property that was lost. _In this example, if\nMr. Jones had waited until he knew what he had to work with before he signed a\ncontract with the public adjuster, he would have saved himself $35,000 in\nfees._\n\n**Here is one example of how hiring a public adjuster may be beneficial:**\n\nMr. Smith had a total fire loss, where his home burned to the ground. His\npolicy states that he has $500,000 of policy limits for the dwelling and\n$300,000 for the contents. The insurance company adjuster arrives at what's\nleft of the home with a contractor to assist in putting together an estimate.\nThey measure the house, take pictures, and after a few hours, they leave. A\nfew weeks later Mr. Smith gets an estimate for the rebuilding of the dwelling\nfor $300,000 along with a note that says that the contractor who came out with\nthe adjuster has agreed to do the work for that amount. Then a couple weeks\nlater, the adjuster sends a partially completed content inventory valued at\n$75,000. These amounts are far lower than the policy limits and Mr. Smith\nrealizes that there are significant discrepancies in the scope of work as well\nas the personal property inventory. Mr. Smith asks a couple of local\ncontractors to bid on the job while he tries to work on his personal property\ninventory. A couple of weeks later, the contractors submit their estimates,\nwhich come in over $500,000. Mr. Smith sends these estimates to his insurance\ncompany, but they refuse to pay any more. Now the claim seems to be at an\nimpasse and Mr. Smith only has a year to rebuild before he runs out of\nadditional living expenses. Mr. Smith doesn't have the time, knowledge, or\npatience to deal with the claims process by himself and he still has the\ndaunting task of creating a complete personal property inventory. He will most\nlikely need outside help. _In this example, hiring a public adjuster may help\nto expedite the claim and/or negotiate a higher settlement._ In a case where\nan insurance company is not handling the claim properly, or is being\nunreasonable, you may consider hiring a public adjuster for representation.\n_But again, this should take place after you have had a chance to see what the\ninsurance company is willing to pay you for and how much. Before signing a\ncontract with a public adjuster, you may want to consult with an attorney._\n\n**Here are some important tips to consider before you make a decision to hire\na public adjuster.**\n\nAsk the prospective public adjuster for a list of current local references for\nthe past 3 years, that includes the name of each reference, their phone\nnumber, and the dates the public adjuster's services were performed. These\nreferences should be claims that the prospective public adjuster personally\nsettled. Contact each reference and ask:\n\n  1. Would you hire this public adjuster again?\n  2. Do you feel the fee you paid for representation was worth the service you received?\n  3. After you signed a contract with the public adjuster, did he or she stay involved in the claim, or was someone else assigned after the 3 day cancellation period expired?\n  4. How long did it take to settle the claim?\n  5. Was your settlement enough to repair the house to its prior condition or better?\n  6. Were you able to get enough money to replace all of your personal property?\n  7. Did the public adjuster spend the necessary time to negotiate for even the small dollar amounts?\n\n  * Ask the public adjuster if they will be the person working to adjust the claim or if they are a sales representative who will assign someone else to handle the adjusting?\n  * Ask how long the public adjuster has been licensed and adjusting claims\n  * Ask if the public adjuster lives locally and ask to see a driver's license. The quality of the service may depend on their availability\n  * Public adjusters typically work on a percentage basis, taking a portion of the money the insurance company pays for damages. These fees can range from 2 percent to 25 percent or more, depending on the public adjuster, the size of the loss, and other criteria. The fee is negotiable. Negotiating the fee may be especially critical in cases where the insured doesn't have enough insurance coverage to repair or replace damaged property and pay the public adjuster's fee\n  * In many cases, the public adjuster's company name may be placed on checks that come from your insurance company. If you are not comfortable with this, you may want to require the payee to be that of the insured only\n  * After signing a contract with a public adjuster, you have 3 business days to cancel, for any reason. After three days, the contract is binding unless you can prove misrepresentation, fraud, or some other offense which could void the contract. _You may want to negotiate with the public adjuster to extend the cancellation period._ This can be a wise move if you want more time to see if your insurance company performs, or to see if the public adjuster is really making a difference\n  * Discuss with the public adjuster their case load. If their case load is too heavy, you may not get the attention you need to have the claim settled in a timely fashion, which could affect your additional living expenses and the amount of time to complete the repairs\n  * Another option available to you is hiring a public adjuster on what is called an \"overage basis\". This option limits the fee you pay the public adjuster to only the amount they are able to increase the settlement over what the insurance company may have offered\n  * If you are satisfied with your settlement on a portion of the claim, for instance the structural repairs, but not on the personal property portion, you may consider hiring a public adjuster to represent you on the disputed portion only. This means that the public adjuster will earn a fee only on the portion of the claim you want help with and not on the portion you are satisfied with the settlement on. This arrangement will need to be specified in writing on the contract with the public adjuster\n  * If you decide to hire a public adjuster, determine a reasonable amount of time that will be needed to settle the claim. You may want to limit the contract term to this time frame\n\n_NOTE: If disputes arise that cannot be resolved by the public adjuster or\nexceeds the legal authority of the public adjuster, you may have to retain\nlegal counsel._\n\n**Fraud Warning**\n\nThe following information was copied from the California Department of\nInsurance website under \"CONSUMERS: INSURANCE FRAUD IS A FELONY\" and can be\nviewed at: www.insurance.ca.gov\n\n**Property Claims Adjusting** \\- This type of fraud is usually perpetrated by\nclaims adjusters who are using illegal or questionable methods. Indicators of\nthis kind of fraud include the following:\n\n  * The public adjuster is unlicensed\n  * The claims adjuster requests to have his/her name included as the payee on the insurance check\n  * The claims adjuster requests the payee to endorse the insurance check, making it payable to the adjuster\n  * The claims adjuster handles all business in person, avoiding the use of the mail\n  * The amount of the claim check is noticeably larger than repairs made\n  * The invoice of services performed includes repairs not rendered\n\nFor more information regarding public adjusters, visit The California\nDepartment of Insurance website at: www.insurance.ca.gov or call\n1-800-927-HELP (4357)\n\n\n\n* News\n* Events\n* Jobs\n* For Employees\n* Office Locations\n* * * * * * * Accessibility\n* Site Map\n* Privacy Policy\n* Endorsement Disclaimers\nCopyright © 2023 County of San Mateo. All rights reserved.\n\nJump back to top\n\n",
    "links": "[{\"link\": \"https://www.smcgov.org/newsroom\", \"text\": \"News\"}, {\"link\": \"https://www.smcgov.org/events\", \"text\": \"Events\"}, {\"link\": \"https://www.smcgov.org/bos\", \"text\": \"Board of Supervisors\"}, {\"link\": \"https://www.smcgov.org/agwm/find-certified-farmers-market\", \"text\": \"Farmers' Markets\"}, {\"link\": \"https://www.smcgov.org/bos/supervisorial-districts\", \"text\": \"My Supervisorial District\"}, {\"link\": \"https://www.smcgov.org/parks\", \"text\": \"Parks\"}, {\"link\": \"https://www.smcgov.org/smc-digital-equity-portal\", \"text\": \"Public WiFi Locations\"}, {\"link\": \"https://www.smcgov.org/tax/unsecured-property-taxes\", \"text\": \"Unsecured Taxes\"}, {\"link\": \"https://www.smcgov.org/publicworks/utilities\", \"text\": \"Utility Bills\"}, {\"link\": \"https://www.smcgov.org/hsa/faqs-about-cps\", \"text\": \"Child Abuse and Neglect\"}, {\"link\": \"https://www.smcgov.org/publicworks/road-surface-maintenance\", \"text\": \"Pothole\"}, {\"link\": \"https://www.smcgov.org/publicworks/storm-drains\", \"text\": \"Storm Drain Overflow\"}, {\"link\": \"https://www.smcgov.org/publicworks/street-light-services\", \"text\": \"Street Light Outage\"}, {\"link\": \"https://www.smcgov.org/ceo/project-development-unit\", \"text\": \"County Projects\"}, {\"link\": \"https://www.smcgov.org/dcss/open-case\", \"text\": \"Child Support\"}, {\"link\": \"https://www.smcgov.org/hsa/financial-assistance\", \"text\": \"Financial Assistance\"}, {\"link\": \"https://www.smcgov.org/hsa/calfresh\", \"text\": \"Food Assistance\"}, {\"link\": \"https://www.smcgov.org/hsa/health-coverage\", \"text\": \"Health Insurance\"}, {\"link\": \"https://www.smcgov.org/hr\", \"text\": \"Jobs & Internships\"}, {\"link\": \"https://www.smcgov.org/housing/section-8-housing-voucher-program-guide\", \"text\": \"Section 8 Housing\"}, {\"link\": \"https://www.smcgov.org/tax\", \"text\": \"Property Tax History\"}, {\"link\": \"https://www.smcgov.org/ceo/public-records-act-request-form\", \"text\": \"Public Records\"}, {\"link\": \"https://www.smcgov.org/hsa/health-coverage\", \"text\": \"Health Insurance\"}, {\"link\": \"https://www.smcgov.org/hsa/veterans-employment\", \"text\": \"Career Transitions\"}, {\"link\": \"https://www.smcgov.org/hsa/veterans-employment\", \"text\": \"Employment Opportunities\"}, {\"link\": \"https://www.smcgov.org/hsa/veterans-office\", \"text\": \"Navigating Benefits\"}, {\"link\": \"https://www.smcgov.org/hsa/veterans-employment\", \"text\": \"Unemployment Assistance\"}, {\"link\": \"https://www.smcgov.org/services\", \"text\": \"View More Services\"}, {\"link\": \"https://www.smcgov.org/hr/request-proposals-rfp\", \"text\": \"Open RFPs\"}, {\"link\": \"https://www.smcgov.org/tax\", \"text\": \"Tax Laws\"}, {\"link\": \"https://www.smcgov.org/planning/water-efficient-landscape-ordinance-welo\", \"text\": \"Water Efficient Landscape Ordinance (WELO)\"}, {\"link\": \"https://www.smcgov.org/node/360911\", \"text\": \"Zoning District\"}, {\"link\": \"https://www.smcgov.org/planning/zoning-regulations\", \"text\": \"Zoning Regulations\"}, {\"link\": \"https://www.smcgov.org/tax/business-licenses\", \"text\": \"Business License Fee\"}, {\"link\": \"https://www.smcgov.org/tax/transient-occupancy-tax-0\", \"text\": \"Transient Occupancy Tax\"}, {\"link\": \"https://www.smcgov.org/tax/unsecured-property-taxes\", \"text\": \"Unsecured Property Tax\"}, {\"link\": \"https://www.smcgov.org/tax/vehicle-rental\", \"text\": \"Vehicle Rental License Fee\"}, {\"link\": \"https://www.smcgov.org/ceo/invoice-status-tracking\", \"text\": \"Vendor Payment\"}, {\"link\": \"https://www.smcgov.org/planning/accessory-dwelling-unit-ordinance\", \"text\": \"Accessory Dwelling Unit (ADU)\"}, {\"link\": \"https://www.smcgov.org/hr/supplier-information\", \"text\": \"County Vendor\"}, {\"link\": \"https://www.smcgov.org/agwm/pest-control-registration\", \"text\": \"Pest Control Business Registration\"}, {\"link\": \"https://www.smcgov.org/housing/section-8-housing-voucher-program-guide\", \"text\": \"Section 8 Housing Provider\"}, {\"link\": \"https://www.smcgov.org/tax/business-licenses\", \"text\": \"Business License\"}, {\"link\": \"https://www.smcgov.org/agwm/certified-producers-old\", \"text\": \"Certified Producer's Certificate (CPC)\"}, {\"link\": \"https://www.smcgov.org/planning/building-permits\", \"text\": \"Permits\"}, {\"link\": \"https://www.smcgov.org/node/343551\", \"text\": \"Construction Project Inspection\"}, {\"link\": \"https://www.smcgov.org/tax\", \"text\": \"Property Tax History\"}, {\"link\": \"https://www.smcgov.org/services\", \"text\": \"View More Services\"}, {\"link\": \"https://www.smcgov.org/bos\", \"text\": \"Board of Supervisors\"}, {\"link\": \"https://www.smcgov.org/controller\", \"text\": \"Controller\"}, {\"link\": \"https://www.smcgov.org/coroner\", \"text\": \"Coroner\"}, {\"link\": \"https://www.smcgov.org/da\", \"text\": \"District Attorney\"}, {\"link\": \"https://www.smcgov.org/tax\", \"text\": \"Tax Collector - Treasurer\"}, {\"link\": \"https://www.smcgov.org/bnc\", \"text\": \"All Boards & Commissions\"}, {\"link\": \"https://www.smcgov.org/bnc/vacancies\", \"text\": \"Vacancies and Apply Online\"}, {\"link\": \"https://www.smcgov.org/ceo/capital-projects\", \"text\": \"Active Projects\"}, {\"link\": \"https://www.smcgov.org/publicworks/projects-out-bid\", \"text\": \"Open to Bid\"}, {\"link\": \"https://www.smcgov.org/agwm\", \"text\": \"Agriculture / Weights and Measures\"}, {\"link\": \"https://www.smcgov.org/bos\", \"text\": \"Board of Supervisors\"}, {\"link\": \"https://www.smcgov.org/dcss\", \"text\": \"Child Support Services\"}, {\"link\": \"https://www.smcgov.org/controller\", \"text\": \"Controller\"}, {\"link\": \"https://www.smcgov.org/coroner\", \"text\": \"Coroner\"}, {\"link\": \"https://www.smcgov.org/countyattorney\", \"text\": \"County Attorney's Office\"}, {\"link\": \"https://www.smcgov.org/ceo\", \"text\": \"County Executive’s Office\"}, {\"link\": \"https://www.smcgov.org/da\", \"text\": \"District Attorney\"}, {\"link\": \"https://www.smcgov.org/dem\", \"text\": \"Emergency Management\"}, {\"link\": \"https://www.smcgov.org/housing\", \"text\": \"Housing (Department of Housing)\"}, {\"link\": \"https://www.smcgov.org/hr\", \"text\": \"Human Resources Department\"}, {\"link\": \"https://www.smcgov.org/hsa\", \"text\": \"Human Services Agency\"}, {\"link\": \"https://www.smcgov.org/isd\", \"text\": \"Information Services Department\"}, {\"link\": \"https://www.smcgov.org/parks\", \"text\": \"Parks Department\"}, {\"link\": \"https://www.smcgov.org/planning\", \"text\": \"Planning and Building\"}, {\"link\": \"https://www.smcgov.org/probation\", \"text\": \"Probation\"}, {\"link\": \"https://www.smcgov.org/911dispatch\", \"text\": \"Public Safety Communications\"}, {\"link\": \"https://www.smcgov.org/publicworks\", \"text\": \"Public Works\"}, {\"link\": \"https://www.smcgov.org/revenueservices\", \"text\": \"Revenue Services\"}, {\"link\": \"https://www.smcgov.org/san-mateo-county-fire\", \"text\": \"San Mateo County Fire\"}, {\"link\": \"https://www.smcgov.org/tax\", \"text\": \"Tax Collector\"}, {\"link\": \"https://www.smcgov.org/treasurer\", \"text\": \"Treasurer\"}, {\"link\": \"https://www.smcgov.org/fast-facts\", \"text\": \"Fast Facts\"}, {\"link\": \"https://www.smcgov.org/finding-county-center\", \"text\": \"Finding County Center\"}, {\"link\": \"https://www.smcgov.org/departments\", \"text\": \"Department Directory\"}, {\"link\": \"https://www.smcgov.org/ceo/office-budget-policy-and-performance\", \"text\": \"County Budget\"}, {\"link\": \"https://www.smcgov.org/isd/gis\", \"text\": \"County GIS & Maps\"}, {\"link\": \"https://www.smcgov.org/911dispatch\", \"text\": \"911 / Public Safety Communications\"}, {\"link\": \"https://www.smcgov.org/coroner\", \"text\": \"Coroner\"}, {\"link\": \"https://www.smcgov.org/san-mateo-county-fire\", \"text\": \"Fire Protection Services\"}, {\"link\": \"https://www.smcgov.org/dem\", \"text\": \"Emergency Management\"}, {\"link\": \"https://www.smcgov.org/dem/multijurisdictional-local-hazard-mitigation-plan\", \"text\": \"Multi-Jurisdictional Hazard Mitigation Plan\"}, {\"link\": \"https://www.smcgov.org/publicworks/storm-preparedness\", \"text\": \"Storms (Sandbag Pickup)\"}, {\"link\": \"https://www.smcgov.org/newsroom\", \"text\": \"Newsroom\"}, {\"link\": \"https://www.smcgov.org/dem/smc-alert\", \"text\": \"SMC Alert System\"}, {\"link\": \"https://www.smcgov.org/dem\", \"text\": \"\"}, {\"link\": \"https://www.smcgov.org/dem\", \"text\": \"\"}, {\"link\": \"https://www.smcgov.org/dem/prepare\", \"text\": \"Prepare\"}, {\"link\": \"https://www.smcgov.org/dem/newsroom\", \"text\": \"Emergency Information\"}, {\"link\": \"https://www.smcgov.org/dem/recover-emergency\", \"text\": \"Recover\"}, {\"link\": \"https://www.smcgov.org/dem/smc-alert\", \"text\": \"SMC Alert\"}, {\"link\": \"https://www.smcgov.org/dem/emergency-management-governance\", \"text\": \"Governance and Emergency Services Council\"}, {\"link\": \"https://www.smcgov.org/dem/flooding-preparedness-and-response\", \"text\": \"Learn More\"}, {\"link\": \"https://www.smcgov.org/dem\", \"text\": \"Department of Emergency Management\"}, {\"link\": \"https://www.smcgov.org/dem\", \"text\": \"DEM Learning and Resources\"}, {\"link\": \"https://www.smcgov.org/dem/recover-emergency\", \"text\": \"Recovery\"}, {\"link\": \"https://www.smcgov.org/newsroom\", \"text\": \"News\"}, {\"link\": \"https://www.smcgov.org/events\", \"text\": \"Events\"}, {\"link\": \"https://www.smcgov.org/hr/employee-resources\", \"text\": \"For Employees\"}, {\"link\": \"https://www.smcgov.org/finding-county-center\", \"text\": \"Office Locations\"}, {\"link\": \"https://www.smcgov.org/accessibility\", \"text\": \"Accessibility\"}, {\"link\": \"https://www.smcgov.org/sitemap.xml\", \"text\": \"Site Map\"}, {\"link\": \"https://www.smcgov.org/privacy-policy\", \"text\": \"Privacy Policy\"}, {\"link\": \"https://www.smcgov.org/endorsement-disclaimers\", \"text\": \"Endorsement Disclaimers\"}]",
    "priceAndPlans": "Error: Timeout 30000ms exceeded. =========================== logs\n=========================== navigating to\n\"http://web.archive.org/web/20231215233827/https://www.smcgov.org/\", waiting\nuntil \"load\" ============================================================\n\n"
}