{
    "summary": "Skip to content\n\n  * Contact Us\n  * 781-438-1375\n  * __ Text Us\n\nGET A QUOTE\n\n426 Main Street Suite 2\n\nStoneham, MA 02180\n\nCall: 781-438-1375\n\nFax: 781-438-6790\n\nMon - Fri: 8:30 - 5:00\n\nContact Us 24/7 Online\n\n  * About Us\n\n __\n\n    * About Us\n    * Our Team\n    * Areas We Serve\n    * Career Opportunities\n\n  * Personal\n\n __\n\nPersonal\n\n    * Homeowners Insurance\n    * Condo Owners Insurance\n    * Renters Insurance\n    * Mobile Home Insurance in Massachusetts\n    * Personal Article Insurance\n    * Rental Property Insurance in Massachusetts\n    * Flood Insurance\n\nPersonal Vehicles\n\n    * Car Insurance\n    * Classic Cars\n    * Motorcycle Insurance\n    * Recreational Insurance in Massachusetts\n\nOther Personal Insurance\n\n    * Boat Insurance\n    * First Time Home Buyer\n    * Home Based Business Insurance\n    * Pet Insurance Plans in Massachusetts\n    * Event Insurance\n    * Personal Umbrella Insurance\n\nPersonal\n\n    * Homeowners Insurance\n    * Condo Owners Insurance\n    * Renters Insurance\n    * Mobile Home Insurance in Massachusetts\n    * Personal Article Insurance\n    * Rental Property Insurance in Massachusetts\n    * Flood Insurance\n\nPersonal Vehicles\n\n    * Car Insurance\n    * Classic Cars\n    * Motorcycle Insurance\n    * Recreational Insurance in Massachusetts\n\nOther Personal Insurance\n\n    * Boat Insurance\n    * First Time Home Buyer\n    * Home Based Business Insurance\n    * Pet Insurance Plans in Massachusetts\n    * Event Insurance\n    * Personal Umbrella Insurance\n\n  * Commercial\n\n __\n\nBusiness INsurance\n\n    * Business Owners Insurance\n    * Commercial Package Policy\n    * Contractors Insurance\n    * Commercial Umbrella Insurance\n    * Home Based Business Insurance\n    * D&O Insurance in Massachusetts\n\nBusiness Property & Vehicles\n\n    * Apartment Building Insurance in Massachusetts\n    * Commercial Auto Insurance\n    * Builders Risk Insurance\n    * Commercial Property Insurance in Massachusetts\n    * Condo Master Insurance\n    * Flood Insurance\n    * Inland Marine\n    * Landlord Insurance in Massachusetts\n    * Property Development Insurance\n    * Property Managers Insurance In Massachusetts\n\nBusiness Specialty\n\n    * Cyber Insurance in Massachusetts\n    * EPLI Insurance in Massachusetts\n    * Non Profit Insurance\n    * Professional Liability Insurance in Massachusetts\n    * Event Insurance\n    * Surety Bond\n    * Workers Compensation\n\nBusiness INsurance\n\n    * Business Owners Insurance\n    * Commercial Package Policy\n    * Contractors Insurance\n    * Commercial Umbrella Insurance\n    * Home Based Business Insurance\n    * D&O Insurance in Massachusetts\n\nBusiness Property & Vehicles\n\n    * Apartment Building Insurance in Massachusetts\n    * Commercial Auto Insurance\n    * Builders Risk Insurance\n    * Commercial Property Insurance in Massachusetts\n    * Condo Master Insurance\n    * Flood Insurance\n    * Inland Marine\n    * Landlord Insurance in Massachusetts\n    * Property Development Insurance\n    * Property Managers Insurance In Massachusetts\n\nBusiness Specialty\n\n    * Cyber Insurance in Massachusetts\n    * EPLI Insurance in Massachusetts\n    * Non Profit Insurance\n    * Professional Liability Insurance in Massachusetts\n    * Event Insurance\n    * Surety Bond\n    * Workers Compensation\n\n  * Client Services\n\n __\n\n    * Pay My Insurance Bill\n    * Report an Insurance Claim\n    * My Account\n    * Insurance Binder Request\n    * Certificate of Insurance Request\n    * Get an Insurance Quote\n    * Refer a Friend\n\n  * Resources\n\n __\n\n    * Insurance Companies We Represent\n    * Insurance Discounts and Credits\n    * News & Press Releases\n    * Insurance Mobile App\n    * Insurance Videos\n    * Reviews\n    * Blog\n\nGET A QUOTE\n\nResults\n\nSee all results\n\nCall Us\n\n# Public Adjuster Pros and Cons Every Homeowner Should Know\n\nHome • Blog • Home Insurance\n\n  * John LoPriore \n  * __ LoPriore Insurance Agency \n\nShare:\n\n  * John LoPriore \n  * __ LoPriore Insurance Agency \n\nShare:\n\n__\n\nTable of Contents\n\nNobody likes to pay for the insurance bill. But it is a necessity for a\nhomeowner. The insurance provides the needed financial protection when\nsomething unexpected or catastrophic happens to your home.  \nWhen those unfortunate events happen, for example, water damage from an\noverflowing toilet or storm damage to the roof, you need to call your\ninsurance agent. 6% of homeowners made claims to their insurance company in\n2017 for things like floods, lightning damage, or home fires.\n\nYou have insurance to help cover the damages associated with those home\ndisasters. But how do you, as the property owner, make a claim and come to an\nagreement on the amount you should be paid for the damage?\n\nThis is where claim adjusters come into the picture and help you handle your\nclaim. You know the insurance company has adjusters. Have you heard of a\npublic adjuster that you could hire for a claim to your insurance? What\nreasons would there be to hire a public adjuster?\n\nLet’s take a closer look at the public adjuster’s pros and cons. Read on to\nlearn all about making an insurance claim and using a public adjuster vs the\ninsurance adjuster.\n\n## The Claim Process\n\nLet’s use the water damage example to look at the claim’s process. A pipe\nbursts in your bathroom while you’re not home—the bathroom floods with water.\nUnfortunately, the bathroom is on the upper floor of your home.\n\nGravity takes over, and water starts coming through the ceiling to your\nkitchen and landing on your new hardwood flooring. The burst pipe is causing\nsignificant property damage, and you decide to file an insurance claim with\nyour homeowner’s insurance to get repairs taken care of with insurance money.\n\nTo file a claim, you call your insurance company and report the incident. They\nsend out their adjuster to survey the damages and come up with the cost\nestimates.\n\nYou are given money for repairs from the insurance company once the two of you\nagree on the amount proposed by the adjuster.\n\nWhat happens if you cannot come to an agreement on the amount? This is often\nwhen homeowners choose to hire a public adjuster.\n\n## Difference Between a Public Insurance Adjuster and an Insurance Adjuster\n\nSo, what is the difference between an insurance company adjuster and a public\nadjuster?\n\nThe insurance adjuster works for the insurance company. He works on their\nbehalf to get information about claims and come up with the proposed repairs\nand what they would cost for the repairs. The public adjuster would be hired\nand paid by the homeowner.\n\nBoth do the same tasks of evaluating and assessing the damage. Both will write\nup proposals for repairs and their costs. The key difference is who employs\nthem to do that task.\n\nLet’s take a closer look at the pros and cons of both kinds of adjusters.\n\n## Insurance Adjuster\n\nThe insurance company employs an adjuster to go to homes and survey damage.\nThey are typically very knowledgeable about the trades of building or\nrepairing a house. Often, they have a contractor’s license or have worked in\nthe field in the past.\n\nThey need to be highly knowledgeable about home construction as they evaluate\ndamages and propose what it will cost to make the necessary repairs.\n\n### Positive of an Insurance Adjuster\n\nThere are a few positives to consider when thinking about using the insurance\ncompany’s adjuster.\n\nThe insurance company can afford to hire adjusters who have a vast range of\nexperience in the field. The adjuster needs to know everything from plumbing,\nheating, cooling, and electrical to finish work like drywall and paint.\n\nThe insurance adjuster’s big bonus is that he or she comes at no additional\ncost to you as the homeowner.\n\nMost people have stayed with the same insurance company for the life of their\nhomeownership. There is no reason to suspect that this adjuster would not want\nto fix the problem and skimp to save the insurance company money.\n\n### Negatives of an Insurance Adjuster\n\nThe truth is, though, they are employed by the insurance company. The work\nthey do is on behalf of the insurance company, not the homeowner.\n\nIf you have had a big loss, like from a fire, the damages will be extensive.\nThere might be some insurance companies who will want to save some money in\nthe payout process. Ultimately, the insurance adjuster answers to the\ninsurance company and needs to satisfy them.\n\nHaving said that, many insurance adjusters have professional reputations.\nTheir goal is not to fix something on the cheap but instead to propose a plan\nthat would get repairs done right.\n\n## Public Insurance Adjusters Work\n\nMany homeowners don’t even know about public insurance adjusters. They assume\nthe work done by the insurance adjuster is done on their behalf.\n\nA public insurance adjuster is employed by the homeowner. The homeowner also\npays them, typically a percentage of the claim amount. A homeowner might\ndecide to hire a public adjuster if they have a potentially large claim and\nare worried about getting everything covered.\n\nIf you hire a public adjuster, the sooner in the claim process, the better. It\nis best if they can take over to speak on your behalf and work with the\ninsurance adjuster right from the onset of the claim.\n\nYou might be wondering how to find a reputable public adjuster. Not all of\nthem have good reputations and can have the reputation of being “ambulance\nchasers” looking for a disaster to make some money from.  \nIf you want to hire a public adjuster, start by looking at their credentials.\n\n  * How are they skilled in assessing damages?\n  * What experience do they have in working alongside the insurance company toward a settlement?\n  * How are their communication skills to work with all parties involved to get a settlement?\n\nYou might also look to see if they are members of the National Association of\nPublic Insurance Adjusters. The NAPAI promotes standards for public adjusters.\n\n## Pro of Hiring a Public Adjuster\n\nIf you find yourself in the process of making a claim with your insurance\ncompany, you might find it worthwhile to hire a public adjuster. This might be\nespecially true if you feel like the insurance adjuster does not include all\nthe necessary costs for repairs from your claim.\n\nLet’s take a closer look at the positives of hiring a public adjuster.\n\n### Knowledge and Professional Standards\n\nMost states have strict standards for public adjusters. They can’t just decide\nthis is a job; they want to make money. The state requires careful training\nand knowledge to be licensed as a public adjuster. Often public adjusters are\nmembers of their professional organization, which requires certain skill\nstandards.  \nPublic adjusters also must be:\n\n  * Bonded\n  * Fingerprinted\n  * Pass a background check\n\nYou should also expect them to know the ins and out of insurance claims for\nhome and business claims. They should also have some negotiation skills as\nthey will be working closely with the insurance company adjuster to reach a\nmutually agreed-upon settlement.\n\nFacing a catastrophic loss can involve some real stressors. You are faced with\ndamage, loss, and future repairs. There can also be an emotional toll on\nlosing things in your home or business.\n\nFor many, hiring a public adjuster means they have someone to do the thinking\nand negotiating on their behalf. The public adjuster becomes your advocate,\nacting on your behalf.\n\nThis is especially important if you have experienced a huge loss like a home\nfire. It will be hard for you to think about all the things that were once\npart of your home and will need replacing. That becomes the task of the public\nadjuster to guide you through the process.\n\n### Possibility of Missing Part of the Claim\n\nIf you have a big claim, there could be things that need fixing you can’t see\non the surface. Because of their experience and determination to find every\npossible thing, the public adjuster can help to make sure nothing is missed in\nthe claim and claim settlement.\n\nFor example, if you had water damage on your wood floors from the upper-level\nbathroom. It might seem obvious that wood floors need to be replaced. But the\nwater may have run down the inside of walls where mold could form or drywall\ndamage could occur. This could impact how secure the cabinets are on the\nwalls.\n\n### More Claim Settlement Money\n\nA public adjuster can sometimes land larger settlement claims for their\nclients. As a homeowner, you might not feel it’s your place or even confident\nto go back to the insurance adjuster and negotiate with them about the claim.\n\nCertainly, you might not even recognize the possibility that something has\nbeen missed, so you don’t know to ask for more. Because of their experience, a\npublic adjuster does know to ask. They will then negotiate on your behalf with\nthe insurance company adjuster.\n\n## Cons of Hiring a Public Adjuster\n\nThere are some negatives to consider, and many are associated with the\nreputation of public adjusters. Public adjusters, in some cases, have gained a\nreputation for chasing the money.  \nWhile they will advocate for you as the homeowner, and there is some value to\nthis, there are also some possible negatives to consider.\n\nLet’s take a closer look at the negatives associated with public adjusters.\n\n### Many Only Do Major Claims\n\nOne negative of the public adjuster sector is the type of claims they are\nwilling to work with. Many only want to work on large-scale claims like a\ntotal loss house fire, for example. Since they make their money based on the\nfinal settlement amount, they want to work on only the big cases where there\nwould be a big payday for them.\n\nIt might be harder to get a public adjuster involved in a claim worth only a\nfew thousand dollars versus a claim for $20,000 or $200,000. For the\npercentage they get, they might figure the smaller claims aren’t worth it.\nBefore hiring a public adjuster, research the kind of work they do. Ask for\nreferences\n\n### Paying the Public Adjuster\n\nIn theory, you don’t pay the public adjuster out of pocket. They work on a\ncontingency and get paid from the settlement amount they can get for you. The\namount varies from area to area across the country. It also varies depending\non the size of the claim.\n\nIt seems the average is around a 10% fee from the claim settlement. Some\nadjusters will lower their percentage for large cases, knowing the settlement\namount is likely to be big. While some adjusters increase the percentage for\nclaims on the smaller size, hinting they prefer to take those large settlement\ncases instead.\n\n### Time It Takes to Settle\n\nIn some cases, having a public adjuster involved helps move the claim along\nmore quickly. They know the process and work with insurance companies all the\ntime.  \nBut like anything, the more people involved can sometimes slow down the\nprocess. There is likely to be more negotiation back and forth between the\npublic adjuster and the insurance adjuster.\n\nSometimes when a claim can’t be settled, the courts must get involved too.\nWhile they act as your advocate, sometimes, in their effort to raise the claim\namount, the insurance company resists, slowing down the process. The more\nnegotiation there is back and forth, the more time it is likely to take to get\na settlement.\n\n### **Top 10 Questions About Working with a Public Adjuster to File Your\nClaim**\n\n### How do I know if I need a public adjuster to file my claim?\n\nIt’s true that your insurance company has an insurance adjuster to assess the\ndamage from your claim. However, in certain situations, you may want a\nprofessional to advocate for you. Many homeowners decide to hire a public\nadjuster if the damage is extensive or if it’s difficult to determine how much\ndamage has occurred. If you disagree about the cost estimate from your\ncompany’s insurance adjuster.\n\n### When should I hire a public adjuster?\n\nThe claims and repair process can take a significant amount of time. You can\nhire a public adjuster at any time during the process. For instance, if the\nclaim is settled and additional damage is discovered during repairs, you may\nwish to hire a public adjuster to assess the total cost.\n\n### What qualities should I look for in a public adjuster?\n\nIt would be best if you had the same professionalism from a public adjuster as\nany other service. Seek out a reputable company that has been in business for\nseveral years. Your adjuster must be licensed and bonded. He or she should be\nresponsive to your needs and answer any questions you have.\n\n### When is it time to pay the adjuster?\n\nYour public insurance adjuster is paid on contingency. Instead of paying\nupfront, you’ll pay a percentage of the settlement after an agreement is\nreached. After you accept your insurance company’s final payment offer, your\nadjuster will collect a pre-arranged amount. This is usually between 5% and\n15% of your claim.\n\n### What should I expect from my public adjuster?\n\nYour public adjuster should help you with every part of the claim. Your public\nadjuster will assess the damage, determine a cost estimate, and even negotiate\nwith your insurance company on your behalf. It’s your insurance adjuster’s\ngoal to maximize your claim.\n\n### Can my insurance company cancel my policy if I hire a public adjuster?\n\nNo, your insurance company can only cancel your policy for non-payment or\nanother way that you break the terms of your contract. Your insurance company\nwill likely be eager to work with you to reach an agreeable resolution to your\nclaim. Typically, insurance agencies understand the desire to hire an\nadditional advocate and respond professionally when hiring a public adjuster.\n\n### Should I hire a public adjuster before I contact my insurance company\nabout filing my claim?\n\nNo, your insurance policy is designed to provide coverage for damages to your\nhome, and the terms of your policy require you to contact the agency first.\nYou can choose to hire a public adjuster after you contact your insurance\ncompany, or you can wait until you receive a cost estimate from your insurer’s\nadjuster.\n\n### Why should I hire a public adjuster instead of an attorney?\n\nA claims adjuster is trained to assess the damage, provide a cost estimate,\nand negotiate with your insurance company. If you go straight to an attorney,\nyour lawyer will likely hire a public adjuster to investigate the claim.\nYou’ll likely end up paying the cost for both professionals and possibly\nincrease the amount of time it takes to complete the claims process.\n\n### When is it too late to hire a public adjuster to assist with my claim?\n\nOccasionally, after a claim is settled, additional damage is discovered. You\nmay still be able to hire a public adjuster at this time. It’s likely too late\nto involve a public adjuster if you signed a final release or your claim\nperiod has extended beyond the statute of limitations.\n\n### Will hiring a public adjuster help speed up the claims process?\n\nPossibly. Public adjusters are professionals who are required to have a\ncertain amount of knowledge and training. Since they’re already familiar with\nthe process, the necessary steps can be completed quickly.\n\nyou’d like me to focus on, please let me know. Otherwise, here’s a general\nsection that may align with the topic:\n\n* * *\n\n### How to Choose the Right Public Adjuster: Quick Guide\n\nSelecting the right public adjuster for your needs can make a tremendous\ndifference in the outcome of your insurance claim. But how do you ensure\nyou’re making the best choice? Here’s a guide to assist you:\n\n#### 1\\. **Verify Licensing and Credentials**\n\nMake sure the public adjuster is licensed in your state and holds relevant\ncertifications. Confirming their professional standing ensures you’re working\nwith a qualified expert.\n\n#### 2\\. **Check Reviews and References**\n\nLook for online reviews and ask for references to gauge the adjuster’s\nreputation. Speak with previous clients if possible to understand their\nexperience and satisfaction level.\n\n#### 3\\. **Understand the Fee Structure**\n\nClarify the fees upfront and ensure you are comfortable with the charged\npercentage. Comparing fees among different adjusters can help you find a fair\nrate.\n\n#### 4\\. **Assess Communication and Availability**\n\nYour public adjuster should be readily available to answer your questions and\nkeep you informed. Assess their communication style to ensure it aligns with\nyour preferences.\n\n#### 5\\. **Review the Contract Carefully**\n\nA clear and transparent contract will outline the services provided and the\nfees charged. Take the time to review it carefully, and don’t hesitate to ask\nquestions if anything is unclear.\n\n#### 6\\. **Consider the Adjuster’s Experience with Your Specific Claim Type**\n\nAn adjuster with experience handling claims similar to yours will likely\nunderstand the nuances and potential challenges specific to your situation.\n\n## Public Adjuster Pros and Cons for Your Insurance Claim\n\nHaving damage to your home is stressful and difficult. Working through the\nclaim process and getting repairs can be frustrating. As you work through the\nprocess, the public adjuster’s pros and cons are something you should\nconsider.\n\nIf you trust your insurance company and feel like their adjuster is forthright\nin helping to solve the claim, it’s likely you don’t need to get a public\nadjuster involved.\n\nDo you have questions about your homeowner’s insurance? Do you need to discuss\na claim you need to make? We are here to help take care of your insurance\nneeds. Contact us today with your insurance needs inquiries.\n\n## See How Much You Can Save!\n\nContact an independent agent at LoPriore Insurance today to learn more about\nproperty insurance. Our experienced insurance agents are available 24/7 to\nanswer your questions, provide information about our home insurance policies,\nor provide you with an instant quote.\n\nContact LoPriore Insurance Agency Today  \nTo Get A Free Insurance Quote\n\n## We Make Insurance Easy For You!\n\nWork with a local experienced insurance agent and save you time and money!\n\nStart Saving Today!\n\nShare:\n\nFacebook\n\nTwitter\n\nPinterest\n\nLinkedIn\n\n####  John LoPriore\n\nAs Founder and President of LoPriore Insurance Agency, John’s goal from the\nstart was to ensure each client receives the best customer experience\npossible, whether its service or insurance products from LoPriore Insurance\nAgency. John brings 25 years of experience, helping clients buy insurance, and\nunderstanding what insurance fits their lifestyle. John spends most days\nsetting the vision and strategy for the agency. He tirelessly works to ensure\nthat his team of experienced and licensed professionals are not only dedicated\nto superior customer service with a commitment to ease of doing business. When\nnot working, John enjoys spending time, friends, and family. John is also a\ndie-hard Boston sports fan watching most games while enjoying a great cigar.\n\nRelated Posts\n\nTop Holiday Traditions to Celebrate with Friends and Family\n\nRead More »\n\nKeep Your Furry Friend Safe in Cold Weather\n\nRead More »\n\nAbout the Author\n\nJohn LoPriore\n\nAs Founder and President of LoPriore Insurance Agency, John’s goal from the\nstart was to ensure each client receives the best customer experience\npossible, whether its service or insurance products from LoPriore Insurance\nAgency. John brings 25 years of experience, helping clients buy insurance, and\nunderstanding what insurance fits their lifestyle. John spends most days\nsetting the vision and strategy for the agency. He tirelessly works to ensure\nthat his team of experienced and licensed professionals are not only dedicated\nto superior customer service with a commitment to ease of doing business. When\nnot working, John enjoys spending time, friends, and family. John is also a\ndie-hard Boston sports fan watching most games while enjoying a great cigar.\n\nCategories\n\nAuto Insurance Business Insurance Home Insurance Renters Insurance Personal\nInsurance Property Insurance COVID-19 Insurance Tips Home Tips\n\nMost Popular\n\n###  Top Holiday Traditions to Celebrate with Friends and Family\n\nDecember 13, 2023\n\n###  Keep Your Furry Friend Safe in Cold Weather\n\nDecember 7, 2023\n\n###  Top 10 Safety Tips for the Holidays\n\nDecember 6, 2023\n\n###  The Ultimate Christmas Tree Safety Guide: Real vs. Artificial Trees\n\nNovember 29, 2023\n\nAre You Paying To Much For Insurance?\n\nTalk with an Agent and see how we can help you save!\n\nGET STARTED\n\nContact Lopriore insurance and save\n\nWE MAKE INSURANCE EASY\n\nSTART A QUOTE\n\nTALK TO AN AGENT\n\nAbout LoPriore Insurance\n\nLoPriore Insurance Agency is a proud Trusted Choice agent dedicated to\nproviding competitive insurance products and personalized service to our\nvaluable clients. Our dedicated team of experienced professionals takes the\ntime to listen to our customer’s needs. Then, provide valuable advice about\nthe policies that will fit their unique lifestyle.\n\nOur Company\n\n  * Our Story\n  * News & Blog\n  * Our Team\n  * Contact Us\n  * Personal Insurance\n  * Business Insurance\n\n  * Our Story\n  * News & Blog\n  * Our Team\n  * Contact Us\n  * Personal Insurance\n  * Business Insurance\n\nClient Services\n\n  * Account Login\n  * Pay My Bill\n  * Report a Claim\n  * Certificate of Insurance Request\n  * Insurance Binder Request\n  * Register\n\nContact\n\n426 Main Street Suite 2  \nStoneham, MA 02180  \nCall: 781-438-1375  \nText: 781-438-1375  \nFax: 781-438-6790  \n[email protected]\n\n  * Disclaimer\n\n© 1995 - 2023 | LoPriore Insurance Agency, Inc. | Privacy Policy | Career | MA\nInsurance Lic: 1811631 | NH Insurance Lic: 2052698 | ME Insurance Lic:\nAGN165853\n\nFacebook-f Instagram Linkedin Twitter Youtube\n\nQuote\n\nClients\n\nContact\n\nMenu\n\n",
    "links": "[{\"link\": \"https://www.lopriore.com/contact-us/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/insurance-quotes-massachusetts/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/about-us/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/our-team/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/areas-we-serve/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/career-opportunities/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/homeowners-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/condo-owners-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/renters-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/mobile-home-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/personal-articles-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/rental-property-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/flood-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/car-insurance-massachusetts/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/classic-car-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/motorcycle-insurance-massachusetts/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/recreational-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/boat-insurance-massachusetts/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/new-home-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/home-based-business-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/pet-insurance-massachusetts/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/event-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/personal-umbrella-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/homeowners-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/condo-owners-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/renters-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/mobile-home-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/personal-articles-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/rental-property-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/flood-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/car-insurance-massachusetts/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/classic-car-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/motorcycle-insurance-massachusetts/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/recreational-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/boat-insurance-massachusetts/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/new-home-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/home-based-business-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/pet-insurance-massachusetts/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/event-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/personal-umbrella-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/business-owners-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/cpp-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/contractors-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/commercial-umbrella-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/home-based-business-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/d-o-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/rental-property-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/commercial-auto-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/builders-risk-insurance-massachusetts/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/commercial-property-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/condo-master-insurance-policy/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/flood-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/inland-marine-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/rental-property-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/property-development-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/property-managers-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/cyber-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/epli-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/non-profit-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/professional-liability-insurance-massachusetts/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/event-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/surety-bond/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/workers-compensation-insurance-massachusetts/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/business-owners-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/cpp-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/contractors-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/commercial-umbrella-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/home-based-business-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/d-o-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/rental-property-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/commercial-auto-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/builders-risk-insurance-massachusetts/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/commercial-property-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/condo-master-insurance-policy/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/flood-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/inland-marine-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/rental-property-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/property-development-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/property-managers-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/cyber-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/epli-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/non-profit-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/professional-liability-insurance-massachusetts/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/event-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/surety-bond/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/workers-compensation-insurance-massachusetts/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/pay-my-insurance-bill/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/report-an-insurance-claim/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/my-account/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/insurance-binder-request/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/certificate-of-insurance-request/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/insurance-quotes-massachusetts/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/refer-a-friend/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/insurance-companies/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/insurance-discounts/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/news-press-releases/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/insurance-mobile-app/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/insurance-video-library/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/reviews/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/insurance-blog-massachusetts/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/insurance-quotes-massachusetts/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/contact-us/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/blog/category/auto-insurance-article/\", \"text\": \"Auto Insurance\"}, {\"link\": \"https://www.lopriore.com/blog/category/business-insurance/\", \"text\": \"Business Insurance\"}, {\"link\": \"https://www.lopriore.com/blog/category/home-insurance-article/\", \"text\": \"Home Insurance\"}, {\"link\": \"https://www.lopriore.com/blog/category/renters-insurance/\", \"text\": \"Renters Insurance\"}, {\"link\": \"https://www.lopriore.com/blog/category/personal-insurance-article/\", \"text\": \"Personal Insurance\"}, {\"link\": \"https://www.lopriore.com/blog/category/property-insurance/\", \"text\": \"Property Insurance\"}, {\"link\": \"https://www.lopriore.com/blog/category/covid-19/\", \"text\": \"COVID-19\"}, {\"link\": \"https://www.lopriore.com/blog/category/insurance/\", \"text\": \"Insurance\"}, {\"link\": \"https://www.lopriore.com/blog/category/tips/\", \"text\": \"Tips\"}, {\"link\": \"https://www.lopriore.com/blog/category/home-tips/\", \"text\": \"Home Tips\"}, {\"link\": \"https://www.lopriore.com/contact-us/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/insurance-quotes-massachusetts/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/contact-us/\", \"text\": \"\"}, {\"link\": \"https://www.lopriore.com/cdn-cgi/l/email-protection\", \"text\": \"[email protected]\"}]"
}