{
    "summary": "Skip to content\n\nTHE SOURCE\n\nClose\n\n  * TopicsTopics\n    * Arts & Culture\n    * Business & Entrepreneurship\n    * Campus & Community\n    * Humanities & Society\n    * Medicine & Health\n    * Science & Technology\n  * SchoolsSchools\n    * Arts & Sciences\n    * Brown School\n    * McKelvey School of Engineering\n    * Olin Business School\n    * Sam Fox School of Design & Visual Arts\n    * School of Law\n    * School of Medicine\n    * University College\n  * PublicationsPublications\n    * Newsroom\n    * The Record\n    * Washington Magazine\n\nSearch\n\nMenu\n\nSearch for: Search Close\n\nNEWSROOM\n\n  * Sections\n    * Find an Expert\n    * Media Resources\n    * Newsroom Stories\n    * Perspectives\n    * WashU Experts\n    * WashU in the News\n\n# Sundial enthusiasts help celebrate 100th anniversary of Cupples’ sundial\n\nMakin' time\n\nBy Tony Fitzpatrick August 4, 2008\n\nSHARE\n\nWhile we are bombarded daily with gloomy stories about Earth going to a hot\nplace in a handbasket, a group of roughly 45 enthusiasts from around the\ncountry are meeting in St. Louis, August 7-10, to celebrate the beauty of the\nEarth moving around the sun.\n\nThese enthusiasts are attending the 2008 Annual Conference of the North\nAmerican Sundial Society (NASS), based out of Glastonbury, Conn. While meeting\nin St. Louis they will take a one-day tour on Friday, August 8, of 15 area\nsundials, some of historical importance, including one on the campus of\nWashington University in St. Louis that is marking its centennial anniversary.\nDonated to WUSTL by the class of 1908, one hundred years ago, the sundial\nfaces south on the Cupples I building façade on the university’s Brookings\nQuadrangle. The motto on the sundial reads: I am a shadow/ So art thou/I mark\ntime/Dost thou?\n\nA group of about 45 sundial enthusiasts will tour 15 St. Louis area sundials,\nwhich measure time by the position of the sun, on Aug. 8. Among the sundials\nincluded is this vertical one on the Cupples I building on the Danforth campus\nat Washington University in St. Louis. The WUSTL sundial marks its 100th\nbirthday in 2008. It was donated to the university by the class of 1908.\nBetween civil (legal) time (the kind on our wrist watches) and solar time,\nonly solar time is truly scientific.\n\nSundials can be traced to antiquity and come in many designs. Some are\nelaborate and beautiful, others plain and practical, but all measure time by\nthe position of the sun. Key components of sundials are a shadow-casting\nobject called a gnomon and a surface with lines indicating the hours of the\nday and important dates. In a vertical sundial, such as WUSTL’s, the gnomon’s\nshadow casting edge, called its style, has to be aligned with the axis of the\nEarth’s rotation. To tell correct time, the style must point towards true\nnorth. The style’s angle with the vertical surface has to equal the sundial’s\ncolatitude (90 degrees minus the latitude). The university’s colatitude is\n51.4 degrees.\n\nThe core of these objects is a stew of mathematics and physics, and that is\nwhat appeals to Donald L. Snyder, Ph.D., senior professor of electrical and\nsystems engineering and a NASS member who helped organize and arrange the tour\nfor the conference.\n\nSnyder sees sundials as physical realizations of mathematics.\n\n“I’m interested in sundials because of their mathematical relation to the\nposition of the sun at any time,” said Snyder, who has made a number of\nportable, wooden sundials of his own for family members. “It’s a thing of\nbeauty to design an instrument on the basis of mathematics,the physics of\nsolar and Earth motion and the effects of sunlight.\n\n“Another reason I’m drawn to sundials is aesthetics. There are lots of\nartistic choices in designing and building one. Some are quite beautiful, such\nas Washington University’s.”\n\nSnyder describes NASS members as by and large technical people including\nscientists and engineers and a few historians, especially of science. He is\ncounting on several Junior Academy and Passport members of the Academy of\nScience of St. Louis to participate in the sundial tour.\n\n**Cahokia Mounds**\n\nThere are two other sundials at WUSTL, one inlaid on a sidewalk between Crow\nHall and the Earth and Planetary Sciences Building and the other in that\nbuilding itself on a Mars rover-scaled replica. The sundial is in use yet on\nMars with the rovers Spirit and Opportunity for color calibration for the\nrovers’ cameras.\n\nOn August 9, the NASS will offer numerous presentations on different aspects\nof sundials. One of them will be given by Michael W. Friedlander, Ph.D.,\nprofessor of physics, who will discuss the excavation of Wood Henge, a solar\ncalendar located at Cahokia Mounds State Historical Site, 20 minutes east of\nSt. Louis in Illinois. Friedlander has analyzed the archaeological data\nobtained in excavations by the late Warren Wittry. This analysis confirms\nWittry’s discovery of the astronomical significance of the site.\n\nCahokia is the site of an ancient city inhabited from about 700 to 1400 A.D\nwith a peak population of perhaps 15,000. Numerous posts were set out around\nseveral circles with alignments to the sunrise positions at the solstices and\nequinoxes and what are considered to have been festival dates that related to\nthe agricultural cycle of the region.\n\n**For the good times**\n\nOn Earth, time is measured in three predominant fashions. Solar time, civil\n(or legal) time and hard time (the eight or so hours spent working, five days\na week). Only solar time is truly scientific, said Snyder. While we are\naccustomed to thinking that the Earth takes 365 days to go around the sun, it\nactually takes about 365.25 days. Thus, every four years the quarter days add\nup to one whole day, and we have leap year. Despite our civil time units — 60\nseconds, 60 minutes, 24 hours — it actually takes the Earth exactly 23 hours,\n56 minutes and four seconds to make one revolution around its axis.\n\n“Watches are compromises to accommodate the fact that there really aren’t 24\nfull hours in a day, and some days are shorter than others, but we have to\nhave some standards,” Snyder said. “Whereas solar time depends upon where you\nare on the Earth, civil time results from dividing the Earth into 24 pieces —\ntime zones — with each 15 degrees of longitude each representing an hour.\nEverybody within the 15 degrees has the same (civil) time.”\n\nThe group will view five sundials at the Missouri Botanical Gardens, including\nthe only Islamic sundial in the country. Among others they will tour are\nsundials at the St. Louis Arsenal and Jefferson Barracks, dating back to the\nCivil War and functioning as the bases’ chronometers. They will see the Korean\nWar Memorial sundial in Forest Park and one at the Missouri History Museum, a\nsundial designed by Thomas Jefferson that will be placed on special display by\nShoenberg Curator Anne Woodhouse during the NASS tour for the participants and\npublic to view.\n\n* * *\n\nSHARE  Media Contact Diana Lutz\n\n* * *\n\n###### Topics\n\nScience & Technology\n\n###### Schools\n\n**Arts & Sciences**\n\nRead more stories from Arts & Sciences\n\nVisit Arts & Sciences\n\n **McKelvey School of Engineering**\n\nRead more stories from McKelvey School of Engineering\n\nVisit McKelvey School of Engineering\n\n## Latest from the Newsroom\n\n### Recent Stories\n\nBreast cancer rates increasing among younger women\n\nNewly opened Jeffrey T. Fort Neuroscience Research Building dedicated\n\nPediatric Heart Network names medical school a core site for heart disease\nresearch\n\n### WashU Experts\n\nExpanded child tax credit would ultimately save money, reduce poverty\n\nReplacing Chevron would have far-reaching implications\n\nThe importance of higher purpose, culture in banking\n\n### WashU in the News\n\nData on new Alzheimer’s drug and Black patients is sparse\n\nHow exercise increases brain volume — and may slow memory decline\n\nNew long COVID study uncovers high inflammation in patients as Senate calls\nfor more research on ‘crisis’\n\n###### Publications\n\n  * Washington Magazine\n  * Newsroom\n  * Record\n\n###### Explore\n\n  * Bookshelf\n  * Video Gallery\n\n###### Connect\n\n  * Media Resources\n  * Contact\n\n  * Facebook\n  * Instagram\n\n©2024 Washington University in St. Louis\n\nGo back to top\n\n",
    "links": "[{\"link\": \"https://source.wustl.edu/schools/university-college/\", \"text\": \"University College\"}, {\"link\": \"https://source.wustl.edu/news\", \"text\": \"\"}, {\"link\": \"https://www.facebook.com/sharer/sharer.php?u=https://source.wustl.edu/2008/08/sundial-enthusiasts-help-celebrate-100th-anniversary-of-cupples-sundial/\", \"text\": \"\"}, {\"link\": \"http://twitter.com/share?text=Sundial enthusiasts help celebrate 100th anniversary of Cupples’ sundial&url=https://source.wustl.edu/2008/08/sundial-enthusiasts-help-celebrate-100th-anniversary-of-cupples-sundial/\", \"text\": \"\"}, {\"link\": \"https://www.facebook.com/sharer/sharer.php?u=https://source.wustl.edu/2008/08/sundial-enthusiasts-help-celebrate-100th-anniversary-of-cupples-sundial/\", \"text\": \"\"}, {\"link\": \"http://twitter.com/share?text=Sundial enthusiasts help celebrate 100th anniversary of Cupples’ sundial&url=https://source.wustl.edu/2008/08/sundial-enthusiasts-help-celebrate-100th-anniversary-of-cupples-sundial/\", \"text\": \"\"}, {\"link\": \"https://source.wustl.edu/channels/newsroom/\", \"text\": \"Recent Stories\"}, {\"link\": \"https://source.wustl.edu/channels/washu-experts\", \"text\": \"WashU Experts\"}, {\"link\": \"https://source.wustl.edu/clip/in-the-news\", \"text\": \"WashU in the News\"}]"
}