{
    "summary": "#  The Intrepid Tourist\n\nAuthor CAROLINE ARNOLD's travel blog--a writer's journeys around the world\n\n## Monday, April 8, 2019\n\n###  HOMAGE TO SUNDIALS: Eight Year Anniversary of The Intrepid Tourist  \n  \n---  \nGiant wall Sundial at Redlands University, Redlands, CA  \nEight years ago I launched _The Intrepid Tourist_ as an outlet for my travel\nwriting. Since then I have posted a new article once a week, accumulating a\nwhopping total of more than 500 posts--some about far away places, others much\ncloser to home. Most are about my own travel experiences, but others are about\nthe trips made by family and friends. I thank all my guest posters who have\ncontributed reports of their adventures on _The Intrepid Tourist_ and shared\ntheir personal views of the world.  \n  \n---  \nBerkeley Botanical Garden, Berkeley, CA  \nIn many of my travels, I have come across sundials and been fascinated by both\ntheir beauty and technology. In celebration of the beginning of a new year of\n_The Intrepid Tourist_ I an sharing a few of my sundial photos.  \n  \n---  \nSundial Bridge, Redding, CA  \nRanging in size from the giant sundial bridge at Turtle Bay in Redding,\nCalifornia, to a small garden decoration sundial at the Clark Library in Los\nAngeles, each one has its own special character.  \n  \n---  \nSundial by Eric Gill, UCLA Clark Library garden, Los Angeles, CA  \nThe oldest known sundial was found in Egypt found in the Valley of the Kings\n(c. 1500 BC). I have never been to Egypt, but in Rajasthan, India, there is a\ncollection of nineteen architectural astronomical instruments built by the\nRajput king Sawai Jai Singh II, and completed in 1734. It features the world's\nlargest stone sundial _._ I visited this amazing UNESCO world Heritage site\nwhen I was in India in 2000.  \n  \n---  \nStone sun dial at Jantar Mantar, Rajasthan, India  \nThe marker, _or gnomen,_ at the center of the sundial casts its shadow as the\nsun moves across the sky and indicates the time of day. Importantly, its angle\nmust be equivalent to the Earth's latitude at that point.  \n  \n---  \nSundial at the Santa Barbara Zoo, California at 4:00 p.m.  \nA simple way of telling time by the sun is with your own shadow. At the Santa\nBarbara Zoo, in Santa Barbara, California, is a sundial that is read by\nstanding in the center and casting your own shadow.  \n  \n---  \nAlpha and Omega Sundial in memory of Harriet M. Gale, Grinnell College,\nGrinnell, Iowa. Paul T. Granlund, Sculptor  \nAt Grinnell College a sundial in the center of campus honors the wife of a\nretired physics professor. At the University of North Carolina, the Morehead\nSundial is on a plaza near the center of campus and has an accompanying plaque\nthat tells us exactly where we are on Earth. I love sundials. They are\nbeautiful and functional and as long as the sun is shining, will always tell\nthe time.  \nHappy 8th Anniversary to _The Intrepid Tourist_!  \n  \n---  \nMorehead Sundial Plaque, UNC Campus, Chapel Hill, North Carolina  \n  \n_  \n_\n\nPosted by  five nests at  8:00 AM\n\nLabels: anniversary, Berkeley, blog, bridge, California, Grinnell College,\nIndia, Rajasthan, Redlands, sundial, University of North Carolina\n\n#### No comments:\n\n#### Post a Comment\n\nNote: Only a member of this blog may post a comment.\n\nNewer Post Older Post Home\n\nSubscribe to: Post Comments (Atom)\n\n## 2024: Traveling Again\n\nAs I travel, I want to know: What do people like me do? Where do they eat?\nWhat do they like best? What are some of their favorite places, both on and\noff the beaten track? Like most of you, my travel was severely curtailed\nduring Covid 19. As we begin to venture out again, I have gone back to posting\narticles about current travel, to both local and more distant destinations.\nMany thanks to my guest posters for expanding the breadth and scope of this\nblog. As always, you can use the search function to look for posts about a\nparticular country, state or other categories.  \n\nHappy traveling, both real and virtual, in 2024!\n\n## MEMOIR: A Unique Childhood\n\n**SETTLEMENT HOUSE GIRL** , my memoir of my growing up years in Minneapolis,\nMinnesota, is now available at Amazon or to order at your independent book\nstore. ISBN 9798864903285 .\n\n## Search This Blog\n\n|  \n---|---  \n  \n## Twitter\n\n## Popular Posts\n\n  * HIKING AND BIKING IN NEW ZEALAND, Part 3: Guest Post by Cathy Mayone\n\nNew Zealand, Milford Sound Over the Christmas holidays, my niece and her\nhusband, Cathy and Mike Mayone, spent two weeks in New Zealand...\n\n  * THE NEW ORLEANS PHARMACY MUSEUM Guest post by Caroline Hatton\n\nThe New Orleans Pharmacy Museum My friend and fellow children’s book author\nCaroline Hatton visited New Orleans, Louisiana, in Decem...\n\n  * A WEEKEND TRIP TO NORMANDY: Guest Post by Mike Mayone\n\nBayeux, Normandy My nephew-in-law, Mike Mayone, who often travels for\nbusiness, recently had a chance to visit Normandy in France on...\n\n  * MARY ANNING's Amazing Fossils at the Natural History Museum, London\n\n\"Mary Anning\" at the Museum of Natural History, London In 1811, Mary Anning\nand her older brother Joseph discovered a strange...\n\n  * DUBLIN, IRELAND: James Joyce Odyssey, Guest Post by Gretchen Woelfle\n\nSweney's Pharmacy, Dublin, Ireland My friend and fellow children's book writer\nGretchen Woelfle loves to travel and most rec...\n\n  * RIVER WALK, HILLSBOROUGH, NC: Reliving History at Occaneechi Village\n\nHistoric replica of Occaneechi Village, Hillsborough, NC In late November, on\na cool but bright fall day, we took a walk along the Eno River...\n\n  * DOING LAUNDRY IN INDIA, Guest Post by Ann Whitford Paul\n\nWashing clothes in the Ganges  In late January my friend and fellow children's\nbook author Ann Paul and her husband Ron took a trip...\n\n  * THE LANGUAGE OF LACE: Armenian Lace Doilies at the Fowler Museum, Los Angeles, CA\n\nArmenian lace doily made by Marie Pilibossian. At the Fowler Museum, UCLA.\nUntil my recent visit to the Fowler Museum at UCLA in Los Angeles...\n\n  * Australia's Red Center: Alice Springs\n\nTropic of Capricorn marker just north of Alice Springs A Town Called Alice\n(Diary entry from our visit to Alice Springs in April 1999) ...\n\n  * MEGALODON at the Raleigh Natural Science Museum, North Carolina: Jaws of Giant Shark Close-Up\n\nModel of the jaws of Megalodon at the Raleigh Museum of Natural Science\nImagine a giant shark twice as big as the modern-day great white...\n\n## Blog Archive\n\n  * ►  2024  (5)\n    * ►  January  (5)\n\n  * ►  2023  (54)\n    * ►  December  (4)\n    * ►  November  (4)\n    * ►  October  (5)\n    * ►  September  (5)\n    * ►  August  (4)\n    * ►  July  (5)\n    * ►  June  (4)\n    * ►  May  (5)\n    * ►  April  (4)\n    * ►  March  (4)\n    * ►  February  (4)\n    * ►  January  (6)\n\n  * ►  2022  (52)\n    * ►  December  (4)\n    * ►  November  (4)\n    * ►  October  (5)\n    * ►  September  (4)\n    * ►  August  (5)\n    * ►  July  (4)\n    * ►  June  (4)\n    * ►  May  (5)\n    * ►  April  (4)\n    * ►  March  (4)\n    * ►  February  (4)\n    * ►  January  (5)\n\n  * ►  2021  (54)\n    * ►  December  (5)\n    * ►  November  (5)\n    * ►  October  (4)\n    * ►  September  (4)\n    * ►  August  (5)\n    * ►  July  (4)\n    * ►  June  (4)\n    * ►  May  (6)\n    * ►  April  (4)\n    * ►  March  (5)\n    * ►  February  (4)\n    * ►  January  (4)\n\n  * ►  2020  (52)\n    * ►  December  (4)\n    * ►  November  (5)\n    * ►  October  (4)\n    * ►  September  (4)\n    * ►  August  (5)\n    * ►  July  (4)\n    * ►  June  (5)\n    * ►  May  (4)\n    * ►  April  (4)\n    * ►  March  (5)\n    * ►  February  (4)\n    * ►  January  (4)\n\n  * ▼  2019  (53)\n    * ►  December  (4)\n    * ►  November  (5)\n    * ►  October  (4)\n    * ►  September  (6)\n    * ►  August  (4)\n    * ►  July  (5)\n    * ►  June  (4)\n    * ►  May  (4)\n    * ▼  April  (5)\n      * BIRDS OF ZIMBABWE, Part 2: Guest Post by Karen Mi...\n      * BIRDS OF ZIMBABWE, Part 1: Guest Post by Karen Mi...\n      * SUPERBLOOM! Flowers Everywhere, Guest Post by Gret...\n      * HOMAGE TO SUNDIALS: Eight Year Anniversary of The ...\n      * JAPAN, Hakone National Park: The Pleasures of Stay...\n    * ►  March  (4)\n    * ►  February  (4)\n    * ►  January  (4)\n\n  * ►  2018  (53)\n    * ►  December  (5)\n    * ►  November  (4)\n    * ►  October  (5)\n    * ►  September  (4)\n    * ►  August  (4)\n    * ►  July  (5)\n    * ►  June  (4)\n    * ►  May  (4)\n    * ►  April  (5)\n    * ►  March  (4)\n    * ►  February  (4)\n    * ►  January  (5)\n\n  * ►  2017  (52)\n    * ►  December  (4)\n    * ►  November  (4)\n    * ►  October  (5)\n    * ►  September  (4)\n    * ►  August  (4)\n    * ►  July  (5)\n    * ►  June  (4)\n    * ►  May  (5)\n    * ►  April  (4)\n    * ►  March  (4)\n    * ►  February  (4)\n    * ►  January  (5)\n\n  * ►  2016  (53)\n    * ►  December  (4)\n    * ►  November  (4)\n    * ►  October  (5)\n    * ►  September  (4)\n    * ►  August  (5)\n    * ►  July  (4)\n    * ►  June  (4)\n    * ►  May  (5)\n    * ►  April  (4)\n    * ►  March  (4)\n    * ►  February  (5)\n    * ►  January  (5)\n\n  * ►  2015  (53)\n    * ►  December  (4)\n    * ►  November  (5)\n    * ►  October  (4)\n    * ►  September  (4)\n    * ►  August  (5)\n    * ►  July  (4)\n    * ►  June  (5)\n    * ►  May  (4)\n    * ►  April  (4)\n    * ►  March  (5)\n    * ►  February  (4)\n    * ►  January  (5)\n\n  * ►  2014  (52)\n    * ►  December  (5)\n    * ►  November  (4)\n    * ►  October  (4)\n    * ►  September  (5)\n    * ►  August  (4)\n    * ►  July  (4)\n    * ►  June  (5)\n    * ►  May  (4)\n    * ►  April  (4)\n    * ►  March  (5)\n    * ►  February  (4)\n    * ►  January  (4)\n\n  * ►  2013  (54)\n    * ►  December  (5)\n    * ►  November  (5)\n    * ►  October  (4)\n    * ►  September  (5)\n    * ►  August  (4)\n    * ►  July  (5)\n    * ►  June  (4)\n    * ►  May  (4)\n    * ►  April  (5)\n    * ►  March  (4)\n    * ►  February  (5)\n    * ►  January  (4)\n\n  * ►  2012  (53)\n    * ►  December  (5)\n    * ►  November  (4)\n    * ►  October  (5)\n    * ►  September  (4)\n    * ►  August  (4)\n    * ►  July  (5)\n    * ►  June  (4)\n    * ►  May  (4)\n    * ►  April  (5)\n    * ►  March  (4)\n    * ►  February  (4)\n    * ►  January  (5)\n\n  * ►  2011  (38)\n    * ►  December  (4)\n    * ►  November  (4)\n    * ►  October  (5)\n    * ►  September  (4)\n    * ►  August  (5)\n    * ►  July  (4)\n    * ►  June  (4)\n    * ►  May  (5)\n    * ►  April  (3)\n\n## Total Pageviews\n\n538,327\n\n## About Me\n\nfive nests\n\n    Los Angeles, California, United States\n    I like to think of myself as a Lonely Planet traveler without the backpack. (Translation: I like vacation spots that are off the beaten track but I’m willing to get there in a rented car and stay in a comfortable hotel.) I like trips to remote or unusual places especially if they feature wildlife, ancient history, cultural events, opportunities for hiking or other outdoor activities. Sometimes I am an accidental tourist, a result of my own or my husband’s business travel. I am a children’s book author and travel for research and to speak at schools and conferences. (Go to www.carolinearnold.com or www.carolinearnoldart.blogspot.com for more about my books and art.) My husband is a scientist and international meetings have provided the starting point for trips. Sometimes my destination is chosen because of family connections. And sometimes I simply choose a place because I have never been there before. I have always kept a diary when I travel (long before blogs were invented) and written the occasional article about my trips. Some of those articles and diary entries (heretofore unpublished) will be posted here. I will also post comments on my current and recent travel.\nView my complete profile\n\n## Art Cards and Prints, Perfect for Any Time\n\nSee my animal prints of my cut-paper art at\nwww.etsy.com/shop/CarolineArnoldArt. Perfect as gifts or to frame and hang on\nyour wall!\n\n## Books by Caroline Arnold about Travel Destinations\n\n  \n\n  * **Trapped in Tar: Fossils from the Ice Age** [La Brea Tar Pits, CA] paperback and ebook.  \n\n  *  **The Ancient Cliff Dwellers of Mesa Verde** (Clarion Books, 1992) Now an ebook. [Mesa Verde, Colorado]\n  *  **Stories in Stone: Rock Art Pictures By Early Americans** (Clarion Books, 1996) [Mojave Desert] Now an ebook.\n  *  **City of the Gods: Mexico’s Ancient City of Teotihaucan** (Clarion Books, 1994)Now an ebook.\n  *  **Uluru, Australia’s Aboriginal Heart** (Clarion Books, 2003) Now an ebook.  \n\n  *  **Easter Island: Giant Stone Statues Tell of a Rich and Tragic Past** (Clarion Books, 2000) Now an ebook.\n  *  **Stone Age Farmers Beside the Sea: Scotland’s Prehistoric Village of Skara Brae** (Clarion Books, 1997)Now an ebook. [Orkney Islands]\n  *  **A Walk on the Great Barrier Reef** (Carolrhoda Books, 1988) Now an ebook.\n  *  **Watching Desert Wildlife** (Carolrhoda Books, 1994) Now an ebook.\n  *  **African Animals** (Morrow Junior Books, 1997) Now an ebook.\n  *  **South American Animals** (Morrow Junior Books, 1999) Now an ebook.  \n\n  *  **Australian Animals** (HarperCollins, 2000) Now an ebook.\n  *  **Taj Mahal** (Carolrhoda Books, 2007)now an ebook at Hoopla in your local library\n\n## Labels\n\n  * Africa (40)\n  * Alaska (5)\n  * ALBANIA (1)\n  * Antarctica (4)\n  * Argentina (2)\n  * Arizona (14)\n  * Asia (2)\n  * Australia (25)\n  * Brazil (1)\n  * California (157)\n  * Canada (14)\n  * Chicago (8)\n  * Chile (16)\n  * China (14)\n  * Colorado (2)\n  * Connecticut (1)\n  * Cornwall (5)\n  * Croatia (4)\n  * Cuba (3)\n  * Czech Republic (2)\n  * Delaware (1)\n  * Easter Island (4)\n  * Ecuador (1)\n  * Egypt (1)\n  * England (32)\n  * Ethiopia (2)\n  * Faroe (2)\n  * Fiji (1)\n  * FINLAND (1)\n  * France (13)\n  * gardens (12)\n  * Georgia (10)\n  * Germany (9)\n  * Greece (8)\n  * Greenland (4)\n  * GUATAMALA (1)\n  * guest post (248)\n  * Hawaii (15)\n  * Iceland (8)\n  * Illinois (5)\n  * India (11)\n  * Indonesia (3)\n  * Iowa (5)\n  * Ireland (8)\n  * Italy (28)\n  * Japan (12)\n  * Kenya (6)\n  * London (16)\n  * Los Angeles (35)\n  * Madagascar (5)\n  * Maldives (1)\n  * Mexico (16)\n  * Minneapolis (7)\n  * Minnesota (10)\n  * Mongolia (3)\n  * Montana (4)\n  * MONTREAL (3)\n  * Morocco (5)\n  * museums (31)\n  * Nepal (5)\n  * New Mexico (1)\n  * New York (4)\n  * New Zealand (10)\n  * North Carolina (15)\n  * Nova Scotia (3)\n  * Oakland (26)\n  * Pakistan (4)\n  * PAPUA NEW GUINEA (1)\n  * Paris (5)\n  * Patagonia (2)\n  * Pennsylvania (15)\n  * Peru (7)\n  * Philadelphia (6)\n  * Pittsburgh (2)\n  * Portugal (4)\n  * Queensland (4)\n  * Rapa Nui (2)\n  * Russia (2)\n  * San Diego (4)\n  * San Francisco (30)\n  * Santa Barbara (4)\n  * Sardinia (4)\n  * Scotland (4)\n  * Shanghai (2)\n  * Siberia (1)\n  * Sicily (8)\n  * South America (11)\n  * South Dakota (2)\n  * Spain (7)\n  * Sri Lanka (2)\n  * Sweden (3)\n  * Switzerland (1)\n  * Taiwan (5)\n  * Tanzania (7)\n  * Tasmania (2)\n  * Thailand (2)\n  * Turkey (13)\n  * UAE (3)\n  * Uganda (9)\n  * United Arab Emirates (2)\n  * Utah (3)\n  * Viet Nam (4)\n  * Wales (5)\n  * Washington (13)\n  * WISCONSIN (2)\n  * Wyoming (2)\n  * ZIMBABWE (8)\n  * zoo (10)\n\n## Followers\n\n|\n\n## Lone Wolfette\n\nMolly Sinclair's new blog, The Lone Wolfette, is for independent women\ntravelers. Filled with photos and practical advice.\n\n## Thoughts on Travel and Life by Floyd Sandford\n\nFloyd Sandford, a life-long intrepid traveler, reports on his journeys at his\nblog Floyd's Travels and Thoughts on Life illustrated with some of his amazing\nphotographs. On his most recent trip he traveled to Newfoundland on a Road\nScholar trip, visiting St. John’s and the Cape Bonavista peninsula.  \n\n## Living in Greece: Baby Boomer Reboot\n\nLiving in Greece while pursuing a Master's degree, Sara Kras writes about her\nadventures on her blog Baby Boomer Reboot.  \n\n## Iowa City, a Top Literary Destination\n\nIowa City, IA, has been named by Expedia as a top literary destination for its\nbookstores, literary cred, literary events, and fostering of the literary\narts.  \n\n## Lonely Planet Kids\n\nCheck out Lonely Planet Kids for books, apps, games and downloadable\nactivities that acquaint kids with the amazing and diverse world we live in.\n\n## Writing Istanbul Online Book\n\nRead 14 writers' impressions of Turkey (including mine) in this free online\nmagazine, **Writing Istanbul**, at Issuu.com with photos and links. We all\nwent on the same trip, but came back with our personal views.  \n\n## Watts Towers in Los Angeles\n\nThe wiry spires of **Simon Rodia's Watts Towers** are a LA landmark--part art,\npart history, part culture. This article at **Red Tricycle** will help you\nplan your visit!  \n\n## California's Channel Islands, A Great Day's Outing\n\nTake a trip to Anacapa Island, LA's closest island getaway, to see seals,\nbirds, wildflowers, and enjoy a day in the great outdoors.  \n  \n  \n---|---  \n  \n|  \n  \n---|---  \n  \nAll text and photos, copyright Caroline Arnold. Watermark theme. Powered by\nBlogger.\n\n  *[8:00 AM]: 2019-04-08T08:00:00-07:00\n\n",
    "links": "[{\"link\": \"https://theintrepidtourist.blogspot.com/2019/04/homage-to-sundials-eight-year.html\", \"text\": \"8:00 AM\"}, {\"link\": \"https://theintrepidtourist.blogspot.com/2019/04/homage-to-sundials-eight-year.html\", \"text\": \"HOMAGE TO SUNDIALS: Eight Year Anniversary of The ...\"}]"
}