{
    "summary": "\n\n|\n\n|\n\n###  \n\n###  |  \n---  \n  \n### _Sundials are not just for the garden any more!_\n\nThe Spectra sundial is an indoor custom sundial and functional handcrafted\nfine art timepiece that is designed to be placed indoors on a table by a sunny\nwindow or directly on a window sill and enjoyed year round. Unique among\nsundials, the Spectra sundial earns its name by producing vivid prism beams\nthroughout the day, flooding the room with intense rainbow color as it uses\nthe sun to chart the rhythm of the seasons and accurately tell the time of\nday. As the sun moves across the sky, the Spectra sundial creates a slow\nmotion parade of dramatic rainbow colors moving through the room, sometimes\nthree large brilliant spectrum beams at a time. A Spectra sundial in the\nwindow makes a colorful statement in the room!\n\n\n\n\n\n\n\n\n\nThe Spectra sundial makes a perfect personalized anniversary gift, unique\nwedding gift idea, or exceptional birthday gift when customized with a special\ninscription and date line of the special event - then every year the\nanniversary day will become an extra special day, because the sun and earth\nwill align on that date each year to make the time shadow follow the\ncorresponding date line on this special anniversary sundial. A unique \"moment\nmark\" can even be added to the special date line in some cases to celebrate a\nspecial moment in time!\n\n\n\nEvery Spectra sundial is individually calculated, designed and created for\neach new owner, and meticulously handmade to order and signed by its designer\nand maker Jim Tallman, making each Spectra sundial a truly unique one-of-a-\nkind sculptural piece and perfect personalized gift idea for \"the person who\nhas everything.\" In addition to accurately telling the time of day to within\nminutes, the Spectra sundial is able to provide custom anniversary or birthday\ndate lines that the time shadow will follow on the special day each year -\nbecause each Spectra sundial is individually calculated and designed for its\nspecific location and personalized for its recipients, unlike most common\nmass-produced online or garden center sundials. Each of these distinctive\nbeveled glass sun clocks is a truly exquisite custom-made indoor sun sculpture\nand perfect decoration for a sunny space...an exclusive upscale interior home\ndecor accent that adds a delightfully colorful sense of energy to any room.\n\n\n\nIf you'd like to order a Spectra sundial, you can go directly to the Spectra\nsundial ordering page to find out how you can get one of these custom sundials\nspecifically designed and handmade just for you. You can also buy a sundial\ngift certificate so your gift recipients can have the experience of picking\nout their favorite window and working with Jim directly to have their new\ncustom rainbow sundial made according to their wishes at a later date. Have a\nlook around to find out more about the Spectra sundial - you can click on the\npictures for a closer look, check the sundial details page to learn more about\nthese special custom sundials, see a sundial gallery of Spectra sundials in\nthe home, or you can read some of the customer comments that new Spectra\nowners have sent to Jim after receiving their Spectra sundial.\n\n\n\n\n\n\n\n### _A perfect last minute personalized gift idea!_\n\nYou can instantly buy a Spectra sundial gift certificate that you can print\nout yourself \\- then your recipient(s) will be able to contact us directly and\nhave the experience of working with Jim personally to get their special\npersonalized custom sundial made exactly as they wish, whenever they are\nready. The Spectra sundial gift certificate is the perfect gift to celebrate a\nwedding, anniversary, or birthday...you can give them colorful days and a\nhandcrafted one-of-a-kind gift made just for them that they will enjoy for a\nlifetime. A Spectra sundial gift certificate makes a wonderful last minute\nwedding gift or unique personalized anniversary or birthday gift idea!\n\n\n\nThe Spectra sundial has been in continual production since 2002, and over\nthose years Jim Tallman has personally handcrafted and shipped his special\nsundials to customers all over the world. Many of them have written back to\nJim to express their appreciation, and you can read some of the things they\nhad to say on the Spectra sundial comments page.\n\n\n\nWe have sent Spectra sundials all over the world - the sun never sets on them,\nand there is always one of our custom sundials in the light of day and making\nrainbow colors somewhere in the world. Have a look at our interactive World of\nSundials to see where many of the Spectra sundials have gone, how their\ncustomized specific sundial layouts vary with location and the direction they\nwere designed to face, and see which Spectra sundials are currently under the\nsun right now!\n\n\n\n\n\n\n\n\n\nPersonalized custom sundial details such as special date lines and\ninscriptions can be added to Spectra sundials at no extra charge to create an\nideal family heirloom and celebrate special family occasions such as birthdays\nor anniversaries - the tip of the time shadow will ride the birthday or\nanniversary date line each year during the course of that special day. Special\ndetails can often be added to celebrate your moment in time, and Jim will make\nsuggestions and work with you personally throughout the process to make sure\nyou wind up with the best personalized anniversary gift you'll ever find.\n\n\n\nInnovative and scientifically correct, the Spectra sundial has been selected\n\nby the North American Sundial Society since 2003 to serve as the trophy\n\nsundial to accompany their yearly distinguished dialing award,\n\nthe prestigious Sawyer Dialing Prize.\n\n\n\nThe Spectra sundial is a unique bespoke interior accent, as well as a true\nscientific instrument with all of the features necessary to tell very accurate\nclock time using the daily movement of the sun across the sky. If the magic of\nthe ever-moving time shadow is not enough to elevate your spirit then the\nglorious saturated rainbow color that this sundial creates surely will.\n\n\n\nIt simply borders on the sublime...\n\n\n\n\n\n\n\n\n\nThe Spectra Sundial · Page Directory\n\n\n\nSpectra · Details · Orders · Sundial Gallery · Sundial Comments · World of\nSundials  \n  \n  \nHome · Sundials · Ideas · Images · Links · Contact\n\n\n\n\n\n\n\n\n\n\n\n©1998-2023 Artisan Industrials Corporation · All Rights Reserved  \n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "links": "[]"
}