{
    "summary": "###  |\n\n###  |\n\n\n\n\n\n### _Sundials are not just for the garden any more..._\n\nHave you ever seen an indoor rainbow sundial before? You're looking at one\nright now!\n\n\n\nThe Spectra sundial is a custom-made indoor rainbow sundial that can be\nenjoyed year round in any sunny spot. Unique among sundials, the Spectra\nsundial earns its name by producing vivid prism beams, flooding the room with\nintense rainbow color as it uses the sun to accurately tell the time of day.\nAs the sun moves across the sky, the Spectra sundial creates a slow motion\nparade of bright rainbow colors moving through the room, sometimes three large\nbrilliant spectrum beams at a time.\n\n\n\nThe Spectra sundial is one of the most unique anniversary gifts available\nanywhere, especially when personalized with a special inscription and date\nline to celebrate the special day for years to come - then the tip of the time\nshadow of the sundial will \"ride the line\" on the anniversary day each year.\nYou can even have a Spectra sundial made with custom date lines celebrating\nfamily birthdays to create a future family heirloom, and it can be really fun\nfor family members to watch the time shadow getting closer and closer each day\nto touching their special birthday date line each year!\n\n\n\nSince it is \"traditional\" to give something made of paper for a first\nanniversary gift, and the \"modern\" gift recommendation is to give a clock, you\ncan do both by giving a gift certificate for a Spectra sundial...then you can\nwork together to decide where in the home it should go and what you would like\nit to say. A custom-made Spectra sundial is a creative anniversary gift idea\nand makes a very colorful first anniversary or wedding clock that will\ncelebrate the special occasion every year for years to come.\n\n\n\n\n\n\n\n\n\nIn addition to accurately telling the time of day to within minutes, unlike\nmost mass-produced commercial online or garden center sundials, each of our\ndistinctive beveled glass sundials is a truly exquisite sun sculpture...an\nexclusive upscale fine art piece that adds a colorful sense of rainbow energy\nto any sunny room.\n\n\n\nAll Spectra sundials are individually handcrafted and personally signed by\ndesigner Jim Tallman, making each Spectra sundial a truly unique one-of-a-kind\nsculptural piece and perfect personalized rainbow gift idea for \"the person\nwho has everything.\" The Spectra sundial has been in continual production\nsince 2002, and over those years Jim has shipped his sundials to customers all\nover the world. Many of them have written back to him to express their\nappreciation, and you can read some of the things they had to say on the\nSpectra sundial comments page.\n\n\n\nCorporate gift sundials can also be made with logos and inscriptions and can\nbe given as the perfect time service or retirement gift...and a custom-made\nSpectra sundial can also make a wonderful housewarming gift for the upscale\nclient from an appreciative custom builder or real estate agent.\n\n\n\n\n\n\n\n\n\nRetailing for $325.00 (US) and specially calculated, designed and handmade\nspecifically for each customer, the Spectra sundial is without a doubt one of\nthe best custom sundial values on the planet...as well as one of the most\nunique personalized gifts you will ever find.\n\n\n\nTo learn more about the details of this unique bespoke sundial follow the\nsundial links below to see how it works, what it looks like in the home, what\npeople are saying about it, and how to have one made just for you.\n\n\n\n\n\n### _A great last minute personalized gift idea!_\n\nYou can instantly buy a sundial gift certificate that we will prepare and\nemail back to you. You can then print it out and give it to your special\nrecipient however you like, so that they can contact us and have their one-of-\na-kind personalized gift handcrafted exactly as they wish, whenever they are\nready.\n\n\n\nThe Spectra sundial gift certificate is the perfect rainbow gift to celebrate\na wedding, anniversary, birthday or new arrival...you can give them colorful\ndays and a gift they will enjoy for a lifetime.\n\n\n\n  \n---  \n  \n\n\nThe Spectra Sundial · Page Directory\n\n\n\nSpectra · Details · Orders · Gallery · Comments · World of Sundials\n\n\n\n\n\n\n\n\n\nArtisan · Sundials · Ideas · Links · Contact\n\n\n\n\n\nThe Spectra sundial is a copyright protected original Jim Tallman design that\nis handmade by him in the studios of Artisan Industrials. Dealer and gallery\nenquiries are welcome - contact us directly if you are interested in working\nwith us on any special projects or representing Jim's exclusive designs.\n\n\n\n\n\n©1998-2022 Artisan Industrials Corporation · All Rights Reserved  \n---\n\n",
    "links": "[]"
}