{
    "summary": "👀 Our cloud service is now in private beta! **Request early access.**\n\n#\n\n  *   *   * Star\n\nGet started\n\n# A new kind of vector database, built for developers\n\nZero management overhead, developer-friendly and open source. LanceDB is\nlightweight, scales from development to production and is 100x cheaper than\nalternatives\n\nUse LanceDB Open SourceTry LanceDB Cloud\n\nBacked by\n\njavascriptpython\n\n    \n    \n    // Embedded in your app, no servers to manage!\n    \n    const lancedb = require(\"vectordb\");\n    \n    \n    \n    \n    // Persist your embeddings, metadata, text, images, video, audio & more\n    \n    const db = await lancedb.connect(\"./data/my_db\");\n    \n    const table = await db.openTable(\"my_table\");\n    \n    \n    \n    \n    // Production-ready, scalable vector search with optional SQL filters\n    \n    const query = await table.search([0.1, 0.3, 0.2])\n    \n                             .where(\"item != 'item foo'\")\n    \n                             .limit(2)\n    \n                             .execute();\n    \n    \n    # Embedded in your app, no servers to manage!\n    \n    import lancedb\n    \n    \n    \n    \n    # Persist your embeddings, metadata, text, images, video, audio & more\n    \n    db = lancedb.connect(\"./data/my_db\")\n    \n    table = db.open_table(\"my_table\")\n    \n    \n    \n    \n    # Production-ready, scalable vector search with optional SQL filters\n    \n    query = table.search([0.1, 0.3, 0.2])\n    \n                 .where(\"item != 'item foo'\")\n    \n                 .limit(2)\n    \n                 .to_df()\n\n## 🔎 Flexible and powerful search\n\nUse a combination of vector, full text and SQL search to query your data. You\ncan use LanceDB to store and query anything — embeddings, documents and\nmetadata.\n\n## 🚀 Scale up with on-disk storage\n\nUnlike other vector databases, LanceDB shines by querying persistent storage\nat breakneck speed. Scale from gigabytes to terabytes to petabytes without\nblowing out your budget or sacrificing performance.\n\n## ☁️ Serverless\n\nNo need to manage separate servers. LanceDB OSS runs embedded into your\napplication. LanceDB Cloud scales seamlessly with no servers.\n\n# Ecosystem integrations\n\nLanceDB APIs work seamlessly with the growing Python and Javascript ecosystem.\nManipulate data with DataFrames, build models with Pydantic, store and query\nwith LanceDB.\n\n# Trusted by developers\n\nUsed by innovative companies building self-driving cars, generative AI apps,\ntv streaming services, personalized e-commerce and more\n\n“Gumtap is critically reliant on LanceDB: minimal operations overhead, best\nscaling, and it is inexpensive. It's pretty clear that it is the right\napproach towards vector search dbs.”\n\nChris MoodyCTO, Gumtap\n\n“LanceDB is a powerful, versatile, and user-friendly tool that has greatly\nenhanced our ability to handle large datasets and complex tasks. Its unique\nblend of features and capabilities makes it an invaluable asset in the field\nof data management. I highly recommend LanceDB - it truly is the real deal. ”\n\nJohn TrenklePrincipal Machine Learning Engineer, Tubi\n\n“LanceDB felt powerful yet lightweight, and fit well into my workflow. It was\nfar more intuitive for me. It was as if SQLite, the Python data ecosystem, and\na vector database had a child and named it LanceDB.”\n\nGreg RedaML Engineer Consultant, Ex-Instacart MLE\n\n# LanceDB Cloud\n\nNo servers to manage, auto re-indexing, caching, transparent pricing and a\ndashboard to manage your data. Scale up today with LanceDB Cloud.\n\nSign up for the live beta.\n\n# What can you build?\n\nWe've got many examples to get you started\n\n## APP EXAMPLE\n\n# Code documentation Q&A bot with LangChain\n\nuse LanceDB's LangChain integration to build a Q&A bot for your documentation\n\nLearn More\n\n## APP EXAMPLE\n\n# Image multimodal search\n\nSearch through an image dataset using natural language, full text and SQL\n\nLearn More\n\n## APP EXAMPLE\n\n# Serverless LanceDB\n\nStore your data on S3 and use Lambda to compute embeddings and retrieve\nqueries in production easily.\n\nLearn More\n\n## APP EXAMPLE\n\n# Serverless QA Bot with Modal and LangChain\n\nuse LanceDB's LangChain integration with Modal to run a serverless app\n\nLearn More\n\n## APP EXAMPLE\n\n# Vector embedding search using TransformersJS\n\nEmbed and query data from LanceDB using TransformersJS\n\nLearn More\n\n## APP EXAMPLE\n\n# YouTube transcript search\n\nSearch through youtube transcripts using natural language with LanceDB\n\nLearn More\n\n## APP EXAMPLE\n\n# YouTube transcript QA bot with NodeJS\n\nuse LanceDB's Javascript API and OpenAI to build a QA bot for YouTube\ntranscripts\n\nLearn More\n\n# Backed by community\n\nLanceDB is backed by the fastest growing open-source columnar data format,\nLance. Learn more about Lance.\n\n2.5k+\n\n    Github stars\n\n50+\n\n    companies adopted\n\n40k\n\n    downloads per month\n\nDeveloper-friendly, serverless vector database for AI applications\n\nContact us\n\n### Community\n\n  * Discord\n  * Twitter\n\n### Resources\n\n  * Documentation\n  * GitHub\n  * Blog\n\n© 2023 Eto Labs, Inc. All rights reserved.\n\n  *   *   *   * \n\n"
}