{
    "summary": "Skip to main content\n\n## Microsoft Ignite\n\nNov 14-17, 2023\n\nJoin us Nov 14-17, 2023 to explore the latest innovations, learn from experts,\nlevel up your skillset, and expand your network.\n\nRegister\n\nDismiss alert\n\nThis browser is no longer supported.\n\nUpgrade to Microsoft Edge to take advantage of the latest features, security\nupdates, and technical support.\n\nDownload Microsoft Edge  More info about Internet Explorer and Microsoft Edge\n\nDocumentation\n\nGlobal navigation\n\n  * Learn\n  * Documentation\n  * Training\n  * Credentials\n  * Q&A\n  * Code Samples\n  * Assessments\n  * Shows\n  * More\n    * Documentation \n    * Training \n    * Credentials \n    * Q&A \n    * Code Samples \n    * Assessments \n    * Shows \n\nSuggestions will filter as you type\n\nSuggestions will filter as you type\n\nSearch\n\nSign in\n\n##\n\n  * Profile\n  * Settings\n\nSign out\n\nSemantic Kernel\n\n  * Getting started\n  * Prompt Engineering\n  * Chaining prompts\n  * Memories\n  * AI Plugins\n  * Deploy to Azure\n  * App samples\n  * Discord community\n  * More\n    * Getting started \n    * Prompt Engineering \n    * Chaining prompts \n    * Memories \n    * AI Plugins \n    * Deploy to Azure \n    * App samples \n    * Discord community \n\n  1. Open Semantic Kernel Repo \n\nTable of contents  Exit focus mode\n\nSearch\n\nSuggestions will filter as you type\n\n  * Overview\n  * Getting started\n  * Orchestrating AI plugins\n    * Initialize the kernel\n      * Understanding the kernel\n      * Adding AI services to the kernel\n    * Create and use AI plugins\n      * Understanding plugins\n      * Create semantic functions\n      * Create native functions\n      * Chain plugins together\n      * Export plugins as OpenAI plugins\n      * Out-of-the-box plugins\n    * Automate plugins with planners\n  * Prompt engineering\n  * Giving your AI memories\n    * Overview\n    * Introduction to context\n    * Understanding embeddings\n    * Store context in vector databases\n  * Using AI responsibly\n  * Visual Studio Code tools\n  * Chat Copilot\n  * Getting Support\n\nDownload PDF\n\n  1. Learn \n  2. Microsoft Semantic Kernel \n\n  1. Learn\n  2. Microsoft Semantic Kernel\n\nRead in English Add\n\nTable of contents Read in English Add Edit Print\n\nTwitter LinkedIn Facebook Email\n\nTable of contents\n\n# What is a vector database?\n\n  * Article \n  * 07/31/2023\n  * 7 contributors \n\nFeedback\n\n## In this article\n\n  1. Use Cases for Vector Databases\n  2. Available connectors to vector databases\n  3. Take the next step\n\nA vector database is a type of database that stores data as high-dimensional\nvectors, which are mathematical representations of features or attributes.\nEach vector has a certain number of dimensions, which can range from tens to\nthousands, depending on the complexity and granularity of the data. The\nvectors are usually generated by applying some kind of transformation or\nembedding function to the raw data, such as text, images, audio, video, and\nothers. The embedding function can be based on various methods, such as\nmachine learning models, word embeddings, feature extraction algorithms.\n\nThe main advantage of a vector database is that it allows for fast and\naccurate similarity search and retrieval of data based on their vector\ndistance or similarity. This means that instead of using traditional methods\nof querying databases based on exact matches or predefined criteria, you can\nuse a vector database to find the most similar or relevant data based on their\nsemantic or contextual meaning.\n\nFor example, you can use a vector database to:\n\n  * find images that are similar to a given image based on their visual content and style\n  * find documents that are similar to a given document based on their topic and sentiment\n  * find products that are similar to a given product based on their features and ratings\n\nTo perform similarity search and retrieval in a vector database, you need to\nuse a query vector that represents your desired information or criteria. The\nquery vector can be either derived from the same type of data as the stored\nvectors (e.g., using an image as a query for an image database), or from\ndifferent types of data (e.g., using text as a query for an image database).\nThen, you need to use a similarity measure that calculates how close or\ndistant two vectors are in the vector space. The similarity measure can be\nbased on various metrics, such as cosine similarity, euclidean distance,\nhamming distance, jaccard index.\n\nThe result of the similarity search and retrieval is usually a ranked list of\nvectors that have the highest similarity scores with the query vector. You can\nthen access the corresponding raw data associated with each vector from the\noriginal source or index.\n\n## Use Cases for Vector Databases\n\nVector databases have many use cases across different domains and applications\nthat involve natural language processing (NLP), computer vision (CV),\nrecommendation systems (RS), and other areas that require semantic\nunderstanding and matching of data.\n\nOne use case for storing information in a vector database is to enable large\nlanguage models (LLMs) to generate more relevant and coherent text based on an\nAI plugin.\n\nHowever, large language models often face challenges such as generating\ninaccurate or irrelevant information; lacking factual consistency or common\nsense; repeating or contradicting themselves; being biased or offensive. To\novercome these challenges, you can use a vector database to store information\nabout different topics, keywords, facts, opinions, and/or sources related to\nyour desired domain or genre. Then, you can use a large language model and\npass information from the vector database with your AI plugin to generate more\ninformative and engaging content that matches your intent and style.\n\nFor example, if you want to write a blog post about the latest trends in AI,\nyou can use a vector database to store the latest information about that topic\nand pass the information along with the ask to a LLM in order to generate a\nblog post that leverages the latest information.\n\n## Available connectors to vector databases\n\nToday, we have several connectors to vector databases that you can use to\nstore and retrieve information. These include:\n\nService | C# | Python  \n---|---|---  \nAzure Cognitive Search | C# | Python  \nAzure PostgreSQL Server | C# |  \nChroma | C# | Python  \nDuckDB | C# |  \nMilvus |  | Python  \nPinecone | C# | Python  \nPostgres | C# | Python  \nQdrant | C# |  \nRedis | C# |  \nSqlite | C# |  \nWeaviate | C# | Python  \n  \n## Take the next step\n\nCreate and deploy plugins\n\n* * *\n\n## Additional resources\n\nEnglish (United States)\n\nTheme\n\n  * Light \n  * Dark \n  * High contrast \n\n  *   * Previous Versions\n  * Blog\n  * Contribute\n  * Privacy\n  * Terms of Use\n  * Trademarks\n  * © Microsoft 2023\n\n## Additional resources\n\n### In this article\n\nEnglish (United States)\n\nTheme\n\n  * Light \n  * Dark \n  * High contrast \n\n  *   * Previous Versions\n  * Blog\n  * Contribute\n  * Privacy\n  * Terms of Use\n  * Trademarks\n  * © Microsoft 2023\n\n"
}