{
    "summary": "OpenSearch\n\n  * OpenSearchCon\n\n    * 2024 - Stay Informed\n    * Sessions\n    * Speakers\n    * Exhibitors\n    * Workshops\n    * Unconference\n    * CFP is closed\n  * Download\n\n  * About\n\n    * Releases\n    * Roadmap\n    * FAQ\n  * Community\n\n    * Blog\n    * Forum\n    * Slack\n    * Events\n    * Partners\n    * Projects\n  * Documentation\n\n  * Platform\n\n    * Search\n    * Observability\n    * Security Analytics\n    * Vector Database\n    * Live Demo\n    * Performance Benchmarks\n  * __\n\nOpenSearch\n\n 2.11 is available!\n\nTake the survey\n\nAttend OpenSearchCon 2023?\n\nIf you attended OpenSearchCon this year, we would appreciate your feedback on\nthis survey.\n\nRead our blog\n\nWhat's New?\n\nOur blog covers a wide range of topics like search, security, analytics,\nobservability and more.\n\nJoin today\n\nJoin our Slack Workspace\n\nJoin our active, community-driven slack and get help using, troubleshooting,\nand developing with OpenSearch.\n\nAccess the forum\n\nContribute to the OpenSearch Project\n\nJoin our active, community-driven forum and get help using, troubleshooting,\nand building with OpenSearch.\n\n# Find the truth within your data\n\nOpenSearch is the flexible, scalable, open-source way to build solutions for\ndata-intensive applications. Explore, enrich, and visualize your data with\nbuilt-in performance, developer-friendly tools, and powerful integrations for\nmachine learning, data processing, and more.\n\nDownload OpenSearch\n\nCheck Out Github\n\nOpenSearch Project Org OpenSearch Project Org OpenSearch Project Org\n\nCurrent Version: 2.11.0 / Oct 16, 2023\n\n## Build on a flexible foundation with open-source tools\n\nSearch\n\nBuild search solutions that evolve with your data\n\nObservability\n\nIdentify and expose issues across applications and infrastructure\n\nSecurity Analytics\n\nDetect and reveal security threats in real time\n\nLearn About the Platform\n\n## Community Voices\n\n> At Coralogix, we believe in making observability fast, cost effective, and\n> accessible, without limitations. That’s why we believe in building with open\n> source tools. OpenSearch gives us a powerful, flexible, open source\n> foundation to enable full-stack observability and real-time streaming\n> analytics at scale for customers everywhere.\n\nOded David R&D Director Coralogix\n\n> At Dow Jones we use a variety of open source software projects to solve\n> challenging technology problems. We are excited by the recent launch of\n> OpenSearch and how it might enhance some of our key managed Observability\n> services. We look forward to its advancement, and participating in the\n> OpenSearch community.\n\nChris Nelligan VP & CTO, Enterprise Products Dow Jones\n\n> Open source solutions have changed the way people are thinking about\n> software and hardware alike. The recent launch of OpenSearch marks an\n> exciting time, and we look forward to empowering our research content\n> platform to achieve an enhanced client, curator and developer experience.\n\nElizabeth Byrnes Managing Director Global Investment Research Division Goldman\nSachs\n\n> We in the OpenInfra community are energized by how OpenSearch has engaged\n> with the vision of an open development model, based on the four principles\n> of open source, open design, open development, and open community. And,\n> OpenSearch’s support as an infrastructure donor to the OpenStack community\n> is a tangible proof point of how our communities are working together to\n> deliver open source software that runs in production.\n\nThierry Carrez General Manager OpenInfra Foundation\n\n> Pinterest makes extensive use of open source software in our product, which\n> brings inspiration to hundreds of millions of people around the world. And\n> we contribute software to communities that are working together to advance\n> the state of the art. Because we value open source communities, we are\n> excited that OpenSearch provides a fully open source search and analytics\n> suite.\n\nDavid Chaiken Chief Architect Pinterest\n\n> We embrace cloud technologies that are built on open-source services and\n> technologies so that our customer use cases are well supported and agnostic\n> of vendors. Earlier, we relied centrally on Elasticsearch for source\n> tracking, content search, and log analytics because of its ability to ingest\n> and log large volumes of data. With the launch of OpenSearch, we can serve\n> customers across industries through its additional capabilities such as\n> Advanced security and alerting, KNN Search, and anomaly detection. It also\n> facilitates faster decision-making for the stakeholders through its\n> integrated visualization tool, OpenSearch Dashboards. In conclusion, we’re\n> excited to leverage OpenSearch in our future engagements.\n\nSanchit Jain Practice Lead and AWS APN Ambassador Quantiphi\n\n> At Rackspace Technology, we welcome more open-source contribution and\n> collaboration as it underpins modern analytics platforms and technologies.\n> Our engineers utilize the open-source spectrum across our data platform\n> implementations and are excited by the increased options and flexibility\n> OpenSearch offers when building modern data solutions for our customers. We\n> look forward to supporting its advancement and participating in the\n> OpenSearch community.\n\nVikram Reddy Kosanam Director/Head of Data, Analytics, and AI/ML Professional\nServices Rackspace Technology\n\n> SAP customers expect a unified, business-centric and open SAP Business\n> Technology Platform. Our observability strategy uses Elasticsearch as a\n> major enabler. OpenSearch provides a true open source path and community-\n> driven approach to move this forward.\n\nJan Schaffner SVP and Head of BTP Foundational Plane SAP\n\n> More and more businesses consider open source to be an important part of\n> their technology strategy. Wipro has been a pioneer and thought leader in\n> Open Source with deep foundations into open source community and development\n> process. We are delighted to see OpenSearch provide an open source search\n> and analytics suite that could enhance some of our key services around log\n> aggregation, operational monitoring and data observability. We look forward\n> to actively contributing and participating in the OpenSearch community.\n\nRakesh Verma Global Practice Head, Data Engineering & Platforms Wipro\n\n> At Zoom we recognize the importance of open source software as it allows a\n> diverse community of developers to solve problems together. We are excited\n> to see OpenSearch provide an open source solution for search, log analytics\n> and more.\n\nYasin Mohammed Engineering Manager, Cloud Operations Zoom Video Communications\n\n## Featured Blog Posts\n\ntechnical post\n\n### Introducing a traffic capture and replay solution for OpenSearch\nmigrations and upgrades\n\nWe are thrilled to introduce the beta release of a live traffic capture and\nreplay solution designed to assist users in migrating to OpenSearch. This tool\nequips users to capture live traffic from their source cluster and replay it,\neither simultaneously or offline, on a specified shadow cluster for rigorous\ntesting and analysis. By comparing the performance and behavior of the source\nand target clusters under real workload conditions, users can gain valuable\ninsights. This enables the early detection of potential migration or version\nupgrade issues, facilitating a seamless transition to OpenSearch.\n\nThu, Oct 26, 2023\n\n#### technical post\n\n### Introducing a traffic capture and replay solution for OpenSearch\nmigrations and upgrades\n\nThu, Oct 26, 2023\n\n#### technical post\n\n### Efficient filtering in OpenSearch vector engine\n\nWed, Oct 18, 2023\n\n#### search\n\n### Introducing concurrent segment search in OpenSearch\n\nWed, Oct 18, 2023\n\n#### release\n\n### Get started with OpenSearch 2.11\n\nMon, Oct 16, 2023\n\n#### release\n\n### Announcing Data Prepper 2.5.0\n\nWed, Oct 11, 2023\n\n#### technical post\n\n### Byte-quantized vectors in OpenSearch\n\nMon, Oct 09, 2023\n\n#### community\n\n### Growth and community take the spotlight at OpenSearchCon 2023\n\nFri, Oct 06, 2023\n\nView All Blog Posts\n\n# OpenSearch Links\n\n#### Get Involved\n\n  * Code of Conduct\n  * Forum\n  * Github\n  * Slack\n\n#### Resources\n\n  * About\n  * Release Schedule\n  * Maintenance Policy\n  * FAQ\n  * Testimonials\n  * Trademark and Brand Policy\n  * Privacy\n\n#### Contact Us\n\n  * Connect\n  * Twitter\n  * LinkedIn\n  * YouTube\n  * Meetup\n  * Facebook\n\n© OpenSearch contributors, 2023. OpenSearch is a registered trademark of\nAmazon Web Services.  \n  \n© 2005-2021  Django Software Foundation and individual contributors. Django is\na registered trademark of the Django Software Foundation.  \nThis website was forked from the BSD-licensed djangoproject.com originally\ndesigned by Threespot & andrevv.\n\n"
}