{
    "summary": "Opens in a new window Opens an external website Opens an external website in a\nnew window\n\nClose this dialog\n\nThis website utilizes technologies such as cookies to enable essential site\nfunctionality, as well as for analytics, personalization, and targeted\nadvertising purposes. To learn more, view the following link:  Cookie Policy\n\nClose Cookie Preferences\n\nProduct\n\nSolutions\n\nPricing\n\nResources\n\nCompany\n\nLog InSign Up Free\n\nLearn\n\n# What is a Vector Database?\n\nJump to section\n\n  * What’s the difference between a vector index and a vector database?\n  * How does a vector database work?\n  * Summary\n\n* * *\n\nWe’re in the midst of the AI revolution. It’s upending any industry it\ntouches, promising great innovations - but it also introduces new challenges.\nEfficient data processing has become more crucial than ever for applications\nthat involve large language models, generative AI, and semantic search.\n\nAll of these new applications rely on **vector embeddings**, a type of data\nrepresentation that carries within it semantic information that’s critical for\nthe AI to gain understanding and maintain a long-term memory they can draw\nupon when executing complex tasks.\n\nStart using Pinecone for free\n\nPinecone is the developer-favorite vector database that's fast and easy to use\nat any scale.\n\nSign Up FreeView Examples\n\n **Embeddings** are generated by AI models (such as Large Language Models) and\nhave a large number of attributes or features, making their representation\nchallenging to manage. In the context of AI and machine learning, these\nfeatures represent different dimensions of the data that are essential for\nunderstanding patterns, relationships, and underlying structures.\n\nThat is why we need a specialized database designed specifically for handling\nthis type of data. **Vector databases** like Pinecone fulfill this requirement\nby offering optimized storage and querying capabilities for embeddings. Vector\ndatabases have the capabilities of a traditional database that are absent in\nstandalone vector indexes and the specialization of dealing with vector\nembeddings, which traditional scalar-based databases lack.\n\nThe challenge of working with vector embeddings is that traditional scalar-\nbased databases can’t keep up with the complexity and scale of such data,\nmaking it difficult to extract insights and perform real-time analysis. That’s\nwhere vector databases come into play – they are intentionally designed to\nhandle this type of data and offer the performance, scalability, and\nflexibility you need to make the most out of your data.\n\nWith a vector database, we can add advanced features to our AIs, like semantic\ninformation retrieval, long-term memory, and more. The diagram below gives us\na better understanding of the role of vector databases in this type of\napplication:\n\nLet’s break this down:\n\n  1. First, we use the **embedding model** to create **vector embeddings** for the **content** we want to index.\n\n  2. The **vector embedding** is inserted into the **vector database** , with some reference to the original **content** the embedding was created from.\n\n  3. When the **application** issues a query, we use the same **embedding model** to create embeddings for the query, and use those embeddings to query the **database** for _similar_ vector embeddings. And as mentioned before, those similar embeddings are associated with the original **content** that was used to create them.\n\n## What’s the difference between a vector index and a vector database?\n\nStandalone vector indices like FAISS (Facebook AI Similarity Search) can\nsignificantly improve search and retrieval of vector embeddings, but they lack\ncapabilities that exist in any database. Vector databases, on the other hand,\nare purpose-built to _manage_ vector embeddings, providing several advantages\nover using standalone vector indices:\n\n  1.  **Data management:** Vector databases offer well-known and easy-to-use features for data storage, like inserting, deleting, and updating data. This makes managing and maintaining vector data easier than using a standalone vector _index_ like FAISS, which requires additional work to integrate with a storage solution.\n\n  2.  **Metadata storage and filtering:** Vector databases can store metadata associated with each vector entry. Users can then query the database using additional metadata filters for finer-grained queries.\n\n  3.  **Scalability:** Vector databases are designed to scale with growing data volumes and user demands, providing better support for distributed and parallel processing. Standalone vector indices may require custom solutions to achieve similar levels of scalability (such as deploying and managing them on Kubernetes clusters or other similar systems).\n\n  4.  **Real-time updates:** Vector databases often support real-time data updates, allowing for dynamic changes to the data, whereas standalone vector indexes may require a full re-indexing process to incorporate new data, which can be time-consuming and computationally expensive.\n\n  5.  **Backups and collections:** Vector databases handle the routine operation of backing up all the data stored in the database. Pinecone also allows users to selectively choose specific indexes that can be backed up in the form of “collections,” which store the data in that index for later use.\n\n  6.  **Ecosystem integration:** Vector databases can more easily integrate with other components of a data processing ecosystem, such as ETL pipelines (like Spark), analytics tools (like Tableau and Segment), and visualization platforms (like Grafana) – streamlining the data management workflow. It also enables easy integration with other AI related tools like LangChain, LlamaIndex and ChatGPT’s Plugins.\n\n  7.  **Data security and access control:** Vector databases typically offer built-in data security features and access control mechanisms to protect sensitive information, which may not be available in standalone vector index solutions.\n\nIn short, a vector database provides a superior solution for handling vector\nembeddings by addressing the limitations of standalone vector indices, such as\nscalability challenges, cumbersome integration processes, and the absence of\nreal-time updates and built-in security measures, ensuring a more effective\nand streamlined data management experience.\n\n## How does a vector database work?\n\nWe all know how traditional databases work (more or less)—they store strings,\nnumbers, and other types of scalar data in rows and columns. On the other\nhand, a vector database operates on vectors, so the way it’s optimized and\nqueried is quite different.\n\nIn traditional databases, we are usually querying for rows in the database\nwhere the value usually exactly matches our query. In vector databases, we\napply a similarity metric to find a vector that is the **most similar** to our\nquery.\n\nA vector database uses a combination of different algorithms that all\nparticipate in Approximate Nearest Neighbor (ANN) search. These algorithms\noptimize the search through hashing, quantization, or graph-based search.\n\nThese algorithms are assembled into a pipeline that provides fast and accurate\nretrieval of the neighbors of a queried vector. Since the vector database\nprovides **approximate** results, the main trade-offs we consider are between\naccuracy and speed. The more accurate the result, the slower the query will\nbe. However, a good system can provide ultra-fast search with near-perfect\naccuracy.\n\nHere’s a common pipeline for a vector database:\n\n  1.  **Indexing** : The vector database indexes vectors using an algorithm such as PQ, LSH, or HNSW (more on these below). This step maps the vectors to a data structure that will enable faster searching.\n\n  2.  **Querying** : The vector database compares the indexed query vector to the indexed vectors in the dataset to find the nearest neighbors (applying a similarity metric used by that index)\n\n  3.  **Post Processing** : In some cases, the vector database retrieves the final nearest neighbors from the dataset and post-processes them to return the final results. This step can include re-ranking the nearest neighbors using a different similarity measure.\n\nIn the following sections, we will discuss each of these algorithms in more\ndetail and explain how they contribute to the overall performance of a vector\ndatabase.\n\n### Algorithms\n\nSeveral algorithms can facilitate the creation of a vector index. Their common\ngoal is to enable fast querying by creating a data structure that can be\ntraversed quickly. They will commonly transform the representation of the\noriginal vector into a compressed form to optimize the query process.\n\nHowever, as a user of Pinecone, you don’t need to worry about the intricacies\nand selection of these various algorithms. Pinecone is designed to handle all\nthe complexities and algorithmic decisions behind the scenes, ensuring you get\nthe best performance and results without any hassle. By leveraging Pinecone’s\nexpertise, you can focus on what truly matters – extracting valuable insights\nand delivering powerful AI solutions.\n\nThe following sections will explore several algorithms and their unique\napproaches to handling vector embeddings. This knowledge will empower you to\nmake informed decisions and appreciate the seamless performance Pinecone\ndelivers as you unlock the full potential of your application.\n\n#### Random Projection\n\nThe basic idea behind random projection is to project the high-dimensional\nvectors to a lower-dimensional space using a **random projection matrix**. We\ncreate a matrix of random numbers. The size of the matrix is going to be the\ntarget low-dimension value we want. We then calculate the dot product of the\ninput vectors and the matrix, which results in a **projected matrix** that has\nfewer dimensions than our original vectors but still preserves their\nsimilarity.\n\nWhen we query, we use the same projection matrix to project the query vector\nonto the lower-dimensional space. Then, we compare the projected query vector\nto the projected vectors in the database to find the nearest neighbors. Since\nthe dimensionality of the data is reduced, the search process is significantly\nfaster than searching the entire high-dimensional space.\n\nJust keep in mind that random projection is an approximate method, and the\nprojection quality depends on the properties of the projection matrix. In\ngeneral, the more random the projection matrix is, the better the quality of\nthe projection will be. But generating a truly random projection matrix can be\ncomputationally expensive, especially for large datasets. Learn more about\nrandom projection.\n\n#### Product Quantization\n\nAnother way to build an index is product quantization (PQ), which is a _lossy_\ncompression technique for high-dimensional vectors (like vector embeddings).\nIt takes the original vector, breaks it up into smaller chunks, simplifies the\nrepresentation of each chunk by creating a representative “code” for each\nchunk, and then puts all the chunks back together - without losing information\nthat is vital for similarity operations. The process of PQ can be broken down\ninto four steps: splitting, training, encoding, and querying.\n\n  1.  **Splitting** -The vectors are broken into segments.\n\n  2.  **Training** \\- we build a “codebook” for each segment. Simply put - the algorithm generates a pool of potential “codes” that could be assigned to a vector. In practice - this “codebook” is made up of the center points of clusters created by performing k-means clustering on each of the vector’s segments. We would have the same number of values in the segment codebook as the value we use for the k-means clustering.\n\n  3.  **Encoding** \\- The algorithm assigns a specific code to each segment. In practice, we find the nearest value in the codebook to each vector segment after the training is complete. Our PQ code for the segment will be the identifier for the corresponding value in the codebook. We could use as many PQ codes as we’d like, meaning we can pick multiple values from the codebook to represent each segment.\n\n  4.  **Querying** \\- When we query, the algorithm breaks down the vectors into sub-vectors and quantizes them using the same codebook. Then, it uses the indexed codes to find the nearest vectors to the query vector.\n\nThe number of representative vectors in the codebook is a trade-off between\nthe accuracy of the representation and the computational cost of searching the\ncodebook. The more representative vectors in the codebook, the more accurate\nthe representation of the vectors in the subspace, but the higher the\ncomputational cost to search the codebook. By contrast, the fewer\nrepresentative vectors in the codebook, the less accurate the representation,\nbut the lower the computational cost. Learn more about PQ.\n\n#### Locality-sensitive hashing\n\nLocality-Sensitive Hashing (LSH) is a technique for indexing in the context of\nan approximate nearest-neighbor search. It is optimized for speed while still\ndelivering an approximate, non-exhaustive result. LSH maps similar vectors\ninto “buckets” using a set of hashing functions, as seen below:\n\nTo find the nearest neighbors for a given query vector, we use the same\nhashing functions used to “bucket” similar vectors into hash tables. The query\nvector is hashed to a particular table and then compared with the other\nvectors in that same table to find the closest matches. This method is much\nfaster than searching through the entire dataset because there are far fewer\nvectors in each hash table than in the whole space.\n\nIt’s important to remember that LSH is an approximate method, and the quality\nof the approximation depends on the properties of the hash functions. In\ngeneral, the more hash functions used, the better the approximation quality\nwill be. However, using a large number of hash functions can be\ncomputationally expensive and may not be feasible for large datasets. Learn\nmore about LSH.\n\n#### Hierarchical Navigable Small World (HNSW)\n\nHNSW creates a hierarchical, tree-like structure where each node of the tree\nrepresents a set of vectors. The edges between the nodes represent the\n**similarity** between the vectors. The algorithm starts by creating a set of\nnodes, each with a small number of vectors. This could be done randomly or by\nclustering the vectors with algorithms like k-means, where each cluster\nbecomes a node.\n\nThe algorithm then examines the vectors of each node and draws an edge between\nthat node and the nodes that have the most similar vectors to the one it has.\n\nWhen we query an HNSW index, it uses this graph to navigate through the tree,\nvisiting the nodes that are most likely to contain the closest vectors to the\nquery vector. Learn more about HNSW.\n\n### Similarity Measures\n\nBuilding on the previously discussed algorithms, we need to understand the\nrole of similarity measures in vector databases. These measures are the\nfoundation of how a vector database compares and identifies the most relevant\nresults for a given query.\n\nSimilarity measures are mathematical methods for determining how similar two\nvectors are in a vector space. Similarity measures are used in vector\ndatabases to compare the vectors stored in the database and find the ones that\nare most similar to a given query vector.\n\nSeveral similarity measures can be used, including:\n\n  *  **Cosine similarity:** measures the cosine of the angle between two vectors in a vector space. It ranges from -1 to 1, where 1 represents identical vectors, 0 represents orthogonal vectors, and -1 represents vectors that are diametrically opposed.\n\n  *  **Euclidean distance:** measures the straight-line distance between two vectors in a vector space. It ranges from 0 to infinity, where 0 represents identical vectors, and larger values represent increasingly dissimilar vectors.\n\n  *  **Dot product:** measures the product of the magnitudes of two vectors and the cosine of the angle between them. It ranges from -∞ to ∞, where a positive value represents vectors that point in the same direction, 0 represents orthogonal vectors, and a negative value represents vectors that point in opposite directions.\n\nThe choice of similarity measure will have an effect on the results obtained\nfrom a vector database. It is also important to note that each similarity\nmeasure has its own advantages and disadvantages, and it is important to\nchoose the right one depending on the use case and requirements. Learn more\nabout similarity measures.\n\n### Filtering\n\nEvery vector stored in the database also includes metadata. In addition to the\nability to query for similar vectors, vector databases can also filter the\nresults based on a metadata query. To do this, the vector database usually\nmaintains two indexes: a vector index and a metadata index. It then performs\nthe metadata filtering either before or after the vector search itself, but in\neither case, there are difficulties that cause the query process to slow down.\n\nThe filtering process can be performed either before or after the vector\nsearch itself, but each approach has its own challenges that may impact the\nquery performance:\n\n  *  **Pre-filtering:** In this approach, metadata filtering is done before the vector search. While this can help reduce the search space, it may also cause the system to overlook relevant results that don’t match the metadata filter criteria. Additionally, extensive metadata filtering may slow down the query process due to the added computational overhead.\n\n  *  **Post-filtering:** In this approach, the metadata filtering is done after the vector search. This can help ensure that all relevant results are considered, but it may also introduce additional overhead and slow down the query process as irrelevant results need to be filtered out after the search is complete.\n\nTo optimize the filtering process, vector databases use various techniques,\nsuch as leveraging advanced indexing methods for metadata or using parallel\nprocessing to speed up the filtering tasks. Balancing the trade-offs between\nsearch performance and filtering accuracy is essential for providing efficient\nand relevant query results in vector databases. Learn more about vector search\nfiltering.\n\n### Database Operations\n\nUnlike vector indexes, vector databases are equipped with a set of\ncapabilities that makes them better qualified to be used in high scale\nproduction settings. Let’s take a look at an overall overview of the\ncomponents that are involved in operating the database.\n\n#### Performance and Fault tolerance\n\nPerformance and fault tolerance are tightly related. The more data we have,\nthe more nodes that are required - and the bigger chance for errors and\nfailures. As is the case with other types of databases, we want to ensure that\nqueries are executed as quickly as possible even if some of the underlying\nnodes fail. This could be due to hardware failures, network failures, or other\ntypes of technical bugs. This kind of failure could result in downtime or even\nincorrect query results.\n\nTo ensure both high performance and fault tolerance, vector databases use\nsharding and replication apply the following:\n\n  1.  **Sharding** \\- partitioning the data across multiple nodes. There are different methods for partitioning the data - for example, it can be partitioned by the similarity of different clusters of data so that similar vectors are stored in the same partition. When a query is made, it is sent to all the shards and the results are retrieved and combined. This is called the “scatter-gather” pattern.\n\n  2.  **Replication** \\- creating multiple copies of the data across different nodes. This ensures that even if a particular node fails, other nodes will be able to replace it. There are two main consistency models: _eventual_ consistency and _strong_ consistency. Eventual consistency allows for temporary inconsistencies between different copies of the data which will improve availability and reduce latency but may result in conflicts and even data loss. On the other hand, strong consistency requires that all copies of the data are updated before a write operation is considered complete. This approach provides stronger consistency but may result in higher latency.\n\n#### Monitoring\n\nTo effectively manage and maintain a vector database, we need a robust\nmonitoring system that tracks the important aspects of the database’s\nperformance, health, and overall status. Monitoring is critical for detecting\npotential problems, optimizing performance, and ensuring smooth production\noperations. Some aspects of monitoring a vector database include the\nfollowing:\n\n  1.  **Resource usage** \\- monitoring resource usage, such as CPU, memory, disk space, and network activity, enables the identification of potential issues or resource constraints that could affect the performance of the database.\n\n  2.  **Query performance** \\- query latency, throughput, and error rates may indicate potential systemic issues that need to be addressed.\n\n  3.  **System health** \\- overall system health monitoring includes the status of individual nodes, the replication process, and other critical components.\n\n#### Access-control\n\nAccess control is the process of managing and regulating user access to data\nand resources. It is a vital component of data security, ensuring that only\nauthorized users have the ability to view, modify, or interact with sensitive\ndata stored within the vector database.\n\nAccess control is important for several reasons:\n\n  1.  **Data protection:** As AI applications often deal with sensitive and confidential information, implementing strict access control mechanisms helps safeguard data from unauthorized access and potential breaches.\n\n  2.  **Compliance:** Many industries, such as healthcare and finance, are subject to strict data privacy regulations. Implementing proper access control helps organizations comply with these regulations, protecting them from legal and financial repercussions.\n\n  3.  **Accountability and auditing:** Access control mechanisms enable organizations to maintain a record of user activities within the vector database. This information is crucial for auditing purposes, and when security breaches happen, it helps trace back any unauthorized access or modifications.\n\n  4.  **Scalability and flexibility:** As organizations grow and evolve, their access control needs may change. A robust access control system allows for seamless modification and expansion of user permissions, ensuring that data security remains intact throughout the organization’s growth.\n\n#### Backups and collections\n\nWhen all else fails, vector databases offer the ability to rely on regularly\ncreated backups. These backups can be stored on external storage systems or\ncloud-based storage services, ensuring the safety and recoverability of the\ndata. In case of data loss or corruption, these backups can be used to restore\nthe database to a previous state, minimizing downtime and impact on the\noverall system. With Pinecone, users can choose to back up specific indexes as\nwell and save them as “collections,” which can later be used to populate new\nindexes.\n\n#### API and SDKs\n\nThis is where the rubber meets the road: Developers who interact with the\ndatabase want to do so with an easy-to-use API, using a toolset that is\nfamiliar and comfortable. By providing a user-friendly interface, the vector\ndatabase API layer simplifies the development of high-performance vector\nsearch applications.\n\nIn addition to the API, vector databases would often provide programming\nlanguage specific SDKs that wrap the API. The SDKs make it even easier for\ndevelopers to interact with the database in their applications. This allows\ndevelopers to concentrate on their specific use cases, such as semantic text\nsearch, generative question-answering, hybrid search, image similarity search,\nor product recommendations, without having to worry about the underlying\ninfrastructure complexities.\n\n## Summary\n\nThe exponential growth of vector embeddings in fields such as NLP, computer\nvision, and other AI applications has resulted in the emergence of vector\ndatabases as the computation engine that allows us to interact effectively\nwith vector embeddings in our applications.\n\nVector databases are purpose-built databases that are specialized to tackle\nthe problems that arise when managing vector embeddings in production\nscenarios. For that reason, they offer significant advantages over traditional\nscalar-based databases and standalone vector indexes.\n\nIn this post, we reviewed the key aspects of a vector database, including how\nit works, what algorithms it uses, and the additional features that make it\noperationally ready for production scenarios. We hope this helps you\nunderstand the inner workings of vector databases. Luckily, this isn’t\nsomething you must know to use Pinecone. Pinecone takes care of all of these\nconsiderations (and then some) and frees you to focus on the rest of your\napplication.\n\nShare via:\n\nRoie Schwaber-Cohen\n\nDeveloper Advocate\n\nJump to section\n\n  * What’s the difference between a vector index and a vector database?\n  * How does a vector database work?\n  * Summary\n\nPRODUCT\n\nOverviewDocumentationTrust and Security\n\nSOLUTIONS\n\nSearchGenerative AICustomers\n\nRESOURCES\n\nLearning CenterCommunityPinecone BlogSupport CenterSystem Status\n\nCOMPANY\n\nAboutPartnersCareersNewsroomContact\n\nLEGAL\n\nTermsPrivacyCookiesCookie Preferences\n\n© Pinecone Systems, Inc. | San Francisco, CA\n\nPinecone is a registered trademark of Pinecone Systems, Inc.\n\n"
}