[
    "3. Sumsub:  Business Verification",
    "6. Trulioo:  Global identity verification company with a vast database of identities",
    "26. Sumsub:  Customizable Analytics",
    "25. Sumsub:  Compliance as a Service",
    "9. Sumsub:  Non-documentary & database verification",
    "21. Sumsub:  Reusable KYC",
    "8. Sumsub:  Address verification",
    "7. Veriff:  Identity verification provider with advanced facial recognition technology",
    "20. Sumsub:  Age Verification",
    "List of products: ",
    "17. Sumsub:  Email/Phone Verification",
    "3. Shufti Pro:  KYC software with tools for identity verification, business authenticity verification, video interview KYC, and OCR for business.",
    "4. Sumsub:  Transaction Monitoring",
    "5. KYC-Chain:  Employ Blockchain Technology for KYC",
    "5. Sumsub:  Top features (LivenessID Verification, Address Verification, Travel Rule, Workflow Builder, Non-Doc Verification)",
    "2. IDnow:  Identity verification provider with tools for customer ID verification, video online identification, digital docs signing, and self-service customer check.",
    "1. SEON:  Use Pre-KYC Checks to Save Money",
    "12. Sumsub:  Efficient case management",
    "7. ComplyAdvantage:  Get AML and KYC with a Free Plan",
    "4. IDology:  Identity verification tool and consortium network to combat fraud in North America, South America, and Europe.",
    "6. Sumsub:  ID verification",
    "24. Sumsub:  Liveness",
    "7. Sumsub:  Biometric verification",
    "1. SwiftDil:  API Reference",
    "10. iComply:  Know Your Customer and Business",
    "6. Seamfix:  Nigeria-based KYC platform with products for capturing, onboarding, verifying, and digitizing customer identities.",
    "3. LemonWay:  Payment system operator with its own KYC software solution",
    "1. Sumsub:  Book a demo",
    "2. SwiftDil:  User Guide",
    "5. Ondato:  Modular operating system for end-to-end KYC management",
    "2. Onfido:  Trusted identity verification company using AI and machine learning",
    "23. Sumsub:  Crypto Check",
    "10. Sumsub:  Secure government database checks",
    "11. Sumsub:  Flexible workflow builder",
    "14. Sumsub:  Service status",
    "6. Token of Trust:  Conduct Electronic ID Verification",
    "19. Sumsub:  Document Verification",
    "1. KYC-Chain:  KYC software provider with advanced KYC solutions",
    "3. Trulioo:  Enjoy Global Document Verification",
    "7. SigninFlow:  South African electronic signature provider with KYC Factory for business verification, Google geo-presence, web source verification, databases of verified businesses, social presence, and sanctions list.",
    "8. Ondato:  Leverage Biometrics for KYC",
    "13. Sumsub:  Developer hub",
    "Note:  All the products mentioned in the summary are from the same company, Sumsub.",
    "5. Ondato:  KYC compliance solutions including identity verification, business onboarding, customer data platform, due diligence, authentication, and virtual branch.",
    "2. Sumsub:  User Verification",
    "4. Refinitiv:  Insights from Financial Data Analysts",
    "16. Sumsub:  Supported documents",
    "2. Onfido:  Leverage AI Liveness Verification",
    "22. Sumsub:  Bank Card Check",
    "4. Shufti Pro:  KYC software provider offering services in over 200 countries",
    "Note:  The summary describes multiple products from different companies.",
    "18. Sumsub:  Biometric Verification",
    "1. LemonWay:  KYC provider with instant verification and identity confirmation for crowdfunding business or marketplace platform.",
    "15. Sumsub:  Release notes",
    "9. Actico:  KYC for Traditional Finance"
]