{
    "summary": "  * Skip to primary navigation\n  * Skip to main content\n\nAegean Med Spa - New Bern, NC\n\nHistoric Downtown New Bern, NC Salon and Med Spa from Dr. Angelo Tellis\n\nMenu\n\n__Menu\n\n  * Med Spa\n  * Advanced Cosmetic Procedures\n  * Salon\n  * Massage\n  * Float Spa\n  * Salt Lounge __ __\n    * Enhancements – Don’t just kick back in relax in our salt lounge—add one or more of our available enhancements to take your relaxation therapy to the next level! Salt Lounge Enhancements are available exclusively with your salt lounge booking.\n    * Salt Lounge – No beach needed—we invite you to enjoy the benefits of our Salt Lounge! In “the most relaxing room in New Bern”, use all of your senses to experience relaxation and comfort on the cutting edge, a respite in Eastern North Carolina’s very own “Blue Zone”.\n  * First Loved Yoga\n  * Special Offers __ __\n    * Rewards Programs – Enjoy the products and treatments you love—and get rewarded whenever you do. It is free to join and the benefits start right away. Get $20 just for becoming a member! Professional-grade skincare. Facial injectables. Cellulite treatments. You name it. Allē gives you points on over 50 products and treatments\n    * Packages & Memberships – Purchase our packages to save money on your favorite services! We also offer membership plans to fit everyone’s needs.\n  * About Us __ __\n    * Contact Us – Need more information or have a question that you don’t see on the site? Call or send us a note.\n    * News – Stay tuned on the latest from Aegean Med Spa here on our blog where we share behind-the-scenes peeks, special offers, upcoming events, and more.\n    * Photo Tour – I am incredibly proud of the space my team and I at Aegean Med Spa have built here in Historic Downtown New Bern, NC, and we invite you to take a photo tour with us on this page.\n\n## Massage Therapy for Your Health and Wellbeing\n\nTreating yourself to a therapeutic and relaxing massage at Aegean is more than\njust a bit of time to yourself—our professional massage therapists can\npersonalize your experience to help reduce stress; ease pain, muscle soreness,\nand tension; improve circulation, energy, alertness; lower heart rate and\nblood pressure; and even improve immune function.\n\nBOOK YOUR MASSAGE TREATMENT\n\n## Massage\n\nSwedish and sports massages are available at Aegean Med Spa.\n\n### Swedish Massage (30, 60, or 90 Minutes)\n\nRelax and unwind as you enjoy a 30, 60, or 90-minute massage at your desired\npressure range. Our massages are completely customized to fit your needs. Not\nonly will you experience physical benefits such as the loosening of tight\nmuscles and the release of toxins, but you will also feel a decrease in stress\nand anxiety.\n\n30, 60, or 90 Minutes\n\nBook 30 Minutes – $50\n\nBook 60 Minutes – $90\n\nBook 90 Minutes – $125\n\n### Deep Tissue Massage (30, 60, or 90 Minutes)\n\nOur deep tissue massages focus on realigning the deeper layers of the\nconnective and muscle tissue. We use slow strokes and intense pressure to\npenetrate to deeper layers of muscle and tense areas to relieve severe\ntension. This massage is recommended for those who suffer from chronic tension\nor experience consistent pain and soreness.\n\n30, 60, or 90 Minutes\n\nBook 30 Minutes – $65\n\nBook 60 Minutes – $100\n\nBook 90 Minutes – $135\n\n### Hot Stone (30, 60, or 90 Minutes)\n\nOur Hot Stone Massage uses heat to relax the muscles.\n\n30, 60, or 90 Minutes\n\nBook 30 Minutes – $65\n\nBook 60 Minutes – $100\n\n### Prenatal Massage\n\nOur Prenatal Massage is perfect for expecting mothers who are past their first\ntrimester.\n\nBook 30 Minutes – $50\n\nBook 60 Minutes – $90\n\nBook 90 Minutes – $125\n\nYou can also call 252-617-7234 to schedule your massage today!\n\nCopyright © 2024 · Aegean Med Spa · Historic Downtown New Bern, NC\n\n  * Contact Us\n\n",
    "links": "[{\"link\": \"https://aegeanmedspa.com/massage/\", \"text\": \"Massage\"}, {\"link\": \"https://aegeanmedspa.com/salt-lounge/\", \"text\": \"\"}, {\"link\": \"https://aegeanmedspa.com/special_offers/\", \"text\": \"\"}]"
}