{
    "summary": "  * Skip to primary navigation\n  * Skip to main content\n\nAegean Med Spa - New Bern, NC\n\nHistoric Downtown New Bern, NC Salon and Med Spa from Dr. Angelo Tellis\n\nMenu\n\n__Menu\n\n  * Med Spa\n  * Advanced Cosmetic Procedures\n  * Salon\n  * Massage\n  * Float Spa\n  * Salt Lounge __ __\n    * Enhancements – Don’t just kick back in relax in our salt lounge—add one or more of our available enhancements to take your relaxation therapy to the next level! Salt Lounge Enhancements are available exclusively with your salt lounge booking.\n    * Salt Lounge – No beach needed—we invite you to enjoy the benefits of our Salt Lounge! In “the most relaxing room in New Bern”, use all of your senses to experience relaxation and comfort on the cutting edge, a respite in Eastern North Carolina’s very own “Blue Zone”.\n  * First Loved Yoga\n  * Special Offers __ __\n    * Rewards Programs – Enjoy the products and treatments you love—and get rewarded whenever you do. It is free to join and the benefits start right away. Get $20 just for becoming a member! Professional-grade skincare. Facial injectables. Cellulite treatments. You name it. Allē gives you points on over 50 products and treatments\n    * Packages & Memberships – Purchase our packages to save money on your favorite services! We also offer membership plans to fit everyone’s needs.\n  * About Us __ __\n    * Contact Us – Need more information or have a question that you don’t see on the site? Call or send us a note.\n    * News – Stay tuned on the latest from Aegean Med Spa here on our blog where we share behind-the-scenes peeks, special offers, upcoming events, and more.\n    * Photo Tour – I am incredibly proud of the space my team and I at Aegean Med Spa have built here in Historic Downtown New Bern, NC, and we invite you to take a photo tour with us on this page.\n\n## Massage Therapy for Your Health and Wellbeing\n\nTreating yourself to a therapeutic and relaxing massage at Aegean is more than\njust a bit of time to yourself—our professional massage therapists can\npersonalize your experience to help reduce stress; ease pain, muscle soreness,\nand tension; improve circulation, energy, alertness; lower heart rate and\nblood pressure; and even improve immune function.\n\nBOOK YOUR MASSAGE TREATMENT\n\n## Massage\n\nSwedish and sports massages are available at Aegean Med Spa.\n\n### Swedish Massage (30, 60, or 90 Minutes)\n\nRelax and unwind as you enjoy a 30, 60, or 90-minute massage at your desired\npressure range. Our massages are completely customized to fit your needs. Not\nonly will you experience physical benefits such as the loosening of tight\nmuscles and the release of toxins, but you will also feel a decrease in stress\nand anxiety.\n\n30, 60, or 90 Minutes\n\nBook 30 Minutes – $50\n\nBook 60 Minutes – $90\n\nBook 90 Minutes – $125\n\n### Deep Tissue Massage (30, 60, or 90 Minutes)\n\nOur deep tissue massages focus on realigning the deeper layers of the\nconnective and muscle tissue. We use slow strokes and intense pressure to\npenetrate to deeper layers of muscle and tense areas to relieve severe\ntension. This massage is recommended for those who suffer from chronic tension\nor experience consistent pain and soreness.\n\n30, 60, or 90 Minutes\n\nBook 30 Minutes – $65\n\nBook 60 Minutes – $100\n\nBook 90 Minutes – $135\n\n### Hot Stone (30, 60, or 90 Minutes)\n\nOur Hot Stone Massage uses heat to relax the muscles.\n\n30, 60, or 90 Minutes\n\nBook 30 Minutes – $65\n\nBook 60 Minutes – $100\n\n### Prenatal Massage\n\nOur Prenatal Massage is perfect for expecting mothers who are past their first\ntrimester.\n\nBook 30 Minutes – $50\n\nBook 60 Minutes – $90\n\nBook 90 Minutes – $125\n\nYou can also call 252-617-7234 to schedule your massage today!\n\nCopyright © 2024 · Aegean Med Spa · Historic Downtown New Bern, NC\n\n  * Contact Us\n\n",
    "links": "[{\"link\": \"https://aegeanmedspa.com/massage/\", \"text\": \"Massage\"}, {\"link\": \"https://aegeanmedspa.com/salt-lounge/\", \"text\": \"\"}, {\"link\": \"https://aegeanmedspa.com/special_offers/\", \"text\": \"\"}]",
    "priceAndPlans": "  * Skip to primary navigation\n  * Skip to main content\n\nAegean Med Spa - New Bern, NC\n\nHistoric Downtown New Bern, NC Salon and Med Spa from Dr. Angelo Tellis\n\nMenu\n\n__Menu\n\n  * Med Spa\n  * Advanced Cosmetic Procedures\n  * Salon\n  * Massage\n  * Float Spa\n  * Salt Lounge __ __\n    * Enhancements – Don’t just kick back in relax in our salt lounge—add one or more of our available enhancements to take your relaxation therapy to the next level! Salt Lounge Enhancements are available exclusively with your salt lounge booking.\n    * Salt Lounge – No beach needed—we invite you to enjoy the benefits of our Salt Lounge! In “the most relaxing room in New Bern”, use all of your senses to experience relaxation and comfort on the cutting edge, a respite in Eastern North Carolina’s very own “Blue Zone”.\n  * First Loved Yoga\n  * Special Offers __ __\n    * Rewards Programs – Enjoy the products and treatments you love—and get rewarded whenever you do. It is free to join and the benefits start right away. Get $20 just for becoming a member! Professional-grade skincare. Facial injectables. Cellulite treatments. You name it. Allē gives you points on over 50 products and treatments\n    * Packages & Memberships – Purchase our packages to save money on your favorite services! We also offer membership plans to fit everyone’s needs.\n  * About Us __ __\n    * Contact Us – Need more information or have a question that you don’t see on the site? Call or send us a note.\n    * News – Stay tuned on the latest from Aegean Med Spa here on our blog where we share behind-the-scenes peeks, special offers, upcoming events, and more.\n    * Photo Tour – I am incredibly proud of the space my team and I at Aegean Med Spa have built here in Historic Downtown New Bern, NC, and we invite you to take a photo tour with us on this page.\n\n## **Skin Care and Facial Treatment Specialists**\n\n### For the best in skincare, facials, and massages, come to Aegean Med Spa.\n\nOur skin is the biggest and one of the most complex organs of the body and\ntells us a lot about our health⁠—which is why we need to take care of it. At\nAegean Med Spa, we can help you achieve youthful, radiant skin while you relax\nand unwind.\n\nAegean Med Spa’s skincare professionals will develop a treatment plan that is\nspecifically designed to meet your unique needs.\n\nOur services include premier med spa treatments and options to improve your\noverall appearance. We can help you get back to what you do best: living your\nlife the way that you want to. We offer facials for every skin type,\ndermaplaning, microdermabrasion, brow and lash services, BOTOX®, massages,\nliposuction, and more!\n\n* * *\n\n## Skin Care Services\n\nAt Aegean Med Spa, we offer a variety of services that will have you looking\nand feeling your absolute best!\n\n### Aegean Facial\n\nOur 80-minute facial and massage, the ultimate in luxury, delivers our most\ncomprehensive treatment for your face and skin. This treatment includes access\nto all seven of our amazing modalities listed above.\n\nBook 80 Minutes\n\n$160\n\n### Athenian Facial\n\nA 60-minute facial that includes three-to-four of our best modalities suited\nfor you and your individual skincare needs. This is a great way to nourish and\nreplenish your skin.\n\nBook 60 Minutes\n\n$120\n\n### Arcadian Facial\n\nEnjoy Aegean’s 30-minute facial, perfect for a deep cleanse and quick refresh.\nArcadian includes one-to-two modalities (listed above), extractions, and an\nadditional mask for your skin care needs.\n\nBook 30 Minutes\n\n$60\n\n### Athenian LITE Facial\n\nOur 60 mins facial that includes cleanse, extractions, 1 of our best\nmodalities, a light massage, and mask.\n\nBook 60 Minutes\n\n$80\n\n### Apollo (Lightening) Facial\n\nBrighten your skin and smooth your complexion with this customized facial for\nhyperpigmentation. This treatment includes microdermabrasion, ultrasound\nwaves, and/or radiofrequency, LED blue light therapy, along with an arm or\nhand massage. (Apollo is also great for lightening scars, as well!)\n\nBook 60 Minutes\n\n$110\n\n### Olympian (Adult or Teen Acne) Facial\n\nWin the fight against acne with the Olympian Facial! Customized for adults or\nteens, this facial includes LED blue light therapy, skin scrubber, ultrasound\nwaves, extractions, and a massage to reduce stress.\n\nBook 60 Minutes\n\n$110\n\n### Spartan (Gentleman’s) Facial\n\nMen: It is time to feel like the Spartan you are! This 45-minute custom facial\nincludes one-to-three modalities (listed above) with extractions and relaxing\nscalp massage. A beard mask is included for all of our bearded heroes!lize\nmany of the same techniques as our Aegean Facial. This clarifying treatment\nbegins with gentle steam and a full cleanse of the back to relax you and open\nyour pores. This is followed by an exfoliation treatment and extractions (if\nneeded) as well as a customized moisturizing mask.\n\nBook 45 Minutes\n\n$110\n\n### Dermaplaning and Custom Facial\n\nTwo-to-three modalities (listed above) will be selected to personalize your\nfacial for your current skincare needs. After the facial, dermaplaning is\nperformed with a small scalpel to exfoliate your skin, ridding it of dirt and\nvellus hair, better known as “peach fuzz.”\n\nBook 60 Minutes\n\n$125\n\n### Dermaplaning\n\nDermaplaning is offered as a standalone or add-on service at Aegean, using a\nsmall scalpel to exfoliate and rid your skin of dirt and vellus hair, better\nknown as “peach fuzz”.\n\nBook 30 Minutes\n\n$90 ($50 Add-On Service)\n\n### Microdermabrasion\n\nDiamond Microdermabrasion is offered at Aegean Med Spa as an individual or\nadd-on service. A minimally invasive procedure, this treatment is recommended\nto improve overall skin tone and texture. “Microderm” can improve the\nappearance of sun damage, wrinkles, fine lines, age spots, acne scarring,\nmelasma, and other skin-related concerns and conditions. A special diamond\napplicator with an abrasive surface is used by our providers to gently sand\naway the thick outer layer of the skin to rejuvenate it.\n\nBook 30 Minutes\n\n$115 ($60 Add-On Service)\n\n### Back Facial\n\nOur 45-minute back facial and massage utilize many of the same techniques as\nour Aegean Facial. This clarifying treatment begins with gentle steam and a\nfull cleanse of the back to relax you and open your pores. This is followed by\nan exfoliation treatment and extractions (if needed) as well as a customized\nmoisturizing mask.\n\n_45 minutes_\n\n$120\n\n### Skincare Consult\n\nOur talented and experienced team will work with you to address and improve\nany problems you are experiencing with your skin. We will put together a\ncomprehensive treatment plan that fits your needs and lifestyle.\n\nBook 30 Minutes\n\n$40\n\n### Microneedling Consultation\n\nMicroneedling, also referred to as “skin needling” or “collagen induction\ntherapy” is a minimally-invasive treatment for facial rejuvenation that uses a\nmicro-needling device to create controlled skin injury. Microneedling is used\nfor the treatment of skin issues related to scarring from trauma or acne, fine\nlines and wrinkles, stretch marks, and uneven skin tones.\n\nBook 30 Minutes\n\n$40\n\n### Dermapen® Microneedling\n\nThe Dermapen microneedling pen provides an unparalleled response through the\nsegmented delivery of microneedles, creating micro-injuries to the epidermis\n(outer layer of skin) and dermis (the inner layer of skin). As a result,\nmicro-injuries encourage the body’s innate ability to repair itself.\n\nBook 60 Minutes\n\n$250\n\n## Medical\n\nA variety of medical aesthetic treatments are offered after consultation at\nAegean Med Spa. All of these treatments are considered “medical grade” and\nwill be performed by a licensed, highly trained physician, physician\nassistant, or aesthetician.\n\nAfraid of “the stick”? Try Nitrous Inhalation Therapy as an enhancement at\nyour time of service! Nitrous Oxide (NO) has a long history of use as a\n“laughing gas” but it can also be used in relaxation treatments, too, to ease\nanxiety.\n\n### BOTOX®\n\nBOTOX® Cosmetic is an FDA-approved prescription medicine that is injected into\nthe muscles and used to temporarily improve the look of both moderate to\nsevere forehead lines, crow’s feet lines, and frown lines between the eyebrows\nin adults. So you look like you, only with less noticeable facial lines.\n\nBook 30-60 Minutes\n\n$12 Per Unit\n\n### Filler\n\nFillers are injectable products that help to reduce wrinkles and fine lines,\ncreate fuller lips, accentuate contours, provide replenishment in areas of\nlost volume, and improve the overall balance of the face. Dermal fillers are\ndifferent from BOTOX® in that they do not interfere with muscle movement but\nrather they create volume in an area of depletion.\n\nBook 30-60 Minutes\n\nHalf Syringe $450, Full Syringe $700\n\n### Cosmetic Consultation\n\nIf you need assistance with enhancing and sculpting your body, we can help! We\noffer consultations for liposuction, fat transfers, skin tightening, scarless\nbreast reductions, and more.\n\nBook 30-60 Minutes\n\n$50\n\n### Sexual Wellness Consultation\n\nFor those women out there looking to improve their sexual health and wellness,\nwe are proud to offer a variety of treatments that can help.\n\nErectile Dysfunction affects 1 in 4 males in the United States. Aegean Medical\nprovides men with a solution. The P-Shot AKA “priapus shot”.\n\nBook 30-60 Minutes: Women\n\nBook 30-60 Minutes: Men\n\n$50\n\n## Brows and Lashes\n\nHard strip waxing, tinting, trim, and shaping services are available.\n\n### Lash Tint\n\nInvolves dying lashes black to make them more pronounced and visible to the\nnaked eye.\n\nBook 15 Minutes\n\n$15\n\n### Brow Tinting and Shaping\n\nWe will discuss the desired shape you want to achieve. Soft wax is used for\nsensitive skin. Color is matched to fit your needs and results can last two to\nthree weeks!\n\nBook 30 Minutes\n\n$25\n\n### Lash Lift\n\nSemi-permanent lift to your lashes to help them stay curled and gives you the\neffect of longer, fuller lashes! Results from the lift can last up to a month.\n\nBook 40 Minutes\n\n$80\n\n### Lash Lift and Tint\n\nWe use a semi-permanent solution to really lift those lashes and make them\nseen! Lift effects last up to a month while the tint is visible for two to\nthree weeks.\n\nBook 60 Minutes\n\n$90\n\n### Lash Extensions\n\nSemi-permanent lift to your lashes to help them stay curled and gives you the\neffect of longer, fuller lashes! Results from the lift can last up to a month.\n\nBook Classic – Three Hours – $180  \nBook Fill In – Two Hours – $80\n\n### Brow Lamination\n\nAchieve a smoothing effect with skin-safe chemicals to semi-permanently set\nthe eyebrow hairs in a vertical direction, making them appear brushed up.\n\nBook 60 Minutes\n\n$85\n\n### Facial Waxing\n\nOur waxing services are quick and efficient. We use hard wax because it is\ngentler on your skin, is less painful, and provides a better waxing\nexperience.\n\n30-60 Minutes\n\nPricing Varies\n\n## Packages\n\nPurchase our packages to save money on your favorite services.\n\n### Dermapen® Microneedling Package\n\nThe Dermapen microneedling pen provides an unparalleled response through the\nsegmented delivery of microneedles, creating micro-injuries to the epidermis\n(outer layer of skin) and dermis (the inner layer of skin). As a result,\nmicro-injuries encourage the body’s innate ability to repair itself.\n\n60 Minutes Per Session\n\nPurchase Three Sessions for $700 (Save $50)\n\n### Morpheus8 Microneedling Package\n\nMorpheus8 utilizes radiofrequency energy to enhance the effects of standard\nmicroneedling. The radiofrequency energy goes deep into the dermis through the\nmicroneedling needles. This stimulates the production of collagen, hyaluronic\nacid, and elastin which helps with tissue repair, skin tightening, skin\nlifting, and hydration.\n\n60 Minutes Per Session\n\nPurchase Three Sessions for $1,300 (Save $200)\n\n### Aegean Sea Package\n\nIncludes four 60-minute float pod sessions.\n\n60 Minutes Per Session\n\nPurchase for $225 (Save $85)\n\n### Aegean Salt Package\n\nIncludes four 60-minute relaxation room sessions.\n\n60 Minutes Per Session\n\nPurchase for $165 (Save $55)\n\n### Aegean Sea & Salt Package\n\nIncludes four 60-minute float pod sessions and four 60-minute relaxation room\nsessions.\n\n60 Minutes Per Session\n\nPurchase for $420 (Save $140)\n\n### Day at the Spa Package\n\nIncludes one 60-minute Athenian Facial, one 60-minute Swedish Massage, and\naccess to the Salt Lounge. _(Add a 60-minute float for only $60.)_\n\n120 Minutes Per Session\n\nPurchase for $195\n\n### Spa Day for Two\n\nIncludes two Facials (choice between Athenian or Spartan), two 60-minute\nSwedish Massages, and access to the Salt Lounge. (Add two 60-minute floats for\n$110.)\n\n120 Minutes\n\nPurchase for $395\n\n## Memberships (Billed Monthly)\n\nWe offer membership plans to fit everyone’s needs.\n\n### Arcadian Membership\n\nOne 60-Minute Float Pod Session\n\nOne 60-Minute Relaxation Room Session\n\nOne Free Relaxation Room Add-On\n\n10% Off Massages, Facials, and Additional Float Pod and Relaxation Room\nSessions\n\n5% Off Store Front\n\nFree Consultations\n\nPurchase for $120 a Month\n\n### Athenian Membership\n\nOne 60-Minute Float Pod Session\n\nTwo 60-Minute Relaxation Room Sessions\n\nTwo Free Relaxation Room Add-Ons\n\n15% Off Massages, Facials, and Additional Float Pod and Relaxation Room\nSessions\n\n10% Off Store Front\n\nFree Consultations\n\n5% Off Botox or Filler\n\nOne Friend or Family Member Can Be Added to the Package\n\n_(Friends and family are only eligible to use free float, free relaxation\nroom, and 10% off store front)_\n\nPurchase for $170 a Month\n\n### Aegean Membership\n\nTwo 60-Minute Float Pod Sessions\n\nTwo 60-Minute Relaxation Room Sessions\n\nUnlimited Relaxation Room Add-Ons\n\n20% Off Massages, Facials, and Additional Float Pod and Relaxation Room\nSessions\n\n15% Off Store Front\n\nFree Consultations\n\n10% Off Botox or Filler\n\nTwo Friends or Family Members Can Be Added to the Package\n\n_(Friends and family are only eligible to use free float, free relaxation\nroom, and 15% off store front)_\n\nPurchase for $220 a Month\n\n## Classes\n\nJoin us at Aegean Med Spa for the most unique relaxation experience in New\nBern!\n\n### Aegean Relaxation Therapy (ART)\n\nJoin us at Aegean Med Spa for the most unique relaxation experience in New\nBern! ART is an hour-long immersive relaxation experience guided by Sarah\nTellis, a certified Holy yoga therapist.\n\nClasses are held in the Aegean Relaxation Center where you are surrounded by\nover 1,000 pounds of Himalayan salt. Appealing to all your senses, your\nexperience is enhanced with inhalational salt therapy, aromatherapy, healing\nfrequency music, heated foot globes, and relaxing elixirs.\n\nIncluded in your session:\n\n• Grounding and mindfulness exercises\n\n• Breathwork\n\n• Gentle meditative movement\n\n• Hot tea\n\nIntroductory offer includes 10% off a float pod session.\n\nPackage of four includes 50% off a float pod session\n\nFor a customized experience, you can also schedule private group sessions with\nSarah in the relaxation room.\n\nCustom group sessions and private parties are available! Contact us for\navailability and custom pricing.\n\nPurchase One Session for $60\n\nPurchase Four Sessions for $200\n\nCopyright © 2024 · Aegean Med Spa · Historic Downtown New Bern, NC\n\n  * Contact Us\n\n"
}