{
    "summary": "__MENU\n\n  * Massagen\n  * Gutscheine\n  * Kontakt\n\n__\n\nJetzt reservieren\n\n  * __**077 489 85 75**\n\n  * __**Rosas Massage**  \nMarktgasse 50  \n3011 Bern\n\n  * __\n\nMontag:\n\n    08:00 - 18:00\nDienstag:\n\n    08:00 - 18:00\nMittwoch:\n\n    08:00 - 18:00\nDonnerstag:\n\n    08:00 - 18:00\nFreitag:\n\n    08:00 - 18:00\nSamstag:\n\n    geschlossen\nSonntag:\n\n    geschlossen\n\n## Rosas Massage in Bern\n\n  \nDipl. Masseurin, ärztlich geprüft  \nvon empfehlenswerten Krankenkassen anerkannt\n\n# Ihre individuelle Massage – eine unvergleichliche Wohltat\n\n  \n  \nAnders als bei herkömmlichen Massagen erhalten Sie bei mir **eine auf Sie\nabgestimmte Behandlung.**  \n  \nSie sind ein einzigartiger Mensch und Ihr Körper fühlt sich nicht jeden Tag\ngleich an. Eine einfache Wellnessmassage bringt zwar eine gewisse\nErleichterung, aber oft sind es tief liegende, hartnäckige Verspannungen an\nbestimmten Stellen, welche das Wohlbefinden bald wieder von neuem\neinschränken.  \n  \nRosa hat die Fähigkeit, diese Stellen zu finden, und ganz gezielt zu\nbehandeln.  \n  \nDank der zentralen Lage an der **Marktgasse 50 in der Nähe des Bahnhofs Bern**\nsteht einem regelmässigen Besuch nichts im Wege.\n\n## Massagen\n\n  * ### Klassische Massage\n\nGeniessen Sie eine Massage, bei der Ihre Problemstellen ganz gezielt behandelt\nwerden. Verkrampfte Muskeln werden sanft, aber mit dem nötigen Druck gedehnt\nund entspannt. Schmerzen, die durch Verspannungen oder einseitige Belastung\nentstehen, verschwinden.  \n  \nDie klassische Massage wirkt sich positiv auf Blutdruck, Atmung und Verdauung\naus.\n\n  * ### Fussreflexzonen Massage\n\nDiese Massage ist nicht nur eine Wohltat für Ihre Füsse, sondern für den\nganzen Körper. Denn in jedem Fuss spiegeln sich sämtliche Körperteile des\nMenschen.  \n  \nDiese Reflexzonen werden mit gezielten Griffen behandelt. So können einzelne\nOrgane, ganze Körperpartien oder bestimmte Funktionen stimuliert werden. Die\nFussreflexzonenmassage wirkt harmonisierend auf Ihren Körper und mobilisiert\ndie eigenen Heilkräfte.\n\n  * ### Hot Stone Massage\n\nNach einer Hot-Stone-Massage werden Sie die Praxis mit entspannten Muskeln und\neiner wohligen Wärme im Körper verlassen.  \n  \nBei dieser Massageform werden angenehm warme Basaltsteine auf den Körper\ngelegt. Die Steine geben ihre Wärme an die Körperstellen ab und sorgen so für\neine wunderbare Tiefenentspannung der Muskeln.\n\n  * ### Anti Cellulite Massage\n\nEine Studie der _European Academy of Dermatology and Venerology_ zeigt auf,\ndass eine Anti Cellulite Massage Fett an Po und Beinen reduziert.  \n  \nSpezielle Massagegriffe und Drucktechniken stimulieren die Haut und das Gewebe\nan den Problemzonen. Das fördert die Durchblutung, löst Verklebungen und regt\nden Lymphfluss an.  \n  \nFür diese Massage benutzen wir eine hochwertige Anti-Cellulite-Creme.\n\n  * ### Manuelle Lymphdrainage\n\nDie manuelle Lymphdrainage ist eine spezielle Massagetechnik, bei der ich\ngeschwollene, von Flüssigkeitseinlagerungen betroffene Regionen des Körpers\nbehandle. Die Anwendung hilft, Ihr Lymphsystem und Gewebsflüssigkeiten in\nBewegung zu versetzen und ermöglicht Ödemen das Abfließen. Ihr Gewebe schwellt\nab und Schmerzen werden deutlich gelindert.\n\n## Haben Sie etwas passendes gefunden?\n\nReservieren Sie frühzeitig.\n\nJetzt reservieren\n\n# Kundenmeinungen\n\n## Diverses\n\n  * ### Geschenkgutschein\n\n**Das ideale Geschenk**\n\nOb zum Geburtstag, zu Weihnachten oder einfach so – mit einem Massagegutschein\nliegen sie immer richtig. Sie erhalten den Gutschein per E-Mail oder per Post\nzugestellt.  \nBestellung: 077 489 85 75\n\n  * ### Abonnement\n\nFragen Sie nach unseren Konditionen für Stammkunden\n\n### Empfehlenswerte Krankenkassen\n\n### Nicht empfehlenswerte Krankenkassen\n\n### Über mich\n\n**Rosa Abegglen**  \nDipl. Berufsmasseurin, ärztlich geprüft\n\nAnderen Menschen Gutes tun, indem ich ihnen Zeit widme, sie zur Ruhe kommen\nlasse und ihren Körper wieder ins Gleichgewicht bringe. Das ist es, was mich\nan meinem Beruf fasziniert.\n\nIch bin diplomierte Berufsmasseurin und übe meinen Beruf seit 2005 aus. Ich\nbin verheiratet und Mutter von einem Kind. Vor sechzehn Jahren habe ich meine\nAusbildung zur diplomierten Gesundheitsmasseurin erfolgreich abgeschlossen.\nDanach war ich hauptberuflich als Masseurin in einem Fitnesscenter tätig.\n\n2011 habe ich mich mit meiner eigenen Praxis selbständig gemacht mich in den\nfolgenden Zeit zur Berufsmasseurin weitergebildet. Seither habe ich mich in\nverschiedenen Lehrgängen weitergebildet:  \n\n  * 600 Stunden Medizinische Grundlagen\n  * Manuelle Lymphdrainage\n  * Wirbelsäulentherapie nach Breuss\n  * Indische Rückenmassage (Pristabhyanga)\n  * Lomi Lomi Nui Massage\n  * Kopfschmerz- und Migräne-Therapie\n\nFür folgende Methoden bin von EMR und ASCA zertifiziert, was von den meisten\nKrankenkassen anerkannt wird.  \n\n  * Manuelle Lymphdrainage\n  * Klassische Massage\n\n### Kontakt\n\n**Rosas Massage**  \nMarktgasse 50  \n3011 Bern  \n  \n__**077 489 85 75**  \n  \n\n  \n\nDesign & Content © 2015-2021 by abegglen.net\n\n",
    "links": "[]"
}