{
    "summary": "__\n\n  * About Us\n  * Services\n  * Spa Packages\n  * Products\n  * Events\n  * Contact Us\n  * Spa Membership\n\n252.649.1617\n\n  * About\n    * Picture Gallery\n    * Reviews\n    * Juice Bar & Café\n    * Spa Etiquette\n  * Services\n    * Body Treatments\n    * Facials & Peels\n    * Float Pod\n    * HydraFacial\n    * Makeup & Lashes\n    * Massage\n    * Nails\n    * Lasers\n    * Microneedling & Skin Classic\n    * Permanent Makeup\n    * SaltFacial™\n    * Subnovii Plasma Pen\n    * Waxing\n  * Packages\n    * Spa Packages\n    * Spa Princess\n    * Spa Membership\n  * Products\n    * Makeup\n    * Nail Care\n    * Skin Care\n  * Contact\n\n__\n\nMenu\n\n252.649.1617\n\nBody Treatments\n\nSpa & Wellness / Services / Body Treatments\n\n#  Rinnova Spa Body Treatments Don't forget to take care of your body.\n\nA body treatment is like a whole-body facial and the perfect way to take care\nof the skin you are in. Our body treatments provide an all over exfoliation\nand intense hydration to revitalize the skin. A body treatment that\nincorporates a wrap infuses the skin with essential vitamins, minerals and\nvital nutrients to nourish the skin. A body treatment is an incredibly\nrelaxing treatment. Add on CBD oil to any treatment to enhance relaxation and\nto help alleviate stress $15 add on.\n\n### Hydrating Body Treatment / 60 min. $160\n\n* * *\n\nThis full body skin treatment includes dry brushing the entire body to promote\ncirculation and exfoliation. A hydrating body mask is applied, and you will be\ncocooned in a thermal wrap which infuses and nourishes the skin with essential\nvitamins, minerals and vital nutrients. Your skin will be soft to the touch\nand glowing!\n\n### Detoxifying Body Treatment / 75 min. $200\n\n* * *\n\nThis full body skin treatment begins with 15 minutes in our dry sauna to\npromote detoxifying the skin. To start you will enjoy dry body brushing to\nstimulate circulation and assist in the elimination of toxins. A full body\nseaweed mask is then applied to detoxify and hydrate the skin. You will be\nencapsulated in a heated wrap to enhance the detoxifying experience. Finish\nwith a soothing scalp massage.\n\n### Fascia therapy and lymphatic drainage Body Treatment / 90 min. $250\n\n* * *\n\nThis full body skin treatment begins with 15 minutes in our dry sauna to\npromote detoxifying the skin. This body contouring treatment starts with dry\nbody brushing to stimulate circulation and assist in the elimination of\ntoxins. An application of our body firming and contouring creme is applied to\ntighten and tone loose skin; eliminating the “orange peel” look associated\nwith cellulite. Your skin will be left smooth, toned and hydrated. This is a\nrelaxing and invigorating body toning treatment to fight skin laxity on a\ncellular level. This service stimulates collagen production and reduces the\nvolume of lipid cells for a smooth, more sculpted body.\n\n\n\n### Packages\n\n### Products\n\n### Membership\n\n## Ready to Be Pampered?\n\nReserve your spa treatments\n\nBook Now __ Gift Cards __\n\n2098 Mayhew Drive  \nSuite A  \nNew Bern, NC 28560\n\n252.649.1617\n\n  * ____\n  * ____\n\n  * About Us\n  * Services\n  * Spa Packages\n  * Products\n  * Events\n  * Contact Us\n  * Spa Membership\n  * Picture Gallery\n  * Reviews\n  * Spa Etiquette\n\n© 2024 Rinnova Spa & Wellness Center. All Rights Reserved.\n\nPrivacy Policy | Terms of Use | Cookie Policy | HIPAA Privacy Policy\n\n",
    "links": "[{\"link\": \"https://www.rinnovaspa.com/medical-spa-services-new-bern/body-treatments/\", \"text\": \"Body Treatments\"}, {\"link\": \"https://www.rinnovaspa.com/privacy-policy/\", \"text\": \"Privacy Policy\"}, {\"link\": \"https://www.rinnovaspa.com/terms-of-use/\", \"text\": \"Terms of Use\"}, {\"link\": \"https://www.rinnovaspa.com/cookie-policy/\", \"text\": \"Cookie Policy\"}, {\"link\": \"https://www.rinnovaspa.com/hipaa-privacy-policy/\", \"text\": \"HIPAA Privacy Policy\"}]",
    "priceAndPlans": "__\n\n  * About Us\n  * Services\n  * Spa Packages\n  * Products\n  * Events\n  * Contact Us\n  * Spa Membership\n\n252.649.1617\n\n  * About\n    * Picture Gallery\n    * Reviews\n    * Juice Bar & Café\n    * Spa Etiquette\n  * Services\n    * Body Treatments\n    * Facials & Peels\n    * Float Pod\n    * HydraFacial\n    * Makeup & Lashes\n    * Massage\n    * Nails\n    * Lasers\n    * Microneedling & Skin Classic\n    * Permanent Makeup\n    * SaltFacial™\n    * Subnovii Plasma Pen\n    * Waxing\n  * Packages\n    * Spa Packages\n    * Spa Princess\n    * Spa Membership\n  * Products\n    * Makeup\n    * Nail Care\n    * Skin Care\n  * Contact\n\n__\n\nMenu\n\n252.649.1617\n\nFacials & Peels\n\nSpa & Wellness / Services / Facials & Peels\n\n#  Facials & Peels New Bern\n\n### Rinnova Relaxation Facial / 60 min. $90\n\n* * *\n\nBook Now __\n\nAn indulgent experience created to thoroughly pamper you! Our Relaxation\nfacial includes: gentle cleanse, exfoliation as well as a mask customized for\nyour skin, luxurious neck, shoulder, hand and arm massage.\n\n### Skin Perfecting Custom Facial / 75 min. $110\n\n* * *\n\nBook Now __\n\nOur most popular Facial is a “Results Driven Treatment.” Your skincare\nprovider will base your treatment on your needs and skin type. The facial is\nCOMPLETLEY customized for you whether you need an acne purifying treatment,\nanti-aging treatment, brightening or hydrating treatment.\n\n### Skin Perfecting Custom Facial Plus / 90 min. $140\n\n* * *\n\nBook Now __\n\nGet the results you want PLUS the pampering you deserve. This is the ULTIMATE\nfacial experience; you will get the benefits of the Custom Facial with extra\nupgrades. The treatment can include a combination of a deep cleanse,\nexfoliation, extractions, dermaplane, microdermabrasion, ultrasonic, LED\ntherapy, micro-current, eye & lip treatment. Also includes an extended\nrelaxing facial, shoulder, hand and arm massage.\n\n### Gentleman's Skin Treatment / 60 min. $95\n\n* * *\n\nBook Now __\n\nThis simple, yet relaxing treatment is designed to address the skincare\nconcerns specific to our male clients. Gentle facial scrub, moisturizer &\nmassage. Relax for a few minutes and walk away looking your best. Great for\nall skin types, course texture and hyperpigmentation.\n\n### Gentleman's Skin Treatment Plus / 75 min. $105\n\n* * *\n\nBook Now __\n\nAn upgraded version of our Gentleman’s Treatment with the addition of a\ngrooming “tune up” (brow maintenance, ears and nose waxing, specialty beard\noil for hydration.\n\n### SaltFacial™ Skin Renewal / 60 min. $300\n\n* * *\n\nBook Now __\n\nThe SaltFacial™ Skin Renewal Therapy uses three state-of-the-art technologies\nto transform your skin:\n\n1\\. Restore (resurfacing): Exfoliate with all natural sea salt\n\n2\\. Replenish (aesthetic ultrasound): 3 MHz ultrasound delivers hydrating\nanti-oxidants deep into tissue…precisely where they were formulated to work\n\n3\\. Rejuvenate (Phototherapy): High intensity, multi-wavelength LED light\ntherapy\n\nYou will see a difference in just one treatment without irritation and\ndowntime. It is the next level in advanced skin renewal therapy…. Naturally!\n\n### Rejuvapen $275\n\n* * *\n\nBook Now __\n\nThe Rejuvapen treatment is a micro-needling treatment that stimulates the\nproduction of collagen in the skin. This medical grade treatment not only will\nimprove the skins appearance, but also can be used to treat hyper-\npigmentation, stretch marks, acne scars and fine lines and wrinkles.\n\nRejuvapen Series of 3 – $720.00 _(includes take home skincare kit)_\n\n### Clear & Brilliant Mini Fraxel Laser Treatment / 30 min. $400\n\n* * *\n\nBook Now __\n\nCreates a more even skin canvas, with reduction in the appearance of pores,\nwrinkles, sunspots & textural problems. Helps improve tone and texture and\ngives skin a radiant, youthful glow by boosting collagen at a dermal level.\nDiscounted pricing available for series purchase.\n\n### Aesthetician Consult / 30 min. $30\n\n* * *\n\nBook Now __\n\nIf you would like to meet with a medical aesthetician to discuss treatment\noptions and skin care in general, please see us for a consultation including\nan in-depth skin analysis.\n\n### Back Treatment / 60 min. $90\n\n* * *\n\nBook Now __\n\nOur Back “Facial” provides soothing skin care for that hard to reach area!\nThis service includes cleansing, exfoliating, extractions (high frequency &\nspot treatment if needed). Finish with warm towels & moisturizer to leave your\nback brighter and smoother.\n\n### Dermaplane Treatment / 30 min. $55\n\n* * *\n\nBook Now __\n\nDermaplaining, or blading is an exfoliating treatment that provides an\nalternative to chemical peels or microdermabrasion and is a good choice for\nanyone who has fine facial hair, extremely sensitive skin, redness, or\nrosacea. Our expert medical aestheticians use a blunt-tipped blade to gently &\npainlessly exfoliate the outer layer of dead skin cells and remove fine facial\nhair commonly known as peach fuzz. Finish with serums and moisturizers for\nyour skin type.\n\n### Teen Facial / 30 min. $60\n\n* * *\n\nBook Now __\n\nThis is a condensed treatment focusing on the needs of hormonal teenage skin.\nWill include a deep cleanse, exfoliation, extractions and mask specific for a\nparticular skin type.\n\n### Prenatal Facial / 45 min. $80\n\n* * *\n\nBook Now __\n\nThis is a nice treat for mommies to be using safe and gentle products. Enjoy a\nrelaxing facial cleanse, steam, natural soothing mask application, warm\ntowels, and facial massage. Our facial treatment bed is adjustable for your\ncomfort and will be in an elevated position for this service.\n\n### Express Facial / 30 min. $60\n\n* * *\n\nBook Now __\n\nShort enough for a lunch break, but long enough to feel relaxed. Our express\nfacial includes the basic elements of a facial leaving you glowing and\nrestored.\n\n### Hydrafacial MD® - Standard / 45 min. $195\n\n* * *\n\nBook Now __\n\nA multi-step treatment that cleanses, evenly exfoliates and extracts\nimpurities and dead skin cells while simultaneously replenishing vital\nnutrients including Antioxidants, Peptides, and Hyaluronic Acid, to the skin.\nThe HydraFacial MD® offers instant, noticeable results with no downtime or\ndiscomfort.\n\n### Vi Peel / 30 min. $250\n\n* * *\n\nBook Now __\n\nThe VI Peel contains a synergistic blend of powerful ingredients suitable for\nall skin types. This peel provides dramatic results with virtually no pain, no\nskin preparation, and little downtime. The VI Peel will improve the Tone,\nTexture, and clarity of the skin. It will reduce or eliminate age spots,\nfreckles, and hyper-pigmentation including melasma, soften fine lines and\nwrinkles, clear acne skin conditions, reduce or eliminate acne scars, and\nstimulate the production of collagen for firmer more youthful skin. VI Peel\nalso works well in conjunction with lasers, injectables, and post procedure.\nWhy wait weeks or months for results? Enjoy radiant, younger looking skin with\nthe VI Peel.\n\n### ADD ON SERVICES:\n\n* * *\n\n  * Facial Cupping\n  * Ultrasonic\n  * Lip Treatment- $15\n  * Firming/Anti-aging Eye Treatment- $15\n  * Paraffin Hand Treatment- $10\n  * LED Therapy- $15\n  * Lash Lift & Tint- $75.00\n\n_*Facial waxing, eyebrow threading service, and tinting available as a\nstandalone treatment or add-on._\n\n### Packages\n\n### Products\n\n### Membership\n\n## Ready to Be Pampered?\n\nReserve your spa treatments\n\nBook Now __ Gift Cards __\n\n2098 Mayhew Drive  \nSuite A  \nNew Bern, NC 28560\n\n252.649.1617\n\n  * ____\n  * ____\n\n  * About Us\n  * Services\n  * Spa Packages\n  * Products\n  * Events\n  * Contact Us\n  * Spa Membership\n  * Picture Gallery\n  * Reviews\n  * Spa Etiquette\n\n© 2024 Rinnova Spa & Wellness Center. All Rights Reserved.\n\nPrivacy Policy | Terms of Use | Cookie Policy | HIPAA Privacy Policy\n\n"
}