{
    "summary": "top of page\n\nSkip to Main Content\n\nLog In\n\nEN\n\nEN\n\nDE\n\n  * Home\n\n  * About\n\n  * Contact\n\n  * Services\n\n  * FAQ\n\n  * Testimonials\n\n  * Book Online\n\n  * More\n\nUse tab to navigate through the menu items.\n\n  *   * \n\n# Therapeutic & Sports Massage  \nMyofascial Release\n\nTuesday: Bollwerk 21, 3011 Bern\n\n​\n\nThursday: Randweg 9, 3013 Bern\n\nBook In\n\n## Need an urgent appointment\n\nIf you can't find suitable time or need to book in urgently, please message on\n+41 77 410 8568, so I can help.\n\n## Hello\n\nMy name is Peta McSharry\n\nI specialise in Sports and Therapeutic Massage, Myofascial Release, using\npostural analysis and muscle testing to understand the  underlying causes of\npain or to allow you to get the best out of  your sports.\n\nAbout Me\n\n# Techniques\n\n#### Techniques used will be defined by what you need from the session. This\nis what I am trained in:\n\nSports Massage\n\n###### Train, recover, perform\n\nAs sports people we tend to push our bodies hard, short-changing it on\nrecovery and sleep in the quest of balancing work, life and sport. Keeping you\non top of your training plan is our goal.\n\n##### Postural Assessment\n\n###### Observe, identify, implement\n\nImbalances in load through the muscles and joints often result in injuries or\npain, especially when doing repetitive movements, such as running or cycling.\nBy observing your posture, identifying the fascia or muscles affecting your\nposture and then implementing my strategy to correct this pattern, allows me\nto identify what may be causing an injury.\n\n##### Therapeutic Massage\n\n###### Relieve, resolve, restore\n\nAs we slowly lose our battle against gravity, changes in our posture result in\nthe body's inability to heal a problem. Therapeutic massage aims to fix\nissues, so you don't need to live with them.\n\n##### Kinesio  \nTaping\n\n###### Clever, magical, helpful\n\nFirst patented in 1967, Kinesio Tape works on the fascial system underneath\nthe skin. Neuro sensors in the fascia send information to the brain related to\nload, by applying Kinesio tape in different ways, a change in the information\nsent to the brain can get a muscle to activate more strongly or with lower\npower, or it can be used to reduce pain in the area.\n\n##### Myofascial Release\n\n###### Evaluate, align, systemic\n\nMyofascial Release treats the body as an integrated unit. Load runs along\nfascial lines, with tension in one part affecting the body in another part,\nusually causing pain. Treating the myofascial system takes an integrated look\nat the body and aims to rebalance load through the correct fascial lines.\n\n##### Muscle\n\n##### testing\n\n###### Test, comparison, advise\n\nUnderstanding the symmetry between both sides of the body and identifying\nwhere some muscle may not be boing their work, enables me to give exercises to\nkick-start these muscles so they can pick up the workload from the ones\noverworking and complaining (usually the ones in pain).\n\n# About me\n\n1\n\nMy Style\n\nEvery therapist works to their own style, even when they received the same\neducation. Driven by sports and goals, my treatment is the same, goal\norientated. Here you can find out a bit more of how I work.\n\nMore Info\n\n2\n\nMy Experience\n\nI’ve run my own clinic for 16 years, most of it in the financial district in\nLondon. I spent two years as part of an integrated clinic on Harley Street,\nworking with the head, diagnostic Osteopath. I taught Sports and Remedial\nMassage for 6 years at the London School of Sports Massage.\n\nMore Info\n\n3\n\nMy qualifications\n\nTrained to diploma level in the United Kingdom in 2004, I went on to study\nMyofascial Release and Postural Assessment.  I am also a performance cycle\ncoach, giving me insight into where a training plan could be causing injuries.\n\nMore Info\n\nI just wished she still lived in London\n\n> “She is the 'athlete-wisperer' who quickly assesses and threats an issue\n> during maintenance before it becomes an injury, and when injury does strike,\n> as with my achilles rupture, she guides and facilitates a speedy recovery.\"\n\n# Book a Service\n\n  * ## 60 minutes\n\nRead More\n\n100 Swiss francs\n\nCHF 100\n\nBook Now\n\n  * ## 45 minutes\n\nRead More\n\n75 Swiss francs\n\nCHF 75\n\nBook Now\n\n  * ## 90 minutes\n\nRead More\n\n150 Swiss francs\n\nCHF 150\n\nBook Now\n\n# Contact Us\n\n### Address\n\nTuesday: Bollwerk 21, 3011 Bern\n\n​\n\nThursday: Randweg 9, 3012 Bern\n\n### Contact\n\n+41 77 410 8568\n\nsportsmassagezone@gmail.com\n\n  *   * \n\n### Opening Hours\n\nTuesday\n\n08:00 am – 19:00 pm\n\nThursday\n\n08:00 am – 19:00 pm\n\n​\n\n​\n\nsportsmassagezone@gmail.com\n\n©2022 by Sports Massage Zone.\n\n  * \n\nbottom of page\n\n",
    "links": "[{\"link\": \"https://www.sportsmassagezone.ch/about\", \"text\": \"About\"}, {\"link\": \"https://www.sportsmassagezone.ch/contact\", \"text\": \"Contact\"}, {\"link\": \"https://www.sportsmassagezone.ch/services\", \"text\": \"Services\"}, {\"link\": \"https://www.sportsmassagezone.ch/faq\", \"text\": \"FAQ\"}, {\"link\": \"https://www.sportsmassagezone.ch/testimonial\", \"text\": \"Testimonials\"}, {\"link\": \"https://www.sportsmassagezone.ch/book-online\", \"text\": \"Book Online\"}, {\"link\": \"https://www.sportsmassagezone.ch/book-online\", \"text\": \"\"}, {\"link\": \"https://www.sportsmassagezone.ch/about\", \"text\": \"\"}, {\"link\": \"https://www.sportsmassagezone.ch/style\", \"text\": \"\"}, {\"link\": \"https://www.sportsmassagezone.ch/experience\", \"text\": \"\"}, {\"link\": \"https://www.sportsmassagezone.ch/qualifications\", \"text\": \"\"}, {\"link\": \"https://www.sportsmassagezone.ch/service-page/60-minutes-1\", \"text\": \"60 minutes\"}, {\"link\": \"https://www.sportsmassagezone.ch/service-page/45-minutes-1\", \"text\": \"45 minutes\"}, {\"link\": \"https://www.sportsmassagezone.ch/service-page/90-minutes-2\", \"text\": \"90 minutes\"}]"
}