{
    "summary": "×close\n\nWe use cookies to improve HubSpot’s site. Some cookies are necessary for our\nwebsite and services to function properly. Other cookies are optional and help\npersonalize your experience, including advertising and analytics. You can\nconsent to all cookies, decline all optional cookies, or manage optional\ncookies. Without a selection, our default cookie settings will apply. You can\nchange your preferences at any time. To learn more, check out our Cookie\nPolicy.\n\nAccept allDecline all\n\nManage cookies\n\nSkip to content\n\n  * English : Select a language\n    * 日本語 \n    * Deutsch \n    * English \n    * Español \n    * Português \n    * Français \n  * High Contrast\n\n  * Log in \n  * Start free or get a demo \n\nMenu\n\nSearch...\n\n  * ###### Blogs\n\n### Blogs\n\nTrusted by business builders worldwide, the HubSpot Blogs are your number-one\nsource for education and inspiration.\n\n    * ####  Marketing \n\nResources and ideas to put modern marketers ahead of the curve\n\n    * ####  Sales \n\nStrategies to help you elevate your sales efforts\n\n    * ####  Service \n\nEverything you need to deliver top-notch customer service\n\n    * ####  Website \n\nTutorials and how-tos to help you build better websites\n\n    * ####  The Hustle \n\nThe insights you need to make smarter business decisions\n\n    * ####  Next in AI \n\nYour essential daily read on all things AI and business.\n\nSee all blogs\n\n    * Explore by topic\n    * Instagram Marketing\n\n####  Instagram Marketing\n\n    * Customer Retention\n\n####  Customer Retention\n\n    * Email Marketing\n\n####  Email Marketing\n\n    * SEO\n\n####  SEO\n\n    * Sales Prospecting\n\n####  Sales Prospecting\n\n  * ###### Newsletters\n\n### Newsletters\n\nAll of HubSpot's handcrafted email newsletters, tucked in one place.\n\n    * ####  The Hustle \n\nIrreverent and insightful takes on business and tech, delivered to your inbox\n\n  * ###### Videos\n\n### Videos\n\nBrowse our collection of educational shows and videos on YouTube.\n\n    * ####  The Hustle \n\nOur unrivaled storytelling, in video format. Subscribe for little revelations\nacross business and tech\n\n    * ####  Marketing with HubSpot \n\nLearn marketing strategies and skills straight from the HubSpot experts\n\n    * ####  My First Million \n\nWhen it comes to brainstorming business ideas, Sam and Shaan are legends of\nthe game\n\n    * ####  Marketing Against the Grain \n\nWatch two cerebral CMOs tackle strategy, tactics, and trends\n\n    * ####  HubSpot \n\nEverything you need to know about building your business on HubSpot\n\nSee all videos\n\n  * ###### Podcasts\n\n### Podcasts\n\nHubSpot Podcast Network is the destination for business professionals who seek\nthe best education on how to grow a business.\n\n    * ####  My First Million \n\nEach week, hosts Sam Parr and Shaan Puri explore new business ideas based on\ntrends and opportunities in the market\n\n    * ####  Goal Digger \n\nRedefining what success means and how you can find more joy, ease, and peace\nin the pursuit of your goals\n\n    * ####  The Hustle Daily Show \n\nA daily dose of irreverent, offbeat, and informative takes on business and\ntech news\n\n    * ####  Another Bite \n\nEach week, Another Bite breaks down the latest and greatest pitches from Shark\nTank\n\n    * ####  Business Made Simple \n\nBuild your business for far and fast success\n\n    * ####  Marketing Against the Grain \n\nHubSpot CMO Kipp Bodnar and Zapier CMO Kieran Flanagan share what's happening\nnow in marketing and what's ahead\n\n    * Online Marketing Made Easy\n\n####  Online Marketing Made Easy\n\n    * The Product Boss\n\n####  The Product Boss\n\n    * Nudge\n\n####  Nudge\n\n    * Side Hustle Pro\n\n####  Side Hustle Pro\n\n    * Outbound Squad\n\n####  Outbound Squad\n\nSee all podcasts\n\n  * ###### Resources\n\n### Resources\n\nExpand your knowledge and take control of your career with our in-depth\nguides, lessons, and tools.\n\n    * ####  Academy \n\nLearn and get certified in the latest business trends from leading experts\n\n    * ####  Templates \n\nInteractive documents and spreadsheets to customize for your business's needs\n\n    * ####  Ebooks \n\nIn-depth guides on dozens of topics pertaining to the marketing, sales, and\ncustomer service industries\n\n    * ####  Kits \n\nMulti-use content bundled into one download to inform and empower you and your\nteam\n\n    * ####  Tools \n\nCustomized assets for better branding, strategy, and insights\n\n  * Search...\n  * ###### HubSpot Products\n\n### The HubSpot Customer Platform\n\nAll of HubSpot's marketing, sales, customer service, CMS, operations, and\ncommerce software on one platform. See pricing\n\n    * ####  Free HubSpot CRM \n\n    * ####  Overview of all products \n\n    * ####  Marketing Hub \n\nMarketing automation software. Free and premium plans\n\n    * ####  Sales Hub \n\nSales CRM software. Free and premium plans\n\n    * ####  Service Hub \n\nCustomer service software. Free and premium plans\n\n    * ####  CMS Hub \n\nContent management software. Free and premium plans\n\n    * ####  Operations Hub \n\nOperations software. Free and premium plans\n\n    * ####  Commerce Hub \n\nB2B commerce software. Free and premium plans\n\n    * About HubSpot\n    * Contact Us\n    * Customer Support\n\nStart free or get a demo  Contact Sales\n\n    * ####  About HubSpot \n\n    * ####  Contact Us \n\n    * ####  Customer Support \n\n    * #### Log in\n\n  * Start free or get a demo \n\n  * English : Select a language\n\n    * ####  日本語 \n\n    * ####  Deutsch \n\n    * ####  English \n\n    * ####  Español \n\n    * ####  Português \n\n    * ####  Français \n\n  * High Contrast\n  * Log in \n\n  * Hubspot Blog \n  * HubSpot.com \n\nLoading\n\n###### Oh no! We couldn't find anything like that.\n\nTry another search, and we'll give it our best shot.\n\nLoad More Results\n\n# The Beginner's Guide to Website Development\n\nRead about the basics of web development, the process of creating a website,\nand additional resources for those who want to learn more.\n\nWritten by: Allie Decker\n\n## FREE RESOURCE: 35 CODING TEMPLATES\n\nFree code snippet templates for HTML, CSS, and JavaScript.\n\nDownload Now\n\nUpdated:  01/09/24\n\nPublished:  01/09/24\n\n## What is website development?\n\nWebsite development broadly refers to the tasks and processes involved in\ncreating and maintaining a website. This includes everything from markup and\ncoding to scripting, network configuration, and CMS development.\n\nAs someone who's spent countless hours coding and experimenting with websites,\nI've come to see web development as more than just markup and coding; it's an\nart form, a way of bringing ideas to life. While web development typically\nrefers to web markup and coding, website development includes all related\ndevelopment tasks, such as client-side scripting, server-side scripting,\nserver and network security configuration, ecommerce development, and content\nmanagement system (CMS) development.\n\n### Download Now: 50 Code Templates [Free Snippets]\n\nI’m excited to share with you the basics of web development and the\nexhilarating process of creating a website from scratch. I remember the first\nwebsite I ever built—it was full of bright colors and clunky animations, but\nit was mine, and it sparked a lifelong passion. Through trial and error, I've\npersonally discovered the joy of turning complex problems into elegant\nsolutions.\n\nFeel free to leap around the guide using the chapter links.\n\n## Chapters\n\nprev next\n\n  1. Web Development Basics\n\n  2. Types of Web Development\n\n  3. The Web Development Process\n\n  4. Web Development Resources\n\n  *   *   * \n\n\n\n## Why is web development important?\n\nCan you believe that we're part of a world where over 5.30 billion people are\nconnected through the Internet? That's more than half of our global\npopulation, actively engaging in research, connection, education, and\nentertainment through this incredible digital universe. Personally, I believe\nthe Internet isn’t just a luxury; it's a fundamental part of our daily lives.\n\nGiven the rapidly increasing number of Internet users, it’s no surprise that\nweb development is a rapidly expanding industry. Between now and 2030, the\nemployment of web developers is expected to grow by 13%, much faster than most\nother technology careers. It's an exciting time to be in this field, and I'm\nthrilled to be part of this dynamic industry.\n\n_See why thousands of customers use CMS Hub to build an optimized website that\nintegrates with their HubSpot CRM data and full marketing suite._\n\nWe're committed to your privacy. HubSpot uses the information you provide to\nus to contact you about our relevant content, products, and services. You may\nunsubscribe from these communications at any time. For more information, check\nout our Privacy Policy.\n\n###\n\nFirst Name*\n\nLast Name*\n\nEmail *\n\nPhone Number*\n\nWebsite URL*\n\nCompany Name*\n\nHow many employees work there?*\n\n\\- Please Select -12 to 56 to 1011 to 2526 to 5051 to 200201 to 1,0001,001 to\n10,00010,001 or more\n\n  * Subscribe to HubSpot's marketing blog\n\nMulti-Step Form Email Follow-Up ID\n\nContent Language\n\nGACLIENTID\n\n[DO NOT USE] GAUSERID\n\nGATRACKID\n\nLegal basis for processing contact's data\n\nGDPR Notice (Custom Forms)\n\nRecent Custom Form Module\n\nWe're committed to your privacy. HubSpot uses the information you provide to\nus to contact you about our relevant content, products, and services. You may\nunsubscribe from these communications at any time. For more information, check\nout our _Privacy Policy._\n\n### 50 Free Coding Templates\n\nFree code snippet templates for HTML, CSS, and JavaScript -- Plus access to\nGitHub.\n\n  * Navigation Menus & Breadcrumbs Templates \n  * Button Transition Templates \n  * CSS Effects Templates \n  * And more! \n\nGet Your Free Templates\n\nLoading your download form\n\n### You're all set!\n\nClick this link to access this resource at any time.\n\nAccess now\n\nLearn more\n\n## Web Development vs. Web Programming\n\nWeb development and web programming sound very similar — and they are. But\nthere’s one very important distinction.\n\nWeb development refers to the overall process of creating websites or web\napplications, including the project’s design, layout, coding, content\ncreation, and functionality. It involves using a combination of programming\nlanguages, tools, and frameworks to bring a website or web application to\nlife. It may also encompass project management activities, such as fielding\ndevelopment requests from stakeholders or freelance clients.\n\nWeb programming, on the other hand, specifically refers to the coding and\nscripting of a website, whether the front-end or back-end. It primarily\ninvolves writing code to handle data, process user inputs, and generate\ndynamic content. A web programmer will rarely, if ever, handle a web\ndevelopment project from end to end. They may build a certain section of a\nsite or troubleshoot bugs.\n\nUnderstanding this difference has been crucial in my career, allowing me to\nappreciate the depth and breadth of skills required in the world of web\ncreation. It's a reminder of the diverse talents and expertise that come\ntogether to make the digital world what it is today.\n\n## Web Development Basics\n\n  1. What is a website?\n  2. What is an IP address?\n  3. What does HTTP mean?\n  4. What is coding?\n  5. What does front-end mean?\n  6. What does back-end mean?\n  7. What is a CMS?\n  8. What is cybersecurity?\n\n### 1\\. What is a website?\n\nWebsites are files stored on servers, which are computers that host (fancy\nterm for “store files for”) websites. These servers are connected to a giant\nnetwork called the Internet.\n\nNow, how do we access these websites? This is where browsers come into play.\nBrowsers are computer programs that load websites via your Internet\nconnection, such as Google Chrome or Internet Explorer, while the computers\nused to access these websites are known as “clients”.\n\n### 2\\. What is an IP address?\n\nI was always fascinated by how the Internet knows where to send data. The\nanswer lies in understanding IP addresses. To access a website, you need to\nknow its Internet Protocol (IP) address. An IP address is a unique string of\nnumbers. Each device has an IP address to distinguish itself from the billions\nof websites and devices connected via the Internet.\n\nThe IP address for HubSpot is 104.16.249.5. You can find any website’s IP\naddress by visiting a site like Site 24x7 or by using Command Prompt on\nWindows or _Network Utility > Traceroute_ on MacBooks.\n\nTo find your device’s IP address, you can also type “what’s my IP address”\ninto your search browser.\n\nWhile you can access a website using its IP address, most Internet users\nprefer to use domain names or by going through search engines.\n\n### 3\\. What does HTTP mean?\n\nHyperText Transfer Protocol (HTTP) is what connects our website request to the\nremote server that houses all website data. It’s a set of rules (a protocol)\nthat defines how messages should be sent over the Internet. It allows us to\njump between site pages and websites.\n\nIf I type a website into my web browser or search for something through a\nsearch engine, HTTP provides a framework so that the client (computer) and\nserver can speak the same language when they make requests and responses to\neach other over the Internet. It’s essentially the translator between you and\nthe Internet — it reads our website request, reads the code sent back from the\nserver, and translates it for us in the form of a website.\n\n### 4\\. What is coding?\n\nCoding refers to writing code for servers and applications using programming\nlanguages. They’re called “languages” because they include vocabulary and\ngrammatical rules for communicating with computers. They also include special\ncommands, abbreviations, and punctuation that can only be read by devices and\nprograms.\n\nAll software is written in at least one coding language, but languages vary\nbased on platform, operating system, and style. All languages fall into one of\ntwo categories: front-end and back-end.\n\n### 5\\. What does front-end mean?\n\nFront-end (or client-side) is the side of a website or software that you see\nand interact with as an Internet user. When website information is transferred\nfrom a server to a browser, front-end coding languages allow the website to\nfunction without having to continually “communicate” with the Internet.\n\nFront-end code allows users to interact with a website and play videos, expand\nor minimize images, highlight text, and more. Web developers who work on\nfront-end coding work on client-side development.\n\n### 6\\. What does back-end mean?\n\nThe back-end (or server-side) is the side that you don’t see when you use the\nInternet. It’s the digital infrastructure, and to non-developers, it looks\nlike a bunch of numbers, letters, and symbols.\n\nThere are more back-end coding languages than front-end languages. That’s\nbecause browsers — at the front-end — only understand HTML, CSS, and\nJavaScript, but a server — at the back-end — can be configured to understand\npretty much any language.\n\n### 7\\. What is a CMS?\n\nA content management system (CMS) is a web application or a series of programs\nused to create and manage web content. (Note: CMS's aren’t the same as site\nbuilders, like Squarespace or Wix.)\n\n_See why thousands of customers use CMS Hub to build an optimized website that\nintegrates with their HubSpot CRM data and full marketing suite._\n\nWhile not required to build a website, using a CMS makes things easier. It\nprovides the building blocks (like plugins and add-ons) and lets you create\nthe structure with your code. CMS's are often used for ecommerce and blogging,\nbut they’re useful for all types of websites.\n\n### 8\\. What is cybersecurity?\n\nThere are always malicious actors looking to find vulnerabilities in websites\nto expose private information, steal data, and crash servers. Cybersecurity is\nthe practice of securing data, networks, and computers from these threats.\n\nThe methods used by hackers are constantly evolving, as are the security\nmeasures taken to defend against them. Failing to understand how your site\ncould be targeted could result in disaster.\n\nAs a result, a basic understanding of cybersecurity best practices is critical\nfor effective web development. You should also carry out security audits on a\nconsistent basis.\n\nWe're committed to your privacy. HubSpot uses the information you provide to\nus to contact you about our relevant content, products, and services. You may\nunsubscribe from these communications at any time. For more information, check\nout our Privacy Policy.\n\n###\n\nFirst Name*\n\nLast Name*\n\nEmail *\n\nPhone Number*\n\nWebsite URL*\n\nCompany Name*\n\nHow many employees work there?*\n\n\\- Please Select -12 to 56 to 1011 to 2526 to 5051 to 200201 to 1,0001,001 to\n10,00010,001 or more\n\n  * Subscribe to HubSpot's marketing blog\n\nMulti-Step Form Email Follow-Up ID\n\nContent Language\n\nGACLIENTID\n\n[DO NOT USE] GAUSERID\n\nGATRACKID\n\nLegal basis for processing contact's data\n\nGDPR Notice (Custom Forms)\n\nRecent Custom Form Module\n\nWe're committed to your privacy. HubSpot uses the information you provide to\nus to contact you about our relevant content, products, and services. You may\nunsubscribe from these communications at any time. For more information, check\nout our _Privacy Policy._\n\n### 50 Free Coding Templates\n\nFree code snippet templates for HTML, CSS, and JavaScript -- Plus access to\nGitHub.\n\n  * Navigation Menus & Breadcrumbs Templates \n  * Button Transition Templates \n  * CSS Effects Templates \n  * And more! \n\nGet Your Free Templates\n\nLoading your download form\n\n### You're all set!\n\nClick this link to access this resource at any time.\n\nAccess now\n\nLearn more\n\n## Types of Web Development\n\n  1. Front-end Development\n  2. Back-end Development\n  3. Full Stack Development\n  4. Website Development\n  5. Desktop Development\n  6. Mobile Development\n  7. Game Development\n  8. Embedded Development\n  9. Security Development\n\nMy journey into web development began in the vibrant world of front-end\ndevelopment, where I loved turning code into visually appealing, interactive\nweb pages.\n\nLater, I dived into back-end development, uncovering the nuts and bolts that\npower a website. Learning Python and Ruby, I gained a deeper appreciation for\nthe seamless integration of front-end and back-end.\n\nWhether you’re looking to hire a web developer or become one, you should\nunderstand the different types of web development that developers can master.\n\nThese different types of web development primarily refer to the different\nsectors of the profession in which web developers can work. Some of these\ndistinctions overlap, and web developers will often master multiple types of\nweb development.\n\n### 1\\. Front-end Development\n\nFront-end developers work on the client- or user-facing side of websites,\nprograms, and software — in other words, what users see. They design and\ndevelop the visual aspects, including the layout, navigation, graphics, and\nother aesthetics.\n\nThe main job of these developers is to build interfaces that help users reach\ntheir goals, which is why they also often have a hand in the user experience\naspect of their projects.\n\n### 2\\. Back-end Development\n\nIf the front-end is what users see, the back-end is what they don’t. Back-end\nweb developers work on the servers of websites, programs, and software to make\nsure everything works properly behind-the-scenes.\n\nThese developers work with systems like servers, operating systems, APIs, and\ndatabases and manage the code for security, content, and site architecture.\nThey collaborate with front-end developers to bring their products to users.\n\n### 3\\. Full Stack Development\n\nFull stack developers work in both the front-end and back-end sides of a\nwebsite. They can create a website, application, or software program from\nstart to finish. “Stack” refers to the different technologies that handle\ndifferent functionalities on the same website, like the server, interface,\netc.\n\nBecause full-stack developers require years in the field to build the\nnecessary experience, this role is often sought after by companies looking to\nbuild or update their websites. This developer's all-around knowledge helps\nthem optimize performance, catch issues before they occur, and help team\nmembers understand different parts of a web service. This comprehensive skill\nset is typically covered in a full stack developer course.\n\n### 4\\. Website Development\n\nWebsite developers can be front-end, back-end, or full-stack developers.\nHowever, these professionals specialize in building websites, as opposed to\nmobile applications, desktop software, or video games.\n\n### 5\\. Desktop Development\n\nDesktop developers specialize in building software applications that run\nlocally on your device, rather than over the Internet in the web browser.\nSometimes the skillset of these developers overlaps with that of web\ndevelopers if an application can run both online and off.\n\n### 6\\. Mobile Development\n\nMobile developers build applications for mobile devices such as smartphones or\ntablets. Mobile apps operate much differently than other websites and software\nprograms, thus requiring a separate set of development skills and knowledge of\nspecialized programming languages.\n\n### 7\\. Game Development\n\nGame developers specialize in writing code for video games, including console\ngames (Xbox, PlayStation, etc.), PC games, and mobile games — which means this\nspecialty overlaps somewhat with mobile development.\n\n### 8\\. Embedded Development\n\nEmbedded developers work with all hardware that isn't a computer (or, at\nleast, what most of us imagine as “computers,” with a keyboard and screen).\nThis includes electronic interfaces, consumer devices, IoT devices, real-time\nsystems, and more.\n\nWith a recent rise in interconnected devices as seen with smart appliances,\nBluetooth technologies, and virtual assistants, embedded development is\nbecoming an in-demand practice.\n\n### 9\\. Security Development\n\nSecurity developers establish methods and procedures for the security of a\nsoftware program or website. These developers typically work as ethical\nhackers, trying to “break” websites to expose vulnerabilities without\nintending harm. They also build systems that discover and eradicate security\nrisks.\n\n## Front-End Web Development Languages\n\nAs I've already discussed, front-end web development focuses on creating the\nvisual and interactive elements of a site. It involves designing and building\nthe user-facing side — what you see, essentially, when you pull up a site in a\nweb browser.\n\nIn my perspective, front-end development is likely the “easiest” way to begin\na career in web development. That said, as with any other aspect of this\nfield, it will have a learning curve.\n\nHere are some of the most popular front-end web development languages:\n\n### HTML (Hypertext Markup Language)\n\nHTML is likely the language you first thought of when it comes to web\ndevelopment, and with good reason:  HTML is the backbone of any web page. It\nprovides both semantic structure and defines the elements of a website, such\nas headings, paragraphs, images, and links. Web developers use HTML to give\ncontent a proper layout before customizing it.\n\nBelow is the HTML code for a basic Bootstrap button.\n\n### CSS (Cascading Style Sheets)\n\nIf HTML is the backbone of a site, then CSS is the meat. CSS is responsible\nfor styling the visual appearance of a website. It allows developers to\ncustomize colors, fonts, layouts, and other design elements. With CSS, you can\nalso create responsive web pages that adapt to different screen sizes.\n\nHere's a code snippet for customizing the jumbotron element in Bootstrap CSS.\n\n####  \n\n### JavaScript\n\nJavaScript is a dynamic programming language that adds interactive elements to\nweb pages, such as dropdown menus, sliders, forms, and animations. JavaScript\nis widely used for client-side scripting (that is, the script runs on the\nclient’s browser, and not on the server that hosts the website). JavaScript\ngenerally enhances the user experience by making websites more dynamic and\nengaging.\n\nBelow is a JavaScript code snippet for automatically opening links in a new\nwindow in WordPress.\n\n### jQuery\n\njQuery is a fast and lightweight JavaScript library designed to simplify HTML\nmanipulation and event handling. It provides a variety of functions and\nmethods to select elements, create animations, and handle AJAX requests.\njQuery is compatible with all modern browsers and simplifies cross-browser\ndevelopment.\n\n### React\n\nReact is a JavaScript library for building user interfaces. It allows\ndevelopers to create reusable UI components and efficiently manage the state\nof an application. React has gained significant adoption and is widely used\nfor developing complex web applications with a responsive and interactive user\ninterface.\n\nThese languages play a crucial role in creating visually appealing, intuitive,\nand interactive websites. Don’t underestimate them: A website may have the\nbest back-end structure, but unless the UI is modern, interactive, and user-\nfriendly, it won’t be as appealing to a visitor.\n\n## Back-End Web Development Languages\n\nWhile front-end developers focus on creating the user-facing elements of a\nwebsite, back-end developers work behind the scenes to ensure everything runs\nsmoothly.\n\nAs opposed to altering the user-facing side, from my experience, back-end\ndevelopment languages help programmers manipulate servers, databases, and\nsoftware that power websites and apps. That makes it a little harder than\nlearning front-end development.\n\nHere are some of the most common back-end web development languages:\n\nWe're committed to your privacy. HubSpot uses the information you provide to\nus to contact you about our relevant content, products, and services. You may\nunsubscribe from these communications at any time. For more information, check\nout our Privacy Policy.\n\n###\n\nFirst Name*\n\nLast Name*\n\nEmail *\n\nPhone Number*\n\nWebsite URL*\n\nCompany Name*\n\nHow many employees work there?*\n\n\\- Please Select -12 to 56 to 1011 to 2526 to 5051 to 200201 to 1,0001,001 to\n10,00010,001 or more\n\n  * Subscribe to HubSpot's marketing blog\n\nMulti-Step Form Email Follow-Up ID\n\nContent Language\n\nGACLIENTID\n\n[DO NOT USE] GAUSERID\n\nGATRACKID\n\nLegal basis for processing contact's data\n\nGDPR Notice (Custom Forms)\n\nRecent Custom Form Module\n\nWe're committed to your privacy. HubSpot uses the information you provide to\nus to contact you about our relevant content, products, and services. You may\nunsubscribe from these communications at any time. For more information, check\nout our _Privacy Policy._\n\n### Free Guide: 25 HTML & CSS Coding Hacks\n\nTangible tips and coding templates from experts to help you code better and\nfaster.\n\n  * Coding to Convention \n  * Being Browser-Friendly \n  * Minimizing Bugs \n  * Optimizing Performance \n\nDownload for free\n\nLoading your download form\n\n### You're all set!\n\nClick this link to access this resource at any time.\n\nAccess now\n\nLearn more\n\n### Python\n\nPython is a versatile and more beginner-friendly programming language known\nfor its readability and simplicity.\n\nIt offers a wide range of frameworks, such as Django and Flask, that simplify\nback-end development tasks like database management and handling HTTP\nrequests. Python's extensive libraries and frameworks make it a popular choice\namong back-end developers.\n\n### PHP\n\nPHP is a widely-used server-side scripting language specifically designed for\nweb development.\n\nPHP seamlessly integrates with HTML and provides powerful features for\nhandling databases, generating dynamic content, and interacting with web\nservers. Popular PHP frameworks like Laravel and Symfony enhance productivity\nand maintainability for complex web applications.\n\n### Ruby\n\nRuby is a dynamic and object-oriented programming language that prioritizes\nsimplicity and readability. It is most commonly associated with the Ruby on\nRails framework, which provides a structure for building robust and scalable\nweb applications.\n\nRuby's elegant syntax and extensive ecosystem make it a preferred choice for\nweb development projects.\n\n### Java\n\nJava is a versatile and widely-used programming language known for its\nplatform independence and scalability.\n\nIt is commonly used for building enterprise-level web applications that\nrequire high performance and security. Java frameworks like Spring and\nHibernate offer tools for building complex back-end systems with ease.\n\n### C#\n\nC# (pronounced C-sharp) is a modern, general-purpose programming language\ndeveloped by Microsoft. It is primarily used for building Windows desktop\napplications and web services.\n\nWith the rise of the .NET framework, C# has gained popularity as a back-end\nlanguage for developing scalable and secure web applications.\n\n### Node.js\n\nNode.js is a JavaScript runtime (that is, the environment where your\nJavaScript code executes) built on Chrome's V8 JavaScript engine. It allows\ndevelopers to run JavaScript code on the server side, opening up opportunities\nfor full-stack JavaScript development. Node.js is highly scalable, efficient,\nand ideal for building real-time applications and APIs.\n\nRemember, back-end developers need to have a solid understanding of databases,\nserver management, and web security, in addition to their language\nproficiency.\n\nThat’s why back-end development is generally a little harder than front-end\ndevelopment, but it’s still plenty learnable nonetheless.\n\n## The Website Development Process\n\nIn my experience as a web developer, I remember tackling projects without a\nclear process in place. It felt like trying to assemble a puzzle without\nhaving the picture on the box. It wasn't until I started working on a complex\necommerce site that the importance of a structured approach really hit home.\nThe project demanded a mix of front-end and back-end development, each with\nits specific languages and frameworks.\n\nBy establishing a clear process, breaking down tasks, and systematically\napproaching each phase, the project became manageable and even enjoyable.\nTrust me, developing a robust process is not just helpful; it's essential.\n\nHere are some key steps I found most helpful in my website development process\njourney.\n\n### 1\\. Form a plan.\n\nBefore laying pen to paper or hands to keyboard, it's vital to first connect\nwith teams and personnel across your organization to develop a plan for your\nwebsite.\n\nHere are some questions to consider before your first site draft:\n\n  * What is the goal of your website?\n  * Who is your audience, and what do you want them to do on your website?\n  * What type of website are you building? (e.g. basic informational, membership, online store)\n  * What content are you aiming to publish, and at what volume?\n  * What’s the purpose of this content?\n  * How will you structure your website for the best navigational experience?\n  * What’s your budget?\n\nAnswering the questions requires interfacing with your web development,\nmarketing, and financial teams to determine your priorities and make informed\ndecisions.\n\nPut simply? It’s much easier to create a roadmap at the beginning of the\nprocess than reverting your progress at a roadblock.\n\n### 2\\. Create a wireframe.\n\nAll good websites start with a blueprint. Developers call this a wireframe. It\ndoesn’t have to be an official document; it’s simply a vision for your site\nthat’ll give both you and your developer(s) direction and a place to start.\nYou can draw it on a whiteboard or use a tool like Invision, Slickplan, or\nMindnode.\n\nWireframes are strictly visual tools that will help you understand where text\nand images will go on individual web pages. You can use blank boxes and “dummy\ntext” to get an idea of how your content will show up on the front-end. If\nyou're working with a company or freelancer, I'd recommend creating a\nwireframe so you have an idea of what your final product will be.\n\nWe're committed to your privacy. HubSpot uses the information you provide to\nus to contact you about our relevant content, products, and services. You may\nunsubscribe from these communications at any time. For more information, check\nout our Privacy Policy.\n\n###\n\n### 50 Free Coding Templates\n\nFree code snippet templates for HTML, CSS, and JavaScript -- Plus access to\nGitHub.\n\n  * Navigation Menus & Breadcrumbs Templates \n  * Button Transition Templates \n  * CSS Effects Templates \n  * And more! \n\nGet Your Free Templates\n\nLoading your download form\n\n### You're all set!\n\nClick this link to access this resource at any time.\n\nAccess now\n\nLearn more\n\n### 3\\. Draft up a sitemap.\n\nNext, it’s time to create a sitemap (not to be confused with sitemap.XML,\nwhich is an XML file that helps search engines crawl and find your site). Just\nlike a business plan gives a potential investor insight into your goals and\ndeliverables, a sitemap gives a developer the information needed to meet your\nvision. You can create your sitemap on your own or work with your\ndeveloper(s).\n\nHere are a few questions to ask yourself when planning your site:\n\n  * What individual pages do you want?\n  * What content will be on those pages?\n  * How can you organize those pages into categories?\n  * What is the hierarchy of pages on your site?\n  * How will the pages link together?\n  * What pages and categories are essential to your site and user experience?\n  * Which pages or categories could be removed or combined?\n\nAgain, it’s a good idea to consult with other teams within your organization.\nIf you have an SEO and/or content strategy team, their input will be critical\nin the linking structure and categorizing of your pages.\n\n### 4\\. Build the back-end of your website.\n\nWriting code might be one of the more complicated parts of web development,\nbut it’s hardly the only component. You also have to build your back-end and\nfront-end site structures and design.\n\nLet’s start with the back-end.\n\nThe back-end handles the data that enables the functionality on the front-end.\nFor example, Facebook's back-end stores my photos, so that the front-end can\nthen allow others to look at them. It’s made up of two key components:\n\n  * **Databases**  are responsible for storing, organizing, and processing data so that it’s retrievable by server requests.\n  * **Servers**  are the hardware and software that make up your computer. Servers are responsible for sending, processing, and receiving data requests. They’re the intermediary between the database and the client/browser. The browser will, in effect, tell the server \"I need this information\", and the server will know how to get that information from the database and send it to the client.\n\nThese components work together to build the foundation for each website.\n\nAs for building your website, backend developers will establish three things.\n\n  * Your **logic code** , which is a set of rules for how your website will respond to certain requests and how objects of your website will interact.\n  * Your **database management**, which is how your website will organize, manage, and retrieve its data.\n  * Your infrastructure, which is how your site will be hosted. Hosting your own site will give you greater control, but it’s much more expensive and requires you to maintain your own server health and security.\n\nWith these components and decisions in place, your website will be ready for\nfront-end development.\n\n**Note** : The back-end is _slightly_ tangential to web development because\nyou don't always need a back-end if you're not storing any data. “Data” in\nthis context means any user-entered information that you need to save and\npersist. Think about logging in to a website. If they don't have a back-end,\nhow could they remember your login information? Or what your profile settings\nare? To get this information, you need a back-end.\n\nFacebook, as an example, needs to know what people are in your Friends list,\nwhat events you have joined, what posts you have created, and more. This is\nall \"data\" that lives in a database. If they didn't have a back-end with a\ndatabase, none of that data would be accessible to them.\n\nOn the other hand, a website that’s purely informational and doesn’t require\nthe users to enter any data wouldn’t need a back-end.\n\nSo, if you have no data, you don’t necessarily require back-end development.\nBut that’s not saying you shouldn’t learn the basics. You never know when you\nmight need it.\n\nWe're committed to your privacy. HubSpot uses the information you provide to\nus to contact you about our relevant content, products, and services. You may\nunsubscribe from these communications at any time. For more information, check\nout our Privacy Policy.\n\n###\n\n### 50 Free Coding Templates\n\nFree code snippet templates for HTML, CSS, and JavaScript -- Plus access to\nGitHub.\n\n  * Navigation Menus & Breadcrumbs Templates \n  * Button Transition Templates \n  * CSS Effects Templates \n  * And more! \n\nGet Your Free Templates\n\nLoading your download form\n\n### You're all set!\n\nClick this link to access this resource at any time.\n\nAccess now\n\nLearn more\n\n### 5\\. Build the front-end of your website.\n\nIf you’ve ever dabbled in web design or toyed with a website in WordPress,\nSquarespace, or Google Sites, you’ve touched front-end web development.\n\nThe front-end stuff is important — it’s what your visitors, customers, and\nusers see and how they’ll use your website.\n\nFront-end (or client-side) development includes a combination of JavaScript,\nHTML, and CSS. It also controls components such as typography and fonts,\nnavigation, positioning, and browser compatibility and responsiveness. This\npart will reflect more of your initial site vision and what you included in\nyour wireframe.\n\nAs technology and consumer preferences change, client-side coding tends to\nbecome outdated much faster than back-end development. This is where coding\nresources (like the ones we’ve included below) come in handy.\n\n### 6\\. (Optional) Work with a CMS.\n\nWhy would someone choose a CMS over coding “by hand” or “from scratch?” It’s\ntrue that a CMS is less flexible and, therefore, gives you less control over\nyour front-end. However, a CMS is easier to use (you have to write less code),\nand it often has tools for hosting the site, storing user information,\ncreating a blog, publishing landing pages, capturing leads, and even building\nan email list. As a result, you’ll be able to make your website more\nprofitable with less than half the work.\n\n_See why thousands of customers use HubSpot's CMS to build an optimized\nwebsite that integrates with their HubSpot CRM data and full marketing stack._\n\nCMS options often include plugins that remove the need to write a back-end.\nFor example, there are WordPress plugins for ecommerce so that, instead of\nbuilding a complicated back-end to charge customers’ credit cards, you can\njust use an existing plugin and avoid the need to deal with databases and\nserver-side code.\n\nPopular content management systems include HubSpot, Joomla, Magento, and\nWordPress — which has over 65% market share. (In this case, we’re talking\nabout open source WordPress software, not the WordPress site builder.)\n\n### 7\\. Acquire a domain name.\n\nAt this point, your website will have an IP address. It also needs a domain\nname, a memorable website name that your visitors can use to find your site.\n\nPerhaps you’ve heard of sites like GoDaddy and Hover. These services help you\npurchase a domain name and register with ICANN (Internet Corporation for\nAssigned Names and Numbers). Most domain registrations are good for a year\nbefore you’re required to renew.\n\nWebsite builders and hosting services, like WordPress and Squarespace, also\nallow you to purchase a domain name.\n\n### 8\\. Launch your site.\n\nOnce you’ve set up a domain name and linked it to your host, you’re almost\nready to unveil your work to the web.\n\nBut not so fast — there are still a handful of things you’ll need to check\nbefore an official launch. These include planning out responsibilities on your\nteam, testing your site thoroughly for any glitches, optimizing for SEO, and a\nfinal check before “flipping the switch” and making your site live.\n\n## Website Development Resources\n\nOne thing I've learned is that continuous learning is key. When I hit a\nroadblock on a tricky coding problem, I discovered the wealth of online\nresources available. Outside of connecting and networking with other\ndevelopers, there are plenty of resources you can tap into to further your\nunderstanding of web development.\n\n### Web Development Courses and Classes\n\nWhether you want to explore back-end, front-end, or full-stack coding, here\nare a few online courses and classes that I recommend along with many HubSpot\ndevelopers.\n\n#### Hubspot Website Blog\n\nThe HubSpot Website Blog stands as a go-to source for both beginners and\nseasoned learners. With a focus on delivering actionable insights and\npractical advice, this blog simplifies the complexities of back-end, front-\nend, and full-stack coding. It's a resource packed with expert tips, course\nrecommendations, and industry trends that resonate with the evolving needs of\nweb developers.\n\n#### **TutorialsPoint**\n\nAll content and resources on TutorialsPoint are free. Between tutorials,\nebooks, and videos, TutorialsPoint provides a host of learn-to-code options.\n\n#### **egghead**\n\nAccording to their website, “egghead is a group of working web development\nprofessionals and open source contributors that provide you with concise,\ninformation-dense video courses on the best tools in the industry.”\n\nUsers can take courses, listen to podcasts, or take lessons on a wide variety\nof web development topics.\n\n#### **Khan Academy**\n\nKhan Academy is a well-known free educational resource. Users can learn\nanything from macroeconomics to linear algebra to US history, as well as a\nhandful of computing topics.\n\n#### SiteSaga\n\nSiteSaga is a free online resource to learn website creation for beginners.\nIt’s the ultimate website saga that covers simple and comprehensive guides on\nbuilding websites, growing them, and establishing a great online presence.\nMainly focused on non-developers and small businesses, it features the easiest\nways to make websites using CMSs like HubSpot and website builders.\n\n#### **freeCodeCamp**\n\nfreeCodeCamp is a non-profit organization (like Khan Academy) that helps\npeople learn to code for free. With thousands of articles, videos, and\ninteractive lessons, as well as worldwide study groups, freeCodeCamp helps\nthousands of developers and engineers learn about programming and land\ndevelopment jobs.\n\n#### **Team Treehouse**\n\nTeam Treehouse is a subscription-based online learning program. Users pay a\nmonthly fee and gain access to hundreds of courses on over 20 different\ntopics. From JavaScript to Python to PHP, Treehouse can teach you all you need\nto know about web development.\n\n### Web Development Communities\n\nWeb developers are masters of the Internet, so it makes sense that they’d hang\nout and connect in Internet-based communities.\n\nAccording to Code Condo, developers join these communities for:\n\n  * Up-to-date information and problem-solving\n  * Insightful answers, new perspectives\n  * Tips and tricks for all-level programmers\n  * Links to resources, talks, and research papers\n  * Meeting new friends, code buddies, and potential partners\n\nHere are a few online communities recommended by our HubSpot developers.\n\n#### **Stack Overflow**\n\nStack Overflow was introduced nearly 15 years ago and has since become one of\nthe most popular programming communities in the world. According to co-founder\nJeff Atwood, “[Stack Overflow] is by programmers, for programmers, with the\nultimate intent of collectively increasing the sum total of good programming\nknowledge in the world.”\n\nStack Overflow is a great place to go with questions because most of the time,\nother developers have asked and answered the same ones. The forums in Stack\nOverflow keep you connected to other developers while also keeping you\ninformed.\n\n#### **Mozilla Development Network**\n\nMozilla Development Network (MDN) is known to be more thorough and accurate\nthan other online resources. It’s not as much a community as a comprehensive\nresource and library of documents for coding languages. MDN is useful when\nlearning how certain functions work and staying up-to-date on coding and\ndevelopment news.\n\n#### **Reddit**\n\nReddit is a forum-based community where developers of all levels gather to ask\nand answer questions. It’s incredibly interactive and includes people from all\nover the world. You can also join “subreddits” based on specific topics such\nas web design, JavaScript, or freelancing.\n\n## Dive Into Web Development\n\nJumping into web development has been a turning point for me. This field isn’t\njust about coding; it’s about reshaping the way we experience the digital\nworld. Honestly, if you’re not diving into web development, you’re missing out\non shaping a huge part of our everyday lives.\n\nHere’s my take: whether you're boosting your business online or building the\nnext big app, understanding web development is key. The field is constantly\nevolving, and staying on top of it is not just necessary; it's exhilarating.\nTrust me, there’s never a dull moment in web development.\n\n_Editor's note: This post was originally published in November 2018 and has\nbeen updated for comprehensiveness._\n\n\n\nTopics: Website Development\n\n## Don't forget to share this post!\n\n## Related Articles\n\nprev next\n\n  * ###  Wildcard SSL Certificates: What They Are & How They Work \n\nJan 05, 2024\n\n  * ###  A Simple Explanation of SSL Certificate Errors & How to Fix Them \n\nJan 05, 2024\n\n  * ###  How Much Does a Website Cost in 2023? Everything You Need to Know \n\nJan 05, 2024\n\n  * ###  How to Get an SSL Certificate [+10 Best Free SSLs] \n\nJan 05, 2024\n\n  * ###  The Ultimate Google Sites Tutorial [20+ Templates & Examples] \n\nJan 03, 2024\n\n  * ###  20 Best WYSIWYG HTML Editors for 2024: Streamlining Web Development \n\nJan 10, 2024\n\n  * ###  Static Versus Dynamic Linking: When to Use Each \n\nJan 05, 2024\n\n  * ###  6 Foolproof Methods for Promoting Your New Website in 2022 \n\nJan 05, 2024\n\n  * ###  25 Things to Consider Before, During, and After Buying a Website, According to HubSpotters Who Did It \n\nJan 05, 2024\n\n  * ###  How to Convert Your Website Into an App [+ 5 Brands That Did It] \n\nJan 05, 2024\n\n  * ###  Wildcard SSL Certificates: What They Are & How They Work \n\nJan 05, 2024\n\n  * ###  A Simple Explanation of SSL Certificate Errors & How to Fix Them \n\nJan 05, 2024\n\n  * ###  How Much Does a Website Cost in 2023? Everything You Need to Know \n\nJan 05, 2024\n\n  * ###  How to Get an SSL Certificate [+10 Best Free SSLs] \n\nJan 05, 2024\n\n  * ###  The Ultimate Google Sites Tutorial [20+ Templates & Examples] \n\nJan 03, 2024\n\n  * ###  20 Best WYSIWYG HTML Editors for 2024: Streamlining Web Development \n\nJan 10, 2024\n\n  * ###  Static Versus Dynamic Linking: When to Use Each \n\nJan 05, 2024\n\n  * ###  6 Foolproof Methods for Promoting Your New Website in 2022 \n\nJan 05, 2024\n\n  * ###  25 Things to Consider Before, During, and After Buying a Website, According to HubSpotters Who Did It \n\nJan 05, 2024\n\n  * ###  How to Convert Your Website Into an App [+ 5 Brands That Did It] \n\nJan 05, 2024\n\n  *   *   *   *   *   *   *   *   *   * \n\n##  Join Thousands of Professionals Thanks for Subscribing!\n\nClose\n\nGet the tools and skills needed to improve your website. Subscribe to the\nWebsite Blog.\n\nEmail address*\n\nSubscribe\n\nWe're committed to your privacy. HubSpot uses the information you provide to\nus to contact you about our relevant content, products, and services. You may\nunsubscribe from these communications at any time. For more information, check\nout our Privacy Policy.\n\nReady to start building your website?  \nGet started with this free guide.\n\nClose\n\nNot using HubSpot yet?\n\nWe're committed to your privacy. HubSpot uses the information you provide to\nus to contact you about our relevant content, products, and services. You may\nunsubscribe from these communications at any time. For more information, check\nout our Privacy Policy.\n\n###\n\nPop up for FREE HTML & CSS CODING TEMPLATES FREE HTML & CSS CODING TEMPLATES\n\nDozens of free coding templates you can start using right now.\n\nDOWNLOAD FOR FREE\n\nBACK\n\n##  Popular Features\n\n  * All Products and Features\n  * Free Meeting Scheduler App\n  * HubSpot AI Tools\n  * Email Tracking Software\n  * AI Content Writer\n  * AI Website Generator\n  * Email Marketing Software\n  * Lead Management Software\n  * AI Email Writer\n  * Free Website Builder\n  * Sales Email Templates\n  * Free Online Form Builder\n  * Free Chatbot Builder\n  * Free Live Chat Software\n  * Marketing Analytics\n  * Free Landing Page Builder\n  * Free Web Hosting\n\n##  Free Tools\n\n  * Website Grader\n  * Make My Persona\n  * Email Signature Generator\n  * Brand Kit Generator\n  * Blog Ideas Generator\n  * Invoice Template Generator\n  * Marketing Plan Generator\n  * Free Business Templates\n  * Guide Creator\n  * Software Comparisons Library\n  * Template Marketplace\n  * Campaign Assistant\n\n##  Company\n\n  * About Us\n  * Careers\n  * Management Team\n  * Board of Directors\n  * Investor Relations\n  * Blog\n  * Contact Us\n\n##  Customers\n\n  * Customer Support\n  * Join a Local User Group\n\n##  Partners\n\n  * All Partner Programs\n  * Solutions Partner Program\n  * App Partner Program\n  * HubSpot for Startups\n  * Affiliate Program\n\n  * Facebook\n  * Instagram\n  * Youtube\n  * Twitter\n  * Linkedin\n  * Medium\n  * Tiktok\n\nCopyright © 2024 HubSpot, Inc.\n\n  * Legal Stuff\n  * Privacy Policy\n  * Security\n  * Website Accessibility\n  * Manage Cookies\n\n",
    "links": "[{\"link\": \"https://blog.hubspot.com/website/website-development?hubs_content=blog.hubspot.com/website/website-development&hubs_content-cta=disabled\", \"text\": \"\\n                日本語\\n              \"}, {\"link\": \"https://blog.hubspot.com/website/website-development?hubs_content=blog.hubspot.com/website/website-development&hubs_content-cta=disabled\", \"text\": \"\\n                Deutsch\\n              \"}, {\"link\": \"https://blog.hubspot.com/website/website-development?hubs_content=blog.hubspot.com/website/website-development&hubs_content-cta=disabled\", \"text\": \"\\n                English\\n              \"}, {\"link\": \"https://blog.hubspot.com/website/website-development?hubs_content=blog.hubspot.com/website/website-development&hubs_content-cta=disabled\", \"text\": \"\\n                Español\\n              \"}, {\"link\": \"https://blog.hubspot.com/website/website-development?hubs_content=blog.hubspot.com/website/website-development&hubs_content-cta=disabled\", \"text\": \"\\n                Português\\n              \"}, {\"link\": \"https://blog.hubspot.com/website/website-development?hubs_content=blog.hubspot.com/website/website-development&hubs_content-cta=disabled\", \"text\": \"\\n                Français\\n              \"}, {\"link\": \"https://blog.hubspot.com/website/website-development?hubs_content=blog.hubspot.com/website/website-development&hubs_content-cta=%0A%20%20%20%20%0A%0A%20%20%20%20%0A%20%20%20%20%20%20%0A%20%20%20%20%20%20%20%20%E6%97%A5%E6%9C%AC%E8%AA%9E%0A%20%20%20%20%20%20%20%20%0A%20%20%20%20%20%20%20%20%0A%20%20%20%20%20%20%0A%0A%20%20%20%20%20%20%0A%20%20%20%20%0A%0A%20%20%20%20%0A%20%20%20%20%20%20%0A%20%20%20%20%20%20%20%20%0A%20%20%20%20%20%20%20%20%20%20%0A%20%20%20%20%20%20%20%20%0A%20%20%20%20%20%20%0A%20%20%20%20%0A%20%20\", \"text\": \"\"}, {\"link\": \"https://blog.hubspot.com/website/website-development?hubs_content=blog.hubspot.com/website/website-development&hubs_content-cta=%0A%20%20%20%20%0A%0A%20%20%20%20%0A%20%20%20%20%20%20%0A%20%20%20%20%20%20%20%20Deutsch%0A%20%20%20%20%20%20%20%20%0A%20%20%20%20%20%20%20%20%0A%20%20%20%20%20%20%0A%0A%20%20%20%20%20%20%0A%20%20%20%20%0A%0A%20%20%20%20%0A%20%20%20%20%20%20%0A%20%20%20%20%20%20%20%20%0A%20%20%20%20%20%20%20%20%20%20%0A%20%20%20%20%20%20%20%20%0A%20%20%20%20%20%20%0A%20%20%20%20%0A%20%20\", \"text\": \"\"}, {\"link\": \"https://blog.hubspot.com/website/website-development?hubs_content=blog.hubspot.com/website/website-development&hubs_content-cta=%0A%20%20%20%20%0A%0A%20%20%20%20%0A%20%20%20%20%20%20%0A%20%20%20%20%20%20%20%20English%0A%20%20%20%20%20%20%20%20%0A%20%20%20%20%20%20%20%20%0A%20%20%20%20%20%20%0A%0A%20%20%20%20%20%20%0A%20%20%20%20%0A%0A%20%20%20%20%0A%20%20%20%20%20%20%0A%20%20%20%20%20%20%20%20%0A%20%20%20%20%20%20%20%20%20%20%0A%20%20%20%20%20%20%20%20%0A%20%20%20%20%20%20%0A%20%20%20%20%0A%20%20\", \"text\": \"\"}, {\"link\": \"https://blog.hubspot.com/website/website-development?hubs_content=blog.hubspot.com/website/website-development&hubs_content-cta=%0A%20%20%20%20%0A%0A%20%20%20%20%0A%20%20%20%20%20%20%0A%20%20%20%20%20%20%20%20Espa%C3%B1ol%0A%20%20%20%20%20%20%20%20%0A%20%20%20%20%20%20%20%20%0A%20%20%20%20%20%20%0A%0A%20%20%20%20%20%20%0A%20%20%20%20%0A%0A%20%20%20%20%0A%20%20%20%20%20%20%0A%20%20%20%20%20%20%20%20%0A%20%20%20%20%20%20%20%20%20%20%0A%20%20%20%20%20%20%20%20%0A%20%20%20%20%20%20%0A%20%20%20%20%0A%20%20\", \"text\": \"\"}, {\"link\": \"https://blog.hubspot.com/website/website-development?hubs_content=blog.hubspot.com/website/website-development&hubs_content-cta=%0A%20%20%20%20%0A%0A%20%20%20%20%0A%20%20%20%20%20%20%0A%20%20%20%20%20%20%20%20Portugu%C3%AAs%0A%20%20%20%20%20%20%20%20%0A%20%20%20%20%20%20%20%20%0A%20%20%20%20%20%20%0A%0A%20%20%20%20%20%20%0A%20%20%20%20%0A%0A%20%20%20%20%0A%20%20%20%20%20%20%0A%20%20%20%20%20%20%20%20%0A%20%20%20%20%20%20%20%20%20%20%0A%20%20%20%20%20%20%20%20%0A%20%20%20%20%20%20%0A%20%20%20%20%0A%20%20\", \"text\": \"\"}, {\"link\": \"https://blog.hubspot.com/website/website-development?hubs_content=blog.hubspot.com/website/website-development&hubs_content-cta=%0A%20%20%20%20%0A%0A%20%20%20%20%0A%20%20%20%20%20%20%0A%20%20%20%20%20%20%20%20Fran%C3%A7ais%0A%20%20%20%20%20%20%20%20%0A%20%20%20%20%20%20%20%20%0A%20%20%20%20%20%20%0A%0A%20%20%20%20%20%20%0A%20%20%20%20%0A%0A%20%20%20%20%0A%20%20%20%20%20%20%0A%20%20%20%20%20%20%20%20%0A%20%20%20%20%20%20%20%20%20%20%0A%20%20%20%20%20%20%20%20%0A%20%20%20%20%20%20%0A%20%20%20%20%0A%20%20\", \"text\": \"\"}, {\"link\": \"https://blog.hubspot.com/website/website-development\", \"text\": \"Website Development\"}, {\"link\": \"https://twitter.com/intent/tweet?text='The%20Beginner's%20Guide%20to%20Website%20Development%20via%20@HubSpot%20@alliecdecker%20'&url=https://blog.hubspot.com/website/website-development\", \"text\": \"\"}, {\"link\": \"https://www.facebook.com/sharer/sharer.php?quote=The%20Beginner's%20Guide%20to%20Website%20Development&u=https://blog.hubspot.com/website/website-development\", \"text\": \"\"}, {\"link\": \"https://www.linkedin.com/sharing/share-offsite/?url=https://blog.hubspot.com/website/website-development\", \"text\": \"\"}, {\"link\": \"https://www.facebook.com/dialog/send?app_id=140586622674265&link=https://blog.hubspot.com/website/website-development&redirect_uri=https://blog.hubspot.com/website/website-development&quote=The%20Beginner's%20Guide%20to%20Website%20Development\", \"text\": \"\"}, {\"link\": \"https://api.whatsapp.com/send?text=The%20Beginner's%20Guide%20to%20Website%20Development%0a%0a$https://blog.hubspot.com/website/website-development\", \"text\": \"\"}, {\"link\": \"mailto:?body=https://blog.hubspot.com/website/website-development&subject=The%20Beginner's%20Guide%20to%20Website%20Development\", \"text\": \"\"}, {\"link\": \"https://blog.hubspot.com/website/website-development?hubs_content=blog.hubspot.com/website/website-development&hubs_content-cta=this%20free%20guide.\", \"text\": \"this free guide.\"}]",
    "priceAndPlans": "Error: Timeout 30000ms exceeded. =========================== logs\n=========================== navigating to\n\"http://web.archive.org/web/20240114092622/https://blog.hubspot.com/\", waiting\nuntil \"load\" ============================================================\n\n"
}