{
    "summary": "  *   * Bootcamps \n\nFull-Time or Part-Time\n\nBootcamps\n\nOur award-winning bootcamps will help you launch a new career in tech in-\nperson or online. You can attend our bootcamps full-time or part-time.\n\nView Testimonials\n\n    * Software Engineering Bootcamp\n\n    * UX Design Bootcamp\n\n    * Data Science Bootcamp\n\n    * Web Development Bootcamp\n\n    * Digital Marketing Bootcamp\n\nWe'll help you land your dream job in tech.\n\nLearn More\n\n  * Courses \n\nPart-Time Certificate\n\nCourses\n\nLearn a new digital skill by taking one of our certificate courses in-person\nor online. Our courses are part-time and can take anywhere from 5 to 10 weeks\nto complete.\n\nView Testimonials\n\n    * Data + AI\n\n      * Data Analytics \n      * Data Science \n      * Artificial Intelligence \n      * Python \n\nDesign\n\n      * UX Design \n      * UI Design \n\nDevelopment\n\n      * Web Development \n    * Marketing\n\n      * Digital Marketing \n      * Social Media Marketing \n      * Search Engine Marketing \n\nProduct\n\n      * Product Management \n      * Design Thinking \n\nCyber\n\n      * Cybersecurity \n    * Leadership\n\n      * Design Leadership \n      * Marketing Leadership \n      * Product Leadership \n\n  * Events\n  * Campuses \n\nCampuses\n\nExplore BrainStation’s global community network, including our on-campus and\nonline bootcamps, certificate courses, and thought leadership events.\n\nView Events\n\n    * Online\n\n      *         * Worldwide \n    * United States\n\n      *         * New York \n        * Miami \n        * Chicago \n        * Seattle \n        * Los Angeles \n        * San Francisco \n        * Dallas \n    * Canada\n\n      *         * Toronto \n        * Vancouver \n\nUnited Kingdom\n\n      *         * London \n\n  * Enterprise \n\nEnterprise\n\nBrainStation helps companies prepare for the future of work through cutting-\nedge digital skills training, top talent recruitment, and more.\n\n    * Enterprise Training\n\nReskill your team to fill digital and technology roles.\n\n    * Hire BrainStation Graduates\n\nTap into our network of skilled graduates, get access to our hiring events,\nand more.\n\n    * Impact Scholarships\n\nBecome a sponsor and contribute to diversity and accessibility in tech.\n\n  * About \n\nAbout\n\nBrainStation is the global leader in digital skills training, empowering\nbusinesses and brands to succeed in the digital age.\n\nContact Us\n\n    * Our Story\n\nLearn about who we are, our vision and how we’re changing the future of work.\n\n    * Testimonials\n\nHear from our students on how BrainStation has helped them build successful\ncareers.\n\n    * Careers\n\nLooking to join our team? View our open positions across the globe.\n\n    * Press and Media\n\nResources and contact information for our media partners.\n\nLooking to become an instructor or guest speaker?\n\nGet Involved\n\n  *   * Get Started \n\n  *   * Main menu\n\n  * Back \n  * \n\n  * Bootcamps\n  * Courses\n  * Events\n  * Campuses\n  * Enterprise\n  * About\n\n© BrainStation Inc. 2015-2024.\n\nBootcamps\n\n  * Software Engineering Bootcamp\n  * UX Design Bootcamp\n  * Data Science Bootcamp\n  * Web Development Bootcamp\n  * Digital Marketing Bootcamp\n\n  * View Testimonials\n  * Get Hired\n\n© BrainStation Inc. 2015-2024.\n\nCourses\n\nData + AI\n\n     Data Analytics\n     Data Science\n     Artificial Intelligence\n     Python\nDesign\n\n     UX Design\n     UI Design\nDevelopment\n\n     Web Development\nMarketing\n\n     Digital Marketing\n     Search Engine Marketing\n     Social Media Marketing\nProduct\n\n     Product Management\n     Design Thinking\nCyber\n\n     Cybersecurity\nLeadership\n\n     Design Leadership\n     Marketing Leadership\n     Product Leadership\n\n  * View Testimonials\n\n© BrainStation Inc. 2015-2024.\n\nCampuses\n\nOnline\n\n     Worldwide\nUnited States\n\n     New York\n     Miami\n     Chicago\n     Seattle\n     Los Angeles\n     San Francisco\n     Dallas\nCanada\n\n     Toronto\n     Vancouver\nUnited Kingdom\n\n     London\n\n© BrainStation Inc. 2015-2024.\n\nEnterprise\n\n  * Enterprise Training\n\nReskill your team to fill digital and technology roles.\n\n  * Hire BrainStation Graduates\n\nTap into our network of skilled graduates, get access to our hiring events,\nand more.\n\n  * Impact Scholarships\n\nBecome a sponsor and contribute to diversity and accessibility in tech.\n\n© BrainStation Inc. 2015-2024.\n\nAbout\n\n  * Our Story\n\nLearn about who we are, our vision and how we’re changing the future of work.\n\n  * Testimonials\n\nHear from our students on how BrainStation has helped them build successful\ncareers.\n\n  * Careers\n\nLooking to join our team? View our open positions across the globe.\n\n  * Press and Media\n\nResources and contact information for our media partners.\n\n  * Contact Us\n  * Get Involved\n\n© BrainStation Inc. 2015-2024.\n\n  1. Career Guides \n  2. Web Developer \n  3. What Is Web Development? \n\nMenu\n\nClose\n\n  * ##  Web Developer \n\n    * The Basics\n\n      * What Is Web Development? \n        * What Exactly is Web Development? \n        * What Are the Most Common Programming Languages? \n        * Web Development vs. Web Design \n        * What Are the Types of Web Development? \n        * What Is Front-End Development? \n        * What Is Back-End Development? \n        * What Is a Full-Stack Developer? \n    * On The Job\n\n      * What Does a Web Developer Do? \n        * What Is a Web Developer? \n        * What Does a Front-End Web Developer Do? \n        * What Does a Back-End Web Developer Do? \n        * A Day in the Life of a Web Developer \n        * What Makes a Good Web Developer? \n      * Web Development Software \n        * 11 Best Web Development Software \n        * Best CMS \n        * Best Web Design Software \n        * Best Front-End Development Software \n        * Best Back-End Development Tools \n  * ##  How to Become a Web Developer \n\n    * Skills\n\n      * Do You Need a Degree to Be a Web Developer? \n        * Web Developer Degree \n        * Is a Web Development Certificate Worth It? \n        * Why a Web Development Certificate Is Worth It \n    * Career Path\n\n      * Is Web Development a Good Career? \n        * Job Outlook for Web Developers \n        * Web Developer Career Path \n        * Why Become a Web Developer? \n        * Jobs in Web Development \n        * Do Web Developers Work From Home? \n      * How Hard Is It to Become a Web Developer? \n        * Is Web Development Hard? \n        * How Long Does it Take to Become a Web Developer \n        * How to Learn to Be a Web Developer \n        * Are Coding Bootcamps Worth It? \n        * What Is a Programming Language? \n        * Types of Programming Languages \n        * Which Programming Language Should I Learn First? \n        * How to Choose a Programming Language \n      * What Companies Hire Web Developers? \n      * How Much Do Web Developers Make? \n        * How Much Do Freelance Web Developers Make? \n    * Getting The Job\n\n      * How to Build a Web Developer Portfolio \n        * How to Build Your Personal Brand as a Web Developer \n      * Web Developer Cover Letter Templates and Examples \n        * Web Development Cover Letters - a Step-by-Step Guide \n        * Getting Started - What Is the Purpose of the Cover Letter? \n        * How to Create an Outline for a Web Developer Cover Letter \n        * What to Include in Your Web Developer Cover Letter? \n        * Web Developer Cover Letter Example \n      * Web Developer Resume Examples \n        * What Are Web Developer Resumes? \n        * Web Developer Resumes – a Step by Step Guide \n        * Getting Started – What Is the Purpose of the Resume? \n        * How to Create an Outline for a Web Developer Resume \n        * What to Include in Your Web Developer Resume \n        * What Skills Should You Add to a Web Developer Resume? \n        * Web Developer Resume Templates \n        * Key Web Developer Resume Takeaways \n      * Web Developer Interview Questions \n        * Web Developer Interview Questions: Web Development \n        * Web Developer Interview Questions: Technical Skills \n        * Web Developer Interview Questions: Personal \n        * Web Developer Interview Questions: Leadership and Communication \n        * Web Developer Interview Questions: Behavioral \n        * Web Developer Interview Questions From Top Companies (Amazon, Google, Facebook, Microsoft) \n\nScroll\n\nWeb Developer (2024 Guide)\n\n# What Is Web Development?\n\nBrainStation’s Web Developer career guide is intended to help you take the\nfirst steps toward a lucrative career in web development. Learn more about\nwhat the web development field covers.\n\n### Become a Web Developer\n\nSpeak to a Learning Advisor to learn more about the Web Development Bootcamp\nand how you can become a Web Developer in just 12 weeks.\n\nBy clicking “Submit”, you accept our Terms.\n\nSubmit\n\nCouldn’t submit! Refresh the page and try again?\n\nLearn more about our Web Development Bootcamp\n\n### Thank you!\n\nWe will be in touch soon.\n\nView Web Development Bootcamp page\n\nWeb development, also known as website development, refers to the tasks\nassociated with creating, building, and maintaining websites and web\napplications that run online on a browser. It may, however, also include web\ndesign, web programming, and database management.\n\nWeb development is closely related to the job of designing the features and\nfunctionality of apps (web design). The term development is usually reserved\nfor the actual construction of these things (that is to say, the programming\nof sites).\n\nThe basic tools involved in web development are programming languages called\nHTML (Hypertext Markup Language), CSS (Cascading Style Sheets), and\nJavaScript. There are, however, a number of other programs used to “manage” or\nfacilitate the construction of sites that would otherwise have to be done\n“from scratch” by writing code. A number of content management systems (CMS)\nfall into this category, including WordPress, Joomla!, Drupal, TYPO3, and\nAdobe Experience Manager, among others.\n\n## What Exactly is Web Development?\n\n  \nWeb development is closely related to the job of designing the features and\nfunctionality of websites and apps (often called “web design”), but the “web\ndevelopment” term is usually reserved for the actual construction and\nprogramming of websites and apps.\n\nThink of all the web pages you have used over the years – Web Developers built\nthose sites, making sure they functioned properly and performed in ways that\nallowed for a great user experience. Web Developers do this by writing lines\nof code, using a variety of programming languages, which vary depending on the\ntasks they are performing and the platforms they are working on.\n\n## Web Development vs. Web Design\n\nThough there is overlap, there are also key differences between web\ndevelopment and web design. Let’s take a closer look:\n\n**Web Designers:**\n\n  * Create everything a user sees on a website or software product, including all visual, color, typography, and usability elements\n  * Work directly with a client to create designs or work as part of a team to develop client vision\n  * May need knowledge of a programming language or some coding skills, or at least some level of familiarity with widely used languages such as HTML, CSS, PHP, and JavaScript\n  * Create wireframes and prototypes to test design ideas, offer input on design logos, branding, company style guides\n\n**Web Developers:**\n\n  * Write the code that makes a website function, whether they work on the front end or back end (server-side)  \n\n  * Create or implement designs demanded by a client or created by a design team\n  * Need expert-level knowledge of a variety of programming languages, including HTML (HyperText Markup Language), CSS, PHP, and JavaScript but also extending to other languages (Ruby, C/C++, Python), frameworks, and libraries\n  * Rarely create mockups, select typography, or pick color palettes\n\n## What Are the Most Common Programming Languages?\n\nThe most common programming languages involved in web development are:\n\n  * HTML (Hypertext Markup Language)\n  * CSS (Cascading Style Sheets)\n  * JavaScript\n\n## Types of Web Development\n\nThere are three main types of web development: front-end development, back-end\ndevelopment, and full-stack development.\n\n## What Is Front-End Development?\n\nFront-end development involves the “client-facing” side of web development.\nThat is to say usually, front-end web development refers to the portion of the\nsite, app, or digital product that users will see and interact with. A Front-\nEnd Developer, therefore, is responsible for the way a digital product looks\nand “feels,” which is why they are often also referred to as Web Designers.\n\nFront-End Web Developers focus on translating website design and visual ideas\ninto code. A front-end Software Developer takes the design ideas created by\nothers on web development teams and programs them into reality, acting as a\nbridge between design and technology.\n\nFront-End Developers will usually need to possess a solid understanding of\nprogramming languages, including HTML, CSS, and JavaScript, as well as\nframeworks like React, Bootstrap, Backbone, AngularJS, and EmberJS.\nResponsibilities of a Front-End Developer would include creating responsive\nwebsites (that look and function well on any device), conducting website\ntesting and fixing any bugs detected along the web development process, and\nensuring site structure follows SEO best practices.\n\n### Front-End Development Jobs\n\nUnlike back-end development, there are a number of job titles that cover\ndifferent skill sets and experience levels within front-end development,\nincluding:\n\n  * Front-End Developer\n  * Front-End Engineer\n  * CSS/HTML Web Developer\n  * Front-End Web Designer (this usually denotes a role that involves more visual and interaction design requirements)\n  * Front-End User Interface Developer (covering interaction design skills)\n\n  * Mobile Front-End Web Developer\n  * Front-End SEO Expert (usually denoting a Developer with experience incorporating SEO strategy)\n  * Front-End Accessibility Expert\n  * Front-End Dev Ops\n  * Front-End QA (involving unit testing, functional testing, user testing, and A/B testing)\n\n## What Is Back-End Development?\n\nIf Front-End Developers are responsible for how a digital product looks, Back-\nEnd Developers are focused on how it works. A Back-End Developer creates the\nbasic framework of a website before maintaining it and ensuring it performs\nthe way it should, including database interactions, user authentication,\nserver, network and hosting configuration, and business logic. Working behind\nthe scenes – or server-side – Back End Developers are concerned with the\nsystems and structures that allow computer applications to perform as desired.\n\nThe primary responsibility of Back-End Developers is to ensure the\nfunctionality of the site, including its responsiveness and speed. To do that,\nBack-End Developers have to know how to build servers with modern frameworks\n(while developing custom APIs and serving static websites and files), and how\nto manage databases and data on a web server.\n\nTypically, Back-End Developers use server-side programming languages,\nincluding PHP, Ruby, and Python, as well as tools including MySQL, Oracle, and\nGit.\n\n## What Is a Full-Stack Developer?\n\nA Full-Stack Developer is someone familiar with both front- and back-end\ndevelopment. Full Stack Developers usually understand a wide variety of\nprogramming languages and because of their versatility, they might be given\nmore of a leadership role on projects than developers who specialize. They are\ngeneralists, adept at wearing both hats, and familiar with every layer of\ndevelopment. Obviously, employers want to hire Full-Stack Developers –\naccording to an Indeed study, they are the fourth-most in-demand job in tech.\n\nIf the title is contentious, it’s in the generalist nature of the position.\nDevelopers who specialize in the front-end or back-end often bristle at the\nnotion that someone could be equally adept at both – the expression “jack-of-\nall-trades, master of none” comes to mind.\n\n“My defensive tendencies are normally put on high alert when I hear that magic\nphrase (‘full-stack’),” wrote Front-End Developer Andy Shora. “Stacks are a\nlot bigger than what they used to be, and being able to claim one has acquired\nrefined skills at every layer of web development is certainly not a small\nclaim. Does this mean you have a broad range of skills or you specialize in\neverything?”\n\nWhile that perception persists, there still is an increasing number of tech\nprofessionals who consider themselves Full-Stack Developers. According to a\nrecent Stack Overflow survey of Developers, 48.2 percent consider themselves\nFull-Stack Developers.\n\nWhat’s unclear is whether Developers are now expected to possess a broader\nskillset, or if Developers are taking it upon themselves to understand\nfunctions at both the front-end and back-end. Either way, it’s becoming\nincreasingly important for aspiring Developers to have a foundation in both.\n\n“For most people hoping to break into web improvement, you should center\naround working up an establishment in both front-end and back-end advancement\nfirst,” recommended Software Engineer and Tech Writer Muhammad Anser. “At that\npoint, you can float towards a claim to fame later on.”\n\nAnd with demand for Developers expected to grow 15 percent by 2026 (for 24,400\nnew jobs), much faster than the U.S. average rate of job growth, there may not\nbe a better time to dive in and learn more about all the layers of Web\nDevelopment.\n\nPrevious\n\nWeb Developer\n\nNext\n\nWhat Does a Web Developer Do?\n\nGET STARTED\n\n## Kickstart Your Web Developer Career\n\nWe offer a wide variety of programs and courses built on adaptive curriculum\nand led by leading industry experts.\n\n  * Work on projects in a collaborative setting\n\n  * Take advantage of our flexible plans and scholarships\n\n  * Get access to VIP events and workshops\n\nSpeak to a Learning Advisor\n\n### RECOMMENDED COURSES FOR WEB DEVELOPER\n\nBootcampWeb Development Bootcamp\n\nThe Web Development bootcamp is an intensive, hands-on learning experience,\ndesigned to introduce the skills and concepts required to build modern web\napplications.\n\nCertificateWeb Development Course\n\nThe part-time Web Development course is designed to provide a crash course in\nweb development, with introductions to HTML, CSS, and the Bootstrap framework.\n\nWe use cookies to improve your experience on our site, and to deliver\npersonalized content. By using BrainStation, you agree to our privacy policy.\n\nI Accept ×\n\nBrainStation is the global leader in coding bootcamps and tech courses. Start\nyour career in tech today.\n\n  *   *   *   * \n\n  *     * Bootcamps \n    * Software Engineering   /  Web Development \n    * User Experience Design \n    * Data Science \n    * Digital Marketing \n    * Career Guides \n    * Become a Software Engineer \n    * Become a Web Developer \n    * Become a UX Designer \n    * Become a Data Scientist \n    * Become a Digital Marketer \n    * Become a Data Analyst \n    * View All \n    * Tutorials \n    * Learn Python \n    * Learn JavaScript \n    * Learn HTML & CSS \n    * Learn SQL \n  *     * Certificate Courses \n    * Web Development \n    * User Experience Design \n    * Data Science \n    * Digital Marketing \n    * Product Management \n    * Cybersecurity \n    * Data Analytics \n    * Python \n    * User Interface Design \n    * Design Thinking \n    * Search Engine Marketing \n    * Social Media Marketing \n    * Artificial Intelligence \n    * Leadership Courses \n    * Product Leadership \n    * Marketing Leadership \n    * Design Leadership \n  *     * About \n    * Our Story \n    * Careers \n    * Get Involved \n    * Magazine \n    * Contact Us \n    * Press and Media \n    * Blog \n    * For Companies \n    * Hire Our Grads \n    * Enterprise Training \n    * Impact Scholarships \n    * Resources \n    * Get Hired \n    * Certification \n    * Scholarships \n    * Testimonials \n\n* * *\n\nAll Content © BrainStation Inc. 2015-2024. \"BRAINSTATION\" and the BrainStation\nLogo are trademarks of BrainStation Inc. All Rights Reserved.\n\nTerms of Service  Accessibility\n\n",
    "links": "[{\"link\": \"https://brainstation.io/\", \"text\": \"\"}, {\"link\": \"https://brainstation.io/reviews-and-testimonials\", \"text\": \"\"}, {\"link\": \"https://brainstation.io/online/software-engineering-bootcamp\", \"text\": \"\"}, {\"link\": \"https://brainstation.io/course/online/remote-user-experience-design-bootcamp\", \"text\": \"\"}, {\"link\": \"https://brainstation.io/course/online/remote-data-science-bootcamp\", \"text\": \"\"}, {\"link\": \"https://brainstation.io/course/online/remote-web-development-bootcamp\", \"text\": \"\"}, {\"link\": \"https://brainstation.io/course/online/remote-digital-marketing-bootcamp\", \"text\": \"\"}, {\"link\": \"https://brainstation.io/get-hired\", \"text\": \"\\nLearn More \"}, {\"link\": \"https://brainstation.io/reviews-and-testimonials\", \"text\": \"\"}, {\"link\": \"https://brainstation.io/course/online/data-analytics\", \"text\": \"\\nData Analytics \"}, {\"link\": \"https://brainstation.io/course/online/data-science\", \"text\": \"\\nData Science \"}, {\"link\": \"https://brainstation.io/course/online/artificial-intelligence\", \"text\": \"\\nArtificial Intelligence \"}, {\"link\": \"https://brainstation.io/course/online/python-programming\", \"text\": \"\\nPython \"}, {\"link\": \"https://brainstation.io/course/online/user-experience-design\", \"text\": \"\\nUX Design \"}, {\"link\": \"https://brainstation.io/course/online/user-interface-design\", \"text\": \"\\nUI Design \"}, {\"link\": \"https://brainstation.io/course/intro-to-web-development\", \"text\": \"\\nWeb Development \"}, {\"link\": \"https://brainstation.io/course/online/digital-marketing\", \"text\": \"\\nDigital Marketing \"}, {\"link\": \"https://brainstation.io/online/social-media-marketing-course\", \"text\": \"\\nSocial Media Marketing \"}, {\"link\": \"https://brainstation.io/course/seo-sem-analytics\", \"text\": \"\\nSearch Engine Marketing \"}, {\"link\": \"https://brainstation.io/course/online/product-management\", \"text\": \"\\nProduct Management \"}, {\"link\": \"https://brainstation.io/course/design-thinking\", \"text\": \"\\nDesign Thinking \"}, {\"link\": \"https://brainstation.io/course/online/cybersecurity\", \"text\": \"\\nCybersecurity \"}, {\"link\": \"https://brainstation.io/course/online/design-leadership\", \"text\": \"\\nDesign Leadership \"}, {\"link\": \"https://brainstation.io/course/online/marketing-leadership\", \"text\": \"\\nMarketing Leadership \"}, {\"link\": \"https://brainstation.io/course/online/product-leadership\", \"text\": \"\\nProduct Leadership \"}, {\"link\": \"https://brainstation.io/events\", \"text\": \"Events\"}, {\"link\": \"https://brainstation.io/events\", \"text\": \"\"}, {\"link\": \"https://brainstation.io/online\", \"text\": \"\\nWorldwide \"}, {\"link\": \"https://brainstation.io/new-york\", \"text\": \"\\nNew York \"}, {\"link\": \"https://brainstation.io/miami\", \"text\": \"\\nMiami \"}, {\"link\": \"https://brainstation.io/chicago\", \"text\": \"\\nChicago \"}, {\"link\": \"https://brainstation.io/seattle\", \"text\": \"\\nSeattle \"}, {\"link\": \"https://brainstation.io/los-angeles\", \"text\": \"\\nLos Angeles \"}, {\"link\": \"https://brainstation.io/san-francisco\", \"text\": \"\\nSan Francisco \"}, {\"link\": \"https://brainstation.io/dallas\", \"text\": \"\\nDallas \"}, {\"link\": \"https://brainstation.io/toronto\", \"text\": \"\\nToronto \"}, {\"link\": \"https://brainstation.io/vancouver\", \"text\": \"\\nVancouver \"}, {\"link\": \"https://brainstation.io/london\", \"text\": \"\\nLondon \"}, {\"link\": \"https://brainstation.io/corporate-training\", \"text\": \"\"}, {\"link\": \"https://brainstation.io/hiring-partners\", \"text\": \"\"}, {\"link\": \"https://brainstation.io/impact\", \"text\": \"\"}, {\"link\": \"https://brainstation.io/contact\", \"text\": \"\"}, {\"link\": \"https://brainstation.io/about\", \"text\": \"\"}, {\"link\": \"https://brainstation.io/reviews-and-testimonials\", \"text\": \"\"}, {\"link\": \"https://brainstation.io/careers\", \"text\": \"\"}, {\"link\": \"https://brainstation.io/press\", \"text\": \"\"}, {\"link\": \"https://brainstation.io/contribute\", \"text\": \"\\nGet Involved \"}, {\"link\": \"https://brainstation.io/book-call\", \"text\": \"\\nGet Started\\n\"}, {\"link\": \"https://brainstation.io/\", \"text\": \"\"}, {\"link\": \"https://brainstation.io/career-guides\", \"text\": \"\\nCareer Guides \"}, {\"link\": \"https://brainstation.io/career-guides/what-is-web-development\", \"text\": \"\\nWhat Is Web Development? \"}, {\"link\": \"https://brainstation.io/terms-of-service\", \"text\": \"Terms\"}, {\"link\": \"https://brainstation.io/terms-and-conditions\", \"text\": \"privacy policy\"}, {\"link\": \"https://brainstation.io/online/software-engineering-bootcamp\", \"text\": \"\\n\\n\\n\\n\\n\\nSoftware Engineering \"}, {\"link\": \"https://brainstation.io/course/online/web-development-immersive\", \"text\": \"\"}, {\"link\": \"https://brainstation.io/course/online/user-experience-immersive\", \"text\": \"\\n\\n\\n\\n\\n\\nUser Experience Design \"}, {\"link\": \"https://brainstation.io/course/online/data-science-bootcamp\", \"text\": \"\\n\\n\\n\\n\\n\\nData Science \"}, {\"link\": \"https://brainstation.io/course/online/digital-marketing-bootcamp\", \"text\": \"\\n\\n\\n\\n\\n\\nDigital Marketing \"}, {\"link\": \"https://brainstation.io/career-guides/how-to-become-a-software-engineer\", \"text\": \"\\n\\n\\n\\n\\n\\nBecome a Software Engineer \"}, {\"link\": \"https://brainstation.io/career-guides/how-to-become-a-web-developer\", \"text\": \"\\n\\n\\n\\n\\n\\nBecome a Web Developer \"}, {\"link\": \"https://brainstation.io/career-guides/how-to-become-a-ux-designer\", \"text\": \"\\n\\n\\n\\n\\n\\nBecome a UX Designer \"}, {\"link\": \"https://brainstation.io/career-guides/how-to-become-a-data-scientist\", \"text\": \"\\n\\n\\n\\n\\n\\nBecome a Data Scientist \"}, {\"link\": \"https://brainstation.io/career-guides/how-to-become-a-digital-marketer\", \"text\": \"\\n\\n\\n\\n\\n\\nBecome a Digital Marketer \"}, {\"link\": \"https://brainstation.io/career-guides/how-to-become-a-data-analyst\", \"text\": \"\\n\\n\\n\\n\\n\\nBecome a Data Analyst \"}, {\"link\": \"https://brainstation.io/career-guides\", \"text\": \"\"}, {\"link\": \"https://brainstation.io/learn/python\", \"text\": \"\\n\\n\\n\\n\\n\\nLearn Python \"}, {\"link\": \"https://brainstation.io/learn/javascript\", \"text\": \"\\n\\n\\n\\n\\n\\nLearn JavaScript \"}, {\"link\": \"https://brainstation.io/learn/html\", \"text\": \"\\n\\n\\n\\n\\n\\nLearn HTML & CSS \"}, {\"link\": \"https://brainstation.io/learn/sql\", \"text\": \"\\n\\n\\n\\n\\n\\nLearn SQL \"}, {\"link\": \"https://brainstation.io/course/online/intro-to-web-development\", \"text\": \"\\n\\n\\n\\n\\n\\nWeb Development \"}, {\"link\": \"https://brainstation.io/course/online/user-experience-design\", \"text\": \"\\n\\n\\n\\n\\n\\nUser Experience Design \"}, {\"link\": \"https://brainstation.io/course/online/data-science\", \"text\": \"\\n\\n\\n\\n\\n\\nData Science \"}, {\"link\": \"https://brainstation.io/course/online/digital-marketing\", \"text\": \"\\n\\n\\n\\n\\n\\nDigital Marketing \"}, {\"link\": \"https://brainstation.io/course/online/product-management\", \"text\": \"\\n\\n\\n\\n\\n\\nProduct Management \"}, {\"link\": \"https://brainstation.io/course/online/cybersecurity\", \"text\": \"\\n\\n\\n\\n\\n\\nCybersecurity \"}, {\"link\": \"https://brainstation.io/course/online/data-analytics\", \"text\": \"\\n\\n\\n\\n\\n\\nData Analytics \"}, {\"link\": \"https://brainstation.io/course/online/python-programming\", \"text\": \"\\n\\n\\n\\n\\n\\nPython \"}, {\"link\": \"https://brainstation.io/course/online/user-interface-design\", \"text\": \"\\n\\n\\n\\n\\n\\nUser Interface Design \"}, {\"link\": \"https://brainstation.io/course/online/design-thinking\", \"text\": \"\\n\\n\\n\\n\\n\\nDesign Thinking \"}, {\"link\": \"https://brainstation.io/course/online/seo-sem-analytics\", \"text\": \"\\n\\n\\n\\n\\n\\nSearch Engine Marketing \"}, {\"link\": \"https://brainstation.io/course/online/social-media-marketing\", \"text\": \"\\n\\n\\n\\n\\n\\nSocial Media Marketing \"}, {\"link\": \"https://brainstation.io/course/online/artificial-intelligence\", \"text\": \"\\n\\n\\n\\n\\n\\nArtificial Intelligence \"}, {\"link\": \"https://brainstation.io/course/online/product-leadership\", \"text\": \"\\n\\n\\n\\n\\n\\nProduct Leadership \"}, {\"link\": \"https://brainstation.io/course/online/marketing-leadership\", \"text\": \"\\n\\n\\n\\n\\n\\nMarketing Leadership \"}, {\"link\": \"https://brainstation.io/course/online/design-leadership\", \"text\": \"\\n\\n\\n\\n\\n\\nDesign Leadership \"}, {\"link\": \"https://brainstation.io/about\", \"text\": \"\\n\\n\\n\\n\\n\\nOur Story \"}, {\"link\": \"https://brainstation.io/careers\", \"text\": \"\\n\\n\\n\\n\\n\\nCareers \"}, {\"link\": \"https://brainstation.io/contribute\", \"text\": \"\\n\\n\\n\\n\\n\\nGet Involved \"}, {\"link\": \"https://brainstation.io/magazine\", \"text\": \"\\n\\n\\n\\n\\n\\nMagazine \"}, {\"link\": \"https://brainstation.io/contact\", \"text\": \"\\n\\n\\n\\n\\n\\nContact Us \"}, {\"link\": \"https://brainstation.io/press\", \"text\": \"\\n\\n\\n\\n\\n\\nPress and Media \"}, {\"link\": \"https://brainstation.io/blog\", \"text\": \"\\n\\n\\n\\n\\n\\nBlog \"}, {\"link\": \"https://brainstation.io/hiring-partners\", \"text\": \"\\n\\n\\n\\n\\n\\nHire Our Grads \"}, {\"link\": \"https://brainstation.io/corporate-training\", \"text\": \"\\n\\n\\n\\n\\n\\nEnterprise Training \"}, {\"link\": \"https://brainstation.io/impact\", \"text\": \"\\n\\n\\n\\n\\n\\nImpact Scholarships \"}, {\"link\": \"https://brainstation.io/get-hired\", \"text\": \"\\n\\n\\n\\n\\n\\nGet Hired \"}, {\"link\": \"https://brainstation.io/certification\", \"text\": \"\\n\\n\\n\\n\\n\\nCertification \"}, {\"link\": \"https://brainstation.io/scholarships\", \"text\": \"\\n\\n\\n\\n\\n\\nScholarships \"}, {\"link\": \"https://brainstation.io/reviews-and-testimonials\", \"text\": \"\\n\\n\\n\\n\\n\\nTestimonials \"}, {\"link\": \"https://brainstation.io/terms-and-conditions\", \"text\": \"\\nTerms of Service \"}, {\"link\": \"https://brainstation.io/accessibility\", \"text\": \"\\nAccessibility \"}]"
}