{
    "summary": "Köln|Düsseldorf|Frankfurt|München|Wien\n\n  * Über KINAST\n    * Unsere Vision\n    * Unser Team\n    * Unsere Standorte\n  * Leistungen\n    * Datenschutz\n      * Externer Datenschutzbeauftragter\n      * Konzerndatenschutzbeauftragter\n      * Datenschutzberatung\n      * Datenschutzmanager/-koordinator\n      * Datentreuhänder\n    * Compliance\n      * Externer Compliancebeauftragter\n      * Compliance Management System\n      * Whistleblowing Hinweisgebersystem\n    * Datensicherheit\n    * Schulungen\n  * Branchen\n  * Ressourcen\n    * Blog – datenschutzticker\n    * Publikationen\n    * Veranstaltungen\n  * Karriere bei KINAST\n  * Kontakt\n\n__\n\n  * Über KINAST\n    * Unsere Vision\n    * Unser Team\n    * Unsere Standorte\n  * Leistungen\n    * Datenschutz\n      * Externer Datenschutzbeauftragter\n      * Konzerndatenschutzbeauftragter\n      * Datenschutzberatung\n      * Datenschutzmanager/-koordinator\n      * Datentreuhänder\n    * Compliance\n      * Externer Compliancebeauftragter\n      * Compliance Management System\n      * Whistleblowing Hinweisgebersystem\n    * Datensicherheit\n    * Schulungen\n  * Branchen\n  * Ressourcen\n    * Blog – datenschutzticker\n    * Publikationen\n    * Veranstaltungen\n  * Karriere bei KINAST\n  * Kontakt\n\nKINAST Rechtsanwälte – Externer Datenschutzbeauftragter\n\n# Externer Datenschutzbeauftragter\n\nDie Komplettlösung: Maßgeschneidert. Businessorientiert. Zukunftsfähig.\n\nJetzt Angebot anfordern\n\n**oder Tel.:0221-222 18 30**\n\n## Als Externer Datenschutzbeauftragter (DSB) bieten wir Unternehmen und\nOrganisationen aller Größen und Branchen individuell maßgeschneiderte Lösungen\nfür einen modernen High Level – Datenschutz\n\n**„Moderner Datenschutz“ heißt für uns: businessorientiert und\nzukunftsfähig!**\n\nDatenschutz, der nicht nur zu Rechtskonformität führt, sondern Ihr Business\nauch besser macht, alle seine Potentiale erschließt und so einen echten\nMehrwert und Vorteile für Ihr Unternehmen mit sich bringt.\n\n**Denn einfach nur die DSGVO umzusetzen, bremst Ihr Business…**\n\nAls Ihr Externer Datenschutzbeauftragter optimieren wir Ihre Prozesse und\nmachen Ihre Organisation effizienter und flüssiger, während wir den\nDatenschutz reibungslos integrieren.\n\nUnd das tun wir **in rechtlich höchster Qualität** , denn nur korrekt\nimplementierte, nachhaltige Lösungen bleiben dauerhaft für Sie nutzbar und\nführen in der immer digitalisierteren Unternehmenswelt zu Zukunftsfähigkeit\nund Wettbewerbsvorteilen.\n\n### Das Wichtigste in Kürze:\n\n**Warum KINAST?**\n\n  * 15 Jahre Erfahrung in der anwaltlichen Datenschutzberatung und als externer Datenschutzbeauftragter\n  * KINAST gehört zu den Top 5 der Wirtschaftskanzleien im Datenschutzrecht (*Studie kanzleimonitor.de)\n  * Deutschland- und weltweiter Service für nationale und internationale Unternehmen, Konzerne und Organisationen\n  * Fünf Büro-Standorte: Köln, Düsseldorf, Frankfurt am Main, München und Wien\n  * Gerne beraten wir Sie z.B. auch in Berlin, Hamburg, Stuttgart, Leipzig und Kassel sowie in weiteren Städten\n\n**Ihre Vorteile:**\n\n  * Als Externe Datenschutzbeauftragte bieten wir Ihnen die komplette Rundum-Lösung\n  * Großes Team an hochqualifizierten und -spezialisierten Rechtsanwälten und Beratern\n  * Umfassende Kenntnisse der Branchenspezifika und technologischen Systeme\n  * Effektive Organisation und Kommunikation – wir bringen Ihr Projekt schnell und flüssig ans Ziel\n  * Transparente und kalkulierbare Kosten durch Pauschalen/Stundenkontingente\n\nJetzt Angebot anfordern\n\nMehr erfahren\n\n### Ihre Vorteile mit uns als Externe Datenschutzbeauftragte\n\n**#wir erledigen alles für Sie**  \nSie müssen sich um nichts mehr kümmern, wir überprüfen Ihren Status Quo,\nführen Ihre Wünsche und Bedürfnisse einer Lösung zu und implementieren alle\nerforderlichen Strukturen und Prozesse.\n\n**#der entscheidende Wissensvorsprung**  \nWir wissen seit Jahren, wie Unternehmen datenschutzrechtlich ticken, was sie\nbrauchen und wie „dennoch“ funktioniert, was unlösbar schien. Geht nicht\ngibt’s nicht!\n\n**#Ihr Projekt in Rekordzeit  \n** Wir sind schnell und effizient, kommunizieren effektiv und sind perfekt\ndurchorganisiert – und passen uns an Ihre vorhandenen Strukturen und\nKommunikationswege an.\n\n**#futureproof**  \nDaten sind das Lebenselixier der heutigen digitalen Wirtschaft. Wir liefern\npraktische Lösungsvorschläge, wie Sie Ihre Daten effektiv, nachhaltig und\nverantwortungsvoll nutzen können, um Ihre Geschäftsziele zu erreichen.\n\n## Wir geben unseren Mandanten das, was sie brauchen – und zwar schnell,\nunkompliziert und businessorientiert\n\n### Wir wissen, was wir tun\n\nDie Stellung des Externen Datenschutzbeauftragten ist **seit 15 Jahren**\nunsere absolute Spezialität und Kernkompetenz. Diese Erfahrung ist oft der\nentscheidende Wissensvorsprung.\n\nWir sind für zahlreiche Mittelständler, Organisationen und internationale\nGroßkonzerne mit komplexen Datenstrukturen in unterschiedlichen Branchen tätig\n– in Deutschland, Europa und weltweit – und gehören seit Jahren zu den\n**führenden Wirtschaftskanzleien für Datenschutzrecht**.\n\n* * *\n\n### Wir kennen Ihre Branche –  \nund auch die Lösung, an die Sie nicht mehr geglaubt haben\n\nDurch unsere **jahrelange Inhouse-Erfahrung** in den verschiedensten Branchen\nund Unternehmensgrößen kennen wir die datenschutzrechtlichen Besonderheiten\nund spezifischen Technologien Ihrer Branche aus dem Effeff.\n\nGroßkonzern, Industrie, Bank, Hochschule, öffentliche Hand, gemeinnützige\nOrganisation, Start-Up? **Wir wissen genau, was sie brauchen** – und kennen\nfür jedes Ihrer Probleme bereits die passende Lösung.\n\nSie kaufen unseren Erfahrungsschatz aus vorangegangenen Projekten in Ihrer\nBranche quasi mit ein. Wir können Ihnen dadurch so gut, schnell und effizient\nhelfen, wie kaum ein anderer. Und das spart Zeit, Aufwand, Nerven – und\nKosten.\n\n* * *\n\n### Wir verstehen Ihr Businesskonzept – und Ihren Risikoappetit\n\nDie Komplexität in großen Unternehmen geht weit über die Erfordernisse der\nDSGVO hinaus. Aus diesem Grund nehmen wir Ihre **Businessperspektive** ein und\nfolgen einem **risk-based-approach**.\n\nWir verstehen Ihre Unternehmensabläufe und Businessprozesse – und folgern erst\ndann die nötigen Maßnahmen.\n\nAls Ihr Externer DSB verstehen wir uns nicht als „Nein-Sager“, sondern als\nProblemlöser. Unser Ziel ist immer ein **Enablement** unserer Mandanten – und\nals erfahrene Anwälte nutzen wir rechtliche und praktische Spielräume, um mit\nkreativen und praktikablen Lösungen das Optimum für Ihr Business\nherauszuholen.\n\nKurz: Ihr Unternehmen soll _nach_ dem Datenschutz besser funktionieren als\nvorher!\n\nWir erarbeiten ein **individuell maßgeschneidertes Datenschutzkonzept** , das\nzu ihrem Bedarf und Risikoappetit passt und ihre wirtschaftlichen Interessen\nim Blick hat – und so ihre Businessziele mit Ihrem Datenschutz-Bedarf in\nEinklang bringt.\n\n* * *\n\n### „Yes we can!“ – unsere Organisation und Umsetzungskompetenz sind\nessentiell\n\nAlle Zertifikate und Berufsjahre nützen nichts, wenn man den „Job“ nicht zu\nEnde bringt.\n\nWir sind sehr gut organisiert und folgen bewährten, über die Jahre optimierten\nAbläufen, die **schnell und sicher zum Ziel** führen.\n\nWir können vorhandene Strukturen schnell erfassen und darin Ordnung schaffen –\nund hinterlassen eine geordnete Datenschutz-Struktur.\n\nAus diesem Grund werden wir nicht selten als **Nachfolge eines vorangegangenen\nDSB** oder für eine **Interimstätigkeit** beauftragt, oder wenn es um den\n**Aufbau einer internen Datenschutzabteilung** geht. Teilweise werden wir auch\nherangezogen und übernehmen, wenn Projekte von Externen\nDatenschutzbeauftragten mangels Organisations- und Umsetzungsfähigkeit nicht\nzu Ende geführt wurden.\n\n* * *\n\n### Wir haben die Man- und Woman-Power – wenn’s drauf ankommt\n\nDurch unser großes Team an Spezialisten können wir auch **umfangreiche\nProjekte** in großen Legal Teams zügig durchführen und z.B. auch in mehreren\nLändern gleichzeitig auditieren.\n\nWir beraten Sie in **allen Ländern und Rechtsordnungen** und agieren in\nunterschiedlichen Projektsprachen.\n\n* * *\n\n### Wir machen Ihnen das Leben leichter\n\nEs gibt sicherlich Datenschutzbeauftragte, die Ihnen viel Arbeit machen.\n\nWir nicht. Im Gegenteil. **Wir nehmen Ihnen Sorgen ab.**\n\nWir erledigen alles für Sie – proaktiv, routiniert und schnell – ohne viel\nZutun Ihrerseits.\n\nDurch unsere Branchenerfahrung benötigen wir nicht viel Zusatzinformation von\nIhnen und können zügig beginnen. Wir **entlasten** Ihre internen Ressourcen,\n**kommunizieren effektiv** über alle Ebenen und stellen zuverlässig und\nschnell die geforderte Accountability her.\n\nDas verstehen wir unter **echtem Outsourcing**.\n\n* * *\n\n### Beste Verfügbarkeit\n\nWir sind stets und überall für sie verfügbar, **sachlich, örtlich und\nzeitlich**.\n\nWir kommunizieren nicht nur mit dem Ansprechpartner, wir reden auch mit der\nGeschäftsführung, gehen zum Betriebsrat oder besichtigen mit dem Hausmeister\nihre Kameras.\n\nWir haben **kurze Responsezeiten**. Und wir betreuen Sie immer in kleinen\nTeams von mindestens 2-3 Beratern, so dass auch bei Abwesenheiten eine\n**durchgehende Betreuung durch einen Ihnen bekannten Berater** sichergestellt\nist.  \n\n* * *\n\n### Behördenerfahrung – wenn es denn doch mal passiert…\n\nWir sind es gewohnt, mit den Behörden zu kommunizieren und können Sie im Fall\nder Fälle daher sehr gut unterstützen und Ihnen bei behördlichen Anfragen und\nÜberprüfungen **beratend und als Vertretung** gegenüber den Behörden und\nGerichten zur Seite stehen.\n\n* * *\n\n### Was unsere Mandanten am meisten schätzen?\n\nUnsere Mandanten wünschen sich **Vertrauen** und eine **klare, sich leicht\nanfühlende Lösung**. ****\n\nUnd das bekommen sie bei uns.\n\n* * *\n\nKontaktieren Sie uns unverbindlich mit Ihren Fragen oder für ein Angebot und\nwir melden uns umgehend bei Ihnen!\n\nZUM KONTAKT\n\n## FAQ – Externer Datenschutzbeauftragter\n\n__\n\n### Hat ein Externer Datenschutzbeauftragter Vorteile?\n\n**Selbstverständlich!**\n\nUnternehmen haben grundsätzlich die freie Wahl, ob sie einen externen\nDienstleister als Datenschutzbeauftragten bestellen oder einen Mitarbeiter des\nUnternehmens als internen Datenschutzbeauftragten designieren.\n\nWas muss ein interner Datenschutzbeauftragter leisten können – und welche\nVorteile hat ein Externer Datenschutzbeauftragter?\n\n**1\\. Experten-Know-How – Mehr als Kenntnis der Gesetzeslage**\n\nEin Unternehmen, das sich für die Bestellung eines Externen\nDatenschutzbeauftragten entscheidet, erhält ein auf hochspezialisiertes\nExperten-Knowhow gestütztes professionelles Datenschutzmanagement.\n\nEin interner Datenschutzbeauftragter muss sich das erforderliche Fachwissen\nerst aneignen und auch fortlaufend auffrischen. Zudem fehlt es ihm an der\npraktischen Erfahrung, die geforderte Accountability (Rechenschaftspflicht,\nDokumentationspflicht und aktive Vorweisbarkeit) schnell und effektiv (oder\nüberhaupt) herbeizuführen. Und selbst wenn er alle für die\nDatenschutzkonformität erforderlichen Regelungen kennt und umzusetzen weiß,\nwird das in der Regel eine eher steife, hinderliche Konstruktion.\n\nEr spielt die Klaviatur des Datenschutzrechts aber natürlich nicht wie ein\nProfi, der aufgrund seines Wissens und praktische Branchenerfahrung beliebige\nkreative Lösungen und fürs Business förderliche Ergebnisse herbeiführen kann.  \nIn der heutigen Zeit ist Datenschutz kein notwendiges Übel, das man einfach\nirgendwie abhakt, sondern eine formbare Masse, die mit der richtigen Strategie\nund Know-How umgesetzt, das jeweilige Unternehmen optimal umschließt und\nauskleidet, die Geschäftsziele fördert und zukunftsfähig macht.\n\n**2\\. Synergieeffekte durch Branchenerfahrung**\n\nDurch unsere jahrelangen Inhouse-Erfahrungen in nahezu allen Branchen wissen\nwir im Grunde schon, was Sie brauchen, bevor wir überhaupt mit Ihnen\ngesprochen haben.  \nWir sind dadurch schneller, effizienter (und günstiger) – und kennen die\nLösung selbst für Ihre größten Herausforderungen.  \nDieses Wissen kaufen Sie mit ein – d.h. Ihr Unternehmen profitiert von den\nSynergieeffekten aus Erfahrungen des Externen Datenschutzbeauftragten mit\nanderen Unternehmen. Diese erstrecken sich auf branchenspezifische\nAnforderungen, technische Systeme und IT-Anwendungen, sowie den Umgang mit den\nAufsichtsbehörden.\n\n**3\\. Sicherheit**\n\nDie daraus resultierende Erhöhung des Datenschutzniveaus bietet größeren\nSchutz vor behördlichen Anordnungen und Bußgeldern.  \nDer Sicherheitsaspekt ist insbesondere im Rahmen anstehender\nZertifizierungsvorhaben in punkto „Nachhaltigkeit“ von Bedeutung. Wird ein\nneues System nicht datenschutzkonform eingeführt und erfolgt daraufhin eine\nbehördliche Untersagungsverfügung, kann dies schwerwiegende Folgen für das\nbetroffene Unternehmen haben, wenn es das neue System nicht mehr nutzen darf\nund das alte bereits abgeschaltet ist.\n\n**4\\. Kostenvorteile und Ressourcenschutz**\n\nNeben der fachlichen Expertise sprechen auch Kostenvorteile für die\nAuslagerung des Datenschutzes. Kosten, die einerseits für die (partielle)\nFreistellung des Mitarbeiters, der die Rolle des internen\nDatenschutzbeauftragten übernimmt, und andererseits für dessen gesetzliches\nAus- und Weiterbildungserfordernis (Art. 39 DSGVO) anfallen würden, werden\neingespart.  \nDie Belegschaft kann sich auf ihr Kerngeschäft konzentrieren, so dass mit der\nAuslagerung des Datenschutzes ein interner Ressourcenschutz einhergeht.\n\n**5\\. Neutralität / Vermeidung von Interessenskonflikten**\n\nDurch Bestellung eines Externen DSB werden Interessenskonflikte innerhalb des\nUnternehmens von vornherein vermieden. Diese können beispielsweise entstehen,\nwenn die IT-Leitung oder die Geschäftsführung unzulässigerweise als\nDatenschutzbeauftragte bestellt wird. Es muss eine neutrale, sich lediglich am\ngeltenden Recht orientierende Datenschutzberatung sichergestellt werden. Diese\nkann ggf. mit einer offensiven Darstellung der Datenschutzpolitik innerhalb\nund außerhalb des Unternehmens verbunden sein.\n\nEin weiterer Nachteil ist eine gewisse „Betriebsblindheit“, die bei internen\nMitarbeitern als Datenschutzbeauftragte oft beeinträchtigend hinzukommt.\nWeiterhin erfährt ein externer Experte höhere Akzeptanz bei der Belegschaft,\nals ein interner Kollege.\n\n**6\\. Minimiertes Haftungsrisiko**\n\nEine professionelle datenschutzrechtliche Beratung ist aufgrund gestiegener\nBußgelder, der Verpflichtung zur Selbstanzeige (vgl. Art. 33 DSGVO) und\nteilweise gravierender Reputationsschäden mehr denn je unbestreitbares Ziel\neines jeden Unternehmens.  \nMit der Bestellung eines Externen Datenschutzbeauftragten ist zudem die\nÜbernahme der Haftung für die Rechtskonformität interner Prozesse verbunden.\n\n**7\\. Ressourcen-Flexibilität / Kündbarkeit**\n\nWährend ein interner Datenschutzbeauftragter aufgrund seiner Sonderstellung\nunkündbar ist (selbst nach einer eventuellen Freistellung), bleibt das\nUnternehmen wegen des Fehlens eines besonderen Kündigungsschutzes beim\nExternen Datenschutzbeauftragten flexibel und kann sich regelmäßig\nunproblematisch von der vertraglichen Bindung lösen.\n\n__\n\n### Entscheidung: Interner oder Externer Datenschutz?\n\nWer die obige Zusammenstellung aufmerksam gelesen hat, muss feststellen, dass\ndiese Entscheidung nur individuell für das jeweilige Unternehmen getroffen\nwerden kann.\n\nGerne beraten wir Sie in dieser Hinsicht mit der gebotenen Neutralität. Denn\nin unserer täglichen Praxis beraten wir sowohl die internen\nDatenschutzabteilungen großer Konzerne als auch Unternehmen jeder Größe in der\nPosition des Externen Datenschutzbeauftragten.  \nWir kennen also beide Seiten aus jahrelanger Erfahrung und können Sie neutral\nund zielführend bei dieser durchaus wichtigen Entscheidung unterstützen.\n\n__\n\n### Was sind die Aufgaben eines Externen Datenschutzbeauftragten im\nUnternehmen?\n\nEin Externer Datenschutzbeauftragter ist ein externer Dienstleister, der für\ndas Unternehmen bzw. die Organisation die Stellung und Aufgaben des\nDatenschutzbeauftragten (DSB) nach der DSGVO übernimmt.\n\nEr ist dafür verantwortlich, die Datenschutzkonformität des jeweiligen\nUnternehmens mit all seinen Arbeitsabläufen, Prozessen und technischen\nSystemen herzustellen und fortlaufend zu überwachen.\n\nDer Externe Datenschutzbeauftragte hat in jedem Fall sicherzustellen, dass das\ngesetzlich geforderte Mindestmaß an Datenschutz erfüllt und die sogenannte\n„Accountability“ (Rechenschaftspflicht) des Unternehmens hergestellt wird.\nDarüber hinaus kann er vereinbarungsgemäß nach Bedarf auch zusätzliche\nAufgaben übernehmen und das Unternehmen so weiter entlasten.\n\nDie Aufgaben des Externen DSB in einzelnen:\n\n  * Beratung zu allen datenschutzrechtlichen Fragen Ihres Tagesgeschäfts und fungieren als direkter Ansprechpartner für die Entscheidungsträger Ihrer Organisation.\n  * Überwachung der Einhaltung der DSGVO und der relevanten weiteren Datenschutzgesetze und stellen eine datenschutzkonforme Verarbeitung sicher.\n  * Unterstützung bei der Einführung eines effektiven Datenschutzmanagements und Beratung, wie Verantwortlichkeiten und Zuständigkeiten am sinnvollsten zugewiesen werden.\n  * Unterstützung bei der Erfüllung der Rechenschaftspflicht (Accountability), wonach eine rechtskonforme Datenverarbeitung aktiv dargelegt werden muss.\n  * Sensibilisierung und Schulung Ihrer Mitarbeiter im Umgang mit personenbezogenen Daten und Herstellung der Praxisbezüge zu Ihrer Organisation.\n  * Erarbeitung bzw. Überprüfung der erforderlichen Dokumentation wie \n  * Datenschutzfolgeabschätzungen (DSFA)\n  * Technisch Organisatorische Maßnahmen (TOM)\n  * Verzeichnisse von Verarbeitungstätigkeiten (VVT)\n  * Lösch- und Archivierungskonzepte\n  * Anlaufstelle für betroffene Personen und Aufsichtsbehörden bei datenschutzrechtlichen Fragen.\n  * Prüfung von Vorfällen (Datenpannen) auf Meldepflichtigkeit.\n  * Betreuung auf langfristiger und stets vertrauensvoller Basis.\n\n__\n\n### Was macht einen guten Datenschutzbeauftragten aus?\n\nDie Benennung als Externer Datenschutzbeauftragter ist eine\nverantwortungsvolle Aufgabe, die nur an einen erfahrenen und verlässlichen\nDienstleister übertragen werden sollte.  \nAllein wegen der erheblichen Bußgeld- und Schadensersatzrisiken ist es\nessenziell, dass der Externe Datenschutzbeauftragte die erforderliche\nZuverlässigkeit und Qualifikation aufweist.  \nDoch woran erkennen Sie einen qualifizierten Externen DSB und worauf sollten\nSie bei der Auswahl achten?\n\n**Praktische und rechtliche Anforderungen:**  \nDie rechtlichen Voraussetzungen dürften heutzutage wohl von jedem Anbieter im\nMarkt der Externen Datenschutzbeauftragten erfüllt werden. Für die Qualität\nund das Ergebnis sind die praktischen Fähigkeiten daher viel entscheidender.\n\nDenn abgesehen von „äußeren Qualifikatoren“ wie Reputation, Fachwissen,\nZertifizierung etc., sind die nicht auf den ersten Blick erkennbaren\n„fachlichen Softskills“, wie eine effektive Organisation, Kommunikation und\nUmsetzungskompetenz, absolut essentielle Qualitätsmerkmale, um die von der\nDSGVO geforderte Accountability (Rechenschafts- und Nachweispflicht) schnell\nund zielsicher herzustellen.\n\nDenn nur ein Externer Datenschutzbeauftragter, der seine Pflichten und\nAufgaben anforderungsgemäß und gewissenhaft wahrnimmt und die Accountability\nin der Organisation erfolgreich herstellt, erfüllt die rechtliche\nVerpflichtung. Mit anderen Worten: es genügt für das Unternehmen nicht, einen\nExternen Datenschutzbeauftragten bestellt zu haben, wenn dieser nicht den\ngesetzlich geforderten Zustand der Accountability herstellt. Immer wieder\nkommt es vor, dass Projekte stark verzögert oder nicht zu Ende geführt werden\n– und wir werden dann hinzugezogen, um die Fäden vom vorherigen Externen\nDatenschutzbeauftragten aufzunehmen und die erforderlichen Aufgaben dann\nwirklich zuverlässig zu Ende zu bringen.\n\nWenn Sie uns fragen, geht es aber noch über die Herstellung von\nRechtskonformität hinaus. Sie möchten einen Datenschutzbeauftragten mit viel\nHands-On-Erfahrung in Ihrer Branche, der Ihnen nicht nur Zeit und Nerven\nspart, weil er Ihre Abläufe und Systeme bereits in- und auswendig kennt,\nsondern auch Ihre Prozesse optimiert, brachliegende Potentiale erschließt und\nkreative, businessnahe Lösungen für Sie findet, um möglich zu machen, wo\nbisher alle sagten „das geht nicht“. Das macht den Unterschied zwischen einem\nguten und einem sehr guten Externen Datenschutzbeauftragten aus. Und das ist\nunser Anspruch!\n\n__\n\n### Wie gehen wir vor? Unser 3-Punkte-Plan für Datenschutz\n\nUnser Konzept für eine stringente Tätigkeit als Ihr Externer\nDatenschutzbeauftragter baut auf unserem Drei-Punkte-Plan für Datenschutz auf:\n\n**Schwachstellenanalyse und Datenschutzbericht**  \nIn einem ersten Schritt führen wir ein Risk Assessment in Ihrem Unternehmen\nvor Ort durch. Basierend hierauf erstellen wir einen individuellen Bericht, um\nso den Grad der Erfüllung datenschutzrechtlicher Anforderungen aufzuzeigen.\nDarüber hinaus evaluieren wir etwaige Defizite, schlagen Maßnahmen vor und\ndefinieren Verantwortlichkeiten. Abschließend schlagen wir einen Zeitplan zur\nUmsetzung der Maßnahmen vor.\n\n**Betreuung bei Umsetzung des Datenschutzberichts**  \nIm Anschluss setzen wir etwaige im Rahmen des Risk Assessments identifizierte\nMaßnahmen um. Hierbei legen wir größten Wert darauf, Ihre internen Ressourcen\nmöglichst wenig zu binden.\n\n**Dauerhafte Betreuung als Externer Datenschutzbeauftragter**  \nSchließlich betreuen wir Ihr Haus dauerhaft als Externer\nDatenschutzbeauftragter in allen datenschutzrechtlichen Fragen. Damit\ngewährleisten wir die fortwährende Einhaltung der gesetzlichen Standards, die\nAnpassung der Verfahren an die Anforderungen neuer Gesetze und die\nBerücksichtigung aktueller Veränderungen von internen Prozessen.\n\n__\n\n### Was darf ein Externer Datenschutzbeauftragter kosten?\n\nEine wichtige und berechtigte Frage, werden doch von einigen Kollegen bereits\nStandardpakete angeboten.\n\nWir halten nichts von vorgefertigten Paketen. Denn jedes Unternehmen, jede\nBranche, jede Organisation ist unterschiedlich. Und wir wollen, dass Sie genau\ndas von uns bekommen, was Sie benötigen, um Ihre Ziele zu erreichen.\n\nDeswegen erarbeiten wir ein faires, transparentes Angebot individuell in den\nVorgesprächen. Aufgrund unserer effizienten, Zeit und Aufwand sparenden\nOrganisation können wir aber – selbst als Anwälte mit einer sehr hochstehenden\nLeistung – eine sehr wettbewerbsfähige Preisgestaltung im mittleren\nMarktniveau bieten. Durch fixe Pauschalen oder Stundenkontingente, die nach\nIhrem individuellen Bedarf abgestimmt werden, ist die Preiskalkulation für Sie\nstets transparent.\n\n__\n\n### Brauche ich einen Datenschutzbeauftragten? Wann ist ein\nDatenschutzbeauftragter Pflicht?\n\nDie Pflicht zur Bestellung besteht, sofern ein Unternehmen einer Tätigkeit des\nArt. 37 Abs. 1 DSGVO nachgeht. Diese Tätigkeiten bedürfen aus\ndatenschutzrechtlicher Sicht einer besonderen Kontrolle.\n\nUnter welchen Bedingungen eine solche datenschutzrechtlich besondere Kontrolle\nnötig ist, regelt Art. 37 Abs. 1 lit. a)-c) der DSGVO.\n\nEine Pflicht zur Bestellung besteht,\n\n  * wenn die Verarbeitung von einer Behörde oder öffentlichen Stelle durchgeführt wird,\n  * wenn die Kerntätigkeit des Verantwortlichen oder des Auftragsverarbeiters in der Durchführung von Verarbeitungsvorgängen besteht, welche aufgrund ihrer Art, ihres Umfangs und/oder ihrer Zwecke eine umfangreiche, regelmäßige und systematische Überwachung von betroffenen Personen erforderlich machen, oder\n  * wenn die Kerntätigkeit des Verantwortlichen oder Auftragsverarbeiters in der umfangreichen Verarbeitung besonderer Kategorien von Daten gemäß Art. 9 oder von personenbezogenen Daten über strafrechtliche Verurteilungen und Straftaten gemäß Art. 10 besteht.\n\nNach § 38 BDSG-Neu ist ein Datenschutzbeauftragter zu benennen, wenn:\n\n  * in der Regel mindestens 10 Personen ständig mit der automatisierten Verarbeitung personenbezogener Daten beschäftigt sind\n  * bei automatisierter Verarbeitung (es ist nicht erforderlich, dass die Erhebung, Verarbeitung oder Nutzung personenbezogener Daten Kernbereich der beschäftigten Person ist)\n\nEine Benennungspflicht bei unter 10 Personen besteht zudem, wenn:\n\n  * der Verantwortliche oder der Auftragsverarbeiter einer Datenschutzfolgenabschätzung nach Art. 35 DSGVO unterliegt\n  * personenbezogene Daten zum Zweck der Übermittlung, der anonymisierten Übermittlung oder für Zwecke der Markt- und Meinungsforschung verarbeitet werden\n\n### Kontaktieren Sie uns unverbindlich mit Ihren Fragen und Beratungswünschen\noder für ein Angebot – wir melden uns umgehend bei Ihnen!\n\n\n\nJetzt Kontakt aufnehmen\n\n### Kontaktieren Sie uns unverbindlich mit Ihren Fragen und Beratungswünschen\noder für ein Angebot – wir melden uns umgehend bei Ihnen!\n\n\n\nJetzt Kontakt aufnehmen\n\n__Kontakt\n\n__Anruf\n\n__News\n\n__\n\n### Stay up to date\n\nUm immer up to date zu bleiben, tragen Sie sich rechts für unseren\nwöchentlichen Newsletter ein und verfolgen unseren Datenschutzticker auf\ndatenschutzticker.de\n\n### Datenschutz-Ticker\n\n  * Angemessenheitsbeschlüsse mit elf Ländern bestätigt\n\nVeröffentlicht am 23.01.2024\n\n  * DSA: Umsetzungsfrist endet nächsten Monat\n\nVeröffentlicht am 19.01.2024\n\n  * Der Data Act ist in Kraft getreten\n\nVeröffentlicht am 15.01.2024\n\nOlder posts\n\nMehr auf datenschutzticker.de\n\nBitte dieses Feld leer lassen\n\nUm unseren wöchentlichen Newsletter zu abonnieren, tragen Sie bitte Ihre\nE-Mail-Adresse ein.\n\nE-Mail-Adresse *\n\nMit dem Absenden des ausgefüllten Formularfelds durch Anklicken des\n\"Anmelden\"-Buttons sowie der anschließenden Bestätigung Ihrer E-Mail-Adresse\nüber den zugesandten Link erklären Sie sich mit dem Bezug unseres Newsletter\neinverstanden.\n\nWir verwenden Ihre E-Mail-Adresse gemäß unserer Datenschutzerklärung\nausschließlich für den zweckgebundenen Versand unseres Newsletters. Sie können\ndiesen jederzeit wieder abbestellen, indem Sie den entsprechenden Link am Ende\ndes Newsletters anklicken.\n\nPrüfen Sie Ihren Posteingang oder Spam-Ordner, um das Abonnement zu\nbestätigen.\n\n____\n\nKinast\n\n  * Wir sind KINAST!\n  * Standorte\n  * Karriere bei KINAST\n  * Blog – datenschutzticker\n  * Datenschutzticker\n\nUnsere Lösungen\n\n  * Branchen\n  * Externer Datenschutzbeauftragter\n  * Konzerndatenschutzbeauftragter\n  * Externer Compliancebeauftragter\n  * Datenschutzberatung\n  * Datenschutzrechtliche Schulungen\n  * Whistleblowing Hinweisgebersystem\n  * Angebotsanfrage\n\nInformationen\n\n  * Kontakt\n  * Impressum\n  * Datenschutzerklärung\n\n© 2024 | KINAST Rechtsanwälte - Externe Datenschutzbeauftragte – Externe\nCompliancebeauftragte\n\n",
    "links": "[{\"link\": \"https://www.kinast.eu/externer-datenschutzbeauftragter/\", \"text\": \"Externer Datenschutzbeauftragter\"}, {\"link\": \"https://www.kinast.eu/externer-datenschutzbeauftragter/\", \"text\": \"Externer Datenschutzbeauftragter\"}, {\"link\": \"https://www.kinast.eu/externer-datenschutzbeauftragter/koeln/\", \"text\": \",\"}, {\"link\": \"https://www.kinast.eu/externer-datenschutzbeauftragter/\", \"text\": \"Externer Datenschutzbeauftragter\"}]",
    "priceAndPlans": "Köln|Düsseldorf|Frankfurt|München|Wien\n\n  * Über KINAST\n    * Unsere Vision\n    * Unser Team\n    * Unsere Standorte\n  * Leistungen\n    * Datenschutz\n      * Externer Datenschutzbeauftragter\n      * Konzerndatenschutzbeauftragter\n      * Datenschutzberatung\n      * Datenschutzmanager/-koordinator\n      * Datentreuhänder\n    * Compliance\n      * Externer Compliancebeauftragter\n      * Compliance Management System\n      * Whistleblowing Hinweisgebersystem\n    * Datensicherheit\n    * Schulungen\n  * Branchen\n  * Ressourcen\n    * Blog – datenschutzticker\n    * Publikationen\n    * Veranstaltungen\n  * Karriere bei KINAST\n  * Kontakt\n\n__\n\n  * Über KINAST\n    * Unsere Vision\n    * Unser Team\n    * Unsere Standorte\n  * Leistungen\n    * Datenschutz\n      * Externer Datenschutzbeauftragter\n      * Konzerndatenschutzbeauftragter\n      * Datenschutzberatung\n      * Datenschutzmanager/-koordinator\n      * Datentreuhänder\n    * Compliance\n      * Externer Compliancebeauftragter\n      * Compliance Management System\n      * Whistleblowing Hinweisgebersystem\n    * Datensicherheit\n    * Schulungen\n  * Branchen\n  * Ressourcen\n    * Blog – datenschutzticker\n    * Publikationen\n    * Veranstaltungen\n  * Karriere bei KINAST\n  * Kontakt\n\nKINAST Rechtsanwälte – Externer Datenschutzbeauftragter in Hamburg\n\n# Externer Datenschutzbeauftragter in Hamburg\n\nDas Team der KINAST Rechtsanwälte betreut Sie gerne als Externer\nDatenschutzbeauftragter (DSB) im Sinne der DSGVO und des BDSG in Hamburg,\nbundes- und weltweit dauerhaft. Wir beraten Sie zuverlässig bei der Erfüllung\ngesetzlicher Verpflichtungen. Durch die Berechnung von Pauschalen können wir\nIhnen transparente und kalkulierbare Kosten anbieten. Des Weiteren werden wir\ngerne für Sie als externe Datenschutzbeauftragte z.B. auch in Bremen,\nHannover, Kiel, Lübeck oder Rostock tätig. Sprechen Sie uns gerne an.\n\n## Angebotsanfrage Externer Datenschutzbeauftragter in Hamburg\n\nWünschen Sie ein passgenaues Angebot für Ihre Organisation oder benötigen\nweitere Informationen rufen Sie uns gerne an, unseren Hauptsitz in Köln\nerreichen Sie unter **(0221) 222 183‑0** ; oder schreiben Sie uns eine E-Mail\nan mandanten@kinast.eu. Alternativ können Sie auch gerne unser Kontaktformular\nfür eine Angebotsanfrage nutzen. Ihre Angaben werden von uns ausschließlich\nzur Erfüllung Ihres Kontaktwunsches bzw. Erarbeitung unseres Angebots für Sie\nbzw. Ihr Unternehmen verarbeitet.\n\n### Kontaktieren Sie uns unverbindlich mit Ihren Fragen und Beratungswünschen\noder für ein Angebot – wir melden uns umgehend bei Ihnen!\n\n\n\nJetzt Kontakt aufnehmen\n\n### Kontaktieren Sie uns unverbindlich mit Ihren Fragen und Beratungswünschen\noder für ein Angebot – wir melden uns umgehend bei Ihnen!\n\n\n\nJetzt Kontakt aufnehmen\n\n__Kontakt\n\n__Anruf\n\n__News\n\n__\n\n### Stay up to date\n\nUm immer up to date zu bleiben, tragen Sie sich rechts für unseren\nwöchentlichen Newsletter ein und verfolgen unseren Datenschutzticker auf\ndatenschutzticker.de\n\n### Datenschutz-Ticker\n\n  * Angemessenheitsbeschlüsse mit elf Ländern bestätigt\n\nVeröffentlicht am 23.01.2024\n\n  * DSA: Umsetzungsfrist endet nächsten Monat\n\nVeröffentlicht am 19.01.2024\n\n  * Der Data Act ist in Kraft getreten\n\nVeröffentlicht am 15.01.2024\n\nOlder posts\n\nMehr auf datenschutzticker.de\n\nBitte dieses Feld leer lassen\n\nUm unseren wöchentlichen Newsletter zu abonnieren, tragen Sie bitte Ihre\nE-Mail-Adresse ein.\n\nE-Mail-Adresse *\n\nMit dem Absenden des ausgefüllten Formularfelds durch Anklicken des\n\"Anmelden\"-Buttons sowie der anschließenden Bestätigung Ihrer E-Mail-Adresse\nüber den zugesandten Link erklären Sie sich mit dem Bezug unseres Newsletter\neinverstanden.\n\nWir verwenden Ihre E-Mail-Adresse gemäß unserer Datenschutzerklärung\nausschließlich für den zweckgebundenen Versand unseres Newsletters. Sie können\ndiesen jederzeit wieder abbestellen, indem Sie den entsprechenden Link am Ende\ndes Newsletters anklicken.\n\nPrüfen Sie Ihren Posteingang oder Spam-Ordner, um das Abonnement zu\nbestätigen.\n\n____\n\nKinast\n\n  * Wir sind KINAST!\n  * Standorte\n  * Karriere bei KINAST\n  * Blog – datenschutzticker\n  * Datenschutzticker\n\nUnsere Lösungen\n\n  * Branchen\n  * Externer Datenschutzbeauftragter\n  * Konzerndatenschutzbeauftragter\n  * Externer Compliancebeauftragter\n  * Datenschutzberatung\n  * Datenschutzrechtliche Schulungen\n  * Whistleblowing Hinweisgebersystem\n  * Angebotsanfrage\n\nInformationen\n\n  * Kontakt\n  * Impressum\n  * Datenschutzerklärung\n\n© 2024 | KINAST Rechtsanwälte - Externe Datenschutzbeauftragte – Externe\nCompliancebeauftragte\n\n"
}