{
    "summary": "  * Leistungen\n\n __\n\n## Detenschutz\n\n## Datenschutzaudit\n\n## Datenschutzschulungen\n\n## Externer Datenschutzbeauftragter\n\n## IT-Sicherheit\n\n## IT-Sicherheit\n\n## Organisatorische Tests\n\n## Hinweisgeberschutzgesetz  \nWhistleblower\n\n## LSMH nach ISO 27001\n\n## Technisch-organisatorisches Security Audit\n\nHinweisgeberschutzgesetzes\n\n  * Kosten\n\n  * Wissenswertes\n\n  * Über uns\n\n __\n\n    * Was macht uns aus\n\n    * Unser Vorgehen\n\n  * ···\n\n  * Leistungen\n\n __\n\n## Detenschutz\n\n## Datenschutzaudit\n\n## Datenschutzschulungen\n\n## Externer Datenschutzbeauftragter\n\n## IT-Sicherheit\n\n## IT-Sicherheit\n\n## Organisatorische Tests\n\n## Hinweisgeberschutzgesetz  \nWhistleblower\n\n## LSMH nach ISO 27001\n\n## Technisch-organisatorisches Security Audit\n\nHinweisgeberschutzgesetzes\n\n  * Kosten\n\n  * Wissenswertes\n\n  * Über uns\n\n __\n\n    * Was macht uns aus\n\n    * Unser Vorgehen\n\n  * ···\n\n# Externer Datenschutzbeauftragter­ – Ihr Schlüssel zur DSGVO-Konformität\n\njuristische Sicherheit vor Abmahnungen\n\nDEKRA- und TÜV-zertifizierte Experten\n\nfachgerechte und pragmatische Umsetzung der EU-DSGVO\n\n## ANFRAGEN STELLEN\n\n## Wofür braucht man einen externen Datenschutzbeauftragten?\n\nExterner Datenschutz bedeutet das Outsourcing der Position eines\nDatenschutzbeauftragten. Anstatt einen internen Mitarbeiter mit dieser Aufgabe\nzu betrauen, wird ein unabhängiger Fachmann beauftragt. Dieser stellt für\nUnternehmen oft eine flexible und kosteneffiziente Lösung dar. So können Sie\ndie Anforderungen der DSGVO erfüllen und den Datenschutz in Ihrem Unternehmen\nsicherstellen.\n\n## Die Rolle und Aufgaben eines externen Datenschutzbeauftragten\n\n  * **Schulung der Mitarbeiter:  \n** Der Datenschutzbeauftragte ist dafür verantwortlich, das Bewusstsein für\nDatenschutzfragen im Unternehmen zu schärfen. Er schult die Mitarbeiter in\nBezug auf ihre Verantwortlichkeiten.\n\n  *  **Durchführung von Datenschutz-Audits:  \n** Er führt regelmäßige Überprüfungen durch, um sicherzustellen, dass das\nUnternehmen die Datenschutzbestimmungen einhält.\n\n  *  **Beantwortung von Datenschutzanfragen:  \n** Er ist die erste Anlaufstelle für Datenschutzanfragen von Kunden,\nMitarbeitern und Aufsichtsbehörden.\n\n  *  **Beratung bei der Implementierung von Datenschutzmaßnahmen:  \n** Er berät Ihr Unternehmen bei der Implementierung von Maßnahmen zur\nDatensicherheit und zur Einhaltung der DSGVO.\n\n## Kosten für einen externen Datenschutzbeauftragten\n\nDie Kosten für einen externen Datenschutzbeauftragten variieren je nach Größe\nund Komplexität des Unternehmens. Sie umfassen in der Regel eine monatliche\nGebühr für die laufende Beratung und Unterstützung. Diese Kosten sind oft\ngeringer als die Kosten für die Einstellung eines internen\nDatenschutzbeauftragten.\n\n## PRIOLAN – Ein Externer Datenschutzbeauftragter für Ihr Unternehmen\n\nSeit 1996 bietet PRIOLAN nternehmen Unterstützung im Bereich Datenschutz. Mit\nunserer langjährigen Expertise und einem Fokus auf die menschliche Komponente\ngelten wir als vertrauenswürdiger Partner für Unternehmen. Unsere Firmenkultur\nberuht auf Ehrlichkeit, Beständigkeit und Loyalität. Diese Werte spiegeln sich\nin unseren praxisorientierten und pragmatischen Angeboten wider. Wir\nkonzentrieren uns auf das Wesentliche und bieten maßgeschneiderte Lösungen für\nunsere Kunden.\n\n## Vorteile eines externen Datenschutzbeauftragten\n\n  * **Fachwissen und Erfahrung  \n** Externe Datenschutzbeauftragte sind Experten auf ihrem Gebiet.\n\n  *  **Kosteneffizienz  \n** Die Einstellung eines externen Datenschutzbeauftragten kann\nkosteneffizienter sein als die Einstellung eines internen Mitarbeiters.\n\n  *  **Unabhängigkeit und Objektivität  \n** Als externe Fachleute können Datenschutzbeauftragte unabhängig und objektiv\nagieren.\n\n  *  **Zeitersparnis  \n** Mit einem externen Datenschutzbeauftragten an Ihrer Seite können Sie sich\nauf Ihr Kerngeschäft konzentrieren.\n\n  *  **Risikominderung  \n** Ein externer Datenschutzberater hilft Ihnen, Datenschutzverletzungen zu\nvermeiden und das Risiko von Bußgeldern und Rechtsstreitigkeiten zu\nminimieren.\n\n  *  **Vertrauensbildung  \n** Ein externer Datenschutzbeauftragter hilft, das Vertrauen Ihrer Kunden,\nMitarbeiter und Geschäftspartner in Ihr Unternehmen zu stärken.\n\nBeratung  Unsere Leistungen  Unsere Qualifikation  Zuverlässig und\nvertraunswürdig  Pragmatische und angemessene Maßnahmen\n\nBeratung\n\nAls Externer Datenschutzbeauftragter ist es unsere Aufgabe, auf die Einhaltung\nder datenschutzrechtlichen Vorschriften im Unternehmen hinzuwirken. Mit den\nDatenschutzgesetzen gehen eine Reihe an Informations-, Transparenz- und\nDokumentationspflichten einher. Hierzu beraten wir Sie kompetent und\nverantwortungsbewusst und unterstützen Sie bei der Umsetzung aller\nerforderlichen Maßnahmen.\n\nUnsere Leistungen:\n\n  * Datenschutzberatung in allen Belangen des Datenschutzes\n  * Bestandsaufnahme der bestehenden Datenschutz und IT-Sicherheits-Richtlinien und Organisationsstrukturen\n  * Beratung und Unterstützung bei der Definition der Datenschutzpolicy (Verfahrensanweisungen)\n  * Beratung und Unterstützung bei der Erstellung der Verzeichnisse von Verarbeitungstätigkeiten (Art. 30 DSGVO)\n  * Vorabkontrolle automatisierter Verarbeitung\n  * Mitarbeiterschulung über die Erfordernisse des Datenschutzes\n  * Umsetzung und Kontrolle des Datenschutzkonzeptes\n  * Prüfung Ihrer Auftragnehmer im Rahmen des Art. 29 DSGVO\n\nUnsere Qualifikation\n\nUnsere Datenschutzberater sind starke Partner für Ihr Unternehmen.  \nWir legen größten Wert auf eine fundierte Ausbildung und ständige\nWeiterbildung unserer Consultants, damit sie jederzeit in Unternehmen\nunterschiedlicher Größe als externe Datenschutzbeauftragte zur Seite stehen\nkönnen, egal in welcher Branche Ihr Unternehmen zu Hause ist.\n\n **Wir unterstützen Sie gerne als Ihr externer Datenschutzbeauftragter.**\n\nZuverlässig und vertraunswürdig\n\nDie Vielfältigkeit eines Datenschutzbeauftragten wird oft unterschätzt. Neben\nder erforderlichen IT-Fachkenntnis und dem hohen Maß an Zuverlässigkeit und\nVertrauenswürdigkeit, sollte der Datenschutzbeauftragte auch organisatorische\nFähigkeiten und betriebswirtschaftliches Verständnis mitbringen. Denn nur so\nkönnen Synergieeffekte erzeugt werden. Daten werden also nicht mehr nur als\nbloße Zahlen und Buchstaben verstanden – sie sind das, was ein Unternehmen\nausmacht.\n\nPragmatische und angemessene Maßnahmen\n\nAus diesem Grund wird stetig auf die Einhaltung des Datenschutzes geachtet.\nDazu gehört auch, dass der Datenschutzbeauftragte in Zusammenarbeit mit\nverschiedenen Abteilungen für den verantwortungsbewussten Umgang mit\npersonenbezogenen Daten, angemessene Sicherheitsmaßnahmen und eine\npraxistaugliche Datenschutzorganisation sorgt.\n\n## Fazit – Ein externer Datenschutzbeauftragter von PRIOLAN\n\nIn der heutigen datengetriebenen Welt ist der Datenschutz von entscheidender\nBedeutung. Die DSGVO hat die Anforderungen an Unternehmen erhöht und die Rolle\ndes Datenschutzbeauftragten unverzichtbar gemacht. Externer Datenschutz bietet\neine flexible und kosteneffiziente Lösung, um diesen Anforderungen gerecht zu\nwerden.\n\nDie Wahl eines erfahrenen Partners wie PRIOLAN kann den Unterschied ausmachen.\nPRIOLAN verfügt über langjährige Expertise im Bereich des externen\nDatenschutzes. Wir sorgen dafür, dass Ihr Unternehmen die Anforderungen der\nDSGVO erfüllt.\n\n### Häufig gestellte Fragen\n\nWas passiert, wenn mein Unternehmen keinen internen Datenschutzexperten oder\nexternen Datenschutzbeauftragten hat?\n\nUnternehmen können nach der DSGVO dazu verpflichtet sein, einen\nDatenschutzbeauftragten zu benennen. Erfolgt dies nicht, sind erhebliche\nBußgelder die Folge. Die DSGVO sieht hierbei Strafen von bis zu 10 Millionen\nEuro vor. Alternativ können auch 2 % des weltweiten Jahresumsatzes des\nvorangegangenen Geschäftsjahres fällig werden. Es kommt dabei immer darauf an,\nwelcher der beiden Beträge höher ist.\n\nWie kann ich sicherstellen, dass der externe Datenschutzbeauftragte die\nAnforderungen meines Unternehmens versteht?\n\nUnsere externen Datenschutzbeauftragten nehmen sich die Zeit, Ihr Unternehmen\nund dessen spezifischen Anforderungen zu verstehen. Dies kann durch\nregelmäßige Meetings, Audits und Schulungen erreicht werden. Es ist wichtig,\ndass Sie eine offene Kommunikation mit Ihrem Datenschutzexperten pflegen und\nalle relevanten Informationen teilen.\n\nWie oft sollte ein externer Datenschutzbeauftragter mein Unternehmen besuchen?\n\nDie Häufigkeit der Besuche wird von verschiedenen Faktoren bestimmt. Dabei\nspielen die Größe und Komplexität Ihres Unternehmens eine Rolle. Ebenso ist\ndie DSGVO mit ihren spezifischen Anforderungen zu beachten. In einigen Fällen\nkann es genügen, wenn der externe Datenschutzbeauftragte einmal im Jahr vor\nOrt ist. In anderen Fällen können häufigere Besuche notwendig sein.\n\n## Warum Priolan?\n\n  * Weil wir juristische und technische Aufgaben gleichermaßen beherrschen.\n  * Weil Datenschutz und IT-Sicherheit für uns kein Randthema ist, sondern unser Hauptgeschäft.\n  * Weil wir praxiserprobt und bedarfsgerecht arbeiten.\n  * Weil wir Referenzprojekte sowohl in kleinen und mittleren Unternehmen als auch in international agierenden Konzernen vorweisen können.\n\n  * Weil wir nach der Beratung auch für die Umsetzung Verantwortung übernehmen.\n  * Weil wir ein ehrlicher und kompetenter Partner sind.\n  * Weil uns persönliche Kundenbeziehungen wichtiger sind als das Baukastenprinzip.\n\n## FAQ – Häufig gestellte Fragen\n\nWas kostet ein externer Datenschutzbeauftragter?\n\nDie Kosten eines externen Datenschutzbeauftragten variieren, je nachdem wie\ngroß der  **Beratungsbedarf**  des Unternehmens ist und ob die  **Betreuung**\nvor Ort oder online stattfinden soll.\n\nHäufig ist ein externer Datenschutzbeauftragter die  **günstigere**\nAlternative✅, da Kosten für Lohn und Weiterbildung im Hinblick auf Datenschutz\nnicht anfallen. Zudem konzentriert sich der  **externe\nDatenschutzbeauftragte**  zu hundert Prozent auf den Datenschutz✅, während\nsich ein interner Datenschutzbeauftragter hingegen auch noch mit anderen ihm\nzugeteilten Aufgaben beschäftigen muss.\n\nWas kostet ein externer Datenschutzbeauftragter von Priolan?\n\nJe nach Größe des Unternehmens und Umfang der gewünschten Leistungen kann der\n**Preis**  für einen  **externen Datenschutzbeauftragten** ✅ variieren. Eine\nsolche Dienstleistung kann bei uns aber schon bereits ab  **150,- Euro pro\nMonat** ✅ für kleinere Unternehmen gebucht werden. Wir bieten Ihnen je nach\nindividueller Situation verschiedene Leistungspakete✅ an – sowohl für\nUnternehmen bis  **50 Mitarbeiter / bis 250 Mitarbeiter / bis 500\nMitarbeiter** ✅, als auch für  **Apotheken** ✅ und  **Arztpraxen** ✅\n\nWelche Varianten gibt es für die Betreuung durch einen\nDatenschutzbeauftragten?\n\nWir bieten Ihnen  **zwei verschiedene Varianten**  der Betreuung als externer\nDatenschutzbeauftragter an:\n\n  * online Variante✅\n  * vor Ort Betreuung✅\n\nIn vielen Bereichen des wirtschaftlichen Handelns - unter Berücksichtigung\ngesetzlicher, politischer und umweltrelevanter Vorgaben - ist es notwendig auf\nexterne Partner zurückzugreifen. Im Bereich der Datenschutzgrundverordnung\n(DSGVO) haben wir mit der PRIOLAN GmbH einen verantwortungsvollen Berater\ngefunden, der uns äußerst fach- und sachkundig während der Umsetzung begleitet\nhat und dies immer, unter Berücksichtigung der branchenspezifischen\nBesonderheiten. Durch die anhaltende Beratung und Betreuung fühlen wir uns für\ndie Zukunft gut aufgestellt.\n\nMatthias MallProkurist Mitglied der Geschäftsleitung\nControlling/Kreditmanagement, Walter DOMESLE Mineralölgroßhandlung GmbH\n\nDie Priolan wurde uns von unserem Branchenverband als verlässlichen Partner\nfür den Datenschutz genannt. Wir fühlen uns bei diesem Thema bei der Priolan\nsehr gut aufgehoben und arbeiten kontinuierlich und partnerschaftlich an dem\nProjekt. Die Zusammenarbeit funktioniert reibungslos und menschlich angenehm.\nWir werden gut beraten, und auch auf unsere unternehmensspezifischen Belange\nwird seitens der Berater der Priolan jederzeit eingegangen. Wir würden das\nUnternehmen wieder für eine Beratung beauftragen.\n\nKarsten WarthGeschäftsführer, Best Western Plus Hotel Fellbach-Stuttgart\n\nGerade für nebenberufliche Datenschutzbeauftragte ist es wichtig, mit geringem\nAufwand auf dem Laufenden zu bleiben und ein Forum für seine Probleme zu\nhaben. Der ERFA-Kreis bietet einen guten Mix aus Theorie und Praxis. Aktuelle\nProbleme können im Plenum angesprochen und diskutiert werden. [...] Die\nVorbereitung der Referenten von Priolan und die Diskussion sind für den Alltag\ndes betrieblichen Datenschutzes von hohem Nutzen und lassen sich sehr gut\numsetzen. Verbunden mit den Hinweisen auf die aktuelle Rechtsprechung und den\nReferaten aus dem Teilnehmerkreis sind die ERFA-Seminare eine hervorragende\nMöglichkeit, aus Datenschutzsicht aktuell informiert zu bleiben und sich\nRückmeldung anderer Fachkollegen einzuholen. [...]\n\nAndreas Bühler | Manfred Diehl | Josef PeinGeschäftsführer, Minol Messtechnik\nGmbH & Co. KG Leinfeldern-Echterdingen | GETRAG International GmbH\nUntergruppenbach | WMF AG Geislingen/Steige\n\nWir fühlen uns bei der PRIOLAN GmbH, zu allen Punkten des Datenschutzes und\nder DSGVO, seit vielen Jahren gut aufgehoben. Wir vertrauen hierbei auf die\nlange Erfahrung der PRIOLAN GmbH, sowie das fundierte Fachwissen der uns\nbetreuenden Mitarbeiter. Besonders schätzen wir hierbei die unaufgeforderten\nHinweise und Tipps zur Vorgehensweise bei der Umsetzung der Maßnahmen.\nHilfreich und besonders effektiv sind die mehrmals im Jahr stattfindenden\nGesprächstermine bei uns im Hause, wobei hierbei in regelmäßigen Abständen\nauch die Mitarbeiter geschult werden.\n\nPeter WeishäuplGeschäftsführer, Hotel Unger Stuttgart\n\nIn vielen Bereichen des wirtschaftlichen Handelns - unter Berücksichtigung\ngesetzlicher, politischer und umweltrelevanter Vorgaben - ist es notwendig auf\nexterne Partner zurückzugreifen. Im Bereich der Datenschutzgrundverordnung\n(DSGVO) haben wir mit der PRIOLAN GmbH einen verantwortungsvollen Berater\ngefunden, der uns äußerst fach- und sachkundig während der Umsetzung begleitet\nhat und dies immer, unter Berücksichtigung der branchenspezifischen\nBesonderheiten. Durch die anhaltende Beratung und Betreuung fühlen wir uns für\ndie Zukunft gut aufgestellt.\n\nMatthias MallProkurist Mitglied der Geschäftsleitung\nControlling/Kreditmanagement, Walter DOMESLE Mineralölgroßhandlung GmbH\n\nDie Priolan wurde uns von unserem Branchenverband als verlässlichen Partner\nfür den Datenschutz genannt. Wir fühlen uns bei diesem Thema bei der Priolan\nsehr gut aufgehoben und arbeiten kontinuierlich und partnerschaftlich an dem\nProjekt. Die Zusammenarbeit funktioniert reibungslos und menschlich angenehm.\nWir werden gut beraten, und auch auf unsere unternehmensspezifischen Belange\nwird seitens der Berater der Priolan jederzeit eingegangen. Wir würden das\nUnternehmen wieder für eine Beratung beauftragen.\n\nKarsten WarthGeschäftsführer, Best Western Plus Hotel Fellbach-Stuttgart\n\nVoriger\n\nNächster\n\n## Das sagen unsere Kunden\n\n## Haben Sie Fragen oder möchten Sie weitere Informationen anfordern?\nKontaktieren Sie uns!\n\nDatenschutzexperten seit 1996. Als erfahrener Datenschutzdienstleister stehen\nwir für qualitative und kompetente Beratung und helfen Ihnen gerne weiter.\n\nANFRAGE STELLEN\n\nLEISTUNGEN\n\nIT-Sicherheit\n\nLSMH nach ISO 27001\n\nOrganisatorische Tests\n\nTechnisch-organisatorisches Security Audit\n\nDatenschutzaudit\n\nDatenschutz Folgenabschätzung\n\nLöschkonzept\n\nVerzeichnis von Verarbeitungstätigkeiten\n\nWISSENSWERTES\n\nKeine Mehrheit im Bundesrat: Hinweisgeberschutzgesetz vorerst gescheitert\n\nDatenschutz in Unternehmen: Einfach, kosteneffektiv und risikobasiert\n\nDatenschutz im medizinischen Bereich: Bedeutung und Umsetzung von Gesetzen und\ntechnischen Maßnahmen\n\nHomeoffice 2.0 – die Folgen der vergangenen Monate, sowie die Lehren für\nDatenschutzaudits\n\nAnleitung zum Löschkonzept\n\nDatenschutzaudit für Unternehmen\n\nPRIOLAN GMBH\n\ninfo@priolan.de\n\nE-mail\n\n07946 9893516\n\nTelefon\n\nSteinsfeldstraße 46 D-74626 Bretzfeld\n\n5 von 5 Sternen\n\n_★_ _★_ _★_ _★_ _★_ 5/5\n\n  * Publikation: Broschüre (PDF)\n  * Kontakt\n  * Impressum\n  * Datenschutz\n  * Login\n\nDatenschutzeinstellungen\n\nWir nutzen Cookies auf unserer Website. Einige von ihnen sind essenziell,\nwährend andere uns helfen, diese Website und Ihre Erfahrung zu verbessern.\nWenn Sie unter 16 Jahre alt sind und Ihre Zustimmung zu freiwilligen Diensten\ngeben möchten, müssen Sie Ihre Erziehungsberechtigten um Erlaubnis bitten. Wir\nverwenden Cookies und andere Technologien auf unserer Website. Einige von\nihnen sind essenziell, während andere uns helfen, diese Website und Ihre\nErfahrung zu verbessern. Personenbezogene Daten können verarbeitet werden (z.\nB. IP-Adressen), z. B. für personalisierte Anzeigen und Inhalte oder Anzeigen-\nund Inhaltsmessung. Weitere Informationen über die Verwendung Ihrer Daten\nfinden Sie in unserer Datenschutzerklärung. Sie können Ihre Auswahl jederzeit\nunter Einstellungen widerrufen oder anpassen.\n\nDatenschutzeinstellungen\n\n  * Essenziell \n  * Statistiken \n  * Marketing \n  * Externe Medien \n\nAlle akzeptieren\n\nSpeichern\n\nIndividuelle Datenschutzeinstellungen\n\nCookie-Details  Datenschutzerklärung  Impressum\n\nDatenschutzeinstellungen\n\nWenn Sie unter 16 Jahre alt sind und Ihre Zustimmung zu freiwilligen Diensten\ngeben möchten, müssen Sie Ihre Erziehungsberechtigten um Erlaubnis bitten. Wir\nverwenden Cookies und andere Technologien auf unserer Website. Einige von\nihnen sind essenziell, während andere uns helfen, diese Website und Ihre\nErfahrung zu verbessern. Personenbezogene Daten können verarbeitet werden (z.\nB. IP-Adressen), z. B. für personalisierte Anzeigen und Inhalte oder Anzeigen-\nund Inhaltsmessung. Weitere Informationen über die Verwendung Ihrer Daten\nfinden Sie in unserer Datenschutzerklärung. Hier finden Sie eine Übersicht\nüber alle verwendeten Cookies. Sie können Ihre Einwilligung zu ganzen\nKategorien geben oder sich weitere Informationen anzeigen lassen und so nur\nbestimmte Cookies auswählen.\n\nAlle akzeptieren  Speichern\n\nZurück\n\nDatenschutzeinstellungen\n\nEssenziell (2)\n\nEssenzielle Cookies ermöglichen grundlegende Funktionen und sind für die\neinwandfreie Funktion der Website erforderlich.\n\nCookie-Informationen anzeigen  Cookie-Informationen ausblenden\n\nName |  Borlabs Cookie  \n---|---  \nAnbieter | Eigentümer dieser Website, Impressum  \nZweck | Speichert die Einstellungen der Besucher, die in der Cookie Box von\nBorlabs Cookie ausgewählt wurden.  \nCookie Name | borlabs-cookie  \nCookie Laufzeit | 1 Jahr  \nName |  Google Tag Manager  \n---|---  \nAnbieter | Google Ireland Limited, Gordon House, Barrow Street, Dublin 4,\nIreland  \nZweck | Cookie von Google zur Steuerung der erweiterten Script- und\nEreignisbehandlung.  \nDatenschutzerklärung |  https://policies.google.com/privacy?hl=de  \nCookie Name | _ga,_gat,_gid  \nCookie Laufzeit | 2 Jahre  \n  \nStatistiken (1)\n\nStatistiken\n\nStatistik Cookies erfassen Informationen anonym. Diese Informationen helfen\nuns zu verstehen, wie unsere Besucher unsere Website nutzen.\n\nCookie-Informationen anzeigen  Cookie-Informationen ausblenden\n\nAkzeptieren |  Google Analytics  \n---|---  \nName |  Google Analytics  \nAnbieter | Google Ireland Limited, Gordon House, Barrow Street, Dublin 4,\nIreland  \nZweck | Cookie von Google für Website-Analysen. Erzeugt statistische Daten\ndarüber, wie der Besucher die Website nutzt.  \nDatenschutzerklärung |  https://policies.google.com/privacy?hl=de  \nCookie Name | _ga,_gat,_gid  \nCookie Laufzeit | 2 Monate  \n  \nMarketing (2)\n\nMarketing\n\nMarketing-Cookies werden von Drittanbietern oder Publishern verwendet, um\npersonalisierte Werbung anzuzeigen. Sie tun dies, indem sie Besucher über\nWebsites hinweg verfolgen.\n\nCookie-Informationen anzeigen  Cookie-Informationen ausblenden\n\nAkzeptieren |  Google Ads  \n---|---  \nName |  Google Ads  \nAnbieter | Google Ireland Limited, Gordon House, Barrow Street, Dublin 4,\nIreland  \nZweck | Cookie von Google, das für das Conversion-Tracking von Google Ads\nverwendet wird.  \nDatenschutzerklärung |  https://policies.google.com/privacy?hl=de  \nAkzeptieren |  Mouseflow  \n---|---  \nName |  Mouseflow  \nAnbieter | Mouseflow Inc. 106 E 6th St #900. Austin TX, 78701, USA  \nZweck | Mouseflow ist ein Analysewerkzeug für das Benutzerverhalten von\nMouseflow Inc. Wir verwenden Mouseflow, um zu verstehen, wie Benutzer mit\nunserer Website interagieren.  \nDatenschutzerklärung |  https://mouseflow.com/legal/company/privacy-policy/  \nHost(s) | *.mouseflow.com  \nCookie Name | mf_[website-id], mf_user,  \nCookie Laufzeit | Sitzung / 1 Jahr  \n  \nExterne Medien (7)\n\nExterne Medien\n\nInhalte von Videoplattformen und Social-Media-Plattformen werden standardmäßig\nblockiert. Wenn Cookies von externen Medien akzeptiert werden, bedarf der\nZugriff auf diese Inhalte keiner manuellen Einwilligung mehr.\n\nCookie-Informationen anzeigen  Cookie-Informationen ausblenden\n\nAkzeptieren |  Facebook  \n---|---  \nName |  Facebook  \nAnbieter | Meta Platforms Ireland Limited, 4 Grand Canal Square, Dublin 2,\nIreland  \nZweck | Wird verwendet, um Facebook-Inhalte zu entsperren.  \nDatenschutzerklärung |  https://www.facebook.com/privacy/explanation  \nHost(s) | .facebook.com  \nAkzeptieren |  Google Maps  \n---|---  \nName |  Google Maps  \nAnbieter | Google Ireland Limited, Gordon House, Barrow Street, Dublin 4,\nIreland  \nZweck | Wird zum Entsperren von Google Maps-Inhalten verwendet.  \nDatenschutzerklärung |  https://policies.google.com/privacy  \nHost(s) | .google.com  \nCookie Name | NID  \nCookie Laufzeit | 6 Monate  \nAkzeptieren |  Instagram  \n---|---  \nName |  Instagram  \nAnbieter | Meta Platforms Ireland Limited, 4 Grand Canal Square, Dublin 2,\nIreland  \nZweck | Wird verwendet, um Instagram-Inhalte zu entsperren.  \nDatenschutzerklärung |  https://www.instagram.com/legal/privacy/  \nHost(s) | .instagram.com  \nCookie Name | pigeon_state  \nCookie Laufzeit | Sitzung  \nAkzeptieren |  OpenStreetMap  \n---|---  \nName |  OpenStreetMap  \nAnbieter | Openstreetmap Foundation, St John’s Innovation Centre, Cowley Road,\nCambridge CB4 0WS, United Kingdom  \nZweck | Wird verwendet, um OpenStreetMap-Inhalte zu entsperren.  \nDatenschutzerklärung |  https://wiki.osmfoundation.org/wiki/Privacy_Policy  \nHost(s) | .openstreetmap.org  \nCookie Name | _osm_location, _osm_session, _osm_totp_token, _osm_welcome,\n_pk_id., _pk_ref., _pk_ses., qos_token  \nCookie Laufzeit | 1-10 Jahre  \nAkzeptieren |  Twitter  \n---|---  \nName |  Twitter  \nAnbieter | Twitter International Company, One Cumberland Place, Fenian Street,\nDublin 2, D02 AX07, Ireland  \nZweck | Wird verwendet, um Twitter-Inhalte zu entsperren.  \nDatenschutzerklärung |  https://twitter.com/privacy  \nHost(s) | .twimg.com, .twitter.com  \nCookie Name | __widgetsettings, local_storage_support_test  \nCookie Laufzeit | Unbegrenzt  \nAkzeptieren |  Vimeo  \n---|---  \nName |  Vimeo  \nAnbieter | Vimeo Inc., 555 West 18th Street, New York, New York 10011, USA  \nZweck | Wird verwendet, um Vimeo-Inhalte zu entsperren.  \nDatenschutzerklärung |  https://vimeo.com/privacy  \nHost(s) | player.vimeo.com  \nCookie Name | vuid  \nCookie Laufzeit | 2 Jahre  \nAkzeptieren |  YouTube  \n---|---  \nName |  YouTube  \nAnbieter | Google Ireland Limited, Gordon House, Barrow Street, Dublin 4,\nIreland  \nZweck | Wird verwendet, um YouTube-Inhalte zu entsperren.  \nDatenschutzerklärung |  https://policies.google.com/privacy  \nHost(s) | google.com  \nCookie Name | NID  \nCookie Laufzeit | 6 Monate  \n  \nDatenschutzerklärung  Impressum\n\n",
    "links": "[{\"link\": \"https://www.priolan.de/externer-datenschutzbeauftragter/\", \"text\": \"\"}, {\"link\": \"https://www.priolan.de/externer-datenschutzbeauftragter/\", \"text\": \"\"}, {\"link\": \"https://www.priolan.de/externer-datenschutzbeauftragter/\", \"text\": \"Leistungspakete\"}, {\"link\": \"https://www.priolan.de/externer-datenschutzbeauftragter/\", \"text\": \"online\"}, {\"link\": \"https://www.priolan.de/externer-datenschutzbeauftragter/\", \"text\": \"vor Ort\"}]",
    "priceAndPlans": "  * Leistungen\n\n __\n\n## Detenschutz\n\n## Datenschutzaudit\n\n## Datenschutzschulungen\n\n## Externer Datenschutzbeauftragter\n\n## IT-Sicherheit\n\n## IT-Sicherheit\n\n## Organisatorische Tests\n\n## Hinweisgeberschutzgesetz  \nWhistleblower\n\n## LSMH nach ISO 27001\n\n## Technisch-organisatorisches Security Audit\n\nHinweisgeberschutzgesetzes\n\n  * Kosten\n\n  * Wissenswertes\n\n  * Über uns\n\n __\n\n    * Was macht uns aus\n\n    * Unser Vorgehen\n\n  * ···\n\n  * Leistungen\n\n __\n\n## Detenschutz\n\n## Datenschutzaudit\n\n## Datenschutzschulungen\n\n## Externer Datenschutzbeauftragter\n\n## IT-Sicherheit\n\n## IT-Sicherheit\n\n## Organisatorische Tests\n\n## Hinweisgeberschutzgesetz  \nWhistleblower\n\n## LSMH nach ISO 27001\n\n## Technisch-organisatorisches Security Audit\n\nHinweisgeberschutzgesetzes\n\n  * Kosten\n\n  * Wissenswertes\n\n  * Über uns\n\n __\n\n    * Was macht uns aus\n\n    * Unser Vorgehen\n\n  * ···\n\n# Externer Datenschutzbeauftragter Kosten & Bestellung\n\n# Kosten eines externen Datenschutzbeauftragten – Effektive Lösungen für Ihr\nUnternehmen\n\nDie Datenschutz-Grundverordnung (DSGVO) hat die Art und Weise, wie Unternehmen\nmit personenbezogenen Daten umgehen, grundlegend verändert. Sie legt strenge\nRegeln fest, um die Privatsphäre der Bürger zu schützen und Unternehmen zur\nVerantwortung zu ziehen. Insbesondere Unternehmen mit mehr als 20\nMitarbeitern, die mit personenbezogenen Daten arbeiten, sind verpflichtet,\neinen Datenschutzbeauftragten zu benennen. Doch was bedeutet das für Ihr\nUnternehmen? Und wie können Sie diese Anforderungen erfüllen, ohne Ihre\nRessourcen zu überlasten? Die Antwort könnte in der Auslagerung dieser\nPosition liegen, indem Sie einen externen Datenschutzbeauftragten einsetzen.\n\nLesen Sie hier mehr über die Kosten eines externen Datenschutzbeauftragten und\nwelche Vorteile das Outsourcing hat.\n\n## Überblick– Aufgaben und Kosten eines externen Datenschutzbeauftragten\n\n  * **Fachwissen und Erfahrung  \n** Externe Datenschutzbeauftragte sind Experten auf ihrem Gebiet.\n\n  *  **Kosteneffizienz  \n** Die Einstellung eines externen Datenschutzbeauftragten kann\nkosteneffizienter sein als die Einstellung eines internen Mitarbeiters.\n\n  *  **Unabhängigkeit und Objektivität  \n** Als externe Fachleute können Datenschutzbeauftragte unabhängig und objektiv\nagieren.\n\n  *  **Zeitersparnis  \n** Mit einem externen Datenschutzbeauftragten an Ihrer Seite können Sie sich\nauf Ihr Kerngeschäft konzentrieren.\n\n  *  **Risikominderung  \n** Ein externer Datenschutzberater hilft Ihnen, Datenschutzverletzungen zu\nvermeiden und das Risiko von Bußgeldern und Rechtsstreitigkeiten zu\nminimieren.\n\n  *  **Vertrauensbildung  \n** Ein externer Datenschutzbeauftragter hilft, das Vertrauen Ihrer Kunden,\nMitarbeiter und Geschäftspartner in Ihr Unternehmen zu stärken.\n\n## Kleine Unternehmen – Externer Datenschutzbeauftragter Kosten\n\nFür kleinere Unternehmen mit 20–30 Mitarbeitern ergeben sich durch die\nBeauftragung eines externen Datenschutzbeauftragten Kosten- und Zeitvorteile.\nSie sparen nicht nur Geld, sondern auch wertvolle Zeit und Ressourcen, die sie\nstattdessen in ihr Kerngeschäft investieren können.\n\n## Auch große Unternehmen sparen Kosten durch externen\nDatenschutz­beauftragten\n\n  * **Erfahrung und Fachkenntnis  \n** Externe Datenschutzbeauftragte bringen oft eine breitere Erfahrung und\nFachkenntnis mit.\n\n  *  **Vermeidung von Interessenkonflikten  \n** Die Auslagerung der Datenschutzfunktion kann dazu beitragen,\nInteressenkonflikte zu vermeiden. Solche Konflikte können entstehen, wenn ein\ninterner Mitarbeiter sowohl für die Datenverarbeitung als auch für deren\nÜberwachung verantwortlich ist.\n\n  *  **Fokus auf Kernkompetenzen  \n** Die Beauftragung eines externen Datenschutzberaters ermöglicht den internen\nTeams, sich auf ihre Kernkompetenzen zu konzentrieren. Gleichzeitig haben sie\ndie Gewissheit, dass ihre Datenschutzverpflichtungen professionell verwaltet\nwerden.\n\n  *  **Risikominderung  \n** Mit zunehmender Unternehmensgröße und Komplexität der\nDatenverarbeitungsprozesse steigt auch das Risiko von Datenschutzverletzungen.\nEin Datenschutzbeauftragter kann dabei helfen, diese Risiken zu identifizieren\nund zu minimieren.\n\n## Externer Datenschutz­beauftragter - Kosten sparen mit Priolan\n\nSeit 1996 bietet Priolan Unternehmen eine praxisorientierte, pragmatische\nUnterstützung beim Datenschutz. Wir unterscheiden uns von anderen Anbietern\ndurch unsere langjährige Expertise und einen scharfen Fokus auf das\nWesentliche. Wir sind empfohlener Dienstleister für Datenschutz von der DEHOGA\nfür deren Mitglieder.\n\n## Fazit – Externer Datenschutz­beauftragter Kosten\n\nDie Einhaltung der DSGVO und der Schutz personenbezogener Daten sind\nentscheidende Aspekte für jedes Unternehmen, unabhängig von seiner Größe. Die\nBeauftragung eines externen Datenschutzbeauftragten bietet eine flexible und\nkosteneffektive Lösung, um diese Herausforderungen zu bewältigen. Kleinere\nUnternehmen profitieren durch externe Datenschutzbeauftragte von den\nKosteneinsparungen und der Möglichkeit, sich auf ihr Kerngeschäft zu\nkonzentrieren. Größere Unternehmen profitieren von der umfassenden Expertise\nund der Fähigkeit, komplexe Datenschutzherausforderungen zu bewältigen.\n\nMit der Unterstützung von Experten wie Priolan können Unternehmen jeder Größe\nden Datenschutz einfach umsetzen. In einer datengetriebenen Welt kann ein\neffektives Datenschutzmanagement nicht nur rechtliche Konsequenzen vermeiden.\nAuch das Vertrauen der Kunden wird so gestärkt und verschafft Ihnen einen\nWettbewerbsvorteil.\n\nMehr informationen\n\nAnfrage stellen\n\n## Kosten und Leistungspakete\n\n| Basis| Basis +| Premium  \n---|---|---|---  \n| Für Unternehmen bis 50 Mitarbeiter| Für Unternehmen bis 250 Mitarbeiter| Für\nUnternehmen bis 500 Mitarbeiter  \n| **Enthalten**|  **Enthalten**|  **Enthalten**  \nBAFA-Förderung möglich|  __|  __|  __  \n  \n### Grundlagen DSGVO  \n  \nBenennung eines externen Datenschutzbeauftragten|  __|  __|  __  \nBestellurkunde für den externen Datenschutzbeauftragten|  __|  __|  __  \nMeldung des externen Datenschutzbeauftragten bei der Aufsichtsbehörde|  __|\n__|  __  \nDatenschutz-Audit|  __|  __|  __  \nLösungsvorschläge und Handlungsempfehlungen|  __|  __|  __  \nJährlicher Tätigkeitsbericht für die Geschäftsführung|  _X_|  __|  __  \n  \n### Dokumente/Management DSGVO  \n  \nTechnisch und organisatorische Maßnahmen (TOMs)|  _X_|  __|  __  \nErstellung der Prozesse von Verarbeitungstätigkeiten|  _X_|  __|  __  \nPrüfung von Standard Verarbeitungsprozessen|  _X_|  __|  __  \nVerzeichnis von Verarbeitungstätigkeiten|  __|  __|  __  \nErstellung von AVVs Ihrer Geschäftspartner|  _X_|  __|  __  \nPrüfung von AVVs von Ihren Geschäftspartnern|  _X_|  __|  __  \nDatenschutzerklärung Bewerbung|  __|  __|  __  \n  \n### Zusätzliche Beratungszeit  \n  \n### Webseite  \n  \nDatenschutzerklärung für Ihre Webseite| 0|  __|  __  \nDatenschutzrechtliche Prüfung Ihrer Webseite| 0|  __|  __  \n  \n### Mitarbeiterschulung  \n  \nOnline-Schulung für Mitarbeiter (Zugänge)|  _X_|  __|  __  \nZertifikat für die Teilnahme|  _X_|  __|  __  \n  \n### Informationen  \n  \nDatenschutzinformationen für Beschäftigte im Unternehmen|  __|  __|  __  \nDatenschutz-News|  _X_|  __|  __  \n  \n### Verpflichtung  \n  \nVerpflichtung der Mitarbeiter auf Vertraulichkeit|  __|  __|  __  \nVerpflichtung der Mitarbeiter auf das Fernmeldegeheimnis|  __|  __|  __  \n  \n### Hinweisschilder  \n  \nHinweisschilder für Videoüberwachung|  __|  __|  __  \n  \n### Einwilligung  \n  \nPrüfung von Einwilligungen für die Verwendung von Fotos|  __|  __|  __  \nEinwilligungserklärung zur Veröffentlichung von Mitarbeiterfotos innerhalb des\nUnternehmens|  __|  __|  __  \nEinwilligungserklärung zur Veröffentlichung von Mitarbeiterfotos zu externen\nZwecken des Unternehmens|  __|  __|  __  \nEinwilligungserklärung zur Veröffentlichung von Mitarbeiterfotos zu internen\nund externen Zwecken|  __|  __|  __  \n  \n### Muster von Richtlinien  \n  \nClean-Desk-Policy|  __|  __|  __  \nInternet- und E-Mail-Nutzung|  __|  __|  __  \nTelearbeitsplätze/Homeoffice|  __|  __|  __  \nTelefonanlage|  __|  __|  __  \nGestaltung von Passwörtern|  __|  __|  __  \nWeiterleitung von E-Mails|  __|  __|  __  \n  \n### Musterprozesse  \n  \nAuskunftsersuchen|  __|  __|  __  \nLöschung|  __|  __|  __  \nBerichtigung|  __|  __|  __  \nDatenpanne|  __|  __|  __  \n  \n### Datenschutz-Folgenabschätzung  \n  \nDatenschutz-Folgenabschätzung|  _X_|  __|  __  \n  \n### Datenschutz-Check  \n  \nDatenschutz-Check|  _X_|  _X_|  __  \n**Monatliche Kosten**  \nNettopreis in EUR/Monat|  **150€**|  **300€**|  **450€**  \n**Einmalige Kosten**  \nDatenschutz-Audit Nettopreis EUR|  **1.200,-€**|  **1.800,-€**|  **3.000,-€**  \n  \n## Häufig gestellte Fragen\n\nWie setzen sich die Kosten für einen externen Datenschutzbeauftragten\nzusammen?\n\nDie Kosten für einen externen Datenschutzbeauftragten variieren je nach Größe\nund Komplexität des Unternehmens. Sie können monatliche Gebühren, Gebühren pro\nProjekt oder eine Kombination aus beidem umfassen. Kontaktieren Sie uns gerne\nbei Fragen rund um die Kosten für einen externen Datenschutzberater.\n\nWarum sind die Kosten für einen externen Datenschutzbeauftragten für kleinere\nUnternehmen oft geringer als die für einen internen Datenschutzbeauftragten?\n\nDie Kosten für einen externen Datenschutzbeauftragten sind oft niedriger als\ndie für einen internen Datenschutzbeauftragten. Dies liegt daran, dass keine\nzusätzlichen Kosten für Schulungen und Zertifizierungen entstehen. Zudem\nfallen eventuell keine Kosten für weitere benötigte Mitarbeiter an. Ein\nexterner Datenschutzbeauftragter stellt eine flexible Lösung dar. Diese passt\nsich an die Bedürfnisse des Unternehmens an. Auf diese Weise können Ressourcen\neffizienter genutzt werden.\n\nWie stehen die Kosten für einen externen Datenschutzbeauftragten im Verhältnis\nzu den potenziellen Risiken?\n\nDie Kosten für einen externen Datenschutzbeauftragten sollten immer im Kontext\nder potenziellen Risiken und Strafen betrachtet werden. Die Geldstrafen für\nVerstöße gegen die DSGVO können erheblich sein und die Kosten für einen\nexternen Datenschutzbeauftragten weit übersteigen. Darüber hinaus kann ein\neffektives Datenschutzmanagement dazu beitragen, das Image des Unternehmens\naufzuwerten.\n\nDie Priolan wurde uns von unserem Branchenverband als verlässlichen Partner\nfür den Datenschutz genannt. Wir fühlen uns bei diesem Thema bei der Priolan\nsehr gut aufgehoben und arbeiten kontinuierlich und partnerschaftlich an dem\nProjekt. Die Zusammenarbeit funktioniert reibungslos und menschlich angenehm.\nWir werden gut beraten, und auch auf unsere unternehmensspezifischen Belange\nwird seitens der Berater der Priolan jederzeit eingegangen. Wir würden das\nUnternehmen wieder für eine Beratung beauftragen.\n\nKarsten WarthGeschäftsführer, Best Western Plus Hotel Fellbach-Stuttgart\n\nGerade für nebenberufliche Datenschutzbeauftragte ist es wichtig, mit geringem\nAufwand auf dem Laufenden zu bleiben und ein Forum für seine Probleme zu\nhaben. Der ERFA-Kreis bietet einen guten Mix aus Theorie und Praxis. Aktuelle\nProbleme können im Plenum angesprochen und diskutiert werden. [...] Die\nVorbereitung der Referenten von Priolan und die Diskussion sind für den Alltag\ndes betrieblichen Datenschutzes von hohem Nutzen und lassen sich sehr gut\numsetzen. Verbunden mit den Hinweisen auf die aktuelle Rechtsprechung und den\nReferaten aus dem Teilnehmerkreis sind die ERFA-Seminare eine hervorragende\nMöglichkeit, aus Datenschutzsicht aktuell informiert zu bleiben und sich\nRückmeldung anderer Fachkollegen einzuholen. [...]\n\nAndreas Bühler | Manfred Diehl | Josef PeinGeschäftsführer, Minol Messtechnik\nGmbH & Co. KG Leinfeldern-Echterdingen | GETRAG International GmbH\nUntergruppenbach | WMF AG Geislingen/Steige\n\nWir fühlen uns bei der PRIOLAN GmbH, zu allen Punkten des Datenschutzes und\nder DSGVO, seit vielen Jahren gut aufgehoben. Wir vertrauen hierbei auf die\nlange Erfahrung der PRIOLAN GmbH, sowie das fundierte Fachwissen der uns\nbetreuenden Mitarbeiter. Besonders schätzen wir hierbei die unaufgeforderten\nHinweise und Tipps zur Vorgehensweise bei der Umsetzung der Maßnahmen.\nHilfreich und besonders effektiv sind die mehrmals im Jahr stattfindenden\nGesprächstermine bei uns im Hause, wobei hierbei in regelmäßigen Abständen\nauch die Mitarbeiter geschult werden.\n\nPeter WeishäuplGeschäftsführer, Hotel Unger Stuttgart\n\nIn vielen Bereichen des wirtschaftlichen Handelns - unter Berücksichtigung\ngesetzlicher, politischer und umweltrelevanter Vorgaben - ist es notwendig auf\nexterne Partner zurückzugreifen. Im Bereich der Datenschutzgrundverordnung\n(DSGVO) haben wir mit der PRIOLAN GmbH einen verantwortungsvollen Berater\ngefunden, der uns äußerst fach- und sachkundig während der Umsetzung begleitet\nhat und dies immer, unter Berücksichtigung der branchenspezifischen\nBesonderheiten. Durch die anhaltende Beratung und Betreuung fühlen wir uns für\ndie Zukunft gut aufgestellt.\n\nMatthias MallProkurist Mitglied der Geschäftsleitung\nControlling/Kreditmanagement, Walter DOMESLE Mineralölgroßhandlung GmbH\n\nVoriger\n\nNächster\n\n## Das sagen unsere Kunden\n\n### Quickcheck\n\nMit nur 10 Fragen erfahren Sie, welches Paket für Ihren Bedarf aus Sicht des\nDatenschutzes und der DSGVO relevant sind. Ermitteln Sie Ihren Bedarf und\nerhalten Sie direkt im Anschluss eine kostenfreie Checkliste für Ihr\nUnternehmen.\n\nJETZ BEDATF ERMITTELN\n\n### Anfrage stellen\n\nWenn sie bareits wissen, an welchen Stellen Verbesserungen notwending sind,\nkönnen Sie uns eine Anfrage stellen. Wir melden uns zeitnah und erarbeiten\ngemeinsam mit Ihnen alle weiteren Schritte.\n\nANFRAGE STELLEN\n\n## Haben Sie Fragen oder möchten Sie weitere Informationen anfordern?\nKontaktieren Sie uns!\n\nDatenschutzexperten seit 1996. Als erfahrener Datenschutzdienstleister stehen\nwir für qualitative und kompetente Beratung und helfen Ihnen gerne weiter.\n\nANFRAGE STELLEN\n\nLEISTUNGEN\n\nIT-Sicherheit\n\nLSMH nach ISO 27001\n\nOrganisatorische Tests\n\nTechnisch-organisatorisches Security Audit\n\nDatenschutzaudit\n\nDatenschutz Folgenabschätzung\n\nLöschkonzept\n\nVerzeichnis von Verarbeitungstätigkeiten\n\nWISSENSWERTES\n\nKeine Mehrheit im Bundesrat: Hinweisgeberschutzgesetz vorerst gescheitert\n\nDatenschutz in Unternehmen: Einfach, kosteneffektiv und risikobasiert\n\nDatenschutz im medizinischen Bereich: Bedeutung und Umsetzung von Gesetzen und\ntechnischen Maßnahmen\n\nHomeoffice 2.0 – die Folgen der vergangenen Monate, sowie die Lehren für\nDatenschutzaudits\n\nAnleitung zum Löschkonzept\n\nDatenschutzaudit für Unternehmen\n\nPRIOLAN GMBH\n\ninfo@priolan.de\n\nE-mail\n\n07946 9893516\n\nTelefon\n\nSteinsfeldstraße 46 D-74626 Bretzfeld\n\n5 von 5 Sternen\n\n_★_ _★_ _★_ _★_ _★_ 5/5\n\n  * Publikation: Broschüre (PDF)\n  * Kontakt\n  * Impressum\n  * Datenschutz\n  * Login\n\nDatenschutzeinstellungen\n\nWir nutzen Cookies auf unserer Website. Einige von ihnen sind essenziell,\nwährend andere uns helfen, diese Website und Ihre Erfahrung zu verbessern.\nWenn Sie unter 16 Jahre alt sind und Ihre Zustimmung zu freiwilligen Diensten\ngeben möchten, müssen Sie Ihre Erziehungsberechtigten um Erlaubnis bitten. Wir\nverwenden Cookies und andere Technologien auf unserer Website. Einige von\nihnen sind essenziell, während andere uns helfen, diese Website und Ihre\nErfahrung zu verbessern. Personenbezogene Daten können verarbeitet werden (z.\nB. IP-Adressen), z. B. für personalisierte Anzeigen und Inhalte oder Anzeigen-\nund Inhaltsmessung. Weitere Informationen über die Verwendung Ihrer Daten\nfinden Sie in unserer Datenschutzerklärung. Sie können Ihre Auswahl jederzeit\nunter Einstellungen widerrufen oder anpassen.\n\nDatenschutzeinstellungen\n\n  * Essenziell \n  * Statistiken \n  * Marketing \n  * Externe Medien \n\nAlle akzeptieren\n\nSpeichern\n\nIndividuelle Datenschutzeinstellungen\n\nCookie-Details  Datenschutzerklärung  Impressum\n\nDatenschutzeinstellungen\n\nWenn Sie unter 16 Jahre alt sind und Ihre Zustimmung zu freiwilligen Diensten\ngeben möchten, müssen Sie Ihre Erziehungsberechtigten um Erlaubnis bitten. Wir\nverwenden Cookies und andere Technologien auf unserer Website. Einige von\nihnen sind essenziell, während andere uns helfen, diese Website und Ihre\nErfahrung zu verbessern. Personenbezogene Daten können verarbeitet werden (z.\nB. IP-Adressen), z. B. für personalisierte Anzeigen und Inhalte oder Anzeigen-\nund Inhaltsmessung. Weitere Informationen über die Verwendung Ihrer Daten\nfinden Sie in unserer Datenschutzerklärung. Hier finden Sie eine Übersicht\nüber alle verwendeten Cookies. Sie können Ihre Einwilligung zu ganzen\nKategorien geben oder sich weitere Informationen anzeigen lassen und so nur\nbestimmte Cookies auswählen.\n\nAlle akzeptieren  Speichern\n\nZurück\n\nDatenschutzeinstellungen\n\nEssenziell (2)\n\nEssenzielle Cookies ermöglichen grundlegende Funktionen und sind für die\neinwandfreie Funktion der Website erforderlich.\n\nCookie-Informationen anzeigen  Cookie-Informationen ausblenden\n\nName |  Borlabs Cookie  \n---|---  \nAnbieter | Eigentümer dieser Website, Impressum  \nZweck | Speichert die Einstellungen der Besucher, die in der Cookie Box von\nBorlabs Cookie ausgewählt wurden.  \nCookie Name | borlabs-cookie  \nCookie Laufzeit | 1 Jahr  \nName |  Google Tag Manager  \n---|---  \nAnbieter | Google Ireland Limited, Gordon House, Barrow Street, Dublin 4,\nIreland  \nZweck | Cookie von Google zur Steuerung der erweiterten Script- und\nEreignisbehandlung.  \nDatenschutzerklärung |  https://policies.google.com/privacy?hl=de  \nCookie Name | _ga,_gat,_gid  \nCookie Laufzeit | 2 Jahre  \n  \nStatistiken (1)\n\nStatistiken\n\nStatistik Cookies erfassen Informationen anonym. Diese Informationen helfen\nuns zu verstehen, wie unsere Besucher unsere Website nutzen.\n\nCookie-Informationen anzeigen  Cookie-Informationen ausblenden\n\nAkzeptieren |  Google Analytics  \n---|---  \nName |  Google Analytics  \nAnbieter | Google Ireland Limited, Gordon House, Barrow Street, Dublin 4,\nIreland  \nZweck | Cookie von Google für Website-Analysen. Erzeugt statistische Daten\ndarüber, wie der Besucher die Website nutzt.  \nDatenschutzerklärung |  https://policies.google.com/privacy?hl=de  \nCookie Name | _ga,_gat,_gid  \nCookie Laufzeit | 2 Monate  \n  \nMarketing (2)\n\nMarketing\n\nMarketing-Cookies werden von Drittanbietern oder Publishern verwendet, um\npersonalisierte Werbung anzuzeigen. Sie tun dies, indem sie Besucher über\nWebsites hinweg verfolgen.\n\nCookie-Informationen anzeigen  Cookie-Informationen ausblenden\n\nAkzeptieren |  Google Ads  \n---|---  \nName |  Google Ads  \nAnbieter | Google Ireland Limited, Gordon House, Barrow Street, Dublin 4,\nIreland  \nZweck | Cookie von Google, das für das Conversion-Tracking von Google Ads\nverwendet wird.  \nDatenschutzerklärung |  https://policies.google.com/privacy?hl=de  \nAkzeptieren |  Mouseflow  \n---|---  \nName |  Mouseflow  \nAnbieter | Mouseflow Inc. 106 E 6th St #900. Austin TX, 78701, USA  \nZweck | Mouseflow ist ein Analysewerkzeug für das Benutzerverhalten von\nMouseflow Inc. Wir verwenden Mouseflow, um zu verstehen, wie Benutzer mit\nunserer Website interagieren.  \nDatenschutzerklärung |  https://mouseflow.com/legal/company/privacy-policy/  \nHost(s) | *.mouseflow.com  \nCookie Name | mf_[website-id], mf_user,  \nCookie Laufzeit | Sitzung / 1 Jahr  \n  \nExterne Medien (7)\n\nExterne Medien\n\nInhalte von Videoplattformen und Social-Media-Plattformen werden standardmäßig\nblockiert. Wenn Cookies von externen Medien akzeptiert werden, bedarf der\nZugriff auf diese Inhalte keiner manuellen Einwilligung mehr.\n\nCookie-Informationen anzeigen  Cookie-Informationen ausblenden\n\nAkzeptieren |  Facebook  \n---|---  \nName |  Facebook  \nAnbieter | Meta Platforms Ireland Limited, 4 Grand Canal Square, Dublin 2,\nIreland  \nZweck | Wird verwendet, um Facebook-Inhalte zu entsperren.  \nDatenschutzerklärung |  https://www.facebook.com/privacy/explanation  \nHost(s) | .facebook.com  \nAkzeptieren |  Google Maps  \n---|---  \nName |  Google Maps  \nAnbieter | Google Ireland Limited, Gordon House, Barrow Street, Dublin 4,\nIreland  \nZweck | Wird zum Entsperren von Google Maps-Inhalten verwendet.  \nDatenschutzerklärung |  https://policies.google.com/privacy  \nHost(s) | .google.com  \nCookie Name | NID  \nCookie Laufzeit | 6 Monate  \nAkzeptieren |  Instagram  \n---|---  \nName |  Instagram  \nAnbieter | Meta Platforms Ireland Limited, 4 Grand Canal Square, Dublin 2,\nIreland  \nZweck | Wird verwendet, um Instagram-Inhalte zu entsperren.  \nDatenschutzerklärung |  https://www.instagram.com/legal/privacy/  \nHost(s) | .instagram.com  \nCookie Name | pigeon_state  \nCookie Laufzeit | Sitzung  \nAkzeptieren |  OpenStreetMap  \n---|---  \nName |  OpenStreetMap  \nAnbieter | Openstreetmap Foundation, St John’s Innovation Centre, Cowley Road,\nCambridge CB4 0WS, United Kingdom  \nZweck | Wird verwendet, um OpenStreetMap-Inhalte zu entsperren.  \nDatenschutzerklärung |  https://wiki.osmfoundation.org/wiki/Privacy_Policy  \nHost(s) | .openstreetmap.org  \nCookie Name | _osm_location, _osm_session, _osm_totp_token, _osm_welcome,\n_pk_id., _pk_ref., _pk_ses., qos_token  \nCookie Laufzeit | 1-10 Jahre  \nAkzeptieren |  Twitter  \n---|---  \nName |  Twitter  \nAnbieter | Twitter International Company, One Cumberland Place, Fenian Street,\nDublin 2, D02 AX07, Ireland  \nZweck | Wird verwendet, um Twitter-Inhalte zu entsperren.  \nDatenschutzerklärung |  https://twitter.com/privacy  \nHost(s) | .twimg.com, .twitter.com  \nCookie Name | __widgetsettings, local_storage_support_test  \nCookie Laufzeit | Unbegrenzt  \nAkzeptieren |  Vimeo  \n---|---  \nName |  Vimeo  \nAnbieter | Vimeo Inc., 555 West 18th Street, New York, New York 10011, USA  \nZweck | Wird verwendet, um Vimeo-Inhalte zu entsperren.  \nDatenschutzerklärung |  https://vimeo.com/privacy  \nHost(s) | player.vimeo.com  \nCookie Name | vuid  \nCookie Laufzeit | 2 Jahre  \nAkzeptieren |  YouTube  \n---|---  \nName |  YouTube  \nAnbieter | Google Ireland Limited, Gordon House, Barrow Street, Dublin 4,\nIreland  \nZweck | Wird verwendet, um YouTube-Inhalte zu entsperren.  \nDatenschutzerklärung |  https://policies.google.com/privacy  \nHost(s) | google.com  \nCookie Name | NID  \nCookie Laufzeit | 6 Monate  \n  \nDatenschutzerklärung  Impressum\n\n"
}