{
    "summary": "Login\n\nUnternehmen\n\nKontakt\n\nDeutschland\n\nProdukte\n\nLösungen\n\nPreise\n\nWarum DataGuard\n\nRessourcen\n\nAngebot anfordern\n\n### Datenschutz-as-a-Service\n\n# Externer Datenschutz- beauftragter\n\n  * Geprüfter & zertifizierter DSGVO-Experte\n  * Branchenspezifische Datenschutzexpertise\n  * Persönliche und individuelle Beratung\n\nGeschäfts-E-Mail*\n\nGCLID\n\nProdukt\n\nMSCLKID\n\npartner_code\n\nReferral ID\n\nAds Conversion Tracking\n\nPreferred language\n\nAsset Group\n\nIndividual Asset\n\nCampaign Information\n\nKeyword\n\nDesired Certifications\n\nSie können der Verwendung Ihrer E-Mail-Adresse jederzeit widersprechen.\nWeitere Informationen finden Sie in unserer Datenschutzerklärung.\n\n  * Unterschied\n  * Preise\n  * Auswahl\n  * Aufgaben\n  * Datenpanne\n  * Vorteile\n\n### Was ist eigentlich ein externer Datenschutzbeauftragter?\n\nDer externe Datenschutzbeauftragte ist ein Datenschutzexperte, der nicht\ndirekt im Unternehmen arbeitet, sondern als externer Dienstleister\nhinzugezogen wird. Ein externer Datenschutzbeauftragter weist aufgrund seiner\nAusbildung und Erfahrung hohe Expertise im Datenschutzrecht auf und füllt die\nRolle des Datenschutzbeauftragten (DSB) vollumfänglich aus.\n\nDabei beraten externe Datenschutzbeauftragte die Geschäftsführung in\nallgemeinen Fragen des Datenschutzes und schulen alle Mitarbeiter. Weiterhin\nprüft der externe Datenschutzbeauftragte die technische und organisatorische\nUmsetzung des Datenschutzes im Unternehmen und führt die Kommunikation mit den\nzuständigen Datenschutzbehörden durch. Die Zusammenarbeit mit einem externen\nDatenschutzbeauftragten ist für gewöhnlich günstiger, effektiver und\neinfacher.\n\nLaut DSGVO Datenschutzgrundverordnung (DSGVO) und Bundesdatenschutzgesetz\n(BDSG) sind folgende Unternehmen **zur Bestellung eines DSB verpflichtet:**  \n\n  * Unternehmen, bei denen mindestens 20 Personen dauerhaft mit der Verarbeitung von personenbezogenen Daten beschäftigt sind\n  * Unternehmen, deren Kerntätigkeit die systematische Verarbeitung personenbezogener Daten ist\n  * Unternehmen, die besonders sensible personenbezogene Daten verarbeiten\n\nWeitere Informationen zum Aufgabenbereich eines externen\nDatenschutzbeauftragten, seinen Vorteilen und Tipps zur Zusammenarbeit finden\nSie in diesem Artikel.\n\nUm das gewünschte Video abspielen zu können, erklären Sie sich damit\neinverstanden, dass eine Verbindung zu den Servern von YouTube, LLC, 901\nCherry Ave., San Bruno, CA 94066, USA hergestellt wird. Damit werden\npersonenbezogene Daten (Geräte- und Browserinformationen (Insbesondere die IP-\nAdresse und das Betriebssystem) an den Betreiber des Portals zur\nNutzungsanalyse übermittelt.\n\nWeitere Informationen über den Umgang mit Ihren personenbezogenen Daten finden\nSie in unserer Datenschutzerklärung.\n\n\n\nVideo ansehen YouTube immer entsperren\n\n## Externer oder interner Datenschutzbeauftragter – Was ist der Unterschied?\n\nGrundsätzlich ist die Tätigkeiten eines Datenschutzbeauftragten, egal ob\nintern oder extern, die gleiche. Die wichtigsten Unterschiede beziehen sich\nauf die Faktoren  **Kosten, Stellung, Akzeptanz  **und **  Haftung**.\n\n**Kosten**\n\nIn der Regel ist die Zusammenarbeit mit einem externen DSB deutlich günstiger\nals eine interne Lösung. Die  **Kosten**  für einen externen\nDatenschutzbeauftragten beginnen, je nach Umfang der datenschutzrechtlichen\nAnforderungen, bereits bei **175  Euro** im Monat und sind klar planbar.\n\nDer interne Datenschutzbeauftragte hingegen verursacht neben seiner regulären\nVergütung auch Kosten für Aus- und Weiterbildung sowie mögliche Ausfallzeiten.\n\nKalkulieren Sie hier den Preis für Ihr Unternehmen und fordern Sie noch heute\nein individuelles Angebot an.\n\n**Stellung**\n\nEin interner DSB genießt einen besonderen Kündigungsschutz. Bei seiner\nBestellung muss zudem gewährleistet werden, dass kein Interessenskonflikt\nzwischen dem Amt des Datenschutzbeauftragten und sonstigen betrieblichen\nVerpflichtungen entsteht.\n\nDer externe Datenschutzberater kann  hingegen durch seine Unabhängigkeit\n**Neutralität** gewährleisten. Auch die Kündigung ist weitaus einfacher: Ein\nDienstleistungsvertrag regelt die Laufzeit der Zusammenarbeit.\n\n**Akzeptanz**\n\nAls zertifizierter Datenschutzexperte mit einschlägiger Ausbildung und hohem\nFachwissen genießt ein externer Datenschutzbeauftragter sehr hohe\n**Akzeptanz**  im Unternehmen. Eine Stellung, die für einen internen\nDatenschutzbeauftragten oft nicht erreichbar ist.\n\n**Haftung**\n\nWenn ein interner Datenschutzbeauftragter im Rahmen seiner Tätigkeit Fehler\nmacht, bleibt  das volle  **Haftungsrisiko**  in der Regel im Unternehmen und\nwird von der Geschäftsführung getragen. Ein externer Datenschutzbeauftragter\nübernimmt dagegen normalerweise einen Teil der Haftung und ist gegen mögliche\nSchäden versichert, insofern diese aus seiner Beratung hervorgehen. Das\nHaftungsrisiko für das Unternehmen sinkt also je nach Vertragsgestaltung\nerheblich.\n\nAngebot anfordern\n\n...und auch\n\nWir sind bereits externer Datenschutzbeauftragter für...\n\n...und auch\n\nWir sind bereits externer Datenschutzbeauftragter für...\n\n...und auch\n\n  * 1\n  * 2\n\n#### Das passende Leistungspaket für Ihre Bedürfnisse - ab 175 €/Monat*\n\n### Was kostet ein externer Datenschutzbeauftragter?\n\nMit welchen Kosten müssen Unternehmen bei der Bestellung eines externen\nDatenschutzbeauftragten rechnen?\n\nDie wesentlichen Faktoren, die die Kosten eines externen\nDatenschutzbeauftragten bestimmen sind:\n\n  * Die **Größe und/oder Branche** des jeweiligen Unternehmens.\n  * Der  **Umfang der Datenverarbeitung** , der ebenfalls maßgebend für die Kosten eines externen Datenschutzberaters ist. \n\nDie Kosten für einen externen Datenschutzbeauftragten beginnen bei etwa **175\nEuro pro Monat** , können aber je nach Umfang der relevanten Faktoren auch\nmehrere hundert oder tausend Euro betragen.\n\nDie Kosten für einen internen Datenschutzbeauftragten sind in der Regel\ndeutlich höher und werden unter anderem durch folgende Faktoren bestimmt:\n\n  * **Regelmäßige Aus- und Weiterbildung**\n  * Der **regelmäßige Lohn** für die ursprüngliche, als auch die Tätigkeit als interner DSB \n\nDa bei einem externen Datenschutzbeauftragten nur die Dienstleistungskosten zu\ntragen sind, sind die Kosten meist geringer und die Lösung effektiver als die\ninterne Variante. Zudem werden externe Lösungen oft als Paket zu monatlichen\nFestpreisen angeboten, was eine hohe Transparenz und Planbarkeit\ngewährleistet.\n\nEine detaillierte Aufschlüsslung der Kosten für einen internen vs. externen\nDSB nach Unternehmensgröße und Datenschutzanforderungen finden Sie in diesem\nArtikel.\n\n\"Ein wichtiger Punkt war das sehr transparente und strukturierte Preismodell.\nDie Kosten für eine externe Lösung mit DataGuard sind für ein\nmittelständisches Unternehmen, wie wir es sind, niedriger und wesentlich\nbesser kalkulierbar, als es der Aufbau geeigneter interner Ressourcen wäre.\"\n\nJason Ramadani, HR Business Partner, COMBERA GmbH\n\nGeschäfts-E-Mail*\n\nGCLID\n\nProdukt\n\nMSCLKID\n\npartner_code\n\nReferral ID\n\nAds Conversion Tracking\n\nPreferred language\n\nAsset Group\n\nIndividual Asset\n\nCampaign Information\n\nKeyword\n\nDesired Certifications\n\nSie können der Verwendung Ihrer E-Mail-Adresse jederzeit widersprechen.\nWeitere Informationen finden Sie in unserer Datenschutzerklärung.\n\n*Die Preise für Ihr Unternehmen hängen von der Größe Ihres Unternehmens und von der Komplexität Ihrer Datenschutzanforderungen ab. Zusätzlich fällt ein einmaliger Auditpreis an.\n\n### Worauf sollten Sie bei der Auswahl eines externen Datenschutzbeauftragten\nachten?\n\nAuf der Suche nach dem passenden externen Datenschutzbeauftragten gibt es ein\npaar Kriterien zu beachten:\n\n  * Hat der externe DSB eine entsprechende  **Ausbildung?**\n  * Kann er relevante  **Erfahrung**  vorweisen?\n  * Hat er bekannte  **Referenzen**  aus Ihrer Branche?\n  * Verfügt er über ein **großes, interdisziplinäres  Team** und kann so Kollegen zurate ziehen und ständige Verfügbarkeit garantieren? \n  * Hat er wichtige Soft-Skills wie gute **Kommunikation** und **interdisziplinäres Arbeiten**?\n  * Kann er ausgezeichnete und belegte Expertise durch **Zertifikate von TÜV, DEKRA oder der GDD** vorweisen?\n  * Sind die **Preise** des externen DSB **transparent** dargelegt und bietet er Pakete mit eindeutig definierten **Festpreisen** an?\n  * Verfügt er über **KI-basierte Tools** , die Prozesse automatisieren und so die Zusammenarbeit fördern?\n\nDies sind nur einige von vielen anderen Fragen die Sie sich stellen sollten\nbevor Sie sich für einen externen Datenschutzbeauftragten entscheiden. Unsere\nkostenlose Checkliste stellt Ihnen die Kriterien nochmal übersichtlich dar.\n\n####  Checkliste\n\n### So finden Sie den richtigen Partner - Checkliste (inkl. Download)\n\nKostenlos downloaden\n\n  * Angaben zur jeweiligen Rechtsgrundlage\n  * Beschreibungen der Dokumentation\n  * Erklärungen zur Art der Dokumentation\n\n### Welche Aufgaben übernimmt ein externer Datenschutzbeauftragter?\n\nDer Aufgabenbereich eines Datenschutzbeauftragten ist umfangreich und bringt\nviele Aufgaben und Pflichten mit sich. Die folgende Übersicht zeigt die\nKernaufgaben eines DSB:\n\n**  Kommunikation mit den Behörden**  \nDer externe Datenschutzbeauftragte arbeitet eng mit der entsprechenden\nAufsichtsbehörde zusammen und fungiert als Anlaufstelle für sämtliche Fragen,\ndie mit der Datenverarbeitung zusammenhängen.\n\n**  Maßnahmen bei einer Datenpanne**  \nIn allen datenschutzrechtlichen Belangen übernimmt der externe\nDatenschutzbeauftragte die Vertretung des Unternehmens nach außen. Bei\nDatenpannen berät er die Geschäftsführung bezüglich möglicher Maßnahmen. Liegt\nein meldepflichtiger Datenschutzverstoß vor, muss dieser innerhalb von 72\nStunden nach Bekanntwerden an die zuständige Datenschutzbehörde gemeldet\nwerden. Dies ist dann zwar nicht die Aufgabe des DSB sondern des\nVerantwortlichen, allerdings unterstützt der DSB und steht bei Rückfragen\njederzeit zur Verfügung.  \n\n**  Regelmäßige Mitarbeiterschulungen  \n** Der externe Datenschutzbeauftragte baut die Datenschutzorganisation im\nUnternehmen auf und informiert regelmäßig über aktuelle Vorschriften. Er\narbeitet eng mit den Beschäftigten zusammen, die personenbezogene Daten\nverarbeiten und sorgt in regelmäßigen Schulungen für den richtigen Umgang.  \n\n**  Überprüfung des Schutzniveaus  \n** Der externe Datenschutzbeauftragte überwacht alle Abläufe der\nDatenverarbeitung und sorgt dafür, dass entsprechende Datenschutzregularien\neingehalten werden.  \n\n**  Datenschutzdokumentation  \n**Die DSGVO fordert an verschiedenen Stellen die Erstellung von\nDokumentationen wie einer Datenschutz-Folgeabschätzung, der\nDatenschutzerklärung oder des Verzeichnisses von Verarbeitungstätigkeiten. Die\nErstellung und konstante Aktualisierung dieser Dokumente liegt ebenfalls im\nAufgabenbereich des DSB.\n\nÜber die verschiedenen Datenschutzmaßnahmen und ihre Dokumentation haben wir\nbereits einige Artikel geschrieben:\n\n  * Technische und organisatorische Maßnahmen (TOM)\n  * Verzeichnis von Verarbeitungstätigkeiten (VVT)\n  * Löschkonzept\n  * Auftragsverarbeitungsvertrag (AVV)\n  * Datenschutz-Folgenabschätzung\n  * Die wichtigsten Aufgaben eines Datenschutzbeauftragten\n\nEine Checkliste aller Datenschutzdokumente, die in der DSGVO Erwähnung finden,\nkönnen Sie hier herunterladen.\n\n## Externer Datenschutzbeauftragter-as-a-Service – Was ist das?\n\nWir bieten Ihnen „Datenschutz-as-a-Service“ an. Was bedeutet das?\n\n  * Unseren Service zeichnet das Zusammenspiel aus persönlicher Online-Beratung und unserer webbasierten Plattform aus.\n  * Unsere Datenschutz-Plattform dient als verlässliche Dokumentensammlung und vereint Bedarfsanalyse, Empfehlungen und Fortschrittsübersicht.\n  * Die intelligente Plattform entwickelt sich ständig weiter und automatisiert mühsame Routineaufgaben. \n\nNach einem virtuellen Datenschutzaudit mit branchenspezifischen Fragebögen\nerhalten Sie Ihre Datenschutzdokumentation und priorisierte\nHandlungsempfehlungen.\n\nDie durch die DSGVO verpflichtende Datenschutzschulung für alle Mitarbeiter\nbilden wir über unsere  **Academy**  ab. Die Academy ermöglicht interaktive\nSchulungen mit entsprechenden Teilnehmernachweisen für Ihre Mitarbeiter.  \n\nUnser Team vereint Experten aus sämtlichen Branchen und Fachbereichen. Dadurch\nkönnen wir Sie branchenspezifisch beraten und Ihnen einen persönlichen\nAnsprechpartner zur Seite stellen.\n\nAktuell betreuen wir über _3.000+_ Kunden aus 430 Städten und vereinen über\n150 Experten aus den Bereichen Recht, Wirtschaft & IT in unserem Team.\n\nIn einem unverbindlichen Erstgespräch beantworten wir Ihnen gerne alle Fragen\nrund um DataGuard und unseren Service. Vereinbaren Sie ein kostenloses\nErstgespräch und überzeugen Sie sich selbst.\n\nAngebot anfordern\n\n### Welche Datenpannen können im Unternehmen schnell auftreten?\n\nEine Datenpanne liegt dann vor, wenn personenbezogene Daten in den Zugriff von\nMenschen und Unternehmen geraten, die dazu keine Berechtigung haben und der\nSchutz der Daten somit nicht mehr gewährleistet ist. Datenpannen sind in jedem\nUnternehmen schnell möglich. Drei typische Fälle sind:\n\n####\n\n###\n\nOffene Mails\n\nNoch immer einer der typischen Fehler:  \nBei einer Rundmail oder einem Newsletter wird die Empfängerliste in CC\ngesetzt. Jeder Empfänger sieht alle Adressdaten. Jeder einzelne Empfänger wird\nso in seinen Rechten verletzt.\n\nPersonalausweiskopien\n\nEinige Unternehmen machen Kopien von Ausweisdokumenten,  \nzum Beispiel Autovermietungen. Sollten diese im Anschluss nicht fachgerecht\nentsorgt werden, sondern möglicherweise frei einsehbar für andere sein, liegt\neine grobe Datenpanne vor. Auch das offene Liegenlassen kann schon einen\nVerstoß bedeuten.\n\nDatenleck im Netz\n\nIT-Lücken machen es möglich: Ganze Datensätze, versehen mit Adressdaten oder\nZahlungsinformationen, sind öffentlich im Internet zugänglich. Eine\nDatenpanne, bei der die Anzahl von Geschädigten schnell ungeahnte Ausmaße\nannehmen kann.\n\n## Welche Folgen drohen nach einem Datenschutzverstoß?\n\nBei Datenschutzverstößen gegen die DSGVO werden je nach Umfang und\nSensibilität der betroffenen Daten erhebliche Bußgelder verhängt. Es drohen\nStrafzahlungen von bis zu 20 Millionen Euro oder von bis zur vier Prozent des\nweltweiten Jahresumsatzes aus dem Vorjahr. Als Bemessungsgrundlage für das\nBußgeld dient der höhere der beiden Werte. Mildernd berücksichtigt wird\nerfahrungsgemäß, wenn ein Unternehmen verantwortungsbewusst mit dem\nDatenschutzverstoß umgeht, zum Beispiel, indem es diesen umgehend meldet.  \n\n**Zuständigkeit**\n\nDie zuständigen Behörden berücksichtigen bei einer Datenpanne alle Umstände\nder Datenschutzverletzung, sodass die Bußgeldobergrenze nur in Ausnahmefällen\nerreicht wird. Dennoch sind Bußgelder im fünf- bis sechsstelligen Bereich\nkeine Seltenheit. Für jede Stadt gibt es eine zuständige Datenschutzbehörde\nund für jedes Bundesland einen Landesdatenschutzbeauftragten.\n\n**Haftung**\n\nFür eine Datenschutzverletzung haftet grundsätzlich der Verantwortliche. Bei\neinem internen Datenschutzbeauftragten ist die beschränkte Arbeitnehmerhaftung\nzu berücksichtigen, die bei einem externen Datenschutzbeauftragten nicht\ngreift.\n\nNeben den monetären Folgen einer Datenpanne führt das Bekanntwerden oft auch\nzu erheblichen Imageschäden und Vertrauensverlust bei Kunden.\n\n**Weitere Artikel zum Thema Datenschutzvertoß:  **\n\n  * Bußgelder und die DSGVO\n  * Reaktionsplan bei einer Datenpanne\n  * Beispiele und Meldepflichten von Datenschutzverstößen\n\n### Was sind die Vorteile eines externen Datenschutzbeauftragten?\n\nDie Zusammenarbeit mit einem externen Datenschutzbeauftragten bringt viele\nVorteile mit sich. Fachexpertise, Neutralität, Haftungsübernahme und planbare\nKosten überzeugen so manches Unternehmen.\n\n###  Stellung\n\nDie Bestellung eines externen Datenschutzbeauftragten ist die effektivste\nMöglichkeit, den rechtlichen Anforderungen gerecht zu werden. Eine hybride\nLösung aus einem remote arbeitenden Datenschutzberaten und einer Software\nbeginnt ab 175 € pro Monat – inkl. kompetenter fachlicher Beratung und der\ndamit einhergehenden Sicherheit.\n\n###  Ressourcenschonung\n\nBesonders für kleine Unternehmen ist es wichtig, die eigenen Mitarbeiter\nmöglichst wertschöpfend einzusetzen. Ein interner Datenschutzbeauftragter muss\nmehrere Stunden in der Woche für seine Arbeit als Datenschutzbeauftragter\naufbringen, während ein externer Datenschutzbeauftragter keiner internen\nPersonalressourcen bedarf.\n\n###  Kosten\n\nGrundsätzlich sind die Kosten für einen externen Datenschutzbeauftragten\nabhängig von Faktoren wie der Anzahl der Mitarbeiter und der Komplexität des\nGeschäftsmodells. Die Kosten für einen internen Datenschutzbeauftragten sind\nfür gewöhnlich deutlich höher als die Kosten für einen externen\nDatenschutzbeauftragten.\n\n###  Verfügbarkeit\n\nWie alle Mitarbeiter hat ein interner Datenschutzbeauftragter Urlaub,\nKrankheitstage und weitere betriebliche Verpflichtungen. Oft fehlt eine\nVertretung. Das kann besonders bei Datenpannen oder dringenden Fragen\nungemütlich werden. Ein externer Datenschutzbeauftragter ist hingegen immer\nverfügbar und Teil eines Teams, das allen datenschutzrechtlichen Anforderungen\ngerecht werden kann.\n\n###  Kündigungsschutz\n\nWährend interne Datenschutzbeauftragte einen umfangreichen Kündigungsschutz\ngenießen, ist die Zusammenarbeit mit einem externen Datenschutzbeauftragten\ndeutlich flexibler. Im Rahmen des Vertrages kann dieser entsprechend den\nfestgehaltenen Fristen gekündigt werden. Alternativ können Sie den Vertrag\neinfach auslaufen lassen.\n\n###  Neutralität\n\nDer Datenschutzbeauftragte darf nicht in Interessenskonflikte kommen. Interne\nDatenschutzbeauftragte haben weitere Aufgaben im Unternehmen, weshalb\ngrundsätzlich die Möglichkeit von Interessenskonflikten besteht. Ein externer\nDatenschutzbeauftragter kann hingegen eine dauerhafte neutrale Haltung\ngewährleisten und Interessenskonflikte somit ausschließen.\n\n###  Haftung\n\nBei dem Einsatz eines internen Datenschutzbeauftragten trägt die\nGeschäftsführung die volle Verantwortung für Verstöße gegen die DSGVO. Die\nLösung eines externen Datenschutzbeauftragten verringert das Haftungsrisiko\nfür Unternehmen, da dieser gegen Fehler aus seiner Beratung versichert ist.\n\n###  Fachwissen\n\nEin externer Datenschutzbeauftragter ist zertifizierter Experte für den\nDatenschutz und durch ständige Weiterbildungen immer am Puls der Zeit. Bei der\nWahl eines internen Datenschutzbeauftragten muss dieses Knowhow in zeit- und\nkostenintensiven Schulungen zunächst aufgebaut werden.\n\n###  Akzeptanz\n\nEin externer Datenschutzbeauftragter erfährt bei den eigenen Mitarbeitern als\naußenstehender und unabhängiger Experte in der Regel mehr Vertrauen und eine\nhöhere Akzeptanz als ein interner Datenschutzbeauftragter.\n\n### Ihre Journey mit DataGuard\n\n  * Schritt 1\n  * Schritt 2\n  * Schritt 3\n  * Schritt 4\n  * Schritt 5\n  * Schritt 6\n  * Schritt 7\n\n#### Erste Fragen & Kennenlernen\n\nIn einem unverbindlichen Telefonat beantworten wir all Ihre Fragen rund um\nDataGuard und unseren Service. Rufen Sie uns einfach an oder klicken Sie auf\nden roten Button „Angebot erhalten“ überall auf der Website.\n\nAngebot anfordern\n\n#### Ermittlung Ihres Bedarfs\n\nEin Experte stellt Ihnen in einem nächsten Telefonat gezielte Fragen zu Ihrem\nUnternehmen und zu Ihren Prozessen. So können wir Ihnen ein individuelles und\nmaßgeschneidertes Angebot vorbereiten.\n\nAngebot anfordern\n\n#### Ihr betreuendes Team\n\nIst das Angebot unterschrieben, lernen Sie Ihre persönliche Ansprechperson und\nweitere Experten unseres Teams kennen. Diese werden Sie über unsere gesamte\nPartnerschaft hinweg fach- und bedarfsgerecht betreuen.\n\nAngebot anfordern\n\n#### Virtuelles Datenschutzaudit\n\nIm nächsten Schritt erhalten Sie Zugang zu unserer Datenschutz-Plattform – und\ndamit zu branchenspezifischen Fragebögen. Haben Sie diese beantwortet, geht\nIhr betreuendes Team die Antworten gemeinsam mit Ihnen durch.\n\nAngebot anfordern\n\n#### Ihre Datenschutzdokumentation\n\nNach Ermittlung des Datenschutzstatus Ihres Unternehmens erhalten Sie nach\neiner fachgerechten Bewertung Ihre gesamte gesetzlich verpflichtende\nDatenschutzdokumentation, inklusive Verzeichnis von Verarbeitungstätigkeiten\n(VVT) – jederzeit in der Plattform abrufbar.\n\nAngebot anfordern\n\n#### Priorisierte Handlungsempfehlungen\n\nDer Ist-Zustand ist dokumentiert – jetzt gilt es, den datenschutzrechtlichen\nSoll-Zustand zu erreichen. Dazu erhalten Sie priorisierte und klar\nverständliche Handlungsempfehlungen. Ihr betreuendes Team unterstützt Sie\nselbstverständlich bei der Umsetzung.\n\nAngebot anfordern\n\n#### Datenschutzkonform bleiben\n\nWir informieren Sie regelmäßig über relevante Gesetzesänderungen, unterstützen\nSie bei der Erstellung und Prüfung von Auftragsverarbeitungsverträgen (AVV)\nund sorgen dafür, dass Sie auch bei sich ändernden Prozessen und Strukturen\ndatenschutzkonform bleiben.\n\nAngebot anfordern\n\n### Kundenstimmen\n\n„Starke Datenschutzpraktiken sind für ein Unternehmen ein gewichtiges\nArgument. Das Thema wird sehr ernst genommen. Und wenn es den Kunden am Herzen\nliegt, dann müssen sich auch die Unternehmen darum kümmern.\"\n\n„DataGuard hat uns nicht nur bei der konzernweiten Umsetzung der DSGVO\nunterstützt, sondern steht uns als externer Datenschutzbeauftragter tagtäglich\nmit Rat und Tat zur Verfügung. Dank unserer vertrauensvollen Zusammenarbeit\nfühlen wir uns umfassend betreut und im Hinblick auf die Anforderungen des\nDatenschutzes sehr gut aufgehoben.\"\n\n„Was bei DataGuard wirklich den Unterschied macht, ist das Team aus\nbranchenspezifischen Datenschutz- spezialisten. Sie sagen uns nicht nur, wie\nwir bestimmte Prozesse umsetzen sollen, sondern auch, warum sie so umgesetzt\nwerden müssen – ein immenser Mehrwert für mein Team, das so für das Thema\nDatenschutz sensibilisiert wird.“\n\n#### Wir sind für Sie da als\n\n### Ihr externer DSB für Ihre Stadt\n\n  * Datenschutz für Berlin\n  * Datenschutz für Brandenburg\n  * Datenschutz für Braunschweig\n  * Datenschutz für Bremen\n  * Datenschutz für Dortmund\n  * Datenschutz für Düsseldorf\n  * Datenschutz für Frankfurt\n  * Datenschutz für Hamburg\n  * Datenschutz für Hannover\n  * Datenschutz für Hilden\n  * Datenschutz für Köln\n  * Datenschutz für Mönchengladbach\n  * Datenschutz für München\n  * Datenschutz für Münster\n  * Datenschutz für Stuttgart\n  * Datenschutz für Essen\n  * Datenschutz für Dresden\n  * Datenschutz für Leipzig\n\n## Darum sind wir der richtige Partner für Sie in Sachen Datenschutz\n\n### Zertifizierte Branchenexperten\n\nWir glauben an die Vorteile von digitaler Technologie. Wir wissen aber auch,\ndass besonders im Compliance-Bereich eine persönliche, pragmatische und\nbedarfsgerechte Betreuung unersetzbar ist.\n\nDeshalb profitieren Sie bei uns nicht nur von einer Web-Plattform, sondern\nauch von der Kompetenz von über 100 branchenspezifischen Experten – gebündelt\ndurch Ihren persönlichen Ansprechpartner. Individuell und auf Augenhöhe.\n\nAngebot anfordern\n\nMag. iur. Dzevad Mujezinovic, CIPP/EPrincipal Consultant Privacy\n\n**Jurist**\n\nCIPP/E (IAPP), Datenschutzbeauftragter (ISO/IEC17024), ITIL® 4 Foundation\n\n**Karriere**\n\n  * Berater/Manager im Bereich IT Advisory (Datenschutzrecht) sowie Datenschutzbeauftragter der KPMG Gruppe in Österreich\n  * Rechtsanwaltsanwärter/Associate im Bereich IP/IT/Datenschutzrecht bei Taylor Wessing e|n|w|c Natlacen Walderdorff Cancola Rechtsanwälte GmbH Wien  \n\n  * Gerichtspraxis am Oberlandesgericht Wien\n  * Juristischer Mitarbeiter bei Schmelz Rechtsanwälte GesbR\n  * Geschäftsführer bei LGP Legal Solution EWIV in Wien\n  * Juristischer Mitarbeiter bei Lansky, Ganzger + partner Rechtsanwälte GmbH in Wien\n\nOnur TurhanPrivacy Consultant\n\n**Wirtschaftsjurist**\n\nDatenschutzbeauftragter (TÜV)\n\n**Karriere**\n\n  * Privacy Consultant bei der DataCo GmbH\n  * Werkstudent & Praktikant im Bereich Legal & Privacy bei der Egoditor GmbH\n  * Praktikant als Wirtschaftsjurist bei der crea union GmbH – Schwerpunkt: Vertrags- und IT-Recht\n\nStefan KrstevskiConsultant Tech Practice\n\n**Informatiker**\n\nIT- & Informationssicherheit\n\n**Karriere**\n\n  * IT-Techniker\n  * IT-Support\n\nBen Daley-GageSenior Privacy Consultant\n\n**Jurist für UK & EU Datenschutz**\n\nCIPP/E (IAPP), CIPM (IAPP), CIPT (IAPP), Certified Practitioner in Data\nProtection (BCS)\n\n**Karriere**\n\n  * Data Protection Officer bei Homes England\n  * Senior Associate – Data Protection bei PwC UK\n  * Information Compliance Manager bei King’s College London\n  * Senior Disclosure Specialist bei MoJ (UK)\n\nIana GaytandjievaSenior Privacy Consultant\n\n**Juristin für internationalen Datenschutz**\n\nFIP (IAPP), CIPM (IAPP), CIPP/E (IAPP)\n\n**Karriere**\n\n  * Lead Privacy Analyst, Manager / Americas & Caribbean bei OneTrust DataGuidance (London, UK)\n  * Rechercheassistentin im Center for the Study of Democracy (Sofia, Bulgarien)\n  * Mitarbeiterin bei der National Commission for Combating Trafficking in Human Beings (Sofia, Bulgarien)\n\nTim-Marlon MaixnerConsultant Tech Practice\n\n**Rechtswissenschaftler**\n\n**Karriere**  \n\n  * Verwaltung im Bundesministerium für Inneres (NIS-Abteilung)\n  * Freelance Consultant bei FundConsult GmbH\n  * Juristische Aushilfe bei RA Mag. iur. Jürgen Stephan Mertens\n\nStefanie BroxSenior Privacy Consultant\n\n**Volljuristin**\n\n**Karriere**  \n\n  * Mehrjährige Erfahrung als Inhouse Legal Counsel (EMEA) in der Software- und Telekommunikationsbranche\n  * Beratung von internationalen Unternehmen im Bereich Datenschutz und IT-Recht\n  * Inhouse Compliance Trainings\n\nRené SchneiderSenior Privacy Consultant\n\n**Compliance Officer**\n\nDatenschutzbeauftragter (TÜV),  \nCIPP/E (IAPP)\n\n**Karriere**\n\n  * Legal Director & Senior IP Counsel bei Cognizant\n  * Head of Legal European Research Center bei Huawei\n  * Legal Counsel IP, Public & EU Projects bei Fraunhofer Gesellschaft\n  * Legal Counsel bei HSE24 und E-Plus\n\nMarijam DarakhshanTeam Lead Privacy (SMB)\n\n**Volljuristin**\n\nDatenschutzbeauftragte (TÜV)\n\n**Karriere**\n\n  * Senior Legal Consultant/Senior Privacy Tech Manager\n  * Rechtsanwältin für Datenschutz- und IT-Recht bei KINAST Rechtsanwälte\n  * Vorträge und Schulungen zum Thema Datenschutz im Unternehmen\n  * Zuständigkeit für die juristische und datenschutzrechtliche Weiterentwicklung einer Legal-Tech-Datenschutzsoftwarelösung \n  * Rechtsanwältin für Wirtschaftsstrafrecht und Verwaltungsrecht \n\nDr. iur. Frank SchemmelSenior Director International Privacy & Compliance\n\n**Promovierter Wirtschaftsjurist**\n\nDatenschutzbeauftragter (TÜV),  \nCIPP/E & CIPM (IAPP)\n\n**KARRIERE**\n\n  * Datenschutzspezialist und Legal Project Manager bei Allen & Overy LLP\n  * Experte für Arbeitsrecht bei Gleiss Lutz Hootz Hirsch\n  * Regelmäßige Dozenten-/Vortragstätigkeiten sowie Veröffentlichungen zum Thema Datenschutz und Compliance \n\nAnder Lozano ZuritaPrivacy Consultant\n\n**Jurist / LL. B.**\n\nCertified Information Privacy Professional/Europe (CIPP/E)\n\n**Karriere**\n\n  * Anwalt für Legal Tech, Unternehmens- und Finanzrecht, Beratung internationaler Klienten bei Kuri Breña, Sánchez Ugarte y Aznar, S.C. in Mexiko-Stadt (Mexiko)\n  * Rechtsanwaltfachangestellter mit Fokus auf Versicherungsrecht bei der internationalen Anwaltskanzlei Hayaux & Goebel, S.C. in Mexiko-Stadt (Mexiko)\n  * Beratung internationaler Unternehmen zu allen Datenschutzthemen\n  * Recherche und Analyse zu internationalen Datenschutzgesetzen im Kontext internationaler Expansionen\n\nKyle TackleyTeam Lead - UK Tech and Privacy Practice\n\n**Experte für Datenschutz & Informationssicherheit**\n\nCertified GDPR Practitioner (IBITGQ), CIPP/E (IAPP)\n\n**Karriere**\n\n  * Senior Privacy Consultant bei DataGuard\n  * Globaler Datenschutzbeauftragter bei Alert Logic Inc.\n  * Globaler Datenschutzbeauftragter bei PCM/Insight Enterprises\n  * Erarbeitung, Einführung und Überwachung von Datenschutzprogrammen in internationalen Großunternehmen\n  * Einführung von Sicherheits- und Datenschutz-Managementsystemen (gemäß ISO 27001 und ISO 27701) in Großunternehmen\n\nDr. Patrick SchweisthalSenior Legal Counsel\n\n**Volljurist**\n\nDatenschutzbeauftragter (TÜV)\n\n**KARRIERE**\n\n  * 25 Jahre Erfahrung als Rechtsanwalt in eigener Kanzlei \n  * Datenschutzrechtliche Betreuung von Industrie- und Konzernkunden\n  * Experte für Datenschutz im öffentlichen Bereich \n  * Aufsichtsratsmitglied bei Phoenix Solar AG\n  * Rechtsanwalt bei Hottner, Zollner & Partner Steuerberatungsgesellschaft und bei Deutsche Allgemeine Treuhand AG Wirtschaftsprüfungsgesellschaft\n\nBoris OtterbachSenior Principal Privacy\n\n**Jurist**\n\nDatenschutzbeauftragter (TÜV)\n\n**Karriere**\n\n  * Principal Privacy Consultant (KMU) bei DataGuard\n  * Privacy Consultant bei DataGuard\n  * Maßgebliche Mitentwicklung der DataGuard-Plattform (insbesondere Audit-Prozess)\n  * Beratung von kleinen und mittleren Unternehmen zu allen Fragen des Datenschutzes\n  * Juristische Beratung zur datenschutzkonformen Softwareentwicklung\n  * Kundenberater bei einem großen Finanzdienstleister\n\nKathrin RiezHead of Privacy (Corporate)\n\n**Juristin**\n\nZertifizierte Datenschutzbeauftragte\n\n**Karriere**\n\n  * Senior Legal Manager bei The Boston Consulting Group\n  * Corporate Counsel/Group Data Protection Officer bei Sanrio Co. Ltd.\n\nMalte RoweSenior Privacy Consultant\n\n**Business Specialist**\n\nDatenschutzbeauftragter (TÜV), IT-Grundschutzpraktiker (BSI)\n\n**Karriere**\n\n  * Data Protection Manager bei flaschenpost SE\n  * Data Protection Manager bei Durstexpress KG\n  * Datenschutzberater bei Lohn24 Datenschutzgesellschaft mbH\n\nDr. Hans-Georg SchaeferSenior Privacy Consultant\n\n**Volljurist**\n\nExperte für Datenschutzrecht\n\n**Karriere**\n\n  * General Legal Counsel bei Unit4 mit Schwerpunkt Datenschutz und IT-Recht \n  * Rechtsanwalt und Partner bei Weitnauer Rechtsanwälte \n  * Rechtsanwalt bei Freshfields Bruckhaus Deringer LLP \n  * Rechtsreferendariat bei Clifford Chance\n  * Rechtsreferendariat beim Oberlandesgericht München \n\n#### Finden Sie die Preise für Ihre Branche heraus\n\n### Fordern Sie noch heute Ihr Angebot an\n\nAnrede*\n\nBitte auswählenHerrFrau\n\nHerr\n\nFrau\n\nVorname*\n\nNachname*\n\nGeschäfts-E-Mail*\n\nTelefon\n\nUnternehmen*\n\nUnternehmensgröße*\n\nBitte auswählen0-2021-250251-500501-20002001-10000>10000\n\n0-20\n\n21-250\n\n251-500\n\n501-2000\n\n2001-10000\n\n>10000\n\nBranche*\n\nBitte auswählenTechHotelHRLegal Rechtsanwälte NotareAndere\nUnternehmensdiensleistungenAutomobilIndustrie & FertigungBildung, Kunst &\nKulturGesundheitÖffentlichSteuern / Buchhaltungsunternehmen/HandelMarketing,\nWerbung, PRGastronomieFinanzenImmobilien & BauManagement\nBeratungVereineMedienLogistik / SpeditionenKirchen\n\nTech\n\nHotel\n\nHR\n\nLegal Rechtsanwälte Notare\n\nAndere Unternehmensdiensleistungen\n\nAutomobil\n\nIndustrie & Fertigung\n\nBildung, Kunst & Kultur\n\nGesundheit\n\nÖffentlich\n\nSteuern / Buchhaltungsunternehmen/\n\nHandel\n\nMarketing, Werbung, PR\n\nGastronomie\n\nFinanzen\n\nImmobilien & Bau\n\nManagement Beratung\n\nVereine\n\nMedien\n\nLogistik / Speditionen\n\nKirchen\n\nWoher kennen Sie uns?*\n\nProdukt\n\nGewünschtes Produkt*\n\nBitte auswählenISO 27001Beratung zu TISAX®DatenschutzConsent & Preference\nManagementWhistleblowingNIS2\n\nISO 27001\n\nBeratung zu TISAX®\n\nDatenschutz\n\nConsent & Preference Management\n\nWhistleblowing\n\nNIS2\n\nGibt es etwas Bestimmtes, das Sie während der Demo besprechen möchten?\n\nPrice\n\nCNS Score\n\nINS Score\n\nPricing Bundle\n\nProduct ID\n\nPricing Questions\n\nNumber of Employees\n\nGCLID\n\nMSCLKID\n\nReferral ID\n\nAds Conversion Tracking\n\nPreferred language\n\nAsset Group\n\nIndividual Asset\n\nCampaign Information\n\nKeyword\n\nDesired Certifications\n\nInformationen zur Verwendung und zum Widerspruch Ihrer personenbezogenen Daten\nfinden Sie in unserer Datenschutzerklärung.\n\n#### Verpassen Sie nicht die folgenden Themen:\n\n### Das DataGuard Magazin\n\n### Social-Engineering-Angriffen vorbeugen: 3 Strategien für IT-Leader\n\nMehr lesen\n\n### Selbstbewusste Kommunikation für IT-Führungskräfte\n\nMehr lesen\n\n### Leitfaden für IT-Führungskräfte: KPIs für das Risikomanagement\n\nMehr lesen\n\n### Leitfaden für IT-Leader: Eine effiziente IT-Kadenz operationalisieren\n\nMehr lesen\n\n### Vorsicht bei E-Mail-Betrug: Phishing erkennen & vermeiden\n\nMehr lesen\n\n### Das EU-KI-Gesetz kommt einen Schritt näher: Eine entscheidende Einigung\nerzielt\n\nMehr lesen\n\n### 4 Zukunfts-Strategien für die Informationssicherheit 2024\n\nMehr lesen\n\n### Neue EuGH-Urteile zum Datenschutz: Was Unternehmen wissen müssen\n\nMehr lesen\n\nTISAX® ist eine eingetragene Marke der ENX Association. DataGuard steht in\nkeiner geschäftlichen Verbindung zu ENX. Wir bieten lediglich Beratung und\nUnterstützung zur Vorbereitung auf das Assessment nach TISAX® an. Die ENX\nAssociation übernimmt keine Verantwortung für die auf der DataGuard-Website\ndargestellten Inhalte.\n\nAlle Angaben dienen lediglich der Information und beruhen auf internen\nSchätzungen. Diese Informationen sind kein Indikator für KPIs und werden ohne\nausdrückliche oder stillschweigende Zusicherungen oder Garantien in Bezug auf\nGenauigkeit und Zuverlässigkeit gegeben.\n\n\n\n## Wie können wir helfen?Kontaktieren Sie uns.\n\n### Frameworks\n\n  * DSGVO\n  * ISO 27001\n  * TISAX®\n  * NIS2\n  * Whistleblowing\n  * Consent & Preference Management\n\n### Solutions\n\n  * DataGuard für KMUs\n  * DataGuard für Großunternehmen\n  * Externer Datenschutzbeauftragter\n  * Datenschutz Beratung\n  * ISO 27001 Beratung\n  * Beratung für Tisax®\n  * Platform für Datenschutz\n  * Platform für Informationssicherheit\n\n### Preise\n\n  * Datenschutz-as-a-Service\n  * Informationssicherheit-as-a-Service\n\n### Warum DataGuard\n\n  * Unsere Kunden\n  * Customer Advisory Board\n\n### Ressourcen\n\n  * Alle Ressourcen\n  * E-Books, Guides & Checklisten\n  * Webinare & Videos\n  * Blog\n  * Glossar\n\n### Company\n\n  * Über uns\n  * Presse\n  * EPIC\n  * Karriere\n\n  * Datenschutzerklärung\n  * Impressum\n  * AGB\n\nDeutsch\n\nTISAX® ist eine eingetragene Marke der ENX Association. DataGuard steht in\nkeiner geschäftlichen Verbindung zu ENX. Wir bieten lediglich Beratung und\nUnterstützung zur Vorbereitung auf das Assessment nach TISAX® an. Die ENX\nAssociation übernimmt keine Verantwortung für die auf der DataGuard-Website\ndargestellten Inhalte.\n\nAlle Angaben dienen lediglich der Information und beruhen auf internen\nSchätzungen. Diese Informationen sind kein Indikator für KPIs und werden ohne\nausdrückliche oder stillschweigende Zusicherungen oder Garantien in Bezug auf\nGenauigkeit und Zuverlässigkeit gegeben.\n\n#### Sprechen Sie unser Sales-Team an\n\n### Erfahren Sie, wie DataGuard Ihnen helfen kann.\n\n**Finden Sie heraus, wie unsere Datenschutz-, Informationssicherheits- und\nCompliance-Lösung Vertrauen stärkt, Risiken minimiert und Umsatz steigert.**\n\n  * bis heute 100% Erfolgsquote bei ISO 27001 Audits\n  * 40% Reduzierung bei Gesamtbetriebskosten (TCO)\n  * Eine skalierbare und einfach zu verstehende Web-Plattform\n  * Praktisch umsetzbare Handlungsempfehlungen unserer Experten\n\n#### Vertrauen von mehr als _3.000+_ Kunden\n\n#### Lernen Sie DataGuard kennen\n\n### Fordern Sie noch heute Ihr Angebot an\n\n### Ihre Vorteile im Überblick\n\n  * Benennung eines  **externen Datenschutzbeauftragten**\n  * **Audit**  Ihrer Datenverarbeitungsvorgänge\n  * Unterstützung rund um  **AV-Verträge, VVT, TOM, Schulung,  **u.v.m.\n  * **Personalisierte Betreuung**  durch Ihren Ansprechpartner \n  * **Skalierbar**  für KMU und Konzerne\n  * **100+ Experten**  aus den Bereichen Recht, Wirtschaft & IT\n\n#### Vertrauen von mehr als _3.000+_ Kunden\n\n#### Lernen Sie DataGuard kennen\n\n### Vereinfachung Ihrer Compliance-Prozesse\n\n### Ihre Vorteile im Überblick\n\n  * Kontinuierliche Unterstützung auf Ihrem Weg zur Zertifizierung nach **ISO 27001** und **TISAX ®️**, sowie **NIS2 Compliance**\n  * Profitieren Sie von **persönlicher Beratung**\n  * Bauen Sie ein **strukturiertes ISMS** mit unserer InfoSec-Plattform auf \n  * **Automatische Erstellung** verpflichtender Dokumente \n\n100% Erfolgsquote unserer Kunden bei Audits nach ISO 27001\n\nTISAX® ist eine eingetragene Marke der ENX Association. DataGuard steht in\nkeiner geschäftlichen Verbindung zu ENX. Wir bieten lediglich Beratung und\nUnterstützung zur Vorbereitung auf das Assessment nach TISAX® an. Die ENX\nAssociation übernimmt keine Verantwortung für die auf der DataGuard-Website\ndargestellten Inhalte.\n\n#### Vertrauen von mehr als _3.000+_ Kunden\n\n#### Lernen Sie DataGuard kennen\n\n### Jetzt durchstarten\n\n  * **Datenschutzkonforme und transparente**  Einholung von Einwilligungen\n  * Konform mit  **DSGVO, CCPS, LGPD, ePrivacy**\n  * Langfristig  **wertvollere Daten**\n  * **Zentraler Überblick:  **Ihre Single Source of Truth\n  * **Persönlicher Support durch Experten  **bei jedem Schritt\n  * **Einfache Integration  **in alle Ihre Marketing-Tools und CRM\n\n#### Vertrauen von mehr als _3.000+_ Kunden\n\n#### Lernen Sie DataGuard kennen\n\n### Jetzt Angebot anfragen\n\n  * **Proaktive**  statt reaktive Unterstützung\n  * Erstellung der wichtigsten  **Dokumente und Richtlinien**\n  * Umfassendes  **Compliance-Management**\n  * **Mitarbeiterschulungen**\n  * **Digitales Compliance-Management-System**\n  * Beratung durch erfahrene  **Branchenexperten**\n\n#### Vertrauen von mehr als _3.000+_ Kunden\n\n#### Lernen Sie DataGuard kennen\n\n### Jetzt Angebot anfragen\n\n  * Einhalten der  **EU-Whistleblower-Richtlinie**\n  * **Digitales Whistleblowing-System**\n  * **Einfache und schnelle Implementierung**\n  * Zentrale Datenquelle\n  * **Sicher**  und gesetzeskonform\n  * Klares und transparentes  **Reporting**\n\n#### Vertrauen von mehr als _3.000+_ Kunden\n\n#### Jetzt Termin vereinbaren\n\nAnrede*\n\nBitte auswählenHerrFrau\n\nHerr\n\nFrau\n\nVorname*\n\nNachname*\n\nGeschäfts-E-Mail*\n\nTelefon\n\nUnternehmen*\n\nUnternehmensgröße*\n\nBitte auswählen0-2021-250251-500501-20002001-10000>10000\n\n0-20\n\n21-250\n\n251-500\n\n501-2000\n\n2001-10000\n\n>10000\n\nBranche*\n\nBitte auswählenTechHotelHRLegal Rechtsanwälte NotareAndere\nUnternehmensdiensleistungenAutomobilIndustrie & FertigungBildung, Kunst &\nKulturGesundheitÖffentlichSteuern / Buchhaltungsunternehmen/HandelMarketing,\nWerbung, PRGastronomieFinanzenImmobilien & BauManagement\nBeratungVereineMedienLogistik / SpeditionenKirchen\n\nTech\n\nHotel\n\nHR\n\nLegal Rechtsanwälte Notare\n\nAndere Unternehmensdiensleistungen\n\nAutomobil\n\nIndustrie & Fertigung\n\nBildung, Kunst & Kultur\n\nGesundheit\n\nÖffentlich\n\nSteuern / Buchhaltungsunternehmen/\n\nHandel\n\nMarketing, Werbung, PR\n\nGastronomie\n\nFinanzen\n\nImmobilien & Bau\n\nManagement Beratung\n\nVereine\n\nMedien\n\nLogistik / Speditionen\n\nKirchen\n\nWoher kennen Sie uns?*\n\nProdukt\n\nGewünschtes Produkt*\n\nBitte auswählenISO 27001Beratung zu TISAX®DatenschutzConsent & Preference\nManagementWhistleblowingNIS2\n\nISO 27001\n\nBeratung zu TISAX®\n\nDatenschutz\n\nConsent & Preference Management\n\nWhistleblowing\n\nNIS2\n\nGibt es etwas Bestimmtes, das Sie während der Demo besprechen möchten?\n\nPrice\n\nCNS Score\n\nINS Score\n\nPricing Bundle\n\nProduct ID\n\nPricing Questions\n\nNumber of Employees\n\nGCLID\n\nMSCLKID\n\nReferral ID\n\nAds Conversion Tracking\n\nPreferred language\n\nAsset Group\n\nIndividual Asset\n\nCampaign Information\n\nKeyword\n\nDesired Certifications\n\nInformationen zur Verwendung und zum Widerspruch Ihrer personenbezogenen Daten\nfinden Sie in unserer Datenschutzerklärung.\n\n",
    "links": "[{\"link\": \"https://www.dataguard.de/blog/externer-datenschutzbeauftragter-eine-uebersicht\", \"text\": \"Weitere Informationen zum Aufgabenbereich eines externen Datenschutzbeauftragten, seinen Vorteilen und Tipps zur Zusammenarbeit finden Sie in diesem Artikel.\"}, {\"link\": \"https://www.dataguard.de/datenschutzerklaerung#13-\", \"text\": \"Datenschutzerklärung\"}, {\"link\": \"https://www.dataguard.de/pricing-privacy\", \"text\": \"Kalkulieren Sie hier den \"}, {\"link\": \"https://www.dataguard.de/pricing-privacy\", \"text\": \"Preis\"}, {\"link\": \"https://www.dataguard.de/magazin/externer-datenschutzbeauftragter-kosten\", \"text\": \"Eine detaillierte Aufschlüsslung der Kosten für einen internen vs. externen DSB nach Unternehmensgröße und Datenschutzanforderungen finden Sie in diesem Artikel. \"}, {\"link\": \"https://www.dataguard.de/blog/technische-und-organisatorische-massnahmen\", \"text\": \"Technische und organisatorische Maßnahmen (TOM)\"}, {\"link\": \"https://www.dataguard.de/blog/verzeichnis-von-verarbeitungstaetigkeiten\", \"text\": \"Verzeichnis von Verarbeitungstätigkeiten (VVT)\"}, {\"link\": \"https://www.dataguard.de/blog/loeschkonzept-dsgvo\", \"text\": \"Löschkonzept\"}, {\"link\": \"https://www.dataguard.de/blog/die-auftragsverarbeitungsvertrag-avv\", \"text\": \"Auftragsverarbeitungsvertrag (AVV)\"}, {\"link\": \"https://www.dataguard.de/blog/datenschutz-folgenabschatzung\", \"text\": \"Datenschutz-Folgenabschätzung\"}, {\"link\": \"https://www.dataguard.de/blog/aufgaben-datenschutzbeauftragter\", \"text\": \"Die wichtigsten Aufgaben eines Datenschutzbeauftragten\"}, {\"link\": \"https://www.dataguard.de/wp/datenschutzdokumentation-checkliste\", \"text\": \"Eine Checkliste aller Datenschutzdokumente, die in der DSGVO Erwähnung finden, können Sie hier herunterladen.\"}, {\"link\": \"https://www.dataguard.de/blog/datenschutzverstoss\", \"text\": \"Bußgelder und die DSGVO\"}, {\"link\": \"https://www.dataguard.de/blog/datenpanne-reaktionsplan\", \"text\": \"Reaktionsplan bei einer Datenpanne\"}, {\"link\": \"https://www.dataguard.de/blog/beispiele-datenschutzverstoss-meldepflicht\", \"text\": \"Beispiele und Meldepflichten von Datenschutzverstößen\"}, {\"link\": \"https://www.dataguard.de/externer-datenschutzbeauftragter-berlin\", \"text\": \"\"}, {\"link\": \"https://www.dataguard.de/externer-datenschutzbeauftragter-brandenburg\", \"text\": \"\"}, {\"link\": \"https://www.dataguard.de/externer-datenschutzbeauftragter-braunschweig\", \"text\": \"\"}, {\"link\": \"https://www.dataguard.de/externer-datenschutzbeauftragter-bremen\", \"text\": \"\"}, {\"link\": \"https://www.dataguard.de/externer-datenschutzbeauftragter-dortmund\", \"text\": \"\"}, {\"link\": \"https://www.dataguard.de/externer-datenschutzbeauftragter-duesseldorf\", \"text\": \"\"}, {\"link\": \"https://www.dataguard.de/externer-datenschutzbeauftragter-frankfurt\", \"text\": \"\"}, {\"link\": \"https://www.dataguard.de/externer-datenschutzbeauftragter-hamburg\", \"text\": \"\"}, {\"link\": \"https://www.dataguard.de/externer-datenschutzbeauftragter-hannover\", \"text\": \"\"}, {\"link\": \"https://www.dataguard.de/externer-datenschutzbeauftragter-hilden\", \"text\": \"\"}, {\"link\": \"https://www.dataguard.de/externer-datenschutzbeauftragter-koeln\", \"text\": \"\"}, {\"link\": \"https://www.dataguard.de/externer-datenschutzbeauftragter-moenchengladbach\", \"text\": \"\"}, {\"link\": \"https://www.dataguard.de/externer-datenschutzbeauftragter-muenchen\", \"text\": \"\"}, {\"link\": \"https://www.dataguard.de/externer-datenschutzbeauftragter-muenster\", \"text\": \"\"}, {\"link\": \"https://www.dataguard.de/externer-datenschutzbeauftragter-stuttgart\", \"text\": \"\"}, {\"link\": \"https://www.dataguard.de/externer-datenschutzbeauftragter\", \"text\": \"Externer Datenschutzbeauftragter\"}]",
    "priceAndPlans": "Login\n\nUnternehmen\n\nKontakt\n\nDeutschland\n\nProdukte\n\nLösungen\n\nPreise\n\nWarum DataGuard\n\nRessourcen\n\nAngebot anfordern\n\nDatenschutz\n\n# Entdecken Sie unsere Preise\n\n* * *\n\nloading\n\n* * *\n\n## Warum kleine und große Unternehmen DataGuard vertrauen\n\n### 40%\n\nReduzieren Sie den manuellen Aufwand, der für die Einhaltung von Vorschriften\nerforderlich ist\n\n### 50%\n\nWir können die größten Risiken in Ihrem Unternehmen halbieren\n\n### 50%\n\nBis zu 50% günstiger als externe Berater\n\n* * *\n\n## Das sagen unsere Kunden\n\n„Ein wichtiger Punkt war das sehr transparente und strukturierte Preismodell.\nWir haben die Professional-Lösung gewählt. Diese deckt ein Spektrum ab, das\nfür einen einzelnen internen Datenschutzbeauftragten gar nicht zu leisten ist\n– weder in fachlicher noch in zeitlicher Hinsicht. Hinzu kommt, dass die\nKosten für eine externe Lösung mit DataGuard für ein mittelständisches\nUnternehmen, wie wir es sind, niedriger und wesentlich besser kalkulierbar\nsind, als es der Aufbau geeigneter interner Ressourcen wäre.“\n\n„Wir sind ein wichtiger Zulieferer für Automobilhersteller wie Audi und\nVolkswagen. Für diese Lieferverträge ist eine Zertifizierung nach TISAX®\ninzwischen unverzichtbar. DataGuard begleitete uns Schritt für Schritt durch\nden Prozess, sodass wir erfolgreich die beiden von uns gewünschten\nTISAX®-Label erhalten konnten – das Label ‘High’ für die\nInformationssicherheit sowie das Zusatzmodul ‘Prototypenschutz’.”  \n  \n  \n  \n\n„Unser ursprünglicher Information Security Officer wurde befördert und in eine\nandere Organisation versetzt – und das nur drei Monate vor unserer\nRezertifizierung nach ISO 27001. Unser internes Wissen war damit praktisch\nverschwunden. DataGuard brachte die entscheidende Wende. Sie übernahmen die\nRolle unseres internen Experten und halfen uns so, das Rezertifizierungs-Audit\nvöllig unbesorgt und erfolgreich zu bestehen.”  \n  \n  \n  \n\n„Die Qualität der Arbeit von DataGuard ist wirklich gut. Die Online-Plattform\nlässt sich einfach bedienen und die Implementierung war reibungslos. Unser\nHauptansprechpartner antwortet immer super schnell und es funktioniert immer\ngut, wenn wir Fragen haben. Aus meiner Sicht ist die Integration von DataGuard\nin unsere Arbeit nahtlos gewesen. Das war wirklich einfach. Das Verhältnis\nzwischen Kosten und Sorgenfreiheit ist sehr gut. Allein schon, sich nicht mehr\ndauernd Gedanken über Datenschutz machen zu müssen, ist den Preis wert.“\n\n* * *\n\n#### FAQs\n\n### Antworten auf Ihre Fragen\n\n####  Kann ich von DataGuard eine individuelle Beratung erhalten, um zu\nverstehen, wie Ihre Dienstleistungen auf die Bedürfnisse meines Unternehmens\nzugeschnitten werden können?\n\nUnser Ziel ist es, sicherzustellen, dass unsere Dienstleistungen nahtlos an\ndie spezifischen Bedürfnisse Ihres Unternehmens angepasst sind, indem wir\nIhnen eine leistungsstarke Plattform und das Fachwissen unserer Experten für\neine umfassende und maßgeschneiderte Compliance-Erfahrung zur Verfügung\nstellen. Unser Team wird eng mit Ihnen zusammenarbeiten, um Ihre Anforderungen\nzu verstehen und ein Paket (Light, Essential oder Professional) zu empfehlen,\ndas Ihren Geschäftszielen entspricht.\n\n####  Was sind die nächsten Schritte nach der Vertragsunterzeichnung mit\nDataGuard?\n\nNach der Vertragsunterzeichnung organisieren wir den offiziellen Projektstart.\nGemeinsam analysieren wir Ihre Datenschutzanforderungen und entwickeln Ihren\nindividuellen GDPR-Compliance-Plan. Darüber hinaus sorgen wir für einen\nreibungslosen Einstieg in die DataGuard-Privacy-Plattform. Unser Team\nübernimmt die Registrierung als Ihr externer Datenschutzbeauftragter (DSB) bei\nden Behörden, um eine nahtlose Compliance zu gewährleisten.\n\n####  Wann wird DataGuard mein bestellter externer Datenschutzbeauftragter?\n\nWir informieren Sie vor Vertragsbeginn über die Benennung der DataCo\nGmbH/DataCo International Limited als Ihren externen Datenschutzbeauftragten.\nDamit stellen wir sicher, dass wir vor dem offiziellen Vertragsbeginn bei den\nBehörden als Ihr bestellter externer Datenschutzbeauftragter registriert sind.\n\n####  Mit welchen Kosten muss ich rechnen? Gibt es versteckte Kosten?\n\nWir legen großen Wert auf die Transparenz unserer Dienstleistungskosten. Im\nGegensatz zu anderen Anbietern, die möglicherweise versteckte Gebühren für\nDienstleistungen wie Unterstützung bei Datenschutzverletzungen,\nExpertenunterstützung oder Awareness-Schulungen erheben, legen wir Wert auf\nvöllige Klarheit. Unser Preismodell ist so gestaltet, dass alle potenziellen\nKosten, einschließlich der Kosten für einen DSB, vollständig und transparent\ndargestellt werden.\n\n####  Welcher Aufwand ist für mein Unternehmen erforderlich, um GDPR-konform\nzu werden?\n\nDas Erreichen der GDPR-Konformität ist ein fortlaufender Prozess und keine\neinmalige Aufgabe. Es ist ein kontinuierlicher Prozess, und die DataGuard-\nPlattform wurde entwickelt, um Ihren Erfolg zu unterstützen. Nachdem wir Ihren\nGDPR-Reifegrad und Ihren Datenschutzstatus durch unser Audit ermittelt haben,\nerhalten Sie Ihre Audit-fertigen Dokumente und wertvolle Empfehlungen, um\nidentifizierte Risiken anzugehen. Die Dauer des Auditprozesses variiert\ntypischerweise zwischen 3 und 6 Monaten und hängt hauptsächlich von der Größe\nIhres Unternehmens und Ihren internen Ressourcen ab, wie z.B. der\nVerfügbarkeit von geeignetem Personal zum Ausfüllen der Fragebögen.\n\n####  Wie viele Beratungsstunden benötigt mein Unternehmen typischerweise, um\nGDPR-konform zu werden?\n\nDie Anzahl der benötigten Beratungsstunden hängt vom Umfang des Projekts, den\norganisatorischen Anforderungen und der gewünschten Unterstützung ab.\nKontaktieren Sie unser Team noch heute, um Ihre Datenschutzanforderungen zu\nbesprechen.\n\n####  Kann ich Unterstützung bei der Meldung und Bearbeitung von\nDatenschutzverletzungen erhalten?\n\nWir helfen Ihnen dabei, die mit der Nichteinhaltung von Vorschriften\nverbundenen Risiken zu verringern, indem wir Ihnen einen Überblick über die\nbetroffenen Daten, ihre Verwendung, den Zugriff darauf und den Datenfluss\nverschaffen. Dies ermöglicht eine schnelle Identifizierung und Behandlung von\nDatenschutzvorfällen oder -verletzungen. Darüber hinaus unterstützen wir Sie\nbei der Entwicklung und Implementierung eines klar definierten Prozesses für\nden Umgang mit Datenschutzverletzungen in Ihrem Team.\n\n####  Welche Maßnahmen bietet DataGuard für Anträge auf Zugang zu\npersonenbezogenen Daten (DSARs)?\n\nDataGuard bietet einen effizienten Ansatz für die Bearbeitung von Anträgen auf\nZugang zu personenbezogenen Daten (Data Subject Access Requests, DSARs) über\nunsere Plattform. Unser Dashboard für Anfragen von betroffenen Personen\nsammelt alle DSARs an einem Ort und optimiert die Arbeitsabläufe, um eine\nschnelle Bearbeitung innerhalb der gesetzlichen Fristen zu gewährleisten.\n\n####  Bietet DataGuard GDPR-Schulungen für Mitarbeiterinnen und Mitarbeiter\nan?\n\nJa, über die DataGuard Academy, unsere interaktive Online-Lernplattform,\nbieten wir spezielle Schulungen zu Datenschutz, Informationssicherheit und\nCompliance an. Mitarbeiterinnen und Mitarbeiter können einfach auf die Kurse\nzugreifen, ihre Fortschritte verfolgen und nach Abschluss Zertifikate\nerhalten. Über eine Administratorfunktion können Sie den Lernfortschritt Ihrer\nMitarbeiter überwachen und Erinnerungen versenden.\n\n####  Wie stellt DataGuard die Einhaltung der sich ständig weiterentwickelnden\nGDPR-Anforderungen sicher?\n\nUnsere Compliance-Anwälte und -Prüfer aktualisieren die Plattform und die\nProzesse regelmäßig. Sie können sich darauf verlassen, dass wir uns um die\nAktualisierungen kümmern, damit Sie sich auf Ihr Geschäft konzentrieren\nkönnen. Darüber hinaus veröffentlichen wir regelmäßig Whitepaper und Dossiers\nzu aktuellen Compliance-Trends und Datenschutzbestimmungen wie dem AI Act und\npflegen einen News-Bereich auf unserer Plattform, um sicherzustellen, dass Sie\nZugang zu umfassenden und aktuellen Informationen haben.\n\n## Bereits _3.000+_ Unternehmen vertrauen uns\n\n#### Lesen Sie hier die Erfahrungen anderer Kunden\n\n### Weitere Success Stories\n\n“Wir hatten zwar einen Rechtsberater zum Thema DSGVO vor Ort. Doch in Bezug\nauf Deutschland gab es einige zusätzlichen Anforderungen und strengere\nVorgaben zu beachten. Dank DataGuard konnten wir...\n\nMehr lesen\n\n“Alle von uns veröffentlichten datenschutzrechtlich relevanten Inhalte sind\nheute auf dem neuesten Stand. Zudem überprüft DataGuard unsere\nDatenschutzsituation in der Zusammenarbeit mit Dritten und...\n\nMehr lesen\n\n“DataGuard hat uns aufgezeigt, wie Daten erfasst, gespeichert und genutzt\nwerden können. Als gemeinnütziges Unternehmen arbeiten wir mit vielen\npersonenbezogenen Daten – Namen, E-Mail-Adressen,...\n\nMehr lesen\n\n“Wenn Sie über zehn Mitarbeiter beschäftigen und Rücksicht auf sensible Daten\nnehmen müssen, könnten Sie dafür auf die altmodische Art einen Berater\nheranziehen. Oder Sie entscheiden sich für...\n\nMehr lesen\n\n„Sobald Sie aber in der Technologiebranche arbeiten, merken Sie: Das System\nist fragil. Die Daten unserer User sind höchst sensibel und wertvoll und\nmüssen entsprechend geschützt werden. Für Gründer...\n\nMehr lesen\n\n“Als wir anfingen, Verträge mit größeren Unternehmen abzuschließen, erkannten\nwir, dass der Datenschutz eine Schlüsselrolle bei der Wahrnehmung unserer\nMarke spielt. In den Unternehmen werden unsere...\n\nMehr lesen\n\n“Wir hatten zwar einiges an Know-How, aber haben jemanden gebraucht, der uns\ndurch den ganzen Prozess führt. Letztendlich ist das ISO-Zertifikat definitiv\nein Zuschlagskriterium für uns, ein USP....\n\nMehr lesen\n\n“Datenschutz stand von Anfang an auf unserer Agenda. Allerdings hatten wir als\nStartup zunächst niemanden, der sich prioritär darum hätte kümmern und das\nThema strukturiert angehen können. Deshalb...\n\nMehr lesen\n\n“Das Tool zur Erstellung von Datenschutzerklärungen auf der Plattform wird\nunseren Arbeitsaufwand enorm verringern. Und ich mache mir keine Sorgen über\ndie 2023 anstehenden Änderungen an den...\n\nMehr lesen\n\n“Wir wollen zum Beispiel jederzeit abrufen können, wie viele Mitarbeiter ihre\njährliche Datenschutzschulung bereits absolviert haben und wie viele noch\nnicht Dafür ist eine Plattformlösung ideal, sie...\n\nMehr lesen\n\n“E-Commerce ist ein Peoples' Business. Wir speichern personenbezogene Daten\nnicht nur, wir arbeiten damit. Umso wichtiger ist es für uns,\ndatenschutzrechtlich auf der sicheren Seite zu sein. Mit...\n\nMehr lesen\n\n“Dank der optisch ansprechenderen Oberfläche der Consentund Preference-\nManagement-Plattform von DataGuard erhalten unsere Mitarbeiter schnell und\neinfach einen Überblick über alle...\n\nMehr lesen\n\n“Wir arbeiten mit vielen vertraulichen Informationen, beispielsweise bei der\nErarbeitung von Sales Pitches für unsere Kunden oder bei der Synchronisierung\nvon Kundendaten im CRM-System. Dank der...\n\nMehr lesen\n\n“Die generelle Vorgehensweise von DataGuard hat uns einfach überzeugt. Wir\nwissen, dass wir durch die Zusammenarbeit viel Zeit sparen, am Ende sauber\ndokumentierte Prozesse und Maßnahmen haben und...\n\nMehr lesen\n\n“Starke Datenschutzpraktiken sind für ein Unternehmen ein gewichtiges\nArgument. Das Thema wird sehr ernst genommen. Und wenn es den Kunden am Herzen\nliegt, dann müssen sich auch die Unternehmen darum...\n\nMehr lesen\n\n“Die Unterstützung durch DataGuard als kompetenter Ansprechpartner und\nexternem Informations- sicherheitsbeauftragten vor und während unseres\nAssessments nach TISAX® war extrem hilfreich, gerade bei...\n\nMehr lesen\n\n“Es ist wunderbar, jemanden zu haben, dem ich meine Fragen schicken kann und\nder rasch antwortet. Ich muss mir weniger Sorgen um die Kosten machen als etwa\nmit einem Rechtsanwalt, dem ich schreiben...\n\nMehr lesen\n\n“Wir hatten zwar einen Rechtsberater zum Thema DSGVO vor Ort. Doch in Bezug\nauf Deutschland gab es einige zusätzlichen Anforderungen und strengere\nVorgaben zu beachten. Dank DataGuard konnten wir...\n\nMehr lesen\n\n“Alle von uns veröffentlichten datenschutzrechtlich relevanten Inhalte sind\nheute auf dem neuesten Stand. Zudem überprüft DataGuard unsere\nDatenschutzsituation in der Zusammenarbeit mit Dritten und...\n\nMehr lesen\n\n“DataGuard hat uns aufgezeigt, wie Daten erfasst, gespeichert und genutzt\nwerden können. Als gemeinnütziges Unternehmen arbeiten wir mit vielen\npersonenbezogenen Daten – Namen, E-Mail-Adressen,...\n\nMehr lesen\n\n“Wenn Sie über zehn Mitarbeiter beschäftigen und Rücksicht auf sensible Daten\nnehmen müssen, könnten Sie dafür auf die altmodische Art einen Berater\nheranziehen. Oder Sie entscheiden sich für...\n\nMehr lesen\n\n„Sobald Sie aber in der Technologiebranche arbeiten, merken Sie: Das System\nist fragil. Die Daten unserer User sind höchst sensibel und wertvoll und\nmüssen entsprechend geschützt werden. Für Gründer...\n\nMehr lesen\n\n“Als wir anfingen, Verträge mit größeren Unternehmen abzuschließen, erkannten\nwir, dass der Datenschutz eine Schlüsselrolle bei der Wahrnehmung unserer\nMarke spielt. In den Unternehmen werden unsere...\n\nMehr lesen\n\n“Wir hatten zwar einiges an Know-How, aber haben jemanden gebraucht, der uns\ndurch den ganzen Prozess führt. Letztendlich ist das ISO-Zertifikat definitiv\nein Zuschlagskriterium für uns, ein USP....\n\nMehr lesen\n\n“Datenschutz stand von Anfang an auf unserer Agenda. Allerdings hatten wir als\nStartup zunächst niemanden, der sich prioritär darum hätte kümmern und das\nThema strukturiert angehen können. Deshalb...\n\nMehr lesen\n\n“Das Tool zur Erstellung von Datenschutzerklärungen auf der Plattform wird\nunseren Arbeitsaufwand enorm verringern. Und ich mache mir keine Sorgen über\ndie 2023 anstehenden Änderungen an den...\n\nMehr lesen\n\n“Wir wollen zum Beispiel jederzeit abrufen können, wie viele Mitarbeiter ihre\njährliche Datenschutzschulung bereits absolviert haben und wie viele noch\nnicht Dafür ist eine Plattformlösung ideal, sie...\n\nMehr lesen\n\n“E-Commerce ist ein Peoples' Business. Wir speichern personenbezogene Daten\nnicht nur, wir arbeiten damit. Umso wichtiger ist es für uns,\ndatenschutzrechtlich auf der sicheren Seite zu sein. Mit...\n\nMehr lesen\n\n“Dank der optisch ansprechenderen Oberfläche der Consentund Preference-\nManagement-Plattform von DataGuard erhalten unsere Mitarbeiter schnell und\neinfach einen Überblick über alle...\n\nMehr lesen\n\n“Wir arbeiten mit vielen vertraulichen Informationen, beispielsweise bei der\nErarbeitung von Sales Pitches für unsere Kunden oder bei der Synchronisierung\nvon Kundendaten im CRM-System. Dank der...\n\nMehr lesen\n\n“Die generelle Vorgehensweise von DataGuard hat uns einfach überzeugt. Wir\nwissen, dass wir durch die Zusammenarbeit viel Zeit sparen, am Ende sauber\ndokumentierte Prozesse und Maßnahmen haben und...\n\nMehr lesen\n\n“Starke Datenschutzpraktiken sind für ein Unternehmen ein gewichtiges\nArgument. Das Thema wird sehr ernst genommen. Und wenn es den Kunden am Herzen\nliegt, dann müssen sich auch die Unternehmen darum...\n\nMehr lesen\n\n“Die Unterstützung durch DataGuard als kompetenter Ansprechpartner und\nexternem Informations- sicherheitsbeauftragten vor und während unseres\nAssessments nach TISAX® war extrem hilfreich, gerade bei...\n\nMehr lesen\n\n“Es ist wunderbar, jemanden zu haben, dem ich meine Fragen schicken kann und\nder rasch antwortet. Ich muss mir weniger Sorgen um die Kosten machen als etwa\nmit einem Rechtsanwalt, dem ich schreiben...\n\nMehr lesen\n\n“Wir hatten zwar einen Rechtsberater zum Thema DSGVO vor Ort. Doch in Bezug\nauf Deutschland gab es einige zusätzlichen Anforderungen und strengere\nVorgaben zu beachten. Dank DataGuard konnten wir...\n\nMehr lesen\n\n“Alle von uns veröffentlichten datenschutzrechtlich relevanten Inhalte sind\nheute auf dem neuesten Stand. Zudem überprüft DataGuard unsere\nDatenschutzsituation in der Zusammenarbeit mit Dritten und...\n\nMehr lesen\n\n“DataGuard hat uns aufgezeigt, wie Daten erfasst, gespeichert und genutzt\nwerden können. Als gemeinnütziges Unternehmen arbeiten wir mit vielen\npersonenbezogenen Daten – Namen, E-Mail-Adressen,...\n\nMehr lesen\n\n“Wenn Sie über zehn Mitarbeiter beschäftigen und Rücksicht auf sensible Daten\nnehmen müssen, könnten Sie dafür auf die altmodische Art einen Berater\nheranziehen. Oder Sie entscheiden sich für...\n\nMehr lesen\n\nDatenschutz und Informationssicherheit gehen Hand in Hand.\n\nEntdecken Sie InfoSec-as-a-Service\n\n## Wie können wir helfen?Kontaktieren Sie uns.\n\n### Frameworks\n\n  * DSGVO\n  * ISO 27001\n  * TISAX®\n  * NIS2\n  * Whistleblowing\n  * Consent & Preference Management\n\n### Solutions\n\n  * DataGuard für KMUs\n  * DataGuard für Großunternehmen\n  * Externer Datenschutzbeauftragter\n  * Datenschutz Beratung\n  * ISO 27001 Beratung\n  * Beratung für Tisax®\n  * Platform für Datenschutz\n  * Platform für Informationssicherheit\n\n### Preise\n\n  * Datenschutz-as-a-Service\n  * Informationssicherheit-as-a-Service\n\n### Warum DataGuard\n\n  * Unsere Kunden\n  * Customer Advisory Board\n\n### Ressourcen\n\n  * Alle Ressourcen\n  * E-Books, Guides & Checklisten\n  * Webinare & Videos\n  * Blog\n  * Glossar\n\n### Company\n\n  * Über uns\n  * Presse\n  * EPIC\n  * Karriere\n\n  * Datenschutzerklärung\n  * Impressum\n  * AGB\n\nDeutsch\n\nTISAX® ist eine eingetragene Marke der ENX Association. DataGuard steht in\nkeiner geschäftlichen Verbindung zu ENX. Wir bieten lediglich Beratung und\nUnterstützung zur Vorbereitung auf das Assessment nach TISAX® an. Die ENX\nAssociation übernimmt keine Verantwortung für die auf der DataGuard-Website\ndargestellten Inhalte.\n\nAlle Angaben dienen lediglich der Information und beruhen auf internen\nSchätzungen. Diese Informationen sind kein Indikator für KPIs und werden ohne\nausdrückliche oder stillschweigende Zusicherungen oder Garantien in Bezug auf\nGenauigkeit und Zuverlässigkeit gegeben.\n\n#### Sprechen Sie unser Sales-Team an\n\n### Erfahren Sie, wie DataGuard Ihnen helfen kann.\n\n**Finden Sie heraus, wie unsere Datenschutz-, Informationssicherheits- und\nCompliance-Lösung Vertrauen stärkt, Risiken minimiert und Umsatz steigert.**\n\n  * bis heute 100% Erfolgsquote bei ISO 27001 Audits\n  * 40% Reduzierung bei Gesamtbetriebskosten (TCO)\n  * Eine skalierbare und einfach zu verstehende Web-Plattform\n  * Praktisch umsetzbare Handlungsempfehlungen unserer Experten\n\n#### Vertrauen von mehr als _3.000+_ Kunden\n\n#### Lernen Sie DataGuard kennen\n\n### Fordern Sie noch heute Ihr Angebot an\n\n### Ihre Vorteile im Überblick\n\n  * Benennung eines  **externen Datenschutzbeauftragten**\n  * **Audit**  Ihrer Datenverarbeitungsvorgänge\n  * Unterstützung rund um  **AV-Verträge, VVT, TOM, Schulung,  **u.v.m.\n  * **Personalisierte Betreuung**  durch Ihren Ansprechpartner \n  * **Skalierbar**  für KMU und Konzerne\n  * **100+ Experten**  aus den Bereichen Recht, Wirtschaft & IT\n\n#### Vertrauen von mehr als _3.000+_ Kunden\n\n#### Lernen Sie DataGuard kennen\n\n### Vereinfachung Ihrer Compliance-Prozesse\n\n### Ihre Vorteile im Überblick\n\n  * Kontinuierliche Unterstützung auf Ihrem Weg zur Zertifizierung nach **ISO 27001** und **TISAX ®️**, sowie **NIS2 Compliance**\n  * Profitieren Sie von **persönlicher Beratung**\n  * Bauen Sie ein **strukturiertes ISMS** mit unserer InfoSec-Plattform auf \n  * **Automatische Erstellung** verpflichtender Dokumente \n\n100% Erfolgsquote unserer Kunden bei Audits nach ISO 27001\n\nTISAX® ist eine eingetragene Marke der ENX Association. DataGuard steht in\nkeiner geschäftlichen Verbindung zu ENX. Wir bieten lediglich Beratung und\nUnterstützung zur Vorbereitung auf das Assessment nach TISAX® an. Die ENX\nAssociation übernimmt keine Verantwortung für die auf der DataGuard-Website\ndargestellten Inhalte.\n\n#### Vertrauen von mehr als _3.000+_ Kunden\n\n#### Lernen Sie DataGuard kennen\n\n### Jetzt durchstarten\n\n  * **Datenschutzkonforme und transparente**  Einholung von Einwilligungen\n  * Konform mit  **DSGVO, CCPS, LGPD, ePrivacy**\n  * Langfristig  **wertvollere Daten**\n  * **Zentraler Überblick:  **Ihre Single Source of Truth\n  * **Persönlicher Support durch Experten  **bei jedem Schritt\n  * **Einfache Integration  **in alle Ihre Marketing-Tools und CRM\n\n#### Vertrauen von mehr als _3.000+_ Kunden\n\n#### Lernen Sie DataGuard kennen\n\n### Jetzt Angebot anfragen\n\n  * **Proaktive**  statt reaktive Unterstützung\n  * Erstellung der wichtigsten  **Dokumente und Richtlinien**\n  * Umfassendes  **Compliance-Management**\n  * **Mitarbeiterschulungen**\n  * **Digitales Compliance-Management-System**\n  * Beratung durch erfahrene  **Branchenexperten**\n\n#### Vertrauen von mehr als _3.000+_ Kunden\n\n#### Lernen Sie DataGuard kennen\n\n### Jetzt Angebot anfragen\n\n  * Einhalten der  **EU-Whistleblower-Richtlinie**\n  * **Digitales Whistleblowing-System**\n  * **Einfache und schnelle Implementierung**\n  * Zentrale Datenquelle\n  * **Sicher**  und gesetzeskonform\n  * Klares und transparentes  **Reporting**\n\n#### Vertrauen von mehr als _3.000+_ Kunden\n\n#### Jetzt Termin vereinbaren\n\nAnrede*\n\nBitte auswählenHerrFrau\n\nVorname*\n\nNachname*\n\nGeschäfts-E-Mail*\n\nTelefon\n\nUnternehmen*\n\nUnternehmensgröße*\n\nBitte auswählen0-2021-250251-500501-20002001-10000>10000\n\nBranche*\n\nBitte auswählenTechHotelHRLegal Rechtsanwälte NotareAndere\nUnternehmensdiensleistungenAutomobilIndustrie & FertigungBildung, Kunst &\nKulturGesundheitÖffentlichSteuern / Buchhaltungsunternehmen/HandelMarketing,\nWerbung, PRGastronomieFinanzenImmobilien & BauManagement\nBeratungVereineMedienLogistik / SpeditionenKirchen\n\nWoher kennen Sie uns?*\n\nProdukt\n\nGewünschtes Produkt*\n\nBitte auswählenISO 27001Beratung zu TISAX®DatenschutzConsent & Preference\nManagementWhistleblowingNIS2\n\nGibt es etwas Bestimmtes, das Sie während der Demo besprechen möchten?\n\nPrice\n\nCNS Score\n\nINS Score\n\nPricing Bundle\n\nProduct ID\n\nPricing Questions\n\nNumber of Employees\n\nGCLID\n\nMSCLKID\n\nReferral ID\n\nAds Conversion Tracking\n\nPreferred language\n\nAsset Group\n\nIndividual Asset\n\nCampaign Information\n\nKeyword\n\nDesired Certifications\n\nInformationen zur Verwendung und zum Widerspruch Ihrer personenbezogenen Daten\nfinden Sie in unserer Datenschutzerklärung.\n\n"
}