{
    "summary": "  * Datenschutz\n    * Externer Datenschutzbeauftragter\n    * Einzelberatung\n    * Informationssicherheit\n    * Qualitätsmanagement\n    * Prozessmanagement\n    * Whistleblowing\n  * Datenschutz-Schulungen\n    * Datenschutz-Schulungen\n    * Inhouse-Schulung\n    * E-Learning\n  * Über 180° Datenschutz\n    * Unser Unternehmen\n    * Termin vereinbaren\n    * Datenschutz-Siegel\n    * 180° Sicherheit\n    * 180° IT\n    * Karriere\n    * Blog\n  * \n\n _facebook_ __ __ __ __\n\n#  Externer Datenschutzbeauftragter nach DSGVO\n\n## Wir nehmen Ihren Datenschutz in die Hand\n\nZertifizierter Datenschutzbeauftragte\n\nEin externer Datenschutzbeauftragter hilft dabei, die rechtlichen\nAnforderungen umzusetzen und überwacht diese. So bleibt Ihr Unternehmen immer\nauf der sicheren Seite.\n\n°\n\nInterdisziplinäres Team\n\nUnsere Spezialisten aus den Bereichen Recht, IT, Wirtschafts- und\nGeisteswissenschaften beleuchten das Thema Datenschutz aus allen Perspektiven\nund ermöglichen die Lösung, die auch wirklich benötigt wird.\n\n°\n\nRundum Service\n\nProfitieren Sie von unserer ganzheitlichen Betrachtung des Datenschutzes in\nIhrem Unternehmen. Dafür arbeiten wir stets unter Einbeziehung aktueller\nVorgaben und Rechtsprechungen.\n\n### Zertifizierter Datenschutz aus Düsseldorf\n\nSpätestens seit Inkrafttreten der EU-Datenschutzgrundverordnung (DSGVO) ist\nklar: Datenschutz betrifft uns alle! Jeder, der täglich mit der Verarbeitung\npersonenbezogener Daten zu tun hat, muss sicherstellen, dass alles dafür getan\nwird, um diese Daten zu schützen. Unverständliche Formulierungen und\nunüberblickbare Anforderungen verlangen ein hohes Maß an Fachwissen. Nur\nwenige Betriebe haben die Ressourcen, um die Umsetzung eigenständig und dabei\nrechtssicher zu gewährleisten.\n\nEin externer Datenschutzbeauftragter hilft dabei, die rechtlichen\nAnforderungen umzusetzen und überwacht diese. So bleibt Ihr Unternehmen immer\nauf der sicheren Seite. Um für Sie die höchsten Qualitätsstandards als\nexterner Datenschutzbeauftragter zu erfüllen, bilden wir uns regelmäßig und\nstetig zu aktuellen Fachthemen fort. Unsere Mitarbeiter haben erfolgreich an\nden Schulungen der DEKRA oder der zuständigen Industrie- und Handelskammern\nteilgenommen. Von diesen hochwertigen Weiterbildungen profitieren vor allem\nunsere Kunden, denn dadurch kann eine besondere Güte in der Beratung zum\nDatenschutz gewährleistet werden.\n\nKontakt aufnehmen\n\nWir bieten Ihnen:\n\n180Daten_Datenschutz-Trainings\n\nExterne Datenschutzbeauftragte\n\n180Daten_Viele-Fragen\n\nEinzel- und Projektberatung\n\nInformationssicherheit\n\n180Daten_Zertifiziertes-Fachwissen\n\nQualitätsmanagement\n\n180Daten_Prozessoptimierung\n\nProzessmanagement\n\n180Daten_Pruefungsurkunde\n\nDatenschutz E-Learning\n\n180Daten_Zertifiziertes-Fachwissen\n\nInhouse-Schulungen\n\nWhistleblowing\n\n## 180° Datenschutz GmbH - Ihr externer Datenschutzbeauftragter\n\nSie möchten den Datenschutz in Ihrem Betrieb so sicher, so einfach und so\nangenehm wie möglich gestalten? Bleiben Sie mit 180° Datenschutz GmbH bei der\nDatenverarbeitung auf der sicheren Seite.\n\nWir begleiten Sie bei jedem Schritt der rechtssicheren Datenverarbeitung und\nüberwachen als unabhängiger Berater den Datenschutz in Ihrem Unternehmen. Als\nerfahrene Datenschutzbeauftragte können wir Sie mit stets aktuellem Fachwissen\ngenau da unterstützen, wo Sie es brauchen. Bei unserer Rundum-Betreuung\nkümmern wir uns dabei nicht nur um die Dokumentation, sondern auch um die\nUmsetzung datenschutzrechtlicher Sicherheitsmaßnahmen.\n\nUnsere Leistungen für Sie\n\n## So unterstützen wir Sie als Datenschutzbeauftragter\n\n  * Rechtswirksame Musterdokumente und Verzeichnis\n\n  * Meldung der Datenschutzbeauftragten an die Behörde\n\n  * Vertragsprüfungen, insb. Auftragsverarbeitungsverträge\n\n  * Unterstützung bei Erstellen und Pflege von Verarbeitungsverzeichnis und des Löschkonzepts\n\n  * Beantwortung von Behörden- und Betroffenenanfragen\n\n  * Schulungen entsprechend gesetzlicher Verpflichtung\n\n  * Schnelle Erreichbarkeit per E-Mail und Telefon\n\n  * Information bei Gesetzesänderungen und zur Rechtsprechung\n\n## Wann muss ich einen Datenschutzbeauftragten benennen?\n\nViele Unternehmen, Betriebe oder Vereine sind durch die EU-DSGVO verpflichtet,\neinen Datenschutzbeauftragten (DSB) zu benennen. Aber auch unabhängig davon\nkann es sinnvoll sein, bei wichtigen Fragen oder Zweifelsfällen die Expertise\nund das Fachwissen eines Datenschutzexperten in Anspruch zu nehmen.\n\nDie Grundverordnung und das Bundesdatenschutzgesetz (BDSG-neu) sehen in Art.\n37 Abs. 4 S. 1 DSGVO in Verbindung mit § 38 Abs. 1 S. 2 BDSG-neu vor, dass Sie\neinen Datenschutzbeauftragten benennen müssen, wenn\n\n  * mindestens zehn Personen ständig mit der automatisierten Verarbeitung personenbezogener Daten beschäftigt sind\n  * personenbezogene Daten geschäftsmäßig zum Zweck der Übermittlung, der anonymisierten Übermittlung oder für Zwecke der Markt- oder Meinungsforschung verarbeitet werden\n  * die Kerntätigkeit des Verantwortlichen in Verarbeitungsvorgängen liegt, die eine umfangreiche regelmäßige oder systematische Überwachung von betroffenen Personen erforderlich machen\n  * eine umfangreiche Verarbeitung besonderer Kategorien von personenbezogenen Daten (Art. 9) stattfindet\n  * eine Verarbeitung personenbezogener Daten über strafrechtliche Verurteilungen und Straftaten stattfindet\n\n## Was macht ein Datenschutzbeauftragter?\n\nEin Datenschutzbeauftragter ist eine unabhängige Kontrollinstanz, die die\nEinhaltung datenschutzrechtlicher Vorgaben in Unternehmen überwacht und auf\nDefizite hinweist. Um mögliche Interessenskonflikte zu umgehen bestellen viele\nUnternehmen einen externen Datenschutzbeauftragten. Dieser steht als ständiger\nBerater in allen datenschutzrechtlichen Fragen zur Seite, führt regelmäßige\nDatenschutz-Audits durch und passt die Umsetzung an sich ändernde Prozesse\noder neue Entwicklungen an. Die Aufgaben des DSB sind dabei durch Artikel 39\nDSGVO standardisiert.\n\n  * Überwachung der Einhaltung der DSGVO und deren Anforderungen\n\n  * Strategiebildung für den Schutz personenbezogener Daten\n\n  * Schulung und Sensibilisierung von Mitarbeitern für die Datenverarbeitung\n\n  * Beratung und Betreuung von Unternehmen bei der Umsetzung datenschutzrechtlicher Vorgaben und Pflichten\n\n  * Zusammenarbeit mit Aufsichtsbehörden\n\n## So viel kostet ein Datenschutzbeauftragter\n\nNicht erst seit der Datenschutz-Grundverordnung benötigen viele Unternehmen\neinen Datenschutzbeauftragten. Hier machen die EU-DSGVO und das BDSG klare\nVorschriften. Doch wie viel kostet ein externer Datenschutzbeauftragter\neigentlich? Der Vorteil eines externen DSB liegt klar auf der Hand: Die\nKosten! Denn man muss nicht erst eigene Mitarbeiter ausbilden sondern erhält\ndas Fachwissen auf Abruf, immer dann, wenn man es benötigt. Die Kosten für\neinen externen Datenschutzbeauftragten sind dabei von vielen Faktoren\nabhängig, die in einem individuellen Beratungsgespräch geklärt werden:\nOrganisatorische Strukturen, Anzahl der Mitarbeiter, Anzahl der Kunden,\nBranche des Unternehmens und genutzte Infrastruktur beeinflussen die Kosten.\nDas Gute daran ist, bei unserem Rundum-Paket mit ganzheitlicher Datenschutz-\nBeratung sind sämtliche Kosten in einer bequemen Monatspauschale abgedeckt.\nEine unverbindliche Anfrage lohnt sich also!\n\n## Wir kümmern uns um die Umsetzung Ihrer Datenschutz-Pflichten\n\nDie EU-Datenschutzgrundverordnung hat neben vielen Neuerungen auch einige\nPflichten mit sich gebracht. Kommt man diesen Verpflichtungen nicht\nordnungsgemäß nach können hohe Bußgelder drohen. Bis zu 20 Mio. Euro Strafe\noder 4 % des Jahresumsatzes können bei einem Verstoß bevorstehen. Um diese\nUnannehmlichkeiten zu umgehen, empfehlen wir, sich schon frühzeitig mit den\nPflichten des DSGVO auseinanderzusetzen. Als Ihr externer\nDatenschutzbeauftragter betreuen wir Sie gerne  bei der Umsetzung Ihrer\nDatenschutz-Pflichten.\n\n### Pflicht zur Benennung eines Datenschutzbeauftragten\n\nDie Benennung eines Datenschutzbeauftragten – egal ob intern oder extern –\nwird in Art. 37 der EU-DSGVO geregelt. Die Benennung soll auf Grundlage der\nberuflichen Qualifikation und eines besonderen Fachwissens im Bereich\nDatenschutzrecht erfolgen. Die Kontaktdaten des benannten\nDatenschutzbeauftragten sollten zudem auf der Homepage und in der\nDatenschutzerklärung veröffentlicht werden, sodass Interessierte und\nBetroffene sich bei Fragen an den jeweiligen Datenschutzbeauftragten wenden\nkönnen.\n\n### Informationspflichten\n\nInformationspflichten sind ein fester Bestandteil des Datenschutzrechts und\nentsprechen dem Grundsatz der Transparenz bei der Datenverarbeitung. Durch die\nGrundverordnung (DSGVO) haben sich in Bezug auf die Betroffenen die Pflichten\nfür Unternehmen und Verantwortliche noch vervielfacht. Welche\nInformationspflichten bestehen, wird in Art. 13 und Art. 14 der DSGVO\nfestgelegt. Verantwortliche sollten sich zeitnah um die Umsetzung aller\nInformationspflichten kümmern. Gerne klären wir in einem kurzen Audit, welche\nPflichten Sie bereits erfolgreich umgesetzt haben und was wir noch für Sie tun\nkönnen.\n\n### Dokumentationspflichten\n\nIn der Datenschutzgrundverordnung werden in verschiedenen Artikeln\nDokumentationspflichten genannt, die zum einen der Transparenz dienen, zum\nanderen aber auch der Nachweispflicht und Rechenschaftsmöglichkeit.  Zu nennen\nwären beispielsweise Übersichten von Verarbeitungstätigkeiten oder\nVerfahrensverzeichnisse. Sämtliche Pflichten erfordern eine umfassende\nDokumentation aller Maßnahmen zur Einhaltung des Datenschutzes. Mit unseren\naktuellen Datenschutz-Vorlagen können wir Sie bei der Dokumentation Ihrer\nDatenschutzmaßnahmen unterstützen.\n\n### Lassen Sie uns die Datenverarbeitung sicher machen!\n\nSie suchen eine externen Datenschutzbeauftragten, der Ihr Unternehmen\nbegleitet? Als externer Datenschutzbeauftragter nehmen wir Ihren Datenschutz\nin die Hand und begleiten Sie als kompetenter Partner mit jahrelanger\nErfahrung bei allen Prozessen Ihrer Datenverarbeitung und IT-Sicherheit.\n\nRufen Sie gerne an und wir zeigen Ihnen, wie wir Ihren Datenschutz\nrechtssicher machen können. Wir freuen uns auf Sie!\n\n### **Wir schützen Ihre Daten.**\n\nsicherheit@180-grad.de\n\n0211-17607260\n\nsicherheit@180-grad.de\n\n0211-17607260\n\n###  **Jetzt unverbindlich Kontakt aufnehmen!**\n\n### Der 180° Datenschutz Newsletter\n\nMelden Sie sich an, um regelmäßig wertvolle Informationen, Tipps und Updates\nzu erhalten, die Ihnen helfen, Ihr Unternehmen vor Sicherheitsrisiken zu\nschützen.\n\nJetzt anmelden!\n\nKontakt\n\n180° Datenschutz GmbH  \nHansaallee 321  \n40549 Düsseldorf\n\nsicherheit@180-grad.de  \n0211-17607260\n\nUnternehmen\n\n  * Karriere\n  * Gewinnspiele\n  * Kontakt\n  * Impressum\n  * Datenschutz\n  * AGB\n  * Sitemap\n\nCookies\n\nNetzwerk\n\nAuszeichnungen\n\n© 2014-2022. 180 Datenschutz GmbH\n\n°\n\nHansaallee 321, 40549 Düsseldorf\n\nMenü\n\nJetzt zum Newsletter anmelden!\n\n  \n\nSchließen\n\nDatenschutzeinstellungen\n\nWir nutzen Cookies auf unserer Webseite. Einige sind essenziell, andere helfen\nuns das Nutzer- erlebnis zu verbessern (Analyse- und Marketingcookies). Die\nCookie-Einstellungen können Sie jederzeit in unserer Datenschutzerklärung\nanpassen. Wenn Sie unter 16 Jahre alt sind und Ihre Zustimmung zu freiwilligen\nDiensten geben möchten, müssen Sie Ihre Erziehungsberechtigten um Erlaubnis\nbitten. Wir verwenden Cookies und andere Technologien auf unserer Website.\nEinige von ihnen sind essenziell, während andere uns helfen, diese Website und\nIhre Erfahrung zu verbessern. Personenbezogene Daten können verarbeitet werden\n(z. B. IP-Adressen), z. B. für personalisierte Anzeigen und Inhalte oder\nAnzeigen- und Inhaltsmessung. Weitere Informationen über die Verwendung Ihrer\nDaten finden Sie in unserer Datenschutzerklärung. Sie können Ihre Auswahl\njederzeit unter Einstellungen widerrufen oder anpassen.\n\nDatenschutzeinstellungen\n\n  * Essenziell \n\nAlle akzeptieren\n\nSpeichern\n\nIndividuelle Datenschutzeinstellungen\n\nCookie-Details  Datenschutzerklärung  Impressum\n\nDatenschutzeinstellungen\n\nWenn Sie unter 16 Jahre alt sind und Ihre Zustimmung zu freiwilligen Diensten\ngeben möchten, müssen Sie Ihre Erziehungsberechtigten um Erlaubnis bitten. Wir\nverwenden Cookies und andere Technologien auf unserer Website. Einige von\nihnen sind essenziell, während andere uns helfen, diese Website und Ihre\nErfahrung zu verbessern. Personenbezogene Daten können verarbeitet werden (z.\nB. IP-Adressen), z. B. für personalisierte Anzeigen und Inhalte oder Anzeigen-\nund Inhaltsmessung. Weitere Informationen über die Verwendung Ihrer Daten\nfinden Sie in unserer Datenschutzerklärung. Hier finden Sie eine Übersicht\nüber alle verwendeten Cookies. Sie können Ihre Einwilligung zu ganzen\nKategorien geben oder sich weitere Informationen anzeigen lassen und so nur\nbestimmte Cookies auswählen.\n\nAlle akzeptieren  Speichern\n\nZurück\n\nDatenschutzeinstellungen\n\nEssenziell (1)\n\nEssenzielle Cookies ermöglichen grundlegende Funktionen und sind für die\neinwandfreie Funktion der Website erforderlich.\n\nCookie-Informationen anzeigen  Cookie-Informationen ausblenden\n\nName |  Borlabs Cookie  \n---|---  \nAnbieter | 180° Datenschutz GmbH, Impressum  \nZweck | Speichert die Einstellungen der Besucher, die in der Cookie Box von\nBorlabs Cookie ausgewählt wurden.  \nCookie Name | borlabs-cookie  \nCookie Laufzeit | 1 Jahr  \n  \nDatenschutzerklärung  Impressum\n\n",
    "links": "[{\"link\": \"https://www.180-datenschutz.de/\", \"text\": \"\"}, {\"link\": \"https://www.180-datenschutz.de/externer-datenschutzbeauftragter/\", \"text\": \"\"}, {\"link\": \"https://www.180-datenschutz.de/externer-datenschutzbeauftragter/\", \"text\": \"\"}, {\"link\": \"https://www.180-datenschutz.de/externer-datenschutzbeauftragter/\", \"text\": \"Externe Datenschutzbeauftragte\"}, {\"link\": \"https://www.180-datenschutz.de/einzelberatung/\", \"text\": \"\"}, {\"link\": \"https://www.180-datenschutz.de/einzelberatung/\", \"text\": \"Einzel- und Projektberatung\"}, {\"link\": \"https://www.180-datenschutz.de/informationssicherheit\", \"text\": \"\"}, {\"link\": \"https://www.180-datenschutz.de/informationssicherheit\", \"text\": \"Informationssicherheit\"}, {\"link\": \"https://www.180-datenschutz.de/prozessmanagement\", \"text\": \"\"}, {\"link\": \"https://www.180-datenschutz.de/prozessmanagement\", \"text\": \"Prozessmanagement\"}, {\"link\": \"https://www.180-datenschutz.de/inhouse/\", \"text\": \"\"}, {\"link\": \"https://www.180-datenschutz.de/inhouse/\", \"text\": \"Inhouse-Schulungen\"}, {\"link\": \"https://www.180-datenschutz.de/whistleblowing-service\", \"text\": \"\"}, {\"link\": \"https://www.180-datenschutz.de/whistleblowing-service\", \"text\": \"Whistleblowing\"}]"
}