{
    "summary": "## Wir verwenden Cookies zur Verbesserung unseres Internetangebotes, zur\nstatistischen Analyse der Besuche und zur Auswertung unserer Werbeaktivitäten.\nIhre Einwilligung dafür ist freiwillig, für die Nutzung dieser Website nicht\nnotwendig und kann jederzeit widerrufen werden. Weitere Informationen dazu\nfinden Sie in unserer Datenschutzerklärung. \\- Datenschutzerklärung \\-\nImpressum\n\n  * **Matomo** Wir messen anonym Ihre Nutzung dieser Website um unser Angebot zu optimieren.\n\n  * Ablehnen (Optionen)\n  * Akzeptieren\n\nMenu anzeigen\n\n02236-3310745\n\ninfo@riske-it.de\n\n  * Home\n  * Leistungen\n    * Externe Datenschutzbeauftragte\n    * Schulungen\n    * IT-Sicherheit\n    * Audit & Beratung\n    * Webseiten-Check\n    * Meldestelle nach HinweisgeberSchutzGesetz\n  * Referenzen\n  * FAQ\n  * Jobs\n    * Consultant Datenschutz (m/w/d)\n    * Datenschutzkoordinator (m/w/d)\n  * Kontakt\n\n##  Externe Datenschutzbeauftragte\n\nWir begleiten Sie bei der Umsetzung der Datenschutz-Grundverordnung (DSGVO) in\nIhrem Unternehmen oder Verein. Unsere TÜV-zertifizierten Experten überwachen\nfür Sie als externe Datenschutzbeauftragte die Einhaltung der geltenden\nDatenschutzgesetze und helfen Ihnen bei der Einführung und Umsetzung eines\nDatenschutzkonzeptes in Ihrer Organisation.\n\nIhre Vorteile mit unseren externen Datenschutzbeauftragten:\n\n  * Kostengünstiger als ein interner Datenschutzbeauftragter\n  * Kein Kündigungsschutz\n  * Objektive Sicht auf Unternehmen und Datenverarbeitungsprozesse\n  * Branchenübergreifende Erfahrung\n  * Keine Weiterbildungskosten, Fachkundenachweis gem. Art. 37 Abs. 5 DSGVO\n  * Synergie-Effekte\n  * Standardisierte Verfahren und Dokumente\n\n### Unsere Leistungen als externe Datenschutzbeauftragte umfassen:\n\n ** _Datenschutzkonzept_**\n\nGemeinsam mit Ihnen entwickeln wir ein individuelles Datenschutzkonzept für\nIhre Organisation als Leitfaden und Handbuch zur Einhaltung der geltenden\nDatenschutzgesetze. Dieser Leitfaden beschreibt die Datenverarbeitung\npersonenbezogener Daten in Ihrem Unternehmen oder Verein und dient als\nHandbuch für den Umgang mit personenbezogenen Daten, möglichen\nDatenschutzvorfällen und dazugehörigen Meldefristen sowie dem Umgang und der\nEinhaltung der gesetzlich vorgeschrieben Betroffenenrechte. Das individuelle\nDatenschutzkonzept sowie die dazugehörige Dokumentation sind wichtiger\nBestandteil jedes Datenschutz-Managementsystems.\n\n ** _Fachkundiger Ansprechpartner_**\n\nUnsere TÜV-zertifizierten Experten haben langjährige Erfahrung in den\nBereichen Datenschutz & IT-Sicherheit und stehen Ihren Mitarbeitern in allen\nFragen rund um das Thema Datenschutz zur Verfügung. Ob per Telefon, E-Mail\noder persönlich vor-Ort, gemeinsam erfüllen wir die datenschutzrechtlichen\nAnforderungen und wirken so auf eine DSGVO-konformen Datenverarbeitung hin.\n\nSowohl bei Anfragen oder Kontrollen durch die zuständigen Aufsichtsbehörden\nals auch als kompetenter Ansprechpartner bei Anfragen von Betroffenen\nunterstützen wir Sie individuell und unkompliziert und stellen damit eine\nEinhaltung der gesetzlichen Fristen sicher. Unsere TÜV-zertifizierten Experten\nverfügen über ausgewiesene juristische und technische Kenntnisse und erfüllen\ndamit die gesetzlichen Anforderungen gemäß Art. 37 Abs. 5 DSGVO.\n\n ** _Unterstützung bei der Datenschutzfolgenabschätzung_**\n\nEine Datenschutzfolgenabschätzung (DSFA) ist laut Art. 35 Abs. 1 DSGVO immer\ndann vorgeschrieben, wenn neue Verarbeitungstätigkeiten bei Verwendung neuer\nTechnologien aufgrund der Art, des Umfangs, der Umstände und der Zwecke der\nVerarbeitung voraussichtlich ein hohes Risiko für die Rechte und Freiheiten\nnatürlicher Personen zur Folge haben oder sich eine bestehende\nVerarbeitungstätigkeit grundliegend ändert. Zudem gibt es eine Reihe von\nVerarbeitungstätigkeiten, welche aufgrund Ihres Risikos grundsätzlich einer\nDSFA-Pflicht unterliegen.\n\nWir unterstützen Sie bei der Durchführung der Datenschutzfolgenabschätzung und\nsorgen durch den Einsatz von standardisierter Software für eine effektive\nMöglichkeit für Sie und Ihre Mitarbeiter der Pflicht zur DSFA nachzukommen.\n\n ** _Datenschutzbericht_**\n\nDurch umfassende Berichte mit allen relevanten Vorkommnissen sowie aktuellen\nNeuigkeiten zu Technik und Rechtsprechung im Datenschutzrecht informieren wir\nSie gezielt über den aktuellen Stand der Datenverarbeitung in Ihrem\nUnternehmen. Diese Datenschutzberichte basieren auf den Ergebnissen der\njährlichen Audits und beinhalten individuelle Handlungsempfehlungen zur\nVerbesserung des Datenschutzniveaus und zur Erreichung der gesetzlich\nvorgeschriebenen Schutzziele der DSGVO.\n\n ** _Verfahrensverzeichnis der Verarbeitungstätigkeiten_**\n\nDas Verzeichnis der Verarbeitungstätigkeiten (VVT) ist eines der gesetzlich\nvorgeschriebenen Pflichtdokumente gemäß Art. 30 Abs. 1 DSGVO und enthält eine\nÜbersicht der Datenverarbeitungsprozesse personenbezogener Daten in Ihrer\nOrganisation.\n\nGerne übernehmen wir für Sie die Erstellung und Pflege dieses Verzeichnisses.\nDurch individuelle und regelmäßige Audits garantieren wir ein größtmögliches\nMaß an Aktualität der Dokumentation und helfen Ihnen damit die\nDatenverarbeitung personenbezogener Daten in Ihrer Organisation stets\nrealitätsgetreu abzubilden und Ihrer gesetzlichen Dokumentationspflicht\nnachzukommen.\n\n ** _Technische und organisatorische Schutz-Maßnahmen (TOM)_**\n\nDie Dokumentation der technischen und organisatorischen Maßnahmen zum\nDatenschutz dient der Sicherstellung der in Art. 32 Abs. 1 DSGVO genannten\nZiele und stellt sowohl für Sie als Verantwortliche eine wichtige\nDokumentation zur Einhaltung des Datenschutzes, als auch für Kunden und\nLieferanten ein hohes Maß an Vertrauen in die Sicherheit der Datenverarbeitung\nin Ihrer Organisation dar.\n\nDurch die fachliche Dokumentation der Schutzmaßnahmen durch unsere\nDatenschutz- und IT-Sicherheitsexperten sowie einer Bestellung unserer\nExperten als Datenschutzbeauftragten können Sie Ihre Reputation gegenüber\nKunden und Lieferanten glaubhaft steigern.\n\n ** _Sensibilisierung der Mitarbeiter_**\n\nNeben der Technik ist die größte Fehlerquelle in der täglichen Arbeit\nmenschlicher Natur. Oftmals entstehen Datenschutzvorfälle, weil Mitarbeiter\nnicht das nötige Bewusstsein für Datenschutz und den generellen Umgang mit\npersonenbezogenen Daten verinnerlicht haben.  Datenschutzvorfälle können auch\ndurch falsche Arbeitsabläufe und Prozesse, welche sich über die Jahre im\nArbeitsalltag etabliert haben, entstehen.\n\nWir sensibilisieren Ihre Mitarbeiter mit Hilfe einer Vielzahl an Maßnahmen\nz.B. über individuelle Datenschutz-Schulungen ****und informieren Sie\nregelmäßig über relevante Vorkommnisse. Dadurch helfen wir ein Bewusstsein für\ndas Thema Datenschutz in Ihrer Organisation aufzubauen, die Risikoquelle\nMensch zu reduzieren und mögliche Folgen von Datenschutzverstößen, wie z.B.\nBußgelder zu vermeiden.  \n\n### Angebot einholen - Kontaktformular\n\nRufen Sie uns an oder schreiben Sie uns:\n\nExterner DatenschutzbeauftragterIT-Sicherheitsbeauftragte / (C)ISOISO/IEC\n27001IT-GrundschutzDarknet ErmittlungenAudit & BeratungWebseiten-\nCheckSchulung: Datenschutz nach DSGVOSchulung: IT-SicherheitSchulung:\nDatenschutz im GesundheitswesenSchulung: Datenschutz im PersonalwesenSonstiges\n\n **Ich habe die Datenschutzhinweise  zur Kenntnis genommen. **\n\nFormular jetzt absenden\n\n* * *\n\nRiske IT GmbH, Keldenicher Straße 23, 50389 Wesseling\n\n02236-3310745\n\ninfo@riske-it.de\n\n2024 © Riske IT GmbH\n\n  * Impressum\n  * Datenschutzerklärung\n\nAngebot Einholen\n\n",
    "links": "[{\"link\": \"https://www.riske-it.de/index.php?id=8\", \"text\": \"Datenschutzerklärung\"}, {\"link\": \"https://www.riske-it.de/index.php?id=7\", \"text\": \"Impressum\"}, {\"link\": \"https://www.riske-it.de/\", \"text\": \"\"}, {\"link\": \"https://www.riske-it.de/\", \"text\": \"Home\"}, {\"link\": \"https://www.riske-it.de/leistungen/\", \"text\": \"Leistungen\"}, {\"link\": \"https://www.riske-it.de/leistungen/externer-datenschutzbeauftragter/\", \"text\": \"Externe Datenschutzbeauftragte\"}, {\"link\": \"https://www.riske-it.de/leistungen/schulungen/\", \"text\": \"Schulungen\"}, {\"link\": \"https://www.riske-it.de/leistungen/it-sicherheit/\", \"text\": \"IT-Sicherheit\"}, {\"link\": \"https://www.riske-it.de/leistungen/audit-beratung/\", \"text\": \"Audit & Beratung\"}, {\"link\": \"https://www.riske-it.de/leistungen/webseiten-check/\", \"text\": \"Webseiten-Check\"}, {\"link\": \"https://www.riske-it.de/leistungen/meldestelle-hinweisgeber/\", \"text\": \"Meldestelle nach HinweisgeberSchutzGesetz\"}, {\"link\": \"https://www.riske-it.de/referenzen/\", \"text\": \"Referenzen\"}, {\"link\": \"https://www.riske-it.de/faq/\", \"text\": \"FAQ\"}, {\"link\": \"https://www.riske-it.de/jobs/\", \"text\": \"Jobs\"}, {\"link\": \"https://www.riske-it.de/jobs/consultant-datenschutz-mwd/\", \"text\": \"Consultant Datenschutz (m/w/d)\"}, {\"link\": \"https://www.riske-it.de/jobs/datenschutzkoordinator-mwd/\", \"text\": \"Datenschutzkoordinator (m/w/d)\"}, {\"link\": \"https://www.riske-it.de/kontakt/\", \"text\": \"Kontakt\"}, {\"link\": \"https://www.riske-it.de/leistungen/it-sicherheit/\", \"text\": \"IT-Sicherheit\"}, {\"link\": \"https://www.riske-it.de/leistungen/audit-beratung/\", \"text\": \"Audits\"}, {\"link\": \"https://www.riske-it.de/leistungen/schulungen/\", \"text\": \"Datenschutz-Schulungen\"}, {\"link\": \"https://www.riske-it.de/datenschutz/\", \"text\": \"\\n                            Datenschutzhinweise\\n                        \"}, {\"link\": \"https://www.riske-it.de/impressum/\", \"text\": \"Impressum\"}, {\"link\": \"https://www.riske-it.de/datenschutzerklaerung/\", \"text\": \"Datenschutzerklärung\"}, {\"link\": \"https://www.riske-it.de/kontakt/\", \"text\": \"Angebot Einholen\"}]"
}