{
    "summary": "Weiter zum Inhalt\n\n  * Unternehmen\n    * Unternehmen\n    * Berater\n    * Corporate Social Responsibility\n  * Newsletter\n  * Karriere\n  * News\n  * Infos\n    * Auftragsverarbeitung\n    * Binding Corporate Rules\n    * Datenschutzbeauftragter nach DSGVO\n    * Datenschutzbeauftragter Aufgaben\n    * Datenschutzbeauftragter Benennung\n    * Was ist die Datenschutz-Grundverordnung?\n  * Kontakt\n\nSuche nach:\n\n  * English\n\nSuche nach:\n\n  * English\n\n  * Datenschutz\n    * Externer Datenschutzbeauftragter\n\nWir sind als externer Datenschutzbeauftragter ganz in Ihrer Nähe mit unseren\nStandorten in Hamburg, Berlin, Köln, Frankfurt, Stuttgart und München.\nInformieren Sie sich hier über unser Rundum-sorglos-Paket.\n\n      * Externer Datenschutzberater Schweiz\n      * Interim-Datenschutzbeauftragter\n    * Datenschutzberatung\n      * Betriebsrat\n      * DSGVO Beratung\n      * EU-Vertreter\n      * Gesundheitswesen\n      * Internationaler Datenschutz\n      * Kirche\n      * Konzerndatenschutz\n      * Löschkonzept\n      * Marketing\n      * Microsoft 365\n      * Privacy by Design\n      * Transfer Impact Assessment\n      * Videoüberwachung\n      * Whistleblowing\n      * Datenschutz-Audit\n      * Datenschutz-Dokumente\n      * Datenschutz-Schulung\n    * Datenschutz-Zertifizierung nach ISO 27701\n    * Daten­schutz­management Software – Guardileo\n    * E-Learning – Guardileo Trainer\n  * IT-Sicherheit\n    * IT‑Sicherheit Beratung\n    * Informations­sicherheits­beauftragter\n    * IT-Schwachstellenanalyse\n    * IT-Security Check\n    * Penetrationstest\n    * Microsoft 365 Security\n  * IT-Forensik\n    * IT‑Forensik\n    * Incident Response · 24h IT‑Notfallhilfe\n    * IT-forensische Analysen\n    * Forensic Readiness\n  * Webinare\n  * Unternehmen\n    * Unternehmen\n    * Berater\n    * Corporate Social Responsibility\n  * Newsletter\n  * Karriere\n  * News\n  * Infos\n    * Auftragsverarbeitung\n    * Binding Corporate Rules\n    * Datenschutzbeauftragter nach DSGVO\n    * Datenschutzbeauftragter Aufgaben\n    * Datenschutzbeauftragter Benennung\n    * Was ist die Datenschutz-Grundverordnung?\n  * Kontakt\n\nHome>Externer Datenschutzbeauftragter\n\nKontaktinfo [DE]\n\nTelefonzentrale: 0800 300 9 100\n\n24h IT-Notfallhilfe\n\n24h IT-Notfallhilfe\n\n# Externer Datenschutzbeauftragter\n\nKunden schätzen unser Rundum‑sorglos‑Paket und machen uns zu einem der\nführenden Dienstleister im Datenschutz.\n\nHier anfragen\n\nVideo zum Thema\n\nVorteile Datenschutz DEISO-Siegel DE\n\nVorteile Unsere Leistungen Referenzen Standorte Berater Ablauf Kosten\nGegenüberstellung Häufige Fragen\n\n0800 300 9 100 Kontaktformular\n\n## Ihre Vorteile\n\nÜberzeugen Sie sich von den Vorteilen einer Zusammenarbeit.\n\n  * Bundesweit tätig\n\nWir sind ganz in Ihrer Nähe mit unseren Standorten in Hamburg, Berlin, Köln,\nFrankfurt, Stuttgart und München.\n\n  * Datenschutz und IT‑Kompetenz\n\nDie vielen unterschiedlichen Qualifikationen unserer Berater im Datenschutz\nund IT‑Bereich sind in der Branche einzigartig.\n\n  * Persönliche Beratung statt 150€‑Modell\n\nWir setzen nicht auf standardisierte Softwarelösungen, sondern beraten stets\nindividuell angepasst auf Ihre Bedürfnisse.\n\n## Datenschutz auf höchstem Niveau\n\n### Aufbau einer robusten Datenschutzorganisation im Unternehmen\n\nDie vornehmliche Aufgabe unserer externen Datenschutzbeauftragten liegt im\nAufbau und der Umsetzung einer praxisnahen und gesetzeskonformen\nDatenschutzorganisation in Ihrem Unternehmen. Unsere Beratung im Datenschutz\nerfolgt ausschließlich durch speziell geschulte **Berater mit besonderer\nExpertise** in den Bereichen der Datenschutz-Grundverordnung (DSGVO), des\nBundesdatenschutzgesetzes (BDSG), des Gesetzes zur Regelung des Datenschutzes\nund des Schutzes der Privatsphäre in der Telekommunikation und bei Telemedien\n(TTDSG) sowie anderen Bereichen des IT‑Rechts.\n\nDatenschutzbeauftragte von kleinen Betrieben über Mittelständler bis hin zu\ngroßen internationalen Konzernen müssen heutzutage einer Vielzahl von\nAnforderungen im Blick haben. Auf der einen Seite sind unterschiedliche\nGesetze zu beachten und sinnvoll ins Tagesgeschäft zu integrieren, auf der\nanderen Seite fällt es Unternehmen aufgrund der eigenen Strukturen oft schwer,\nden Datenschutz innerhalb der gesamten Organisation zu etablieren. Mit unserem\nweitreichenden Erfahrungsschatz **als externe Datenschutzbeauftragte entlasten\nwir Sie** – angepasst auf Ihre individuellen Gegebenheiten. Dabei stellen\nunsere Experten ihre Fachkunde ganz in den Dienst Ihrer ökonomischen Ziele im\nUnternehmen.\n\nGerade im Datenschutz, wenn es um den Umgang mit personenbezogenen Daten geht,\nist Vertrauen von entscheidender Bedeutung. Wir stehen bereits **seit vielen\nJahren** für Sorgfalt, Praxisnähe und Diskretion in der Datenschutzberatung\nvon Unternehmen. Durch die interdisziplinäre hohe Fachkompetenz der Berater\nkönnen wir Sie dabei unterstützen, den technischen Schutz sicherzustellen.\nDieser ist nach DSGVO für alle Betriebe verpflichtend. Mit der Durchführung\neiner IT-Schwachstellenanalyse erhalten Sie einen entsprechenden Nachweis zum\nSchutz der personenbezogenen Daten. Unsere Referenzen als externe\nDatenschutzbeauftragte sprechen für uns. Gern nehmen wir uns Zeit für eine\npersönliche Beratung und fertigen Ihnen **unverbindlich und kostenlos** ein\nspeziell auf Ihre Belange zugeschnittenes Angebot an. Für die Funktion des\nexternen Datenschutzbeauftragten finden wir den für Sie passenden Berater.\n\nWas uns als externer Datenschutzbeauftragter auszeichnet\n\nErfahren Sie hier, warum auch Sie uns vertrauen sollten. Bitte wählen:  \n\nAufgaben Rollenverständnis Qualifikation Expertise Vertretung\nRisikominimierung International Software Guardileo Haftung Kosten\n\n### Welche Aufgaben übernehmen wir für Sie als externe Datenschutzbeauftragte?\n\nWir beraten Sie als externe Datenschutzbeauftragte bei der Einhaltung der\nDSGVO in Ihrem Unternehmen sowie zu sämtlichen Spezialgesetzen im Datenschutz\nund unterstützen bei Datenschutzthemen. Das sind zum Beispiel: Aufbau einer\nDatenschutzorganisation, Auftragsverarbeitung, Datenschutz-\nFolgenabschätzungen, Datentransfers, Marketing und Werbung. Wir sorgen für\neine datenschutzkonforme Ausgestaltung der Prozesse in Ihrem Unternehmen im\nUmgang mit personenbezogenen Daten, ausgerichtet an der Zielsetzung Ihres\nGeschäftsmodells. Sie erhalten somit ein Rundum-sorglos-Paket im Datenschutz.\n\n### Wie definieren wir die Rolle des Datenschutzbeauftragten in Ihrem\nUnternehmen?\n\nEin externer Datenschutzbeauftragter aus unserem Haus wird im Rahmen seiner\nFunktion die gesetzlichen Aufgaben im Datenschutz gemäß Art. 39 Abs. 1 EU-\nDSGVO in Ihrem Unternehmen wahrnehmen. Dabei nimmt er eine neutrale Position\nein und steht der Geschäftsführung und den Fachabteilungen als\nvertrauensvoller Ansprechpartner in allen Fragen des Datenschutzes\nunterstützend zur Seite. Die Entscheidungshoheit im Datenschutz obliegt immer\nder Managementebene Ihres Unternehmens. Der Datenschutzbeauftragte klärt über\nRisiken im Datenschutz auf und erarbeitet Vorschläge, die Ihnen als\nEntscheidungsgrundlage im Unternehmen dienen.\n\n### Inwieweit übertrifft unsere Datenschutzberatung die gesetzlich geforderte\nFachkunde?\n\nUnsere externen Datenschutzbeauftragten verfügen über interdisziplinäre\nKompetenzen in Datenschutz, Recht und IT. Aufgrund von regelmäßigen\nWeiterbildungen und eines permanenten Wissensaustausches im Datenschutz\ninnerhalb der Expertenteams in unserem Unternehmen verfügen alle Berater über\nein hohes Maß an Fachkunde und sind immer auf dem neuesten Stand. Unsere\nexternen Datenschutzbeauftragten vereinen unter anderem folgende\nQualifikationen auf sich: Juristen, darunter promovierte Rechtsanwälte,\nFachanwälte für IT-Recht, gewerblichen Rechtsschutz, Urheber- und Medienrecht,\nTÜV-zertifizierte Datenschutzbeauftragte, Wirtschaftsinformatiker,\nInformatiker.\n\n### Welche Erfahrungen bringen unsere externen Datenschutzbeauftragten in Ihr\nUnternehmen?\n\nSeit der Firmengründung in 2006 betreuen wir als Beratungsunternehmen unsere\nKunden im Datenschutz als externe Datenschutzbeauftragte und konnten so\nweitreichende Erfahrungen in allen Branchen und in den unterschiedlichsten\nUnternehmensstrukturen in der Datenschutzberatung sammeln. Ebenso wie das\nFachwissen unserer Experten im Bereich Datenschutz (DSGVO), werden diese\nlangjährigen Erfahrungen als externe Datenschutzbeauftragte in einem internen\nWissenspool gepflegt und zu Best Practices entwickelt. Im Beratungsalltag\nprofitieren Sie von diesem enormen Know-how, das eine effiziente und\npraxistaugliche Datenschutzberatung in der Funktion des externen\nDatenschutzbeauftragten im Unternehmen ermöglicht.\n\n### Was passiert, wenn Ihr externer Datenschutzbeauftragter mal ausfällt?\n\nSollte der für Sie benannte externe Datenschutzbeauftragte aus wichtigen\nGründen mal verhindert sein, um seine Aufgaben im Datenschutz persönlich zu\nerfüllen, steht Ihnen immer ein qualifizierter Vertreter zur Verfügung. Die\nVertreterregelung sichern wir Ihnen vertraglich zu. Selbstverständlich erfüllt\nauch die Vertretung des externen Datenschutzbeauftragten die gesetzlichen\nAnforderungen an die berufliche Qualifikation und das Fachwissen.\n\n### Inwieweit tragen wir zur Absicherung Ihres Unternehmens bei?\n\nIn der Funktion des externen Datenschutzbeauftragten übernehmen wir die\nPflicht, Ihr Unternehmen bei der Herstellung der Datenschutz-Compliance zu\nunterstützen und Sie über die Risiken im Datenschutz zu informieren. Nachdem\ndie Benennung Ihres externen Datenschutzbeauftragten erfolgt ist, wird er in\neiner umfassenden Ist-Analyse zunächst die vorhandenen Risiken im Datenschutz\nevaluieren. Anschließend wird der externe Datenschutzbeauftragte\nHandlungsempfehlungen erarbeiten, mit denen Sie die Risiken minimieren können\nund Sie bei der Umsetzung unterstützen. Dank unserer umfassenden Betriebs- und\nVermögensschadenhaftpflicht sind Sie zusätzlich für den unwahrscheinlichen\nFall eines Haftungsschadens ausreichend abgesichert.\n\n### Können wir Fragen zum Datenschutz im internationalen Kontext beantworten?\n\nDurch die Betreuung diverser multinationaler Konzerne im Datenschutz\nbeschäftigen wir uns als externe Datenschutzbeauftragte regelmäßig mit\ndatenschutzrechtlichen Fragestellungen auf internationaler Ebene. Wenn Ihre\nDienstleister im Ausland sitzen, Sie Daten innerhalb des Konzerns\ntransferieren oder die Datenschutzprozesse konzernweit auf Basis der DSGVO\nvereinheitlichen möchten, unterstützen wir Sie gern bei der\ndatenschutzkonformen Ausgestaltung Ihrer grenzüberschreitenden\nVerarbeitungstätigkeiten. Bei Fragen im Datenschutz zur landesspezifischen\nGesetzgebung außerhalb Deutschlands stellen wir für Sie gern den Kontakt zu\nden Datenschutzexperten aus unserem Netzwerk Privacy Europe her.\n\n### Ist die unlimitierte Softwarenutzung im Leistungsumfang inkludiert?\n\nFalls Sie noch keine Softwarelösung innerhalb des Unternehmens einsetzen,\nempfehlen wir Ihnen unsere Datenschutzmanagement Software Guardileo zu nutzen.\nAuf Wunsch bieten wir die Software im Leistungspaket mit dem externen\nDatenschutzbeauftragten kostengünstig mit an. Die Nutzung von Guardileo ist\ndabei vollkommen unlimitiert. Sie können zu jeder Zeit beliebig viele\nDokumente erstellen oder genauso unbegrenzt User anlegen. Gerade das\nunterscheidet uns sehr stark von anderen Anbietern am Markt. Die Software\nwurde von unserem Expertenteam, bestehend aus Juristen mit langjähriger\nErfahrung in der Datenschutzberatung, entwickelt. Die pragmatische Umsetzung\nder datenschutzrechtlichen Anforderungen, der Funktionsumfang, aber vor allem\ndie einfache Bedienbarkeit der Software zeichnet Guardileo aus.\n\n### Wie kann unsere Haftpflichtversicherung das Risiko minimieren?\n\nEs ist uns ein wichtiges Anliegen, unseren Kunden einen möglichst großen\nSchutz zu bieten, der weit über das Marktübliche hinausgeht. intersoft\nconsulting hat für den Fall einer Haftung aufgrund der schuldhaften Verletzung\nvon Leistungspflichten eine vollumfängliche Betriebs- und\nVermögensschadenhaftpflicht abgeschlossen. Diese deckt sowohl Vermögensschäden\nbis zu einer Summe von 20.000.000 € als auch Personen- und Sachschäden bis zu\neiner Summe von 10.000.000 € ab. Mit der Bestellung eines externen\nDatenschutzbeauftragen von intersoft consulting sind Sie somit sehr gut\nabgesichert.\n\n### Was kostet die Bestellung eines externen Datenschutzbeauftragten?\n\nIm Gegensatz zu vielen Marktbegleitern nennen wir keine Preise auf unserer\nWebsite. Diese Entscheidung haben wir ganz bewusst getroffen, da bei uns immer\ndas persönliche Gespräch und die individuellen Gegebenheiten bei der\nAngebotserstellung im Vordergrund stehen. Dies lässt sich nicht mit festen\nPreisen abbilden. Was wir aber beobachtet haben, ist, dass wir oft deutlich\nunter den Kosten liegen, die Preiskalkulatoren auf anderen Seiten ermitteln\nund dabei einen vollumfänglicheren Leistungsumfang bieten. Unsere Kunden\nkönnen sich über faire Preise, Transparenz und planbare Kosten freuen. Neben\ndem Tätigkeitsbereich des externen Datenschutzbeauftragten können auch\noptional die unbegrenzte Nutzung der Datenschutzmanagement Software Guardileo\nsowie unser E‑Learning‑Tool vollumfänglich im Vertrag miteingeschlossen\nwerden. Genauso ist auch eine hohe Haftpflichtversicherung im Paket\ninkludiert. Sprechen Sie uns an! Gern erstellen wir auch für Sie ein\nindividuelles und faires Angebot.\n\nAttraktive Preismodelle angepasst für Unternehmen jeder Größe. Hier\nunverbindlich anfragen\n\n## Referenzen als externer Datenschutz­beauftragter\n\nWir beraten deutschlandweit hunderte Unternehmen und sind daher in allen\nBranchen vertreten. Dies ist nur ein Auszug unserer Referenzen.\n\n„Als international führender Anbieter für Geschäftslösungen im Bereich\nEnterprise Information Management (EIM) schätzen wir die Handlungsempfehlungen\nunserer externen Datenschutzbeauftragten sehr. Vielen Dank für die\nkonstruktive Zusammenarbeit, insbesondere beim Thema\nAuftragsdatenverarbeitung.“\n\nI. Schauer, Senior Contract Manager\n\nOpen Text Software GmbH\n\n„Mit intersoft consulting services haben wir einen kompetenten Partner für das\nkirchliche Datenschutzrecht gefunden. Wir sind mit unserer externen\nDatenschutzbeauftragten sehr zufrieden.“\n\nA. Lunkenbein, Leitung Personal und Organisation\n\nEvangelische Stiftung Pflege Schönau\n\n„Die Doppelqualifikation unserer neuen Datenschutzbeauftragten – eine\nRechtsanwältin mit Spezialwissen im Bereich der Informationstechnologie –\nsowie der Servicegedanke haben uns von den sehr hohen Beratungskompetenzen der\nintersoft consulting services AG überzeugt.“\n\nM. Richter, Leiter Personal\n\nDeutsches Komitee für UNICEF\n\n„Die vertrauensvolle Zusammenarbeit mit dem externen Datenschutzbeauftragten\nvon intersoft consulting services sichert die Umsetzung der gesetzlichen\nAnforderungen und steigert gleichzeitig die Kundenzufriedenheit.“\n\nT. Steen, Director Operations\n\nSteinberg Media Technologies GmbH\n\n„Bereits seit Jahren vertrauen wir als einer der weltweit führenden Hersteller\nvon Windenergieanlagen unserer externen Datenschutzbeauftragten von intersoft\nconsulting services. Aufgrund der exzellenten Expertise im internationalen\nDatenschutz haben wir die Beratung auf unsere europäischen\nTochtergesellschaften ausgeweitet.“\n\nT. Meyer, Bereichsleiter Interne Revision und Risikomanagement\n\nSenvion Holding GmbH\n\nPrevious Next\n\n## Unsere Standorte\n\nMit bundesweiten Niederlassungen sind wir auch in Ihrer Nähe vertreten.\n\n## Kompetenz von mehr als 60 Beratern\n\nMehr als 60 Berater liefern passende Lösungen für Ihr Unternehmen. Lernen Sie\nhier einige ausgewählte Berater kennen.\n\nJuliane Dannewitz\n\nJuristin\n\n  * beide jur. Staatsexamina\n  * Diploma of Advance Studies in IT-Recht\n  * Certified Information Privacy Professional/Europe (CIPP/E)\n  * Datenschutzbeauftragte (TÜV‑zertifiziert)\n\nBianca Pettinger\n\nJuristin\n\n  * beide jur. Staatsexamina\n  * Certified Information Privacy Professional (CIPP/E)\n  * Tätigkeit bei einer öffentlich-rechtlichen Rundfunkanstalt im Bereich des Datenschutzes\n\nJohanna Soetbeer, LL.M. (Norwich)\n\nJuristin\n\n  * zugelassene Rechtsanwältin\n  * Master of Laws (LL.M.) in Informationstechnologierecht und Gewerblichem Rechtsschutz\n  * langjährige Expertise als Datenschutzberater\n\nStephanie Wich\n\nJuristin\n\n  * beide jur. Staatsexamina\n  * Tätigkeit für die Fraunhofer Gesellschaft\n  * langjährige Tätigkeit für eine Wirtschaftskanzlei\n\nAnqi Chen, LL.M.\n\nJuristin\n\n  * Master of Laws, Chinesisches Staatsexamen\n  * Certified Information Privacy Professional (CIPP/E)\n  * langjährige Erfahrung im Bereich Datenschutz\n\nPrevious Next\n\nAlle Berater anzeigen\n\nAufgelistet finden Sie Zertifikate und Mitgliedschaften der\nUnternehmensgruppe, die unseren hohen Anspruch belegen.\n\n#### Deutsche Vereinigung für Datenschutz e.V. (DVD)\n\nDie DVD verfolgt das Ziel, die Interessen von Bürgerinnen und Bürgern in allen\nFragen des Datenschutzes, der Datenverarbeitung und der Datensicherung\nwahrzunehmen. Die Mitgliedschaft ermöglicht uns den Zugang zu umfangreichem\nFachwissen und Netzwerkmöglichkeiten in der Datenschutzwelt.\n\n#### IAPP Corporate Member\n\nDurch die Firmenmitgliedschaft in der International Association of Privacy\nProfessionals (IAPP) sind unsere Berater weltweit mit führenden Datenschutz-\nund IT‑Sicherheitsexperten vernetzt. Als international anerkannter Standard\nsignalisiert IAPP großes Vertrauen und gewinnt durch die neue DSGVO einen\nhohen Stellenwert.\n\n#### CIPP/E-Zertifizierung\n\nBerater der intersoft consulting services AG sind durch die International\nAssociation of Privacy Professionals (IAPP) zum Certified Information Privacy\nProfessional (CIPP/E) zertifiziert worden. Das Zertifikat ist ANSI- und ISO-\nkonform (ISO 17024) und weist den Berater aus, über anerkannte Qualifikationen\nim europäischen Datenschutzbereich zu verfügen.\n\n#### Nach Verbandskriterien des BvD verpflichtet\n\nintersoft consulting services ist mit ihren externen Datenschutzbeauftragten\nnach den Verbandskriterien „Fachkunde“ und „Zuverlässigkeit“ des Berufsverband\nder Datenschutzbeauftragten e.V. (BvD) verpflichtet. Die Kriterien\ngewährleisten ein hohes und konstantes Datenschutzniveau.\n\n#### Hamburger Datenschutzgesellschaft e.V. (HDG)\n\nDie “Hamburger Gesellschaft zur Förderung des Datenschutzes e.V.” wurde als\nForum für den Datenschutz von Vertreterinnen und Vertreter aus Wirtschaft,\nWissenschaft und Medien gegründet. Als Mitglied beim HDG wirken wir aktiv an\nder Weiterentwicklung von Datenschutzthemen mit.\n\n#### ISO 27001 zertifiziert\n\nMit der Zertifizierung ihres Informationssicherheits-managementsystems (ISMS)\nnach ISO 27001 dokumentiert die intersoft consulting services AG ihre\nFähigkeit, Vertraulichkeit, Integrität und Verfügbarkeit der ihr anvertrauten\nInformationen zu wahren. Die Kunden können damit auf eine angemessene\nSteuerung von Risiken vertrauen.  \nZertifikat öffnen\n\n#### Gesellschaft für Datenschutz und Datensicherheit e.V. (GDD)\n\nAls gemeinnütziger Verein setzt sich die GDD für einen angemessenen,\nvertretbaren und technisch umsetzbaren Datenschutz ein. Ihr Zweck besteht\ndarin, datenverarbeitende Stellen bei der Bearbeitung und Erfüllung von\nrechtlichen, technischen und organisatorischen Anforderungen in Bezug auf\nDatenschutz und Datensicherheit zu unterstützen. Wir engagieren uns im ERFA-\nKreis Nord und schätzen den fachlichen Austausch.\n\n#### CIPM-Zertifizierung\n\nBerater der intersoft consulting services AG sind durch die International\nAssociation of Privacy Professionals (IAPP) zum Certified Information Privacy\nManager (CIPM) zertifiziert worden. Die CIPM ist die einzige weltweit\nakkreditierte Zertifizierung im Datenschutzmanagement und bildet\nAnsprechpartner mit hoher Expertise für das Tagesgeschäft in allen Belangen\ndes Datenschutzes aus. Die Zertifizierung ist zudem ISO akkreditiert (ISO\n17024:2012).\n\nBitte Qualifikation wählen: Datenschutz IT\n\n  * Volljuristen (2 Staatsexamina), darunter promovierte Rechtsanwälte\n  * Fachanwälte für IT‑Recht, gewerblichen Rechtsschutz, Urheber- und Medienrecht, Versicherungsrecht und Sozialrecht\n  * Master of Laws in IT‑Recht, Medienrecht, Immaterialgüterrecht, Gewerblichen Rechtsschutz und Recht des geistigen Eigentums\n  * Bachelor of Laws für Informationsrecht und Wirtschaftsrecht\n  * ISO 27701 Lead Implementer\n  * TÜV‑zertifizierte Datenschutzbeauftragte und Datenschutzauditoren\n  * Certified Information Privacy Manager (CIPM), Certified Information Privacy Professional (CIPP/E)\n  * IT‑Compliance-Manager (ISACA) und Compliance-Officer (TÜV)\n  * Datenschutzbeauftragte nach Verbandkriterien verpflichtet (BvD)\n\n  * BSI-zertifizierte Auditteamleiter für ISO 27001 auf der Basis von IT‑Grundschutz\n  * ISO/IEC 27001 Lead Auditor, ISO/IEC 27001 Implementer, ISO/IEC 27001 Practitioner\n  * GIAC Certified Forensic Examiner, GIAC Certified Forensic Analyst, GIAC Battlefield Forensics and Acquisition\n  * IT-Sicherheitsbeauftragte (TÜV)\n  * Informatiker und Wirtschaftsinformatiker\n  * Master of Science Informationsmanagement\n  * Bachelor of Science Informatik\n  * Cyber Security Practitioner (ISACA), IT Information Security Practitioner (ISACA)\n  * Cloud Information Security (ISO 27017/27018)\n\nVertrauen auch Sie einem der führenden Dienstleister im Datenschutz. Hier\nunverbindlich anfragen\n\n## Unser Ablauf\n\n  * ### Eingang Ihrer Anfrage\n\nNach dem Eingang Ihrer Anfrage setzen wir uns schnellstmöglich mit Ihnen in\nVerbindung, um den konkreten Bedarf im Bereich externer\nDatenschutzbeauftragter abzustimmen. Dabei gehen wir bestmöglich auf Ihre\nindividuellen Wünsche und Vorstellungen ein. Auch außerhalb unserer\nGeschäftszeiten können Sie per E-Mail jederzeit Kontakt mit uns aufnehmen.\n\n  * ### Angebot\n\nAuf Basis der ersten Bedarfsermittlung erstellen wir für Sie zeitnah ein\nAngebot für die Stellung eines externen Datenschutzbeauftragten. Außerdem\nbieten wir einen ersten Kennlerntermin bei Ihnen im Haus an. Dabei stellen wir\nIhnen unser Unternehmen, Ihren potenziellen externen Datenschutzbeauftragten\nsowie unser Angebot persönlich vor und können dieses gemeinsam final\nabstimmen.\n\n  * ### Vertragsabschluss\n\nWenn wir Sie von uns und unserer Vorgehensweise im Datenschutz überzeugen\nkonnten, erhalten Sie als Grundlage für unsere Zusammenarbeit einen\nVertragsentwurf. Dieser kann selbstverständlich an Ihre Vorstellungen\nangepasst werden. Sobald der Vertrag geschlossen ist, übernehmen wir auf\nWunsch für Sie die Meldung Ihres externen Datenschutzbeauftragten an die\nzuständige Aufsichtsbehörde.\n\n  * ### Datenschutz-Check\n\nZu Beginn unserer Zusammenarbeit führt der externe Datenschutzbeauftragte\neinen Datenschutz-Check in Ihrem Unternehmen durch. Er erfasst vor Ort in\nIhrem Unternehmen die datenschutzrelevanten Prozesse und Systeme nach der\nDSGVO, analysiert diese auf Schwachstellen und bewertet sie nach\nRisikopotenzialen im Datenschutz. Zur Beseitigung von Schwachstellen im\nDatenschutz erarbeitet der externe Datenschutzbeauftragte praxisorientierte\nHandlungsempfehlungen. Die Ergebnisse des Datenschutz-Checks werden in einem\numfassenden Bericht für Sie dokumentiert.\n\n  * ### Laufende Betreuung\n\nWährend der laufenden Betreuung im Datenschutz unterstützen wir Sie in der\nFunktion des externen Datenschutzbeauftragten bei der Umsetzung der\nempfohlenen Maßnahmen aus dem Datenschutz-Check, ohne Geschäftsprozesse\nunnötig zu beeinträchtigen. Darüber hinaus stehen wir Ihnen und Ihren\nMitarbeitern bei sämtlichen Belangen des Datenschutzes nach der EU-DSGVO\nberatend zur Verfügung, um praktikable Lösungen unter Berücksichtigung der\ngesetzlichen Vorgaben sowie Ihrer Geschäftsziele und Ihrer Unternehmenskultur\nzu realisieren.\n\n## Kosten eines externen Datenschutz­beauftragten\n\nFür die Ermittlung der Kosten für die Bestellung eines externen\nDatenschutzbeauftragten hat sich ein sorgfältiges individuelles Vorgehen\nbewährt, um speziell auf Ihre Gegebenheiten eingehen zu können. Wir bieten\nkeine Standards, sondern beziehen die ganz persönlichen Prozesse und\nStrukturen Ihres Unternehmens im Umgang mit personenbezogenen Daten mit ein.\nBei der Kostenermittlung kommt uns ein großer Erfahrungsschatz zu Gute, damit\nwir Ihnen ein treffsicheres Angebot im Datenschutz zuschneiden können, das\nIhren Wünschen entspricht.\n\nDatenschutz-Profis: alle Branchen, alle Unternehmensstrukturen. Hier\nunverbindlich anfragen\n\n## Gegenüberstellung interner vs. externer DSB\n\n  \n\nint. DSBinterner DSB\n\next. DSBexterner DSB\n\nVorhandene fachliche Qualifikation\n\nZeit- und kostenintensiver Schulungsaufwand bis zur Erlangung der fachlichen\nQualifikation erforderlich.\n\nKein Kündigungsschutz\n\nSonderkündigungsschutz von internen Datenschutzbeauftragten mit den von\nBetriebsräten vergleichbar.\n\nTransparente Kosten\n\nUnsere Kostenkalkulation bietet Ihnen klare Transparenz und\nPlanungssicherheit.\n\nUnvoreingenommene Herangehensweise\n\nBeim internen Datenschutzbeauftragten besteht das Risiko von\nBetriebsblindheit.\n\nKenntnis betrieblicher Prozesse\n\nDer externe Datenschutzbeauftragte muss sich erst in betriebliche Prozesse\neinarbeiten.\n\nFreihaltung interner Ressourcen\n\nUnsere personellen Ressourcen reduzieren den internen Zeitaufwand auf ein\nMinimum.\n\nKein Mitbestimmungsrecht des Betriebsrats\n\nDas Mitbestimmungsrecht des Betriebsrats (§ 99 BetrVG) entfällt beim externen\nDatenschutzbeauftragten.\n\nErfahrung aus anderen Unternehmen\n\nErfahrung aus anderen Unternehmen bieten Vergleichsmöglichkeiten und\npraxisnahe Lösungen.\n\nUnabhängiger Datenschutz\n\nDer interne Datenschutzbeauftragte wird von Dritten als parteiisch gesehen.\n\nNeutrale Position\n\nNeutrale Position hilft bspw. beim Vermitteln zwischen Unternehmen,\nBetriebsrat und Mitarbeitern.\n\n## Häufige Fragen zum Datenschutzbeauftragten\n\nWir sagen Ihnen, was Sie über die Funktion des Datenschutzbeauftragten wissen\nsollten.  \n\n###  Wann ist ein Unternehmen gesetzlich dazu verpflichtet, einen\nDatenschutzbeauftragten zu benennen?\n\nNach § 38 BDSG besteht die Verpflichtung, einen Datenschutzbeauftragten zu\nbenennen, wenn in der Regel mindestens 20 Personen mit der automatisierten\nVerarbeitung personenbezogener Daten beschäftigt sind. Die Verarbeitung ist\ndann automatisiert, wenn sie unter Einsatz von Datenverarbeitungsanlagen wie\nzum Beispiel einem Computer / Tablet im Unternehmen erfolgt. Darüber hinaus\nbesteht die Pflicht zur Benennung eines internen oder externen\nDatenschutzbeauftragten, wenn Verarbeitungen vorgenommen werden, die einer\nDatenschutz-Folgenabschätzung unterliegen, oder personenbezogene Daten\ngeschäftsmäßig für Zwecke der Markt- oder Meinungsforschung verarbeitet\nwerden. Auch gilt im Datenschutz die Pflicht zur Benennung eines\nDatenschutzbeauftragten, wenn die Kerntätigkeit des Unternehmens in einer\numfangreichen Verarbeitung besonderer Kategorien von Daten oder von\npersonenbezogenen Daten über Verurteilungen und Straftaten besteht. Falls Sie\nsich nicht sicher sind, ob Sie im Unternehmen einen Datenschutzbeauftragten\nbenennen müssen, fragen Sie uns gern.\n\n###  Wie sieht der Arbeitsalltag eines Datenschutzbeauftragten aus?\n\nDer interne oder externe Datenschutzbeauftragte beantwortet Fragestellungen im\nDatenschutz aus dem Unternehmen heraus. Er berät die Geschäftsführung im\nUmgang mit personenbezogenen Daten nach der EU-DSGVO bei der Einführung neuer\nProzesse, schreibt Stellungnahmen über die Zulässigkeit von geplanten oder\nschon durchgeführten Datenverarbeitungen. Der Datenschutzbeauftragte ist\ndarüber hinaus die Anlaufstelle im Datenschutz für die Aufsichtsbehörde. In\ndieser Position kommuniziert er mit der Aufsichtsbehörde bei Fragen gegenüber\ndem Unternehmen oder im Rahmen von datenschutzrechtlichen Überprüfungen. Eine\nwiederkehrende Aufgabe des Datenschutzbeauftragten ist die Unterstützung des\nUnternehmens bei der Durchführung einer Datenschutz-Folgenabschätzung (DSFA).\nDer interne oder externe Datenschutzbeauftragte gibt entscheidenden Rat bei\nder Beurteilung, ob eine DSFA durchzuführen ist, er berät über die Strategie\nbei der Durchführung und im Nachgang, ob die DSFA richtig vorgenommen wurde\nund, ob die Schlussfolgerungen mit den Datenschutzgesetzen übereinstimmen.\n\nDie stetige Weiterbildung im Datenschutz stellt ebenfalls einen wichtigen\nAspekt im Alltag des internen oder externen Datenschutzbeauftragten dar. Zum\neinen bildet er sich stetig zu Fragen des Datenschutzes und der\nDatensicherheit weiter, zum anderen schult er Ihre Mitarbeiter nach der EU-\nDSGVO und sensibilisiert diese auf aktuelle Anforderungen an eine\nDatenverarbeitung. Darüber hinaus steht der Datenschutzbeauftragte betroffenen\nPersonen als Ansprechpartner im Unternehmen für sämtliche Fragen rund um die\nVerarbeitung ihrer personenbezogenen Daten und der Wahrnehmung ihrer Rechte im\nDatenschutz zur Verfügung.\n\n###  Wie ist ein Datenschutzbeauftragter zu benennen?\n\nEine schriftliche Benennung, wie sie noch nach alter Rechtslage im Datenschutz\ngefordert wurde, wird durch die DSGVO nicht mehr vorgeschrieben. Aus\nBeweisgründen und zur Rechtsklarheit ist eine schriftliche Benennung von\nDatenschutzbeauftragten jedoch empfehlenswert. Zudem wird empfohlen, die\nAufgaben der Datenschutzbeauftragten durch den Verantwortlichen im Vertrag\nexplizit festzuhalten, damit sich Verantwortliche und Datenschutzbeauftragte\nüber die Aufgaben im Klaren sind. Da – anders als bisher in § 4f Abs. 1 S. 2\nBDSG – keine Frist geregelt ist, ist die Pflicht sofort zu erfüllen, sobald\ndie Voraussetzungen vorliegen. Das Unternehmen veröffentlicht schließlich die\nKontaktdaten des Datenschutzbeauftragten und teilt diese Daten der zuständigen\nAufsichtsbehörde mit. Damit ist die Bestellung des internen oder externen\nDatenschutzbeauftragten abgeschlossen.\n\n###  Welche Voraussetzungen muss der Datenschutzbeauftragte erfüllen?\n\nDatenschutzbeauftragte müssen eine ausreichende berufliche Qualifikation und\nPraxiserfahrung im Datenschutz mitbringen, sowie die Fähigkeit, die in Art. 39\nDSGVO definierten Aufgaben zu erfüllen. Die DSGVO enthält keine konkreten\nVorgaben hinsichtlich der relevanten Qualifikation.\n\nDas notwendige Niveau der Expertise im Datenschutz richtet sich nach dem\nerforderlichen Schutz für die personenbezogenen Daten, die das Unternehmen\nverarbeitet. Hier gilt, dass je komplexer die Datenverarbeitungen im\nEinzelfall sind oder je größer die Menge sensibler Daten ist, desto höhere\nAnforderungen sind an das Fachwissen des Datenschutzbeauftragten zu stellen.\n\nUnsere fachkundigen externen Datenschutzbeauftragten sind den Aufgaben im\nUmgang mit personenbezogenen Daten gewachsen, da sie ständig geschult werden\nund aus ihrer Erfahrung heraus, eine hohe Beratungskompetenz sicherstellen.\n\n###  Ist der Datenschutzbeauftragte persönlich für die Einhaltung der DSGVO\nverantwortlich?\n\nDatenschutzrechtlich verantwortlich für die Einhaltung der DSGVO ist diejenige\nStelle, die über die Zwecke und Mittel der Verarbeitung entscheidet. Dies ist\nimmer das Unternehmen und nie der Datenschutzbeauftragte.\n\nDem internen oder externen Datenschutzbeauftragten obliegt gem. Art. 39 DSGVO\ndie Aufgabe, das Unternehmen sowie deren Beschäftigte, über ihre\ndatenschutzrechtlichen Pflichten zu unterrichten und im Datenschutz zu\nberaten. Hier ist der Datenschutzbeauftragte gefordert, nicht lediglich die\neinschlägigen Vorschriften nach der DSGVO wiederzugeben, sondern das\nUnternehmen aktiv beim Lösen von konkreten Problemen zu unterstützen, die bei\nder Umsetzung von Maßnahmen auftauchen können. Der interne oder externe\nDatenschutzbeauftragte haftet bei vorsätzlicher oder grober Fahrlässigkeit in\nvollem Umfang. Bei normaler Fahrlässigkeit kommt es zu einer quotalen\nVerteilung zwischen Arbeitgeber und Arbeitnehmer. Eine Haftung des internen\nDatenschutzbeauftragten bei leichter Fahrlässigkeit scheidet regelmäßig aus.\nAnders stellt sich die Lage beim externen Datenschutzbeauftragten dar. Kommt\ndieser seinen vertraglichen Beratungspflichten nicht im erforderlichen Umfang\nnach, etwa aufgrund einer Falschberatung, sind vertragliche\nSchadensersatzansprüche in vollem Umfang denkbar. Auch aus diesem Grund ist\ndie Bestellung eines externen Datenschutzbeauftragten für Unternehmen\nvorteilhaft.\n\n###  Wie sieht die Zusammenarbeit des Datenschutzbeauftragten mit der\nAufsichtsbehörde aus?\n\nDie Pflicht zur Zusammenarbeit und Kooperation mit der Aufsichtsbehörde nach\nder DSGVO stellt im Vergleich zu der alten Rechtslage eine wichtige Neuerung\nim Datenschutz dar. Damit sind interne oder externe Datenschutzbeauftragte\nberechtigt, direkt mit der Aufsichtsbehörde zu kommunizieren. Dieser Umstand\nist auch für die Aufsichtsbehörde von Bedeutung, die sich in der Vergangenheit\nin erster Linie an die Unternehmensleitung zu wenden hatte.\n\nDer interne oder externe Datenschutzbeauftragte wird hier in enger Abstimmung\nmit der Geschäftsführung die Kommunikation mit den Aufsichtsbehörden pflegen.\n\n## Kontaktieren Sie uns\n\nJulia Reiter\n\nVertriebsleiterin\n\nGern beantworten wir Ihre Fragen oder erstellen Ihnen ein individuelles\nAngebot. Hier unverbindlich anfragen\n\n**PDF-Download**  \n\n  * Externer Datenschutzbeauftragter\n  * Über uns\n  * Was uns auszeichnet\n\nStandorte\n\nAls externer Datenschutzbeauftragter sind wir auch vor Ort in Hamburg, Berlin,\nKöln, Frankfurt, Stuttgart und München.\n\nKostenloser Newsletter\n\nMit unserem Blog „Dr. Datenschutz“ sind Sie zu den Themen Datenschutz, Recht\nund IT immer informiert. Melden Sie sich hier zum Newsletter an.\n\n  * Home\n  * Impressum\n  * Datenschutzerklärung\n  * Cookie-Consent\n\n  * Hier können Sie uns folgen:\n  * Dr. Datenschutz-Blog\n  * Dr. Datenschutz Podcast\n  * Twitter\n  * LinkedIn\n  * XING\n\nTelefonnummer [DE]\n\nSie erreichen uns telefonisch unter: 0800 300 9 100\n\nNEWSLETTERInfos zum Unternehmenkostenlose WebinareFachbeiträge\n\nIT‐Vorfall? Ransomware? Hacking?\n\nIT‐Vorfall? Ransomware? Hacking?\n\n**Rufen Sie unsere 24‑Stunden-Hotline an (nur für Unternehmen):**\n\n0180 622 124 6\n\n20 Ct./Anruf aus dem Festnetz,  \nMobilfunk max. 60 Ct./Anruf\n\nUnsere Experten für IT‑Forensik und IT‑Sicherheit sind im Notfall für Sie da\nund bieten Ihnen sofortige Unterstützung.\n\n  * BSI anerkannter APT-Response-Dienstleister\n  * GIAC-zertifizierte IT‑Forensiker\n  * sofortige Reaktion auf IT‑Vorfälle\n  * Gerichtsverwertbare Dokumentation\n  * Unterstützung zum Normalbetrieb\n\nDa sich unser Angebot nur an Unternehmen richtet, wenden sich Privatpersonen\nbitte an die lokale Polizeidienststelle.\n\n**Unsere Kontaktdaten als QR‑Code:**\n\n****************\n\nplay-rounded-fill play-rounded-outline play-sharp-fill play-sharp-outline\n\npause-sharp-outline pause-sharp-fill pause-rounded-outline pause-rounded-fill\n\n00:00\n\n______________\n\n****\n\nWir bitten um Ihre Zustimmung\n\nWir verwenden Cookies und andere Technologien auf unserer Website. Manche sind\nessenziell, andere helfen uns diese Website zu verbessern und den Erfolg\nunserer Kampagnen zu messen. Dabei werden (personenbezogene) Daten bei der\nNutzung unserer Website für Anzeigen- und Inhaltsmessung verarbeitet. Weitere\nInformationen dazu finden Sie in unserer Datenschutzerklärung. Sie können Ihre\nAuswahl jederzeit unter Einstellungen widerrufen oder anpassen.\n\nWir bitten um Ihre Zustimmung\n\n  * Essenziell \n  * Statistiken \n  * Marketing \n\nAllem zustimmen\n\nAuswahl bestätigen\n\nCookie-Details\n\nn.v.  Datenschutzerklärung  Impressum\n\nCookie-Details\n\nHier finden Sie weitere Informationen zu den verwendeten Cookies.\n\nAllem zustimmen  Auswahl bestätigen\n\nZurück\n\nCookie-Details\n\nEssenziell (1)\n\nDer Borlabs-Cookie speichert die Angaben, die Sie hier im Consent-Tool\ntreffen. Dies ist zum datenschutzkonformen Betrieb der Website erforderlich.\n\nCookie-Informationen anzeigen  Cookie-Informationen ausblenden\n\nName |  Borlabs Cookie  \n---|---  \nAnbieter | intersoft consulting services AG, Impressum  \nZweck | Speichert die Einstellungen der Besucher, die in der Cookie Box von\nBorlabs Cookie ausgewählt wurden. Die Rechtsgrundlage ist § 25 Abs. 2 Nr. 2\nTTDSG, Art. 6 Abs. 1 S. 1 lit. c) DSGVO.  \nHost(s) | intersoft-consulting.de  \nCookie Name | borlabs-cookie  \nCookie Laufzeit | 12 Monate  \n  \nStatistiken (1)\n\nStatistiken\n\nWir verwenden Matomo zur datenschutzfreundlichen Webanalyse. Die\nanonymisierten Daten liegen auf unseren Servern und werden nicht an Dritte\nweitergegeben.\n\nCookie-Informationen anzeigen  Cookie-Informationen ausblenden\n\nAkzeptieren |  Matomo Tag Manager  \n---|---  \nName |  Matomo Tag Manager  \nAnbieter | intersoft consulting services AG  \nZweck | Matomo Tag Manager steuert das Matomo-Script zur Webanalyse. Die im\nCookie erfassten Nutzungsinformationen (einschließlich Ihrer gekürzten IP-\nAdresse) werden an unseren Server übertragen und zu Nutzungsanalysezwecken\ngespeichert. Weitere Informationen finden Sie in unserer Datenschutzerklärung.\nDie Rechtsgrundlage § 25 Abs. 1 TTDSG, Art. 6 Abs. 1 S. 1 lit. a) DSGVO.  \nHost(s) | m.intersoft-consulting.de  \nCookie Name | _pk_id, _pk_ses, _pk_ref  \nCookie Laufzeit | 12 Monate  \n  \nMarketing (3)\n\nMarketing\n\nUm den Erfolg unserer Werbeanzeigen zu messen, setzen wir Cookies ein. Die\nRechtsgrundlage für diese Datenverarbeitung ist § 25 Abs. 1 TTDSG, Art. 6 Abs.\n1 S. 1 lit. a) DSGVO (Einwilligung).\n\nCookie-Informationen anzeigen  Cookie-Informationen ausblenden\n\nAkzeptieren |  AFL  \n---|---  \nName |  AFL  \nAnbieter | intersoft consulting services AG  \nZweck | Dieses Cookie speichert die Click-ID Quelle (bspw. Google Ads oder\nBing Ads), Click-ID der Werbeanzeige, Matomo Client-ID und die UTM-Parameter.\nDamit können wir den Erfolg einer Kampagne messen. Weitere Informationen\nfinden Sie in unserer Datenschutzerklärung.  \nHost(s) | intersoft-consulting.de  \nCookie Name | afl_wc_utm_cookie_expiry, afl_wc_utm_gclid_url,\nafl_wc_utm_gclid_visit, afl_wc_utm_sess_landing, afl_wc_utm_sess_visit,\nafl_wc_utm_utm_1st_url, afl_wc_utm_utm_1st_visit, afl_wc_utm_utm_url,\nafl_wc_utm_utm_visit, afl_wc_*  \nCookie Laufzeit | 90 Tage  \nAkzeptieren |  Ads Tracking  \n---|---  \nName |  Ads Tracking  \nAnbieter | Google LLC, 1600 Amphitheatre Pkwy, Mountain View, California\n94043-1351, USA  \nZweck | test_cookie: Dieses Cookie wird testweise gesetzt, um zu prüfen, ob\nder Browser das Setzen von Cookies zulässt. Dieses Cookie enthält keine\nIdentifikationsmerkmale. IDE: Das Cookie enthält eine zufällig generierte\nBenutzer-ID. Anhand dieser ID kann Google den Nutzer über verschiedene\nWebsites domainübergreifend wiedererkennen und ihm personalisierte Werbung\nanzeigen. _gcl_aw, _gcl_dc_ (Erfolgsmessung): Diese Cookies werden gesetzt,\nwenn ein Nutzer auf eine Google-Anzeige klickt, um auf die Website zu\ngelangen. Sie enthalten Informationen darüber, auf welche Anzeige geklickt\nwurde, sodass erzielte Erfolge, wie Bestellungen oder Kontaktanfragen, der\nAnzeige zugeordnet werden können.  \nHost(s) | doubleclick.net, google.com  \nCookie Name | test_cookie, IDE, _gcl_aw, _gcl_dc_  \nCookie Laufzeit | test_cookie = 15 Minuten, IDE = 12 Monate, _gcl_aw = 2\nMonate 29 Tage, _gcl_dc_ = 2 Monate, 29 Tage  \nAkzeptieren |  Google Tag Manager  \n---|---  \nName |  Google Tag Manager  \nAnbieter | Google Ireland Limited, Gordon House, Barrow Street, Dublin 4,\nIreland  \nZweck | Der Google Tag Manager erleichtert uns die Einbindung, zentrale\nVerwaltung und zeitliche Steuerung unserer Tags. Tags sind Skriptcodes bzw.\nCodeabschnitte, die unterschiedliche Funktionalitäten auslösen können,\nbeispielsweise die Erfolgsmessung unserer Werbeanzeigen (Google Ads). Der\nGoogle Tag Manager erfasst selbst keine personenbezogenen Daten, übermittelt\ngegebenenfalls jedoch die IP-Adresse an Google. Weitere Informationen finden\nSie in unserer Datenschutzerklärung.  \nHost(s) | google.com  \n  \nDatenschutzerklärung  Impressum\n\n",
    "links": "[{\"link\": \"https://www.intersoft-consulting.de/externer-datenschutzbeauftragter/\", \"text\": \"\"}, {\"link\": \"https://www.intersoft-consulting.de/externer-datenschutzbeauftragter/schweiz/\", \"text\": \"Externer Datenschutzberater Schweiz\"}, {\"link\": \"https://www.intersoft-consulting.de/externer-datenschutzbeauftragter/interim/\", \"text\": \"Interim-Datenschutzbeauftragter\"}, {\"link\": \"https://www.intersoft-consulting.de/externer-datenschutzbeauftragter/\", \"text\": \"Externer Datenschutzbeauftragter\"}, {\"link\": \"https://www.intersoft-consulting.de/externer-datenschutzbeauftragter/hamburg/\", \"text\": \"Hamburg\"}, {\"link\": \"https://www.intersoft-consulting.de/externer-datenschutzbeauftragter/berlin/\", \"text\": \"Berlin\"}, {\"link\": \"https://www.intersoft-consulting.de/externer-datenschutzbeauftragter/koeln/\", \"text\": \"Köln\"}, {\"link\": \"https://www.intersoft-consulting.de/externer-datenschutzbeauftragter/frankfurt/\", \"text\": \"Frankfurt\"}, {\"link\": \"https://www.intersoft-consulting.de/externer-datenschutzbeauftragter/stuttgart/\", \"text\": \"Stuttgart\"}, {\"link\": \"https://www.intersoft-consulting.de/externer-datenschutzbeauftragter/muenchen/\", \"text\": \"München\"}, {\"link\": \"https://www.intersoft-consulting.de/externer-datenschutzbeauftragter/\", \"text\": \"externer Datenschutzbeauftragter\"}, {\"link\": \"https://www.intersoft-consulting.de/externer-datenschutzbeauftragter/hamburg/\", \"text\": \"Hamburg\"}, {\"link\": \"https://www.intersoft-consulting.de/externer-datenschutzbeauftragter/berlin/\", \"text\": \"Berlin\"}, {\"link\": \"https://www.intersoft-consulting.de/externer-datenschutzbeauftragter/koeln/\", \"text\": \"Köln\"}, {\"link\": \"https://www.intersoft-consulting.de/externer-datenschutzbeauftragter/frankfurt/\", \"text\": \"Frankfurt\"}, {\"link\": \"https://www.intersoft-consulting.de/externer-datenschutzbeauftragter/stuttgart/\", \"text\": \"Stuttgart\"}, {\"link\": \"https://www.intersoft-consulting.de/externer-datenschutzbeauftragter/muenchen/\", \"text\": \"München\"}]"
}