{
    "summary": "__+49 (0)89 1891 7360 __email@iitr.de __ __\n\nSprache auswählen\n\n  * EN \n\n  * __Login\n    * Login Datenschutz-Kit & Compliance-Kit\n    * Login eLearning\n  * Blog\n\n  * __Login\n    * Login Datenschutz-Kit & Compliance-Kit\n    * Login eLearning\n  * Blog\n\nSprache auswählen\n\n  * EN \n\n  * Startseite\n  *  __Leistungen\n    * Datenschutz-Kit\n    * Externer Datenschutzbeauftragter\n    * Datenschutz Schulung\n    * Datenschutz Audit\n    * Datenschutzmanagementsystem (Compliance-Kit)\n    * Informationssicherheits-Managementsystem (ISMS-Kit)\n    * Hinweisgebersystem\n  *  __Tools\n    * Datenschutz-Check\n    * DSGVO Handbuch\n    * Audit Cyber-Security \n    * Audit Privacy-Check\n    * Datenschutz-Videos\n    * Generator Datenschutzerklärung\n    * Generator AVV\n  *  __Unternehmen\n    * Über uns\n    * Vertriebspartner\n    * Karriere\n\nMenu\n\n  1.   2. Startseite\n  3. Produkte & Services\n  4. Externer Datenschutzbeauftragter\n\n#  Externer Datenschutzbeauftragter\n\n  * Flexible Lösungen für kleine und große Unternehmen\n  * Individuelle Beratung vom Datenschutz-Experten\n  * Zertifizierte Datenschutz-Qualität\n\nProdukte vergleichen Kostenlose Beratung Angebot anfordern\n\nExpertise | Vorteile  | Ablauf | Informationen | Gründe | FAQ\n\n## Was ist ein externer Datenschutzbeauftragter\n\nEin **externer Datenschutzbeauftragter** (DSB) fungiert als zentraler\nBestandteil einer Organisation, der eine entscheidende Rolle spielt, wenn es\ndarum geht, die Vertraulichkeit und Integrität personenbezogener Daten zu\nwahren. Er ist nicht direkt in das Unternehmen integriert, sondern handelt\nunabhängig, um eine unparteiische und objektive Bewertung der\nDatenschutzpraktiken des Unternehmens zu gewährleisten.\n\nZu den Aufgaben des externen Datenschutzbeauftragten gehören insbesondere die\nBeratung der Geschäftsleitung hinsichtlich der Einhaltung der\ndatenschutzrechtlichen Bestimmungen und die Umsetzung der\ndatenschutzrechtlichen Vorgaben in die organisatorischen Strukturen und\nProzesse des Unternehmens. Er überwacht die korrekte Anwendung der\nDatenschutzgrundsätze, führt Schulungen durch, um das Bewusstsein für\nDatenschutzfragen zu schärfen, und vermittelt zwischen den Interessen\nAußenstehender und des Unternehmens.\n\n### Ihre passende Datenschutz-Lösung\n\n  \n\n### Externer DSB für kleine Unternehmen\n\n32,50 €/Monat\n\n  * Für Unternehmen bis 20 Beschäftigte\n  * Inklusive Datenschutz Software\n  * Inklusive Online Schulungen und Webinare\n\nAngebot anfordern\n\n  \n\n### Externer DSBfür mittlere Unternehmen\n\n290 €/Monat\n\n  * Für Unternehmen bis 50 Mitarbeiter\n  * Inklusive Datenschutzsoftware\n  * Inklusive Online Schulungen und Beratungskontingent\n\nAngebot anfordern\n\n  \n\n### Externer DSB für mittlere - große Unternehmen\n\nIndividuelles Angebot\n\n  * Für Unternehmen ab 50 Beschäftigte\n  * Beratung vom zertifizierten DSGVO Experten\n  * Inklusive Datenschutzmanagement­system\n\nBeratungstermin vereinbaren\n\n\n\n## Vorteile externer Datenschutzbeauftragter\n\nDie sich ständig ändernden und immer komplexer werdenden\ndatenschutzrechtlichen Anforderungen stellen insbesondere für kleine und\nmittlere Unternehmen eine enorme Herausforderung dar. Ohne Zugriff auf\nspezifisches Fachwissen ist es kaum möglich, diesen Anforderungen effektiv zu\nbegegnen.  \n  \nUm diese Herausforderungen zu bewältigen, bieten wir Ihnen die Dienste eines\nexternen Datenschutzbeauftragten an. Diese Expertenrolle erfüllt nicht nur die\ngrundlegenden gesetzlichen Anforderungen, sondern stellt auch sicher, dass Ihr\nUnternehmen in allen Fragen des Datenschutzes kompetent beraten wird. Bei\nallen datenschutzrechtlichen Herausforderungen stehen wir Ihnen jederzeit als\nzuverlässiger Partner zur Seite.  \n  \nDurch unsere langjährige und branchenübergreifende Erfahrung haben wir ein\nbreites Spektrum an datenschutzrechtlichen Fragestellungen gemeistert. So\nkönnen wir Ihnen effiziente und praxisnahe Lösungen anbieten, die Ihnen\nhelfen, Ihren datenschutzrechtlichen Verpflichtungen nachzukommen und sich\ngleichzeitig auf Ihr Kerngeschäft zu konzentrieren.\n\nKompetent & unabhängig\n\nWir unterstützen Sie auf Grundlage der aktuellen Gesetzeslage und greifen auf\njahrelange Erfahrung im betrieblichen Datenschutz zurück. Unsere Berater\nfungieren ideal als freie und neutrale Instanz zur Wahrung\ndatenschutzrechtlicher Belange in Ihrem Unternehmen (gemäß den Vorgaben des\nGesetzgebers).\n\n\n\nExpertise für kleine & mittlere Unternehmen\n\nExterne Datenschutzbeauftragte unterstützen insbesondere kleinere und mittlere\nUnternehmen durch ihre Expertise auf dem Gebiet des Datenschutzes. Das spart\nIhnen zudem teure interne Ressourcen, die Sie andernfalls in einen eigenen\nDatenschutzbeauftragten investieren müssten.\n\n\n\nMaßgeschneiderte Datenschutzberatung\n\nAls externer Dienstleister stimmen wir unsere Beratungsleistungen individuell\nauf die Anforderungen Ihres Unternehmens ab. Zudem profitieren Sie von unserer\nErfahrung aus anderer Zusammenarbeit. Als externer Berater sind wir zudem eine\nneutrale Instanz ohne klassische „Betriebsblindheit“.\n\n\n\nUnterstützung im Arbeitsalltag\n\n Während Ihr externer Datenschutzbeauftragter Sie in allen Fragen des\nDatenschutzes unterstützt, können Sie sich ungestört Ihrem Tagesgeschäft\nwidmen.\n\n\n\n* * *\n\n## Ihre Datenschutzexperten von IITR\n\nBei der Benennung Ihres externen Datenschutzbeauftragten über die IITR\nDatenschutz GmbH werden Ihnen qualifizierte Datenschutzberater zur Seite\ngestellt. Erfahren Sie mehr über Qualifikation und fachliche Schwerpunkte\nunseres Teams:\n\nDr. Sebastian Kraska\n\n  * Rechtsanwalt mit Schwerpunkt Datenschutzrecht\n  * Beirat der Zeitschrift für Datenschutz (ZD)\n\nMichael Wehowsky\n\n  * Zertifizierter Datenschutzbeauftragter (udis)\n  * Certified Information Privacy Professional Europe (CIPP/E, iapp)\n\nSabine Schmitt-Hennig\n\n  * Rechtsanwältin und zertifizierte Datenschutz-Auditorin\n  * Langjährige Erfahrung im Bereich IT und Kommunikations­technologien\n\nLernen Sie das ganze Team kennen\n\n## Unsere Expertise im betrieblichen Datenschutz\n\nDie IITR Datenschutz GmbH bietet Ihnen ein zertifiziertes Datenschutz-\nManagement-System nach Maßgabe von ISO27701.  \nZudem sind wir Mitglied im Verband DIN.\n\n* * *\n\n## Nur 4 Schritte zu Ihrem externen Datenschutzbeauftragten\n\n __\n\n **Schritt 1: Anfrage**\n\nJe nach Größe Ihres Unternehmens können Sie direkt die Buchung unseres\nDatenschutz-Kits anfragen oder Sie vereinbaren einen Beratungstermin mit\nunseren Mitarbeitern.\n\n __\n\n **Schritt 2: Angebot**\n\nUnsere Datenschutzexperten erstellen für Sie ein passendes Angebot, das zu\nIhrem Unternehmen passt.\n\nHierbei führen wir auch eine erste Bedarfsanalyse durch, sodass unser Angebot\nbestmöglich auf die Art Ihrer Organisation abgestimmt ist.\n\n __\n\n **Schritt 3: Vertrag**\n\nZusammen mit dem Vertragsabschluss erhalten Sie ebenfalls ein begleitendes\nMuster darüber, dass sie Ihren Datenschutzbeauftragten über uns bestellt\nhaben.\n\nDas dient Ihnen direkt als Dokumentierung gegenüber den Aufsichtsbehörden.\n\n __\n\n **Schritt 4: Betreuung**\n\nNach Vertragsabschluss stehen Ihnen je nach Vereinbarung unterschiedliche\nLeistungen wie Schulungen, Datenschutz-Management-System und Beratung von\nzertifizierten Datenschutzexperten zur Verfügung.\n\nGerne unterstützen wir Sie auch bei einem Datenschutz-Audit in Ihrem\nUnternehmen.\n\n##  Wichtige Informationen zum  \nexternen Datenschutz­beauftragten\n\n## Wer braucht einen _externen Datenschutzbeauftragten_?\n\nVereinfacht gesprochen: Jedes Unternehmen in Deutschland mit 20 Mitarbeitern\noder mehr, die Zugriff auf personenbezogene Daten haben, benötigt nach der EU-\nDSGVO einen internen oder externen Datenschutzbeauftragten. Das sind die\nwesentlichen Bedingungen für die gesetzliche Meldepflicht.\n\nDie Mitarbeiterzahl ist jedoch nicht das einzige Kriterium. Auch beim Umgang\nmit sensiblen Kundendaten wird ein Datenschutzbeauftragter durch die DSGVO\nvorgeschrieben. Ein Beispiel hierfür ist die Verarbeitung von sensiblen\nGesundheitsdaten. Auch deshalb entscheiden sich Unternehmen häufig für die\nBestellung interner oder externer Datenschutzbeauftragter. Das ist eben dann\nder Fall, wenn aus anderen Gründen eine professionelle Befassung des\nUnternehmens mit den datenschutzrechtlichen Anforderungen angezeigt ist.\n\nDatenschutz-Check starten\n\n## Wann brauche ich einen _externen Datenschutzbeauftragten_?\n\nDer Datenschutzbeauftragte unterstützt Sie dabei, die gesetzlichen\nAnforderungen im Datenschutz zu erfüllen. Der Gesetzgeber verpflichtet\nUnternehmen unter der EU-DSGVO dazu, ihre eigene Datenschutzkonformität nicht\nnur punktuell, sondern strukturell nachweisen zu können. Externe\nDatenschutzbeauftragte beraten Sie bei datenschutzrechtlichen Fragen und\nProblemstellungen der datenschutzrechtlichen Zulässigkeit. Zudem gibt er Ihnen\nEmpfehlungen an die Hand, wie Sie die Datenschutz-Anforderungen in die\nbetriebliche Praxis überführen können.\n\n## Was ist wichtig _unter der EU-DSGVO_?\n\nUnternehmen sollten unter der EU-DSGVO insbesondere folgende Themen behandeln:\n\n  * Erstellen einer Datenschutzrichtlinie\n  * Dokumentation der Prozesse,   \nwelche personenbezogene Daten verarbeiten  \n(das so genannte „Verzeichnis der Verarbeitungstätigkeiten“)\n\n  * Vertragsverhältnis mit Dritt-Dienstleistern   \n(Stichwort „Auftragsverarbeitungsvertrag“)\n\n  * Einhaltung von Mindeststandards im Bereich IT-Sicherheit\n  * Schulung der Beschäftigten\n\nSämtliche dieser Punkte können für Unternehmen mit ca. 20 Mitarbeitern über\nunser Datenschutz-Kit sowie für größere Unternehmen unser Compliance-Kit 2.0\nabgebildet werden.\n\n## Wer kann _Datenschutzbeauftragter_ werden?\n\nWer kann Datenschutzbeauftragter werden und wie lange dauert  \ndie Ausbildung zum Datenschutzbeauftragten?\n\nDie Ausbildung zum Datenschutzbeauftragten in der Theorie dauert – je nach\nAnbieter – in der Regel eine Woche. Die Fähigkeit, das theoretische Wissen in\nder Praxis anwenden zu können, benötigt allerdings nach unserer Erfahrung\nmehrere Jahre. Die IAPP (International Association of Privacy Professionals)\nbietet einen ISO-akkreditierten Ausbildungslehrgang im Bereich Datenschutz an.\n\n##  _7 gute Gründe_ für einen externen Datenschutzbeauftragten\n\n1\\. Negative Berichterstattung in der Presse und Verlust von Kundenvertrauen\n\nDer Datenschutzbeauftragte unterstützt die Geschäftsleitung bei der Umsetzung\ndes innerbetrieblichen Datenschutzes und schützt das Unternehmen so vor\nDatenschutzskandalen – inklusive der häufig damit eingehenden negativen\nBerichterstattung in der Presse. Wie zahlreiche Beispiele gezeigt haben, ist\ndies gerade für die Unternehmen von großer Relevanz, deren Angebot sich an\nprivate Endkunden richtet.\n\n2\\. Ärger mit der Aufsichtsbehörde\n\nKonkurrenten, verärgerte Mitarbeiter oder Kunden wenden sich immer wieder an\ndie Datenschutz-Aufsichtsbehörden. Es sollte nach Möglichkeit vermieden\nwerden, bei einer ersten Anfrage der Datenschutz-Aufsichtsbehörden keinen\nDatenschutzbeauftragten vorweisen zu können.\n\n3\\. Bußgeld gegen Geschäftsleitung und Unternehmen\n\nEs droht ein Bußgeld nach der DSGVO, wenn ein Unternehmen einen Beauftragten\nfür den Datenschutz nicht rechtzeitig bestellt. Das Bußgeld kann sowohl gegen\ndie Geschäftsleitung selbst als auch gegen das Unternehmen verhängt werden.\n\n4\\. Aufrechterhaltung der ISO-Zertifizierung\n\nWenn Ihr Unternehmen einer regelmäßigen ISO-Zertifizierung zur\nQualitätssicherung unterzogen wird, wird im Rahmen der Aufrechterhaltung\ndieser Zertifizierung häufig auch geprüft, ob Sie Ihrer Verpflichtung zur\nBestellung eines Datenschutzbeauftragten nachgekommen sind.\n\n5\\. Datenschutzbeauftragter muss häufig in Verträgen benannt werden\n\nWenn Sie mit Partner-Unternehmen, Lieferanten oder Dienstleistern Verträge\nschließen und in diesem Rahmen personenbezogene Daten übermitteln, müssen\ndiese Verträge auch zahlreiche datenschutzrechtliche Klauseln beinhalten.\nDiese sehen häufig eine Nennung des Datenschutzbeauftragten vor.\n\n6\\. Ein externer Datenschutzbeauftragter hat keinen besonderen\nKündigungsschutz\n\nBerufen Sie eine interne Kraft zum Datenschutzbeauftragten, erhält diese einen\nbesonderen Kündigungsschutz. Die DSGVO sieht dies zwar nicht vor, dafür ist\ndieser Schutz aber im Bundesdatenschutzgesetz (BDSG) festgehalten. Dadurch ist\neine Kündigung des Arbeitsverhältnisses Ihres Datenschutzbeauftragten\ngrundsätzlich unzulässig. Einen externen Datenschutzbeauftragten können Sie\ndagegen regulär auf Basis des abgeschlossenen Vertrages fristgerecht kündigen.\n\n7\\. Haftung bei Verstößen\n\nEin interner Datenschutzbeauftragter profitiert in seiner Rolle als\nAngestellter vom innerbetrieblichen Schadensausgleich. Das bringt Mitarbeitern\nErleichterungen bei der Haftung, wenn es zu Pflichtverletzungen kommen sollte.\nIhr externer Datenschutzbeauftragter haftet dagegen schon bei leichter\nFahrlässigkeit in größerem Umfang.\n\nBeratungstermin anfordern\n\nDatenschutz Kurz-Audit\n\nKurz-Audit starten\n\nWarnung! Javascript muss aktiviert sein, damit dieses Formular fehlerfrei\nfunktioniert.\n\nArbeitet Ihr Unternehmen mit besonders sensiblen Daten gem. Art. 9 DSGVO?\n\nDaten mit Bezug auf Gesundheit, Sexualleben, Religion, Ethnizität, Herkunft,\nPolitik, genetische Daten und biometrische Daten, die dazu dienen, natürliche\nPersonen eindeutig zu identifizieren\n\nArbeitet Ihr Unternehmen mit besonders sensiblen Daten gem. Art. 9 DSGVO?\n\nJaNeinIch bin mir nicht sicher\n\nSensibilisieren Sie Ihre Beschäftigten regelmäßig im Datenschutz?\n\nJa, mindestens einmal jährlichJa, aber nicht regelmäßigNein\n\nHaben Sie einen festen Prozess zur Beantwortung datenschutzrechtlicher\nKundenanfragen wie Auskunft oder Löschung?\n\nJa und jeder Mitarbeiter hat davon Kenntnis oder weiß, wo er diesen findetJa,\nwir müssten solche Prozesse dokumentiert habenNein\n\nWissen Sie, wann die unterschiedlichen personenbezogenen Daten gelöscht werden\nmüssen?\n\nWir haben ein festes Löschkonzept für die verschiedenen DatenWir löschen immer\nmal wieder DatenNein, darüber haben wir keine Übersicht\n\nErgebnis\n\nVertriebspartner\n\n **Ihre Angaben**\n\nAnsprechpartner:\n\nName\n\nE-Mail\n\n **Beratungstermin buchen**\n\nIhre bevorzugte Terminart:\n\nBeratungwie\n\nRückrufserviceWeb-Meeting\n\nTelefonnummer\n\nDatum\n\nBevorzugte Uhrzeit:\n\nUhrzeit\n\n09:0010:0011:0012:0013:0014:0015:0016:00\n\n\n\n\n\nFrage 0 / 4\n\n?\n\n\n\n **Bitte füllen Sie alle Fragen aus, um eine erste Auswertung zu Ihrem\nDatenschutz-Niveau zu erhalten.**\n\n **Dieser Test zeigt eine erste Tendenz und deckt bei Weitem nicht alle Themen\ndes Datenschutzes ab.**\n\nNach über vier Jahren DSGVO erwarten die Aufsichtsbehörden, dass zumindest die\nBasisthemen adressiert sind. Durch die Nicht-Einhaltung der Vorgaben zwingt\nman die Aufsicht nahezu Bußgelder zu erlassen.\n\nOffenbar sind noch nicht alle Basisthemen adressiert – dies gilt es nun\nschnellstmöglich nachzuholen.\n\nDas Unternehmen scheint die Erwartungshaltung der Aufsichtsbehörden noch nicht\nzu erfüllen – schließen Sie schnellstmöglich die offenen Themen ab.\n\nDie Aufsichtsbehörden erwarten erfahrungsgemäß eine noch bessere Umsetzung der\nDSGVO\n\nWenn schnell herausgefunden wird, welche offenen Punkte noch bestehen und\ndiese geschlossen werden können, scheint das Unternehmen auf einem guten Weg.\n\nDas Unternehmen scheint auf dem richtigen Weg. Aber nicht vergessen:\nDatenschutz ist ein kontinuierlicher Prozess.\n\n## Was sind die Aufgaben externer Datenschutzbeauftragter?\n\nGrundsätzlich liegen die Aufgaben interner wie auch externer\nDatenschutzbeauftragter in der Einhaltung des betrieblichen Datenschutzes.\n\nIm Detail gliedert sich die Tätigkeit in unterschiedliche Bereiche auf. Ein\nexterner Datenschutzbeauftragter wird zum Beispiel in folgenden Szenarien\nkonsultiert:\n\n  * bei der Einführung aus Datenschutz-Sicht kritischer IT-Systeme\n  * wenn Daten durch einen Angriff verloren gehen\n  * für die Schulung von Mitarbeitern, die mit der Datenverarbeitung beschäftigt sind\n  * als allgemeiner Ansprechpartner zu Fragen des Datenschutzes\n  * zur Unterstützung, um Datenschutzthemen innerbetrieblich zu strukturieren\n\n  Zum Aktivieren des Videos bitte auf den Link klicken. Durch das Aktivieren\nvon eingebetteten Videos werden Daten an YouTube übermittelt. Weitere\nInformationen können unserer Datenschutzerklärung entnommen werden. YouTube-\nVideo anzeigen\n\n## Externer Datenschutzbeauftragter: Vorteile für Ihr Unternehmen\n\nDie datenschutzrechtlichen Anforderungen sind in den letzten Jahren immer\nkomplexer geworden. Gerade kleinere und mittlere Unternehmen greifen daher\nhäufig auf externe Datenschutzbeauftragte zurück.\n\nDas sind die Vorteile eines externen Datenschutzbeauftragten für Ihr\nUnternehmen:\n\n  * Fungiert ideal als freie und neutrale Instanz zur Wahrung datenschutzrechtlicher Belange in Ihrem Unternehmen (gemäß den Vorgaben des Gesetzgebers).\n  * Externe Datenschutzbeauftragte unterstützen insbesondere kleinere und mittlere Unternehmen durch ihre Expertise auf dem Gebiet des Datenschutzes.\n  * Als externer Dienstleister stimmen wir unsere Beratungsleistungen individuell auf die Anforderungen Ihres Unternehmens ab.\n\n  Zum Aktivieren des Videos bitte auf den Link klicken. Durch das Aktivieren\nvon eingebetteten Videos werden Daten an YouTube übermittelt. Weitere\nInformationen können unserer Datenschutzerklärung entnommen werden. YouTube-\nVideo anzeigen\n\n* * *\n\n## Was sind die Kosten externer Datenschutzbeauftragter?\n\nDie **Kosten externer Datenschutzbeauftragter** hängen insbesondere von Ihrer\nUnternehmensgröße und der gewünschten Beratungsleistung ab. Ein deutlicher\nKostenvorteil ist grundsätzlich die Ersparnis von Lohnkosten. Im Gegenzug\nsteht Ihnen ein Experte zur Seite, der sich ausschließlich um die\ndatenschutzrechtlichen Belange in Ihrem Unternehmen kümmert. In enger\nAbstimmung mit Ihnen erstellen wir für Sie ein individuelles Angebot.\n\n### Datenschutz­beauftragter, -Koordinator, -Verantwortlicher etc. Wer macht\neigentlich was?\n\n  Zum Aktivieren des Videos bitte auf den Link klicken. Durch das Aktivieren\nvon eingebetteten Videos werden Daten an YouTube übermittelt. Weitere\nInformationen können unserer Datenschutzerklärung entnommen werden. YouTube-\nVideo anzeigen\n\nFür kleine Unternehmen mit bis zu bis 20 Beschäftigten bieten wir mit unserem\nDatenschutz-Kit eine Lösung an, welche auch die Bestellung eines\nDatenschutzbeauftragten beinhaltet. Bei einer Laufzeit von drei Jahren\nbetragen die Kosten 32,50€ / Monat und bei einer Laufzeit von einem Jahr 49€ /\nMonat. Wir stellen beim Datenschutz-Kit den Unternehmen unter anderem eine\nwebbasierte Datenschutz-Management-Software zur Verfügung, mithilfe derer sie\ndie Datenschutz-Themen preisgerecht adressieren können. Zudem stehen wir bei\nindividuellen Rückfragen ergänzend mit unserer Unterstützung zur Seite.\n\nZum Datenschutz-Kit\n\nMittelständische Unternehmen mit einem internen oder externen\nDatenschutzbeauftragten können wir über unser Compliance-Kit 2.0 unterstützen.\nDies ist eine auf ISO-Normstandards aufbauende Datenschutz-Management-\nSoftware. In den ersten sechs Monaten ist die Software für Sie kostenlos,\ndanach zahlen Sie monatlich 30,- Euro für die Nutzung.\n\nZum Compliance-Kit 2.0\n\nFür ein detailliertes Angebot können Sie auch unsere unverbindliche\nKostenanfrage nutzen, um schnell und einfach die Kosten eines externen\nDatenschutzbeauftragten für Ihr Unternehmen zu ermitteln.\n\nAngebot anfordern\n\n### Interessenskonflikt bei der Bestellung eines Datenschutzbeauftragten\n\nDie Bestellung eines Datenschutzbeauftragten birgt potenzielle\nInteressenkonflikte, insbesondere wenn diese Position intern besetzt wird.\nDies liegt daran, dass der Datenschutzbeauftragte die Aufgabe hat, die\nEinhaltung der Datenschutzbestimmungen zu überwachen, was eine konfliktfreie\nPosition erfordert.\n\nWenn ein Mitarbeiter eines Unternehmens zum Datenschutzbeauftragten ernannt\nwird, besteht die Gefahr, dass seine Aufgaben und Verantwortlichkeiten in\nanderen Funktionen innerhalb des Unternehmens mit seinen Pflichten als\nDatenschutzbeauftragter kollidieren. Beispielsweise kann ein IT-Manager, der\ngleichzeitig als Datenschutzbeauftragter fungiert, in einen Interessenkonflikt\ngeraten, wenn er eine Entscheidung zwischen den Datenschutzinteressen und der\nEffizienz des IT-Betriebs treffen muss.\n\nDarüber hinaus könnte ein interner Datenschutzbeauftragter zögern,\nDatenschutzverstöße zu melden oder gegen das Unternehmen vorzugehen, weil er\nnegative berufliche Konsequenzen befürchtet. Die Bestellung eines externen\nDatenschutzbeauftragten kann daher dazu beitragen, potenzielle\nInteressenkonflikte zu vermeiden und sicherzustellen, dass die Einhaltung der\nDatenschutzgesetze unparteiisch überwacht wird.\n\n* * *\n\nJetzt Angebot anfordern\n\n **1\\. Unternehmensgröße**\n\nAnzahl Bildschirm-Arbeitsplätze:\n\nWeniger als 20 Bildschirm-Arbeitsplätze  Zwischen 20 und 50 Bildschirm-\nArbeitsplätze  Mehr als 50 Bildschirm-Arbeitsplätze\n\nWarnung! Javascript muss aktiviert sein, damit dieses Formular fehlerfrei\nfunktioniert.\n\n **2\\. Laufzeit wählen**\n\nGewünschte Laufzeit:\n\nLaufzeit\n\n1 Jahr (590,- Euro pro Jahr zzgl. USt.)3 Jahre (390,- Euro pro Jahr zzgl. USt.\n| Abrechnung im Voraus für 3 Jahre 1.170,- Euro)\n\n **3\\. Ihre Angaben**\n\nUnternehmen:\n\nName des Unternehmens\n\nAnschrift\n\nPLZ\n\nOrt\n\nAnsprechpartner:\n\nAnsprechpartner Vorname\n\nAnsprechpartner Nachname\n\nAnsprechpartner E-Mail\n\nAktion\n\nNach Absenden dieses Formulars erstellen wir ein Vertrags-Angebot und senden\nIhnen dieses per E-Mail zu. Nachdem Sie dieses unterzeichnet an uns zurück\ngeschickt haben, übersenden wir Ihnen die Rechnung. Nach Zahlungseingang legen\nwir Ihren Zugang zur Online-Plattform an und versenden den Ordner inkl.\nZertifikat und begleitender Unterlagen. * erforderliche Eingabe\n\n\n\nWarnung! Javascript muss aktiviert sein, damit dieses Formular fehlerfrei\nfunktioniert.\n\n **2\\. Laufzeit wählen**\n\nGewünschte Laufzeit:\n\nLaufzeit\n\n290 Euro / Monat zzgl. USt.\n\n **3\\. Ihre Angaben**\n\nUnternehmen:\n\nName des Unternehmens\n\nAnschrift\n\nPLZ\n\nOrt\n\nAnsprechpartner:\n\nAnsprechpartner Vorname\n\nAnsprechpartner Nachname\n\nAnsprechpartner E-Mail\n\nAktion\n\nNach Absenden dieses Formulars erstellen wir ein Vertrags-Angebot und senden\nIhnen dieses per E-Mail zu. Nachdem Sie dieses unterzeichnet an uns zurück\ngeschickt haben, übersenden wir Ihnen die Rechnung. Nach Zahlungseingang legen\nwir Ihren Zugang zur Online-Plattform an und versenden den Ordner inkl.\nZertifikat und begleitender Unterlagen. * erforderliche Eingabe\n\n\n\nWarnung! Javascript muss aktiviert sein, damit dieses Formular fehlerfrei\nfunktioniert.\n\n **2\\. Ihre Angaben**\n\nAnsprechpartner:\n\nAnrede Anrede Herr Frau Divers\n\nAnsprechpartner Nachname\n\nAnsprechpartner E-Mail\n\nFirma\n\n **3\\. Beratungstermin buchen**\n\nIhre bevorzugte Terminart:\n\nBeratungwie\n\nRückrufserviceWeb-Meeting\n\nTelefonnummer\n\nDatum\n\nBevorzugte Uhrzeit:\n\nUhrzeit\n\n09:0010:0011:0012:0013:0014:0015:0016:00\n\n\n\n  * __Produkte& Services\n    * Datenschutz-Kit\n    * Compliance-Kit 2.0\n    * Datenschutz Schulung\n    * Externer Datenschutzbeauftragter\n    * Versicherung Datenschutz-Kit\n    * EU-Vertreter nach Artikel 27 EU-DSGVO\n    * Code of Conduct / Datenschutz-Kodex\n    * Kindergarten\n    * IITR Datenschutz-Patent\n    * Audit und Zertifizierung\n    * Hinweisgebersystem\n    * ISMS-Kit\n  *  __Ratgeber\n    * Ratgeber\n    * EU-DSGVO\n    * Datenschutz für Unternehmen einfach erklärt\n    * Personenbezogene Daten in Unternehmen\n    * Empfehlungen der Datenschutz Aufsichtsbehörden\n    * Definition: Daten - Information\n    * Praxistipps\n  * SELF-CHECK\n  *  __Das Unternehmen\n    * Über uns\n    * Kontakt\n    * Vertriebspartner\n    * Wissenschaftlicher Beirat\n    * Datenschutzerklärung\n    * AGB\n    * Impressum\n    * Karriere\n    * Medien\n\nSocial Media\n\n ______\n\nWir sind zertifiziert nach  \nDIN EN ISO 9001\n\nSuchen\n\nType 2 or more characters for results.\n\nSuchen\n\n **Newsletter abonnieren**\n\nIn unserem Newsletter informieren wir Sie rund um die Themen Datenschutz und\nInformationssicherheit. Sie erhalten Einladungen zu unseren Webinaren und\nZugang zu unseren Whitepapers und Ebooks.\n\nName:\n\nIhre E-Mail Adresse*:\n\n* Pflichtfeld\n\n© 2024 IITR Datenschutz GmbH\n\n",
    "links": "[{\"link\": \"https://www.iitr.de/iitr-login\", \"text\": \"Login\"}, {\"link\": \"https://www.iitr.de/\", \"text\": \"\"}, {\"link\": \"https://www.iitr.de/iitr-login\", \"text\": \"Login\"}, {\"link\": \"https://www.iitr.de/\", \"text\": \"Startseite\"}, {\"link\": \"https://www.iitr.de/produkte-services\", \"text\": \"Leistungen\"}, {\"link\": \"https://www.iitr.de/produkte-services/datenschutz-kit\", \"text\": \"Datenschutz-Kit\"}, {\"link\": \"https://www.iitr.de/produkte-services/externer-datenschutzbeauftragter\", \"text\": \"Externer Datenschutzbeauftragter\"}, {\"link\": \"https://www.iitr.de/produkte-services/datenschutz-schulung\", \"text\": \"Datenschutz Schulung\"}, {\"link\": \"https://www.iitr.de/produkte-services/audit-zertifizierung\", \"text\": \"Datenschutz Audit\"}, {\"link\": \"https://www.iitr.de/produkte-services/datenschutzmanagementsystem-ck2\", \"text\": \"Datenschutzmanagementsystem (Compliance-Kit)\"}, {\"link\": \"https://www.iitr.de/produkte-services/informationssicherheits-managementsystem-isms-kit\", \"text\": \"Informationssicherheits-Managementsystem (ISMS-Kit)\"}, {\"link\": \"https://www.iitr.de/produkte-services/hinweisgebersystem\", \"text\": \"Hinweisgebersystem\"}, {\"link\": \"https://www.iitr.de/datenschutz-tools\", \"text\": \"\"}, {\"link\": \"https://www.iitr.de/unternehmen/ueber-uns\", \"text\": \"Unternehmen\"}, {\"link\": \"https://www.iitr.de/unternehmen/ueber-uns\", \"text\": \"Über uns\"}, {\"link\": \"https://www.iitr.de/unternehmen/vertriebspartner\", \"text\": \"Vertriebspartner\"}, {\"link\": \"https://www.iitr.de/unternehmen/karriere\", \"text\": \"Karriere\"}, {\"link\": \"https://www.iitr.de/\", \"text\": \"Startseite\"}, {\"link\": \"https://www.iitr.de/produkte-services\", \"text\": \"Produkte & Services\"}, {\"link\": \"https://www.iitr.de/unternehmen/ueber-uns\", \"text\": \"Lernen Sie das ganze Team kennen\"}, {\"link\": \"https://www.iitr.de/dsgvo-checkliste\", \"text\": \"Datenschutz-Check starten\"}, {\"link\": \"https://www.iitr.de/produkte-services/datenschutz-kit\", \"text\": \"Datenschutz-Kit\"}, {\"link\": \"https://www.iitr.de/produkte-services/datenschutzmanagementsystem-ck2\", \"text\": \"Compliance-Kit 2.0\"}, {\"link\": \"https://www.iitr.de/produkte-services/datenschutz-kit\", \"text\": \"Zum Datenschutz-Kit\"}, {\"link\": \"https://www.iitr.de/produkte-services/datenschutzmanagementsystem-ck2\", \"text\": \"Zum Compliance-Kit 2.0\"}, {\"link\": \"https://www.iitr.de/kosten-externer-datenschutzbeauftragter\", \"text\": \"Angebot anfordern\"}, {\"link\": \"https://www.iitr.de/produkte-services\", \"text\": \"Produkte & Services\"}, {\"link\": \"https://www.iitr.de/produkte-services/datenschutz-kit\", \"text\": \"Datenschutz-Kit\"}, {\"link\": \"https://www.iitr.de/produkte-services/datenschutzmanagementsystem-ck2\", \"text\": \"Compliance-Kit 2.0\"}, {\"link\": \"https://www.iitr.de/produkte-services/datenschutz-schulung\", \"text\": \"Datenschutz Schulung\"}, {\"link\": \"https://www.iitr.de/produkte-services/externer-datenschutzbeauftragter\", \"text\": \"Externer Datenschutzbeauftragter\"}, {\"link\": \"https://www.iitr.de/produkte-services/versicherung-datenschutz-kit\", \"text\": \"Versicherung Datenschutz-Kit\"}, {\"link\": \"https://www.iitr.de/produkte-services/eu-vertreter-nach-artikel-27-eu-dsgvo\", \"text\": \"EU-Vertreter nach Artikel 27 EU-DSGVO\"}, {\"link\": \"https://www.iitr.de/produkte-services/code-of-conduct-datenschutz-kodex\", \"text\": \"Code of Conduct / Datenschutz-Kodex\"}, {\"link\": \"https://www.iitr.de/produkte-services/verhaltensregeln-kinderbetreuung\", \"text\": \"Kindergarten\"}, {\"link\": \"https://www.iitr.de/produkte-services/iitr-patent-der-dritte-weg\", \"text\": \"IITR Datenschutz-Patent\"}, {\"link\": \"https://www.iitr.de/produkte-services/audit-zertifizierung\", \"text\": \"Audit und Zertifizierung\"}, {\"link\": \"https://www.iitr.de/produkte-services/hinweisgebersystem\", \"text\": \"Hinweisgebersystem\"}, {\"link\": \"https://www.iitr.de/produkte-services/informationssicherheits-managementsystem-isms-kit\", \"text\": \"ISMS-Kit\"}, {\"link\": \"https://www.iitr.de/veroeffentlichungen\", \"text\": \"Ratgeber\"}, {\"link\": \"https://www.iitr.de/eu-dsgvo\", \"text\": \"EU-DSGVO\"}, {\"link\": \"https://www.iitr.de/veroeffentlichungen/datenschutz-fuer-unternehmen-einfach-erklaert\", \"text\": \"Datenschutz für Unternehmen einfach erklärt\"}, {\"link\": \"https://www.iitr.de/veroeffentlichungen/personenbezogene-daten-in-unternehmen\", \"text\": \"Personenbezogene Daten in Unternehmen\"}, {\"link\": \"https://www.iitr.de/veroeffentlichungen/empfehlungen-der-datenschutz-aufsichtbehoerden\", \"text\": \"Empfehlungen der Datenschutz Aufsichtsbehörden\"}, {\"link\": \"https://www.iitr.de/veroeffentlichungen/definition-daten-informationen\", \"text\": \"Definition: Daten - Information\"}, {\"link\": \"https://www.iitr.de/veroeffentlichungen/praxistipps\", \"text\": \"Praxistipps\"}, {\"link\": \"https://www.iitr.de/dsgvo-checkliste\", \"text\": \"SELF-CHECK\"}, {\"link\": \"https://www.iitr.de/unternehmen/ueber-uns\", \"text\": \"Über uns\"}, {\"link\": \"https://www.iitr.de/kontakt\", \"text\": \"Kontakt\"}, {\"link\": \"https://www.iitr.de/unternehmen/vertriebspartner\", \"text\": \"Vertriebspartner\"}, {\"link\": \"https://www.iitr.de/unternehmen/wissenschaftlicher-beirat\", \"text\": \"Wissenschaftlicher Beirat\"}, {\"link\": \"https://www.iitr.de/unternehmen/datenschutzerklaerung\", \"text\": \"Datenschutzerklärung\"}, {\"link\": \"https://www.iitr.de/unternehmen/agb\", \"text\": \"AGB\"}, {\"link\": \"https://www.iitr.de/unternehmen/impressum\", \"text\": \"Impressum\"}, {\"link\": \"https://www.iitr.de/unternehmen/karriere\", \"text\": \"Karriere\"}, {\"link\": \"https://www.iitr.de/kontakt/medien\", \"text\": \"Medien\"}, {\"link\": \"https://www.iitr.de/blog/\", \"text\": \"\"}, {\"link\": \"https://www.iitr.de/images/pdf/IITR_ISO_9001_Zertifikat.pdf\", \"text\": \"\"}]"
}