{
    "summary": "Skip to main content\n\n# Original text\n\nContribute a better translation\n\n* * *\n\nTranslate Afrikaans Albanian Amharic Arabic Armenian Azerbaijani Basque\nBelarusian Bengali Bosnian Bulgarian Catalan Cebuano Chichewa Chinese\n(Simplified) Chinese (Traditional) Corsican Croatian Czech Danish Dutch\nEsperanto Estonian Filipino Finnish French Frisian Galician Georgian German\nGreek Gujarati Haitian Creole Hausa Hawaiian Hebrew Hindi Hmong Hungarian\nIcelandic Igbo Indonesian Irish Italian Japanese Javanese Kannada Kazakh Khmer\nKinyarwanda Korean Kurdish (Kurmanji) Kyrgyz Lao Latin Latvian Lithuanian\nLuxembourgish Macedonian Malagasy Malay Malayalam Maltese Maori Marathi\nMongolian Myanmar (Burmese) Nepali Norwegian Odia (Oriya) Pashto Persian\nPolish Portuguese Punjabi Romanian Russian Samoan Scots Gaelic Serbian Sesotho\nShona Sindhi Sinhala Slovak Slovenian Somali Spanish Sundanese Swahili Swedish\nTajik Tamil Tatar Telugu Thai Turkish Turkmen Ukrainian Urdu Uyghur Uzbek\nVietnamese Welsh Xhosa Yiddish Yoruba Zulu Translate Afrikaans Albanian\nAmharic Arabic Armenian Azerbaijani Basque Belarusian Bengali Bosnian\nBulgarian Catalan Cebuano Chichewa Chinese (Simplified) Chinese (Traditional)\nCorsican Croatian Czech Danish Dutch Esperanto Estonian Filipino Finnish\nFrench Frisian Galician Georgian German Greek Gujarati Haitian Creole Hausa\nHawaiian Hebrew Hindi Hmong Hungarian Icelandic Igbo Indonesian Irish Italian\nJapanese Javanese Kannada Kazakh Khmer Kinyarwanda Korean Kurdish (Kurmanji)\nKyrgyz Lao Latin Latvian Lithuanian Luxembourgish Macedonian Malagasy Malay\nMalayalam Maltese Maori Marathi Mongolian Myanmar (Burmese) Nepali Norwegian\nOdia (Oriya) Pashto Persian Polish Portuguese Punjabi Romanian Russian Samoan\nScots Gaelic Serbian Sesotho Shona Sindhi Sinhala Slovak Slovenian Somali\nSpanish Sundanese Swahili Swedish Tajik Tamil Tatar Telugu Thai Turkish\nTurkmen Ukrainian Urdu Uyghur Uzbek Vietnamese Welsh Xhosa Yiddish Yoruba Zulu\nSelect\nLanguageAfrikaansAlbanianAmharicArabicArmenianAssameseAymaraAzerbaijaniBambaraBasqueBelarusianBengaliBhojpuriBosnianBulgarianCatalanCebuanoChichewaChinese\n(Simplified)Chinese\n(Traditional)CorsicanCroatianCzechDanishDhivehiDogriDutchEsperantoEstonianEweFilipinoFinnishFrenchFrisianGalicianGeorgianGermanGreekGuaraniGujaratiHaitian\nCreoleHausaHawaiianHebrewHindiHmongHungarianIcelandicIgboIlocanoIndonesianIrishItalianJapaneseJavaneseKannadaKazakhKhmerKinyarwandaKonkaniKoreanKrioKurdish\n(Kurmanji)Kurdish\n(Sorani)KyrgyzLaoLatinLatvianLingalaLithuanianLugandaLuxembourgishMacedonianMaithiliMalagasyMalayMalayalamMalteseMaoriMarathiMeiteilon\n(Manipuri)MizoMongolianMyanmar (Burmese)NepaliNorwegianOdia\n(Oriya)OromoPashtoPersianPolishPortuguesePunjabiQuechuaRomanianRussianSamoanSanskritScots\nGaelicSepediSerbianSesothoShonaSindhiSinhalaSlovakSlovenianSomaliSpanishSundaneseSwahiliSwedishTajikTamilTatarTeluguThaiTigrinyaTsongaTurkishTurkmenTwiUkrainianUrduUyghurUzbekVietnameseWelshXhosaYiddishYorubaZulu\n\nPowered by  Translate\n\nPowered by  Translate\n\nPowered by Translate\n\nTranslate English Afrikaans Albanian Arabic Armenian Azerbaijani Basque\nBelarusian Bengali Bosnian Bulgarian Catalan Cebuano Chinese (Simplified)\nChinese (Traditional) Croatian Czech Danish Dutch Esperanto Estonian Filipino\nFinnish French Galician Georgian German Greek Gujarati Haitian Creole Hausa\nHebrew Hindi Hmong Hungarian Icelandic Igbo Indonesian Irish Italian Japanese\nJavanese Kannada Khmer Korean Lao Latin Latvian Lithuanian Macedonian Malay\nMaltese Maori Marathi Mongolian Nepali Norwegian Persian Polish Portuguese\nPunjabi Romanian Russian Serbian Slovak Slovenian Somali Spanish Swahili\nSwedish Tamil Telugu Thai Turkish Ukrainian Urdu Vietnamese Welsh Yiddish\nYoruba Zulu\n\nUse my current location\n\nFind a Mentor\n\nGet Free Business Advice\n\nSCORE mentors know what it’s like to be a small business owner. They know it\ntakes passion and hard work to make your dreams come true, and they’re ready\nto support you every step of your journey.\n\nLet us do the matching for you.\n\nEnter your zip code below to get matched with a business expert near you!\n\nZipcode\n\nBrowse Mentor Profiles\n\nBrowse the profiles of SCORE mentors and narrow down your choices by filtering\nbased on industry, location, area of expertise, and other criteria.\n\nBrowse Profiles\n\n5 Steps for Mentoring\n\n### Identify\n\n* * *\n\nIdentify your small business needs and desired support.\n\n### Request\n\n* * *\n\nRequest a SCORE Mentor as your advisor to small business success.\n\n### Schedule\n\n* * *\n\nSchedule a mentoring session with your assigned SCORE mentor\n\n### Set Goals\n\n* * *\n\nSet goals for your small business with guidance from your SCORE mentor.\n\n### Advance\n\n* * *\n\nWork with your SCORE mentor through the life of your business.\n\nFrequently asked questions about SCORE Mentoring:\n\n#### What is SCORE mentoring?\n\nSCORE mentoring is a free service offered to U.S. based business (or business\nidea).  \n  \nPartnering with you one-on-one or in small group sessions, SCORE mentors\nsupport your success by providing experienced advice, consulting on best\npractices, and educating you on small business topics.\n\n#### How does SCORE mentoring work?\n\nThere are several ways to get a mentor. You can enter your zip code in the box\nabove and complete the mentoring request form to be paired with a local\nexpert. If there is specific expertise you're looking for, you can use the\nMentor Matchmaker to find an expert based on industry or subject matter\nexpertise.  \n  \nOnce you’ve submitted your mentoring request, your mentor will contact you by\nemail to schedule an appointment for your mentoring session. We can work with\nyou using different communication methods, including phone, video, email and\nin-person meetings.  \n  \nDuring the session, you'll discuss your business goals and challenges. Your\nmentor will ask you questions about what’s working in your business (and\nwhat’s not) and will seek to understand what you’re hoping to achieve in\nworking with them. They will provide answers to your business questions,\nconnect you to local and national resources, and will recommend workshops and\nevents to help you fill any knowledge gaps that might exist.  \n  \nIf at any point, you need a different expert – because you need different\nexpertise or if you don’t feel your mentor is the best fit – you can request\nadditional support from other SCORE mentors in our network.  \n  \nWe can provide support for a simple business question or work with you through\ncomplex business challenges. You can with your mentor(s) as often as you need,\nfor the life of your business. We provide support for all stages of the\nbusiness lifecycle. This means that we’re here to help you if you’re thinking\nabout starting a business, managing a business, growing your business, selling\nor exiting your business.  \n  \nTo get started, simply use our mentor search or enter your zip code in the\nfield above to complete a mentoring request. This will be sent to the\nappropriate mentor or chapter who will respond within 48 hours.\n\n#### How will you match me with my mentor?\n\nWhen you enter your zip code in the field above, you’ll be taken to our\nmentoring request form. We’ll use the information that you provide in that\nform to find your ideal expert. More specifically, we’ll work to understand\nyour business question(s) and compare that to the mentor profiles in our\ndatabase to find an expert that matches your needs.  \n  \nIf you have a more general question, we’ll pair you with a local expert who\ncan work with you to identify your area of greatest need and will coach you on\nthat topic. If necessary, your mentor will invite other SCORE subject matter\nexperts to help if you have questions on several different topics.\n\n#### How long will it take to get matched?\n\nThe time to get matched varies based on your business question, but typically\nyou should hear from a mentor within 48 hours. Once you hear from your mentor,\nyou can work with them to schedule your first mentoring appointment at a time\nthat is convenient for both of your schedules.\n\n#### Will my mentor reach out to me first?\n\nYes! Your mentor will attempt to contact you 3 times upon receiving your\nmentoring request. They will email you and text you (if you select text\nnotifications), so make sure you check your junk folders and whitelist emails\nsent from @scorevolunteer.org and @score.org.\n\n#### Is SCORE mentoring confidential? Can my mentor sign a Nondisclosure\nAgreement (NDA)?\n\nClient confidentiality is an institutional principle at SCORE. This means that\na SCORE client’s confidentiality does not reside with a single volunteer or\nchapter but is maintained as confidential within SCORE.  \n  \nSCORE volunteers cannot sign any client’s confidentiality agreements or any\nNon-Disclosure Agreements (NDA), but the client’s confidentiality is covered\nin the volunteer’s agreement with SCORE.  \n  \nThis agreement to maintain client confidentiality - as well as other values\nthat are integral to the client relationship - is confirmed in writing in the\nSCORE Code of Ethics. Among other things, our Code of Ethics directs our\nvolunteers as follows:\n\n  * Always place the business interests of SCORE clients first.\n  * Protect the confidentiality of all client information so that it remains within SCORE.\n\nAll SCORE mentors are required to sign this agreement annually.\n\n#### What industries do you support?\n\nSCORE mentors can help businesses in all industries. We have experts in a\nvariety of fields, including professional services, retail, arts,\nentertainment, recreation, food services, accommodations, travel, marketing &\nadvertising, health care, social assistance, real estate and more.  \n  \nRegardless of your industry, our mentors are knowledgeable in all areas of\nbusiness and can answer your questions about popular topics such as sales,\nmarketing, finance, accounting, management, and technology.\n\n#### What is a typical mentoring session like?\n\nA mentoring session is a confidential, personalized conversation with a\nbusiness expert to answer a question or to solve a problem that you’re facing.  \n  \nSCORE mentoring sessions are collaborative meetings between the small business\nowner and the SCORE mentor. They are typically scheduled for an hour and can\nbe held virtually, through online meetings, phone calls, email, or even in\nperson if you would like to be paired with a local mentor. You can share your\nbusiness goals, progress, challenges, and questions during these sessions.\nSCORE mentors will offer advice, resources, and insights so you gain clarity\non your next best steps.  \n  \nWhen you first meet with your mentor, they will ask you questions about your\nbusiness and your goals. This will help them understand how to best support\nyou and answer your business questions. They will leverage their personal\nexperience and knowledge to help you avoid common challenges and mistakes. If\nthey do not have the expertise you need, they may invite another mentor to\nparticipate in the meeting.  \n  \nOnce you discuss your initial business question, they may ask you to complete\nbusiness templates or to review resources on SCORE.org. Additionally, they may\nrecommend SCORE or partner workshops or resources to meet your needs. They\nwill also schedule a follow-up session to ensure you’re on the right track and\nto keep supporting your business.\n\n#### How can I make the most of my mentoring experience?\n\nTo make the most of your mentoring experience, we recommend being prepared\nwith a business question or challenge that you can work on with your mentor.\nIf you’re starting a business, we recommend being prepared with a business\nidea before you request a mentor. If you’re not sure what type of business you\nwant to start, consider using our Startup Roadmap to help you define your\nbusiness idea. If you already own a business, come to your meeting prepared\nwith the issue you need to resolve or the goal that you’d like to achieve.  \n  \nOther tips to make the most of your mentoring include:\n\n  * Checking your inbox for emails from SCORE.\n  * Be ready to actively participate in your session. This means bringing specific questions that we can answer, engaging in discussions about your business, and challenging the mentor's ideas & suggestions if you don't fully understand them.\n  * If your business is already in operation, please be willing to share your history, recent financials, cash flow, and business plan. This will give your mentor a much-needed understanding of your current operations so they can suggest ideas about how/where to improve.\n  * Be open and honest in the discussion.\n  * Be willing to meet with your mentor over a period of time. Many of the questions that we receive will take more than one meeting to answer. Remember, mentoring is always free and you can meet with your mentor as often as needed (based on schedule and availability).\n  * Keep in mind that SCORE mentors will not do the work for you. We are here as guides and advisors but we’ll ask you to do the work. This is to help you develop the skills and knowledge needed to manage your business.\n  * When you’ve achieved success with your mentor, submit a success story for our website. This will allow us to celebrate your accomplishments and spread the word about your business. Your story could be featured in SCORE’s national media releases and marketing efforts, which will build awareness for your business.\n  * Consider attending a SCORE workshop to complement your mentoring. We offer educational webinars, workshops and events online and in your local community. This will help you strengthen your knowledge and expand your business network.\n\n  *   *   *   *   * \n\nCONNECT\n\n1165 Herndon Parkway, Suite 100\n\n}\n\nHerndon, VA 20170\n\n1-800-634-0245\n\nSign up for SCORE's Newsletter\n\nCopyright © 2023 SCORE Association, SCORE.org\n\nFunded, in part, through a Cooperative Agreement with the U.S. Small Business\nAdministration. All opinions, and/or recommendations expressed herein are\nthose of the author(s) and do not necessarily reflect the views of the SBA.\n\nChat generously provided by:\n\n  *   *   *   * \n\nIn partnership with\n\nJump back to top\n\nOriginal text\n\nRate this translation\n\nYour feedback will be used to help improve Google Translate\n\nThis website uses cookies to enhance user experience and to analyze\nperformance and traffic on our website. We also share information about your\nuse of our site with our social media, advertising and analytics partners.\n\nCookies Settings Accept All Cookies\n\n## Privacy Preference Center\n\n  * ### Your Privacy\n\n  * ### Strictly Necessary Cookies\n\n  * ### Functional Cookies\n\n  * ### Performance Cookies\n\n  * ### Targeting Cookies\n\n#### Your Privacy\n\nWhen you visit any website, it may store or retrieve information on your\nbrowser, mostly in the form of cookies. This information might be about you,\nyour preferences or your device and is mostly used to make the site work as\nyou expect it to. The information does not usually directly identify you, but\nit can give you a more personalized web experience. Because we respect your\nright to privacy, you can choose not to allow some types of cookies. Click on\nthe different category headings to find out more and change our default\nsettings. However, blocking some types of cookies may impact your experience\nof the site and the services we are able to offer.\n\n#### Strictly Necessary Cookies\n\nAlways Active\n\nThese cookies are necessary for the website to function and cannot be switched\noff in our systems. They are usually only set in response to actions made by\nyou which amount to a request for services, such as setting your privacy\npreferences, logging in or filling in forms. You can set your browser to block\nor alert you about these cookies, but some parts of the site will not then\nwork. These cookies do not store any personally identifiable information.\n\n#### Functional Cookies\n\nFunctional Cookies\n\nThese cookies enable the website to provide enhanced functionality and\npersonalisation. They may be set by us or by third party providers whose\nservices we have added to our pages. If you do not allow these cookies then\nsome or all of these services may not function properly.\n\n#### Performance Cookies\n\nPerformance Cookies\n\nThese cookies allow us to count visits and traffic sources so we can measure\nand improve the performance of our site. They help us to know which pages are\nthe most and least popular and see how visitors move around the site. All\ninformation these cookies collect is aggregated and therefore anonymous. If\nyou do not allow these cookies we will not know when you have visited our\nsite, and will not be able to monitor its performance.\n\n#### Targeting Cookies\n\nTargeting Cookies\n\nThese cookies may be set through our site by our advertising partners. They\nmay be used by those companies to build a profile of your interests and show\nyou relevant adverts on other sites. They do not store directly personal\ninformation, but are based on uniquely identifying your browser and internet\ndevice. If you do not allow these cookies, you will experience less targeted\nadvertising.\n\nBack Button\n\n### Back\n\nFilter Button\n\nConsent Leg.Interest\n\ncheckbox label label\n\ncheckbox label label\n\ncheckbox label label\n\nClear\n\ncheckbox label label\n\nApply Cancel\n\nSave Settings\n\n",
    "links": "[]"
}