{
    "summary": "Our website stores cookies on your computer. These cookies help us know you\nwhen you come back so we can personalize your visit. They also give us insight\ninto how you and other visitors interact with our website and other media so\nwe can improve your experience. To find out more about how we use this\ninformation, see our Privacy Policy.\n\nIf you decline, your information won’t be tracked when you visit this website.\nA single cookie will be used in your browser to remember your preference not\nto be tracked.\n\nAccept  Decline\n\n  * ### Topics:\n\n  * Finding Customers\n  * Business Systems\n  * Managing Employees\n  * Leadership\n  * Managing Money\n  * Work-Life Balance\n  * Free EMyth Resources\n\n###### VIEW BY TOPIC\n\n  * Business Coaching\n  * Business Growth\n  * Business Partnerships\n  * Business Systems\n  * Business Vision\n  * Customer Experience\n  * EMyth Approach\n  * Employee Development\n  * Entrepreneurial Mindset\n  * Hiring Employees\n  * Lead Conversion\n  * Lead Generation\n  * Leadership\n  * Managing Employees\n  * Podcast\n  * Product Strategy\n  * Small Business Finance\n  * Small Business Leadership\n  * Small Business Management\n  * Small Business Marketing\n  * Small Business Organization\n  * Small Business Operations\n  * Starting a Business\n  * Systems Thinking\n  * Time Management\n  * Work-Life Balance\n\nRequest a free coaching session with a Certified EMyth Coach\n\nTalk to a Coach\n\n###### FOLLOW US\n\n  *   *   *   * \n\n# What is business coaching?\n\nBusiness Coaching\n\n6 min read\n\nBusiness coaching has become a common and important practice for CEOs and\nbusiness owners who want to advance themselves and their companies. Still,\nmany business leaders don’t truly understand what coaching actually _is_. In\nshort, business coaching is a collaborative relationship between a business\nowner or CEO and a professional business coach, aimed at strategically\ndeveloping a successful company. And what does a business coach _do_? A\ncoach’s role—generally, but particularly as we see it at EMyth—is to help you\ndesign a vision for your business that aligns with your values and the goals\nyou have for your life. With that vision in hand, business coaches provide you\nwith the guidance, support and accountability you need to set and move through\nyour goals, allowing you to take your business from where it is to where you\n_want_ it to be.\n\n## Why business coaching?\n\nHiring a business coach is _not_ hiring a low-touch advisor or an industry-\nspecific consultant to come in and fix your business. And there are a lot of\npeople out there calling themselves business coaches who don't have any real\nprofessional accreditations or associations. It can be hard to know who to\ntrust—not simply when it comes to their methodology or the quality of their\ntraining, but also in terms of their approach to business and life in general.\nWorking with a professional business coach is a deeply personal engagement.\nAnd on some level, you’re buying who they are and why they do what they do.\n\nSince 1977 when our founder Michael E. Gerber founded modern business\ncoaching, we’ve helped tens of thousands of owners transform their businesses\nwith our unique and proven approach. We know what it takes: a trusted\npartnership and a strategic roadmap that works to systematize every area of\nyour business.\n\n## What are the benefits of business coaching?\n\nHere’s what you should expect from a business coaching experience:\n\n## A trusted partnership\n\nA great business coach has curiosity and courage in equal measure. They use\ntheir curiosity to look at every corner of your business to find the root\ncause for why things are stuck or stagnating. A great coach asks the right\nquestions in the right moments—something they can only do if they have the\ntraining and experience. And a great business coach has the courage to be\nhonest with you: They understand that you need to hear the truth (even if it\nstings a bit), or have you pause and reflect before you jump into action.\n\nIf your business coach can bring these elements of your work together, you'll\nbecome a better leader. You'll see the impact in your business—in the way your\nbusiness starts to stabilize, grow, and get closer and closer to your vision.\nYou’ll see the impact in how your employees show up to work. And, you’ll see\nthe impact in your bottom line, in your customer retention and in how _your_\nwork changes within the business.\n\n## Curiosity and courage from your coach\n\nA great business coach has curiosity and courage in equal measure. They use\ntheir curiosity to look at every corner of your business to find the root\ncause for why things are stuck or stagnating. A great coach asks the right\nquestions in the right moments—something they can only do if they have the\ntraining and experience. And a great business coach has the courage to be\nhonest with you: They understand that you need to hear the truth (even if it\nstings a bit), or have you pause and reflect before you jump into action.\n\nIf your business coach can bring these elements of your work together, you'll\nbecome a better leader. You'll see the impact in your business—in the way your\nbusiness starts to stabilize, grow, and get closer and closer to your vision.\nYou’ll see the impact in how your employees show up to work. And, you’ll see\nthe impact in your bottom line, in your customer retention and in how _your_\nwork changes within the business.\n\n## A clear roadmap\n\nThrough professional business coaching, your objective is to build a\nsuccessful business with _intention_. To do that, you need a structured\nprogram to follow. If your coach doesn’t offer a plan for how to help you\nbuild each of the systems and strategies you and your business need—and the\norder in which you should develop them—you’re likely to create some critical\nsystem gaps in your business. A good coach has a proven program that they\nstand behind and are prepared to implement.\n\n## A focus on empowerment and independence\n\nAt EMyth, we look at coaching through the proverb, “Give a man a fish and\nhe’ll eat for a day. Teach a man to fish and he’ll eat for a lifetime.” A\ngreat business coach knows that over time, you'll need them less and less.\nTheir goal is to give you the right tools to put theory into practice, and to\nshow you how to soon do for yourself what you needed their help with today—the\nskills to discern and diagnose what your business requires next. Like any good\nsupportive relationship, it’s a bit of a paradox: The more they help you, the\nless you need them. A great coach knows this and doesn't pretend otherwise to\nkeep their financial relationship with you intact.\n\nFinding a coach is a highly subjective process that depends on several factors\nand how much each aligns with your priorities. If you're looking a coach’s\nprofessional characteristics, here are the most important four to consider:\n\n  * Experience, skill level and training\n  * Approach and philosophy\n  * Certification(s) (or lack thereof)\n  * Program, curriculum or methodology they use\n\nAll of these points are important when choosing a business coach, but\n_personal fit_ is really at the heart of what makes a business coach the best\nfor _you_.\n\nIf you’re ready to work with a coach, we’re here to help. Or, if you already\nhave a business coach and wonder if they’re the right fit for you, ask\nyourself these questions:\n\n  * Do they meet you where you are? Do they take the time to celebrate with you, but also be there for you if something really goes wrong?\n  * Do they know where you're headed? Do they have a proven map that they use to ask the right questions for your business in the specific stage it’s in? Don’t assume they have a real plan or any legitimate training just because they have the word “coach” on their business card.\n  * Can they hold a long-term vision while they help you fix the problems that exist in your business today? Do they notice patterns and trends, or are they just reacting to your daily frustrations? You want wise counsel, not just quick fixes.\n  * Do they make you more curious? Their way of thinking about things should be infectious—you should find yourself asking other people the kinds of questions they ask you.\n  * Do they understand what coaching is? Watch out for consultants in disguise, and amateur therapists without real training or experience to guide you.\n  * Do they truly hold you accountable? They should be willing to call you out if you don't show up and do the work to make real change.\n  * Do they hide behind lingo, lists or tricks? It shouldn't feel complicated to translate the work you do with your coach into your business and your life—hard maybe, but never complicated or unclear.\n\nA great business coach is a lot of things. But most importantly, they're a\ntrusted mentor who truly cares about your success and the success of your\nbusiness. They know that the two are inextricably linked, and that’s a\npartnership where everybody wins.  \nIf you're ready to see what it's like to work with a professional business\ncoach, schedule a free coaching session with us to try it out.\n\n### Written by Tricia Huebner\n\nTricia Huebner is EMyth's VP of Coaching Emeritus. As one of the leading\nexperts in all facets of the EMyth Approach, her 20 years of experience at\nEMyth included leadership roles in program development, coaching, coach\ntraining and marketing. Tricia’s commitment to helping business owners came\nfrom her own upbringing in a family of small business owners. In her time as a\nspeaker and trainer, she addressed business audiences throughout the U.S., and\ninternationally in Canada, Europe and Africa. Throughout her career, Tricia\ndesigned programs for the Small Business Administration and consulted with\nFortune 1000 companies, and personally coached more than 200 small and mid-\nsized businesses, helping owners create businesses they love leading and lives\nthey love living. She retired from EMyth in 2022 to pursue her own business\nwithin the wine industry.\n\n## Comments\n\n####  Kerry Tintinger\n\n1/25/2022, 7:54:37 AM\n\nVery insightful article.\n\nReply to _Kerry Tintinger_\n\n####  Tricia Huebner\n\n2/1/2022, 12:23:23 AM\n\nSo glad that you found this helpful, Kerry.\n\nReply to _Tricia Huebner_\n\nFirst Name*\n\nLast Name*\n\nEmail*\n\nBlog Comment*\n\nGet blog updates in your emailPractical tools and new ideas. No spam ever.\n\n  * Instant\n  * Weekly\n  * Monthly\n\nWebsite URL\n\nref\n\n  * **Call Us:** 1-800-300-3531\n  * **International:** +1-541-552-4600\n  * **Email:** info@emyth.com\n\n  *   *   *   * \n\n  * ##### About Us\n\n  * Our History\n  * Work at EMyth\n  * Request a speaker\n\n  * ##### Business Coaching\n\n  * Our Approach\n  * The Program\n  * Our Coaches\n  * Client Stories\n\n  * ##### Free Resources\n\n  * Blog\n  * Free Coaching Session\n\n##### Get Our Newsletter Practical resources. No spam ever.\n\nEmail*\n\nReferral ID - ref\n\nMade with  in Ashland, Oregon.  \n  \nTerms & Conditions Cookie Policy Privacy Policy  \n  \nCopyright © 2024 E-Myth Worldwide, Inc. All rights reserved. EMyth, E-Myth,\nand the EMyth Logo are trademarks of E-Myth Worldwide, Inc. EMyth is\nregistered with the U.S. Patent and Trademark Office. Other names and marks\nare the property of their respective holders.\n\n",
    "links": "[{\"link\": \"https://www.emyth.com/topic/business-systems\", \"text\": \"Business Systems\"}, {\"link\": \"https://www.emyth.com/business-coaching-program\", \"text\": \"modern business coaching\"}, {\"link\": \"https://www.emyth.com/business-coaching-program-roadmap\", \"text\": \"strategic roadmap\"}, {\"link\": \"https://www.emyth.com/six-steps-to-thinking-systemically-about-frustrations\", \"text\": \"to find the root cause for why things are stuck or stagnating\"}, {\"link\": \"https://www.emyth.com/the-emyth-roadmap\", \"text\": \"a structured program to follow\"}, {\"link\": \"https://www.emyth.com/business-coaching-emyth-get-a-free-coaching-session\", \"text\": \" we’re here to help\"}, {\"link\": \"https://www.emyth.com/business-coaching-emyth-get-a-free-coaching-session\", \"text\": \"schedule a free coaching session \"}, {\"link\": \"https://www.emyth.com/\", \"text\": \"\"}]",
    "priceAndPlans": "Our website stores cookies on your computer. These cookies help us know you\nwhen you come back so we can personalize your visit. They also give us insight\ninto how you and other visitors interact with our website and other media so\nwe can improve your experience. To find out more about how we use this\ninformation, see our Privacy Policy.\n\nIf you decline, your information won’t be tracked when you visit this website.\nA single cookie will be used in your browser to remember your preference not\nto be tracked.\n\nAccept  Decline\n\n  * Why EMyth?\n  * Solutions\n  * How It Works\n  * Client Stories\n  * About Us\n  * Free Resources\nFree Session  \n\n  * Why EMyth?\n  * How it works\n  * Solutions\n  * Client stories\n  * About us\n  * Login\n\nFree Resources  Free Session\n\n## 404\n\n# We can't find the page you're looking for.\n\n###### TOP-VIEWED PAGES\n\n### Home Page                     Inside EMyth: Free Resources\nFree Coaching Session\n\n  * **Call Us:** 1-800-300-3531\n  * **International:** +1-541-552-4600\n  * **Email:** info@emyth.com\n\n  *   *   *   * \n\n  * ##### About Us\n\n  * Our History\n  * Work at EMyth\n  * Request a speaker\n\n  * ##### Business Coaching\n\n  * Our Approach\n  * The Program\n  * Our Coaches\n  * Client Stories\n\n  * ##### Free Resources\n\n  * Blog\n  * Free Coaching Session\n\n##### Get Our Newsletter Practical resources. No spam ever.\n\nEmail*\n\nReferral ID - ref\n\nMade with  in Ashland, Oregon.  \n  \nTerms & Conditions Cookie Policy Privacy Policy  \n  \nCopyright © 2024 E-Myth Worldwide, Inc. All rights reserved. EMyth, E-Myth,\nand the EMyth Logo are trademarks of E-Myth Worldwide, Inc. EMyth is\nregistered with the U.S. Patent and Trademark Office. Other names and marks\nare the property of their respective holders.\n\n"
}