{
    "summary": "  * GEN AI\n\nGenAI HubGenAI AdvisoryGenAI POCGenAI Secure POCGenAI\nProductionalizationStride ConductorThought Leadership\n\n  * SERVICES\n\nCustom Software DevelopmentTeam AssessmentProduct AssessmentStaff\nAugmentationHiring OptimizationProduct DiscoverySWAT TeamProduct & Design\nWorkshopsWeb Performance OptimizationAll Services\n\n  * case studies\n  * ABOUT\n\nCompanyCareersPress Releases\n\n  * INSIGHTS\n\nStride BlogDebbie's Digest NewsletterThe Rabbit Hole PodcastScaling Tech\nPodcastRemoteRetro\n\n  *   * Schedule Demo\n\n# How to Evaluate the Top Agile Consulting Companies\n\nProcess\n\nAgile\n\n _This post originally appeared on Medium as_ _How to Pick the Best Agile\nConsulting Company for You_ _._\n\nTechnology is eating the world more and more every year. So it should come as\nno surprise that as companies seek expert guidance and capacity for their\nsoftware engineering teams, agile software consulting companies are on the\nrise. With so many choices, choosing the best agile software consultancy to\npartner with your team can seem daunting. To help you navigate, we’ve compiled\nthis guide on the various types of engineering expertise you’ll find in the\ntop agile software consulting companies today.\n\nWhile every good agile consultancy will practice some flavor of modern agile\nengineering (Extreme Programming) best practices, it’s important to know that\neach consultancy will approach engineering best practices with its own slant\nwhen it comes to the details. The important variables are as follows:\n\n## Dogmatic vs. adaptive\n\nMost agile consulting companies today are wise enough to understand that\nthere’s no one “best” way to write code. Regardless of which agile consulting\ncompany you choose, expect that you will be encouraged to use some combination\nof test-driven development (TDD), pair programming, continuous integration,\ncollective code ownership, and refactoring.\n\nBeyond this core set of practices, here’s where dogmatic and adaptive\nconsultancies start to differ.\n\nDogmatic agile consultancies have a set of best practices that they believe\nin. They will want you to adopt these practices, or at the very least to be on\nboard with the fact that any code they write will be written using these\npractices.\n\nAdaptive agile consultancies, like Stride, pull from a playbook of best\npractices and adapt their consulting and software development practices to\nyour needs.\n\nFor example, let’s take pair programming. A dogmatic company might insist on\npair programming as the default, whenever possible. An adaptive company might\nbe flexible with regard to the percentage of time the team spends pairing.\n\n###  _Which is best for me?_\n\n _The dogmatic approach can be comforting and reassuring for teams just\nstarting out, whereas the adaptive approach is often better suited to more\nestablished development teams that need a boost in capacity and some gentle\ntweaking or guidance on best practices._\n\n## Co-location vs. remote\n\nAgile consultancies prefer either to co-locate with your team or to work out\nof their office.\n\n  *  **Co-location at your office** —There are a handful of agile consultancies that prefer to co-locate with your team at your office. Most of these consultancies will prefer to co-locate with you full-time, so that they can mirror your work hours, your culture, and your workflow rhythms. Some co-location consultancies will prefer to do so only 2–4 days per week, instead of full-time.\n  *  **Co-location at the consultancy’s office** —There are a slew of agile consultancies that prefer that your tech team (or a subset of your tech team) co-locate with them at their office. These consultancies are often dogmatic in their approach and host as a way to help you absorb their culture and best practices, so that they can teach you their philosophy for building software.\n  *  **Remote**—There are many flavors of remote agile consultancies. This includes consultancies that are themselves remote, where each team member works from home or from various global locations. It also includes consultancies that have all employees come to their office, yet their office happens to be offsite. Remote consultancies can be in your state, they can be nearshore, or they can be offshore.\n\n###  _Which is best for me?_\n\n _If you can afford to have the agile consultancy team at your office, it is\nhighly recommended to co-locate at your office. Co-location is ideal for\ncollaboration. Co-location is also ideal for working through complex problems\nas a team. In addition, the agile consultancy that co-locates at your office\ngets to experience your company culture firsthand, and they get to know your\nentire company, not just the tech team._\n\n _On the other hand, if you need a team that’s cost-effective to bang out some\ncode when you have a relatively defined product backlog, then working with a\nremote team is doable._\n\n _If your team is relatively new to software development, if you don’t have an\nexisting tech team process, or if you feel your existing process and culture\nare toxic and you want to send a small SWAT team away from your office to\nexplore different ways of working and bring those best practices back to the\nlarger group, then having your team co-locate at the agile consultancy is the\nbest option._\n\n## Build _for_ you vs. build _with_ you\n\nAn agile consultancy is either going to build software _with_ your team, or\nthey are going to build software _for_ you.\n\n  *  **Build it _for_ you**—Agile consulting companies that build product _for_ you will collaborate with you to identify your prioritized backlog of features. They will likely give you frequent demos and hold frequent planning sessions to ensure they are continuously working on the most important features. Typically, you won’t get to choose who the team members are. You will have less influence in choosing the technology the team uses to build the software or to track things like the feature backlog and bugs. You also have less influence on the agile engineering practices used. Teams that build software for you will need to hand over the product to you once the requirements are met. Good “build it for you” consultancies will offer a maintenance contract after the product is shipped, in order to perform ongoing upkeep of the code they have written, or they will pair with your developers to train them to support it.\n  *  **Build it _with_ you**—Agile consulting companies that build product _with_ you often co-locate with your tech team, either at your office or theirs. (Note: Remote teams can also build with you. In this case, you’ll likely use tools such as Slack and Google Hangouts to collaborate daily.) If you work with a “build it with you” consultancy, you will likely have your own team members (both engineering and product) on the same Scrum team with the agile consultancy engineers and product consultants. If the consultancy is good, to the Scrum team it will feel as if it is truly one team working toward a shared goal. Agile consultancies that build product _with_ you will have a large focus on transitioning ownership of the software to your team once the product is launched.\n\n###  _Which is best for me?_\n\n _If you have engineers on your team who will be part of the project team,\nthen “build it with you” is the way to go. If you don’t have engineers, then\nyou’ll need to go with “build it for you.” You’ll likely have either a product\nmanager, project manager, Scrum Master, or product owner who owns prioritizing\nfeatures you need built. The agile consultancy can also supply product folks,\ntoo, but ultimately you’ll want someone who works for you to make the final\nproduct decisions._\n\n## Specialists vs. generalists\n\nAny agile consultancy worth its salt has engineers who can work in both\ngreenfield and legacy applications. Beyond that, it’s important for you to\nunderstand whether the consultancy believes in specialists or generalists.\n\nSpecialists are developers who are deeply versed in one particular technology\nor set of technologies. For example, consultancies that employ specialists may\nsay they have front-end developers and back-end developers.\n\nGeneralists are developers who can truly run the gamut, from front-end to\nback-end. Generalists can often also do a variety of other things well, such\nas mobile development, data engineering, DevOps, and product management.\nConsultancies that employ generalists often say they have full-stack\ndevelopers.\n\n###  _Pro Tip_\n\n _Please believe me when I tell you there is no single developer in existence\nwho can do everything. Also please believe me that if you are seeking expert\nhelp in a technology that just came out six months ago, you don’t need an\n“expert” in this particular technology. What you do need is to know which\ntechnologies are adjacent enough to other technologies for existing expertise\nto be relevant. For example, Angular 4 came out in March 2017. You do not need\nto hunt the corners of the earth to find an Angular 4 expert. A seasoned agile\nfull-stack engineer who’s been using React or Angular 2 can hit the ground\nrunning quite quickly. On the other hand, a full-stack engineer who’s not up\nto speed on modern front-end frameworks and who has been coding in Java\nexclusively for the past two years might have a steeper learning curve._\n\n###  _Which is best for me?_\n\n _In my opinion, generalists are better than specialists for one big reason:\nnew platforms and frameworks and languages are coming out at a faster pace\nthan ever before. In order to ensure you are using the most valuable tool-set\nfor your needs, you’re best set up for success if you work with developers who\ncan learn quickly. This way, when Angular 4 loses out to the next shiny thing,\nyour agile developer consultants can give you their well-informed opinions on\nwhich technology to use, versus having a specialist who will tend to recommend\nthe toolset they currently use, which is not always the best answer for your\nbusiness._\n\n## Employees vs. freelancers vs. staffing agency\n\nThe type of employee/employer relationship that agile consulting companies\nhave with their developers is a key component in choosing the right\nconsultancy for you. Some agile consulting companies have full-time employees,\nsome use freelancers, and some are staffing agencies that seek only to find\nsomeone for a project after the project is signed.\n\nAgile consulting companies with full-time employees are the top tier of\npricing, because you are getting a stable team that brings you years of\ncollective expertise. Agile consulting companies that are staffing agencies\nhave very low overhead and very low risk, so while pricing is lower, you\nshould not expect to get the same caliber of consulting from a staffing agency\nmodel as you’ll get from partnering with an agile consultancy that employs\nfull-time developers.\n\nAnd then there are freelancers. Some freelancers are sole proprietors. Other\nfreelancers work as part of a larger consultancy. Freelancers who work as part\nof a larger consultancy are rolled into whatever model the consultancy uses\nfor its other projects. Freelancers who work solo find one project at a time,\ncharge the highest rate they can get, and then when that gig winds down, they\nfind their next project. Solo freelancers are, in my experience, really smart\nand great to work with if you need only one person.\n\n###  _Which is best for me?_\n\n _If you’re looking for “butts in seats” to pump out code, the staffing agency\nmodel is a great choice. If you need only one person, as I mentioned above,\nhiring a freelancer is an option. However, the minute you need a second\nperson, you’ll have to reinvest your time into finding another company to\npartner with. Some freelancers have a strong network of other freelancers they\ncan pull in, but most don’t. If you are seeking true consulting that will help\nleverage the skill set of your entire team and add business value beyond the\nlines of code written, then the cost of the higher-end consulting companies\nthat carry full-time employees is a wiser choice._\n\n## How to pick the best agile software consultancy for you\n\nNow that you have a sense of the variables you’ll find in each Agile software\nconsultancy, the best way to vet and pick a partner is:\n\n  1. Speak with three different agile software consultancies. Tell them about your team, your culture, and your needs. Get a sense of their approach, their style.\n  2. If none of the three consultancies feels like a fit, go back to the drawing board and ask yourself if you really are seeking an agile software consultancy. Perhaps you are seeking a digital agency or some other type of firm.\n  3. If at least two of the three companies feel like a potential fit, meet with any of the three that you feel could be a strong partner. Do this in person if at all possible, or at least do a Google Hangout.\n  4. Speak with one or two references from each company you meet with. Ask to speak with a client that’s as similar to you as possible—meaning a client that has faced similar issues. It doesn’t have to be someone in your industry or even with your tech stack. Rather, it’s important for you to hear firsthand how the consultancy helped someone facing similar roadblocks.\n  5. Ask to meet the people you’ll actually be working with. This can be socially over lunch, or in a team meeting. It’s important that there be a culture fit not only between you and the sales team, but also between you and the agile engineers you’ll be working with. Again, Google Hangouts is an alternative, if the developers aren’t local.\n\nAt this point, if you’ve got a company you feel excited about, go for it! Be\nsure to get an early termination or a trial period, so that you can change\nyour mind if you start the engagement and learn something that gives you\npause.\n\n### Debbie Madden\n\nFounder & Chairwoman\n\nNo items found.\n\nCONTACT US\n\nLLM/AI\n\nGenAI HubLLM Crash CourseAI/LLM HubBeyond Copilot Webinar\n\nWorkshops\n\nMeasuring Team EffectivenessProduct VisioningUser Centered Design Thinking\n\nAssessments\n\nTeam AssessmentProduct AssessmentHiring Optimization\n\nInsights\n\nStride BlogRabbit Hole PodcastScaling Tech PodcastDebbie’s Digest Newsletter\n\nCompany\n\nCareersLeadershipContact\n\nCopyright © 2024 Stride. All rights reserved.\n\nPrivacy PolicyTerms & Conditions\n\n",
    "links": "[{\"link\": \"https://www.stride.build/\", \"text\": \"\"}, {\"link\": \"https://www.stride.build/genai/genai-hub\", \"text\": \"GenAI Hub\"}, {\"link\": \"https://www.stride.build/genai/genai-advisory\", \"text\": \"GenAI Advisory\"}, {\"link\": \"https://www.stride.build/genai/genai-poc\", \"text\": \"GenAI POC\"}, {\"link\": \"https://www.stride.build/genai/genai-secure-poc\", \"text\": \"GenAI Secure POC\"}, {\"link\": \"https://www.stride.build/genai/genai-productionalization\", \"text\": \"GenAI Productionalization\"}, {\"link\": \"https://www.stride.build/genai/stride-conductor\", \"text\": \"Stride Conductor\"}, {\"link\": \"https://www.stride.build/thought-leadership/genai\", \"text\": \"Thought Leadership\"}, {\"link\": \"https://www.stride.build/services/custom-software-development\", \"text\": \"Custom Software Development\"}, {\"link\": \"https://www.stride.build/services/team-assessment\", \"text\": \"Team Assessment\"}, {\"link\": \"https://www.stride.build/services/product-assessment\", \"text\": \"Product Assessment\"}, {\"link\": \"https://www.stride.build/services/staff-augmentation\", \"text\": \"Staff Augmentation\"}, {\"link\": \"https://www.stride.build/services/hiring-optimization\", \"text\": \"Hiring Optimization\"}, {\"link\": \"https://www.stride.build/services/product-discovery\", \"text\": \"Product Discovery\"}, {\"link\": \"https://www.stride.build/services/swat-team\", \"text\": \"SWAT Team\"}, {\"link\": \"https://www.stride.build/services/product-workshops\", \"text\": \"Product & Design Workshops\"}, {\"link\": \"https://www.stride.build/services/web-performance-optimization\", \"text\": \"Web Performance Optimization\"}, {\"link\": \"https://www.stride.build/services\", \"text\": \"All Services\"}, {\"link\": \"https://www.stride.build/case-studies\", \"text\": \"case studies\"}, {\"link\": \"https://www.stride.build/about\", \"text\": \"Company\"}, {\"link\": \"https://www.stride.build/careers\", \"text\": \"Careers\"}, {\"link\": \"https://www.stride.build/press-release/announcing-stride-conductor\", \"text\": \"Press Releases\"}, {\"link\": \"https://www.stride.build/blog\", \"text\": \"Stride Blog\"}, {\"link\": \"https://www.stride.build/newsletter/debbies-digest\", \"text\": \"Debbie's Digest Newsletter\"}, {\"link\": \"https://www.stride.build/podcast/scaling-tech-podcast\", \"text\": \"Scaling Tech Podcast\"}, {\"link\": \"https://www.stride.build/stride-conductor/stride-conductor-demo-a\", \"text\": \"Schedule Demo\"}, {\"link\": \"https://www.stride.build/blog/expert-advice-test-driven-development-tdd\", \"text\": \"test-driven development\"}, {\"link\": \"https://www.stride.build/\", \"text\": \"Stride,\"}, {\"link\": \"https://www.stride.build/podcasts/16-remote-teams\", \"text\": \"Remote\"}, {\"link\": \"https://www.stride.build/contact\", \"text\": \"CONTACT US\"}, {\"link\": \"https://www.stride.build/genai/genai-hub\", \"text\": \"GenAI Hub\"}, {\"link\": \"https://www.stride.build/llm-crash-course\", \"text\": \"LLM Crash Course\"}, {\"link\": \"https://www.stride.build/hub/artificial-intelligence-llms\", \"text\": \"AI/LLM Hub\"}, {\"link\": \"https://www.stride.build/webinar/beyond-copilot-the-future-of-codegen\", \"text\": \"Beyond Copilot Webinar\"}, {\"link\": \"https://www.stride.build/workshops/measuring-team-effectiveness\", \"text\": \"Measuring Team Effectiveness\"}, {\"link\": \"https://www.stride.build/workshops/product-visioning\", \"text\": \"Product Visioning\"}, {\"link\": \"https://www.stride.build/workshops/user-centered-design\", \"text\": \"User Centered Design Thinking\"}, {\"link\": \"https://www.stride.build/services/team-assessment\", \"text\": \"Team Assessment\"}, {\"link\": \"https://www.stride.build/services/product-assessment\", \"text\": \"Product Assessment\"}, {\"link\": \"https://www.stride.build/services/hiring-optimization\", \"text\": \"Hiring Optimization\"}, {\"link\": \"https://www.stride.build/blog\", \"text\": \"Stride Blog\"}, {\"link\": \"https://www.stride.build/podcast/scaling-tech-podcast\", \"text\": \"Scaling Tech Podcast\"}, {\"link\": \"https://www.stride.build/newsletter/debbies-digest\", \"text\": \"Debbie’s Digest Newsletter\"}, {\"link\": \"https://www.stride.build/careers\", \"text\": \"Careers\"}, {\"link\": \"https://www.stride.build/about\", \"text\": \"Leadership\"}, {\"link\": \"https://www.stride.build/contact\", \"text\": \"Contact\"}, {\"link\": \"https://www.stride.build/privacy-policy\", \"text\": \"Privacy Policy\"}, {\"link\": \"https://www.stride.build/terms-of-service\", \"text\": \"Terms & Conditions\"}]"
}