{
    "summary": "P.O. Box 202501 • Helena, MT 59620-2501\n\n  * Calendar\n  * About Us\n  *   * \n\nPutting Montana Students First\n\n  * Facebook\n  * Twitter\n  * YouTube\n\nSearch\n\nMenu\n\n  * Families & Students \n    * Family & Student Support \n      * Alcohol & Drug Prevention\n      * Bullying Prevention\n      * Civil Rights & Legal Topics\n      * Driver Education\n      * English Learners\n      * Military Programs & Family Support\n      * Sex Trafficking & Sexual Abuse\n      * Special Education\n      * Title IX\n      * Tobacco Use Prevention\n    * Parent Resources \n      * Charter Schools\n      * Parent Resources\n      * Education Savings Account\n    * School Topics \n      * After School Programs\n      * Early Childhood\n      * Every Student Succeeds Act (ESSA)\n      * Just for Families\n      * K-12 Content Standards & Revision\n      * Look Up Educator Credentials\n      * School Nutrition\n    * Student Resources \n      * Adult Education\n      * HiSET (Changeover From GED)\n      * HiSET Options Program For High School Students\n      * Student Scholarships & Student Exchange\n      * Student Support Services\n      * Summer Learning Opportunities\n  * Educators \n    * Licensure \n      * Educator Licensure Home\n      * Educator Licensure FAQ's\n      * Educator License Options & Requirements Information\n      * Earn Professional Development Units Online\n      * Educator Licensing & Preparation Task Forces\n      * Educator Recruitment & Retention\n      * Jobs for Teachers\n      * Montana Teacher Residency\n      * Renew, Reinstate License, or Add Endorsement\n      * TeachMT (TMT) Licensing System\n    * School Climate & Student Wellness \n      * AED & First Aid in Schools\n      * Alcohol & Drug Prevention\n      * Bullying Prevention\n      * Health Enhancement\n      * Montana Autism Education Project\n      * Safe & Supportive Schools\n      * School Mental Health\n      * School Nutrition\n      * Sex Trafficking & Sexual Abuse\n      * Special Education\n      * Suicide Prevention\n      * Tobacco Use Prevention\n    * Teaching & Learning \n      * Accelerating Math Exponentially\n      * Career & Technical Education (CTE)\n      * Discovery Education\n      * Early Childhood\n      * Gifted, Talented & AP\n      * Indian Education\n      * K-12 Content Standards\n      * Montana Ready\n      * Multi-Tiered Systems of Support\n      * Professional Learning\n      * Reading & Early Literacy\n      * Summer Institute\n      * Teacher Learning Hub\n      * Teacher of the Year\n    * OPI Communication \n      * Employment at the OPI\n      * iGraduate Grants\n      * OPI Email Communication\n      * OPI Productions\n      * OPI Compass\n      * Subscribe to Emails\n  * Leadership \n    * Academic Success \n      * Administrators Professional Learning\n      * After School Programs\n      * Every Student Succeeds Act (ESSA)\n      * Executive & Teacher Leadership Academies\n      * Montana Advanced Opportunities\n      * Federal Programs\n      * Transformational Learning\n    * Assessment & Accountability \n      * Educator Licensing & Preparation Task Forces\n      * Educator Preparation\n      * Montana Alternative Student Testing Pilot Program\n      * School Accreditation\n      * Statewide Testing\n    * Data & Reporting \n      * Access OPI Reporting Systems\n      * AIM-Achievement in Montana\n      * CSPR\n      * Data Use in Education\n      * Find & Request Data\n      * GEMS Data Warehouse\n      * Privacy & Data Governance\n      * Youth Risk Behavior Survey\n    * Finance & Grants \n      * District Travel Reimbursements\n      * E-Grants\n      * Elections\n      * Legislative Updates\n      * School Finance\n      * School Nutrition Payments\n    * Management & Operations \n      * Emergency Planning & Safety\n      * Legal Division\n      * Montana Schools Directory\n      * Office of the Superintendent\n      * OPI Secure Portal\n      * School Innovation, Flexibility & Efficiency\n      * School Nutrition\n      * IT Resources for Schools - Programs & Grants\n    * OPI Communication \n      * Education Advocates\n      * MASS Resources\n      * OPI Email Communication\n      * OPI Monthly Compass\n      * OPI Navigator\n      * OPI Productions\n      * Subscribe to Emails\n  * Directory\n\n# __Driver Education\n\n## Welcome to Traffic Education\n\n* * *\n\n\n\nThe Traffic Education Office provides information, resources and support to\nschools, teachers, parents and teens involved in state-approved driver\neducation programs in Montana.\n\nThis office also manages the Montana DRIVE Program located in Lewistown. On\ntrack since 1979, advanced driving workshops are offered every summer for\nadult and teen drivers.\n\n\n\n\n\n### Quick Links\n\n* * *\n\n**Looking for  Driver Education for a Teen Driver? **  \nSearch OPI-Approved Programs\n\n**Please contact your local school district to register a teen for a driver\neducation course.**\n\n**Instructor Login for TEDRS Access**  \nTEDRS Login\n\n**If you need access to the  Traffic Education Data & Reporting System\n(TEDRS), contact LeAnn Haas, ** **(406) 444-4432** **.**\n\n  \n\n  \n\n###\n\n##### Traffic Education Programs\n\n### State-Approved Driver Education for Montana Teens (14.5 to 19 years of\nage)\n\n\n\nMontana's school districts offer quality state-approved driver education that\nincludes traffic safety, parent/guardian involvement, and Graduated Driver\nLicensing (GDL). The Traffic Education Unit approves instructors and school-\nbased programs to ensure Montana standards and requirements are met (10.13.3:\nProgram Standards and Course Requirements for Traffic Education).\n\nTeens who successfully complete a state-approved driver education course in\nMontana have at least:\n\n  * 60 hours of traffic education instruction including 6 hours of behind-the-wheel in-traffic instruction (see Curriculum Standards).\n  * A minimum of 25 days of instruction taught by a state-approved traffic educator.\n  * The opportunity to study for and take the Learner License knowledge exam and receive a Learner License during the traffic education course.\n\nDownload the Montana Traffic Education Standards & Requirements (updated\n2017-2019) for detailed information on Montana's traffic education programs.\n\n\n\n* * *\n\n\n\n### Looking for a Driver Education Course in Montana?\n\nTeens under the age of 16 who wish to drive must complete a state-approved\ntraffic education course offered by a Montana school district.  Teens under\nthe age of 19 can enroll in a state-approved driver education course if they\nare 14.5 years of age before the course completion date.  Districts may\nprioritize equitable enrollment based on additional criteria such as older\nstudents, first come-first serve, or by lottery.\n\nOnline driver education courses and privately-run driver education schools are\nnot approved by the State of Montana because they do not meet the minimum\nstandards and requirements.\n\n**To learn more about registering a teen driver for  driver education, please\ncontact your local school district or high school.**\n\nVisit Approved High School Driver Education Programs to search for Montana\nschool districts offering driver education. Program dates and traffic\neducation instructors for the current and previous school years are shown.\n\n\n\n* * *\n\n\n\n### Graduated Driver Licensing\n\nMontana's GDL law (MCA 61.5.132-135) is a three-step program that reduces the\nrisk while new drivers under age 18 develop and improve their driving skills.\nTeens still get to drive—with supervision—and gradually gain experience to\nbegin driving on their own, but with restrictions  on night driving and\npassengers.\n\nYoung drivers face the highest crash risk in darkness and each teen passenger\ndoubles the crash risk.  Safety research is clear that newly licensed drivers\nshould start driving with no young passengers.  Learning to drive is a\ncomplex, ongoing process that requires responsibility and thousands of miles\nof practice to develop competence, skill, and judgment. Just like with sports\nand music, good habits and abilities grow through experience and good\ncoaching.\n\nWhen teens have their full privilege license, parents should continue to drive\nwith their teen, monitor, model, and enforce the rules, and encourage safe\ndriving habits.\n\nMontana GDL Factsheet & Teen Driving Log\n\n\n\n* * *\n\n\n\n### Cooperative Driver Licensing Program (CDTP)\n\nThe OPI partners with the Montana Department of Justice, Motor Vehicle\nDivision (MVD) to oversee the Cooperative Driver Testing Program (CDTP), which\nallows certified teachers to administer driver license tests and issue Learner\nLicenses (MCA 61-5-110).  Traffic education funding from a percentage of\ndriver license fees is reimbursed to schools to partially offset school\ndistrict driver education expenses.  Teens must be at least age 14.5 to take\nthe knowledge exam and receive a Learner License.\n\n\n\n* * *\n\n\n\n### Students with Disabilities in Driver Education\n\nThis guide to Accommodating Students with Disabilities in Driver Education can\nhelp administrators, teachers and parents determine the best situation for a\nteen driver with physical or mental challenges.\n\nThe Informational Guide for Driver Education Instructors who work with Deaf or\nHard-of-Hearing Students is also an excellent resource.\n\n###\n\n##### Driver Education Teachers\n\nMontana's state-approved traffic education instructors are dedicated\nprofessionals who are specially trained to offer high-quality driver education\nand traffic safety training in more than 130 school districts.  Driver\neducation teachers use a curriculum with hands-on classroom activities as well\nas a minimum of six hours behind the wheel.\n\nDriver education instructors are in demand in Montana's cities and towns.\nVisit the OPI Jobs for Teachers page to find a job or post a job opening for\nyour school district. Download the Montana Traffic Education Teacher\nRecruitment Guide to encourage teachers in your school to join the profession.\n\n**Click   _HERE_  for information about the CDTP updates in effect August\n2022. **\n\n\n\n###\n\n##### New Driver Educators\n\nTo teach traffic education in Montana’s public schools, teachers must have an\nactive Montana educator license, an acceptable driving record, and at least 8\nsemester credits in initial traffic education coursework taken at Montana\nState University-Northern (MSUN).  Traffic education courses taken elsewhere\nmay be transferable to Montana. To maintain their approval to teach traffic\neducation, teachers need to be working toward their Traffic Education\nEndorsement and earn the 20-credit minor.\n\n**Traffic education teachers are in demand in Montana.**   One way a school\nfills this gap is to encourage a currently employed teacher to seek the\ntraffic education endorsement.  In just a few weeks from late spring to early\nsummer, an educator can receive enough training to begin teaching traffic\neducation in mid-summer with initial approval from the OPI Traffic Education\nOffice.  Visit the MSUN Traffic Education webpage for details.\n\n**To learn more about becoming a teacher of traffic education and what is\nrequired to maintain your approval, download  Teaching Traffic Education in\nMontana FAQ's. **\n\n###\n\n##### Approval & Endorsement\n\nDriver educators who have received their initial approval need to continue\nearning traffic education credits toward their traffic education endorsement.\nAfter the first eight initial credits, a minimum of 12 additional credits need\nto be earned.  See  **Steps to Traffic Education Approval and Endorsement**\nfor details.\n\n\n\n###\n\n##### Driver Education Instructor Renewals\n\nTE05 Montana Traffic  \nEducation Teacher Renewal Form\n\nCurrent or returning Traffic Education teachers who need to renew their\napproval to teach traffic education in the State of Montana must submit a TE05\nform to the OPI. The form can be filled out above and submitted\nelectronically.\n\nIf you are a teacher  **applying for the FIRST time**  to become a traffic\neducation teacher, please return to the Driver Educators page and follow the\ninstructions for new approvals.\n\nApproval to teach traffic education must be renewed with each renewal of the\nteacher's educator license.  **SUBMIT THE TE05  FORM BEFORE SEPTEMBER 30.**\nYour approval to teach traffic education expires on October 1 the same year\nyour educator license expires.  _Please note: Your educator license needs to\nbe renewed by June 30._\n\nWe require the TE05 form so we can 1) check your driving record, 2) affirm\nyour intention to continue teaching driver education, and 3) update your\ncontact information.\n\n**Submit this form  ** **anytime  following renewal of your educator license.\n** We will approve your TE05 when:\n\n  * Your educator license is renewed.\n  * Your driving record has been checked.*\n  * Any required college credits earned toward your traffic educator minor have been verified by MSU-Northern, Havre.**\n\n_*   If you are registered to drive in a state other than Montana, you will\nneed to obtain a current copy of your driving record from the appropriate\nstate agency and submit with this renewal form._\n\n_** Upon request, MSU-Northern will send OPI an updated Traffic Education\nProgram Sheet._\n\nNot sure how many credits you need to renew? Contact LeAnn Haas at (406)\n444-4432 with any questions you may have.\n\n\n\n\n\n* * *\n\n\n\nVisit the Montana State University-Northern (Havre) website for more\ninformation on obtaining the required credits to maintain approval while\nworking toward a traffic education minor.\n\nEarn one college credit by attending and writing a paper on the spring\nconference of the Montana Traffic Education Association.\n\nEarn one college credit by completing a Montana Drive Workshop and student-\nteaching the following day.\n\n###\n\n##### Cooperative Driver Testing Program (CDTP) Certification\n\nAll state-approved traffic educators in Montana must be CDTP-trained and\ncertified.  Training is provided at MSU Northern as part of the initial\ncoursework to become a traffic education teacher.  Upon hiring by a school\ndistrict, the instructor and the district must submit two required forms to\nthe MVD/DOJ to be certified to give CDTP tests to students. Contact the\nTraffic Education office to obtain CDTP certification forms.\n\nCDTP training manuals are available from the Motor Vehicle Division at the\nDepartment of Justice or from the Traffic Education Office and distributed\nonly to CDTP-certified instructors.  Individuals with TEDRS access can\ndownload CDTP learner license and road test forms at the Student List entry\nscreen.\n\n\n\n\n\n###\n\n##### Montana Traffic Education Association\n\nThe OPI Traffic Education Office partners with the Montana Traffic Education\nAssociation throughout the year to guide professional development\nopportunities for Montana’s traffic educators.  We also co-host the annual\nspring conference for traffic safety and driver education professionals.\n\n  * Become a member or recruit a new member in your school district.\n  * Visit MTEAOnline.org to read MTEA News and learn more about the organization.\n  * Plan to attend the 2024 annual spring conference April in Great Falls, MT. \n  * Find conference handouts and presentations. \n  * New conference attendees can put their name in a drawing for one of three David Huff Memorial Scholarships.\n  * Find MTEA on Facebook!\n\n###\n\n##### Montana DRIVE Summer Workshops\n\n### **Registration Opens February  1st! **\n\n### **Teens Register March 1st!**\n\nSpend one day on the closed race track in Lewistown, Montana, and learn life-\nsaving skills to respond safely to driving risks. Since 1979, more than 16,000\ndrivers have participated in a Montana DRIVE Workshop.\n\nAdult Workshops are scheduled from June 5 to August 11, 2023\n\nLearn More\n\n###\n\n##### Driver Education Resources\n\n### Celebrate Teen Driver Safety Day Every Day\n\n\n\n###\n\n##### Parents & Teens\n\n  * NEW: Driver Education FAQs\n  * KEYS Teen Driver Rating Form\n  * KEYS Parent Teen Agreement\n  * KEYS Parent Teen Homework\n  * Accommodating Students with Disabilities in Driver Education\n  * My Car Does What - Safety Features Videos, Graphics & more\n  * Impact Teen Drivers\n  * Montana Students and Driving Behaviors \\- 2021 reports from the Youth Risk Behavioral Survey\n\n\n\n###\n\n##### GDL - Graduated Driver Licensing Law\n\n  * GDL Factsheet and Driving Log\n  * Getting Your MT GDL Restricted License \\- A guide for parents when their teen has completed their 6-month GDL practice period.\n  * Montana Driver Manual - 2018\n  * DriveItHOME - National Safety Council\n  * Teen Driver Source Practice Guide\n  * Ten Years of Montana GDL\n  * Graph: Montana Teen Driver Crashes since GDL - 2008-2017\n\n###  \n\n###\n\n##### Distractions\n\n### Distractions\n\n  * Map of Montana Cities, Counties and Reservations with Bans on Use of Handheld Phones while Driving\n  * Distracted: Eyes off the Road (Montana PBS Video)\n  * AT&T - It Can Wait - Texting & Driving\n  * Stop the Texts. Stop the Wrecks\n  * CDC - Distracted Driving\n  * CDC - Drowsy Driving\n\n\n\n###\n\n##### Seat Belts\n\n  * Montana Seat Belt Law\n  * Seat Belt Survey Form\n  * Observational Seat Belt Survey Form\n  * Buckle Up Montana - MDT\n  * YRBS Seat Belt Graph\\- 2011 to 2021\n  * #BuckleUpBlue4Lauryn on Facebook\n\n\n\n###\n\n##### Crossing Guards\n\n  * Crossing Guard Tip Sheet\n  * Montana School Crossing Guard Training PPT\n  * Montana Crossing Guard Training Rules\n  * SRTS Crossing Guard Guidelines\n\n\n\n###\n\n##### Sharing the Road\n\n  * Bike Walk Montana\n  * Journeys from Home Montana\n  * Intersection Safety Videos - Missoula\n  * Motorcycle Safety\n  * Bicycle Safety - Illinois\n  * Safe Routes to School\n  * Motor Carriers of Montana \\- Resources for truck drivers as well as excellent information on sharing the road with semi-trucks.\n\n\n\n###\n\n##### Montana/National\n\n  * Montana Teen Driver Safety Day\n  * GEMS Data Warehouse - Traffic Education Dashboard\n  * OPI-Youth Risk Behavior Study 2021 \\- Teen Driver Behaviors\n  * OPI - YRBS data comparison of teens with and without driver education\n  * OPI-YRBS County Maps - Vehicle-Related Behaviors 2019\n  * DOJ/MVD - Driver Services\n  * MDT - Vision Zero\n  * MDT - Flashing Yellow Arrows\n  * MDT - Using a Roundabout\n  * Crash Maps and NHTSA Data\n  * NTSB Most Wanted List\n  * MSU-Northern Traffic Education Teacher Courses\n  * Montana Traffic Education Association\n\n\n\n###\n\n##### Schools with Driver Education Websites\n\n  * Billings \\- 406.281.5074\n  * Bozeman \\- 406.522.6013\n  * Butte \\- 406.533.2890\n  * Great Falls\\- 406.268.6082\n  * Helena \\- 406.324.2123\n  * Kalispell \\- 406.751.3983\n  * Missoula \\- 406.728.2400 x7048\n\n###\n\n##### Driver Education Forms & Reports\n\nManage Your traffic education program using the Traffic Education Data &\nReporting System (TEDRS).  For school district access to TEDRS, contact LeAnn\nHaas, 406-444-4432.\n\nTEDRS Login\n\nCheck out the GEMS Data Warehouse, Traffic Education Dashboard, Data from the\nTraffic Education Year-End Report\n\n\n\n* * *\n\n\n\n### Traffic Education Forms\n\n  * Required TE Forms, Deadlines, and Using TEDRS\n  * TE01 District Application for Program Approval\n  * TE02 School/Dealer Vehicle Use Agreement\n  * TE03 Certification Signature Sheet for Student List\n  * TE04 Traffic Education Student List\n  * TE05 Application for Approval as a Teacher of Traffic Education\n  * TE06 Year-End Report\n  * In Case of Accident Form\n  * Vehicle Inspection Form\n\n\n\n### Traffic Education Reports\n\nVisit GEMS for comprehensive data regarding traffic education programs in\nMontana.\n\n#### Reimbursements to School Districts in August 2022:\n\n  * 2022-23 Reimbursement by County\n  * 2022-23 Reimbursement by District\n\n#### Prior Year Reports:\n\n  * 2021-22 Reimbursement by County\n  * 2021-22 Reimbursement by District\n  * 2020-21 Reimbursement by County\n  * 2020-21 Reimbursement by District\n\n\n\n\n\n###\n\n##### Montana Teen Driver Education Curriculum\n\nThe traffic education curriculum modules distributed by the Office of Public\nInstruction meet the Montana traffic education standards and benchmarks\ndescribed in the  **Curriculum Guide for Teen Driver Education and Training**.\nRefer to the  **Curriculum Modules Guide**  for a description of all\ncurriculum modules and how to integrate with behind-the-wheel instruction.\n\n**Check back often to download the latest updates.  **Please let us know if\nyou have any problems or long delays when trying to access these files.\n\nDownload Curriculum Modules\n\n  * **About the PDF versions:  **The PDF versions of the Powerpoint files MUST be downloaded to your computer for quick video playback.  Most files are in Adobe Acrobat (pdf) format. Download the free Adobe Acrobat Reader if you need it.  Factsheets with related worksheets are combined into one file. The Lesson Plans have been removed; we recommend using the PDF versions of the Powerpoint files for presenter notes or view them in your Powerpoint program.\n  * **About the videos:**  Visit the new OPI Traffic Education YouTube channel! All videos that appear in curriculum modules are now in Playlists on YouTube. Videos with audio will be closed captioned.\n\n\n\n* * *\n\n\n\n### Administration\n\n  * MT Traffic Education Curriculum Guide\n  * Curriculum Modules List\n  * Classroom and BTW lessons Scope and Sequence\n  * Behind-the-Wheel Instruction Guide 2017  Includes a section on evaluating teen drivers' performance and progress.\n  * MT Traffic Education Standards and Requirements for School Districts\n  * MT Standards for Literacy, Tech and Traffic Education\n\n\n\n### Research & Resources\n\n  * Montana Seat Belt Law handout\n  * Traffic Education Student Research Topics\n  * Effect of Passengers on Teen Driver Behavior- NHTSA\n  * Crash Log and Media Report\n  * Car Crash Parent Letter Activity\n  * Driver Ed Classroom Activities - Idaho\n  * BTW Activities - Idaho\n  * IIHS in the Classroom. Explore free educational resources to help you learn or teach about the science of car crashes. Insurance Institute for Highway Safety (IIHS).\n\n\n\n### Instructional Videos\n\n  * Intersection Safety for Motorists, Bicyclists and Pedestrians\n  * Visit the new OPI Traffic Education YouTube channel! All videos that appear in curriculum modules are now in Playlists on YouTube. Videos with audio will be closed captioned.\n  * Understanding Car Crashes: It's Basic Physics! Teacher's Guide for Grades 5-12, Griff Jones, Ph.D.\n  * Understanding Car Crashes: When Physics Meets Biology, Teacher's Guide for Grades 5-12, by Griff Jones, Ph.D.\n\n###\n\n##### Adapted Illustrated Montana Driver Manual\n\nThe _Adapted Illustrated Montana Driver Manual_ is an easy-to-read,\nillustrated version of the Montana Driver Manual. It can help driver license\napplicants understand and remember traffic safety laws and regulations that\nare required to obtain and keep a Montana driver license. Each of the eight\nchapters includes a practice quiz with an answer key.\n\nThe manual ( _revised 2023_ ) can be downloaded as an Acrobat pdf file (7.5\nMB) and viewed on a computer, tablet or smart phone. The free Adobe Acrobat\nreader can be downloaded here. **  Contact the State of Montana Print and Mail\nto inquire about printing this manual.**\n\n**From the Introduction:**  This adapted illustrated driver manual is based on\nthe 2015 Montana Driver Manual published and distributed by the Motor Vehicle\nDivision of the Montana Department of Justice. The adapted manual is organized\nand presented in a clear and easy-to-read format with graphics and images.\n\nIn addition to helping new drivers learn the rules of the road and pass the\ntest for a first Montana driver license, the Adapted Illustrated Montana\nDriver Manual includes positive encouragement to drive without distractions\nand impairment, to share the road safely, and to always buckle up.\n\nFirst published in 1971, this manual has been updated and republished four\ntimes, including this 2018 edition, which includes minor changes reflecting\nnew motor vehicle laws passed by the 2017 Legislature. Contact the Traffic\nEducation Office with any questions or comments about the Adapted Manual.\n\nIn 2016, every public library and most high school libraries received a copy\nof the manual.\n\nDownload a copy of the latest Montana Driver Manual published by the MT\nDepartment of Justice (as of 6/24/22 the latest version was published in\nOctober 2018).\n\n\n\n* * *\n\n\n\n### Listen to the Audio Version!\n\nVolunteers at the Montana Talking Book Library completed a recording of this\nmanual in January 2017. Click on the sections/chapters below to open the\nWindows Media Player (.wav) files and listen while viewing the corresponding\nsections of the manual.\n\n  * Contents and Introduction (7:09)\n  * Chapter 1 – The Driver License (19:51)\n  * Chapter 2 – Motor Vehicle Equipment (23:40)\n  * Chapter 3 – Signs, Signals and Markings (52:34)\n  * Chapter 4 – Driving Rules (44:48)\n  * Chapter 5 – Driving Safely (38:16)\n  * Chapter 6 – Safe Driver Readiness (17:27)\n  * Chapter 7 – Emergencies and Collisions (25:18)\n  * Chapter 8 – Driving Records and Penalties (12:32)\n  * Glossary of Terms (25:36)\n  * True Statements Review (4:51)\n  * Acknowledgements (6:37)\n\nContact the Traffic Education Office if you have problems or need to request\nthe audio version on a flash drive. The Office of Public Instruction is\nindebted to the Montana State Library and many volunteers who clearly and\naccurately read the 140-page manual to produce this audio version of the\nAdapted Illustrated Montana Driver Manual.\n\n\n\n  \n\nTraffic Education RSS Feed\n\nTraffic Education - December 2023\n\n  * 11/13/2023 01:52 PM MST\n\nTraffic Education-October 2023\n\n  * 11/07/2023 12:04 PM MST\n\nReceive Email Updates\n\nCopy the code below and paste it into your blog or Web page:\n\n<script id=\"govd_widget_js_mtopi_mtopi_widget_224\"\nsrc=\"https://content.govdelivery.com/accounts/MTOPI/widgets/MTOPI_WIDGET_224.js\"\ntype=\"text/javascript\"></script> close\n\n  \n\n* * *\n\n## OPI Staff are here to help:\n\n\n\nDwight Nelson, Traffic Education Director: 406-444-4396\n\nLeAnn Haas, Program Specialist: 406-444-4432\n\nMeet the Team\n\n* * *\n\n\n\n\n\n  * Privacy & Security\n  * ADA Notice\n\n",
    "links": "[{\"link\": \"https://opi.mt.gov/OPI_Calendars\", \"text\": \"Calendar\"}, {\"link\": \"https://opi.mt.gov/Families-Students/Family-Student-Support/Driver-Education\", \"text\": \"Driver Education\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page%20Files/Driver%20Education/Curriculum/Administration/MT-Traffic-Education-Standards-Requirements-2019.pdf\", \"text\": \"\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page%20Files/Driver%20Education/Curriculum/Administration/TE-Curriculum-Guide-2019.pdf?ver=2019-02-08-105057-433\", \"text\": \"Curriculum Standards\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page%20Files/Driver%20Education/Curriculum/Administration/MT-Traffic-Education-Standards-Requirements-2019.pdf?ver=2019-02-15-154648-220\", \"text\": \"Montana Traffic Education Standards & Requirements\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page%20Files/Driver%20Education/MT-GDL-Factsheet-Log-2017.pdf\", \"text\": \"Montana GDL Factsheet & Teen Driving Log\"}, {\"link\": \"https://opi.mt.gov/Educators/Licensure/Jobs-for-Teachers\", \"text\": \"OPI Jobs for Teachers\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page%20Files/Driver%20Education/TeacherRecruitmentGuide2023.pdf?ver=2022-11-22-121736-263\", \"text\": \"Montana Traffic Education Teacher Recruitment Guide\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page%20Files/Driver%20Education/CDTP%20Updates%20November%202022.pdf?ver=2022-11-30-160546-800\", \"text\": \"HERE\"}, {\"link\": \"https://opi.mt.gov/Families-Students/Family-Student-Support/Driver-Education/Montana-Traffic-Education-Teacher-Renewal\", \"text\": \"\"}, {\"link\": \"https://opi.mt.gov/Families-Students/Family-Student-Support/Driver-Education#10920812784-new-driver-educators\", \"text\": \"Driver Educators page\"}, {\"link\": \"https://opi.mt.gov/Families-Students/Family-Student-Support/Driver-Education/Montana-DRIVE-Summer-Workshops\", \"text\": \"Learn More\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page Files/Driver Education/FAQ for Families - 2020.pdf?ver=2020-06-18-104030-613\", \"text\": \"NEW: Driver Education FAQs\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page%20Files/Driver%20Education/KEYS%20Homework/KEYS-Teen-Driver-Rating-Form.pdf?ver=2017-08-18-134351-790\", \"text\": \"KEYS Teen Driver Rating Form\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page%20Files/Driver%20Education/KEYS%20Homework/KEYS-Parent-Teen-Agreement-Form.pdf\", \"text\": \"KEYS Parent Teen Agreement\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page%20Files/Driver%20Education/KEYS%20Homework/KEYS-Parent-Teen-Homework.pdf\", \"text\": \"KEYS Parent Teen Homework\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page%20Files/Driver%20Education/Accommodating-Disabilities-in-Driver-Ed-2017.pdf\", \"text\": \"Accommodating Students with Disabilities in Driver Education\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page Files/Driver Education/TE Resources/Montana Students and Driving Behaviors.pdf\", \"text\": \"Montana Students and Driving Behaviors\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page%20Files/Driver%20Education/MT-GDL-Factsheet-Log-2017.pdf?ver=2017-08-21-140551-527\", \"text\": \"GDL Factsheet and Driving Log\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page%20Files/Driver%20Education/TE%20Resources/Getting-Your-MT-GDL-Restricted-License.pdf\", \"text\": \"Getting Your MT GDL Restricted License\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page Files/Driver Education/Curriculum/Resources and Extras/Montana-Driver-Manual.pdf?ver=2021-06-16-084448-473\", \"text\": \"Montana Driver Manual - 2018\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page%20Files/Driver%20Education/TE%20Resources/Ten-Years-Montana-GDL-article.pdf\", \"text\": \"Ten Years of Montana GDL\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page Files/Driver Education/TE Resources/Montana-Teen-Driver-Crashes-2008-2017.pdf?ver=2018-11-01-105553-390\", \"text\": \"Graph: Montana Teen Driver Crashes since GDL - 2008-2017\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page Files/Driver Education/MT-CELL-PHONE-BAN-MAP.pdf\", \"text\": \"Map of Montana Cities, Counties and Reservations with Bans on Use of Handheld Phones while Driving\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page%20Files/Driver%20Education/Digital%20Assets/Module%205%20MANAGING%20DRIVING%20RISKS/5.3%20PROTECTING%20OCCUPANTS/Montana-Seat-Belt-Law-2017.pdf?ver=2018-02-07-094618-320\", \"text\": \"Montana Seat Belt Law\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page%20Files/Driver%20Education/TE%20Resources/MTseatbeltsurveyform.pdf\", \"text\": \"Seat Belt Survey Form\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page%20Files/Driver%20Education/TE%20Resources/Observational-Seat-Belt-Survey-Forms.pdf\", \"text\": \"Observational Seat Belt Survey Form\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page Files/Driver Education/TE Resources/YRBS Seat Belt Graph.pdf\", \"text\": \"YRBS Seat Belt Graph\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page%20Files/Driver%20Education/TE%20Resources/CrossingGuardTipSheet.pdf\", \"text\": \"Crossing Guard Tip Sheet\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page%20Files/Driver%20Education/TE%20Resources/MTSchoolCrossingGuardTraining.pptx?ver=2017-09-18-142324-827\", \"text\": \"Montana School Crossing Guard Training PPT\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page%20Files/Driver%20Education/TE%20Resources/Montana-Crossing-Guard-Training-Rules.pdf\", \"text\": \"Montana Crossing Guard Training Rules\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page%20Files/Driver%20Education/TE%20Resources/Intersection-Safety-Videos-Msla-Community-Transportation-2017.pdf\", \"text\": \"Intersection Safety Videos - Missoula\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page Files/Driver Education/TE Resources/Montana Students and Driving Behaviors.pdf\", \"text\": \"OPI-Youth Risk Behavior Study 2021 \"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page Files/Driver Education/TE Resources/2019-YRBS-Driver-Ed-comparison.pdf?ver=2019-09-23-141029-100\", \"text\": \"OPI - YRBS data comparison\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page Files/Driver Education/TE Resources/2019MT-Vehicle-Related Behaviors.pdf?ver=2021-06-10-222238-590\", \"text\": \"OPI-YRBS County Maps - Vehicle-Related Behaviors 2019\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page%20Files/Driver%20Education/TE%20Forms%20and%20Reports/Traffic-Ed-Required-Forms_TEDRS-2017.pdf?ver=2017-10-23-105340-753\", \"text\": \"Required TE Forms, Deadlines, and Using TEDRS\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page Files/Driver Education/TE Forms and Reports/TE01-District-Application.pdf?ver=2019-08-29-100034-977\", \"text\": \"TE01 District Application for Program Approval\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page Files/Driver Education/TE Forms and Reports/TE02-School-Dealer-Vehicle-Lease-Loan-Agreement.pdf?ver=2019-08-30-091711-477\", \"text\": \"TE02 School/Dealer Vehicle Use Agreement\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page%20Files/Driver%20Education/TE%20Forms%20and%20Reports/TE03-Certification-Signature-Sheet.pdf?ver=2018-01-26-105526-160\", \"text\": \"TE03 Certification Signature Sheet for Student List\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page%20Files/Driver%20Education/TE%20Forms%20and%20Reports/TE04-Student-List.pdf?ver=2017-08-18-080305-163\", \"text\": \"TE04 Traffic Education Student List\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page%20Files/Driver%20Education/TE%20Forms%20and%20Reports/TE05-Teacher-Application.pdf?ver=2017-08-18-080305-210\", \"text\": \"TE05 Application for Approval as a Teacher of Traffic Education\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page%20Files/Driver%20Education/TE%20Forms%20and%20Reports/TE06-Year-End-Report.pdf?ver=2017-08-18-080305-257\", \"text\": \"TE06 Year-End Report\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page%20Files/Driver%20Education/TE%20Forms%20and%20Reports/In-Case-of-Accident.pdf?ver=2017-08-18-080304-600\", \"text\": \"In Case of Accident Form\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page%20Files/Driver%20Education/TE%20Forms%20and%20Reports/Vehicle%20Inspection%20Form.pdf?ver=2018-01-29-093536-037\", \"text\": \"Vehicle Inspection Form\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page Files/Driver Education/TE Forms and Reports/2021-22-TE-Reimbursement-by-County.pdf?ver=2022-08-02-133957-837\", \"text\": \"2021-22 Reimbursement by County\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page Files/Driver Education/TE Forms and Reports/2021-22-TE-Reimbursement-by-District.pdf?ver=2022-08-02-133957-963\", \"text\": \"2021-22 Reimbursement by District\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page Files/Driver Education/TE Forms and Reports/2021-TE-Reimbursement-by-County.pdf?ver=2021-07-26-085726-317\", \"text\": \"2020-21 Reimbursement by County\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page Files/Driver Education/TE Forms and Reports/2021-TE-Reimbursement-by-District.pdf?ver=2021-07-26-085720-653\", \"text\": \"2020-21 Reimbursement by District\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page Files/Driver Education/Curriculum/Administration/TE-Curriculum-Guide-2019.pdf?ver=2019-02-08-105057-433\", \"text\": \"\"}, {\"link\": \"https://opi.mt.gov/Families-Students/Family-Student-Support/Driver-Education-NEW/Montana-Teen-Driver-Education-Curriculum\", \"text\": \"Download Curriculum Modules\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page Files/Driver Education/Curriculum/Administration/TE-Curriculum-Guide-2019.pdf?ver=2019-02-08-105057-433\", \"text\": \"MT Traffic Education Curriculum Guide\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page%20Files/Driver%20Education/Digital%20Assets/Administration/Modules-Content-Video-Playback-2018.pdf\", \"text\": \"Curriculum Modules List\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page%20Files/Driver%20Education/Curriculum/Administration/Classroom-BTW-Scope-Sequence-2014.pdf\", \"text\": \"Classroom and BTW lessons Scope and Sequence\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page%20Files/Driver%20Education/Curriculum/BTW/BTW-Instruction-Guide-2017.pdf\", \"text\": \"Behind-the-Wheel Instruction Guide 2017\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page%20Files/Driver%20Education/Digital%20Assets/Administration/TE%20MCS-Literacy%20and%20Tech%20Standards.pdf?ver=2018-01-23-115651-550\", \"text\": \"MT Standards for Literacy, Tech and Traffic Education\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page%20Files/Driver%20Education/Digital%20Assets/Module%205%20MANAGING%20DRIVING%20RISKS/5.3%20PROTECTING%20OCCUPANTS/Montana-Seat-Belt-Law-2017.pdf?ver=2018-02-07-094618-320\", \"text\": \"Montana Seat Belt Law handout\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page%20Files/Driver%20Education/Curriculum/Resources%20and%20Extras/TE-Student-Research-Topics.pdf\", \"text\": \"Traffic Education Student Research Topics\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page%20Files/Driver%20Education/Curriculum/Resources%20and%20Extras/Effect-of-Passengers-Teen-Driver-Behavior-NHTSA-2012.pdf\", \"text\": \"Effect of Passengers on Teen Driver Behavior- NHTSA\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page%20Files/Driver%20Education/Curriculum/Resources%20and%20Extras/Crash-Log-Media-Report.pdf\", \"text\": \"Crash Log and Media Report\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page%20Files/Driver%20Education/Curriculum/Resources%20and%20Extras/Car-Crash-Parent-letter-2013.pdf\", \"text\": \"Car Crash Parent Letter Activity\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page%20Files/Driver%20Education/TE%20Resources/Intersection-Safety-Videos-Msla-Community-Transportation-2017.pdf\", \"text\": \"Intersection Safety for Motorists, Bicyclists and Pedestrians\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page%20Files/Driver%20Education/2023.Revision.Adapted.Illustrated.Montana.Driver.Manual.pdf\", \"text\": \"\"}, {\"link\": \"https://opi.mt.gov/Portals/182/Page Files/Driver Education/Curriculum/Resources and Extras/Montana-Driver-Manual.pdf?ver=2021-06-16-084448-473\", \"text\": \"Montana Driver Manual\"}, {\"link\": \"https://opi.mt.gov/Families-Students/Family-Student-Support/Driver-Education/Meet-the-Team\", \"text\": \"Meet the Team\"}, {\"link\": \"https://opi.mt.gov/privacy-terms\", \"text\": \"Privacy & Security\"}, {\"link\": \"https://opi.mt.gov/ADA-notice\", \"text\": \"ADA Notice\"}]"
}