{
    "summary": "Menu\n\n  *   * Home\n  * Corporate\n  * Headshots\n  * Published Work\n  * Travel\n  * About\n    * ABOUT CARRIE\n    * BEHIND THE SCENES\n  * GOSSIP\n  * CONTACT\n  * (480) 261-3879\n  *   *   * Clients\n\nSH22\n\nBusiness Team Photos  \n\nSH22 - copy\n\nProfessional Headshots\n\nceleb111\n\nCorporate Events  \n\nceleb111\n\nRed Carpet  \n\nceleb111\n\nCompany Retreats\n\nceleb111 - copy\n\nTRAVEL IMAGE\n\nPPA Certified and Insured\n\n## View my Corporate Photography Work\n\n# Corporate Event Photography by Carrie Evans\n\n_Hello and thank you for visiting my corporate photography page!_\n\nI am a certified professional corporate photographer and have been working in\nthe **Phoenix and Las Vegas** area for over ten years. I come from a demanding\nbackground of photographing weddings, which has lead me to covering large\ncorporate events.\n\nMy ability to produce useful and creative imagery has put me in the forefront\nof larger than life companies who have sent me all over the country to\ndocument their corporate events _._\n\nThinking and acting quick on the spot is second nature to me. It will seem\nthat I am in several places at once, yet you won’t even know I’m there.\n\nMy non intrusive photo journalistic style will put you at ease and show my\nexperience. But I do love a great big group photo, and will accommodate any\nset up necessary to get the perfect shot.\n\nThe clients I have gained through the years continue to work with me, and for\nthat, I am most grateful.\n\nI am looking forward to meeting my next new client!\n\nCarrie Evans  \nc: (480) 630-1141\n\n### Client Testimonials\n\nSlide 1\n\nI hired Carrie to take headshots at our Chandler campus. We had an annual\nmeeting, with many of our global executives there who were not thrilled about\nhaving their photos taken. Carrie made them feel at ease, and her attention to\ndetail was impressive. She’s a true professional and I can only imagine how\namazing your wedding, special event or family event will turn out. You're\nabout to work with a true professional.\n\n-Kristen Pellicane Sr. Administrative Assistant  \nINTEL  \n\nSlide 1 - copy - copy - copy\n\nI’ve hired Carrie for some amazing editorial photography including covers of\nPhoenix Magazine and our yearly events. She is not only amazingly creative and\nfast, but I consider her a great friend and wonderful to be around. When she\nblows up and is shooting for Rolling Stone and Esquire, I hope she still takes\nmy calls.\n\n\\- Brian Goddard Art Director  \nPhoenix Magazine\n\nSlide 1 - copy - copy - copy - copy\n\nI am the marketing director at Desert Ridge Marketplace, and twice now we have\nhad the extreme pleasure of working with Carrie. The first time Carrie was on-\nsite, she photographed candid and posed shots for our annual report and the\nphotos were perfect. The second time she was on-site photographing our annual\nart walk event. She's creative and offers great suggestions and her attention\nto detail is second to none. I am happy to be a reference for Carrie and\nhighly recommend her.\n\n-Rebecca Smith Marketing Director  \nDesert Ridge Marketplace  \n\nSlide 1 - copy\n\nI am the Marketing Director of The international Cost Estimating and Analysis\nAssociation.Twice now we have had the extreme pleasure of working with Carrie.\nThe first time Carrie was on-site, she photographed candid and posed shots for\nour annual report and the photos were perfect. She's creative and offers great\nsuggestions and her attention to detail is second to none. I am happy to be a\nreference for Carrie and highly recommend her.  \n\\- Megan Jones Executive Director\n\n\\- Megan Jones Executive Director  \nICEAA (Cost Estimating and Analysis Association)  \n\nSlide 1 - copy - copy\n\nCarrie was extremely professional, hard working and did a great job for my\ncorporate event that was held at the Hyatt Gainey Ranch in Scottsdale. She did\neverything I asked her to do and made my job as a meeting planner so easy\nbecause I never had to worry about her. She was great with our clients and\ntook awesome pictures. Sometimes you find photographers that are only\ninterested in when they can eat, who will validate their parking, and when\nthey will get paid - instead of doing the job you hire them for. Carrie was a\nbreath of fresh air and I would use her for all my events if I could!\n\n  \n\\- Anju Lynn Meeting Planner at Senior Helpers\n\n#### Call for Availability & Rates: (480) 630-1141\n\nSUBMIT THE FORM BELOW:\n\nYour Name (required)  \n\nYour Email (required)  \n\nPhone  \n\nYour Message  \n\nBehind the Scenes Videos\n\n#### Some of My Happy Clients!\n\n__\n\n__\n\nCopyright © Carrie Evans 2017\n\nCall or Text Me (480) 261-3879\n\nCall or Text me at (480) 261-3879 and Let's Talk Ideas.\n\n",
    "links": "[{\"link\": \"https://carrieevansstudios.com/corporate-photography/\", \"text\": \"Corporate\"}, {\"link\": \"https://carrieevansstudios.com/corporate-events/\", \"text\": \"corporate events\"}]"
}