{
    "summary": "Menu\n\n  * __\n  * __\n  * __\n  * __Ringwood East, VIC\n\n  * Home\n  * 1 – View My Work\n    * Colour Pop\n    * Neutrals\n    * Lifestyle\n    * Travel Stories\n    * A Bit Of Everything\n  * 2 – Choose a session\n    * LinkedIn Headshots\n    * Business & Personal Branding\n    * Team & Staff Headshots\n    * Actor & Performer Headshots\n    * Model Portfolios\n    * Personal Portraits\n    * Family Portraits\n  * 3 – Book Online\n  * About & Contact\n    * About\n    * Contact Julia\n    * The Studio\n  * More Info\n    * FAQs\n    * Tips & Articles\n    * Portrait Posing Guide\n    * Afterpay\n    * Ts&Cs\n\n  * __\n  * __\n  * __\n  * __Ringwood East, VIC,\n  * __0402 001 533\n\n  * Home\n  * 1 – View My Work\n    * Colour Pop\n    * Neutrals\n    * Lifestyle\n    * Travel Stories\n    * A Bit Of Everything\n  * 2 – Choose a session\n    * LinkedIn Headshots\n    * Business & Personal Branding\n    * Team & Staff Headshots\n    * Actor & Performer Headshots\n    * Model Portfolios\n    * Personal Portraits\n    * Family Portraits\n  * 3 – Book Online\n  * About & Contact\n    * About\n    * Contact Julia\n    * The Studio\n  * More Info\n    * FAQs\n    * Tips & Articles\n    * Portrait Posing Guide\n    * Afterpay\n    * Ts&Cs\n\n#  What does a corporate photographer do?\n\n## Everything You Need to Know About Corporate Photography\n\nWhat does a corporate photographer do? And what is even classified as\ncorporate photography?\n\nThese are questions you may have been googling, and you’ve ended up on my\nhumble website.\n\nWell hello, I’m Julia, a photographer based in Melbourne, Australia and I\nspecialise in corporate headshots and personal branding photography (as well\nas actor headshots, family photography and fine art portraits).\n\n **You need a photographer for business use? Chances are you are looking for\nacorporate photographer.**\n\n## What is corporate photography?\n\nCorporate photography is a form of commercial photography. To sum it up\neasily, corporate photography is for the business and the corporate world.\n\nIt covers everything from staff headshots, and custom stock photography, to\nevent photography in the corporate sector, and photographs of products and\nservices.\n\nIf you need any of the below, then you’re looking for corporate photography:\n\nPersonal or staff headshots,  \nTeam and group photos,  \nCustom stock photography (branding),  \nOffice interior and exterior images,  \nProduct photography.\n\n __\n\n __\n\nLearn more about my corporate photography services\n\n__\n\n__\n\n#### What if I dont want a corporate look?\n\nEvery business is different, and various industries have preferred looks and\nstyles. Lots of businesses have branding guides, which may specify the overall\nfeel and style their images need to follow.\n\nThese things are all important, so knowing and communicating your brand to\nyour corporate photographer is important.\n\nNot all business photography needs to have the formal flair of what you may\nimagine a traditional corporate headshot has. You can introduce colour,\nrelaxed poses, props and more.\n\n#### How Can I Find A Corporate Photographer?\n\nGoogle and word of mouth are your best friends in finding a corporate\nphotographer,\n\nIf you’re in Melbourne, Australia, you’ve already found one (that would be\nme…if you didn’t realise already).\n\nOtherwise, ask other businesses and marketing executives who use photography\nthat you like, and ask for a referral. You can search on LinkedIn, look for\nfeatured articles, and across other social media like Facebook and Instagram.\n\n#### What To Look For In A Corporate Photographer\n\nLook for a photographer who is specialising in corporate photography (whether\nthat be headshots, branding, events or product).\n\nEnsure they have a portfolio of work, and the right equipment to get the look\nyou need (eg do they need portable lighting and backdrops?).\n\nYour photographer should be willing to discuss all your needs, dive into your\nbrand, and offer various options and solutions for you.\n\nLook for a photography who is happy to assist with extra advice for staff\n(such as what to wear, and how to get ready).\n\nA great corporate photographer is one that you can have an ongoing\nrelationship with. It’s valuable to connect with another professional who\nunderstands your business and brand, and can reliably deliver high-quality\nimagery that is consistent.\n\nLearn more about my staff headshots and corporate photography\n\n__ Julia Nance  __ 25/03/2023\n\n__Corporate Headshots\n\n##  Published by\n\n### Julia Nance\n\nJulia Nance is a headshot and portrait photographer based in Melbourne,\nAustralia. Her vibrant creativity is inspired by her experiences. From\nphotographing whales underwater to travelling in Europe. With a vast\nbackground in a range of photographic areas, it is Julia’s natural ability to\nconnect with her subjects that ultimately drew her to the art of\nportraiture.Corporate Headshots  | Personal Branding  | Actor Headshots  |\nLinkedIn Headshots  |\n\nPosts by Julia Nance\n\nPrev  The best colours to wear for headshots\n\nNext  Where to have your portrait taken\n\nComments are closed.\n\n###\n\n  * 2/11 Old Lilydale Road, Ringwood East, VIC\n  *   * +61402001533\n  * portraits@julianance.com.au\n\nJULIA NANCE PORTRAITS | 2024  \n  \nCorporate Headshots & Branding | Actor Headshots | Staff Headshots | Family\nPortraits  \n  \nBook Online | Gallery | About | Contact | Studio | COVID-19 | FAQs | Ts&Cs |\nPrivacy Policy\n\n",
    "links": "[]"
}