{
    "summary": "loading\n\nEd CARREON\n\n  * Portfolio\n    * Commercial\n    * Corporate\n    * Editorial\n    * Healthcare\n    * Industry\n    * Stories\n    * Architecture\n  * Personal\n  * About\n    * Bio\n    * Clients\n  * Contact\n  * News\n\n  *   * \n\nGo Up\n\n# Los Angeles Corporate Photographer\n\nfor commercial, design and communications communities.\n\n## Corporate Photographer\n\nEd Carreon is a business and corporate photographer in Los Angeles, creating\nimages for  **corporate websites**, image libraries, marketing collateral,\n**editorial content**, and corporate branding projects.\n\nEd Carreon is a business and corporate photographer in Los Angeles creating\nimages for **corporate websites**, **editorial content**, image libraries and\nbranding projects.\n\nHe specializes in corporate portraiture and business lifestyle photography,\nwhich along with his **story-telling abilities** and technical skills, help\ncreate a cohesive narrative of your work environment.\n\nHe has over 25 years of experience, beginning as a photojournalist, working\nwith every major news outlet in the United States, and currently collaborates\nwith art directors and marketing and communications professionals from Fortune\n500 companies. .\n\nEd understands corporate culture and what your story needs to communicate so\nthe images have a cohesive style and narrative. He also works well under\npressure and is easy to work with\n\nHe is a great fit for your projects when you cannot afford to fail.\n\nEd understands that he is not selling photography but using photography to\nsell confidence to clients with high-stakes communications and marketing\nprojects.\n\n### Corporate Photography Services\n\n  * • Still Photography.\n  * • Drone Coverage of Exterior and Interior Spaces\n  * • Industrial Product Photography\n  * • Pre-production\n  * • Post-production services\n  * • Referral Network\n\n### West Coast Photographers\n\nFor companies looking for corporate headshots or environmental portraiture, we\ncreate clean, well-lit studio and environmental portraits on location, in the\nstudio, or in outdoor settings.\n\nHe provides light makeup for most subjects and can provide a makeup artist\nwhen desired. His social skills put people at ease in front of the camera, and\nhis superb production skills come together to deliver finished portraits on a\ndeadline, whether for large production shoots or a simple  **corporate\nevents** where we can provide images in near real-time for live social media\nfeeds.\n\nAs a corporate photographer, Ed can distinguish corporate leadership so that\nphotographs have a tight, cohesive style throughout the project. We can draw\nfrom a range of options to distinguish your leadership.\n\nAs a corporate photographer, Ed can distinguish corporate leadership so that\nphotographs have a tight, cohesive style throughout the project. We can draw\nfrom a range of options to distinguish your leadership.\n\nEd can craft individual images for leadership or photograph many individuals\nwith the same style during a day-long session.\n\n#### Additional\n\nThe Los Angeles business community is highly competitive, so branding is vital\nto corporate identity. We work with businesses and designers to create\nsignature business content to meet your branding goals. For instance, a\nmedical device company or design firm may want a more stylized look than a\ntraditional corporate headshot and a law firm or financial institution might\nprefer more conservative portraits.\n\nOur corporate photography rates are project-by-project, and we are competitive\nwith Los Angeles photographers of equal merit.\n\nIf you’d like to see more examples of corporate lifestyle or corporate\nphotography, we can create a web gallery with more images for consideration.\n\n#### Process\n\nOnce we have a signed estimate, Ed will help define production values and\nexpectations and begin planning the project. Ed usually works with an\nassistant and often scouts locations ahead of time to minimize workflow\nfriction on the day of the shoot. We also shoot to a laptop or iPad so clients\nsee what they are getting.\n\nUpon project completion, we edit and upload images to a web gallery for the\nclient to review. After the client selects images, our office will finalize\nthe photos and deliver them electronically via Dropbox.Call us about your next\nphotography project. We would like you to be our corporate photographer in Los\nAngeles.\n\n#### Clients\n\nGilead Sciences, Accura, National Geographic, Discovery Channel, Forbes, New\nYork Times, National Geographic, USC, Cedars Sinai Hospital, Amgen, Corient\nPratt and Whitney, Owens Corning, PIMCO, Chivas Regal, CVS Pharmacy, Chase\nBank, Herbal Life, Life Magazine, Red Cross, Target Corp., Valspar, Relativity\nSpace and Transdev.\n\n  * About\n  * Clients\n  * Internships\n  * Contact\n  * Google Plus\n  * Sitemap\n\n  * Commercial\n  * Corporate\n  * Narrative\n  * Healthcare\n  * Editorial\n  * Architecture\n  * Corporate Event Photography\n  * Corporate Headshots\n  * Industrial Photography\n\n",
    "links": "[]"
}