{
    "summary": "**loading**\n\nMenu\n\n  *   *   *   * \n\n  * Home\n  * About\n  * Portfolio\n  * Pricing\n  * What to expect\n  * Blog\n  * Reviews\n  * contact\n\n# Headshots & Corporate Photography\n\n\"The Triangle’s Trusted Headshot Photography Professionals...\"\n\nWELCOME\n\n## **Welcome to our site!**\n\n### We’re A Team of Photographers shooting **Headshots and Corporate** Events.\n\n#### **_Offering Professional corporate headshots photography on-location and\nin-studio, business portraits, modeling and acting headshots, image branding,\nERAS medical residency application headshots._**\n\n### Available on short notice and providing a fast turnaround.\n\nAbout Our Services\n\nUpdate\n\n##\n\n## Scheduling Headshots & Branding Photography Sessions.\n\n### _Same Day Turnaround on Pictures also Available._\n\nBook Your Session\n\n#### Meet The Photographer\n\nRobert Filcsik - Lead Photographer\n\n  *   *   *   * \n\n###\n\n### Branding Photography, Business Portraits…\n\nSERVICES\n\n### Headshot Photography\n\nIn studio or on-location. We can bring our portable studio setup to your\noffice or outdoor location\n\n#### Professional Headshots\n\nview details\n\n#### Corporate Headshots\n\nview details\n\n## **Creative  ** **Executive  \n****Headshots…**\n\nLOCATION\n\n#####  **In-Studio**\n\nCome and visit us in our cozy studio space.  \nWe offering on-site proofing, fast 24 hours turnaround and digital download as\nimage delivery.\n\n#####  **Office or Outdoor location**\n\nWe’ll travel to your office or preferred outdoor location. Bringing our studio\nto you.\n\nService\n\n### Corporate Event Photography\n\nProviding professional event coverage with same day proofing and a fast 48\nhours turnaround.\n\n#### Environmental Portraits\n\nview details\n\n### Our location is at the Brier Creek  **Raleigh, NC**.\n\n9523 Vira Dr.\n\n### Receive a quote within 1 Hour!\n\n(During business hours)\n\n### We’ll cover all type of events…\n\n## Pricing\n\n### **Success Stories**\n\n#### Curious about what our clients says?\n\n## Our  Clients Are …\n\n#### Lawyers Headshots\n\nview details\n\n#### Lifestyle Portraits\n\nview details\n\n#### Convention Photography\n\nview details\n\n#### White Background\n\nview details\n\n#### Corporate Events\n\nview details\n\n#### Acting Headshot\n\nview details\n\n#### Realtor Headshots\n\nview details\n\n#### Dating Headshots\n\nview details\n\n#### LinkedIn Headshots\n\nview details\n\n#### Doctors Headshots\n\nview details\n\n#### Comedian Headshots\n\nview details\n\nBlog\n\n### Do i need a professional headshots?\n\nMarch 21, 2023\n\nRead Article\n\nBlog\n\n### Fenton Grand Opening Celebration\n\nJune 2, 2022\n\nRead Article\n\n#### Assistant Photographer\n\nErika Hordos\n\n  *   *   * \n\nWhat is HeadShot?\n\nA headshot is a close-up image of a person , with an emphasis on the face .\nMusicians, actors and models frequently need headshots and also other\nprofessionals like realtors and business owners , who  need to put a face to\ntheir business .Headshots can be appear on business cards, online profile,\nsocial media, companies website. .\n\nWhy choose us?\n\nWe are Professional Corporate Headshots Photographers Raleigh NC a team of\nseasoned photographers with many years of experience portraying people.\nProviding quality costumer service and  images , fast turnaround .We are also\navailable on short notice and giving you a quote within an hour.\n\n#### Headshots photographers\n\nCorporate headshot photographers in Raleigh NC , Raleigh NC corporate headshot\nphotographers. Raleigh headshot photography, Raleigh headshot photographers,\nRaleigh NC headshot photographers. Raleigh Corporate Headshot photographers,\nRaleigh headshots, headshot photographers in Raleigh NC, Headshot\nphotographers in Raleigh NC.\n\n##### Raleigh NC headshot photographers\n\nRaleigh NC event photographers, Raleigh NC corporate event photographers,\ncorporate event photographers in Raleigh NC. Headshots in Raleigh, dating\nheadshots in Raleigh NC , dating headshot photographers in Raleigh NC. Raleigh\ndating headshots realtors headshots in Raleigh NC, doctors headshots in\nRaleigh NC,  actors headshots in Raleigh NC. Acting headshots in Raleigh NC,\nactor headshot photographer in Raleigh NC.\n\n##### Headshots photographers Raleigh\n\nHeadshots Raleigh, business headshots, company headshots. Professional\nheadshots, photographer headshot, corporate photography, business portraits,\nbusiness photography, on-location headshots. Office headshots on location,\noffice headshots, Brier Creek photographers, headshot photographers Brier\nCreek, RTP Durham headshot photographers. North Hills Raleigh Headshot\nphotographers, best headshot photographers Raleigh, best headshot\nphotographers Durham, best headshots photographers Apex. Best headshots\nphotographers Cary, best headshot photographers Chapel Hill, affordable\nheadshot photographer, affordable headshot photography. Cost effective\nheadshot photographer.\n\n##### Fast headshot photography Raleigh\n\nERAS medical residency headshots, ERAS headshots, personal branding images.\nModeling portfolios, executive headshots, photographers comes to my location,\nheadshot photographers near Raleigh NC. ERAS Headshot photographers, ERAS\nheadshot photography, ERAS  headshot photographer, ERAS Headshot Photographer\nRaleigh. Business headshots, ERAS Headshot Photographer Durham, Eras Headshot\nPhotographer Chapel Hill.\n\nWHO WE ARE\n\n### We’re A Team of Photographers shooting **Headshots and Corporate** Events.\n\n### _Offering Professional corporate headshots photography on-location and in-\nstudio, business portraits, modeling and acting headshots, image branding._\n\n#### Available on short notice and providing a fast turnaround.\n\nRead More\n\nSERVICES\n\n### Headshot Photography\n\nIn studio or on-location. We’ll  bring our portable studio setup to your\noffice or outdoor location.\n\nLOCATION\n\n#####  **In-Studio**\n\nCome and visit us in our cozy studio space.  \nWe offering on-site proofing, fast 24 hours turnaround and digital download as\nimage delivery.\n\n#####  **Office or Outdoor Location**\n\nWe’ll travel to your office or preferred outdoor location. Bringing our studio\nto you.\n\nSERVICES\n\n### Corporate Event Photography\n\nWe provide professional event coverage with a fast 48 hours turnaround.\n\nProfessional headshots\n\n### **Why professional headshots are important?**\n\nLet's Take a Look!\n\nBranding Photography\n\n### **Why Do I need Branding Photography For My Business?**\n\nFind Out Here\n\nERAS Headshots\n\n### All you need to Know About ERAS Medical Residency Headshots.\n\nImage Dimensions And More\n\nCorporate Events\n\n### Why Hire a Corporate Event Photographer?\n\nPurpose And Rates\n\nRaleigh Corporate Headshots, Raleigh Headshot photographers, Raleigh Headshots\nPhotography , Headshot Photograph, Corporate Headshots, Headshots ,\nProfessional Headshots, Office Headshots, Head Shots, Headshot Photography,\nActor Headshots, Headshots near me, Professional headshots near me, Business\nHeadshots, Model headshots, Professional Portraits, Headshots poses, Headshot\nphotography near me, Headshot photographers near me, professional head shots,\nprofessional business headshots, headshots picture, headshot photo near me,\nprofessional headshots women, business photo shoot, professional portrait\nphotography, outdoor headshots, professional business photo, professional\nphoto for LinkedIn, headshots for work, corporate photography, business\nheadshots near me , business portraits, acting headshots near me, best\nheadshots, fun headshots, creative headshots, outdoor professional headshots,\nprofessional work photos, professional actor headshots, heads shots near me,\ncorporate headshots near me, executive headshots, professional headshot photo,\nheadshot portrait, professional headshots poses, Raleigh photographers,\nheadshot prices, photographer Raleigh NC, professional headshot photographer,\nstudio headshots, headshot cost, best headshot photographers near me,\nprofessional pictures for business, womens business headshots, professional\nheadshots cost, best headshot poses, headshot images, profile headshots,\noffice headshots, corporate portrait, business portrait photography, LinkedIn\nphotographer, real estate headshots near me , cheap headshots near me, best\nheadshot photographers, best professional headshots, professional portraits\nnear me, company headshots, actor headshot photographer, professional headshot\nphotography, headshots at home, business headshots poses, headshot photo\nstudio near me, corporate headshots, corporate headshot photography, heads\nshots for work, executive portraits, LinkedIn headshots near me, taking a\nprofessional headshot, professional pictures for work, professional headshots\nat home, business headshot photographer, business photo headshot, professional\nheadshots for work, nc photographers, professional profile photo, photography\nheadshot, cheap professional headshots near me, headshot photoshoot, corporate\nheadshot pricing, modeling headshots near me, business headshot photography,\nprofessional business portraits, business photography near me, actor headshot\nphotographer near me, great headshots, professional headshots price,\nphotography business near me, business photography near me, photographer\nDurham NC, corporate headshot photographer, take a professional headshot at\nhome, professional portrait photo, headshot studio, headshot prices near me,\nheadshot photography prices, professional business photographer, get a\nprofessional headshot, get headshots, unique headshots, at home headshots, pro\nheadshots, corporate photoshoot, business portrait photographers, professional\ncorporate headshots, best corporate headshots, head shot photographer, head\nshot photography, creative professional headshots, corporate photographer near\nme, professional shot, headshots for acting near me , photo headshots near me\n, headshot portfolio, headshots pro, professional model headshots, get\nprofessional photo taken, professional business headshots near me, b business\nphotoshoot near me, business headshot photography near me, professional\nportrait photography near me, acting headshot photographers near me,\nprofessional LinkedIn photographer, headshot pictures near me, professional\nbusiness photographer near me, on location headshots, professional business\nphotos near me, headshot studio near me, perfect headshot, photographer\nheadshot, headshot online, best business headshot, face shots photography,\nbusiness professional photoshoot, actor head shots, model head shots, taking a\ngood headshot, team headshots, professional real estate headshots, lawyer\nheadshots, headshot website, corporate headshots women, LinkedIn photo shoot,\nbest headshot photographers near me, actors photo shoot, head shot images,\ncorporate photographers , business portraits near me , photographer for\nprofessional headshots, executive photoshoot, business head shot, headshot\nprofessional photo, best poses for headshots, headshot photography poses,\nheadshot photography for actors, model head shots, outdoor business headshots,\nprofessional headshot pictures, headshots for modeling portfolio, headshots\nRaleigh NC, affordable headshots near me, headshots inc, group headshots,\ndigital headshots, professional portrait photographer near me, professional\nportrait studio, people headshots, work portraits, professional acting\nheadshots near me , professional corporate portraits, professional headshots\nRaleigh NC, head shot pictures, photographers near me headshots, local\nheadshot photographers , actor photographer, outdoor corporate headshots, fun\nprofessional headshots, get professional headshots taken, headshot. session,\ncorporate photography near me , the perfect headshot, professional portrait\npictures, good professional headshots, same day headshots, headshot packages,\nactor photography, creative corporate headshots, professional headshot\nphotography near me, headshots for work near me, quick headshots, professional\nheadshots at home, headshot portrait photography , acting photos headshots,\nwomen’s headshots photo, a head shot, actor head shot, professional office\nphotos , images of professional headshots, headshot event, headshot shoot,\nbusiness photos near me, outdoor real estate headshots, corporate heads shot,\nLinkedIn headshot photographer, corporate portrait photographer, get headshots\ntaken, LinkedIn photographer near me, business portrait photographer near me,\nprofessional photographer business portraits, photographer professional\nheadshots , corporate shots, professional looking headshot, best headshot\nphotos, actor. portfolio pictures, acting portfolio photos, real estate\nheadshot photographer, good head shots, group headshot pricing, headshot photo\nprices, executive photography, unique professional headshots, headshots and\nportraits, amazing headshots, cool professional headshots, places to get\nheadshots near me , executive headshots near me, best professional photos,\nhead shots cost, Raleigh headshot photographers, corporate headshots cost,\nprofessional headshot photos near me, headshots near me cheap, LinkedIn photo\nnear me, professional portraits for work, model headshots photographer, book\nheadshots, real estate photography headshots, professional corporate\nphotography, a headshot photo, headshot photographer Raleigh NC, not so\ncorporate headshot , top headshot photographers, photographer for business\nheadshots, professional photo for LinkedIn near me, personal headshot,\naffordable headshots, business headshots pricing, headshot photo modeling,\nbusiness portrait photo, great professional headshots, outdoor business\nportraits, real estate headshots pricing, cheap professional headshots,\nprofessional work photos near me, company portraits, fun corporate headshots,\nheadshot photography Raleigh NC, headshots and portrait photography, local\nphotographers for headshots, real estate headshot photographer near me,\nmarketing headshots, acting portfolio headshots, professional headshot\nphotography, professional head shot photo, professional headshots in Cary NC,\nprofessional headshots online, high quality headshot, business headshot\nphotographers near me, need a professional headshot, professional business\nprofile pictures, business portrait pricing, headshot photography cost, get\nheadshots taken near me , cheap headshot photographers near me, corporate\nheadshot photography near me, commercial headshot photographer, professional\nLinkedIn photographer near me, headshot places near me, LinkedIn profile\nphotographer, professional LinkedIn photo near me , executive headshot\nphotographer, profile picture photographer near me, LinkedIn headshot cost,\nmodeling head shots, acting headshot photography near me, head shots studio,\nwork headshot photo, headshot photography packages, photographer for business\nphotos, creative business headshots, photography head shots, headshots Durham\nNC, professional headshots Durham NC, professional photographer headshots near\nme, head shot pricing, affordable professional headshots, headshots for\nmodeling near me, studio headshot photography, greta headshots, work headshots\nnear me, head shots for modeling, photographer head shots, business pictures\nnear me, headshot services , Raleigh real estate photographer, professional\nheadshots real estate, professional portrait studio near me, LinkedIn\nphotoshoot near me, LinkedIn profile picture photographer, LinkedIn headshot\nphotographer near me, professional business portrait photography, professional\ncorporate photos, corporate business photography, professional business\nheadshots photographer, headshot photo for work, headshot photo cost,\ncorporate headshot photos, professional photography business headshots, best\nexecutive headshots, I need professional headshots, head shots photographer\nnear me, cost of professional headshots, work head shots, headshot photo\nstudio, professional photographer Raleigh NC, heads shot for work,\nprofessional office headshots, headshot portraits near me, head shot\nphotographers near me, professional work photography, website photography near\nme, bets acting headshots, head shot photography near me, good business\nheadshots, headshots for LinkedIn near me, corporate headshots near me ,\nprofessional photography Raleigh NC, same day headshots near me, same day\nprofessional headshots, company headshots pricing, corporate team photography,\nbusiness profile photographer, corporate headshot photography pricing, best\nphotographer for headshots,\n\n#### Lawyers Headshots\n\nview details\n\n#### Environmental Portraits\n\nview details\n\n#### Professional Headshots\n\nview details\n\n#### Attorney At Law Magazine\n\nview details\n\n#### Corporate Headshot\n\nview details\n\n#### Business headshots\n\nview details\n\n#### LinkedIn Headshots\n\nview details\n\n#### Convention Photography\n\nview details\n\n#### White Background\n\nview details\n\n#### Comedian Headshots\n\nview details\n\n#### Realtor Headshots\n\nview details\n\nCorporate headshot photographers in Raleigh NC , Raleigh NC corporate headshot\nphotographers, Raleigh headshot photography. Raleigh headshot photographers,\nRaleigh NC headshot photographers, Raleigh Corporate Headshot photographers,\nRaleigh headshots.\n\nHeadshot photographers in Raleigh NC, Headshot photographers in Raleigh NC,\nRaleigh nc headshot photographers . Raleigh NC event photographers, Raleigh NC\ncorporate event photographers, corporate event photographers in Raleigh NC.\nHeadshots in Raleigh, dating headshots in Raleigh NC , dating headshot\nphotographers in Raleigh NC, Raleigh dating headshots, realtors headshots in\nRaleigh NC.\n\nDoctors headshots in Raleigh NC,  actors headshots in Raleigh NC, acting\nheadshots in Raleigh NC, actor headshot photographer in Raleigh NC. Headshots\nphotographers Raleigh, corporate headshot photographers in Durham NC , Durham\nNC corporate headshot photographers, Durham headshot photography. Durham\nheadshot photographers, Durham NC headshot photographers, Durham Corporate\nHeadshot photographers, Durham headshots, headshot photographers in Durham NC.\n\nHeadshot photographers in Durham NC, Durham NC headshot photographers , Durham\nNC event photographers. Durham NC corporate event photographers, corporate\nevent photographers in Durham NC, headshots in Durham, dating headshots in\nDurham NC .\n\nDating headshot photographers in Durham NC, Durham dating headshots, realtors\nheadshots in Durham NC.  Doctors headshots in Durham NC,  actors headshots in\nDurham NC, acting headshots in Durham NC Actor headshot photographer in Durham\nNC, headshots photographers Durham.\n\nPricing For\n\n## Individual Headshots\n\nOn-location / In-studio\n\n\n\nWebsite• Profile • Social Media• Business • Dating\n\nPricing For\n\n## Corporate Headshots\n\nOn-location\n\n\n\nExecutive portraits • Volume headshots • Groups • Teams\n\nPricing For\n\n## Personal Branding\n\nOn- location\n\n\n\nStylized • Candid like • Captured in the moment\n\nPricing For\n\n## Event Coverage\n\n\n\nMeetings • Coventions • Conferences • Trade shows • Corporate Functions\n\nScheduling\n\n**Scheduling** your **session** made easy through our site. Look for the\n**popup window on the bottom right.** Click on it and you’ll be seeing\nsessions available to book online. Click on the one which fits for your needs\nand now you’ll be able to **choose available dates and times**. **Submit your\ninformation .** After you booked your session the system will send out\nautomatic confirmation email. We’ll review it and getting back to you shortly.\n\nThe Session\n\nYou’ll be able to **choose from** different **background options : white ,\nlight grey, dark grey, black, blue, etc…** And also from different lighting\nscenarios. We’ll be **adjusting your clothing/hair, giving you directions** on\nhow to stand and make you look at your best. **Shooting between 20-150\nimages** depends on the session.\n\nOn-Site Proofing\n\nRight away after the photoshoot **we’ll be showing your pictures on a 27″\nscreen** and **helping you** narrowing down the images and  to **make your\nselection**. Typically **2-8 retouched images**  what we going for **depends\non chosen package.** Add-on retouched images also available.\n\nCropping images\n\n**Each retouched image** will comes cropped in **5 different ways** to make\neasier using them on different social media platforms and business profiles,\nalso in print.We’ll be also including the original image. They are available\nto download in **High Resolution** (for print) and  in **Web version** ( for\nweb use).\n\nReceiving pictures\n\nThe **  Turnaround time** is normally **24 hours** if not stated otherwise at\nthe time of the session. Image processing can be rushed and **Same-Day\nTurnaround** **is also available.** Your pictures will be uploaded to a\n**private online gallery** and access will be sent to you **by email** . That\nwill **includes : link , password and download key**.\n\nView & Download\n\nThe **image gallery** is easily **accessible** by clicking on the **” VIEW\nPHOTOS”**   button In the **notification email** , typing in your **email\naddress and the password** (included in the email).\n\n______________\n\nAs you logged into your gallery on the first page there be a **“Gallery\nAssist”** feature which gives you a **walkthrough how to use the gallery** and\n**download your pictures.  \n**\n\nWhen you went through (or skipped) the walkthrough you’ll see the first\n**gallery** with the cover image and the **menu option** which **includes 3\noptions** :\n\n______________\n\n**WEB**\n\nThese files are **optimized for screen** and social media (downloadable)\n\n___\n\n**High Resolution**\n\nLarge files **optimized for print** (downloadable)\n\n**___  \nAll Images**\n\n This folder includes **all images** and they are only available for viewing\n\n_______________\n\n**Additional retouched files available for order** (at per image price)  by\nmarking them as your favorite in your gallery.\n\n## Thank you for checking out our Blog!\n\nYou can browse trough tips, previous events and updates here.\n\nBlog\n\n### Why hire corporate event photographers?\n\nJune 25, 2023\n\nRead Article\n\nBlog\n\n### Do i need a professional headshots?\n\nMarch 21, 2023\n\nRead Article\n\nBlog\n\n### Fenton Grand Opening Celebration\n\nJune 2, 2022\n\nRead Article\n\nBlog\n\n### South Atlantic Hearing Awards\n\nMarch 12, 2022\n\nRead Article\n\nBlog\n\n### National Thanksgiving Turkey Presentation\n\nNovember 27, 2019\n\nRead Article\n\nBlog\n\n### Earth Day at American Tobacco Campus\n\nApril 22, 2019\n\nRead Article\n\nBlog\n\n### Strategic Visioning Event\n\nFebruary 8, 2019\n\nRead Article\n\nBlog\n\n### Blue Pack Marketing Holiday Party\n\nDecember 9, 2018\n\nRead Article\n\nBlog\n\n### Family Justice Center Community Meeting and Study Tour by InterAct\n\nNovember 27, 2018\n\nRead Article\n\nBlog\n\n### 2018 John Tyler Caldwell Award for the Humanities\n\nOctober 5, 2018\n\nRead Article\n\nBlog\n\n### Remember Who YOU Are with Paula Brown Stafford & Lisa Grimes\n\nMay 23, 2018\n\nRead Article\n\nBlog\n\n### Legal Marketing Association Night at the Bulls by Attorney at Law Magazine\n\nMay 17, 2018\n\nRead Article\n\n###\n\nBlog\n\n### EvolveLaw – Darvin Talks- @ American Underground\n\nSeptember 28, 2017\n\nRead Article\n\nBlog\n\n### NCBA Law Student Networking Reception\n\nJanuary 25, 2018\n\nRead Article\n\nBlog\n\n### Law Offices of James Scott Farrin Celebrates 20 Years @ Angus Barn\nPavilion\n\nSeptember 8, 2017\n\nRead Article\n\nBlog\n\n### Relaxed Portraits\n\nFebruary 21, 2017\n\nRead Article\n\nBlog\n\n### We Appreciate Any Kind Of Feedback\n\nFebruary 6, 2016\n\nRead Article\n\ncorporate headshot photographers in Raleigh NC , Raleigh NC corporate headshot\nphotographers, Raleigh headshot photography, Raleigh headshot photographers,\nRaleigh NC headshot photographers, Raleigh Corporate Headshot photographers,\nRaleigh headshots, headshot photographers in Raleigh NC, Headshot\nphotographers in Raleigh NC, Raleigh nc headshot photographers , Raleigh nc\nevent photographers, raleigh nc corporate event photographers, corporate event\nphotographers in raleigh nc, headshots in Raleigh, dating headshots in Raleigh\nNC , dating headshot photographers in Raleigh NC, Raleigh dating headshots,\nrealtors headshots in Raleigh NC, doctors headshots in Raleigh NC,  actors\nheadshots in Raleigh NC, acting headshots in raleigh nc, actor headshot\nphotographer in Raleigh NC, headshots photographers Raleigh\n\nEasy to schedule\n\n### ” It was so easy to schedule an appointment with Robert!\n\n### His pictures are excellent and you have the opportunity to review them\nimmediately. He offers to play music that will help you feel most comfortable\nwhile the pictures are taken. This is the perfect option if you need current\nheadshots (with a quick turnaround!). “\n\n#### **_– Leslie Mosley_**\n\nHighly recommend\n\n### ” I went to Robert for new professional/headshot photos.\n\n### Robert did a great job in guiding me through the process, providing\nfeedback on shots/angles, and helped me narrow down the selection with his\ntrained eye.\n\n## Highly recommend. “\n\n#### _**-Ethan Floyd**_\n\npunctual, professional\n\n## ” Robert was punctual, professional and positive. Loved working with him.\n\n## He got some great captures of our award ceremony. Turn around time was\nquick too! Would 100% recommend. “\n\n#### **_-Melanie Moore,  North Carolina Humanities Council Development and\nCommunications Associate_**\n\nPatient and Focused\n\n## ” Robert did a great job!\n\n\n\n## _Very patient and focused on getting the best possible picture for me._\n\n\n\n## I highly recommend him!”\n\n### _**-Pete Nealy**_\n\nArtfully Crafted\n\n#### ” I needed a professional headshot quickly and a survey of available\nagencies led me to **Robert with Headshots & Corporate Photography**. I can’t\nbelieve my good fortune.\n\n#### Not only did this company accommodate my rather urgent request and need\nfor quick turnaround, but the quality of the work was extraordinary.\n\n#### **Robert** took much more than the 30 minute “express” time frame I paid\nfor and sat alongside me to go through my proofs meticulously. In truth, even\nbefore retouching, his shots captured a more flattering picture than any I’ve\nhad in the past. It goes without saying that I was even more impressed with\nthe artfully crafted final deliverable.\n\n### It was really such a high quality photo!\n\n#### I most heartedly recommend Headshots & Corporate Photography for all your\nbusiness photo needs. I will always turn to this company first in the future.\n\n#### Professional, personable and price-conscious! What more could you ask\nfor? “\n\n####\n\n#### **_-Deb Stargardt_**\n\nAttention to Detail\n\n#### ” I got some headshots for my LinkedIn profile and for my dating profile\nas well.\n\n## They look incredible!\n\n### _Robert was an absolute pleasure to work with and really went out of his\nway to make sure the photos were nothing but the best, and was extremely\nflexible._\n\n### His passion, professionalism, and attention to detail were phenomenal. “\n\n#### _**-Timothy Sawicki**_\n\nValue beyond expectations\n\n### “Robert was very professional and friendly. I am not photogenic AT ALL and\nyet he kept me relaxed and I really enjoyed the session. I try to update my\nheadshots every 3-5 years and this was by far my best experience. Not only did\nhe capture my personality, he actually delivered value beyond my expectations.\nI highly recommend him!”\n\n#### _**– Connie Cwik**_\n\nExtremely Professional\n\n### “First, let me say that I hate taking photos.\n\n### Robert was very patient and provided good advice to achieve the best\nshots.\n\n### He was extremely professional and the quality of his work is exceptional.\nI highly recommend him!”\n\n#### **_-Sylvia Hackett_**\n\nEasy and Fun\n\n### ” Wow! Robert is awesome!\n\n#### I had a photographer cancel on me last minute and Robert was able to\nsqueeze me in!\n\n### From the very beginning he was amazing.\n\n#### He was very patient during the shoot and gave lots of encouragement, I\nfelt like a model!  The entire process was easy and fun .\n\n### THIS PHOTOGRAPHER WILL NOT DISAPPOINT !! “\n\n#### _**– Carlosha Easton**_\n\nExcellent Service\n\n### ” Great experience!\n\n### Robert is courteous and patient, and has a good eye.\n\n### He helped me to capture a professional headshot that looks good and\nconveys exactly what I needed. Fast delivery and excellent service.”\n\n#### _**-Dauna Bartley**_\n\nProfessionalism Is a Must\n\n## ” Robert is a professional photographer.\n\n#### He chose a setting to match my purpose and took advantage of the\nsurroundings in the shoot. He took multiple angles and gave me many options to\nchoose from. When I chose my favorite, he went the extra mile to touch up and\nenhance it for best presentation.\n\n### _I’m very happy to have been able to work with him on this project._\n\n### **I highly recommend him when professionalism is a must. “**\n\n#### _**– Patrick Yanke**_\n\nAwesome Pictures\n\n## **“Awesome pictures!**\n\n### _Needed headshot photos quickly for new job. Was able to book an\nappointment quickly and easily._\n\n## Had my edited photos back same day and they looked great! “\n\n#### **_-Matthew Lovell_**\n\nHighly Recommend!!\n\n### ” Robert was amazing and immediately made me comfortable even though I\nhate taking pictures.\n\n#### He provided me with a few different cropped pictures that I could use on\nthe Internet and also larger files for printed materials.\n\n### Highly Recommend!! “\n\n#### _**– Leslie Manning**_\n\nEager to Exceed Expectations\n\n## **“Robert was very professional and easy to work with.**\n\n\n\n## _**You can tell he is proud of his work and eager to exceed . He did just\nthat.**_\n\n\n\n### **He gave solid advice on choosing poses and did an excellent job of\ntouching them up so I looked my best.**\n\n##\n\n### _**I would highly recommend him. “**_\n\n##\n\n\n\n#### **_-Jodi Webb_**\n\nMade a Difference\n\n## ” Robert was the best!\n\n### I was looking for professional shots and his technique and suggestions\nreally made a difference.\n\n## I would highly recommend!”\n\n#### _**– Kimberly R. Lane**_\n\nMost Reasonably Priced\n\n## “Robert did a great job for us.\n\n#### **_We needed 3 headshots done. The place I’ve used in the past was\nunavailable due to Covid-19, so I had to shop around._**\n\n### He was the most reasonably priced and I looked at and spoke to no less\nthan 10 other photographers in the area.\n\n#### **_He gave us about 10 shots to choose from that were touched-up and\nready to go._**\n\n### He was very easy to communicate with as well.\n\n##\n\n## I highly recommend Robert.”\n\n\n\n#### **_-Karen Nelson_**\n\nFast, Affordable\n\n### ” Headshots & Corporate Photography did a great job on the attorney\nheadshots we had done for our law firm.\n\n## _They were fast, affordable and the quality was good._\n\n## I would recommend.”\n\n#### _**– Andrea Meredith**_  | _Director of Business Development and\nMarketing_  \nMarcari• Russotto • Spencer • Balaban\n\nFlexible and Fun\n\n## ” Rest assured that your pictures will exceed your expectations.\n\n## _Robert is flexible and fun to work with, and is very responsive and\ncreates Beautiful high-quality photos quickly”_\n\n\n\n#### **_-Todd Redding_**\n\nPatient and Knowledgeable\n\n### ” Robert is patient and knowledgeable about his craft.\n\n## **_He provided me with a beautiful photos that I can’t wait to display._**\n\n### **I highly recommend his services”**\n\n#### _**– Kenisha Herbin**_\n\nProfessional and Responsive\n\n### “Robert did a wonderful job with my professional headshots.\n\n#### I was looking for someone who could match the style of the rest of the\ncompany’s headshots which is difficult since we are based out of state. He was\nable to take the background of their photos and put my picture there. He also\nprovided a ton of professional guidance on which photos/poses/smiles to use\nfor headshots.\n\n### _He is very patient, professional, and responsive and I look forward to\nworking with him again.”_\n\n\n\n#### **_-Tracy Bennett_**\n\nextremely pleased\n\n## “Robert is great.\n\n### _I am extremely pleased with his professionalism and the quality of the\npictures provided._\n\n## Definitely recommend!”\n\n####\n\n#### _**– Dania Hall**_\n\neasy to work with\n\n### “Robert was so easy to work with and very professional.\n\n## Highly recommend!”\n\n#### **_-Ashley Henderson_**\n\npatient and kind\n\n### “I took my real estate pictures with Robert and he was just amazing!\n\n### _From making sure my hair was perfect to taking lint off my blazer!_\n\n## **He was so patient and kind!**\n\n### _He also sure knows all the secrets to make you look your best in the\npictures.”_\n\n####\n\n#### _**– Jazmine Lizardo**_\n\nvery professional\n\n### “Robert did a great job getting the best headshot for my website.\n\n## **He was very professional.**\n\n### _I really liked his technic for getting the best shots!”_\n\n#### **_-David Carlson_**\n\npatient, creative\n\n## “ _Robert did a great job with my work related headshots._\n\n### He was patient, creative ensuring the pictures were professional and met\nrequirements.\n\n## **I will highly recommend him!”**\n\n####\n\n#### _**– Rashmi Upasani**_\n\nexceptional customer service\n\n## “Robert provided exceptional customer service!\n\n### My head shots are beautiful.  \n_I highly recommend his services for your photography needs, you will not be\ndisappointed._\n\n### I am looking forward to scheduling my next photo shoot in the near\nfuture.”\n\n#### **_-Talbatha Myatt_**\n\nwonderful, quick and professional\n\n### “Usually, I do not take pictures because they never meet my expectations.\n\n## Robert is wonderful, quick and professional. He made the session fun. The\nfinal pictures are GREAT!\n\n## _I will definitely use him in the future. “_\n\n####\n\n#### _**– Tabatha Alston**_\n\nvery responsive\n\n## “Highly recommend Robert!!\n\n### Scheduling and communication couldn’t be easier.\n\n#### _Robert is professional, kind, and very responsive. He made me feel\ncomfortable and helped make sure my poses were just right for the perfect\nshot._\n\n### Photo edits and delivery were perfect!  \n_I’m very happy with my headshots!”_\n\n#### **_-Heather Dunn_**\n\nquality service\n\n### “Robert delivered quality service to me ** _  \n_**_and went beyond his formal capacity as a professional photographer and\nimmediately became a friend who gave invaluable advice and inputs to the great\noutcome of my photos._\n\n## I am a delighted customer!”\n\n####\n\n#### _**– Philip Kaikai**_\n\npictures are amazing\n\n## “Robert was excellent to work with.\n\n### _I am not a fan of having my picture taken but he made the experience very\ncomfortable plus the pictures are amazing!_\n\n###\n\n#### The work he did for me was for work but I will be making another\nappointment in the Spring for a personal on-location session!”\n\n#### **_-Lisa Blake_**\n\nFlawless headshots in less than 7 hours\n\n### “Robert exceeded my expectations!\n\n#### _If you are looking for an exceptional, no- nonsense professional – he\nthe one. He sets realistic expectations and works well under time\nconstraints._\n\n### He is one of the best, he turned around flawless headshots (from shoot,\nediting, to inbox) in less than 7 hours.”\n\n####\n\n#### _**– Caridad Tapia**_\n\nRobert knows his profession!!\n\n### ” Robert knows his profession!!\n\n##### _I contacted him via his website – he immediately responded and we had\nquotes/dates set up for our sessions. He is meticulous on how you stand,\nsmile, adjusting your clothing, hair, etc. I felt at ease that our photos –\nindividual and group shots were going to be the best!! He traveled to\nCharlotte for photos and here in Raleigh – all turned out GREAT!! We chose our\nphotos on site and then he went back to complete touch-up editing and sent the\nfinal photos to me within a few days._\n\n### I would recommend Robert’s services to EVERYONE!!  \n_Thanks for all your work! “_\n\n#### **_-Tiffani Bylow_**\n\nProfessional, courteous\n\n### “Robert took my headshots in 2019.  \nThey were perfect!\n\n#### I had another session onsite with him this year to update my headshots.\nHe is professional, courteous, and guides you through all the takes to get the\nbest shots.\n\n### _His pictures are amazing. I feel like a model when I look at them._\n\n### **I would recommend him to anyone looking for a professional\nphotographer.”**\n\n#### _**– Dany Guerendo Christian    **_\n\nGreat finished product!\n\n## ” Robert does great work!\n\n### _Truly a professional and works with you to get a great finished product!_\n\n## If you don’t believe me, check my profile picture.”\n\n#### **_-Matt Rush_**\n\nHigh quality, touched up photos\n\n## “I had headshots taken here with Robert.\n\n### _I appreciated the professional and straightforward session._\n\n#### He gave very specific, detailed advice on positioning, having a confident\nand natural expression, etc.\n\n### Turnaround time was also faster than I expected with high quality, touched\nup photos.”\n\n#### _**– Junette Yu**_\n\nProfessional, helpful and prompt.\n\n## ” Robert did a fantastic job with my headshots!\n\n### _He’s very professional, helpful and prompt.  \n_\n\n## I highly recommend him.“\n\n#### **_-Jenna Dunay_**\n\nPhotos looked so great\n\n##\n\n## “All the photos looked so great it was hard to choose just 6!\n\n## _Thanks so much again.”_\n\n#### _**– Ashley Nielsen**_\n\nI am beyond thrilled\n\n## “I am beyond thrilled with his photography talent and follow thru.\n\n## _Trust his guidance,_\n\n### he is an experienced professional that will make you look like a star in\nthe final product!\n\n#### **_-Michael Grant_**\n\nwhole process was very efficient\n\n##\n\n###\n\n### “The whole process was very efficient and the headshots came out\nfantastic.\n\n## Robert is very polite and knows what he’s doing.\n\n### _I will definitely be going back to him whenever I need some new headshots\ndone!”_\n\n#### _**– Rachel Nosacka**_\n\nQuick turnaround\n\n### “These turned out awesome.\n\n## Thank you so much for the quality of work and quick turnaround.\n\n**_-Cassie Shrock_**\n\noutstanding experiences\n\n##\n\n###\n\n## Robert is very good at what he does and at a very reasonable price.\n\n### _I have gotten my headshots taken by him on three separate occasions and\nthey were all outstanding experiences._\n\n## I love the headshots I received!\n\n#### _**– Taylan Johnson**_\n\nProfessional, efficient\n\n## Great experience!\n\n### _Professional, efficient, attention to detail and gave a direction to\ncreate the best photos!_\n\n## Highly recommended!\n\n#### _**-Lenee Tarver**_\n\nhighly skilled\n\n##\n\n## Robert was an absolute delight to work with!\n\n### Great guy and undoubtedly a highly skilled photographer.\n\n### _I was blown away by the quality of his setup, as well as his insights as\nto what made one “look good” on camera._\n\n#### Will definitely be reaching out to Robert if I need any more photography\nservices in the future!\n\n#### _**– Michael Murray**_\n\ninnovative and professional\n\n### “I was looking for an innovative and professional Raleigh headshot\nphotographer and I found him in Robert.\n\n## **_Not only did he capture my ideas and vision, he helped me bring them to\nlife._**\n\n### I am thrilled with my headshots!”\n\n#### _**-Cynthia Barnes**_\n\n### Call or text!\n\n(919) 671-2609\n\n## Have a question?\n\n##\n\n## _Book a free consultation!_\n\n####\n\n##\n\n#### Acting Headshot\n\nview details\n\n#### Corporate Headshots\n\nview details\n\ncorporate headshots photographers in Raleigh NC , Raleigh NC corporate\nheadshot photographers, Raleigh headshot photography, Raleigh Corporate\nheadshot photographers, Raleigh headshot photographers, Raleigh NC headshot\nphotographers, Raleigh headshots, headshot photographers in Raleigh NC,\nHeadshot photographers in Raleigh NC, Raleigh NC headshot photographers ,\nRaleigh nc event photographers, Raleigh NC corporate event photographers,\ncorporate event photographers in Raleigh NC, headshots in Raleigh, dating\nheadshots in Raleigh NC , dating headshot photographers in Raleigh NC,\nrealtors headshots in Raleigh NC, doctors headshots in Raleigh NC,  actors\nheadshots in Raleigh NC, acting headshots in Raleigh NC, actor headshot\nphotographer in Raleigh NC, corporate headshot photographers in Durham NC\n,Durham NC corporate headshot photographers, Durham headshot photography,\nDurham headshot photographers, Durham NC headshot photographers, Durham\nCorporate Headshot photographers, Durham headshots, headshot photographers in\nDurham NC, Headshot photographers in Durham NC, Durham NC headshot\nphotographers , Durham NC event photographers, Durham NC corporate event\nphotographers, corporate event photographers in Durham NC, headshots in\nDurham, dating headshots in Durham NC , dating headshot photographers in\nDurham NC, Durham dating headshots, realtors headshots in Durham NC, doctors\nheadshots in Durham NC,  actors headshots in Durham NC, acting headshots in\nDurham NC, actor headshot photographer in Durham NC, headshots photographers\nDurham, business headshots, company headshots, professional headshots,\nphotographer headshot, corporate photography, business portraits, business\nphotography, ERAS medical residency headshots, ERAS headshots, ERAS headshot\nphotographers Raleigh, Raleigh ERAS photographers, personal branding images,\nmodeling portfolios, Branding photography Raleigh NC, business headshot\nphotographers, Acting headshot photographers, professional photography,\nheadshots, modeling portfolios, business photography, corporate photographer,\nexecutive headshot photographers, commercial photographer, personal branding,\nbusiness headshots, executive portraits, photographer, photographer near me,\nRaleigh headshot photographers,  headshot photographer near me, headshot\nphotography near me, business photography near me, business photographer near\nme, corporate photographer near me, corporate photography near me, commercial\nphotography near me, commercial photographer near me, same day headshot\nphotography, professional photography near me, professional photographer near\nme, head-shots, corporate head-shots\n\n  *   *   *   * \n\nProfessional Corporate Headshot Photographers serving Raleigh, Durham, Cary,\nGarner, Apex, Morrisville, Chapel Hill ,Wake Forest and surrounding areas in\nNorth Carolina.\n\n_9523 Vira Dr. Raleigh NC 27617 · (919) 671-2609 ·\ninfo@HeadshotsAndCorporate.com_\n\n_© 2024 HeadShots & Corporate Photography. All Rights Reserved._\n\nSchedule\n\nGet this FREE widget\n\nWelcome!\n\nThanks for stopping by! To see options, availability and to schedule your\nsession please click here! If you have any question please click on the\nCONTACT US button or CLICK-TO-CALL! Looking forward to hear from you!!\n\nSchedule\n\nPowered by vcita\n\nMy Account\n\nSchedule nowContact usClick-to-call 919-671-...\n\nMore\n\nMake a payment Send us a fileGet Directions\n\n",
    "links": "[{\"link\": \"https://www.headshotsandcorporate.com/blog/branding-photography-for-your-business-is-important/\", \"text\": \"\"}, {\"link\": \"https://www.headshotsandcorporate.com/portfolio/professional-headshots/\", \"text\": \"\"}, {\"link\": \"https://www.headshotsandcorporate.com/#reviews\", \"text\": \"\"}, {\"link\": \"https://www.headshotsandcorporate.com/portfolio/corporate-headshots-raleigh/\", \"text\": \"\"}, {\"link\": \"https://www.headshotsandcorporate.com/portfolio/attorney-at-law-magazine/\", \"text\": \"\"}, {\"link\": \"https://www.headshotsandcorporate.com/portfolio/environmental-portraits/\", \"text\": \"\"}, {\"link\": \"https://www.headshotsandcorporate.com/portfolio/environmental-portraits/\", \"text\": \"\"}, {\"link\": \"https://www.headshotsandcorporate.com/raleigh-corporate-headshot-photography-pricing/\", \"text\": \"\"}, {\"link\": \"https://www.headshotsandcorporate.com/corporate-event-photographer-raleigh-nc/\", \"text\": \"\"}, {\"link\": \"https://www.headshotsandcorporate.com/#pricing\", \"text\": \"\"}, {\"link\": \"https://www.headshotsandcorporate.com/reviews\", \"text\": \"\"}, {\"link\": \"https://www.headshotsandcorporate.com/portfolio/lawyers-headshots/\", \"text\": \"\"}, {\"link\": \"https://www.headshotsandcorporate.com/portfolio/lifestyle-portraits/\", \"text\": \"\"}, {\"link\": \"https://www.headshotsandcorporate.com/portfolio/convention-photographers-raleigh/\", \"text\": \"\"}, {\"link\": \"https://www.headshotsandcorporate.com/portfolio/headshot-photographers-raleigh-nc/\", \"text\": \"\"}, {\"link\": \"https://www.headshotsandcorporate.com/portfolio/corporate-event-photographers/\", \"text\": \"\"}, {\"link\": \"https://www.headshotsandcorporate.com/portfolio/acting-headshot-photographer-raleigh/\", \"text\": \"\"}, {\"link\": \"https://www.headshotsandcorporate.com/portfolio/realtor-headshots-raleigh-nc/\", \"text\": \"\"}, {\"link\": \"https://www.headshotsandcorporate.com/portfolio/dating-headshots/\", \"text\": \"\"}, {\"link\": \"https://www.headshotsandcorporate.com/portfolio/linkedin-photographers-raleigh/\", \"text\": \"\"}, {\"link\": \"https://www.headshotsandcorporate.com/portfolio/doctors-headshots/\", \"text\": \"\"}, {\"link\": \"https://www.headshotsandcorporate.com/portfolio/comedian-headshots/\", \"text\": \"\"}, {\"link\": \"https://www.headshotsandcorporate.com/do-i-need-a-professional-headshots/\", \"text\": \"Do i need a professional headshots?\"}, {\"link\": \"https://www.headshotsandcorporate.com/do-i-need-a-professional-headshots/\", \"text\": \"Read Article\"}, {\"link\": \"https://www.headshotsandcorporate.com/fenton-grand-opening-celebration/\", \"text\": \"Fenton Grand Opening Celebration\"}, {\"link\": \"https://www.headshotsandcorporate.com/fenton-grand-opening-celebration/\", \"text\": \"Read Article\"}, {\"link\": \"https://www.headshotsandcorporate.com/do-i-need-a-professional-headshots/\", \"text\": \"\"}, {\"link\": \"https://www.headshotsandcorporate.com/do-i-need-a-professional-headshots/\", \"text\": \"\"}, {\"link\": \"https://www.headshotsandcorporate.com/blog/branding-photography-for-your-business-is-important/\", \"text\": \"\"}, {\"link\": \"https://www.headshotsandcorporate.com/blog/branding-photography-for-your-business-is-important/\", \"text\": \"\"}, {\"link\": \"https://www.headshotsandcorporate.com/eras-medical-residency-headshots/\", \"text\": \"\"}, {\"link\": \"https://www.headshotsandcorporate.com/eras-medical-residency-headshots/\", \"text\": \"\"}, {\"link\": \"https://www.headshotsandcorporate.com/why-hire-corporate-event-photographers/\", \"text\": \"\"}, {\"link\": \"https://www.headshotsandcorporate.com/why-hire-corporate-event-photographers/\", \"text\": \"\"}, {\"link\": \"https://www.headshotsandcorporate.com/portfolio/lawyers-headshots/\", \"text\": \"\"}, {\"link\": \"https://www.headshotsandcorporate.com/portfolio/environmental-portraits/\", \"text\": \"\"}, {\"link\": \"https://www.headshotsandcorporate.com/portfolio/professional-headshots/\", \"text\": \"\"}, {\"link\": \"https://www.headshotsandcorporate.com/portfolio/attorney-at-law-magazine/\", \"text\": \"\"}, {\"link\": \"https://www.headshotsandcorporate.com/portfolio/raleigh-corporate-headshot-photographers/\", \"text\": \"\"}, {\"link\": \"https://www.headshotsandcorporate.com/portfolio/business-headshots-photographers-raleigh/\", \"text\": \"\"}, {\"link\": \"https://www.headshotsandcorporate.com/portfolio/linkedin-photographers-raleigh/\", \"text\": \"\"}, {\"link\": \"https://www.headshotsandcorporate.com/portfolio/convention-photographers-raleigh/\", \"text\": \"\"}, {\"link\": \"https://www.headshotsandcorporate.com/portfolio/headshot-photographers-raleigh-nc/\", \"text\": \"\"}, {\"link\": \"https://www.headshotsandcorporate.com/portfolio/comedian-headshots/\", \"text\": \"\"}, {\"link\": \"https://www.headshotsandcorporate.com/portfolio/realtor-headshots-raleigh-nc/\", \"text\": \"\"}, {\"link\": \"https://www.headshotsandcorporate.com/individual-headshots-photography-pricing/\", \"text\": \"\"}, {\"link\": \"https://www.headshotsandcorporate.com/raleigh-corporate-headshot-photography-pricing/\", \"text\": \"\"}, {\"link\": \"https://www.headshotsandcorporate.com/lifestyle-portraits-photography-pricing/\", \"text\": \"\"}, {\"link\": \"https://www.headshotsandcorporate.com/event-photography-pricing/\", \"text\": \"\"}, {\"link\": \"https://www.headshotsandcorporate.com/why-hire-corporate-event-photographers/\", \"text\": \"Why hire corporate event photographers?\"}, {\"link\": \"https://www.headshotsandcorporate.com/why-hire-corporate-event-photographers/\", \"text\": \"Read Article\"}, {\"link\": \"https://www.headshotsandcorporate.com/do-i-need-a-professional-headshots/\", \"text\": \"Do i need a professional headshots?\"}, {\"link\": \"https://www.headshotsandcorporate.com/do-i-need-a-professional-headshots/\", \"text\": \"Read Article\"}, {\"link\": \"https://www.headshotsandcorporate.com/fenton-grand-opening-celebration/\", \"text\": \"Fenton Grand Opening Celebration\"}, {\"link\": \"https://www.headshotsandcorporate.com/fenton-grand-opening-celebration/\", \"text\": \"Read Article\"}, {\"link\": \"https://www.headshotsandcorporate.com/south-atlantic-hearing-awards/\", \"text\": \"South Atlantic Hearing Awards\"}, {\"link\": \"https://www.headshotsandcorporate.com/south-atlantic-hearing-awards/\", \"text\": \"Read Article\"}, {\"link\": \"https://www.headshotsandcorporate.com/national-thanksgiving-turkey-presentation-2019/\", \"text\": \"National Thanksgiving Turkey Presentation\"}, {\"link\": \"https://www.headshotsandcorporate.com/national-thanksgiving-turkey-presentation-2019/\", \"text\": \"Read Article\"}, {\"link\": \"https://www.headshotsandcorporate.com/earth-day-at-american-tobacco-campus/\", \"text\": \"Earth Day at American Tobacco Campus\"}, {\"link\": \"https://www.headshotsandcorporate.com/earth-day-at-american-tobacco-campus/\", \"text\": \"Read Article\"}, {\"link\": \"https://www.headshotsandcorporate.com/strategic-visioning/\", \"text\": \"Strategic Visioning Event\"}, {\"link\": \"https://www.headshotsandcorporate.com/strategic-visioning/\", \"text\": \"Read Article\"}, {\"link\": \"https://www.headshotsandcorporate.com/blue-pack-marketing-holiday-party/\", \"text\": \"Blue Pack Marketing Holiday Party\"}, {\"link\": \"https://www.headshotsandcorporate.com/blue-pack-marketing-holiday-party/\", \"text\": \"Read Article\"}, {\"link\": \"https://www.headshotsandcorporate.com/family-justice-center-community-meeting-and-study-tour-by-interact/\", \"text\": \"Family Justice Center Community Meeting and Study Tour by InterAct\"}, {\"link\": \"https://www.headshotsandcorporate.com/family-justice-center-community-meeting-and-study-tour-by-interact/\", \"text\": \"Read Article\"}, {\"link\": \"https://www.headshotsandcorporate.com/2018-john-tyler-caldwell-award-for-the-humanities/\", \"text\": \"2018 John Tyler Caldwell Award for the Humanities\"}, {\"link\": \"https://www.headshotsandcorporate.com/2018-john-tyler-caldwell-award-for-the-humanities/\", \"text\": \"Read Article\"}, {\"link\": \"https://www.headshotsandcorporate.com/remember-who-you-are-with-paula-brown-stafford-lisa-grimes/\", \"text\": \"Remember Who YOU Are with Paula Brown Stafford & Lisa Grimes\"}, {\"link\": \"https://www.headshotsandcorporate.com/remember-who-you-are-with-paula-brown-stafford-lisa-grimes/\", \"text\": \"Read Article\"}, {\"link\": \"https://www.headshotsandcorporate.com/legal-marketing-association-night-at-the-bulls/\", \"text\": \"Legal Marketing Association Night at the Bulls by Attorney at Law Magazine\"}, {\"link\": \"https://www.headshotsandcorporate.com/legal-marketing-association-night-at-the-bulls/\", \"text\": \"Read Article\"}, {\"link\": \"https://www.headshotsandcorporate.com/evolvelaw-darvin-talks-american-underground/\", \"text\": \"EvolveLaw – Darvin Talks- @ American Underground\"}, {\"link\": \"https://www.headshotsandcorporate.com/evolvelaw-darvin-talks-american-underground/\", \"text\": \"Read Article\"}, {\"link\": \"https://www.headshotsandcorporate.com/ncba-law-student-networking-reception/\", \"text\": \"NCBA Law Student Networking Reception\"}, {\"link\": \"https://www.headshotsandcorporate.com/ncba-law-student-networking-reception/\", \"text\": \"Read Article\"}, {\"link\": \"https://www.headshotsandcorporate.com/jsf20yearscelebration/\", \"text\": \"Law Offices of James Scott Farrin Celebrates 20 Years @ Angus Barn Pavilion\"}, {\"link\": \"https://www.headshotsandcorporate.com/jsf20yearscelebration/\", \"text\": \"Read Article\"}, {\"link\": \"https://www.headshotsandcorporate.com/relaxed-portraits/\", \"text\": \"Relaxed Portraits\"}, {\"link\": \"https://www.headshotsandcorporate.com/relaxed-portraits/\", \"text\": \"Read Article\"}, {\"link\": \"https://www.headshotsandcorporate.com/we-appreciate-any-kind-of-feedback/\", \"text\": \"We Appreciate Any Kind Of Feedback\"}, {\"link\": \"https://www.headshotsandcorporate.com/we-appreciate-any-kind-of-feedback/\", \"text\": \"Read Article\"}, {\"link\": \"https://www.headshotsandcorporate.com/contact-form-2/\", \"text\": \"\"}, {\"link\": \"https://www.headshotsandcorporate.com/appointment-booking-2/\", \"text\": \"\"}, {\"link\": \"https://www.headshotsandcorporate.com/portfolio/acting-headshot-photographer-raleigh/\", \"text\": \"\"}, {\"link\": \"https://www.headshotsandcorporate.com/portfolio/corporate-headshots-raleigh/\", \"text\": \"\"}, {\"link\": \"https://www.headshotsandcorporate.com/portfolio/realtor-headshots-raleigh-nc/\", \"text\": \"realtors headshots\"}, {\"link\": \"https://www.headshotsandcorporate.com/portfolio/dating-headshots/\", \"text\": \"dating headshots\"}, {\"link\": \"https://www.headshotsandcorporate.com/blog/branding-photography-for-your-business-is-important/\", \"text\": \"Branding photography\"}]"
}