{
    "summary": "Skip to content\n\nLimited Time Offer! Save up to **50% Off** annual plans.* View Plans\n\n **Save up to 50%** **Now**.* View Plans\n\nSolutions New\n\n  * Online Portfolio\n\nEasy, robust, professionally designed portfolio website.\n\n  *   * Workflow \n\nRun your photography business  \nlike a pro.\n\n  *   * Selling New\n\nExpand your brand and sell more.\n\n  *   * Image Storage New\n\nCloud image storage for your  \ncreative work.\n\n  *   * Website Building Service New\n\nFree website design  \nfor Pro Plus members.\n\nMade For\n\n  * Photography \n\n  *   * Art\n\n  *   * Design & Illustration\n\n  *   * Architecture \n\n  *   * Fashion \n\n  *   * Film \n\n  *   * Others \n\nTemplates Pricing Magazine\n\nOnline Portfolio Workflow  Prints Marketplace New Photo Storage New Website\nBuilding Service New Templates Pricing >Made For\n\nPhotography Art Design & Illustration Architecture Fashion Film Other\n\nFormat Magazine Customers Help & Support\n\nLog In Manage Site Get Started\n\n  * How-to\n  * Guide\n\nOnline Portfolio Website>Corporate Photography>Guide\n\n# How to Become a Corporate Business Photographer\n\n## What is Corporate Photography?\n\nHaving high quality visuals is a must for just about every business today.\nEven businesses that don’t have a large online presence use photos to promote\nthemselves. That’s why corporate photography is such an important niche within\nphotography: it’s an essential component of helping businesses represent\nthemselves in the world.\n\nAlso sometimes referred to as  _business photography_, corporate photography\nhelps businesses create a positive perception of themselves and their\noperations. Despite the fact that the word “corporate” evokes large,\nmultinational organizations, corporate photography can be used by any business\nranging from a small sole proprietorship of one to the biggest corporations in\nthe world.\n\nThe subject matter of corporate photography is usually the people involved in\nthe businesses, scenes of a typical day within the business, office interiors,\nbuilding exteriors, products, or events and conferences attended by the\nbusiness.\n\nCorporate photographers can get creative with how they go about capturing this\nsubject matter. While it typically has a crisp, polished look, it doesn’t have\nto look corny or staged like the stock photo images that the term  _corporate\nphotography_  may bring to mind.\n\nThis type of imagery helps a business to establish trust in the world.\nCustomers like to get a sense of who they are supporting or what kind of\nbusiness they’re engaging with, and seeing corporate photography reinforces a\nbusiness’ public image. It can also convey any other kind of value that the\nbusiness wants to project.\n\nFor example, if a design studio wants to convey that they’re a highly creative\norganization, they can hire a commercial photographer to capture their team\nengaged in a creative activity. If an auto body shop wants to convey that\nthey’re trustworthy experts in their trade they can do so with the right kind\nof corporate photography.\n\nRead More\n\nTable of Contents\n\n  * What is Corporate Photography?\n  * Types of Corporate Photography\n  * Getting Started in Business Photography\n  * Getting Started in Business Photography\n  * Tips on Services Offerings and Pricing Aspects of Your Corporate Photography Services\n  * Corporate Photography Is Full of Potential\n  * What Are Some Examples Of Corporate Photography?\n  * How Do You Price Your Corporate Photography Services?\n\nUnlike wedding photography, corporate business photography tends to get\nunnoticed. While corporate spaces of fluorescent lights and around conference\ntables aren’t the most appealing, there are still lots of opportunities for\nphotographers in this niche. From events to corporate headshots, corporate\nphotography can still be challenging and versatile.\n\nWhether you’re already doing photography or looking to start a photography\nbusiness, here’s how you can get started in corporate business photography and\nan overview of the processes involved in approaching and formalizing your\nprofessional relationship with businesses, as well as advice on services to\noffer and how to price them.\n\n## What is Corporate Photography?\n\nCorporate photography can sometimes get confused with commercial photography,\nand while there may sometimes be an overlap in the types of images created\nit’s worth going over what makes corporate photography distinct.\n\nBoth corporate photography and commercial types of photography, such as\nadvertising photography, ultimately involve working with brands and businesses\nto help them grow. However, commercial photography is more geared towards\nselling products, while corporate photography is intended to support a\ncompany’s overall image. A corporate photographer might also have some\ncommercial photographs in their portfolio if it makes sense for their\nparticular target market.\n\nFor example, IKEA may hire a photographer to take a corporate photograph of\none of their furniture designers examining a prototype of her latest furniture\npiece. That image might be used in a story about how IKEA works with a wide\nrange of designers, each with their own design ethos and area of\nspecialization. Then, they may hire a commercial photographer to shoot the\nactual finished piece, and that image could be used on a billboard or in their\ncatalog.\n\nWhile the first image is used for marketing the business by giving viewers a\npeek into the inner workings of the brand and the process that results in them\nselling their products, the primary function of the second image is to sell a\nproduct. You can think of corporate photography as supporting a brand’s public\nrelations efforts, while commercial or advertising photography supports its\nsales and marketing efforts.\n\nCorporate photography can range from straightforward portraits and headshots\nof key people in a business to more highly produced, staged images that may\nrequire a whole team to execute. Between the broad range of potential clients\nand the many different types of images that can be created under the umbrella\nof corporate photography, this is a great, in-demand field of photography to\npursue professionally.\n\n## Types of Corporate Photography\n\nWhile corporate photography might bring to mind an image of a CEO in a suit,\nthere’s a lot more to it than that. Here are the different types of\nphotography that fall under the corporate umbrella.\n\n### Traditional Corporate Portraiture\n\nThe traditional portrait will always be an important part of corporate\nphotography. It’s used on everything from “About Us” pages on company websites\nto profiles of the business, so just about every business benefits from having\nsome high quality portraits of the people who make up its organization.\n\nIt’s worth noting that traditional doesn’t necessarily have to mean formal or\nultra-professional. It all depends on the business that the corporate photos\nare being taken for. If it’s an insurance brokerage, then portraits of the\nemployees in professional suits may be appropriate. For a tech company, the\nlook might be more casual and relaxed.\n\nThe “traditional” aspect of these portraits refers to the framing,\n_composition_, and setting. The portraits may be full-body or be more closely\ncropped, but they always include at least the subject’s head and shoulders.\nThe background is usually unobstructive, such as a neutral or colored seamless\nor a wall.\n\n### Editorial Portraiture\n\nEditorial portraiture, also sometimes called environmental portraiture, takes\nelements of the traditional portrait but also incorporates a meaningful\nsetting. In these types of portraits, the subject is in a context that tells\nsome kind of a story about who they are, their role within the business, or\nabout the business itself.\n\nConsider a portrait of a corporate chef. If they’re shot smiling against a\nblack background, that would be a traditional portrait. If, instead, the\nphotographer captures them in their kitchen or even in the act of cooking,\nthat would be an editorial or environmental portrait. This type of image may\nbe used on a company website or even in a magazine features about a business.\n\nEditorial portraiture tends to involve a bit more creativity and planning than\ntraditional portraiture, because both the photographer and the subject have to\nconsider what story they want to tell with the portrait and choose an\nappropriate environment for the portrait based on that. These portraits are\ntypically posed, but can also be candid.\n\n### Corporate Headshot Photography\n\n _Headshots_ are distinct from portraits in their composition. While portraits\ninclude the head and shoulders, and can include the full body, headshots only\ninclude the subject’s face. While corporate portraits are more common than\ncorporate headshots, there are some instances where a business may want you to\nshoot headshots.\n\nHeadshots are often used by people who work in entertainment, such as actors\nand singers. A professional theater company is an example of a type of\nbusiness that would hire a corporate photographer to shoot headshots.\n\n### Corporate Event Photography\n\nCorporate events include trade shows, conferences, and celebratory events such\nas galas. Shooting corporate events involves capturing details such as the\ndecor and location, getting shots of any key moments such as speeches and\npresentation, and most importantly getting images of the attendees.\n\nWith this kind of _event photography_ it’s important for the photographer to\nbe able to shoot discreetly so that people aren’t distracted by being in front\nof a camera. The idea is to capture candid images of people enjoying the\nevent, without disrupting the event itself. It’s often helpful to be able to\nmingle a bit with the guests, since this puts people more at ease and makes\nfor better images.\n\n### Brand Event Photography\n\nFrom small startups to large multinational corporations, businesses have\nembraced the concept of the pop-up in recent years. This is a subset of\ncorporate event photography, but it’s worth mentioning it on its own because\nthe focus for the photographer can be a little bit different than standard\nevent photography. With pop-ups or brand activations, the goal of the event is\noften to market a new product or introduce new customers to a brand. Your\nclient may have invested in creating a photogenic, branded space, so it’s\nimportant to capture these elements, as well as any products being marketed.\n\nIf guests are gifted a product or encouraged to use it, your goal as a brand\nevent photographer should be to capture them engaging with the product.\n\n### Corporate Product and Service Photography\n\nCorporate product or service photography aims to capture a company’s product\nor them offering their services, but typically in a more editorial style than\ncommercial photographs that are meant to sell the product. This is a subtle\ndistinction, and the line between corporate and commercial photography can be\na bit blurry.Let’s go back to the example of a head chef of a high end\nrestaurant. A corporate product and service photography might show him plating\none of his creations. In this case, the product is being showcased, but it’s\nalso serving the function of a corporate portrait. This type of image would\nlikely be used to tell a story about the restaurant or to promote the image\nthat they want to project to their customers. A commercial _food photograph_\nmight be a more heavily styled image of the dish, made to look as mouth\nwatering as possible, and used in social media ads to drive more visitors to\nthe restaurant.\n\n### Corporate Architectural Photography\n\nBusinesses often share their workplace with the public through images that may\nbe used online, in brochures, or in magazines. Corporate photographers can put\ntheir _architectural photography_ skills to use by capturing the workplace. If\na business wants to share something unique about it’s facilities, such as new\nequipment or an impressive production line, a corporate photographer might\nalso be asked to shoot that.\n\n### How To Get Started In Corporate Photography\n\nThe most important tool for getting paid gigs as a corporate photographer is\nyour online portfolio. Your corporate photography portfolio website is a place\nfor potential clients to see what kind of work you do, what specific style you\ntend to have, and what other clients have trusted you to shoot corporate\nphotographs for them.\n\nA strong portfolio not only shows what you’re capable of as a photographer, it\nalso shows that you’re professional and serious enough about your business to\nhave a beautiful, easy to navigate online home for it. Often, your portfolio\nwill also be how potential clients find out how to get in touch with you and\nother details they may want to know before hiring you, such as where you’re\nlocated.\n\nThe importance of your portfolio suggests one thing: to get started in\ncorporate photography, it’s key to build up a portfolio you can be proud of.\nSure, there is a lot of work to be done even after you have your portfolio\nready to go. You still need to cold-call potential clients and market your\nbusiness. However, without a portfolio, you’re not likely to get those gigs.\n\nSo, how can you go about creating that portfolio? You can study photography in\nschool, or go the DIY route and build up your skills and catalog of images\nyourself. Both options have their benefits and drawbacks, and the right choice\nwill depend on the particulars of your situation.\n\n### Studying Corporate Photography\n\nWhile there isn’t such a thing as a dedicated corporate photography degree,\nthe skills you learn in any photography degree at an art school are sure to\nhelp you become a better corporate photographer.\n\nOne of the unique aspects of corporate photography is the fact that it\ninvolves a little bit of everything. As you can tell from the different types\nof corporate photography we discussed, it helps to have portrait photography\nskills, product photography skills, and event photography skills. You’ll\nsometimes be shooting in a controlled studio environment, indoors in all kinds\nof lighting, or outdoors. This means that having as much experience as\npossible shooting different subjects in these different scenarios will make\nyou a better corporate photographer.\n\nBy formally studying photography, you’ll have the chance to get this much\nneeded practice. You’ll be challenged to create all different kinds of\ncompositions and to get familiar with different shooting scenarios. Plus, the\nschool environment creates some pressure that many people find beneficial. It\ncan be difficult to motivate yourself to keep shooting consistently without\nthe encouragement of peers and the motivation from wanting to do well in your\ncourses.\n\nHowever, photography programs can be expensive, and not everyone wants to\nspend four years studying before entering the professional world. You may also\nhave a lot of experience shooting, and some courses may be redundant for you.\nIf that’s the case, you can always consider taking one-off courses to\nstrengthen skills in particular areas where you feel you could improve.\n\n### Becoming A Self-Taught Corporate Photographer\n\nIf going to school for photography doesn’t appeal to you or is out of your\nprice range, you can absolutely still become a professional corporate\nphotographer. Remember, your most important asset is your portfolio, so if you\nwant to establish yourself in your field without going to school, your main\ngoal should be to create portfolio-worthy images.\n\nAs any photographer will tell you, even if you are formally studying\nphotography you won’t improve without practice. Whether you’re in school or\ngoing the DIY route, challenging yourself to keep shooting and to challenge\nyourself with new image styles and concepts is how you will become the best\ncorporate photographer you can be.\n\nTo create images for your portfolio, a good way to start out before you have\nestablished yourself is to offer your services for free to some local\nbusinesses that are similar to the types of clients you’d like to book some\nday. Most businesses will be happy to accept the offer and get some fresh\nimages for free, and you’ll have the chance to create real corporate photos\nfor your portfolio.\n\n### Developing Your Style\n\nWhether you’re building your portfolio while at school or as a self-taught\nphotographer, it’s a good idea to focus on developing a style or look that can\nbe associated with you. Portfolios that have a wide range of image styles can\nbe confusing for potential clients.\n\nFor example, if a client wants a moody, cinematic corporate portrait, they’re\nmore likely to hire you if your whole portfolio leans in that direction than\nif you have one or two images that have this style while the rest look\ncompletely different. In the first case, they’ll _know_ you can reliably\ncreate that look, rather than dabbling in it.\n\nYour portfolio will also be more memorable if it can be succinctly described\nwith a few adjectives. While it may be tempting to have a bunch of different\nstyles in your portfolio, it’s more beneficial for your career to develop a\nsignature style and _curate your portfolio_ to showcase it.\n\n### Marketing Your Business\n\nWith your portfolio website created, it’s time to start marketing your\nbusiness. Staying active on social media is a good way to potentially land on\nyour target customers feed without having to spend money, and sometimes\ncontacting clients directly on Instagram can be a good way to book gigs. With\nsocial media its good to build up a bit of a relationship with the brands you\nwant to work with before hitting them with the “so do you want to work\ntogether?” question. Engage with their content and let them see you’re\ninterested in their work. Brands like to know that you can be an advocate for\ntheir brand.\n\nAs a corporate photographer, LinkedIn is an important social network that you\nshould definitely be using to _market your business_. Your corporate clients\nare more likely to be active there than on any other social network.\n\nCold-emailing can also be effective, but make sure you’re including something\nmemorable and worthwhile in your emails. Rather than just linking to your\nportfolio website, including something like a limited time offer can encourage\npotential clients to follow up with you.\n\n## Getting Started in Business Photography\n\n## Getting Started in Business Photography\n\nBusinesses want to make it easy for themselves to promote their efforts, so\nwhen it comes to working with vendors, they favor structure and process.\nStructure adds an element of predictability to the working relationship and\nits outcome. As a result, a corporate photographer can use the following\napproach to make sure the project is successful and help build credibility in\ndealing with the business owner or potential client.\n\nWhile every photographer’s process looks different, here are some basic steps\nto the process:\n\n  * Create a relationship\n\n  * Align on needs\n\n  * Sign a contract\n\n  * Scout the location\n\nEstablishing your own process and communicating it to the client early on\nhelps establish your credibility as a corporate photographer and protects you\nin case the client decides to change direction.\n\n### 1\\. Create a Relationship\n\nThe first phase of securing a job is to establish a relationship with your\nprospective client. Your prospective client will expect to see a photography\nportfolio they can evaluate against the type of corporate photography they\nhave in mind. As a result, having an online portfolio that represents your\ncreative style accurately is important. Online portfolio platforms like Format\nallow a high degree of customization without the need for coding so you can\nfocus more on your craft.\n\nYour clients will likely reach out to you through your online portfolio\nwebsite based on your work, or through a referral. Keeping email communication\nprofessional with your clients is crucial to earning trust and progressing on\ncommunicating about the client’s needs. In addition, consider creating\nbusiness cards for interacting with potential clients for the first time.\n\n### 2\\. Align on Project Needs\n\nIn this next stage of the process, professional communication is still\ncrucial, but this is where clarity of communication begins to matter more than\nbefore. Your job as a corporate photographer is to understand exactly what the\nclient needs. In order to get there, you will need to make sure to ask them\nabout the specifics of the project they have in mind. Consider asking them\nquestions such as:\n\n  1. What or who are you looking to photograph?\n\n  2. How many photos are you looking to capture?\n\n  3. Can you share examples of the type of photographs you’re looking to get out of this project?\n\n  4. When are you looking to have the project completed by?\n\n  5. How will the photos be used – in digital and/or print formats?\n\nWhile asking the client questions may feel awkward at the early stages of your\nprofessional relationship, it’s important to your long-term success. After\nall, how else can you be sure that the type of work you are able to deliver\nwithin their timeline matches client expectations?\n\n### 3\\. Sign a Contract\n\nAt this stage in the process, you should feel confident about the type of\nproject the client has in mind, in addition to the specifications of the\nproject (for instance, if you need to supply RGB and CMYK versions of the\nfiles for digital and print extensions of the project). At this point, it’s\nimportant to capture the project parameters in a single document, also called\na contract, and to make sure both parties sign it before proceeding.\n\nYou can learn more about writing your freelance contract in this guide, but\ngenerally, contracts need to include at a minimum:\n\n  * A detailed description of the work to be done\n\n  * A timeline for completion with milestones at certain points along the way\n\n  * Payment details that include: how much you’ll be paid, the method of payment, and when payment is due\n\nIt may feel intimidating to send formal contact, keep in mind that\naccountability is mutually beneficial for both parties in this exchange. As\nthe project progresses, the contact gives you a reference to what you set out\nto do, associated timelines, and output.\n\nIn a legal sense, the contact is also one document that’s essential for the\nphotographer in case it comes to needing to pursue delinquent clients in the\ncase of non-payment.\n\n### 4\\. Scout the Location\n\nBetween signing the contract and before the date you are assigned to conduct\nthe shoot, one important to do is to visit the location where you will be\nshooting. Scouting the location gives you greater control over variables on\nthe day of the shoot. Like other genres including food photography and wedding\nphotography, business photography calls for prep work to ensure its ultimate\nsuccess.\n\nThe one most valuable piece of information that scouting the location provides\nthe photographer with is the lighting conditions of the environment. Make sure\nto visit the space in the timeframe you are expected to shoot. Multiple trips\nmay be needed if you expect to shoot over different times over a number of\ndays. While this may seem laborious, the effort is ultimately worth it because\nwhat you don’t want is to be caught without the proper lighting tools on the\nday of your shoot.\n\nUnderstanding and having control of your lighting conditions are extremely\nimportant. This is because clients often expect individual photographs to look\ncohesive in circulation as they are used for promotional purposes after the\nproject’s completion.\n\nBuild a corporate photography portfolio\n\nTake your corporate photography business to the next level with a professional\nonline portfolio website.\n\nGet Started\n\n## Tips on Services Offerings and Pricing Aspects of Your Corporate\nPhotography Services\n\nMany clients begin the conversation around fees by inquiring about a ‘day\nrate,’ as a means to gauge your price range without getting into the details\nof the shoot requirements. It’s easy to get into the habit of using this\noutdated term that misrepresents the work that goes into corporate\nphotography, but learning alternatives is key to successfully communicating\nwith clients.\n\n### Why Using ‘Day Rate’ Is Dangerous\n\nThe term ‘day rate’ is an outdated relic from the times corporate\nphotographers worked with physical film they would send off to developers.\nWhile people may use this term out of familiarity, it’s important to\ncommunicate to them that the amount of work quired is much broader; before,\nduring, and even after the shoot.\n\nFor this reason, some photographers include a “pre-production” fee in their\nestimates that includes communication with the client, location scouting,\ntravel, and other factors. They may also include a “post-production fee” that\nincludes editing, time spent communicating with the client, and final product\npackaging and delivery.\n\nNo matter what language you choose, it is important to communicate the breadth\nof the work required for the project in your pricing breakdown.\n\nThere are two other terms you can include in your estimates that cover a range\nof activities the day of the shoot – and in the days and weeks following. They\nare creative fees and photography fees.\n\n### The Role of a Creative Fee in Your Estimate\n\nA creative fee is a combination of your photography fee (the lump sum you\ncharge for your time in a day – your ‘day rate,’ for all intents and purposes)\nand the licensing fee into one. Your licensing fee, also known as the\ncommercial usage fee, is the royalty you as a photographer receives for the\ncompany using your images. While some companies don’t want to have to worry\nabout contacting you and paying you every time they use your photos in a new\ncontext, it’s up to you to negotiate a happy medium that gets you compensated\nfor your work without putting a strain on your professional relationship with\nthe business.\n\n### The Role of a Photography Fee in Your Estimate\n\nOn the other hand, a photography fee refers to only the time it takes to have\nthe photographer onsite and capturing the images. It is often an hourly rate\nmultiplied by 4 or 8 hours depending on whether the client expects you to be\nonsite for the entirety of the day, or a fraction of it.\n\nWhen communicating with people about pricing, you may want to consider asking\nwhat budget they have in mind. Businesses often have annually approved\nmarketing budgets that may or may not have wiggle room, and gaining an\nunderstanding of the number you are working with can help you reverse-engineer\nhow many hours you can put toward the project that work within your profit\nmargins.\n\n## Corporate Photography Is Full of Potential\n\nThis type of photography is arguably one of the most underappreciated\nspecializations there are. It is a unique branch of portraiture that captures\npeople and objects in a business environment. Communicating with people with\nclarity as a professional photographer is a key ingredient in ensuring\nsuccess. Now that you have familiarized yourself with this guide, you are\nready to get started.\n\n## What Are Some Examples Of Corporate Photography?\n\nBrowsing through real _corporate photography online portfolios_ from\nphotographers working in the field is one of the best ways to get a better\nunderstanding of what corporate photography actually looks like. It’s also an\neffective way to get inspired, because each corporate photographer develops\ntheir own style or approach over time. Here are some of our favorites.\n\n###  _Kricket Kirkpatrick_\n\nAlabama-based Kricket Kirkpatrick’s portfolio should quickly dispel any idea\nyou may have about corporate photography having to be stuffy and boring. This\nportfolio is all about bringing the stories of businesses and entrepreneurs to\nlife. From super creative compositions to artful, almost cinematic lighting,\nthe images here would appear to any contemporary business wanting to get\nnoticed.\n\nFormat theme used: _Mica_\n\n###  _Euan Anderson_\n\nA major subset of corporate photography is corporate portraiture. Showcasing\nthe people behind the brand is something most businesses like to do, because\nit makes them more approachable. Swedish photographer Euan Anderson shows that\nthe corporate portrait can definitely be a place to show some personality and\nself expression. While some industries may still favor standard professional\nportraits, many have now opened up to the benefits of showing that the people\nat their company are not just stuffed shirts. This portfolio includes\nportraits that range from brooding to playful, with lots of variation in\nbetween.\n\nFormat theme used: _Peak_\n\n###  _Josh Fee_\n\nJosh Fee of Toronto-based, Portmanteau Media focuses on events, and this\nportfolio showcases the value of high-quality corporate event photography.\nThese photos give businesses an opportunity to get ongoing benefit from an\nevent long after it’s over, by repurposing the images and content it\ngenerated. With the increased popularity of brand activations and pop up\nevents in recent years, there’s no shortage of opportunities for corporate\nphotographers who want to focus on shooting events.\n\n## How Do You Price Your Corporate Photography Services?\n\nIf you’re thinking of pursuing a career in corporate photography, you’ll be\nglad to know it has one of the highest average annual salaries for\nphotographers at just _over $75,000_ in the US.\n\nThis may be because corporate photography really is a valuable investment for\nbusinesses of all kinds. In a world where the ability to start a business has\nbeen democratized, there is also more competition for existing businesses.\n\nThis means that having high quality corporate images can help a business stand\nout, establish themselves as trustworthy, and create a personal connection\nwith their customers. These are things that are worth investing in for any\nbusiness. By forfeiting high quality corporate images, a business can do\nthemselves a disservice in the long run by projecting a less professional\nimage to their customers.\n\nWhen it comes to how exactly you go about _pricing your corporate\nphotography_, the amount you charge per gig will vary based on a few important\nfactors:\n\n  1. Your location. If you are primarily taking on clients in your geographic location, this will have an impact on how much you can charge. A corporate photographer in Paris will be able to charge more than a corporate photographer in a small town. If you’re open to traveling for work, it may be worthwhile if the clients you can book are significantly higher paying in a different area.\n\n  2. The type of clients you work with. A large corporate client like Boeing will be able to pay far more for new corporate photos than your local bakery. If you can book those large corporate clients, you can likely charge many thousands of dollars per gig, depending on the specifics of the job. For a smaller client, you may be charging $500, but the shoot may also be much less involved. You can still earn a good salary with those small clients, but you’ll have to book many more gigs throughout the year.\n\n  3. Image licensing. It’s typical for corporate photographers to charge more to license an image to a large client because the image will be viewed many more times. Licensing for something like magazine publishing rights will also cost more than if they were to just use the image on their website. Understanding how your client plans to use the corporate images you take can help you charge accordingly.\n\n  4. Your skills and experience. You may not command top dollar when you’re just starting out (but if you can, we’re all for it!), but once you have more experience and more paying clients to your name, you should be able to justify higher rates.\n\n  5. The scope of the job. Taking a few photos of a company’s CEO at their desk is fairly quick; taking photos of their complete facility along with all of their key employees is a much bigger job. If a gig involves multiple locations and multiple subjects, you can charge more than you would for something like a standard portrait session.\n\nHowever you decide to structure your corporate photography rates, it’s\nimportant to communicate to your customers that the images are an investment\nin their business. High quality images are a must in today’s image-forward\nonline world, and portraying an unprofessional image can really hurt a\nbusiness’s bottom line in the long run.\n\nAs a corporate photographer, you play a key role in helping a business\ncommunicate their value and their story to the world. Your images are an asset\nto your corporate clients, and it’s okay to let them know that and to stick to\nyour expectations around pricing, as long as they are fair and realistic.\n\n **Complete Guides to Get Started with Any Type of Photography and\nProfession**\n\n  * Food Photography Guide\n  * Music Photography Guide\n  * Portrait Photography Guide\n  * Product Photography Guide\n  * Real Estate Photography Guide\n  * Student Portfolio Guide\n  * Wedding Photography Guide\n  * Graphic Design Portfolio Guide\n  * Architecture Guide\n  * Landscape Photography Guide\n  * Digital Artist Portfolio Guide\n  * Fashion Design Guide\n  * Illustrator Portfolio Guide\n  * Interior Design Guide\n  * Makeup Artist Guide\n  * Modeling Guide\n  * Tattoo Artist Portfolio Guide\n  * UX UI Designer Portfolio Guide\n  * Videography Portfolio Guide\n  * Web Design Portfolio Guide\n  * Artist Portfolio Guide\n  * Boudoir Photography Guide\n  * Still Life Photography Guide\n  * Black and White Photography Guide\n  * Family Photography Guide\n  * Wildlife Photography Guide\n  * Editorial Photography Guide\n  * Travel Photography Guide\n  * Lifestyle Photography Guide\n  * Sports Photography Guide\n  * Documentary Photography Guide\n  * Event Photography Guide\n\nCreate my online portfolio website\n\nCreate a custom corporate photography portfolio with Format.\n\nBuild My Website\n\nReady to get started?\n\nShowcase your corporate photography work with a professional online portfolio\nwebsite.\n\nGet Started\n\nStart Your Free Trial\n\n  * Facebook\n  * X\n  * Instagram\n\n  * Format\n  * Website\n  * Workflow\n  * Online Portfolio Website\n  * Templates\n  * Client Galleries\n  * Online Store\n  * Pricing\n  * Customers\n  * Educational Outreach\n\n  * Portfolio Websites\n  * Photographers\n  * Designers\n  * Artists\n  * Interior Designers\n  * Fashion Designers\n  * Models\n  * Architects\n  * Music\n  * Video\n  * Students\n\n  * Format Magazine\n  * Features\n  * Galleries\n  * Resources\n  * Video\n\n  * Company\n  * About\n  * Careers\n  * Press & Media\n  * Affiliates\n  * Legal\n  * Accessibility\n  * Help\n  * Site Status\n\n  * Privacy\n  * Legal\n  * Accessibility\n\n© 2024 Ideaform Inc., All Rights Reserved.\n\n*Offer must be redeemed by February 29, 2024 at 11:59 p.m. PST. 50% discount off the subscription price of a new annual Pro Plus plan can be applied at checkout with code PROPLUSANNUAL, 38% discount off the price of a new annual Pro plan can be applied with code PROANNUAL, and 20% discount off the price of a new Basic annual plan can be applied with code BASICANNUAL. The discount applies to the first year only. Cannot be combined with any other promotion.\n\nEN\n\nFR  ES  EN\n\nThis website uses cookies for analytics and personalization. By continuing to\nbrowse, you agree to our Cookie Policy\n\nAccept\n\nClose GDPR Cookie Settings\n\n  * Privacy Overview\n  * Strictly Necessary Cookies\n\nPowered by  GDPR Cookie Compliance\n\nPrivacy Overview\n\nThis website uses cookies so that we can provide you with the best user\nexperience possible. Cookie information is stored in your browser and performs\nfunctions such as recognising you when you return to our website and helping\nour team to understand which sections of the website you find most interesting\nand useful.\n\nStrictly Necessary Cookies\n\nStrictly Necessary Cookie should be enabled at all times so that we can save\nyour preferences for cookie settings.\n\nEnable or Disable Cookies\n\nIf you disable this cookie, we will not be able to save your preferences. This\nmeans that every time you visit this website you will need to enable or\ndisable cookies again.\n\nEnable All Save Settings\n\n",
    "links": "[{\"link\": \"https://www.format.com/pricing-portfolio\", \"text\": \"View Plans\"}, {\"link\": \"https://www.format.com/pricing-portfolio\", \"text\": \"View Plans\"}, {\"link\": \"https://www.format.com/website\", \"text\": \"\"}, {\"link\": \"https://www.format.com/workflow-photography-studio-management\", \"text\": \"\"}, {\"link\": \"https://www.format.com/selling\", \"text\": \"\"}, {\"link\": \"https://www.format.com/photo-storage\", \"text\": \"\"}, {\"link\": \"https://www.format.com/hire-a-format-expert-to-build-your-new-portfolio\", \"text\": \"\"}, {\"link\": \"https://www.format.com/professions/photography\", \"text\": \"\"}, {\"link\": \"https://www.format.com/professions/art\", \"text\": \"\"}, {\"link\": \"https://www.format.com/professions/design\", \"text\": \"\"}, {\"link\": \"https://www.format.com/professions/architecture\", \"text\": \"\"}, {\"link\": \"https://www.format.com/professions/fashion\", \"text\": \"\"}, {\"link\": \"https://www.format.com/professions/film\", \"text\": \"\"}, {\"link\": \"https://www.format.com/portfolio-website\", \"text\": \"\"}, {\"link\": \"https://www.format.com/website-templates\", \"text\": \"Templates\"}, {\"link\": \"https://www.format.com/pricing-portfolio\", \"text\": \"Pricing\"}, {\"link\": \"https://www.format.com/magazine/\", \"text\": \"Magazine\"}, {\"link\": \"https://www.format.com/website\", \"text\": \"Online Portfolio\"}, {\"link\": \"https://www.format.com/workflow-photography-studio-management\", \"text\": \" Workflow \"}, {\"link\": \"https://www.format.com/prints-marketplace\", \"text\": \"\"}, {\"link\": \"https://www.format.com/photo-storage\", \"text\": \"\"}, {\"link\": \"https://www.format.com/hire-a-format-expert-to-build-your-new-portfolio\", \"text\": \"\"}, {\"link\": \"https://www.format.com/website-templates\", \"text\": \"Templates\"}, {\"link\": \"https://www.format.com/pricing-portfolio\", \"text\": \"Pricing\"}, {\"link\": \"https://www.format.com/professions/photography\", \"text\": \"Photography\"}, {\"link\": \"https://www.format.com/professions/art\", \"text\": \"Art\"}, {\"link\": \"https://www.format.com/professions/design\", \"text\": \"Design & Illustration\"}, {\"link\": \"https://www.format.com/professions/architecture\", \"text\": \"Architecture\"}, {\"link\": \"https://www.format.com/professions/fashion\", \"text\": \"Fashion\"}, {\"link\": \"https://www.format.com/professions/film\", \"text\": \"Film\"}, {\"link\": \"https://www.format.com/portfolio-website\", \"text\": \"Other\"}, {\"link\": \"https://www.format.com/magazine/\", \"text\": \"Format Magazine\"}, {\"link\": \"https://www.format.com/customers\", \"text\": \"Customers\"}, {\"link\": \"https://www.format.com/login\", \"text\": \"Log In\"}, {\"link\": \"https://www.format.com/site/dashboard\", \"text\": \"\"}, {\"link\": \"https://www.format.com/try\", \"text\": \"\"}, {\"link\": \"https://www.format.com/online-portfolio-website/corporate-photography/guide\", \"text\": \"Guide\"}, {\"link\": \"https://www.format.com/online-portfolio-website\", \"text\": \"Online Portfolio Website\"}, {\"link\": \"https://www.format.com/online-portfolio-website/corporate-photography/guide\", \"text\": \"Guide\"}, {\"link\": \"https://www.format.com/online-portfolio-website/corporate-photography/guide\", \"text\": \"business photography\"}, {\"link\": \"https://www.format.com/online-portfolio-website/corporate-photography\", \"text\": \"corporate photography\"}, {\"link\": \"https://www.format.com/magazine/resources/photography/photo-composition\", \"text\": \"composition\"}, {\"link\": \"https://www.format.com/magazine/resources/photography/headshot-photography\", \"text\": \"Headshots\"}, {\"link\": \"https://www.format.com/magazine/resources/photography/event-photography-guide\", \"text\": \"event photography\"}, {\"link\": \"https://www.format.com/magazine/galleries/photography/best-food-photographers-2020\", \"text\": \"food photograph\"}, {\"link\": \"https://www.format.com/magazine/resources/photography/architecture-photography\", \"text\": \"architectural photography\"}, {\"link\": \"https://www.format.com/magazine/resources/art/how-to-choose-portfolio-images\", \"text\": \"curate your portfolio\"}, {\"link\": \"https://www.format.com/magazine/resources/photography/social-media-marketing-secrets-get-more-clients\", \"text\": \"market your business\"}, {\"link\": \"https://www.format.com/online-portfolio-website/photography\", \"text\": \"photography portfolio\"}, {\"link\": \"https://www.format.com/online-portfolio-website\", \"text\": \"online portfolio\"}, {\"link\": \"https://www.format.com/magazine/resources/photography/how-to-write-a-contract-freelance-guide\", \"text\": \" this guide\"}, {\"link\": \"https://www.format.com/portfolio-website\", \"text\": \"online portfolio website\"}, {\"link\": \"https://www.format.com/try\", \"text\": \"Get Started\"}, {\"link\": \"https://www.format.com/online-portfolio-website/corporate-photography\", \"text\": \"corporate photography online portfolios\"}, {\"link\": \"https://www.format.com/magazine/resources/photography/commercial-photography-pricing\", \"text\": \"pricing your corporate photography\"}, {\"link\": \"https://www.format.com/online-portfolio-website/food-photography/guide\", \"text\": \"Food Photography Guide\"}, {\"link\": \"https://www.format.com/online-portfolio-website/music/guide\", \"text\": \"Music Photography Guide\"}, {\"link\": \"https://www.format.com/online-portfolio-website/portrait-photography/guide\", \"text\": \"Portrait Photography Guide\"}, {\"link\": \"https://www.format.com/online-portfolio-website/product-photography/guide\", \"text\": \"Product Photography Guide\"}, {\"link\": \"https://www.format.com/online-portfolio-website/real-estate-photography/guide\", \"text\": \"Real Estate Photography Guide\"}, {\"link\": \"https://www.format.com/online-portfolio-website/student/guide\", \"text\": \"Student Portfolio Guide\"}, {\"link\": \"https://www.format.com/online-portfolio-website/wedding-photography/guide\", \"text\": \"Wedding Photography Guide\"}, {\"link\": \"https://www.format.com/online-portfolio-website/graphic-design/guide\", \"text\": \"Graphic Design Portfolio Guide\"}, {\"link\": \"https://www.format.com/online-portfolio-website/architecture/guide\", \"text\": \"Architecture Guide\"}, {\"link\": \"https://www.format.com/online-portfolio-website/landscape-photography/guide\", \"text\": \"Landscape Photography Guide\"}, {\"link\": \"https://www.format.com/online-portfolio-website/digital-artist/guide\", \"text\": \"Digital Artist Portfolio Guide\"}, {\"link\": \"https://www.format.com/online-portfolio-website/fashion-design/guide\", \"text\": \"Fashion Design Guide\"}, {\"link\": \"https://www.format.com/online-portfolio-website/illustrator/guide\", \"text\": \"Illustrator Portfolio Guide\"}, {\"link\": \"https://www.format.com/online-portfolio-website/interior-design/guide\", \"text\": \"Interior Design Guide\"}, {\"link\": \"https://www.format.com/online-portfolio-website/makeup-artist/guide\", \"text\": \"Makeup Artist Guide\"}, {\"link\": \"https://www.format.com/online-portfolio-website/model/guide\", \"text\": \"Modeling Guide\"}, {\"link\": \"https://www.format.com/online-portfolio-website/tattoo-artist/guide\", \"text\": \"Tattoo Artist Portfolio Guide\"}, {\"link\": \"https://www.format.com/online-portfolio-website/ux-ui-design/guide\", \"text\": \"UX UI Designer Portfolio Guide\"}, {\"link\": \"https://www.format.com/online-portfolio-website/video/guide\", \"text\": \"Videography Portfolio Guide\"}, {\"link\": \"https://www.format.com/online-portfolio-website/web-design/guide\", \"text\": \"Web Design Portfolio Guide\"}, {\"link\": \"https://www.format.com/online-portfolio-website/artist/guide\", \"text\": \"Artist Portfolio Guide\"}, {\"link\": \"https://www.format.com/online-portfolio-website/boudoir-photography/guide\", \"text\": \"Boudoir Photography Guide\"}, {\"link\": \"https://www.format.com/online-portfolio-website/still-life-photography/guide\", \"text\": \"Still Life Photography Guide\"}, {\"link\": \"https://www.format.com/online-portfolio-website/black-and-white-photography/guide\", \"text\": \"Black and White Photography Guide\"}, {\"link\": \"https://www.format.com/online-portfolio-website/family-photography/guide\", \"text\": \"Family Photography Guide\"}, {\"link\": \"https://www.format.com/online-portfolio-website/wildlife-photography/guide\", \"text\": \"Wildlife Photography Guide\"}, {\"link\": \"https://www.format.com/online-portfolio-website/editorial-photography/guide\", \"text\": \"Editorial Photography Guide\"}, {\"link\": \"https://www.format.com/online-portfolio-website/travel-photography/guide\", \"text\": \"Travel Photography Guide\"}, {\"link\": \"https://www.format.com/online-portfolio-website/lifestyle-photography/guide\", \"text\": \"Lifestyle Photography Guide\"}, {\"link\": \"https://www.format.com/online-portfolio-website/sports-photography/guide\", \"text\": \"Sports Photography Guide\"}, {\"link\": \"https://www.format.com/online-portfolio-website/documentary-photography/guide\", \"text\": \"Documentary Photography Guide\"}, {\"link\": \"https://www.format.com/online-portfolio-website/event-photography/guide\", \"text\": \"Event Photography Guide\"}, {\"link\": \"https://www.format.com/try\", \"text\": \"\"}, {\"link\": \"https://www.format.com/try\", \"text\": \"\"}, {\"link\": \"https://www.format.com/try\", \"text\": \"Start Your Free Trial\"}, {\"link\": \"https://www.format.com/\", \"text\": \"\"}, {\"link\": \"https://www.format.com/website\", \"text\": \"Website\"}, {\"link\": \"https://www.format.com/workflow-photography-studio-management\", \"text\": \"Workflow\"}, {\"link\": \"https://www.format.com/online-portfolio-website\", \"text\": \"Online Portfolio Website\"}, {\"link\": \"https://www.format.com/website-templates\", \"text\": \"Templates\"}, {\"link\": \"https://www.format.com/client-gallery\", \"text\": \"Client Galleries\"}, {\"link\": \"https://www.format.com/website#store\", \"text\": \"Online Store\"}, {\"link\": \"https://www.format.com/pricing-portfolio\", \"text\": \"Pricing\"}, {\"link\": \"https://www.format.com/customers\", \"text\": \"Customers\"}, {\"link\": \"https://www.format.com/education\", \"text\": \"Educational Outreach\"}, {\"link\": \"https://www.format.com/portfolio-website\", \"text\": \"Portfolio Websites\"}, {\"link\": \"https://www.format.com/online-portfolio-website/photography\", \"text\": \"Photographers\"}, {\"link\": \"https://www.format.com/online-portfolio-website/design\", \"text\": \"Designers\"}, {\"link\": \"https://www.format.com/online-portfolio-website/artist\", \"text\": \"Artists\"}, {\"link\": \"https://www.format.com/online-portfolio-website/interior-design\", \"text\": \"Interior Designers\"}, {\"link\": \"https://www.format.com/online-portfolio-website/fashion-design\", \"text\": \"Fashion Designers\"}, {\"link\": \"https://www.format.com/online-portfolio-website/model\", \"text\": \"Models\"}, {\"link\": \"https://www.format.com/online-portfolio-website/architecture\", \"text\": \"Architects\"}, {\"link\": \"https://www.format.com/online-portfolio-website/music\", \"text\": \"Music\"}, {\"link\": \"https://www.format.com/online-portfolio-website/video\", \"text\": \"Video\"}, {\"link\": \"https://www.format.com/online-portfolio-website/student\", \"text\": \"Students\"}, {\"link\": \"https://www.format.com/magazine/features\", \"text\": \"Features\"}, {\"link\": \"https://www.format.com/magazine/galleries\", \"text\": \"Galleries\"}, {\"link\": \"https://www.format.com/magazine/resources\", \"text\": \"Resources\"}, {\"link\": \"https://www.format.com/magazine/video\", \"text\": \"Video\"}, {\"link\": \"https://www.format.com/about\", \"text\": \"About\"}, {\"link\": \"https://www.format.com/jobs\", \"text\": \"Careers\"}, {\"link\": \"https://www.format.com/press\", \"text\": \"Press & Media\"}, {\"link\": \"https://www.format.com/affiliates\", \"text\": \"Affiliates\"}, {\"link\": \"https://www.format.com/legal\", \"text\": \"Legal\"}, {\"link\": \"https://www.format.com/accessibility\", \"text\": \"Accessibility\"}, {\"link\": \"https://www.format.com/privacy_policy\", \"text\": \"Privacy\"}, {\"link\": \"https://www.format.com/legal\", \"text\": \"Legal\"}, {\"link\": \"https://www.format.com/accessibility\", \"text\": \"Accessibility\"}]"
}