{
    "summary": "Skip to content\n\n**AW SHUCKS OYSTER BAR       BIG SHUCKS OYSTER BAR     BLUE GOOSE CANTINA**\n\n**AW SHUCKS OYSTER BAR  **\n\n**BIG SHUCKS OYSTER BAR**\n\n**BLUE GOOSE CANTINA**\n\n## ABOUT US\n\nPeterson Management Group is a family-owned and operated restaurant management\ncompany with 12 restaurants located across North Texas. Founded by Bob\nPeterson and Scott Holyfield, two guys with larger-than-life personalities, it\nall started in 1983 with eclectic seafood shack restaurants, Aw Shucks and Big\nShucks Oyster Bar. They are the best places in North Texas to get raw oysters,\nshrimp, catfish, crab legs, po’boy boy sandwiches, a nice cold beer, and some\ntasty crawfish when in season.\n\nIn addition to Aw Shucks and Big Shucks, Peterson Management Group opened Blue\nGoose Cantina in 1984, where fantastic made-from-scratch Mexican food,\nlegendary cocktails, top-notch service, a fun atmosphere and a kick-ass\nattitude come together. The restaurant chain has repeatedly been voted the\nbest in North Texas for its winning combination of food, fun, and signature\nmargaritas. Today, Nick Peterson, son of Bob, leads the family business,\nserving as its CEO.\n\n## EST.1983\n\nSince 1983, Aw Shucks and Big Shucks Oyster Bars have been the best places in\nNorth Texas to get raw oysters, shrimp, catfish, crab legs, po’boy boy\nsandwiches, a nice cold beer, and some tasty crawfish when in season. With its\neclectic seafood shack atmosphere, guests are guaranteed to have the best\nshuckin’ time. A division of Peterson Management Group, a family-owned and\noperated restaurant management company, there are five locations in North\nTexas. For more information on Aw Shucks and Big Shucks, visit\nawshucksdallas.com. Follow us on Facebook and Instagram for the latest news\nand promotions. #shucksdallas\n\nVisit the Website\n\n## SINCE 1984\n\nEstablished in 1984, Blue Goose Cantina brings together fantastic made-from-\nscratch Mexican food, legendary cocktails, top-notch service, a fun\natmosphere, and a kick-ass attitude. A division of Peterson Management Group,\na family-owned and operated restaurant management company, Blue Goose\ncurrently has seven North Texas locations with an additional location opening\nin early 2023. For more information, including menu and locations, visit\nBlueGooseCantina.com. Follow us on Facebook and Instagram for the latest news\nand promotions. #bluegoosecantina\n\nVisit the Website\n\n© 2023 Peterson Management Group. All Rights Reserved.\n\nFacebook __ Instagram __\n\nPrivacy Policy\n\nPeterson Management Group\n\nAll rights reserved\n\n",
    "links": "[{\"link\": \"https://www.petersonmanagementgroup.net/\", \"text\": \"\"}, {\"link\": \"https://www.petersonmanagementgroup.net/\", \"text\": \"\"}, {\"link\": \"https://www.petersonmanagementgroup.net/privacy-policy/\", \"text\": \"Privacy Policy\"}, {\"link\": \"https://www.petersonmanagementgroup.net/\", \"text\": \"\"}]"
}