{
    "summary": "Skip to Main Content\n\nIRS is officially accepting returns. Start Your Return\n\nTaxAct **Business**\n\nTaxAct **Professional**\n\n×\n\n  * Tax Filing \n\nTaxes for Individuals\n\n    * Online DIY Tax Filing\n\nFile your way, all online.\n\n    * Download DIY Tax Filing\n\nFile your way on desktop.\n\n    * Xpert Assist\n\nAdd help from a tax expert.\n\nTaxes for Businesses\n\n    * Online DIY Tax Filing\n\nEasy business tax filing.\n\n    * Download DIY Tax Filing\n\nEasy business tax filing from your desktop.\n\n    * Individual & Business Bundles\n\nSave more when you bundle.\n\nExtension & Late Filing\n\n    * Previous Tax Years\n\nFile returns from past years.\n\n    * File Tax Extension\n\nAvoid penalties and interest.\n\n  * Tax Tools \n\nTax Calculators\n\n    * Income Tax Calculator\n\nEstimate your refund.\n\n    * Self-Employment Tax Calculator\n\nSee what you potentially owe.\n\n    * Tax Bracket Calculator\n\nEstimate your federal tax bracket and total tax.\n\n\\-\n\n    * W-4 Calculator\n\nDecide your withholdings.\n\n    * Loan Calculator\n\nFigure out your monthly payments.\n\n    * Savings Calculator\n\nDetermine the future value of your savings.\n\ntax resources\n\n    * Tax Resource Center\n\nTax news, changes, and more.\n\n    * Tax Guides\n\nHelpful, easy to follow articles.\n\n    * Tax Checklists\n\nDouble-check you've got all the right forms and info.\n\n  * Support \n\nSupport\n\n    * Support\n\nSearch through popular help topics or contact our team.\n\n    * Blog\n\nGet to the latest tax updates, information, and advice.\n\n    * Live tax advice\n\nGet advice from real tax experts.\n\nReturn Status\n\n    * Check efile status\n\nSee where your return is right now.\n\n    * Track IRS Refund\n\nCheck where you refund is right now.\n\n  * TaxAct for Businesses \n  * TaxAct for Professionals \n\nSign In  Create Account\n\nDashboard  My Taxes  My Info  My Preferences  Tax Calculator  Sign Out\n\nCreate Account  Sign In\n\n# Guaranteed Accuracy.\n\n## We put $100k behind our numbers. No one else does that.\n\n4.4 | 22,500+ Reviews\n\n### Free\n\nBased on qualifying income and deductions. See if you qualify.\n\n  * W-2 employees & unemployment\n\n  * Students, Child Tax Credit, more\n\n$0.00\n\n\\+ State Additional\n\nAdd Live Tax Advice\n\nStart for Free\n\nMost Popular\n\n### Deluxe\n\n**Everything in Free plus:**\n\n  * Homeowner deductions\n\n  * Childcare expenses\n\n  * Health Savings Account\n\n$29.99\n\n\\+ State Additional\n\nAdd Live Tax Advice\n\nStart for Free\n\n### Premier\n\n**Everything in Deluxe plus:**\n\n  * Sale of investments/crypto\n\n  * Sale of home\n\n  * Rental property income\n\n$39.99\n\n\\+ State Additional\n\nAdd Live Tax Advice\n\nStart for Free\n\n### Self-Employed\n\n**Everything in Premier plus:**\n\n  * Freelance or side gig income\n\n  * Sole Proprietor or LLC\n\n  * See other business filing options\n\n$69.99\n\n\\+ State Additional\n\nAdd Live Tax Advice\n\nStart for Free\n\n## File your taxes online with confidence.\n\n## Max Refund Guarantee\n\nYou won't find a bigger refund with any other tax filing software. We\nguarantee it.*\n\n## Add Xpert Assist™\n\nGet one-on-one advice from real tax experts and a quick review before you\nfile.*\n\n## File your business taxes\n\nOnly TaxAct provides an online bundle for personal and business taxes. See\nBundles\n\n##  Data Privacy & Security\n\nOur safeguards, procedures, and practices help keep your data safe and\nprotected.\n\n## $100k Accuracy Guarantee\n\nYou can count on our software to be 100% correct, backed by $100,000.*\n\n## Exceptional Customer Care\n\nGet fast help. When you have questions, our team is here to answer them.*\n\n## Get live tax advice.\n\n### Add any time for $59.99.\n\nSpeak with a real tax expert over the phone\n\nUnlimited questions, personalized advice\n\nRequest a quick return review before filing\n\nGet Started\n\n## Business owners can bundle and save.\n\nOnly TaxAct provides a DIY online bundle for your personal and business taxes.\nIt’s easy, affordable and backed by our 100% Accuracy Guarantee.\n\nFile for Your Business\n\n4.4 | 22,500+ Reviews\n\n## Real People. Real Reviews.\n\nYou don't have to take our word for it. See all reviews here\n\n## Frequently Asked Questions\n\nWho qualifies for free federal filing\n\nYou can file for free yourself with TaxAct's Free Edition if you meet the\nqualifications below, including filing using IRS Form 1040 only without having\nto attach any forms or schedules. Only certain taxpayers are eligible.\n\n**Situations covered** (assuming no added tax complexity):\n\n  * W-2 income, Unemployment income, Retirement income \n\n  * Earned Income Tax Credit, Child Tax Credit, Stimulus Credit \n\n  * Dependents \n\n  * Current Students\n\n  * Student loan interest \n\n**Situations not covered:**\n\n  * Investment income: Stock, interest, dividends, crypto, or capital gains/losses \n\n  * Sale of home, real estate taxes, mortgage interest, or rental property income \n\n  * Royalty, trusts, and foreign accounts \n\n  * Business and farm income \n\n  * Itemized deductions \n\n  * Adoption credits and child and dependent care \n\n  * Health Savings Account (HSA) \n\n  * Freelance, contractor, side hustle, or self-employed income and expenses \n\nIf you don’t qualify for a basic federal tax return, we have other **paid tax\nfiling options** to help you easily file taxes online with TaxAct.\n\nWhat services does TaxAct offer?\n\nOur services help customers prepare their tax returns. We offer federal and\nstate DIY tax preparation, tax planning tools, and access to tax advice. We\nalso provide tools to help you import tax data, calculate your deductions and\ncredits, and maximize your tax refund. Our tax filing options for businesses\napply to Partnerships, C Corporations, S Corporations, Sole Proprietors, and\nTax-Exempt Orgs.\n\nDoes TaxAct offer tax filing for professionals?\n\nYes, we offer a tax preparation software called TaxAct Professional, which is\nspecifically designed for professionals including Certified Public Accountants\n(CPAs), Enrolled Agents (EAs), and tax preparers. TaxAct Professional features\ntax preparation tools, e-filing options, and comprehensive support to assist\ntax professionals in completing accurate and timely tax returns for their\nclients.\n\nDoes TaxAct offer expert assistance?\n\nWe do! Our Xpert Assist℠ service is an add-on feature that provides unlimited\nlive tax advice and assistance from tax experts. Xpert Assist is available for\nconsumer 1040 tax filing products (Free, Deluxe, Premier, and Self-Employed).\n\nWhat if I need help with my tax return?\n\nTaxAct offers unlimited access to live tax experts via Xpert Assist for\n$59.99. Our experts can provide helpful tax advice and quickly review your\ntaxes before you file\n\nIs my information secure with TaxAct?\n\nTaxAct takes data access and security very seriously. We use advanced\nencryption technology to protect your personal and financial information and\nhave well-established access controls and information security policies in\nplace to safeguard your data from being used for any unauthorized purposes.\n\nWhat is TaxAct's Maximum Refund Guarantee?\n\nTaxAct guarantees that you will get your maximum tax refund if you use one of\nour individual 1040 products to e-file your return. Our Maximum Refund\nGuarantee  promises that our software will calculate your maximum refund with\nthe information you provide, so there’s no need to look elsewhere.\n\nWhat is TaxAct's $100k Accuracy Guarantee?\n\nAt TaxAct, we are so confident in our calculations that we back them up with a\n$100k Accuracy Guarantee. If an error in our software results in you receiving\na smaller refund or larger tax liability than you get using the same data with\nanother tax software, we’ll pay you the difference up to $100,000 and\nreimburse your software costs.\n\n## Your security is a top priority, now and always.\n\nLearn More About Security\n\n*Offer Details & Disclosures\n\n**TaxAct Costs Less:  **“File for less” and percentage savings claims based on\ncomparison with TurboTax federal pricing for paid consumer online 1040 filing\nproducts on 11/15/2023.\n\n**Maximum Refund Guarantee:**  If an error in our software causes you to\nreceive a smaller refund or larger tax liability than you receive using the\nsame data with another tax preparation product, we will pay you the difference\nin the refund or liability up to $100,000 and refund the applicable software\nfees you paid us. Read more about our Maximum Refund Guarantee.\n\n **$100k Accuracy Guarantee:**  If you pay an IRS or state penalty or interest\nbecause of a TaxAct calculation error, we'll pay you the difference in the\nrefund or liability up to $100,000. This guarantee applies only to errors\ncontained in our consumer prepared tax return software; it doesn't apply to\nerrors the customer makes.  Read more about our $100k Accuracy Guarantee.\n\n **100% Satisfaction Guarantee:**  Applies to TaxAct Online products only. If\nyou are a registered user using the Services online and are dissatisfied with\nthe Services prior to completing the billing steps within the program, your\nexclusive remedy is to immediately discontinue using the Services. If you are\na registered user who completed the billing steps and have not printed or\ne-filed or your e-file was rejected by the IRS or State and you cannot re-\nfile, it is your responsibility to contact us within the calendar year of the\npurchase to request a refund of fee(s) paid.\n\n **TaxAct Xpert Assist:** TaxAct® Xpert Assist is available as an added\nservice to users of TaxAct’s online consumer & SMB 1040 product. Additional\nfees apply. Unlimited access refers to an unlimited quantity of expert\ncontacts available to each customer. Service hours limited to designated\nscheduling times and by expert availability. Some tax topics or situations may\nnot be included as part of this service. Review of customer return is broad,\ndoes not extend to source documents and is not intended to be comprehensive;\nexpert is available to address specific questions raised by customer. View\nfull TaxAct Xpert Assist Terms and Conditions.\n\n**Start Free and File Free:**  The TaxAct Online Free Edition makes free\nfederal filing available for those who qualify based on income and deductions.\nSee if you qualify for free federal filing and what is included in this year’s\nFree Edition.  For all other online products, you can start free and pay only\nwhen you file. This means you will not be charged if you decide to stop using\nany product prior to printing or e-filing.\n\n **Edition Pricing:**  Actual prices are determined at the time of payment,\nprint, or e-file and are subject to change without notice. Add sales tax for\napplicable orders. Offers may end at any time and promotional offers may not\nbe combined.\n\n **Exceptional Customer Care:** Customer care does not include tax advice.\n\n **Deduction Maximizer:  **TaxAct's Deduction Maximizer guides you step by\nstep through the process of completing your return in a way that helps you\nuncover additional tax advantages and helps you maximize your deductions by\nchecking dozens of additional deductions we know from experience folks don't\nthink to look for. Each deduction you claim may reduce the amount of tax you\nowe, resulting in a lower IRS bill overall.\n\n **All-Inclusive Bundle:  **All-inclusive is a collection of select products\nand services that may be used to enhance your DIY 1040 tax preparation and\nfiling experience. Additional state(s) returns are not included. If you choose\nto pay for your bundle using Refund Transfer, then the Refund Transfer will be\nincluded in the bundle price at no additional cost. Percent savings based on\nTaxAct a la carte pricing. Offer may not be combined with other offers.\n\nPrice paid, including sales tax, is determined at the time of filing and is\nsubject to change. All TaxAct offers, products and services are subject to\napplicable terms and conditions.\n\n **Audit Defense** : See Audit Defense provided by Tax Protection Plus (PDF)\nfor further details of services and requirements. May not apply to certain\nforms and credits. Certain customers may not qualify for services based on\npast tax audit history, residency, or other factors. Audit Defense is not\ninsurance. Audit Defense is subject to terms and conditions (PDF) located on\nTax Protection Plus's website.\n\n **Paid Advertising:**   TaxAct, Inc. gets fees from some third parties that\nprovide offers to its customers. This compensation may affect what and how we\ncommunicate their services to you. TaxAct is not a party to any transactions\nyou may choose to enter into with these third parties.\n\n **Real People. Real Reviews.** : All reviews are from verified TaxAct\ncustomers. Reviews are managed by Bazaarvoice and comply with the Bazaarvoice\nAuthenticity Policy, which is supported by anti-fraud technology and human\nanalysis. Cumulative star rating is for all TaxAct products, and certain\nverified TaxAct customer reviews are incentivized.\n\n **Refund Transfer:  **Refund Transfers are fee-based products offered by\nRepublic Bank & Trust Company, Member FDIC.  A Refund Transfer Fee and all\nother authorized amounts will be deducted from the taxpayer’s tax refund.\n\n **Refer-A-Friend:**  Offer valid through October 31, 2024. For each friend\nyou refer to TaxAct who did not prepare and file using us last year, you get a\n$20 Amazon.com Gift Card after they file their taxes using TaxAct’s 2023\nDeluxe, Premier or Self-Employed product. Even better, they get 20% off our\nfederal tax filing products by using the share link you provide! It’s not\nevery day you get to be somebody’s hero and make money doing it.\n\nAmazon.com is not a sponsor of this promotion. Except as required by law,\nAmazon.com Gift Cards (\"GCs\") cannot be transferred for value or redeemed for\ncash. GCs may be used only for purchases of eligible goods at Amazon.com or\ncertain of its affiliated websites. For complete terms and conditions, see\nwww.amazon.com/gc-legal. GCs are issued by ACI Gift Cards, Inc., a Washington\ncorporation. All Amazon ®, TM & © are IP of Amazon.com, Inc. or its\naffiliates. No expiration date or service fees.\n\nThis offer is for TaxAct’s consumer federal, online 1040 returns and is\nsubject to specific terms and conditions. See terms and conditions for more\ninformation. Offer is subject to change. The value of your gift card is\ndependent on the offer available at the time you make the referral.\n\n **TaxAct E-File Concierge™** service provides phone calls and related support\nregarding federal e-file status changes using the phone number provided in My\nAccount. Service is subject to availability and limited to federal e-filed tax\nreturns.\n\n **Most Popular:**  TaxAct Deluxe is our most popular product among our online\ncustomers with more complex tax situations.\n\n **Over 94 Million Returns Filed:**  Based on e-filed federal returns through\nTaxAct Consumer and TaxAct Professional software since 2000.\n\n ****\n\n **Refund Amounts Shown:** Actual refund amounts vary based on your tax\nsituation. Number shown in illustrations are based on IRS published data\nstating that average 2023 tax refunds were more than $2812. See IRS article\nfor more information.\n\n **Trademarks:**  All trademarks not owned by TaxAct, Inc. that appear on this\nwebsite are the property of their respective owners, who are not affiliated\nwith, connected to, or sponsored by or of TaxAct, Inc. TurboTax is a\nregistered trademark of Intuit, Inc. H&R Block is a registered trademark of\nHRB Innovations, Inc.\n\n### About\n\n  * About TaxAct \n  * TaxAct Guarantees \n  * Press Center \n  * Refer and Earn \n  * Careers \n  * Security \n  * Affiliates \n\n### Help and Support\n\n  * Check E-file Status \n  * Service and Support \n  * TaxAct Blog \n  * Site Map \n  * Contact Us \n\n### Tax Tools and Tips\n\n  * Tax Calculator \n  * Self-Employment Calculator \n  * Tax Bracket Calculator \n  * W4 Calculator \n  * Tax Center \n  * Tax Extensions \n\n### Stay Connected\n\n  * Facebook \n  * Twitter \n  * Instagram \n  * YouTube \n\n* * *\n\n* * *\n\nLegal Notice Privacy Notice GLBA Notice Do Not Sell or Share My Personal\nInformation\n\n©1998 - 2024 TaxAct ®\n\n",
    "links": "[{\"link\": \"https://www.taxact.com/taxes-online\", \"text\": \"Start Your Return\"}, {\"link\": \"https://www.taxact.com/business-returns\", \"text\": \"\"}, {\"link\": \"https://www.taxact.com/professional/\", \"text\": \"\"}, {\"link\": \"https://www.taxact.com/\", \"text\": \"\"}, {\"link\": \"https://www.taxact.com/\", \"text\": \"\"}, {\"link\": \"https://www.taxact.com/taxes-online\", \"text\": \"\"}, {\"link\": \"https://www.taxact.com/tax-preparation\", \"text\": \"\"}, {\"link\": \"https://www.taxact.com/tax-xpert-assist\", \"text\": \"\"}, {\"link\": \"https://www.taxact.com/business-returns\", \"text\": \"\"}, {\"link\": \"https://www.taxact.com/business-returns/download\", \"text\": \"\"}, {\"link\": \"https://www.taxact.com/lp/business-returns/online\", \"text\": \"\"}, {\"link\": \"https://www.taxact.com/products/prior-years\", \"text\": \"\"}, {\"link\": \"https://www.taxact.com/file-irs-tax-extension\", \"text\": \"\"}, {\"link\": \"https://www.taxact.com/tools/tax-calculator\", \"text\": \"\"}, {\"link\": \"https://www.taxact.com/tools/self-employed-calculator\", \"text\": \"\"}, {\"link\": \"https://www.taxact.com/tools/tax-bracket-calculator\", \"text\": \"\"}, {\"link\": \"https://www.taxact.com/w4-calculator\", \"text\": \"\"}, {\"link\": \"https://www.taxact.com/tools/loan-calculator\", \"text\": \"\"}, {\"link\": \"https://www.taxact.com/tools/savings-calculator\", \"text\": \"\"}, {\"link\": \"https://www.taxact.com/tax-center\", \"text\": \"\"}, {\"link\": \"https://www.taxact.com/tax-information/tax-planning-and-checklists\", \"text\": \"\"}, {\"link\": \"https://www.taxact.com/support\", \"text\": \"\"}, {\"link\": \"https://www.taxact.com/tax-xpert-assist\", \"text\": \"\"}, {\"link\": \"https://www.taxact.com/post-filing/efile-status\", \"text\": \"\"}, {\"link\": \"https://www.taxact.com/post-filing/track-refund\", \"text\": \"\"}, {\"link\": \"https://www.taxact.com/business-returns\", \"text\": \"\\n\\t\\t\\t\\t\\t\\t\\t\\t\\tTaxAct for Businesses\\n\\t\\t\\t\\t\\t\\t\\t\\t\"}, {\"link\": \"https://www.taxact.com/professional\", \"text\": \"\\n\\t\\t\\t\\t\\t\\t\\t\\t\\tTaxAct for Professionals\\n\\t\\t\\t\\t\\t\\t\\t\\t\"}, {\"link\": \"https://www.taxact.com/auth/\", \"text\": \"\\n\\t\\t\\t\\t\\t\\t\\t\\t\\tSign In\\n\\t\\t\\t\\t\\t\\t\\t\\t\"}, {\"link\": \"https://www.taxact.com/auth/create-account\", \"text\": \"\\n\\t\\t\\t\\t\\t\\t\\t\\t\\tCreate Account\\n\\t\\t\\t\\t\\t\\t\\t\\t\"}, {\"link\": \"https://www.taxact.com/myaccount/#!/dashboard\", \"text\": \"\\n\\t\\t\\t\\t\\t\\t\\t\\tDashboard\\n\\t\\t\\t\\t\\t\\t\\t\"}, {\"link\": \"https://www.taxact.com/myaccount/#!/taxes\", \"text\": \"\\n\\t\\t\\t\\t\\t\\t\\t\\tMy Taxes\\n\\t\\t\\t\\t\\t\\t\\t\"}, {\"link\": \"https://www.taxact.com/myaccount/#!/profile\", \"text\": \"\\n\\t\\t\\t\\t\\t\\t\\t\\tMy Info\\n\\t\\t\\t\\t\\t\\t\\t\"}, {\"link\": \"https://www.taxact.com/myaccount/#!/accountpreferences\", \"text\": \"\\n\\t\\t\\t\\t\\t\\t\\t\\tMy Preferences\\n\\t\\t\\t\\t\\t\\t\\t\"}, {\"link\": \"https://www.taxact.com/tools/tax-calculator\", \"text\": \"\\n\\t\\t\\t\\t\\t\\t\\t\\tTax Calculator\\n\\t\\t\\t\\t\\t\\t\\t\"}, {\"link\": \"https://www.taxact.com/exit/signed-out\", \"text\": \"\\n\\t\\t\\t\\t\\t\\t\\t\\tSign Out\\n\\t\\t\\t\\t\\t\\t\\t\"}, {\"link\": \"https://www.taxact.com/auth/create-account\", \"text\": \"\\n\\t\\t\\t\\t\\t\\tCreate Account\\n\\t\\t\\t\\t\\t\"}, {\"link\": \"https://www.taxact.com/auth/\", \"text\": \"\\n\\t\\t\\t\\t\\t\\tSign In\\n\\t\\t\\t\\t\\t\"}, {\"link\": \"https://www.taxact.com/consumer/reviews/all\", \"text\": \"22,500+ Reviews\"}, {\"link\": \"https://www.taxact.com/individual-taxes/online/free\", \"text\": \"Free\"}, {\"link\": \"https://www.taxact.com/individual-taxes/online/deluxe\", \"text\": \"Deluxe\"}, {\"link\": \"https://www.taxact.com/individual-taxes/online/premier\", \"text\": \"Premier\"}, {\"link\": \"https://www.taxact.com/individual-taxes/online/self-employed\", \"text\": \"Self-Employed\"}, {\"link\": \"https://www.taxact.com/lp/business-returns/online\", \"text\": \"See other business filing options\"}, {\"link\": \"https://www.taxact.com/lp/business-returns/online\", \"text\": \"See Bundles\"}, {\"link\": \"https://www.taxact.com/tax-xpert-assist\", \"text\": \"Get Started\"}, {\"link\": \"https://www.taxact.com/lp/business-returns/online\", \"text\": \"File for Your Business\"}, {\"link\": \"https://www.taxact.com/consumer/reviews/all\", \"text\": \"See all reviews here\"}, {\"link\": \"https://www.taxact.com/taxes-online\", \"text\": \"paid tax filing options\"}, {\"link\": \"https://www.taxact.com/professional/\", \"text\": \"TaxAct Professional\"}, {\"link\": \"https://www.taxact.com/tax-xpert-assist\", \"text\": \"Xpert Assist\"}, {\"link\": \"https://www.taxact.com/security\", \"text\": \"data access and security\"}, {\"link\": \"https://www.taxact.com/company/guarantees\", \"text\": \"Maximum Refund Guarantee \"}, {\"link\": \"https://www.taxact.com/company/guarantees\", \"text\": \"$100k Accuracy Guarantee\"}, {\"link\": \"https://www.taxact.com/security\", \"text\": \"Learn More About Security\"}, {\"link\": \"https://www.taxact.com/company/guarantees\", \"text\": \"Maximum Refund Guarantee\"}, {\"link\": \"https://www.taxact.com/company/guarantees\", \"text\": \"$100k Accuracy Guarantee\"}, {\"link\": \"https://www.taxact.com/tax-xpert-assist/termsandconditions\", \"text\": \"TaxAct Xpert Assist Terms and Conditions\"}, {\"link\": \"https://www.taxact.com/individual-taxes/online/free\", \"text\": \"Free Edition\"}, {\"link\": \"https://www.taxact.com/legal-notice\", \"text\": \"terms and conditions\"}, {\"link\": \"https://www.taxact.com/company/about-us\", \"text\": \"\\n\\t\\t\\t\\t\\t\\t\\t\\tAbout TaxAct\\n\\t\\t\\t\\t\\t\\t\\t\\t\"}, {\"link\": \"https://www.taxact.com/company/guarantees\", \"text\": \"\\n\\t\\t\\t\\t\\t\\t\\t\\tTaxAct Guarantees\\n\\t\\t\\t\\t\\t\\t\\t\\t\"}, {\"link\": \"https://www.taxact.com/press/press-releases\", \"text\": \"\\n\\t\\t\\t\\t\\t\\t\\t\\tPress Center\\n\\t\\t\\t\\t\\t\\t\\t\\t\"}, {\"link\": \"https://www.taxact.com/refer-a-friend\", \"text\": \"\\n\\t\\t\\t\\t\\t\\t\\t\\tRefer and Earn\\n\\t\\t\\t\\t\\t\\t\\t\\t\"}, {\"link\": \"https://www.taxact.com/company/join\", \"text\": \"\\n\\t\\t\\t\\t\\t\\t\\t\\tCareers\\n\\t\\t\\t\\t\\t\\t\\t\\t\"}, {\"link\": \"https://www.taxact.com/security\", \"text\": \"\\n\\t\\t\\t\\t\\t\\t\\t\\tSecurity\\n\\t\\t\\t\\t\\t\\t\\t\\t\"}, {\"link\": \"https://www.taxact.com/alliance/affiliate-overview\", \"text\": \"\\n\\t\\t\\t\\t\\t\\t\\t\\tAffiliates\\n\\t\\t\\t\\t\\t\\t\\t\\t\"}, {\"link\": \"https://www.taxact.com/post-filing/efile-status\", \"text\": \"\\n\\t\\t\\t\\t\\t\\t\\t\\tCheck E-file Status\\n\\t\\t\\t\\t\\t\\t\\t\\t\"}, {\"link\": \"https://www.taxact.com/support\", \"text\": \"\\n\\t\\t\\t\\t\\t\\t\\t\\tService and Support \\n\\t\\t\\t\\t\\t\\t\\t\\t\"}, {\"link\": \"https://www.taxact.com/sitemap\", \"text\": \"\\n\\t\\t\\t\\t\\t\\t\\t\\tSite Map\\n\\t\\t\\t\\t\\t\\t\\t\\t\"}, {\"link\": \"https://www.taxact.com/support/request\", \"text\": \"\\n\\t\\t\\t\\t\\t\\t\\t\\tContact Us\\n\\t\\t\\t\\t\\t\\t\\t\\t\"}, {\"link\": \"https://www.taxact.com/tools/tax-calculator\", \"text\": \"\\n\\t\\t\\t\\t\\t\\t\\t\\tTax Calculator\\n\\t\\t\\t\\t\\t\\t\\t\\t\"}, {\"link\": \"https://www.taxact.com/tools/self-employed-calculator\", \"text\": \"\\n\\t\\t\\t\\t\\t\\t\\t\\tSelf-Employment Calculator \\n\\t\\t\\t\\t\\t\\t\\t\\t\"}, {\"link\": \"https://www.taxact.com/tools/tax-bracket-calculator\", \"text\": \"\\n\\t\\t\\t\\t\\t\\t\\t\\t Tax Bracket Calculator\\n\\t\\t\\t\\t\\t\\t\\t\\t\"}, {\"link\": \"https://www.taxact.com/w4-calculator\", \"text\": \"\\n\\t\\t\\t\\t\\t\\t\\t\\tW4 Calculator\\n\\t\\t\\t\\t\\t\\t\\t\\t\"}, {\"link\": \"https://www.taxact.com/tax-center\", \"text\": \"\\n\\t\\t\\t\\t\\t\\t\\t\\tTax Center\\n\\t\\t\\t\\t\\t\\t\\t\\t\"}, {\"link\": \"https://www.taxact.com/file-irs-tax-extension\", \"text\": \"\\n\\t\\t\\t\\t\\t\\t\\t\\tTax Extensions\\n\\t\\t\\t\\t\\t\\t\\t\\t\"}, {\"link\": \"https://www.taxact.com/post-filing/efile-status\", \"text\": \"\"}, {\"link\": \"https://www.taxact.com/legal-notice\", \"text\": \"Legal Notice\\n\\t\\t\\t\\t\\t\"}, {\"link\": \"https://www.taxact.com/privacy-notice\", \"text\": \"Privacy Notice\\n\\t\\t\\t\\t\\t\"}, {\"link\": \"https://www.taxact.com/GLBA-notice\", \"text\": \"GLBA Notice\\n\\t\\t\\t\\t\\t\"}, {\"link\": \"https://www.taxact.com/do-not-sell-or-share\", \"text\": \"Do Not Sell or Share My Personal Information\\n\\t\\t\\t\\t\\t\"}]"
}