{
    "summary": "Help and Support  Contact Us\n\nOur Websites\n\nAE __\n\nAT __\n\nAU __\n\nBE __\n\nBOL __\n\nBR __\n\nCH __\n\nCN __\n\nCO __\n\nCR __\n\nCU __\n\nDE __\n\nDK __\n\nDOM __\n\nE __\n\nES __\n\nFI __\n\nFR __\n\nGCA __\n\nGR __\n\nHK __\n\nHN __\n\nIN __\n\nIT __\n\nJP __\n\nKR __\n\nLU __\n\nMY __\n\nMX __\n\nNL __\n\nNO __\n\nNZ __\n\nPH __\n\nPR __\n\nRA __\n\nRCH __\n\nROU __\n\nSE __\n\nSG __\n\nTR __\n\nTW __\n\nUK __\n\nUS __\n\nYV __\n\nZA __\n\nProduct Login\n\nTolley Tax Seminars Online\n\nLexisPSL\n\nLexisSmart Forms\n\nNexis\n\nNexis Direct\n\nLexis Diligence\n\nLexisNexis KYCID\n\nLexisNexis Newsdesk\n\nLexisNexis Professional\n\nLexisNexis Publisher\n\nTaxJob Search\n\nTolley Guidance\n\nTolley Library\n\nInternational Trade Update\n\nEU Tracker\n\nExpert Witness\n\nLink Direct Plus\n\nLexisWebinars\n\nLexisMentor\n\nLexisLearning Manager\n\nSearch\n\n__Get In Touch\n\nSearch\n\nMenu\n\n  * Products\n    * < Products\n    * **Compliance**\n      * < Compliance\n      * Nexis Diligence+™\n      * CleverKYC\n      * Due Diligence Process\n    * **Research, IP and Legal**\n      * < Research, IP and Legal\n      * Nexis®\n      * Nexis® Uni\n      * Nexis® Hub\n      * PatentSight\n      * LexisNexis TotalPatent One\n      * Patent Optimizer\n      * Patent Advisor\n      * IP Data Direct\n      * Lexis.com\n      * Lexis Advance\n      * Lexis Library\n      * Juris Classeur\n    * **Media Intelligence**\n      * < Media Intelligence\n      * Nexis Newsdesk\n      * Nexis® Social Analytics\n      * Nexis® Media Intelligence Research & Analytics\n      * Nexis® Media Contacts Solution\n      * Nexis Newswire\n    * **Data as a Service**\n      * < Data as a Service\n      * Data as a Service\n      * Risk Management with Data as a Service\n      * Adverse Media Feed with Data as a Service\n      * Big Data for PR, Marketing & Sales\n      * Academic Research with Data as a Service\n      * Nexis® Entity Search API\n  * Glossary\n    * < Glossary\n    * **Compliance**\n      * < Compliance\n      * Due Diligence\n      * KYC: Know Your Customer\n      * Enhanced Due Diligence Management\n      * PEP: Politically exposed persons\n      * Third Party Risk Management\n      * View more...\n    * **Research and Insights**\n      * < Research and Insights\n      * Valid research results vs. fake news\n      * Market Analysis\n      * Academic Research\n      * LexisNexis Smartindexing Technology\n      * View more...\n    * **Media Intelligence**\n      * < Media Intelligence\n      * Competitive intelligence\n      * Media monitoring and analytics\n      * Social Media Monitoring\n      * Press Review\n      * View more...\n    * **Data as a Service**\n      * < Data as a Service\n      * Secondary Data Analysis\n      * Content Aggregator\n      * Data Analysis Methods\n      * Data Analytics\n      * View more...\n  * Blogs\n    * < Blogs\n    * **All Blogs**\n      * < All Blogs\n      * Risk and Compliance\n      * Media Monitoring\n      * Research\n      * Data as a Service\n      * Press Release\n  * Resources\n    * < Resources\n    * **Resources**\n      * < Resources\n      * E-books\n      * Case Studies\n      * DaaS Repository\n  * Partners\n    * < Partners\n  * Request Trial Access\n    * < Request Trial Access\n\nContact Us\n\nHelp and Support\n\nContact Us Help and Support\n\n  * Home\n  * Glossary\n  * Compliance\n  * KYC: Know Your Customer \n\nPrint\n\n# **KYC: What is Know Your Customer? | A definition**\n\nUncover hidden risks when working with third parties!\n\nTalk to our experts\n\n## **KYC: Hidden Risks**\n\nSometimes appearances are deceptive or the camouflage is so good that it is\ndifficult to discover the reality. It may be that not all of your business\npartners are behaving as you suppose. A glance behind the façade can uncover\nunexpected risks – for your company and for you personally. You should\ntherefore run a KYC check on your suppliers and customer onboarding and on an\nongoing basis to reveal any concealed financial crimes and non-compliance.\n\nFind out how to go about it in our due diligence checklist.\n\n## **Definition: What is Know Your Customer (KYC)?**\n\nKnow Your Customer (KYC) is the aspect of due diligence that deals with the\nidentity verification of customers. KYC procedures involves checking personal\nand business details in order to exclude negative hits such as sanctions\nlists, watch lists and PEP lists and to identify ownership relationships,\ninvolvement in anti-money laundering and links between companies. To help\ntackle financial crime, money laundering, terrorist financing and other\ncriminal activities, minimum standards for due diligence, risk and compliance\nchecks have been introduced. The legal basis for the due diligence that makes\na KYC analysis necessary is the 3rd EU Money Laundering Directive. Failure to\ncomply with the due diligence requirement can result in heavy fines,\nreputational damage or even a prison sentence and withdrawal of your business\npermit.\n\nKnow Your Customer (KYC) and Know Your Supplier (KYS) checks should therefore\nbe a fixed component of your compliance management system (CMS). The nature\nand depth of the regulatory risk and compliance check depend on the expected\nlevel of risk. Transactions are also screened to identify possible unusual\nactivities.\n\nOne of the aims of Know-Your-Business-Partner due diligence is therefore to\nreveal the origin and whereabouts of funds. Risky activities that render such\nchecks necessary include:\n\nitem icon\n\nMoney Laundering\n\nitem icon\n\nFraud\n\nitem icon\n\nTax evasion\n\nitem icon\n\nTerrorism financing\n\n## **Customer Due Diligence**\n\nCustomer Due Diligence or CDD is the technique of acquiring, assessing, or\nverifying a customer or potential customer's identity and background\ninformation through the customer's name, photograph, residential address, and\nso on. Customer Due Diligence is a critical component of achieving Know Your\nCustomer (KYC) compliance. It is generally conducted by financial\norganizations to uncover any potential risks of doing business with a certain\ncustomer or firm by analyzing data from a range of sources, including\ngovernment-published sanctions lists, company listings, third-party data\nsources, and so on. The list of data or information needed to be collected\nare:\n\n  * The identity of the customers.\n  * The activities the customer is engaged in.\n  * The markets in which the customers operate and other entities in which they have a business.\n  * The risk profile of the customer – how likely they are to engage in behaviors that put financial institutions at risk.\n\nFinancial organizations devote time and energy to conducting customer due\ndiligence to avoid money laundering, fraud, terrorist financing, and\nsanctions-busting using the best due diligence software. Depending upon the\ncustomer's risk profile, we, at LexisNexis, conduct different levels of\ncustomer risk due diligence.\n\n## **Preventing Economic Crime**\n\nA robust Know-Your-Customer program helps companies avoid becoming embroiled\nin economic crime and provide security. Money laundering, corruption and fraud\nare issues that can affect any company and financial institutions, either\ndirectly or indirectly. Businesses must therefore ensure that they put\neffective anti-money laundering (AML) and anti-bribery & corruption (ABC)\nmeasures in place.\n\nFailure to do so can result in fines and prison sentences. Affected companies\noften suffer reputational damage. In serious cases, business permits may be\nwithdrawn.\n\nA KYC check is therefore no longer just something for companies in the\nfinancial sector: organizations in all sectors need to take them seriously.\n\nClient due diligence must be particularly thorough if it involves people who\nhave links with politicians or government bodies, because politically exposed\npersons (PEPs) are particularly vulnerable to corruption and bribery.\n\nSmall customers can be excluded from customer due diligence (also: client due\ndiligence) if contract values are low and their business situation is not\nunusual.\n\nWith a professional KYC tool/risk and compliance check tool/due diligence\nsoftware, companies can make investment to uncover the necessary background\ninformation on companies and individuals. The access to valid databases via a\nsingle platform simplifies research and reveals the relevant information\nquickly.\n\n## **Legal Principles**\n\nThe legal basis for KYC checks is the 3rd EU Money Laundering Directive. This,\ncombined with the UK Bribery Act, the UK Modern Slavery Act and the Financial\nAction Task Force (FATF), provides the framework for Know-Your-Customer\nactivities.\n\n###  **Legal principles internationally**\n\nThe international regulations are relevant event to companies that are not\nlocated in the affected countries but have business links with them.\n\nKnow-Your-Customer software helps you uncover criminal activity by companies\nand individuals. For example, it enables you to identify dummy companies that\nare being used by beneficial owners for money laundering or tax evasion.\n\nUsing a risk-based regulatory approach, you need to decide what resources to\ninvest in a KYC check.\n\nDo not rely on your partners’ good reputation but uncover risky activities\nusing risk and compliance check tool or third party compliance risk management\nand due diligence software: Know your customer!\n\n## **Who should use Know Your Customers (KYC)**\n\nAll companies require KYC process that have business relations with Financial\nInstitutions, Banks, Companies handling sensitive data, International Vendors,\nSuppliers and of course Customers. It is important for companies to run KYC\nduring onboarding and signing of contracts as well as ongoing basis or at the\ntime of renewal of contract to avoid association with business partners\ninvolved in financial crimes, and non-compliance of rules and regulations.\n\n## **You might also be interested in**\n\nAbout the Solution\n\nKYC compliance\n\nScreening business partners with Nexis Diligence+™\n\nTo the webinar overview\n\nWebinars\n\nLearn more in our free compliance webinars.\n\nView the blog\n\nCompliance Blog\n\nExpert contributions to current challenges.\n\n### **Frequently Asked Questions**\n\nAnswers to some popular questions\n\n__ What is KYC ?\n\nKnow Your Customer (KYC) is the aspect of due diligence that deals with the\nprecise identification and Verify customers. KYC procedures involves checking\npersonal and business details in order to exclude negative hits such as\nsanctions lists, watch lists and PEP lists and to identify ownership\nrelationships and links between companies. Read more\n\n__ Why is KYC important?\n\nKYC is done to help tackle and Verify white-collar crime, economic crime,\nmoney laundering and other criminal activities like terrorist financing. KYC\nis helpful to provide Security to their customer from online crime. A robust\nKnow-Your-Customer program helps companies avoid becoming embroiled in\neconomic crime. Money laundering, corruption and fraud are issues that can\naffect any company, either directly or indirectly. Failure to do so can result\nin fines and prison sentences. Affected companies often suffer reputational\ndamage. In serious cases, business permits may be withdrawn. Read more  \n\n__ What are KYC requirements?\n\nKYC (Know Your Customer) that required for your customers to continue\nbusiness. This standard verification process requires customers to verify\ntheir Identity, credentials and Address and also that they have not been\ninvolved in any criminal activities or terrorist financing.Read more\n\n__ How is KYC done?\n\nWith a professional KYC tool companies can uncover the necessary background\ninformation on companies and individuals. The access to valid databases via a\nsingle platform simplifies research and reveals the relevant information\nquickly. Read more  \n\n__ What are the components of KYC?\n\nKYC has 4 major components,  \n\n1\\. Customer acceptance policy,  \n2\\. Customer identification procedures,  \n3\\. Monitoring of transactions and  \n4\\. Risk management.\n\nRead more  \n\n__ What is the full name of KYC?\n\nKnow Your Customer (KYC) and Know Your Supplier (KYS) checks should therefore\nbe a fixed component of your compliance management system (CMS).Read more\n\n__ What are the benefits of KYC?\n\nKnow-Your-Customer software helps you uncover criminal activity by companies\nand individuals. For example, it enables you to identify dummy companies that\nare being used by beneficial owners for money laundering or tax evasion.Read\nmore\n\nGet in touch\n\n__E-mail:information@lexisnexis.com\n\n__Telephone number:+31204853456\n\nReasons to get in touch\n\n  * You can't find an answer to your problem on this website\n  * You would like to request training\n  * You would like a product demonstration\n  * You are having trouble logging in or have a technical problem\n\nSubscribe for updates\n\n  * Find us on LinkedIn\n  * Find us on Facebook\n\n#### Top product pages\n\n  * Nexis Uni®\n  * LexisNexis TotalPatent One\n  * Nexis Diligence+™\n  * Nexis Newsdesk™\n  * Data as a Service\n\n#### Popular Pages\n\n  * Our Blogs\n  * Glossary\n  * Partners\n  * Request Trial Access\n  * Olympic Games Tracker\n\n#### Search products\n\n#### About this site\n\n  * Site map\n  * Site feedback\n\n#### Contact details\n\n  * tel:+31204853456\n  * information@lexisnexis.com\n\n#### Global offices\n\n  * View LexisNexis offices worldwide\n\n  * Privacy Policy\n  * Privacy Center\n  * Manage Cookie Settings\n  * Terms and Conditions\n  * Processing Notice\n\nCopyright © 2023 LexisNexis.\n\n## Welcome\n\nWe use cookies which are necessary to make our site work. We may also use\nadditional cookies to analyse, improve and personalise our content and your\ndigital experience. For more information, see ourCookie Policy.\n\nReject Additional Cookies Accept All Cookies\n\nManage Cookie Settings\n\n## Cookie Preference Centre\n\nWe use cookies which are necessary to make our site work. We may also use\nadditional cookies to analyse, improve and personalise our content and\nadvertisements and your digital experience. For more information, see\nourCookie Policy and the list ofGoogle ad technology providers.  \n  \nYou can choose to reject some types of cookies. However, blocking some types\nmay impact your experience of our site and the services we are able to offer.\nClick the category headings below to find out more or change your settings.\n\nAllow All\n\n### Manage Consent Preferences\n\n#### Strictly Necessary Cookies\n\nAlways Active\n\nThese cookies are necessary for the website to function and cannot be switched\noff in our systems. They are usually only set in response to actions made by\nyou which amount to a request for services, such as setting your privacy\npreferences, logging in or filling in forms. You can set your browser to block\nor alert you about these cookies, but some parts of the site will not then\nwork.\n\nCookies Details‎\n\n#### Performance Cookies\n\nPerformance Cookies\n\nThese cookies allow us to count visits and traffic sources so we can measure\nand improve the performance of our site. They help us to know which pages are\nthe most and least popular and see how visitors move around the site.\n\nCookies Details‎\n\n#### Functional Cookies\n\nFunctional Cookies\n\nThese cookies enable the website to provide enhanced functionality and\npersonalisation. They may be set by us or by third party providers whose\nservices we have added to our pages. If you do not allow these cookies then\nsome or all of these services may not function properly.\n\nCookies Details‎\n\n#### Targeting Cookies\n\nTargeting Cookies\n\nThese cookies may be set through our site by our advertising partners. They\nmay be used by those companies to build a profile of your interests and show\nyou relevant adverts on other sites. If you do not allow these cookies, you\nwill experience less targeted advertising.\n\nCookies Details‎\n\nBack Button\n\n### Performance Cookies\n\nSearch Icon\n\nFilter Icon\n\nClear\n\ncheckbox label label\n\nApply Cancel\n\nConsent Leg.Interest\n\ncheckbox label label\n\ncheckbox label label\n\ncheckbox label label\n\n  * ### \n\n####\n\nView Cookies\n\n    * Name\n\ncookie name\n\nConfirm My Choices\n\n",
    "links": [
        "https://internationalsales.lexisnexis.com/glossary/compliance/kyc-know-your-customer"
    ]
}