{
    "summary": "  * Product\n\n    * How LenderKit worksFind out how to use LenderKit for your crowdfunding business.\n    * Features overviewExplore some of the main LenderKit features and functionality.\n    * IntegrationsExplore LenderKit integrations: payment gateways, KYC, eSign, etc.\n    * Success storiesExplore some of the best crowdfunding platforms launched with LenderKit.\n    * PricingExplore LenderKit packages and licensing options.\n    * Virtual tourGet the look and feel of the LenderKit crowdfunding software through an online tour.\n\n  * Solutions\n\n    * Equity crowdfundingStart an equity crowdfunding platform to bring startups and investors together.\n    * Real estateFund more real estate projects on your investment platform.\n    * Private EquityBring private equity deals to retail and professional investors with an online platform.\n    * SME lendingGet started with a highly scalable P2P lending platform.\n    * Impact InvestmentPool capital through an online platform to fund sustainable and socially impactful projects.\n    * All solutionsCrowdfunding and investment software for private placements, loan management and other.\n\n  * About\n\n    * Our storyThe story behind LenderKit, learn how everything started and where we are going.\n    * PartnersLearn more about partnership opportunities with LenderKit.\n    * Contact usReach out to our manager to discuss your ideas and project requirements.\n\n  * Resources\n\n    * FAQFind out answers to the most frequently asked questions.\n    * BlogRead the latest news and updates, guides, and niche articles.\n    * VideosCrowdfunding and crowdinvesting videos for businesses worldwide.\n    * Fundraising cycleSee how LenderKit can help you manage full cycle fundraising.\n    * White-papersDownload industry reports and useful white-papers about crowdfunding.\n    * Appointed representativeOperate an FCA-compliant crowdfunding platform in the UK.\n\nSchedule demo  Schedule demo\n\n#  KYC/AML providers for crowdfunding platforms\n\nFind out what identity verification or anti-money laundering provider fits\nyour crowdfunding ecosystem and business requirements.\n\n## Vix Verify: online verification of identity\n\nVixVerify, now called GreenID by GBG helps you achieve regulatory compliance\nby performing **automatic KYC checks**  and reducing time to onboard new\ninvestors on your crowdfunding platform.\n\nIt allows you to configure its check against multiple data sources and satisfy\nyour business rules as well as  **support different risk profiles**  and\ncompliance requirements.\n\nVisit VixVerify\n\n## Jumio identity verification\n\nJumio is one of the world’s largest identity verification provider with over\n250 million identities verified worldwide. Jumio helps companies:\n\n  * Optimize conversions\n  * Eliminate fraud\n  * Conduct KYC & KYB checks\n  * Conduct AML verification\n  * Simplify authentication and more\n\nMore about Jumio eKYC solutions\n\n## Shufti Pro: real time identity verification\n\nShufti Pro is one of the industry-leading KYC, KYB, and AML service providers,\nglobally.\n\nIf you are looking to automate your investor onboarding and company due\ndiligence processes, Shufti Pro has got you covered. The company provides\nverification services for P2P, Crowdfunding, banks and more. It helps\nbusinesses:\n\n  * Perform global KYC & KYB screening in seconds\n  * Configurable verification steps to comply with regulatory requirements\n  * Prevent corporate & identity fraud\n  * Verify identities in seconds with 98.67% accuracy\n  * Perform AML screening\n\nExplore Shufti Pro solutions\n\n## Mob.id: KYC and AML tool with 100% accuracy\n\nMob.id is a new generation of web3 identity verification tools and\nauthenticators for fintech businesses. It’s a GDPR-compliant solution for CDD\nwith the workflow supported globally. It helps business with:\n\n  * identity proofing according to ICAO PKD;\n  * onboarding clients in under one minute;\n  * secure MFA for recurring clients;\n  * AML monitoring powered by Refinitiv data catalog.\n\nVisit Mob.id\n\n## Looking for a different KYC/AML provider or already found one?\n\nDiscuss integration\n\n  * Software solutions\n    * Equity crowdfunding\n    * P2P lending\n    * Investment management\n    * Real estate crowdfunding\n    * Appointed representative\n  * By country\n    * United States\n    * MENA region\n    * Saudi Arabia\n    * Europe\n    * United Kingdom\n  * White-papers\n    * Financial marketplaces in the UK\n    * USA crowdfunding regulations report\n    * Crowdfunding industry report\n  * About\n    * Our story\n    * Portfolio\n    * Our partners\n    * Contact us\n    * YouTube\n\nAddresses\n\n  * Trading  Fred. Roeskestraat 115 1076 EE, Amsterdam, Netherlands\n  * Legal  Lenderkit OÜ Sepapaja 6, Tallinn 15551, Estonia\n\nContacts\n\n  * hello@lenderkit.com \n\n© Lenderkit OÜ 2023\n\nPrivacy Policy\n\n###  Schedule a live demo\n\nName\n\nEmail\n\nCompany name\n\nPhone\n\nPosition (Job title)\n\nCompany size SizeIt's just me at the momentSmall team (2-4 members)Small\nbusiness (5-11 employees)Midsize business (12-50 employees)Corporate (51+\nemployees)Select your company size ****\n\nYears in business\n\nHeadquarters location\n\nTypes of offers OffersEquityDebtTokenized\nassetsDonation/RewardFundsRoyaltiesOther\n\n  * \n\nInvestor types Investor_typesRetailHigh-net-worthInstitutional\n\n  * \n\nExpected volume in USD in the first year TurnoverLess than 500K500K - 1M1M -\n5M5M - 10M10M - 20M20M - 50MOver 50MSelect your expected turnover ****\n\nNumber of projects in the first year\n\nBusiness stage ProgressExploring ideas; considering various\npossibilitiesCommitted to entering this space, exploring optionsAssembled our\ncore team, actively exploring solutionsTeam and funding secured, seeking tech\nsolutionsStarted building our platform, exploring alternativesPlatform live\nbut seeking tech support for growthSelect your current progress ****\n\nMessage\n\nI agree to the LenderKit Privacy Policy\n\nSend request\n\n### Thanks for your interest in our solution!\n\nWe'll get back to you shortly and answer any questions you may have.\n\n",
    "links": [
        "https://lenderkit.com/integrations/kyc-aml-providers//privacy-policy/"
    ]
}