{
    "summary": "  * English\n    * Español \n    * Italiano \n    * Français \n  * Take a tour\n  * Blog\n  * Support\n  * Sign in\n\n  * Our solutions \n    * All\n    *       * The Real Identity Platform Build trust with your customers using a flexible, end-to-end identity verification platform.\n\n        * The Real Identity Platform\n        * Take a tour\n        * Book a meeting\n        * Try for free\n        * All products\n      * Airside Mobile Verify once, share anywhere.\n\n    *       * Onfido Studio Orchestrate verifications and signals into easy-to-manage workflows.\n\n      * Onfido Atlas™ Get fair, fast, and accurate results with AI.\n\n      * Smart Capture SDK Integrate an exceptional capture experience.\n\n      * Verification Suite Access a library of verifications and fraud signals.\n\n        * Verification Suite\n        * Document verification\n        * Biometric verification\n        * Data verification\n        * Fraud detection\n  * Challenges we solve\n    * All\n    * Challenges\n      * All\n      * Customer acquisitionDrive growth using automated onboarding.\n      * Global complianceNavigate regulatory compliance in each region.\n      * Cost of customer acquisitionAutomate onboarding processes to reduce costs.\n      * Fraud preventionPrevent fraud to protect your business and customers.\n      * Customer use cases\n    * Use cases\n      * All\n      * KYCNavigate know your customer compliance.\n      * Identity verificationCreate confidence in user identity.\n      * Driver registrationMeet regulatory needs and protect your fleet.\n      * User onboardingAutomate onboarding and maximize conversion.\n      * Age verificationVerify a customer’s legal age.\n    * Related content\n      * All\n      * EU KYC requirements guide\n      * Guide to digital identity verification\n      * Identity fraud report\n  * Industries\n    * All\n    * Industries\n      * All\n      * Industries we partner with\n      * Financial servicesAutomate onboarding, prevent fraud, and navigate KYC.\n      * GamingSeamlessly onboard players and meet KYC requirements.\n      * HealthcareKnow your patient using digital verification.\n      * Sharing economyProtect your platform, reputation, and users.\n      * Retail & eCommercePrevent account takeover and chargeback fraud.\n      * TelecommunicationsMeet regulatory requirements and stop fraud.\n      * TransportVerify renters, drivers, and riders.\n    * Financial services in depth\n      * All\n      * Enhance customer engagement with digital banking\n      * Identity verification for traditional banks\n      * Onboarding for digital-first banks\n      * KYC for remittance services\n      * eKYC for lending services\n  * Our company\n    * All\n    * About Onfido\n      * All\n      * Supported documents\n      * About Onfido\n      * Partners\n      * Leadership\n      * Certifications\n    * Learn more\n      * All\n      * Why Onfido?\n      * Press\n      * Careers\n    * Featured partnership\n      * All\n      * SalesforceLearn how our partnership embeds identity verification directly in Salesforce.\nLatest customer story\n\n      * All\n      * LemonwayLearn how Lemonway has doubled its number of validated wallets and accounts.\n  * Resources\n    * All\n    * Resources\n      * All\n      * BlogRead about all things digital identity.\n      * Customer storiesLearn how businesses succeed with Onfido.\n      * Reports & whitepapersGet in-depth research, insights, and guidance.\n      * VideosWatch expert webinars and videos.\n    * For developersEverything you need to get started with Onfido.\n      * All\n      * Developer hub\n      * API reference\n      * Release notes\nSupport\n\n      * All\n      * Knowledgebase\n      * Customer success & professional services\n\n  * Get in touch Try for free\n\nKYC  AML  Supported documents  All products  Interactive tour  ROI calculator\nFraud report  Financial services\n\nClose\n\n#  KYC (know your customer)\n\nTurn know your customer (KYC) and anti-money laundering (AML) compliance into\nyour competitive advantage. Automated KYC checks allow you to onboard new\ncustomers and detect fraud while reducing costs.\n\nGet in touch  Explore the Real Identity Platform\n\n##  Automate KYC identity verification with AI\n\nAutomatically route each customer to the right KYC processes and stop fraud.\nOur end-to-end verification and orchestration platform is powered by Atlas™ AI\nto offer fair, fast, and accurate identity verification.\n\n##  Know your customers at onboarding\n\nKYC is non-negotiable, and onboarding is a critical moment in verifying\ncustomer identity and conducting due diligence. The Real Identity Platform\nmakes navigating KYC simple in over 160 countries — whether you need proof of\naddress, politically exposed persons (PEPs) and sanctions screening, adverse\nmedia checks, or  ongoing monitoring.\n\nVerification Suite\n\n##  Address global KYC compliance needs\n\nAutomatically route applicants to verification journeys that meet relevant KYC\nand AML regulations. Onfido Studio lets you build geo-compliant workflows that\nconform to identity standards and best practices, such as ETSI TS 119 461.\n\nMeet global compliance\n\n##  Meet global KYC compliance needs\n\nOrchestrate KYC workflows that route each applicant through the right\nverifications and fraud detection signals to meet KYC and AML regulations and\nyour risk tolerance. Onfido Studio allows you to create tailored verification\njourneys and find the right balance of convenience and security for each user\nwhile complying with geography specific regulations. Automatically route users\nto the verifications that match their level of potential risk, so low-risk\ncustomers get through faster while high-risk users are automatically moved to\nhigher-assurance verification flows.\n\nMeet global compliance\n\n##  Automate KYC to reduce operational costs\n\nStaying compliant doesn’t have to add to your operational costs. With Onfido,\nyou can reduce the cost of KYC compliance with an AI-powered solution that\nautomates KYC identity verification. We perform the checks for you in seconds,\nsaving you hours of manual review.\n\nReduce cost of customer acquisition\n\nLocal regulations\n\n##  What do local KYC requirements look like?\n\n### KYC in the US\n\nFinancial services in the US have to comply with KYC requirements — learn what\nthey are, and how to meet them.\n\nLearn more\n\n### KYC in Canada\n\nLearn about FINTRAC compliance and what identity verification methods are\naccepted in Canada.\n\nLearn more\n\n### KYC in the UK\n\nKYC for financial services in the UK is overseen by the FCA — learn about UK\nregulations and requirements.\n\nLearn more\n\n### KYC in Malaysia\n\nNavigate Bank Negara Malaysia (BNM) compliance with digital onboarding\njourneys that are compliant and scalable.\n\nLearn more\n\n### KYC in the Philippines\n\nNavigate BSP compliance, onboard new customers, and detect fraudulent activity\nall in an end-to-end platform.\n\nLearn more\n\n##  Discover Onfido for KYC identity verification\n\nVerification Suite\n\nData Verification\n\nDocument Verification\n\nSmart Capture SDK\n\nAutofill\n\n###  Verification Suite\n\nDiscover all the identity verification services you need in one place,\nincluding award-winning document and biometric verification solutions, trusted\ndata sources, and fraud detection signals.\n\nVerification Suite\n\n###  Data Verification\n\nValidate user data against trusted databases to meet KYC, AML, and sanctions\nscreening requirements. Our library of data sources grants extensive coverage\nand gives accurate results.\n\nExplore Data Verification\n\n###  Document Verification\n\nVerify customer IDs in seconds with low-friction and accurate document\nverification. Onboard customers wherever they are using 2,500+ supported\ndocuments worldwide.\n\nExplore Document Verification\n\n###  Smart Capture SDK\n\nAllow your customers to easily capture high-quality images and upload\ndocuments and facial biometrics as part of the identity verification process.\n\nExplore Smart Capture SDK\n\n###  Autofill\n\nPre-populate sign-up forms to remove user friction, ensure data integrity, and\nboost conversion. Autofill extracts data from a presented ID and automatically\nfills sign-up forms, removing the need for customers to manually enter\ninformation.\n\nLearn more\n\n## Learn how Revolut receives results 38 seconds faster since switching to\nOnfido.\n\nRead Revolut case study\n\n## Learn how Chipper Cash achieved a 95% automation rate when verifying\ncustomers.\n\nRead Chipper Cash case study\n\n## Learn how KOHO reduced their verification time by 98% with the Real\nIdentity Platform.\n\nRead KOHO case study\n\n## Five times more users verified and onboarded, with the exact same operators\nteam.\n\nRead bunq case study\n\nView all customer stories\n\n##  Why choose Onfido?\n\nOur automated KYC identity verification platform helps you verify customers in\nseconds so you can satisfy global compliance requirements and protect against\nfraud.\n\nMore resources\n\n##  Keep up to date with the latest KYC & AML insights\n\nView all resources\n\n### The Onfido Identity Fraud Report\n\nDiscover key insights into emerging threats and the latest fraud prevention\ntechniques.\n\nRead the report\n\n### 3 ways to improve your verification experience\n\nLearn how to manage friction and stay competitive in today’s market by\ncreating a great UX.\n\nRead the blog\n\n### The Total Economic Impact™ of Onfido\n\nForrester Consulting quantified the real business benefits delivered by\nOnfido.\n\nRead the report\n\n##  Compliance certifications\n\nWe help hundreds of businesses navigate compliance worldwide. Our solution\nmeets ETSI TS 119 461, ETSI EN 319 401, and eIDAS Regulation EU 2014/910 and\nis 'high confidence' on the UK Government's Digital Identity and Attributes\nTrust Framework.\n\nAll certifications\n\nETSI Technical Standards\n\n### ETSI TS 119 461 and EN 319 401 Certified\n\neIDAS Regulation\n\n### Regulation (EU) No 910/2014 Compliant\n\nUK Government's Digital Identity and Attributes Trust Framework\n\n### High Confidence Profile H1A\n\n##  Know your customer (KYC) FAQs\n\n## What is the primary purpose of KYC, and why is it important?\n\nWhile the primary purpose of KYC may vary from one industry to another, the\nKYC process generally consists of distinct steps designed to verify customer\nidentity. Identity verification platforms help businesses verify customer\nidentities and assess fraud risks. This is especially important (and a legal\nrequirement) for financial institutions, which are highly regulated.\n\nThe KYC process builds trust between businesses and their customers,\nultimately benefiting both. By implementing robust identity verification\nprocesses at onboarding and developing an understanding of ongoing customer\nbehavior such as transaction patterns, businesses can spot suspicious\nactivities and prevent criminal activity such as money-laundering.\n\n## How do know your customer and know your business requirements differ?\n\nKnow your customer checks are conducted when a business wants to establish a\nbusiness relationship with an individual person. Know your business checks are\nconducted when they want to establish a business relationship with another\ncompany. KYB checks typically involve identifying the ultimate beneficial\nownership (UBO) in order to ascertain who might be benefiting from the\nfinancial activity of the business. They also often include identifying if a\nbusiness is subject to PEPs and sanctions checks, or has been linked through\nadverse media to illicit activity.\n\n## Is KYC a legal requirement?\n\nYes, KYC is a legal requirement in many industries. The financial services\nindustry is highly regulated with regulations applicable to starting new\ncustomer relationships as well as managing and monitoring customer accounts on\nan ongoing basis. Only through diligent and consistent KYC processes can these\norganizations counteract illegal activities like money laundering, corruption,\nand more.\n\n### United Kingdom\n\nIn the United Kingdom (UK), AML regulations are outlined in the terrorism act\n(2000), Proceeds of Crime Act (2002), and money laundering, terrorist\nfinancing, and transfer of funds regulations (2017). Additional regulations\nand guidance are related to biometrics regulation, cryptocurrency, and\nevolving AML rules.\n\n### European Union\n\nCompanies operating in the European Union (EU) must abide by regulations set\nforth in the Fifth and Sixth Anti-Money Laundering Directives (also known as\n5AMLD, 6AMLD). Additional EU regulations concern AI best practices and AML\nreforms that have been developed to include specific guidance related to\nvarious use cases like gambling services and stringent remote identity\nverification procedures.\n\n### United States\n\nAs it relates to know your customer regulation, the Patriot Act of the United\nStates was designed to “deter and punish terrorist acts in the United States\nand around the world, to enhance law enforcement investigatory tools, and\nother purposes.” While Section 326 of the USA Patriot Act doesn’t represent\nthe origin of KYC regulations and compliance across the United States, it\ncertainly signifies an important development. The know your customer rule in\nthe USA Patriot Act requires that financial institutions enact safeguards\nagainst money laundering, terrorist financing, identity theft and other forms\nof fraud.\n\nUltimately, whether companies are operating in the UK, EU, US, or elsewhere,\nKYC requirements effectively serve to:\n\n  * Strengthen domestic measures for preventing, detecting, and prosecuting international money laundering and financing of terrorism.\n  * Subject foreign jurisdictions, foreign financial institutions, and classes of international transactions or types of accounts that are susceptible to criminal abuse to special scrutiny.\n  * Require all appropriate elements of the financial services industry to report potential money laundering.\n  * Strengthen measures to prevent the use of financial systems for personal gain by corrupt foreign officials (and facilitate repatriation of stolen assets to the citizens of countries to whom such assets belong).\n\nYou can learn much more about how Onfido empowers organizations to satisfy\nglobal compliance requirements in our global compliance manager’s guide or EU\ncompliance manager’s guide.\n\n## What are the benefits of knowing your customer?\n\nIn addition to compliance, the benefits of knowing your customer also include:\n\n  * **Fraud and money laundering prevention:** Robust KYC processes contribute to strong confidence regarding customer identity, helping to protect against exposure to threats like identity theft, as well as various types of financial crime — all of which can be costly to remedy once it’s occurred. \n  * **Cost savings:** Comprehensive, properly-implemented KYC/AML processes help organizations avoid fines and other penalties that could have financially severe consequences. When these processes can be automated and digitized, they’re even more cost-efficient.\n  * **Increased customer trust:** Many customers are savvy to the various threats the modern world presents, including the risk of identity theft or other forms of fraud. When organizations implement dependable solutions that mitigate those risks, customers will know they can trust working with them.\n\n## How does KYC prevent money laundering?\n\nAs mentioned above, one key objective of KYC adherence is detecting and\npreventing suspicious activity, including money laundering. Anti-money\nlaundering (AML) practices refer to specific procedures that financial\ninstitutions leverage to prevent criminal activities, such as any attempts to\ndeposit or transfer funds generated through illicit or illegal activities.\nWhen you consider the prevalence of financial fraud, the importance of AML in\nKYC is difficult to overstate.\n\nLike KYC compliance, international and local anti-money laundering regulations\nare required for certain business types. Ongoing monitoring and risk\nmanagement is crucial, since people can be sanctioned (or subject to\nrestrictions by authorities) after they have already started a banking\nrelationship. KYC and AML work hand-in-hand to set a framework for\norganizations to maintain legal compliance, protect customers’ identities and\npersonal data, and prevent fraud. By adding identity verification at sign-up,\ncompanies can ensure customers are who they say they are from the start of\ntheir relationship, laying a strong foundation for future due diligence and\nongoing monitoring.\n\n## Why digitize KYC identity verification?\n\nThere are two primary ways to conduct KYC: a manual (paper-based) process or\nan online (digital) process — sometimes known as electronic know your customer\n(eKYC).\n\nAs you might expect, KYC started as a physical process but has since shifted\nto be mostly digital. Why the shift? It has a lot to do with the many\nchallenges of manual or offline KYC, which include:\n\n  * **Manual data entry** including information checks, error identification and correcting, and following up with clients or customers to collect additional information. These processes, when done manually, are exceptionally time-consuming and prone to human error.\n  * **High costs** including salary wages as well as the potential for hefty regulatory fines.\n  * **A poor customer/client experience** , driven by time-consuming processes that had to be completed in person.\n  * **Keeping up with industry regulations** , which are constantly evolving and being updated in the face of sophisticated new threats around identity theft and financial fraud.\n  * **Security threats** , including data breaches that can substantially erode client trust and result in hefty financial penalties for banks and other businesses.\n\n## What are the four key elements of KYC processes?\n\nThe four most important elements of a well-rounded and effective KYC/eKYC\nframework are:\n\n  1. Client/customer acceptance policies\n  2. Customer identification processes\n  3. Customer due diligence and enhanced due diligence\n  4. Ongoing monitoring/risk management\n\n### 1\\. Client/customer acceptance policies\n\nFinancial institutions and other organizations should outline client\nacceptance policies that determine the types of customer or client profiles\nthat present different levels of risk.\n\nFor example, an individual looking to open a modest, basic checking or savings\naccount may not pose too great a risk to the institution, so KYC requirements\nare likely to be less intensive than those for wealthy clients (or those with\ncomplex needs). A bank wouldn’t necessarily need to apply extremely rigorous\nor lengthy review processes for these accounts — and doing so might drive\nclients away in frustration. KYC automation — which we’ll cover a little later\n— expedites these processes without sacrificing accuracy. By contrast, though,\nif another client has a particularly high net worth or their source of their\nfunds is unclear, the financial institution would be wise to take a deeper\nlook at the client’s financial picture in order to understand the potential\nrisks and how they may be mitigated.\n\n### 2\\. Customer identification programs\n\nWho are your customers? True to its name, customer identification involves a\nseries of steps designed to ensure that all customers or clients who do\nbusiness with a financial institution are who they say they are (and that\ntheir business is legitimate).\n\nIn the United States, financial institutions are required to uphold a Customer\nIdentification Program (CIP), a mandate enforced by the Financial Crimes\nEnforcement Network (FinCEN), a bureau of the United States Department of the\nTreasury.\n\nFinCEN’s CIP rule sets minimum requirements for onboarding new clients or\ncustomers. While these will vary somewhat depending on factors like the\norganization’s size and geographic location, it should always include\nidentifying and verifying persons opening an account, organized and timely\nrecordkeeping, and comparison with government lists to spot any discrepancies.\n\n### 3\\. Customer due diligence\n\nCustomer due diligence (CDD) refers to a series of checks that work to verify\ncustomers’ identities and understand their unique risk profiles. It becomes\nthe basis for any additional enhanced due diligence (EDD) that is necessary\nbased on the customer’s risk profile.\n\n### 4\\. Ongoing monitoring and risk management\n\nIn the context of KYC, ongoing monitoring helps ensure that a company’s\nunderstanding of its customer or user base remains consistent and accurate\nover time. Ongoing monitoring is designed to detect any reasons why a banking\ninstitution might be prohibited from doing business with certain customers —\ndue to newly-applied sanctions, for example.\n\nIt also helps to protect company assets, provide a positive customer\nexperience, and remain in regulatory compliance. To put it in simple terms,\nongoing monitoring involves regularly revisiting steps one through three, as\ndescribed above. This way, companies can assess whether their client/customer\nacceptance policies, CIPs, or due diligence procedures need to be adjusted or\nupdated.\n\nWhen paired with ongoing monitoring, KYC/AML risk management helps ensure\ncompliance with local governments and regulators.\n\n## Can KYC/AML be automated?\n\nYes, many KYC/AML processes can — and should — be automated. When done right,\nautomation streamlines and speeds up onboarding and helps ensure ongoing\nmonitoring and compliance.\n\nOnfido’s Real Identity Platform (powered by Atlas™ AI) provides flexible, end-\nto-end identity verification — including document and biometric verifications,\ntrusted data validation, fraud detection and more.\n\n## What are the latest KYC compliance regulations?\n\nKYC regulations depend on industry and geography and are always changing —\nlearn about the latest in our EU KYC requirements guide and global compliance\nmanager’s guide to KYC.\n\n##  Ready to get started?\n\nOur identity experts are available to talk through your requirements, answer\nquestions, and set up a demo.\n\nContact us  Try for free\n\n**Onfido uses 256-bit SSL encryption 100% of the time on every device.**\n\nOnfido is SOC 2 Type II compliant.\n\nOnfido has been certified by BSI to ISO 27001 under certificate number IS\n660122.\n\n* * *\n\n  * Solutions\n    * Real Identity Platform\n    * Verification Suite\n    * Onfido Studio\n    * Onfido Atlas\n    * Smart Capture SDK\n  * Challenges we solve\n    * Compliance\n    * Customer acquisition\n    * Reducing cost of acquisition\n    * Fraud prevention\n  * Industries\n    * Financial services\n    * Gaming\n    * Healthcare\n    * Marketplaces & communities\n    * Retail & eCommerce\n    * Telecommunications\n    * Transport\n  * Our company\n    * About Onfido\n    * Why Onfido?\n    * Onfido partners\n    * Certifications\n    * Leadership\n    * Press\n    * Contact us\n    * Airside\n  * Resources\n    * Blog\n    * Supported documents\n    * Developer hub\n    * API reference\n    * Release notes\n    * Support\n    * Sign in\n\nFollow us\n\nBack to top\n\n* * *\n\n© Onfido, 2023. All rights reserved.  \nCompany registration number: 07479524.\n\n  * Service status\n  * Privacy Policy\n  * Website and B2B Privacy Policy\n  * Security and Compliance\n  * Cookie and SDK Policy\n  * Terms of Use\n  * Anti Modern Slavery Statement\n  * Responsible Security Bug Disclosure Policy\n\nCookie Preferences Cookie Preferences Cookie Preferences Cookie Preferences\n\n  \nWe care about your privacy! This website uses cookies to improve your\nexperience, tailor content to your preferences, and analyze performance and\ntraffic on our website. We share information about use of our site with our\nsocial media, advertising and analytics partners. Cookie Policy\n\nSettings Accept\n\nYour Opt Out Preference Signal is Honored\n\n## Privacy Preference Center\n\nWhen you visit any website, it may store or retrieve information on your\nbrowser, mostly in the form of cookies. This information might be about you,\nyour preferences or your device and is mostly used to make the site work as\nyou expect it to. The information does not usually directly identify you, but\nit can give you a more personalized web experience. Because we respect your\nright to privacy, you can choose not to allow some types of cookies. Click on\nthe different category headings to find out more and change our default\nsettings. However, blocking some types of cookies may impact your experience\nof the site and the services we are able to offer.\n\nAllow All\n\n###  Manage Consent Preferences\n\n#### Strictly Necessary Cookies\n\nAlways Active\n\nThese cookies are necessary for the website to function and cannot be switched\noff in our systems. They are usually only set in response to actions made by\nyou which amount to a request for services, such as setting your privacy\npreferences, logging in or filling in forms. You can set your browser to block\nor alert you about these cookies, but some parts of the site will not then\nwork.\n\n#### Performance Cookies\n\nPerformance Cookies\n\nThese cookies allow us to count visits and traffic sources so we can measure\nand improve the performance of our site. They help us to know which pages are\nthe most and least popular and see how visitors move around the site. All\ninformation these cookies collect is aggregated and therefore anonymous. If\nyou do not allow these cookies we will not know when you have visited our\nsite, and will not be able to monitor its performance.\n\n#### Functional Cookies\n\nFunctional Cookies\n\nThese cookies enable the website to provide enhanced functionality and\npersonalisation. They may be set by us or by third party providers whose\nservices we have added to our pages. If you do not allow these cookies then\nsome or all of these services may not function properly.\n\n#### Targeting Cookies\n\nTargeting Cookies\n\nThese cookies may be set through our website by our third party advertising\npartners. They may be used by those companies to build a profile of your\ninterests and to better reach you with personalised ads and content, both on\nour own website and third-party websites, apps, and other online services\n(“Services”). Advertising cookies enable the third party ad companies to track\nyour visits to the Services, to better understand your preferences and\ninterests in order to provide you more relevant ads on behalf of us and other\ncompanies. If you do not allow Targeting Cookies, you will still see ads\nonline but they may be less relevant to you.\n\nBack Button\n\n### Cookie List\n\nSearch Icon\n\nFilter Icon\n\nClear\n\ncheckbox label label\n\nApply Cancel\n\nConsent Leg.Interest\n\ncheckbox label label\n\ncheckbox label label\n\ncheckbox label label\n\nReject All Confirm My Choices\n\n",
    "links": [
        "https://onfido.com/use-cases/kyc/us/",
        "https://onfido.com/use-cases/kyc/philippines/",
        "https://onfido.com/use-cases/kyc/",
        "https://onfido.com/use-cases/kyc/malaysia/",
        "https://onfido.com/use-cases/kyc/uk/",
        "https://onfido.com/use-cases/kyc/canada/"
    ],
    "priceAndPlans": "Not found"
}