{
    "summary": "# LexisNexis Risk Management Solutions®\n\n  * Contact Us\n  * Visit Corporate Site\n\n## Outdated Browser Version Detected\n\nWe have detected that you are using a version of Internet Explorer that is\nolder than IE 11. To safeguard the security of our clients and our data, we\nstrongly suggest you to upgrade to IE 11 or select another modern browser such\nas Microsoft Edge, Google Chrome, or Mozilla Firefox in their respective most\nrecent versions.\n\n## Welcome\n\nSign In\n\nForgot Your Password  \nSign In Help  \n\n### Sign In Help\n\n×\n\nHaving trouble signing in? Try the following solutions:\n\n  * If your User ID appears to contain the letter “O” or “L”, substitute the number 0 (zero) or 1 (one) in its place and try again. \n  * If you cannot remember your password, click Forgot Your Password to reset your password. \n\nAfter an unsuccessful attempt at signing in, a number challenge field is added\nto ensure that an automated program is not attempting to sign in. Automated\nprograms cannot read the numbers you see in the box.\n\nIf you are having difficulty with this added security, try the following\nsolutions:\n\n  * If no image appears, ensure that images are not blocked and refresh your browser. \n  * If you have difficulty seeing the numbers, click the Listen to Numbers link to hear an audio rendering of the number.  \nNote: This option requires that your computer supports MP3 audio files.\n\nIf you are still unable to sign in, contact LexisNexis® Customer Support at\n1-866-277-8407.\n\n  Close  \n\nUse of this service is subject to Terms & Conditions.\n\n**Stop fraud from crossing over into your profits.**  \nPrevent, detect and investigate with intelligent solutions from LexisNexis®.\n\n**LexisNexis Risk Management Solutions ®** quickly delivers information to\nhelp you authenticate the identities of both individuals and businesses. Our\ninnovative tools for authenticating identities, assessing risk and performing\ndue diligence will help you make informed decisions. We provide you with the\nintelligence and analytics you need to protect and grow your organization.\n\nWith comprehensive information available from thousands of sources, LexisNexis\nRisk Management Solutions is ideal for call centers, credit card processors,\nloss prevention and other departments where a person's identity or supplied\ninformation must be confirmed or investigated.\n\n## Companion Products\n\n**Extend the power of LexisNexis Risk Management Solutions® with the\nfollowing:**\n\nInstantID® \\- Prevent fraud and identity theft before they strike your\norganization.\n\nFraudPoint® \\- Assess customer risk and manage compliance regulations.\n\nLexisNexis® Red Flags Rule Report \\- Streamline investigations and perform due\ndiligence research.\n\nRisk Solutions \\- Learn about our robust solution set for Financial Services.\n\n**More Information**  \nHow can we help your company?  \nFor more information about our solutions call (800) 869-0751 or email us now.\n\n## Resources\n\n### Customer Support:\n\nCustomer & Technical:  \nEmail Product Support  \nLive Chat.\n\n### Education and Training:\n\nEmail Education & Training or Call:  \n(800) 201-6411  \nOr visit  LexisNexis® Training Center\n\n  * About Us\n  * Contact Us\n  * Products Index\n  * Site Map\n\n  * Copyright © 2023Your browser does not support JavaScript! LexisNexis Risk Solutions. \n  * Terms & Conditions\n  * Privacy Policy\n\nLogin ID\n\n"
}