{
    "summary": "News\n\nSelfkey Blog\n\nAll the latest updates from SelfKey\n\nVoyage Report\n\nSelfkey Progress Monthly Report\n\nSelfKey Newsletter\n\nGet updates straight to your inbox\n\nAbout DAO\n\nSelf Sovereign Identity\n\nOwn your data\n\nAbout SelfKey\n\nFoundation, Partners, & Careers\n\nWhitepaper\n\nOverview of SelfKey’s mission and the identity problem\n\nDAO Members\n\nMeet the people behind SelfKey DAO\n\nContact\n\nInquiries, Press Kit, & Contact Information\n\nMedia Kit\n\nLogos and media resources\n\nWallet\n\nDownload\n\nDownload Selfkey\n\nIdentity Wallet\n\nGet familiar with our ERC-20 Desktop Wallet\n\nMobile Wallet\n\nMobile version of our Identity Wallet\n\nMarketplace\n\nAccess a broad range of services\n\nDevelopers\n\nHow you can integrate with SelfKey\n\nEN\n\nEN  ZH\n\napp\n\n# SELFKEY DAO\n\nDecentralized Self-Sovereign Identity Network\n\n# SELFKEY DAO\n\nDecentralized Self-Sovereign Identity Network\n\n **SelfKey** Protocol is maintained by a DAO of **SelfKey iD** Holders.  \n  \nJoin us and help revolutionize identity management in Web3!\n\nGet SelfKey iD\n\nWhitepaper\n\n### Digital Sovereignty on Web3/Metaverse\n\nYour SelfKey ID is non-custodial and Web 3.0/Metaverse ready. You are in full\ncontrol of your data, documents and digital assets.\n\nBecome censorship-proof. Only you can delete your identity & assets, not Big\nTech.\n\n  * Securely store and manage your digital identity, KYC documents, and other digital assets including NFTs.\n  * Unlock Access to web 3.0 platforms and DeFI marketplaces\n\n### A secure wallet for your KYC data and other assets\n\nIn a world first, keep your sensitive KYC data secure in your wallet and enjoy\none-click verification for Web 3.0 Platforms, DeFi exchanges, Bank accounts\nand more.\n\n### Use your SelfKey ID to build an empire in the real world, too.\n\nStart a new business, open a new bank account, or get documents notarized\nthrough the SelfKey Marketplace. Powered by the KEY token, the SelfKey\nMarketplace provides access to a variety of services with full transparency on\ndocumentation requirements, cost, and total processing time.\n\n## Take back control of your digital identity from Big Tech, starting today\n\nThe SelfKey Identity Wallet is a free identity solution for Windows, Linux and\nMac. Get yours today!\n\nDownload the Wallet\n\nDownload the SelfKey ID App for free. Windows, Linux and Mac.\n\nComplete your SelfKey ID\n\nEasily save all the information required for a KYC process in your Wallet.\n\nOwn your digital identity\n\nUse your SelfKey ID to open a business abroad through the Incorporations\nMarketplace.\n\nDOWNLOAD THE APP\n\n## Why SelfKey is the leader of self-sovereign identity management\n\nYour data stored locally\n\nTypically data is stored on servers that are vulnerable to hacks and data\nbreaches. SelfKey operates locally, meaning your data is stored on your\ndevice. If SelfKey’s servers are hacked, your data is unaffected.\n\nThe Wallet is free\n\nTop of the range identity management solutions are very expensive and often\nhave recurring monthly costs. The SelfKey Identity Wallet on the other hand is\ncompletely free and open-source.\n\nYour digital identity is secure\n\nThe SelfKey Identity Wallet has been audited by Uncloak.io, and was designed\nto protect your privacy. You have complete ownership of your digital identity\nand your ERC tokens.\n\nAccess LWS & the Marketplace\n\nThe SelfKey Identity Wallet is much more than just a place to store your\nidentity and your tokens. It also allows you to open a business abroad through\nthe Incorporations Marketplace.\n\n### As seen in\n\n### From our blog\n\n02 Oct 2023\n\nHow to Qualify for SELF - SelfKey DAO's Bug Bounty\n\nSelfKey DAO's engagement system aims to foster an active, equitable, and fair\necosystem. And, by contributing to the DAO's well-functioning, participants\nmay have the opportunity to…\n\n29 Jun 2023\n\nSybil Attack Threats and SelfKey’s Decentralized Defense\n\nWhile decentralized systems offer greater security compared to centralized\nones, they still have their vulnerabilities, and malicious individuals\nactively seek to exploit these weaknesses. Discover the…\n\n08 Jun 2023\n\nTokenization - Could it Protect Your Digital Identity?\n\nWith the fast-paced evolution of modern technology, it's crucial that we\nunderstand the new concepts which may shape our digital future. SelfKey aims\nto provide a…\n\nREAD MORE ARTICLES\n\nSelfKey is a fast-growing DAO developing digital identity solutions. The DAO\nseeks to empower individuals and corporations to take back ownership of their\nidentity data\n\nWallet\n\nDownload  \nIdentity Wallet  \nMobile Wallet  \nMarketplace  \nFor Developers  \n\nABOUT DAO  \n\nSelf Sovereign Identity  \nAbout Selfkey  \nWhitepaper  \nDAO Members  \nContact  \nMedia Kit  \n\nNEWS  \n\nSelfKey Blog  \nSelfkey Blog  \nVoyage Report  \nNewsletter  \n\nGet updates straight to your inbox!\n\nPlease check the checkbox to indicate your consent. Your email address is\nrequired. Your email address looks incorrect. Please try again. This doesn't\nlook like a human submission. Thanks for subscribing!\n\n## Newsletter list\n\nEmail address *  \n\nSubscribe\n\nprivacy policy\n\nOpen source platform made with ❤️ by citizens of the world.\n\nTerms and Conditionsprivacy policy\n\n© 2017- 2023 by SelfKey  \n\nNews\n\nSelfkey Blog\n\nAll the latest updates from SelfKey\n\nVoyage Report\n\nSelfkey Progress Monthly Report\n\nSelfKey Newsletter\n\nGet updates straight to your inbox\n\nAbout DAO\n\nSelf Sovereign Identity\n\nOwn your data\n\nAbout SelfKey\n\nFoundation, Partners, & Careers\n\nWhitepaper\n\nOverview of SelfKey’s mission and the identity problem\n\nTeam\n\nMeet the people behind SelfKey\n\nContact\n\nInquiries, Press Kit, & Contact Information\n\nMedia Kit\n\nLogos and media resources\n\nWallet\n\nDownload\n\nDownload Selfkey\n\nIdentity Wallet\n\nGet familiar with our ERC-20 Desktop Wallet\n\nMobile Wallet\n\nMobile version of our Identity Wallet\n\nMarketplace\n\nAccess a broad range of services\n\nDevelopers\n\nHow you can integrate with SelfKey\n\napp\n\nMenu\n\n  * Chinese (China)\n\n  * English\n\nclose\n\nclosearrow-circle-o-downellipsis-vcross discordfacebook-\nfgithubinstagramlinkedin-inreddit-alientelegram-planetwitteryoutube\n\n",
    "links": [
        "https://selfkey.org/zh/:",
        "https://selfkey.org/blog/:READ MORE ARTICLES",
        "https://selfkey.org//download/:",
        "https://selfkey.org/selfkey-wallet/:",
        "https://selfkey.org//dao-members/:",
        "https://selfkey.org/:",
        "https://selfkey.org//selfkey-newsletter/:",
        "https://selfkey.org/mobile-wallet:",
        "https://selfkey.org/tokenization-could-it-protect-your-digital-identity/:Tokenization - Could it Protect Your Digital Identity?",
        "https://selfkey.org/how-to-qualify-for-self-selfkey-dao-bug-bounty/:",
        "https://selfkey.org/sybil-attack-threats-and-selfkeys-decentralized-defense/:Sybil Attack Threats and SelfKey’s Decentralized Defense",
        "https://selfkey.org/self-sovereign-identity/:",
        "https://selfkey.org//selfkey-team/:",
        "https://selfkey.org//self-sovereign-identity/:",
        "https://selfkey.org//voyage-report/:",
        "https://selfkey.org//whitepaper/:",
        "https://selfkey.org//blog/:",
        "https://selfkey.org//marketplace:",
        "https://selfkey.org/contact-us/:",
        "https://selfkey.org/marketplace:",
        "https://selfkey.org/voyage-report/:",
        "https://selfkey.org//mobile-wallet:",
        "https://selfkey.org/terms-and-conditions/:Terms and Conditions",
        "https://selfkey.org//about-dao/:",
        "https://selfkey.org//selfkey-wallet/:",
        "https://selfkey.org/whitepaper/:Whitepaper",
        "https://selfkey.org/privacy-policy/:privacy policy",
        "https://selfkey.org//contact-us/:",
        "https://selfkey.org/blog/:",
        "https://selfkey.org/selfkey-newsletter/:",
        "https://selfkey.org/press-kit/:",
        "https://selfkey.org//download/:DOWNLOAD THE APP",
        "https://selfkey.org/how-to-qualify-for-self-selfkey-dao-bug-bounty/:How to Qualify for SELF - SelfKey DAO's Bug Bounty",
        "https://selfkey.org/sybil-attack-threats-and-selfkeys-decentralized-defense/:",
        "https://selfkey.org//press-kit/:",
        "https://selfkey.org/tokenization-could-it-protect-your-digital-identity/:"
    ],
    "priceAndPlans": "Blog\n\nNews\n\nSelfkey Blog\n\nAll the latest updates from SelfKey\n\nVoyage Report\n\nSelfkey Progress Monthly Report\n\nSelfKey Newsletter\n\nGet updates straight to your inbox\n\nAbout DAO\n\nSelf Sovereign Identity\n\nOwn your data\n\nAbout SelfKey\n\nFoundation, Partners, & Careers\n\nWhitepaper\n\nOverview of SelfKey’s mission and the identity problem\n\nDAO Members\n\nMeet the people behind SelfKey DAO\n\nContact\n\nInquiries, Press Kit, & Contact Information\n\nMedia Kit\n\nLogos and media resources\n\nWallet\n\nDownload\n\nDownload Selfkey\n\nIdentity Wallet\n\nGet familiar with our ERC-20 Desktop Wallet\n\nMobile Wallet\n\nMobile version of our Identity Wallet\n\nMarketplace\n\nAccess a broad range of services\n\nDevelopers\n\nHow you can integrate with SelfKey\n\nEN\n\nEN  ZH\n\napp\n\n5 MINUTES\n\n# The SelfKey Exchanges Marketplace\n\nLearn more about the most recent addition to the SelfKey Marketplace - the\nExchanges Marketplace! In this article we walk you through our newest\naddition.\n\n13 May 2020\n\nSelfKey\n\nSelfKey Protocol is maintained by a DAO of SelfKey iD Holders. Join us and\nhelp revolutionize identity management in Web3!\n\nJOIN SELFKEY DAO\n\nYou may have noticed a new addition to the SelfKey Wallet - the Exchanges\nMarketplace! We’re delighted to bring you a comprehensive crypto exchange\nmarketplace where you can compare different exchange accounts and sign up\ninstantly.\n\nIn this article, we walk you through our newest Marketplace and all of the\ngreat exchanges that are listed. Here’s how to get started.\n\nDisclosure: Some of the links in this article are affiliate links; we may\nreceive a commission for purchases made through these links at no cost to you.\n\n# How to open a crypto exchange account\n\nWe specifically designed this process to be as easy for you, the user, as\npossible. Our aim is to provide clarity and transparency throughout the entire\nuser experience, and you’ll see how that is reflected in our process.\n\n## Step 1: Download the Wallet\n\nThe SelfKey Identity Wallet is free, open-source and designed to keep your\ntokens safe. That being said, it offers a lot more than a simple\ncryptocurrency wallet. Instead it allows you to manage your identification\ndocuments and provides access to the Self!Key Marketplace where you can open\nbank accounts, incorporate your business abroad, and more.\n\nHead over to this page and download the wallet on Windows, Linux or Mac OSX.\nYou can also download the SelfKey Wallet on your smartphone by visiting the\nabove page. Whether you’re on your computer or your phone, the wallet is free\nand light-weight, meaning you’ll thoroughly enjoy using it. Of course, you own\nyour private keys and can even access the Wallet using Ledger and Trezor.\n\n## Step 2: Set up your Wallet\n\nSetting up your wallet couldn’t be easier, but it’s a very important step. As\na result, it’s vital to make sure you do it correctly. The first thing you\nneed to do is securely store your public and private keys. As a non-custodial\nWallet, SelfKey cannot recover your private key, so make sure you don’t lose\nit.\n\n## Step 3: Complete your SelfKey ID (optional)\n\nOnce the Wallet is downloaded and your keys are securely stored, the next step\nis to set up your SelfKey ID. This is a collection of locally stored Know Your\nCustomer (KYC) information used to quickly access new service providers.\nThanks to the SelfKey ID, you can reuse the same KYC data multiple times. So\ninstead of having to go through many different sign-up processes within the\nMarketplace, you simply complete your SelfKey ID once and then use it whenever\nyou need it.\n\nThis feature will be coming soon to our Exchanges Marketplace. Once it is in\neffect, if you want to join multiple crypto exchanges, you simply complete\nyour SelfKey ID once and then use it for all registrations.\n\n## Step 4: Find your preferred exchange\n\nNow that your SelfKey ID is set up, it’s time to head to the SelfKey\nMarketplace and check out the different crypto exchanges on offer. When logged\ninto the Wallet, click on the Menu in the top right of your screen and select\n“Marketplace”.\n\nSix different Marketplaces should now appear, with one clearly being for\nexchanges. Click on the button to see a screen similar to this one:\n\nTo learn more about each, make sure to click on “Details” and peruse the\nindividual listing pages. We’ve endeavoured to give you all the relevant\ninformation, but please make sure to do your own research as well.\n\nHere you can see an example for one of our exchanges, Bitpanda:\n\nAs you will be able to see, information such as exchange location, fees, if\nKYC is required, excluded residents, if fiat currencies are accepted, and\nmore, are all clearly laid out. This way it’s easy to see which exchanges meet\nany criteria you have, and which exchanges you are eligible to join.\n\n## Step 5: Sign up\n\nOnce you’ve decided which exchange you’d like to join, simply click on the\n“Sign Up” button on the top right. From there, you’ll be directed to the\nexchange’s website where you’ll need to register for a new account and follow\nthe instructions they provide. You may need to confirm your identity for KYC\npurposes, so make sure to have a piece of government-issued ID on hand.\n\nAnd that’s it, you’re all signed up for your new crypto account!\n\n# Featured crypto exchanges\n\nWe have over twenty different crypto exchanges listed in our Exchanges\nMarketplace. While we recommend that you take a look at all of the ones we\nhave on offer, here are some of our featured crypto exchanges:\n\n## Hotbit\n\nAfter a successful launch in 2018, Hotbit has been steadily growing. The\ncrypto exchange offers one of the largest markets for trading, with over 500\ndifferent trading pairs available. Hotbit boasts over 500,000 active users\nfrom over 170 different countries. Hotbit is registered in both Estonia and\nHong Kong. Fees are lower than average for both takers and makers at 0.1%\n\n## WhiteBIT\n\nWhiteBIT is a centralized crypto exchange based in Estonia that offers not\nonly crypto-to-crypto transactions, but also crypto-to-fiat. Having both\nEuropean Exchange and Custody licenses, the exchange meets all AML and KYC\nrequirements. Fiat currency in USD, EUR, RUB, and UAH are supported. Fees for\nmakers and takers are relatively low at 0.1%\n\n## p2pb2b\n\nOperating out of Estonia and licensed by the relevant authorities in the EU,\np2pb2b is an advanced cryptocurrency exchange that is all about its users. The\nexchange offers 24/7 support in eight different languages, and has an\noptimized user interface to make your experience more pleasant. The exchange\nhas a strong focus on security: over 95% of user assets are stored in cold\nwallets, making them far less vulnerable to hacks.\n\n## ProBit\n\nBased in South Korea, ProBit offers enhanced security and a cutting edge\ntrading engine. The exchange only lists what it deems to be qualified and\ndeserving cryptocurrency projects, and reportedly has an order matching speed\nof over 1.5 million orders per second. ProBit offers a totally customizable\ndashboard, which makes it easy to use for beginners and perfect for\nprofessional traders too.\n\n## ExMarkets\n\nWhile ExMarkets is smaller than some of the other exchanges, it offers a great\nexperience to its users. Powered by a proprietary, state-of-the-art trading\nengine, users can set up an account in minutes and begin buying and selling\ncrypto and some fiat currencies. Users can also access the token sales of\npromising blockchain and crypto projects through ExMarket’s IEO LaunchPad.\n\n## SimpleSwap\n\nSimpleSwap is an instant cryptocurrency exchange that allows customers to swap\ncrypto in an easy way. The platform is free from sign-up and supports more\nthan 300 cryptocurrencies. SimpleSwap provides two exchange types: floating\nand fixed rate. SimpleSwap has made the cryptocurrency exchange process\nsimple, safe and comfortable\n\n## Bitpanda\n\nBased in Austria, Bitpanda is a fintech platform that offers a number of\nservices including the Bitpanda Global Exchange. The Bitpanda Global Exchange\nalready has over one million users and offers state-of-the-art performance\nwith a strong focus on security to ensure that your crypto stays safe. The\nexchange offers a wide range of payment and payout providers for added\nflexibility. Bitpanda’s advanced trading platform and digital asset exchange\nis perfect for experienced traders, professionals and institutions.\n\n## Tokens.net\n\nBased in the United Kingdom, Tokens.net is a cryptocurrency exchange operating\nin a stable and reliable business environment managed by industry pioneers\nwith proven track records. The Tokens.net platform represents a distinctive\ntrading engine with a user-friendly interface, assuring 100% trading volume\ntransparency and fast execution. The primary function of the exchange’s native\nDTR tokens is providing real-time information on the number of transactions\nand transparent trading volume.\n\n## Zipmex\n\nHeadquartered in Singapore, Zipmex currently operates in Indonesia and\nAustralia and recently launched operations in Thailand. The crypto exchange\nfocuses on fast trades, low buying prices, speed, and high liquidity. The\nexchange has been engineered to deal with high trading volumes, resulting in\nlow prices for users.\n\n## Mine Digital\n\nLaunched in 2019 with offices in Brisbane and Sydney, Mine Digital is a\ndigital asset exchange and brokerage firm. The brokerage side of Mine Digital\nprovides tailored advice and access to investment opportunities thanks to its\nhighly experienced team. The Mine Digital exchange allows users to trade\ncrypto and fiat currency pairings on a state-of-the-art platform, with low\nfixed fees and insured custody for added security.\n\n# Conclusion - The SelfKey Cryptocurrency Exchange Marketplace\n\nAs you can see, signing up for a crypto exchange account through our Exchange\nMarketplace is a simple and straightforward process. We encourage you to\nexperience the marketplace for yourself and check out the many exchanges we\nhave on offer. We’re certain that we’ve got an exchange that meets all your\ncriteria!\n\nAs always, we advise you to do your own research about any crypto exchange\nthat you’d like to sign up with. We’ll continue to add more crypto exchanges\nover time, so keep an eye out for new announcements regarding the Exchanges\nMarketplace.\n\nStay Informed with Important Updates!\n\nGet the latest news on the official SelfKey newsletter\n\nPlease check the checkbox to indicate your consent. Your email address is\nrequired. Your email address looks incorrect. Please try again. This doesn't\nlook like a human submission. Thanks for subscribing!\n\n## Newsletter list\n\nEmail address *  \n\nSubscribe\n\nCryptocurrency, Cryptocurrency Exchange, SelfKey Marketplace\n\n### You might also like\n\n30 Apr 2020\n\nIntroduction to Cryptocurrency Lending\n\nCryptocurrency lending is a rapidly evolving and endlessly intriguing arena in\nthe field of distributed ledger technology. Here we give you an overview of\nthe ecosystem,…\n\n21 Nov 2019\n\nWhat Happens to Your Personal Information Once You've Been Hacked?\n\nWe've probably all been the victim of a data breach or hack at some point in\nour lives, but what happens to your personal information after…\n\n05 Dec 2019\n\nWhat is Federated Identity Management?\n\nFederated identity management is yet another emerging tool that could\nrevolutionize digital identity and data management. Here's everything you need\nto know.\n\nREAD MORE ARTICLES\n\nJOIN SELFKEY DAO\n\nSelfKey is a fast-growing DAO developing digital identity solutions. The DAO\nseeks to empower individuals and corporations to take back ownership of their\nidentity data\n\nWallet\n\nDownload  \nIdentity Wallet  \nMobile Wallet  \nMarketplace  \nFor Developers  \n\nABOUT DAO  \n\nSelf Sovereign Identity  \nAbout Selfkey  \nWhitepaper  \nDAO Members  \nContact  \nMedia Kit  \n\nNEWS  \n\nSelfKey Blog  \nSelfkey Blog  \nVoyage Report  \nNewsletter  \n\nGet updates straight to your inbox!\n\nPlease check the checkbox to indicate your consent. Your email address is\nrequired. Your email address looks incorrect. Please try again. This doesn't\nlook like a human submission. Thanks for subscribing!\n\n## Newsletter list\n\nEmail address *  \n\nSubscribe\n\nprivacy policy\n\nOpen source platform made with ❤️ by citizens of the world.\n\nTerms and Conditionsprivacy policy\n\n© 2017- 2023 by SelfKey  \n\nNews\n\nSelfkey Blog\n\nAll the latest updates from SelfKey\n\nVoyage Report\n\nSelfkey Progress Monthly Report\n\nSelfKey Newsletter\n\nGet updates straight to your inbox\n\nAbout DAO\n\nSelf Sovereign Identity\n\nOwn your data\n\nAbout SelfKey\n\nFoundation, Partners, & Careers\n\nWhitepaper\n\nOverview of SelfKey’s mission and the identity problem\n\nTeam\n\nMeet the people behind SelfKey\n\nContact\n\nInquiries, Press Kit, & Contact Information\n\nMedia Kit\n\nLogos and media resources\n\nWallet\n\nDownload\n\nDownload Selfkey\n\nIdentity Wallet\n\nGet familiar with our ERC-20 Desktop Wallet\n\nMobile Wallet\n\nMobile version of our Identity Wallet\n\nMarketplace\n\nAccess a broad range of services\n\nDevelopers\n\nHow you can integrate with SelfKey\n\napp\n\nMenu\n\n  * Chinese (China)\n\n  * English\n\nclose\n\nclosearrow-circle-o-downellipsis-vclockcross discordfacebook-\nfgithubinstagramlinkedin-inreddit-alientelegram-planetwitteryoutube\n\n"
}