{
    "summary": "Powered by Cookiebot\n\n  * Consent\n  * Details\n  * [#IABV2SETTINGS#]\n  * About\n\n## This website uses cookies\n\nWe use cookies to personalise content and ads, to provide social media\nfeatures and to analyse our traffic. We also share information about your use\nof our site with our social media, advertising and analytics partners who may\ncombine it with other information that you’ve provided to them or that they’ve\ncollected from your use of their services.\n\nConsent Selection\n\nNecessary\n\nPreferences\n\nStatistics\n\nMarketing\n\nShow details\n\n  * Necessary  12\n\nNecessary cookies help make a website usable by enabling basic functions like\npage navigation and access to secure areas of the website. The website cannot\nfunction properly without these cookies.\n\n    * Cookiebot\n\n1\n\nLearn more about this provider\n\nCookieConsentStores the user's cookie consent state for the current domain\n\n **Expiry** : 1 year **Type** : HTTP\n\n    * Google\n\n4\n\nLearn more about this provider\n\n_GRECAPTCHAThis cookie is used to distinguish between humans and bots. This is\nbeneficial for the website, in order to make valid reports on the use of their\nwebsite.\n\n **Expiry** : 180 days **Type** : HTTP\n\nrc::aThis cookie is used to distinguish between humans and bots. This is\nbeneficial for the website, in order to make valid reports on the use of their\nwebsite.\n\n **Expiry** : Persistent **Type** : HTML\n\nrc::bThis cookie is used to distinguish between humans and bots.\n\n**Expiry** : Session **Type** : HTML\n\nrc::cThis cookie is used to distinguish between humans and bots.\n\n**Expiry** : Session **Type** : HTML\n\n    * LinkedIn\n\n2\n\nLearn more about this provider\n\nli_gcStores the user's cookie consent state for the current domain\n\n **Expiry** : 180 days **Type** : HTTP\n\nbscookieThis cookie is used to identify the visitor through an application.\nThis allows the visitor to login to a website through their LinkedIn\napplication for example.\n\n **Expiry** : 1 year **Type** : HTTP\n\n    * YouTube\n\n1\n\nLearn more about this provider\n\nCONSENTUsed to detect if the visitor has accepted the marketing category in\nthe cookie banner. This cookie is necessary for GDPR-compliance of the\nwebsite.\n\n**Expiry** : 2 years **Type** : HTTP\n\n    * hubspot.com  \nledger.com  \nwww.coincover.com  \n\n3\n\n__cf_bm [x3]This cookie is used to distinguish between humans and bots. This\nis beneficial for the website, in order to make valid reports on the use of\ntheir website.\n\n **Expiry** : 1 day **Type** : HTTP\n\n    * www.coincover.com\n\n1\n\n__cfruidThis cookie is a part of the services provided by Cloudflare -\nIncluding load-balancing, deliverance of website content and serving DNS\nconnection for website operators.\n\n**Expiry** : Session **Type** : HTTP\n\n  * Preferences  1\n\nPreference cookies enable a website to remember information that changes the\nway the website behaves or looks, like your preferred language or the region\nthat you are in.\n\n    * LinkedIn\n\n1\n\nLearn more about this provider\n\nlidcRegisters which server-cluster is serving the visitor. This is used in\ncontext with load balancing, in order to optimize user experience.\n\n**Expiry** : 1 day **Type** : HTTP\n\n  * Statistics  26\n\nStatistic cookies help website owners to understand how visitors interact with\nwebsites by collecting and reporting information anonymously.\n\n    * Amazon\n\n1\n\nLearn more about this provider\n\n_uc_current_session Used to determine if your session is active or not.\n\n **Expiry** : 1 day **Type** : HTTP\n\n    * Google\n\n6\n\nLearn more about this provider\n\n_gaRegisters a unique ID that is used to generate statistical data on how the\nvisitor uses the website.\n\n **Expiry** : 2 years **Type** : HTTP\n\n_ga_#Used by Google Analytics to collect data on the number of times a user\nhas visited the website as well as dates for the first and most recent visit.\n\n**Expiry** : 2 years **Type** : HTTP\n\n_gatUsed by Google Analytics to throttle request rate\n\n **Expiry** : 1 day **Type** : HTTP\n\n_gidRegisters a unique ID that is used to generate statistical data on how the\nvisitor uses the website.\n\n **Expiry** : 1 day **Type** : HTTP\n\ncollectUsed to send data to Google Analytics about the visitor's device and\nbehavior. Tracks the visitor across devices and marketing channels.\n\n **Expiry** : Session **Type** : Pixel\n\ntdRegisters statistical data on users' behaviour on the website. Used for\ninternal analytics by the website operator.\n\n**Expiry** : Session **Type** : Pixel\n\n    * Hotjar\n\n10\n\nLearn more about this provider\n\n_hjAbsoluteSessionInProgressThis cookie is used to count how many times a\nwebsite has been visited by different visitors - this is done by assigning the\nvisitor an ID, so the visitor does not get registered twice.\n\n **Expiry** : 1 day **Type** : HTTP\n\n_hjFirstSeenThis cookie is used to determine if the visitor has visited the\nwebsite before, or if it is a new visitor on the website.\n\n **Expiry** : 1 day **Type** : HTTP\n\n_hjIncludedInSessionSample_#Collects statistics on the visitor's visits to the\nwebsite, such as the number of visits, average time spent on the website and\nwhat pages have been read.\n\n **Expiry** : 1 day **Type** : HTTP\n\n_hjSession_#Collects statistics on the visitor's visits to the website, such\nas the number of visits, average time spent on the website and what pages have\nbeen read.\n\n **Expiry** : 1 day **Type** : HTTP\n\n_hjSessionUser_#Collects statistics on the visitor's visits to the website,\nsuch as the number of visits, average time spent on the website and what pages\nhave been read.\n\n **Expiry** : 1 year **Type** : HTTP\n\n_hjTLDTestRegisters statistical data on users' behaviour on the website. Used\nfor internal analytics by the website operator.\n\n**Expiry** : Session **Type** : HTTP\n\n_hjRecordingEnabledCollects data on the user’s navigation and behavior on the\nwebsite. This is used to compile statistical reports and heatmaps for the\nwebsite owner.\n\n **Expiry** : Session **Type** : HTML\n\n_hjRecordingLastActivitySets a unique ID for the session. This allows the\nwebsite to obtain data on visitor behaviour for statistical purposes.\n\n **Expiry** : Session **Type** : HTML\n\nhjActiveViewportIdsThis cookie contains an ID string on the current session.\nThis contains non-personal information on what subpages the visitor enters –\nthis information is used to optimize the visitor's experience.\n\n **Expiry** : Persistent **Type** : HTML\n\nhjViewportIdSaves the user's screen size in order to adjust the size of images\non the website.\n\n **Expiry** : Session **Type** : HTML\n\n    * Hubspot\n\n4\n\nLearn more about this provider\n\n__hsscIdentifies if the cookie data needs to be updated in the visitor's\nbrowser.\n\n **Expiry** : 1 day **Type** : HTTP\n\n__hssrcUsed to recognise the visitor's browser upon reentry on the website.\n\n **Expiry** : Session **Type** : HTTP\n\n__hstcSets a unique ID for the session. This allows the website to obtain data\non visitor behaviour for statistical purposes.\n\n **Expiry** : 180 days **Type** : HTTP\n\nhubspotutkSets a unique ID for the session. This allows the website to obtain\ndata on visitor behaviour for statistical purposes.\n\n **Expiry** : 180 days **Type** : HTTP\n\n    * LinkedIn\n\n2\n\nLearn more about this provider\n\nAnalyticsSyncHistoryUsed in connection with data-synchronization with third-\nparty analysis service.\n\n**Expiry** : 30 days **Type** : HTTP\n\nln_orRegisters statistical data on users' behaviour on the website. Used for\ninternal analytics by the website operator.\n\n**Expiry** : 1 day **Type** : HTTP\n\n    * SalesLoft\n\n2\n\nLearn more about this provider\n\nsliguidContains an visitor ID - This is used to track visitors' navigation and\ninteraction on the website for internal website-optimization.\n\n**Expiry** : 1 year **Type** : HTTP\n\nslirequestedContains an visitor ID - This is used to track visitors'\nnavigation and interaction on the website for internal website-optimization.\n\n**Expiry** : 1 year **Type** : HTTP\n\n    * Twitter Inc.\n\n1\n\nLearn more about this provider\n\npersonalization_idThis cookie is set by Twitter - The cookie allows the\nvisitor to share content from the website onto their Twitter profile.\n\n**Expiry** : 400 days **Type** : HTTP\n\n  * Marketing  34\n\nMarketing cookies are used to track visitors across websites. The intention is\nto display ads that are relevant and engaging for the individual user and\nthereby more valuable for publishers and third party advertisers.\n\n    * Meta Platforms, Inc.\n\n3\n\nLearn more about this provider\n\n_fbpUsed by Facebook to deliver a series of advertisement products such as\nreal time bidding from third party advertisers.\n\n **Expiry** : 3 months **Type** : HTTP\n\nlastExternalReferrerDetects how the user reached the website by registering\ntheir last URL-address.\n\n **Expiry** : Persistent **Type** : HTML\n\nlastExternalReferrerTimeDetects how the user reached the website by\nregistering their last URL-address.\n\n **Expiry** : Persistent **Type** : HTML\n\n    * Amazon\n\n4\n\nLearn more about this provider\n\n_uc_initial_landing_pageStores visitors' navigation by registering landing\npages - This allows the website to present relevant products and/or measure\ntheir advertisement efficiency on other websites.\n\n**Expiry** : 1 year **Type** : HTTP\n\n_uc_last_referrerRegisters how the user has reached the website to enable pay-\nout of referral commission fees to partners.\n\n **Expiry** : 1 year **Type** : HTTP\n\n_uc_referrerRegisters how the user has reached the website to enable pay-out\nof referral commission fees to partners.\n\n **Expiry** : 1 year **Type** : HTTP\n\n_uc_visitsRegisters data on visitors from multiple visits and on multiple\nwebsites. This information is used to measure the efficiency of advertisement\non websites.\n\n**Expiry** : 1 year **Type** : HTTP\n\n    * Google\n\n2\n\nLearn more about this provider\n\nads/ga-audiencesUsed by Google AdWords to re-engage visitors that are likely\nto convert to customers based on the visitor's online behaviour across\nwebsites.\n\n **Expiry** : Session **Type** : Pixel\n\nrc::fThis cookie is used to distinguish between humans and bots.\n\n**Expiry** : Persistent **Type** : HTML\n\n    * Hubspot\n\n1\n\nLearn more about this provider\n\n__ptq.gifSends data to the marketing platform Hubspot about the visitor's\ndevice and behaviour. Tracks the visitor across devices and marketing\nchannels.\n\n **Expiry** : Session **Type** : Pixel\n\n    * LinkedIn\n\n3\n\nLearn more about this provider\n\nbcookieUsed by the social networking service, LinkedIn, for tracking the use\nof embedded services.\n\n **Expiry** : 1 year **Type** : HTTP\n\nli_sugrCollects data on user behaviour and interaction in order to optimize\nthe website and make advertisement on the website more relevant.\n\n**Expiry** : 3 months **Type** : HTTP\n\nUserMatchHistoryEnsures visitor browsing-security by preventing cross-site\nrequest forgery. This cookie is essential for the security of the website and\nvisitor.\n\n**Expiry** : 30 days **Type** : HTTP\n\n    * SalesLoft\n\n1\n\nLearn more about this provider\n\nsliregRegisters user behaviour and navigation on the website, and any\ninteraction with active campaigns. This is used for optimizing advertisement\nand for efficient retargeting.\n\n**Expiry** : 7 days **Type** : HTTP\n\n    * Salesloft\n\n1\n\nLearn more about this provider\n\nsite_identityCollects data on user behaviour and interaction in order to\noptimize the website and make advertisement on the website more relevant.\n\n**Expiry** : 1 year **Type** : HTTP\n\n    * Twitter Inc.\n\n3\n\nLearn more about this provider\n\ni/adsct [x2]The cookie is used by Twitter.com in order to determine the number\nof visitors accessing the website through Twitter advertisement content.\n\n**Expiry** : Session **Type** : Pixel\n\nmuc_adsCollects data on user behaviour and interaction in order to optimize\nthe website and make advertisement on the website more relevant.\n\n**Expiry** : 400 days **Type** : HTTP\n\n    * YouTube\n\n16\n\nLearn more about this provider\n\nLAST_RESULT_ENTRY_KEYUsed to track user’s interaction with embedded content.\n\n **Expiry** : Session **Type** : HTTP\n\nLogsDatabaseV2:V#||LogsRequestsStorePending\n\n **Expiry** : Persistent **Type** : IDB\n\nremote_sidNecessary for the implementation and functionality of YouTube video-\ncontent on the website.\n\n**Expiry** : Session **Type** : HTTP\n\nTESTCOOKIESENABLEDUsed to track user’s interaction with embedded content.\n\n **Expiry** : 1 day **Type** : HTTP\n\nVISITOR_INFO1_LIVEPending\n\n **Expiry** : 180 days **Type** : HTTP\n\nVISITOR_PRIVACY_METADATAPending\n\n **Expiry** : 180 days **Type** : HTTP\n\nYSCPending\n\n **Expiry** : Session **Type** : HTTP\n\nytidb::LAST_RESULT_ENTRY_KEYUsed to track user’s interaction with embedded\ncontent.\n\n **Expiry** : Persistent **Type** : HTML\n\nYtIdbMeta#databasesUsed to track user’s interaction with embedded content.\n\n **Expiry** : Persistent **Type** : IDB\n\nyt-remote-cast-availableStores the user's video player preferences using\nembedded YouTube video\n\n **Expiry** : Session **Type** : HTML\n\nyt-remote-cast-installedStores the user's video player preferences using\nembedded YouTube video\n\n **Expiry** : Session **Type** : HTML\n\nyt-remote-connected-devicesStores the user's video player preferences using\nembedded YouTube video\n\n **Expiry** : Persistent **Type** : HTML\n\nyt-remote-device-idStores the user's video player preferences using embedded\nYouTube video\n\n **Expiry** : Persistent **Type** : HTML\n\nyt-remote-fast-check-periodStores the user's video player preferences using\nembedded YouTube video\n\n **Expiry** : Session **Type** : HTML\n\nyt-remote-session-appStores the user's video player preferences using embedded\nYouTube video\n\n **Expiry** : Session **Type** : HTML\n\nyt-remote-session-nameStores the user's video player preferences using\nembedded YouTube video\n\n **Expiry** : Session **Type** : HTML\n\n  * Unclassified 0\n\nUnclassified cookies are cookies that we are in the process of classifying,\ntogether with the providers of individual cookies.\n\nWe do not use cookies of this type.\n\nCross-domain consent[#BULK_CONSENT_DOMAINS_COUNT#] [#BULK_CONSENT_TITLE#]\n\nList of domains your consent applies to: [#BULK_CONSENT_DOMAINS#]\n\nCookie declaration last updated on 10/6/23 by Cookiebot\n\n## [#IABV2_TITLE#]\n\n[#IABV2_BODY_INTRO#]\n\n[#IABV2_BODY_LEGITIMATE_INTEREST_INTRO#]\n\n[#IABV2_BODY_PREFERENCE_INTRO#]\n\n[#IABV2_LABEL_PURPOSES#]\n\n[#IABV2_BODY_PURPOSES_INTRO#]\n\n[#IABV2_BODY_PURPOSES#]\n\n[#IABV2_LABEL_FEATURES#]\n\n[#IABV2_BODY_FEATURES_INTRO#]\n\n[#IABV2_BODY_FEATURES#]\n\n[#IABV2_LABEL_PARTNERS#]\n\n[#IABV2_BODY_PARTNERS_INTRO#]\n\n[#IABV2_BODY_PARTNERS#]\n\nCookies are small text files that can be used by websites to make a user's\nexperience more efficient.  \n  \nThe law states that we can store cookies on your device if they are strictly\nnecessary for the operation of this site. For all other types of cookies we\nneed your permission.  \n  \nThis site uses different types of cookies. Some cookies are placed by third\nparty services that appear on our pages.  \n  \nYou can at any time change or withdraw your consent from the Cookie\nDeclaration on our website.  \n  \nLearn more about who we are, how you can contact us and how we process\npersonal data in our Privacy Policy.  \n  \nPlease state your consent ID and date when you contact us regarding your\nconsent.\n\nDo not sell or share my personal information\n\nDeny Allow selection Customize\n\nAllow all\n\nPowered by Cookiebot by Usercentrics\n\nSkip to content\n\n  * Products \n\n__\n\nAccess Protection\n\nAsset Protection\n\nSeed Phrase Protection\n\n  * Solutions \n\n__\n\nInstitutional Crypto Services\n\nExchanges\n\nInfrastructure and Development\n\nCustody and Wallet Services\n\n  * Knowledge Hub \n\n__\n\nAssets we protect\n\nBlog\n\nFAQs\n\n2023 Consumer Research\n\n  * Company \n\n__\n\nAbout us\n\nCulture at Coincover\n\nCareers ↗\n\n  * Developers \n\nContact us\n\n  * Products \n\n__\n\nAccess Protection\n\nAsset Protection\n\nSeed Phrase Protection\n\n  * Solutions \n\n__\n\nInstitutional Crypto Services\n\nExchanges\n\nInfrastructure and Development\n\nCustody and Wallet Services\n\n  * Knowledge Hub \n\n__\n\nAssets we protect\n\nBlog\n\nFAQs\n\n2023 Consumer Research\n\n  * Company \n\n__\n\nAbout us\n\nCulture at Coincover\n\nCareers ↗\n\n  * Developers \n\nContact us\n\nNew research from over 16,000 consumers - Download now __\n\n# The Blockchain Protection Company\n\nCreating a safe ecosystem that enables innovation without constraints.\n\nGet in touch\n\n##  300+\n\nPartners worldwide\n\n##  $30bn\n\nTransactions checked\n\n##  5m\n\nProtected crypto wallets\n\n##  Protection against hackers, fraud, and human error\n\n####  Trusted expert protection\n\nWe've done the heavy lifting so you can focus on what matters most to you.\nAccess cutting-edge blockchain protection solutions that integrate seamlessly\nwith your business operations. Our global regulatory insights and governance\nensure you’re kept up to date with the ever-changing landscape.\n\n####  Seamless integration\n\nBuild the confidence needed to operate without fear. Coincover ensures that\neveryone is protected when interacting with and benefitting from blockchain\ntechnology. We've made our products as seamless and as accessible as possible.\nOur technical integrations and global partner network keep you and your\ncustomers safe, without friction.\n\n####  Grow without constraints\n\nOur products offer complete protection, providing the safety net you need to\ngrow without fear. Coincover safeguards you and your customers to protect\nassets from hacking, lost access, and human error. Grow without constraints to\nchallenge the status quo and fight for secure mass crypto adoption.\n\n##  Complete blockchain protection\n\n###  Access Protection\n\nLosing access to digital assets is a genuine concern. Coincover’s Access\nProtection service restores access if disaster strikes. Our encrypted,\nmilitary-grade storage helps you rapidly and securely recover what’s yours.\n\nLearn more\n\n###  Asset Protection\n\nCoincover protects businesses and their customers from malicious hacking and\ntheft by proactively screening and protecting transactions. Our technology is\nunderwritten at Lloyds of London, so we may be able to compensate you if loss\ndoes occur.\n\nLearn more\n\n###  Innovate with confidence - Protected by Coincover\n\nChampioning mass adoption of blockchain technology by addressing the most\nsignificant barrier: trust. Coincover strengthens your brand and reputation\nsupporting you to become a safety advocate. Protect users from the dynamic\nblockchain technology threat landscape. Build the confidence needed to foster\ninnovation and build for the future, not just the now.\n\nContact the team\n\n#####  “Our partnership with Coincover provides our customers with an\nadditional layer of security in the event that our customers lose access to\nall their key shares. When used in combination with self-storage, our\ncustomers help ensure business continuity, even in the face of market\ndisruption.”\n\n**Adam Levine**  \nVP, Head of Corporate Strategy\n\n##  Protecting you and your customers\n\n##\n\n__\n\n__\n\n#####  Exchanges\n\nSpearhead the future of mass digital adoption by promoting trust and safety.\n\n#####  Custody and Wallet Services\n\nMake lost access a concern of the past with military-grade Access Protection.\n\n#####  Infrastructure and Development\n\nProvide your customers with the additional layers of protection they need to\nbuild trust.\n\n#####  Institutional Crypto Services\n\nDesigned for Asset Managers, mitigate against a single point of failure and\nrisk of lost access funds.\n\n__\n\n__\n\n#####  Trusted by\n\n###  Protected assets\n\nWe protect most major cryptocurrencies, including Bitcoin (BTC), Ether (ETH)\nand all ERC-20 standard tokens.\n\nFind out more\n\n##  Build something bigger with Coincover\n\n##### We're growing, and we're always on the hunt for great talent. Apply now\nto protect the next financial revolution.\n\nExplore open roles\n\n######  The blockchain protection company\n\nGet Started\n\n  * Products\n    * Access Protection\n    * Asset Protection\n    * Seed Phrase Protection \n    * Developers __\n  * Solutions\n    * Institutional Crypto Services\n    * Exchanges\n    * Infrastructure and Development\n    * Custody and Wallet Services\n  * Company\n    * About us\n    * Our Culture\n    * Careers ↗\n    * Blog\n    * Assets we Protect\n    * FAQs\n  * Legal\n    * Terms of Use\n    * Privacy Policy\n    * Cookie Policy\n    * Modern Slavery Statement\n\nDigital Asset Services Ltd (trading as Coincover) is incorporated in England\nand Wales with registered number 11356137 whose registered office is at\nCapital Building, Tyndall Street, Cardiff, Wales, CF10 4AZ, and‍ is an\nappointed representative of Costero Brokers Limited for insurance distribution\nactivities. Costero Brokers Limited is authorised and regulated by the\nFinancial Conduct Authority with firm reference number 309528. You can check\nthis via the Financial Services Register at https://register.fca.org.uk\n\n",
    "links": [
        "https://www.coincover.com/access-protection?hsLang=en:",
        "https://www.coincover.com/securing-the-future-of-cryptocurrencies?hsLang=en:",
        "https://www.coincover.com/infrastructure-and-development?hsLang=en:\n                            Infrastructure and Development\n                          ",
        "https://www.coincover.com/asset-protection:Asset Protection",
        "https://www.coincover.com/cookie-policy:Cookie Policy",
        "https://www.coincover.com/assets-we-protect?hsLang=en:",
        "https://www.coincover.com/assets-we-protect?hsLang=en:\n                            Assets we protect\n                          ",
        "https://www.coincover.com/institutional-crypto-services?hsLang=en:\n                            Institutional Crypto Services\n                          ",
        "https://www.coincover.com/privacy-policy:Privacy Policy",
        "https://www.coincover.com/faq:FAQs",
        "https://www.coincover.com/culture?hsLang=en:\n                            Culture at Coincover\n                          ",
        "https://www.coincover.com/faq?hsLang=en:\n                            FAQs\n                          ",
        "https://www.coincover.com/about?hsLang=en:\n                            About us\n                          ",
        "https://www.coincover.com/access-protection?hsLang=en:\n                            Access Protection\n                          ",
        "https://www.coincover.com/seed-phrase-protection?hsLang=en:",
        "https://www.coincover.com/contact?hsLang=en:\n      Get Started\n    ",
        "https://www.coincover.com/blog:Blog",
        "https://www.coincover.com/blog?hsLang=en:",
        "https://www.coincover.com/culture?hsLang=en:",
        "https://www.coincover.com/exchanges?hsLang=en:",
        "https://www.coincover.com//?hsLang=en:",
        "https://www.coincover.com/about:About us",
        "https://www.coincover.com/institutional-crypto-services:Institutional Crypto Services",
        "https://www.coincover.com/access-protection:Access Protection",
        "https://www.coincover.com/assets-we-protect:Assets we Protect",
        "https://www.coincover.com/contact?hsLang=en:\n      Contact us\n    ",
        "https://www.coincover.com/modern-slavery-statement:Modern Slavery Statement",
        "https://www.coincover.com/wallets?hsLang=en:\n                            Custody and Wallet Services\n                          ",
        "https://www.coincover.com/institutional-crypto-services?hsLang=en:",
        "https://www.coincover.com/asset-protection?hsLang=en:",
        "https://www.coincover.com/culture:Our Culture",
        "https://www.coincover.com/wallets?hsLang=en:",
        "https://www.coincover.com/infrastructure-and-development?hsLang=en:",
        "https://www.coincover.com/seed-phrase-protection?hsLang=en:\n                            Seed Phrase Protection \n                          ",
        "https://www.coincover.com/blog?hsLang=en:\n                            Blog\n                          ",
        "https://www.coincover.com/securing-the-future-of-cryptocurrencies?hsLang=en:\n                            2023 Consumer Research\n                          ",
        "https://www.coincover.com/exchanges?hsLang=en:\n                            Exchanges \n                          ",
        "https://www.coincover.com/seed-phrase-protection:Seed Phrase Protection ",
        "https://www.coincover.com/asset-protection?hsLang=en:\n                            Asset Protection\n                          ",
        "https://www.coincover.com/wallets:Custody and Wallet Services",
        "https://www.coincover.com/infrastructure-and-development:Infrastructure and Development",
        "https://www.coincover.com/faq?hsLang=en:",
        "https://www.coincover.com/exchanges:Exchanges",
        "https://www.coincover.com/terms-of-use:Terms of Use",
        "https://www.coincover.com///www.coincover.com/?hsLang=en:",
        "https://www.coincover.com/about?hsLang=en:"
    ],
    "priceAndPlans": "Skip to content\n\n  * Products \n\n__\n\nAccess Protection\n\nAsset Protection\n\nSeed Phrase Protection\n\n  * Solutions \n\n__\n\nInstitutional Crypto Services\n\nExchanges\n\nInfrastructure and Development\n\nCustody and Wallet Services\n\n  * Knowledge Hub \n\n__\n\nAssets we protect\n\nBlog\n\nFAQs\n\n2023 Consumer Research\n\n  * Company \n\n__\n\nAbout us\n\nCulture at Coincover\n\nCareers ↗\n\n  * Developers \n\nContact us\n\n  * Products \n\n__\n\nAccess Protection\n\nAsset Protection\n\nSeed Phrase Protection\n\n  * Solutions \n\n__\n\nInstitutional Crypto Services\n\nExchanges\n\nInfrastructure and Development\n\nCustody and Wallet Services\n\n  * Knowledge Hub \n\n__\n\nAssets we protect\n\nBlog\n\nFAQs\n\n2023 Consumer Research\n\n  * Company \n\n__\n\nAbout us\n\nCulture at Coincover\n\nCareers ↗\n\n  * Developers \n\nContact us\n\n### 404, page not found\n\n###### Something went wrong and the page you’re looking for cannot be found.\n\nGo Home\n\n######  The blockchain protection company\n\nGet Started\n\n  * Products\n    * Access Protection\n    * Asset Protection\n    * Seed Phrase Protection \n    * Developers __\n  * Solutions\n    * Institutional Crypto Services\n    * Exchanges\n    * Infrastructure and Development\n    * Custody and Wallet Services\n  * Company\n    * About us\n    * Our Culture\n    * Careers ↗\n    * Blog\n    * Assets we Protect\n    * FAQs\n  * Legal\n    * Terms of Use\n    * Privacy Policy\n    * Cookie Policy\n    * Modern Slavery Statement\n\nDigital Asset Services Ltd (trading as Coincover) is incorporated in England\nand Wales with registered number 11356137 whose registered office is at\nCapital Building, Tyndall Street, Cardiff, Wales, CF10 4AZ, and‍ is an\nappointed representative of Costero Brokers Limited for insurance distribution\nactivities. Costero Brokers Limited is authorised and regulated by the\nFinancial Conduct Authority with firm reference number 309528. You can check\nthis via the Financial Services Register at https://register.fca.org.uk\n\n"
}