{
    "summary": "  * DirectoryGlobal Directory\n\n### Explore our sites\n\n    * London Stock Exchange Group\n    * MyRefinitiv\n    * Developer Community\n    * Refinitiv Perspectives\n    * London Stock Exchange\n    * FTSE Russell\n    * LCH\n\n  * ENEN\n\n    * Español – Latam\n    * Français - France\n    * 日本語 – 日本\n    * 한국어 - 대한민국\n    * Português – Brasil\n    * 简体中文 – 中国\n\n  * LoginsProduct logins\n\n  * ContactContact Us\n\n  * SupportSupport\n\nRefinitiv\n\nSearch\n\n  * You Work In\n\nYou Work In\n\n  * Data\n\nData\n\n  * Products\n\nProducts\n\n  * Insights\n\nInsights\n\n  * Support\n\nSupport\n\n  * About\n\nAbout\n\n  \n**Our brand is changing to LSEG.**  Learn more about the changes to our brand  \n\n\nYour browser does not support the video tag.\n\n# Financial technology, data and expertise\n\nOur data,  **your way**\n\nOur comprehensive Data Catalogue offers you the industry’s largest portfolio\nof real-time, pricing, reference, time series, and machine-readable content,\nas well as company, research, news and ESG data.\n\nAccess the Data Catalogue\n\narrow-right\n\n###  **Data Catalogue**\n\nAccess broad and differentiated data sets to help you navigate the rapidly\nchanging financial markets.\n\nBrowse our data\n\narrow-right\n\n###  **Financial Impact Hub**\n\nStay up to speed with our latest insights on the global trends and news events\nthat are reshaping financial markets.\n\nExplore insights\n\narrow-right\n\n###  **Refinitiv Perspectives**\n\nDiscover the latest thought leadership, intelligence, financial technology,\ndata and expertise you need to find answers you trust from Refinitiv\nPerspectives.\n\nLearn more\n\narrow-right\n\n###  **Industry-leading webinars**\n\nDiscover webinars to keep you informed of the latest insights, development,\ntools and workflows.\n\nJoin us\n\narrow-right\n\n##  Explore the **latest trends, insights and analysis**\n\nPERSPECTIVES\n\n###  **What are the global implications of China’s economic challenges?**\n\nJanuary 05, 2023\n\n•\n\n5 min\n\nINSIGHTS\n\n###  **Turn words into action on the digital economy**\n\nHedge fund huddle podcast\n\n**Understand the complexities of hedge fund trading**\n\nIn the Hedge Fund Huddle podcast series, industry experts share insights on\nhedge funds then and now, the future of investing, finding investment ideas\nand key market trends hedge funds need to be aware of.\n\nListen now\n\n##  Our  **data**  to drive **** your **performance**\n\nWe refine and deploy the world's data to power and connect global financial\ncommunities, serving more than 40,000 institutions in approximately 190\ncountries.\n\nHow we operate\n\n###  **Analytics**\n\nRaising the bar on ‘big data’ and analytics is big business - and getting\nbigger - as it is key in the decision-making process. With our analytics and\nanalytics tools, we help turn data into actionable insights.\n\n###  **Innovation**\n\nThe greatest driver of innovation is freedom of access – to the best data,\nsmart tools, and human expertise. That’s why we invest in our community-driven\nopen platform.\n\n###  **Data and technology**\n\nAccess to multiple data sets integrated with high-performance products\naccording to your needs. Our goal is to give you more information and time to\ntest strategies and optimize performance.\n\nCareers\n\n**Join us**\n\nGet the level of influence and opportunity that you’d have at a startup,\ncombined with the large-scale impact of working at a global company. Discover\nthe teams you could join and the roles you could play.\n\nFind your role\n\n##  Request details\n\n  * Email sales\n  * Call sales\n\nProduct of interest Select one DataScope Select Datastream Eikon Due Diligence\nESG Data FXall Market Data Pricing Data REDI EMS Workspace World-Check Risk\nIntelligence Other\n\nFirst name\n\nLast name\n\nEmail address\n\nPhone number (numerals only; no dashes)\n\nCountry/territory Select one Afghanistan Aland Islands Albania Algeria\nAmerican Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda\nArgentina  Armenia Aruba Australia  Austria Azerbaijan Bahamas Bahrain\nBangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bosnia\nand Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory\nBrunei Darussalam Bulgaria Burkina Faso Burundi Cambodia Cameroon Canada Cape\nVerde Cayman Islands Central African Republic Chad Chile China Christmas\nIsland Cocos (Keeling) Islands Colombia Comoros Congo Congo, The Democratic\nRepublic of the Cook Islands Costa Rica Cote D'Ivoire Croatia Cyprus Czech\nRepublic Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El\nSalvador Equatorial Guinea Eritrea Estonia Ethiopia  Falkland Islands\n(Malvinas) Faroe Islands Fiji Finland France French Guiana French Polynesia\nFrench Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar\nGreece Greenland Grenada Guadeloupe Guam Guatemala Guinea Guinea-Bissau\nGuernsey Guyana Haiti Heard and McDonald Islands Holy See (Vatican City State)\nHonduras Hong Kong Hungary Iceland India Indonesia Iraq Iran (Islamic Republic\nOf) Ireland Isle of Man Israel Italy Jamaica  Japan Jersey Jordan Kazakhstan\nKenya Kiribati Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic\nRep Latvia Lebanon Lesotho Liberia Libyan Arab Jamahiriya Liechtenstein\nLithuania Luxembourg Macau Madagascar Malawi Malaysia Maldives Mali Malta\nMarshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia,\nFederated States Moldova, Republic of Monaco  Mongolia Montenegro Montserrat\nMorocco Mozambique Myanmar Namibia Nauru Nepal Netherlands Netherlands\nAntilles New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island\nNorthern Mariana Islands  Norway Oman Pakistan Palau Palestinian Territory,\nOccupied Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland\nPortugal Puerto Rico Qatar Republic of North Macedonia Reunion Romania Russian\nFederation Rwanda Saint Helena Saint Kitts and Nevis Saint Lucia Saint Martin\nSaint Pierre and Miquelon Samoa San Marino Sao Tome and Principe Saudi Arabia\nSenegal Serbia Seychelles Sierra Leone Singapore Slovakia Slovenia Solomon\nIslands Somalia South Africa Spain Sri Lanka Sth Georgia & Sth Sandwich Is St\nVincent and the Grenadines  Suriname Svalbard and Jan Mayen Swaziland Sweden\nSwitzerland Taiwan Tajikistan  Tanzania, United Republic of Thailand Timor-\nLeste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkey Turkmenistan Turks\nand Caicos Islands Tuvalu Uganda Ukraine United Arab Emirates United Kingdom\nUnited States Uruguay US Minor Outlying Islands Uzbekistan Vanuatu Venezuela\nVietnam Virgin Islands (British) Virgin Islands (U.S.) Wallis and Futuna\nIslands Western Sahara Yemen Zambia Zimbabwe\n\nCity(optional)\n\nCompany\n\nJob title\n\nArea of interest: Help us connect you to the right expert(optional)\n\nBy submitting this form, you agree to your personal data being shared within\nthe London Stock Exchange Group of companies (LSEG) for the purpose of\nreceiving communications via post, phone and electronic means from LSEG about\nevents, resources, products, and/or services.  \n\nAccept terms(optional)\n\nFor more information on how LSEG uses your data, see our Privacy Statement.\nYou can adjust your preferences at any time through the preference link in any\nelectronic communication that you receive from us.  \n\nSubmit\n\n##  Call your local sales team\n\n**Americas  \n**All countries (toll free): +1 800 427 7570  \nBrazil: +55 11 47009629  \nArgentina: +54 11 53546700  \nChile: +56 2 24838932  \nMexico: +52 55 80005740  \nColombia: +57 1 4419404\n\n**Europe, Middle East, Africa  \n**Europe: +442045302020  \nAfrica: +27 11 775 3188  \nMiddle East & North Africa: 800035704182\n\n**Asia Pacific (Sub-Regional)  \n**Australia & Pacific Islands:  \n+612 8066 2494  \nChina mainland: +86 10 6627 1095  \nHong Kong & Macau: +852 3077 5499  \nIndia, Bangladesh, Nepal, Maldives & Sri Lanka:  \n+91 22 6180 7525  \nIndonesia: +622150960350  \nJapan: +813 6743 6515  \nKorea: +822 3478 4303  \nMalaysia & Brunei: +603 7 724 0502  \nNew Zealand: +64 9913 6203  \nPhilippines: 180 089 094 050 (Globe) or  \n180 014 410 639 (PLDT)  \nSingapore and all non-listed ASEAN Countries:  \n+65 6415 5484  \nTaiwan: +886 2 7734 4677  \nThailand & Laos: +662 844 9576\n\n\n\nHelp & Support\n\n###  **Already a customer?**\n\nGet help through MyRefinitiv\n\narrow-right\n\nOffice locations\n\n###  **Contact Refinitiv near you     **\n\nFind your nearest Refinitiv office\n\narrow-right\n\nBlog\n\n###  **Refinitiv Perspectives**\n\nDiscover market-moving critical news, information and analytics for the global\nfinancial community.  \n\nFinancial insight\n\narrow-right\n\nPress\n\n###  **Media centre**\n\nRead our latest press releases, contact our media team, or discover our data\nfor journalists.\n\nVisit the media centre\n\narrow-right\n\nBecome a developer\n\n###  **Developers**\n\nJoin our community of over 45,000 users and learn how to work with Refinitiv\ndata.\n\nJoin the community\n\narrow-right\n\nBecome a partner\n\n###  **Our partners**\n\nJoin our network of over 2,000 organisations and access data, technology, and\nexpertise to help you grow.  \n\nJoin the network\n\narrow-right\n\nSearch\n\n0 results found\n\n  * ## About Refinitiv\n\n    * Who we are\n    * Careers\n    * Media centre\n    * Partners\n    * Policies\n    * Press releases\n    * Sitemap\n\n  * ## Market insight and communities\n\n    * Developer Community\n    * Lipper Alpha Insight\n    * MiFID II\n    * Refinitiv Perspectives\n    * Reuters Editorial Forums\n\n  * ## Contact us\n\n    * Media relations\n    * Office locations\n    * Product support\n    * Sales\n    * Supplier portal\n    * Whistleblowing\n\n  * ## Connect with us\n\n    * Facebook\n    * Instagram\n    * LinkedIn\n    * Twitter\n    * YouTube\n\n  * ## Explore LSEG sites\n\n    * London Stock Exchange Group\n    * London Stock Exchange\n    * FTSE Russell\n    * LCH\n\nregEmailSuccessModal\n\nClose\n\n**Your registration request is being reviewed**\n\nThank you for registering. We are currently reviewing your application.\n\nWe will send you email confirmation within 24 hours with further instructions\non how to proceed with access to Refinitiv.\n\nClose\n\nregEmailExpiryModal\n\nClose\n\n**Email verification link expired**\n\nWe notice that you have used an expired link to try and complete registration.\nPlease resubmit your details and we will send you a new email.  \n\nResubmit\n\nmarketingRegEmailVeriErrorModal\n\nClose\n\n**There is some problem with the request sent.**\n\nClose\n\nregEmailVeriInternalErrorModal\n\nClose\n\n**We're having some issues processing your request.**\n\nPlease try again or contact us for further assistance.\n\nClose\n\nregGenericErrorModal\n\nClose\n\n**We're having some issues processing your request.**\n\nPlease try again or contact us for further assistance.\n\nClose\n\nRefinitiv\n\n    * Cookie policy\n    * Cookie settings\n    * Copyright\n    * Privacy statement\n    * Do not sell my info\n    * Terms of use\n    * Supply chain transparency\n    * Accessibility\n\n##\n\n## Our use of cookies\n\nRefinitiv websites use cookies and similar technologies for various purposes\nincluding functionality, performance, targeting, social media, and for the\nproper functioning of websites. The cookies and similar technologies may\ninclude those deployed by third parties for providing services to us and they\nmay use the same to improve, enhance, and deliver their services to all of\ntheir customers. To access a list of the websites covered by this banner\nreview the cookie settings. By clicking “Accept all cookies,” you agree to the\nstoring and reading of cookies and other similar technologies. You can change\nyour preferences at any time through our Cookie Settings tool. Please read our\nPrivacy and Cookie Statement.\n\nCookie settings Reject All  Accept All Cookies\n\n## Privacy Preference Center\n\nThis preference center applies to all websites within the www.refinitiv.com\ndomain/sub-domain group. To view a list of the websites visit\nhttps://www.refinitiv.com/privacy-center-common-domains. When you visit these\nwebsites, information may be stored or retrieved on or from your browser,\nmostly in the form of or through cookies (e.g., first-party and third-party)\nand similar technologies (e.g., local storage, web beacons, etc.) (\"cookies\").\nThis information might be about you, your preferences and/or your device. All\nreferences to \"Services\" refers to Refinitiv's products, services, websites,\ndigital properties, platforms, software and applications (including mobile\napplications).  \n  \nThe cookies may include those deployed by third parties providing services to\nus. These third parties may use these cookies and the information collected in\nconnection therewith (including information collected on and off of our\nwebsites), for providing services to us and also to improve, enhance and\ndeliver their services to all of their customers. If you opt-out of, or toggle\noff, cookies through this preference center, this action will only apply to\nthe applicable Refinitiv websites covered by this preference center and will\nnot impact cookies deployed, and data collection, through non-Refinitiv\nwebsites. In order to opt-out of the tracking and data collection by these\nthird parties completely, you must either go to the websites for such third\nparties to exercise your preference or use the preferences/choices mechanism\navailable through the advertisements that these third parties may display.  \n  \nBecause we respect your right to privacy, you can choose not to allow some\ntypes of cookies. You can use the features in this preference center to block\nor allow these types of cookies. Toggle \"on\" to allow cookies and toggle \"off\"\nto block specific categories of cookies. For your reference, if the toggle is\nblue, then you have allowed cookies and if the toggle is gray, then you have\nblocked cookies. Blocking some types of cookies may impact your experience of\nthe site and the services we are able to offer. A preference cookie will be\nset, which will contain your preferences of blocking or allowing cookies.  \n  \nPlease note that if you clear your cookies, the preference cookie will be\ndeleted for all websites within the group and this will clear your preference\nand when you first re-enter or re-access Refinitiv's services (e.g.,\nwebsites), you will be asked to consent to cookies being deployed. When\npresented with the option to accept all cookies, if you want to allow or block\ncertain categories of cookies, you will have to access Refinitiv’s cookie\npreference center again to exercise your choice. If you accept all cookies,\nthen all cookies will deploy.  \n  \n****  \nPrivacy Statement and Cookies Policy\n\nAllow All\n\n###  Manage Consent Preferences\n\n#### Strictly Necessary Cookies\n\nAlways Active\n\nStrictly Necessary Cookies\n\nThese cookies are necessary for websites to function and cannot be switched\noff through Refinitiv’s cookie preference center. They are usually only set in\nresponse to actions made by you which amount to a request for services, such\nas setting your privacy preferences, logging in or filling in forms.\n\nCookies Details‎\n\n#### Performance Cookies\n\nPerformance Cookies\n\nThese cookies collect information, including analytics, about how you use our\nServices. Information collected includes, for example, the Internet browsers\nand operating systems used, the domain name of the website previously visited,\nthe number of visits, average duration of visit, actions taken and pages\nviewed. These cookies may be used to record or track your interaction and/or\nuse of our web and/or mobile sites, platforms and/or digital properties.\nPerformance cookies help us measure the activity on our Services, create\nreports and statistics about the performance of our Services, improve the\nuser-friendliness of the Services and improve the quality of our Services.\nThese types of cookies typically stay active on your computer until they are\ndeleted or until the cookie expires (if applicable).\n\nCookies Details‎\n\n#### Functional Cookies\n\nFunctional Cookies\n\nThese cookies allow the website to remember information about you (e.g., your\nusername or ID) and the choices you make (e.g., your language preference, or\nthe area or region you are in) and provide enhanced, more personalized\nfeatures or content to you. These cookies can also be used to remember changes\nyou have made to text size, fonts, and other customizable parts of web pages.\nThey may also be used to provide Services you have asked for, such as watching\na video or commenting on a blog. If you do not allow these cookies or if you\ntoggle these cookies off, then some or all of these Services may not function\nproperly. These cookies cannot track your browsing activity on other websites.\n\nCookies Details‎\n\n#### Targeting Cookies\n\nTargeting Cookies\n\nThese cookies track browsing habits (on and off of our websites and digital\nproperties) and are used to deliver targeted (interest-based) advertising.\nThey are also used to limit the number of times you see an ad and to measure\nthe effectiveness of advertising campaigns. They remember that you have\nvisited a website and this information may be shared with other organizations,\nsuch as advertisers and Refinitiv’s advertising partners, who might use it\nwith information about how you use other websites, including identifying\nshared interests and behaviors across groups of users who visit our (and\nother) websites. In connection with these types of cookies, your activity may\nbe tracked or monitored using identifiers (e.g., a cookie ID, other unique\nidentification numbers). These types of cookies will typically stay on your\ncomputer until they are deleted or until they expire (if applicable).\n\nCookies Details‎\n\nConfirm My Choices\n\nBack Button\n\nBack\n\n### Performance Cookies\n\nVendor Search Search Icon Filter Icon\n\nClear Filters\n\nInformation storage and access\n\nApply\n\nConsent Leg.Interest\n\nAll Consent Allowed\n\nSelect All Vendors\n\nSelect All Vendors\n\nAll Consent Allowed\n\n  * ### \n\n#### host description\n\nView Cookies\n\nREPLACE-WITH-DYANMIC-HOST-ID\n\n    * Name\n\ncookie name\n\nConfirm My Choices\n\n",
    "links": "[{\"link\": \"https://www.refinitiv.com/perspectives/\", \"text\": \"\"}, {\"link\": \"https://www.refinitiv.com/es\", \"text\": \"\"}, {\"link\": \"https://www.refinitiv.com/fr\", \"text\": \"\"}, {\"link\": \"https://www.refinitiv.com/ja\", \"text\": \"\"}, {\"link\": \"https://www.refinitiv.com/ko\", \"text\": \"\"}, {\"link\": \"https://www.refinitiv.com/pt\", \"text\": \"\"}, {\"link\": \"https://www.refinitiv.com/en/product-logins\", \"text\": \"\"}, {\"link\": \"https://www.refinitiv.com/en/contact-us\", \"text\": \"\"}, {\"link\": \"https://www.refinitiv.com/en\", \"text\": \"\"}, {\"link\": \"https://www.refinitiv.com/en/financial-data\", \"text\": \"\"}, {\"link\": \"https://www.refinitiv.com/en/financial-data\", \"text\": \"\"}, {\"link\": \"https://www.refinitiv.com/en/financial-impact\", \"text\": \"\"}, {\"link\": \"https://www.refinitiv.com/perspectives/topic/blog/\", \"text\": \"\"}, {\"link\": \"https://www.refinitiv.com/en/events\", \"text\": \"\"}, {\"link\": \"https://www.refinitiv.com/perspectives/market-insights/analysing-china-economic-challenges-and-their-global-implications/\", \"text\": \"\"}, {\"link\": \"https://www.refinitiv.com/en/asset-management-solutions/insights/hedge-fund-huddle\", \"text\": \"\"}, {\"link\": \"https://www.refinitiv.com/en/about-us\", \"text\": \"\"}, {\"link\": \"https://www.refinitiv.com/en/careers\", \"text\": \"\"}, {\"link\": \"https://www.refinitiv.com/en/policies/privacy-statement\", \"text\": \"Privacy Statement\"}, {\"link\": \"https://www.refinitiv.com/en/locations\", \"text\": \"\"}, {\"link\": \"https://www.refinitiv.com/perspectives/\", \"text\": \"\"}, {\"link\": \"https://www.refinitiv.com/en/media-center\", \"text\": \"\"}, {\"link\": \"https://www.refinitiv.com/en/about-us/business-partnerships-marketplace\", \"text\": \"\"}, {\"link\": \"https://www.refinitiv.com/en/about-us\", \"text\": \"Who we are\"}, {\"link\": \"https://www.refinitiv.com/en/careers\", \"text\": \"Careers\"}, {\"link\": \"https://www.refinitiv.com/en/media-center\", \"text\": \"Media centre\"}, {\"link\": \"https://www.refinitiv.com/en/about-us/business-partnerships-marketplace\", \"text\": \"Partners\"}, {\"link\": \"https://www.refinitiv.com/en/policies\", \"text\": \"Policies\"}, {\"link\": \"https://www.refinitiv.com/en/media-center/press-releases\", \"text\": \"Press releases\"}, {\"link\": \"https://www.refinitiv.com/en/sitemap\", \"text\": \"Sitemap\"}, {\"link\": \"https://www.refinitiv.com/en/mifid\", \"text\": \"MiFID II\"}, {\"link\": \"https://www.refinitiv.com/perspectives/\", \"text\": \"Refinitiv Perspectives\"}, {\"link\": \"https://www.refinitiv.com/en/products/refinitiv-messenger/editorial-communities-financial-forums\", \"text\": \"Reuters Editorial Forums\"}, {\"link\": \"https://www.refinitiv.com/en/media-center/media-contacts\", \"text\": \"Media relations\"}, {\"link\": \"https://www.refinitiv.com/en/locations\", \"text\": \"Office locations\"}, {\"link\": \"https://www.refinitiv.com/en/contact-sales\", \"text\": \"Sales\"}, {\"link\": \"https://www.refinitiv.com/en/supplier-portal\", \"text\": \"Supplier portal\"}, {\"link\": \"https://www.refinitiv.com/en\", \"text\": \"\"}, {\"link\": \"https://www.refinitiv.com/en/register\", \"text\": \"\"}, {\"link\": \"https://www.refinitiv.com/en\", \"text\": \"\"}, {\"link\": \"https://www.refinitiv.com/en\", \"text\": \"\"}, {\"link\": \"https://www.refinitiv.com/en\", \"text\": \"\"}, {\"link\": \"https://www.refinitiv.com/en\", \"text\": \"Refinitiv\"}, {\"link\": \"https://www.refinitiv.com/en/policies/privacy-statement#cookies\", \"text\": \"Cookie policy\"}, {\"link\": \"https://www.refinitiv.com/en/policies/copyright-notice\", \"text\": \"Copyright\"}, {\"link\": \"https://www.refinitiv.com/en/policies/privacy-statement\", \"text\": \"Privacy statement\"}, {\"link\": \"https://www.refinitiv.com/en/policies/terms-of-use\", \"text\": \"Terms of use\"}, {\"link\": \"https://www.refinitiv.com/en/policies/website-accessibility-statement\", \"text\": \"Accessibility\"}, {\"link\": \"https://www.refinitiv.com/en/policies/privacy-statement\", \"text\": \"Privacy and Cookie Statement.\"}, {\"link\": \"https://www.refinitiv.com/en/policies/privacy-statement\", \"text\": \"Privacy Statement and Cookies Policy\"}]"
}