{
    "summary": "Skip to content\n\n  * Solutions\n    * Products\n      * TotalAPEnd-to-end AP automation & payment optimization for mid-market and enterprise\n      * TotalPayInvoice payment automation solution\n    * Features\n      * Virtual CardsA free & secure payment method that earns rebates\n  * Integrations\n    * Integrations\n      * Oracle NetSuite\n      * Sage Intacct\n      * Intuit Quickbooks\n      * Microsoft Dynamics GP\n      * Oracle EBS\n      * Oracle ERP Cloud\n      * JD Edwards EnterpriseOne\n      * See All Integrations\n  * Industries\n    * Industries\n      * Healthcare\n      * Non-Profits\n      * Food & Beverage\n      * Education\n      * Retail\n  * Insights\n    * Content\n      * Blog\n      * Case Studies\n      * eBooks & Whitepapers\n      * Infographics\n      * On-Demand Webinars\n      * ROI Calculator\n      * State of AP ReportAn in-depth report on the state of AP today\n    * FAQs & Resource Pages\n      * AP Automation\n      * Accounts Payable\n      * Payment Tokenization\n      * AP Invoicing\n      * Invoice-to-Pay\n      * Automated Payments\n  * Company\n    * Company\n      * About Us\n      * Careers\n      * News\n      * Contact Us\n      * Partners\n      * Awards\n      * Upcoming Events\n      * Customer Support\n  * FAQs\n  * Contact Us\n\nRequest A Demo\n\n  * FAQs\n  * Customer Support\n  * Contact Us\n\nRequest A Demo\n\nDemo\n\n# How KYC Compliance Benefits Payment Providers and Their Customers\n\n#### Reduce Fraud Risk\n\n  1. Blog\n  2. Reduce Fraud Risk\n  3. How KYC Compliance Benefits Payment Providers and Their Customers\n\nWhile you may be aware that payment providers help safeguard corporate funds\nfrom fraud, do you know the critical role they play in helping to thwart money\nlaundering, terrorist financing, and other illegal operations?\n\nKnow Your Customer (KYC) regulations were first enacted in the 1990s to combat\nmoney laundering and were made more stringent after 9/11 through additional\nprovisions in the Patriot Act of 2001. These provisions require payment\nproviders – along with financial institutions, merchant acquirers, fintech\ncompanies, and others dealing with money transfers – to conduct due diligence\non their customers to help protect the national payments system from financial\ncrimes. To mitigate the risk of foul play, these providers must identify and\nverify the identity of all their customers.  \n\n## Common Questions about the KYC Compliance Process\n\nWhat do these KYC regulations mean for you as you implement an AP automation\nplatform and payment provider? Below are answers to eight frequent questions\nwe hear from new customers about KYC compliance:  \n  \n\n### 1\\. How does KYC compliance help protect against bad actors?\n\nBy requiring banks and other payment providers that handle money transfers to\nverify that companies making and receiving payments are who they say they are,\ngovernment regulators can protect our financial system from bad actors. It is\nthe first step in identifying and preventing the financing of terrorism and\ndrug smuggling, corruption schemes, money laundering, and other crimes.  \n  \n\n### 2\\. What type of information do you need from my company for KYC purposes?\n\nDuring the onboarding process, we will ask for business information, including\nyour taxpayer identification (TIN) number. In addition, we will ask for the\nsocial security numbers of the beneficial owners of your company, as well as\none control person. A control person is defined as a single individual\n(natural person) with significant responsibility to control, manage, or direct\na legal entity (e.g., CEO, CFO, COO, president, Vice President, Managing\nDirector, etc.) or any other person who regularly performs similar functions.  \n  \n\n### 3\\. Why do we have to provide social security information?\n\nTo establish that no bad actors are involved in transferring and receiving\nfunds, the Patriot Act requires financial institutions to verify the identity\nof their customers before engaging in business. The TIN is one of the best\nways to verify the identity of customers during onboarding. That’s why we\ncollect the social security numbers of the beneficial owners of companies that\nmake payments through MineralTree.  \n  \n\n### 4\\. Will you contact us on an ongoing basis about KYC compliance?\n\nNo, you can expect to just hear from us about this during the onboarding\nprocess.  \n  \n\n### 5\\. Why is MineralTree asking for this information – aren’t you a software\nprovider?\n\nWe are involved in the transfer of funds, and as such, must be in compliance\nwith KYC regulations.  \n  \n\n### 6\\. Does every payment processing company ask for this KYC information?\n\nYes, every payment processing company is required by law to conduct this KYC\nverification process.  \n  \n\n### 7\\. Does KYC compliance benefit us?\n\nThe KYC process also helps to protect your company. If your company\ninadvertently sends money to bad actors, it will put you and your suppliers at\nrisk. You have the protection and peace of mind in knowing that all of our\ncustomers have gone through this process.  \n  \n\n### 8\\. How do you keep our information secure?\n\nMineralTree has implemented rigorous security policies, procedures, and tools\nacross our entire organization. Because of the breadth of customers– from\npublic companies who must comply with Sarbanes-Oxley, to healthcare providers\nwho may have patient health information (PHI) in their AP workflow – we have\npursued the most extensive security certifications and audits in the market.\n\nThe information we collect for KYC is closely held with stringent access\nprotections. We have partnered with industry leaders in verification and fraud\nprevention software services to perform the required due diligence in house.  \n  \nSome of our overall security measures include:\n\n  *  **Strict employee controls and access** – All of our employees are subject to independent background checks and must complete regular security training. We allow access to systems based upon role, least-privilege and need-to-know principles and we perform regular internal audits to ensure that only authorized users have access.\n  *  **Data classification, encryption, and retention** – We classify the data we manage by sensitivity to ensure it is protected with sufficient controls. Data classifications include PCI, PII, and PHI. All data is encrypted in transit over the public internet and PCI, PII, and PHI data is encrypted at rest with strong ciphers like AES with large keys (256-bit). Data is only stored as long as required and is destroyed in a secure fashion when no longer needed.\n  *  **Network, system, and application management** – A comprehensive change management process ensures that all changes have undergone QA, have been peer reviewed to ensure adherence to security and coding best practices, and have been approved. All systems are built using hardening standards, and are protected with firewalls and anti-virus, DLP, and IDS software. In addition, systems undergo regular vulnerability scans and penetration testing.\n  *  **Vendor management** – We have implemented a third-party vendor management program to ensure that our services providers meet or exceed our security standards. Agreements with vendors include SLAs and NDAs.\n\nIn addition, we are compliant to two security regulations that are relevant to\nKYC:\n\n  *  **SOC 1 Type 2 compliance:** Assures our customers that MineralTree has implemented internal controls to protect their financial data and ensure the integrity of their payments workflow. Our Type 2 report is completed every six months.\n  *  **SOC 2 Type 2 compliance:** A third-party auditor verifies that our security controls meet AICPA’s five trust service principles for managing and protecting customer data: Security, Availability, Processing Integrity, Confidentiality, and Privacy.\n\n\n\n## KYC Compliance Gives Us—and You—Peace of Mind\n\nGiven today’s realities, we need to take measures to prevent financial crimes\nand ensure that our national payments system is protected. Our KYC procedures\ndo just that, and, along with the stringent security measures we put in place,\nthey reduce risk, protect everyone, and give you the peace of mind to make\npayments and conduct financial operations without having to give it another\nthought.  \n  \n\n### Bruno Fagundes\n\nBruno Fagundes is a Compliance Analyst at MineralTree and has been with the\ncompany for about one year. Bruno helped establish the Client Onboarding\nprocess for Managed Services with a focus on ensuring MineralTree is compliant\nwith KYC laws and regulations. He is CAMS and CFE certified and worked\npreviously at State Street Corporation in their AML and Sanctions compliance\nprogram.\n\n## Stay in the Know\n\nJoin MineralTree’s mailing list to get AP insights delivered straight to your\ninbox.\n\n## Keep Reading\n\nBlog Post\n\n### Who is Most Often Targeted in BEC Emails?\n\nBlog Post\n\n### Identifying & Preventing Vendor Fraud\n\nBlog Post\n\n### What is ACH Fraud and How to Combat It\n\nDemo\n\n  * Solutions\n    * TotalAP\n    * TotalPay\n    * Virtual Cards\n  * Integrations\n    * NetSuite\n    * Sage Intacct\n    * Quickbooks\n    * Microsoft Dynamics GP\n    * Oracle EBS\n    * Oracle ERP Cloud\n    * JD Edwards EnterpriseOne\n  * Industries\n    * Healthcare\n    * Non-Profits\n    * Food & Beverage\n    * Education\n    * Retail\n  * Insights\n    * Blog\n    * Case Studies\n    * eBooks & Whitepapers\n    * Infographics\n    * On Demand Webinars\n    * ROI Calculator\n    * State of AP Report\n  * Company\n    * About Us\n    * Careers\n    * News\n    * Contact Us\n    * Partners\n    * Awards\n    * Upcoming Events\n  * FAQs\n    * AP Automation\n    * Accounts Payable\n    * Payment Tokenization\n    * AP Invoicing\n    * Invoice-to-Pay\n    * Automated Payments\n\n### Contact Us\n\n101 Arch Street  \n9th Floor  \nBoston, MA 02110\n\n### Contact\n\nMineralTree  \n101 Arch Street  \n9th Floor  \nBoston, MA 02110  \nsales@mineraltree.com  \n617-299-3399\n\nRequest A Demo\n\n### MineralTree Bangalore: Now Hiring!\n\nVisit Bangalore Open Positions for opportunities to join our team! BANGALORE\nPOSITIONS\n\nMineralTree is the owner of all intellectual property rights for MineralTree\nTotalAP and MineralTree TotalPay. Intellectual property rights to the other\nproducts are held by their respective owners.\n\nPrivacy Policy\n\n  *   *   *   *   *   * \n\nNotifications\n\n1/ close the image dialog\n\n  * go to the previous image\n  * go to the next image\n\n## Cookie Consent\n\nThis website uses cookies to enhance user experience and to analyze\nperformance and traffic on our website. We may also share information about\nyour use of our site with our social media, advertising, and analytics\npartners.\n\nAccept All\n\nReject All\n\nCookie Settings\n\n",
    "links": [
        "https://www.mineraltree.com/blog/how-kyc-compliance-benefits-payment-providers-and-their-customers/",
        "https://www.mineraltree.com/blog/how-kyc-compliance-benefits-payment-providers-and-their-customers//news/"
    ],
    "priceAndPlans": "Not found"
}