{
    "summary": "Ballerine\n\nMain Industries\n\nPayments\n\nMarketplaces\n\nFintechs\n\nCareerBecome a Partner\n\nBook a DemoView Toolbox\n\nBallerine\n\nCareerProductKYC starter kitTalk to usView GitHub\n\nCareerProductKYC starter kit\n\nTalk to usView GitHub\n\nMeet us at **MONEY 20/20 Vegas**\n\nBook a Meeting\n\nThe\n\nOpen Source\n\nRisk Decisioning Platform\n\n# The Complete Toolbox to\n\n# Onboard, Verify, Underwrite  \nand Monitor your\n\n# SMBs\n\n# Sellers\n\n# Merchants\n\n# Investors\n\n# Freelancers\n\n# SMBs\n\nNo more building in house to avoid vendor lock-in, or jumping between many\npoint solutions, build it all on Ballerine.\n\nBook a DemoView Toolbox\n\nStar us on GitHub\n\nStar us on GitHub\n\nSMBs risk processes are unique, complex and ever-changing. Ballerine\norchestrates the entire risk journey with an adaptable infrastructure you can\neasily adjust to any future changes.\n\n **Backed by top investors and leaders from**\n\n# Why Ballerine?\n\n#### Customize risk processes across the SMB lifecycle\n\nEverything you need to onboard, investigate, verify, and monitor businesses\nseamlessly.\n\n#### Stay ahead of regulation and fraudsters\n\nLeverage new data sources and best practices to enhance your compliance and\nfraud prevention processes\n\n#### Launch new services and GEOs, fast!\n\nStreamline expansion with simplified workflow creation for new products and\nGEOs\n\n#### Keep your operational workforce lean\n\nAutomate your decisions, and optimize your operational workflows to scale\nwithout any extra hiring\n\n#### Stay future-proof\n\nExtend the platform’s capabilities to fit your needs by adding your own custom\ncode, vendors, modules, and more.\n\nFeatured on\n\n# Built on Open Source Core\n\n##### Flexible\n\nFull flexibility on the code level, enabling limitless building capabilities\nto address any use case.\n\n##### Future proof\n\nBe adaptive to future requirements by adding your own code, features &\nintegrations.\n\n##### Secure & private\n\nAdhere to your own security and privacy measures, with on-premise, self-\nhosting, and data ownership.\n\n## Modular Risk Building Blocks  \n‍use them separately or all together\n\nUnified API\n\nBack Office\n\nRule Engine\n\nWorkflow Engine\n\nHeadless SDK\n\nClient SDK\n\nToolbox Essentials\n\n###### Open Banking\n\nAccess real-time financial data for deeper user insights, enhancing\ntransparency and financial health assessment.\n\n###### Identity Verification\n\nValidate user identities with precision, safeguarding against impersonation\nand fraud.\n\n###### Sanctions Screening\n\nScan global databases to flag potential partners or users linked to criminal\nor high-risk activities.\n\n###### Website Monitoring\n\nTrack online presence, ensuring your partners maintain compliant and reputable\nweb activities.\n\n###### Merchant Blacklists\n\nCross-check users with Visa and Mastercard's blacklists, preventing\nassociations with flagged merchants.\n\n###### Company Structure Check\n\nDive deep into business hierarchies, revealing hidden stakeholders and\npotential conflict points.\n\n###### Business Verification\n\nAuthenticate the legitimacy and operational history of potential business\ncustomers for trusted usage.\n\n###### Document Signing\n\nSecure and streamline documentation with digital signatures, ensuring\nauthenticity and reducing manual processes.\n\n###### Document Collection\n\nStreamline the gathering of essential documents from users, ensuring\ncompleteness and compliance.\n\n###### AI-Powered Modules\n\nHarness advanced technologies to enhance accuracy and automate risk\nassessments, optimizing decision-making.\n\n###### eIDs\n\nAuthenticate user identities swiftly with recognized electronic ID solutions,\nfortifying trust and security.\n\n###### Risk Score\n\nProvide a tailored risk score for users or businesses based on various\nparameters, assisting in decision-making.\n\nAnd more\n\nUnified API\n\n# One integration for all of the business data you need\n\nConnect to various data sources, government lists, ID and document\nverification providers, open banking, and more, with one unified API.\n\nBank Statement\n\nEIN/TIN\n\nPEP Check\n\nIdentity Verification\n\nLine of Business\n\nAddress Verification\n\nOCR Extraction\n\nBank Validation\n\nBank Statement\n\nEIN/TIN\n\nPEP Check\n\nIdentity Verification\n\nLine of Business\n\nAddress Verification\n\nOCR Extraction\n\nBank Validation\n\nBank Statement\n\nEIN/TIN\n\nPEP Check\n\nIdentity Verification\n\nLine of Business\n\nAddress Verification\n\nOCR Extraction\n\nBank Validation\n\nBank Statement\n\nEIN/TIN\n\nPEP Check\n\nIdentity Verification\n\nLine of Business\n\nAddress Verification\n\nOCR Extraction\n\nBank Validation\n\nMCC\n\nCompany structure\n\nCertificate of Incorporation\n\nWebsite & Social\n\nGovernment Data\n\nElectronic Verification\n\nFraud Checks\n\nElectronic Verification\n\neIDs\n\nMCC\n\nCompany structure\n\nCertificate of Incorporation\n\nWebsite & Social\n\nGovernment Data\n\nElectronic Verification\n\nFraud Checks\n\nElectronic Verification\n\neIDs\n\nUnlock valuable customer insights during onboarding and beyond with an all-in-\none API.Drive automated decisions, boost conversions, combat fraud, and\ndeliver an exceptional customer experience.\n\n## Features\n\n### Workflow engine\n\nBuild workflows is built that react to changes in a user's risk assessment,\ntriggering appropriate actions such as requesting more info, enriching data,\nor manual review. This enables you to effectively manage risk while\nmaintaining a seamless customer experience.\n\nBuild easy-to-maintain workflows\n\nProvide visibility to the rest of the dev team, see example\n\nAdd steps in real-time when the user’s risk level is still unclear\n\nCreate better converting processes for good users\n\nBack office\n\n### Reduce the operational burden\n\nA customizable case management system for reviewing and taking decisions on\ncases. Improve efficiency by tailoring case views and workflows, consolidating\ncustomer data and communication, and empowering agents to take action.\n\nHolistic view of business customers, including 3rd party data\n\nManage user communication and info collection efficiently\n\nSupport teamwork between agents, roles and departments\n\nAnalyze, monitor and audit with data and analytics\n\nRule engine\n\nWorkflow engine\n\n### Control and optimize your policies\n\nCustomize and optimize your risk policies and workflows for evaluating and\nresponding to users’ input and third-parties’ data. Using one unified hub\nenables compliance, fraud, and product teams to effortlessly collaborate,\ncommunicate on, and manage rules within their designated permissions.\n\nConfigure rules using no-code UI or custom code\n\nCustomize the different steps of the process\n\nCreate versions and A/B tests\n\nHeadless SDK\n\nClient SDK\n\n### Dynamically collect business documents and data\n\nStreamline your business verification process with a custom KYB flow. Request\nsupplemental documents at any point, reducing back-and-forth\ncommunication.Efficiently collect business information and ensure a hassle-\nfree verification experience.\n\n# Features\n\n# Workflows\n\nBuild workflows that react to changes in a user's risk assessment, triggering\nrequesting more info, enriching data, or manual review. Effectively manage\nrisk while maintaining a seamless customer experience.\n\n# Rule engine\n\nSet up rules based on your compliance, fraud, and product requirements, to\nautomatically process and evaluate user data to ensure regulatory compliance,\nprevent fraud, and enforce policies.\n\n# Integrations\n\nConnect to various data sources, government lists, ID and document\nverification providers, and more with our unified standardized data API.\n\n# Custom API\n\nConnect to external providers or in-house tools and seamlessly integrate them\ninto your workflows to mitigate risk.\n\n# Headless SDK\n\nControl the course of a user flow based on their answers and data in real-time\nthrough our dynamic headless SDK. allowing for custom experiences based on the\ncurrent user risk.\n\nNeed anything else?  \nWe’d love to hear and help out.Leave your information below and we’ll get in\ntouch\n\nRan Nachman\n\nVP Regulation Solutions | eToro\n\n“Proactively navigating fintech regulations requires faster technology\nadoption. Next-gen compliance infrastructures should seamlessly integrate with\nexisting and new systems and data sources.”\n\nMichael Vaughan\n\nFormer COO | Venmo\n\n\"Compliance and fraud procedures are fragmented and complicated, varying\nacross distinct geographies and sectors. By consolidating these procedures\ninto a flexible, open system, we can significantly streamline operations for\nfinancial services.”\n\nMichael Tannenbaum\n\nCOO | Brex\n\n“For mission-critical processes like onboarding and risk monitoring, fintech\ncompanies cannot compromise on control and flexibility. An open-core approach\nprovides a new, ideal middle ground in the build-vs-buy paradox.\"\n\n# Talk to us\n\nWe would love to learn about your use case and challenges, so we can help out\nor build our open-source modules to fit your needs.Leave your information and\nwe’ll get in touch.\n\n# Contact information\n\nInterested in\n\n##### I’m interested in:\n\nCase management\n\nRule engine\n\nBusiness data API\n\nDocument collection forms\n\nKYB\n\nKYC\n\nUnderwriting\n\nTransaction monitoring\n\nThank you! Your submission has been received!\n\nOops! Something went wrong while submitting the form.\n\nBallerine\n\nProduct\n\nWorkflow Engine\n\nIntegrations\n\nRule engine\n\nCustom APIs\n\nBack Office\n\nFrontend flows\n\nCareerBecome a PartnerView GitHub\n\n",
    "links": "[{\"link\": \"https://www.ballerine.com/\", \"text\": \"\"}, {\"link\": \"https://www.ballerine.com/payments\", \"text\": \"\"}, {\"link\": \"https://www.ballerine.com/marketplaces\", \"text\": \"\"}, {\"link\": \"https://www.ballerine.com/fintechs\", \"text\": \"\"}]",
    "priceAndPlans": "Open-source infrastructure and data orchestration platform for risk decisioning"
}