{
    "summary": "**About cookies on this site**\n\nWe use cookies to collect and analyse information on site performance and\nusage, to provide social media features and to enhance and customise content\nand advertisements.\n\nLearn more\n\nAllow all cookiesDeny all\n\nCookie settings\n\n **About cookies on this site**\n\n  * Cookie settings\n  * Cookie declaration\n\nCookies used on the site are categorized and below you can read about each\ncategory and allow or deny some or all of them. When categories than have been\npreviously allowed are disabled, all cookies assigned to that category will be\nremoved from your browser. Additionally you can see a list of cookies assigned\nto each category and detailed information in the cookie declaration.\n\nLearn more\n\nAllow all cookiesDeny all\n\n\b\n\n **Necessary cookies**\n\nSome cookies are required to provide core functionality. The website won't\nfunction properly without these cookies and they are enabled by default and\ncannot be disabled.\n\n\b\n\n **Preferences**\n\nPreference cookies enables the web site to remember information to customize\nhow the web site looks or behaves for each user. This may include storing\nselected currency, region, language or color theme.\n\n\b\n\n **Analytical cookies**\n\nAnalytical cookies help us improve our website by collecting and reporting\ninformation on its usage.\n\n\b\n\n **Marketing cookies**\n\nMarketing cookies are used to track visitors across websites to allow\npublishers to display relevant and engaging advertisements.\n\nCookies used on the site are categorized and below you can read about each\ncategory and allow or deny some or all of them. When categories than have been\npreviously allowed are disabled, all cookies assigned to that category will be\nremoved from your browser. Additionally you can see a list of cookies assigned\nto each category and detailed information in the cookie declaration.\n\nLearn more\n\n **Necessary cookies**\n\nSome cookies are required to provide core functionality. The website won't\nfunction properly without these cookies and they are enabled by default and\ncannot be disabled.\n\nName| Hostname| Path| Expiry| Tags  \n---|---|---|---|---  \npll_language| www.idnow.io| /| 365 days|  \n  \nThis cookie is used to remember the language selected by the user when he\ncomes back to visit again the website by Polylang  \n  \ncookiehub| .idnow.io| /| 365 days|  \n  \nUsed by CookieHub to store information about whether visitors have given or\ndeclined the use of cookie categories used on the site.  \n  \n__cf_bm| .vimeo.com| /| 1 hour| 3rd party  \n  \nThe __cf_bm cookie supports Cloudflare Bot Management by managing incoming\ntraffic that matches criteria associated with bots. The cookie does not\ncollect any personal data, and any information collected is subject to one-way\nencryption.  \n  \n__cf_bm| .hubspot.com| /| 1 hour| 3rd party  \n  \nThe __cf_bm cookie supports Cloudflare Bot Management by managing incoming\ntraffic that matches criteria associated with bots. The cookie does not\ncollect any personal data, and any information collected is subject to one-way\nencryption.  \n  \nJSESSIONID| .nr-data.net| /| Session| 3rd party  \n  \nGeneral purpose platform session cookie, used by sites with JavaServer Pages\n(JSP). The cookie is usually used to maintain an anonymous user session by the\nserver.  \n  \n **Preferences**\n\nPreference cookies enables the web site to remember information to customize\nhow the web site looks or behaves for each user. This may include storing\nselected currency, region, language or color theme.\n\nName| Hostname| Path| Expiry| Tags  \n---|---|---|---|---  \nvuid| .vimeo.com| /| 730 days| 3rd party  \n  \nThese cookies are used by the Vimeo video player on websites.  \n  \nli_gc| .linkedin.com| /| 180 days| 3rd party  \n  \nUsed by LinkedIn to store consent of guests regarding the use of cookies for\nnon-essential purposes  \n  \nPHPSESSID| idnow.onlyfy.jobs| /| 12 hours| 3rd party  \n  \nCookie generated by applications based on the PHP language. This is a general\npurpose identifier used to maintain user session variables. It is normally a\nrandom generated number, how it is used can be specific to the site, but a\ngood example is maintaining a logged-in status for a user between pages.  \n  \nVISITOR_INFO1_LIVE| .youtube.com| /| 180 days| 3rd party  \n  \nA cookie that YouTube sets that measures your bandwidth to determine whether\nyou get the new player interface or the old.  \n  \nmessagesUtk| .idnow.io| /| 180 days|  \n  \nThis cookie is used to recognize visitors who chat with you via the chatflows\ntool. If the visitor leaves your site before they're added as a contact, they\nwill have this cookie associated with their browser.  \n  \n **Analytical cookies**\n\nAnalytical cookies help us improve our website by collecting and reporting\ninformation on its usage.\n\nName| Hostname| Path| Expiry| Tags  \n---|---|---|---|---  \n_ga| .idnow.io| /| 730 days|  \n  \nContains a unique identifier used by Google Analytics to determine that two\ndistinct hits belong to the same user across browsing sessions.  \n  \n_gid| .idnow.io| /| 1 day|  \n  \nContains a unique identifier used by Google Analytics to determine that two\ndistinct hits belong to the same user across browsing sessions.  \n  \nbcookie| .linkedin.com| /| 365 days| 3rd party  \n  \nThis is a Microsoft MSN 1st party cookie for sharing the content of the\nwebsite via social media.  \n  \nlidc| .linkedin.com| /| 1 day| 3rd party  \n  \nUsed by LinkedIn for routing.  \n  \n_ga_*| .idnow.io| /| 730 days|  \n  \nContains a unique identifier used by Google Analytics 4 to determine that two\ndistinct hits belong to the same user across browsing sessions.  \n  \n_dc_gtm_*| .idnow.io| /| 1 hour|  \n  \nUsed to throttle request rate. If Google Analytics is deployed via Google Tag\nManager  \n  \nln_or| www.idnow.io| /| 1 day|  \n  \nUsed by LinkedIn to determine if Oribi analytics can be carried out on a\nspecific domain  \n  \nYSC| .youtube.com| /| Session| 3rd party  \n  \nThis cookie is set by YouTube video service on pages with YouTube embedded\nvideos to track views.  \n  \n_pk_id.*| .idnow.io| /| 393 days|  \n  \nUsed by Matomo to store a few details about the user such as the unique\nvisitor ID  \n  \n_pk_ses.*| .idnow.io| /| 1 hour|  \n  \nShort lived cookies used by Matomo to temporarily store data for the visit  \n  \n__hstc| .idnow.io| /| 180 days|  \n  \nThis cookie name is associated with websites built on the HubSpot platform.\nThis is the main cookie for tracking visitors. It contains the domain, utk,\ninitial timestamp (first visit), last timestamp (last visit), current\ntimestamp (this visit), and session number (increments for each subsequent\nsession).  \n  \nhubspotutk| .idnow.io| /| 180 days|  \n  \nThis cookie name is associated with websites built on the HubSpot platform.\nThis cookie is used to keep track of a visitor's identity. This cookie is\npassed to HubSpot on form submission and used when deduplicating contacts.  \n  \n__hssrc| .idnow.io| /| Session|  \n  \nThis cookie name is associated with websites built on the HubSpot platform.\nWhenever HubSpot changes the session cookie, this cookie is also set to\ndetermine if the visitor has restarted their browser. If this cookie does not\nexist when HubSpot manages cookies, it is considered a new session.  \n  \n__hssc| .idnow.io| /| 1 hour|  \n  \nThis cookie name is associated with websites built on the HubSpot platform.\nThis cookie keeps track of sessions. This is used to determine if HubSpot\nshould increment the session number and timestamps in the __hstc cookie. It\ncontains the domain, viewCount (increments each pageView in a session), and\nsession start timestamp.  \n  \n **Marketing cookies**\n\nMarketing cookies are used to track visitors across websites to allow\npublishers to display relevant and engaging advertisements.\n\nName| Hostname| Path| Expiry| Tags  \n---|---|---|---|---  \nfp_lp| .idnow.io| /| 3650 days|  \nfp_rf| .idnow.io| /| 3650 days|  \n_mkto_trk| .www.idnow.io| /| 730 days|  \n  \nThis cookie is associated with an email marketing service provided by Marketo.\nThis tracking cookie allows a website to link visitor behavior to the\nrecipient of an email marketing campaign, to measure campaign effectiveness.  \n  \npersonalization_id| .twitter.com| /| 730 days| 3rd party  \n  \nThis cookie carries out information about how the end user uses the website\nand any advertising that the end user may have seen before visiting the said\nwebsite.  \n  \nUserMatchHistory| .linkedin.com| /| 30 days| 3rd party  \n  \nContains a unique identifier used by LinkedIn to determine that two distinct\nhits belong to the same user across browsing sessions.  \n  \nAnalyticsSyncHistory| .linkedin.com| /| 30 days| 3rd party  \n  \nUsed by LinkedIn to store information about the time a sync with the\nlms_analytics cookie took place for users in the Designated Countries  \n  \nbscookie| .www.linkedin.com| /| 365 days| 3rd party  \n  \nUsed by the social networking service, LinkedIn, for tracking the use of\nembedded services.  \n  \nmuc_ads| .t.co| /| 730 days| 3rd party  \n  \nThis is a cookie that is set by twitter.com. It is used for optimizing ad\nrelevance by collecting visitor navigation data.  \n  \nli_sugr| .linkedin.com| /| 90 days| 3rd party  \n  \nUsed by LinkedIn to make a probabilistic match of a user's identity outside\nthe Designated Countries  \n  \nSave settings\n\nCookie settings\n\nARIADNEXT & Identity.TM are now IDnow.Learn more\n\n  * Industries\n\n    *  \n\n      * Fintech\n\nMaximized conversions and streamlined operations.\n\n      * Traditional Banking\n\nMulti-jurisdictional compliance and a seamless banking experience.\n\n      * Mobility\n\nDriving enhanced client onboarding in today’s dynamic mobility landscape.\n\n      * Gaming\n\nFast and secure player onboarding across Europe and beyond.\n\n      * Crypto\n\nSecure onboarding in various cryptocurrency markets.\n\n      * Travel\n\nConvenient travel bookings and digitized check-in processes.\n\n      * Telecommunication\n\nComprehensive KYC solutions and services – all from a single source.\n\n    * Related Topics\n\n      * Case Studies\n\n      * Solarisbank\n\n      * Selma Finance\n\n      * TeleDoctor24\n\n      * Holvi\n\n      * Syncier\n\n      * AIB\n\n  * Solutions\n\n    * Products\n\n      * AutoIdent AML\n\nAutomated, AI-powered identity verification for AML-compliance.\n\n      * VideoIdent\n\nAML-compliant video verification for high security requirements, backed by AI\n-technology.\n\n      * IDCheck.io\n\nAutomated, AI-powered identity verification for lower assurance use cases.\n\n      * Identity Wallet\n\nStorage and reuse of a verified identity documents to make identity proofing\nfaster and more efficient.\n\n    * THE PLATFORM FOR IDENTITY VERIFICATION\n\nOur highly configurable platform empowers your customer’s experience with\npowerful identity verification and fraud prevention.  \nLearn more\n\n    * _\n\n      * Add-ons\n      * eSign\n      * PEP & Sanctions\n      * Identification archiving\n      * Address verification\n      * Flexible delivery model\n\n  * Knowledge Center\n\n    *  \n\n      * Developer Hub\n\nProvides the iOS and Android SDK tools and full API documentation.\n\n      * Blog\n\nGet inspired and stay on top of the latest industry news and insights.\n\n      * Reports & Guides\n\nWould you like to get to the bottom of things? We have reports, guides and\nfurther insights available for download.\n\n      * Case Studies\n\nTake a look behind the scenes with our industry case studies available for\ndownload.\n\n      * Webinars\n\nOur experts keep you up to date on all trends & topics in our webinars.\n\n      * Glossary\n\nOur glossary provides up-to-date definitions and explanations.\n\n    * Regulation\n\n      * KYC\n      * AML & KYC\n      * Fintechs\n      * Online Gaming\n      * Data Security\n\n      * Certification Policies\n\n  * Company\n\n    *  \n\n      * Press Room\n\nAccess the latest press releases and download IDnow company branding assets.\n\n      * Partners\n\nBecome a partner in the global IDnow partnership network.\n\n      * Careers\n\nCheck out job opportunities in a fast growing B2B software company in Europe.\n\n      * References\n\nGet an impression of the customers around the world who trust IDnow with their\nidentity verifications.\n\n      * Core Values\n\nLearn more about the values that guide us as a company.\n\n      * About us\n\nLearn more about IDnow, the company milestones and meet the management.\n\n    * #\n\n  * Contact\n\n    *  \n\n      * User Support\n\nHaving trouble with your ID verification? Search our knowledge base.\n\n      * Contact Us\n\nAre you interested in one of our services? Get in touch with our sales team.\n\n    *  \n\n      * Partners\n      * Business Support\n      * Press\n\n  * Get in touch\n\nen\n\n  * de \n  * fr \n  * es \n  * pt \n\n# Knowing your customers has never been so  _e asy._ _f ast._ _s ecure._ _c\nompliant._ _a dvanced._ _f lexible._ _f riendly._\n\nThe Platform for Identity Verification.  \nBuilt for security. Loved by people.\n\nLearn more\n\nTrusted by\n\n  *   *   * \n\n## MEET OUR PLATFORM FOR IDENTITY VERIFICATION.\n\nOur highly configurable platform works across regulations, industries and use\ncases. Empower your customer experience with multi-dimensional identity\nverification and fraud prevention.\n\n  * __\n\n### Empower your customer’s choice of identity verification.\n\nOffer automated and expert-assisted identity verification and document signing\nwithin one journey for your customers. They choose how to convert in the way\nthat best suits them.\n\n  * __\n\n### Over-the-air configuration in realtime.\n\nConfigure your identity verification flow just-in-time - across our solutions\n- without lead time or need of advanced technical know-how.\n\n  * __\n\n### Fortified fraud prevention.\n\nEnsure the highest levels of reliability, security and trust with our\nproprietary fraud detection engine. Balance security levels without\ncompromising your customer’s experience.\n\n## Industries\n\n  * ### fintech\n\n#### _Tailor-made_ KYC solutions for fintechs.\n\nOffer your fintech customers the onboarding experience they deserve with our\nfully customizable platform for identity proofing.\n\nLearn more\n\n  * ### Traditional Banking\n\n#### A fully _customizable identity proofing platform_ for legacy financial\ninstitutions.\n\nOffer seamless multichannel banking experiences for a new generation.\n\nLearn more\n\n  * ### Mobility\n\n#### Driving enhanced client onboarding in today’s dynamic _mobility_\nlandscape.\n\nStay ahead of the curve and gain a competitive advantage with IDnow’s all-in-\none identity verification platform.\n\nLearn more\n\n  * ### Gaming\n\n#### Making gaming safer and more _trustworthy_.\n\nGet your players on board quickly and easily, while complying with strict age\nverification requirements and youth protection laws.\n\nLearn more\n\n  * ### Crypto\n\n#### Operate in various cryptocurrency market, _anywhere_ in the world.\n\nProvide your clients a seamless and secure onboarding experience and improve\nconversion in customer onboarding.\n\nLearn more about KYC for crypto\n\n  * ### Travel\n\n#### Enabling a fully automated check-in experience for the modern traveler.\n\nConvenient travel bookings and digitized check-in processes with IDnow’s fully\nautomated identity verification services.\n\nLearn more\n\n  * ### Telecommunication\n\n#### Stay ahead of the ongoing challenges in the telecom sector.\n\nReduce fraud and improve your conversion rates.\n\nLearn more\n\n## Better for your business.\n\n  * Improved conversion\n  * High level of legal compliance\n  * Customizable mobile and web integration\n  * Secure storage of customer data\n\n## Better for your customers.\n\n  * Anytime and anywhere\n  * Verification in just a few minutes\n  * No additional hardware\n  * Easy to use\n\n## Our Products\n\n### VideoIdent\n\nDigital verification via video-chat, backed by AI-technology. Our AML-\ncompliant solution meets high security requirements.\n\nLearn more\n\n### AutoIdent\n\nAutomated, AI-powered identity verification for users all over the world –\nanytime, anywhere. And AML-compliant.\n\nLearn more\n\n### IDCheck.io\n\nOur automated instant identity verification is based on Artificial\nIntelligence and Machine Learning. It’s simple, secure, and available\nanywhere, at any time.\n\nLearn more\n\n### IDCheck.io PVID\n\nIdentity verification is in the process of being certified by the ANSSI and\ncomplies with the Anti-Money Laundering Directives (AML-CFT) and meets high\nsecurity requirements.\n\nLearn more\n\n### eID\n\nNFC-based solution for the electronic German identification card. Our identity\nverification solution with easy data scanning via smartphone. AML-compliant.\n\nLearn more\n\nLearn about **our platform** and the other great **add-ons & services**.\n\n> The speed of the process helped us enormously in making our onboarding\n> process and our service scalable. Moreover, we were able to reduce the\n> operational workload on our back-office team. It is important to us that\n> identification is secure for us and our customers. We work with sensitive\n> data and were looking for a partner we could trust, with security expertise,\n> and knowledge of regulatory requirements and the divergent legislative\n> situations.\n\nJari Hautaranta | Customer Due Diligence Manager | Holvi\n\nRead the Holvi case study\n\n> In our business, flexible customer service, security, and legal compliance\n> are crucial. With its online identification solution, IDnow offers us a good\n> combination of all areas. Many customers use our services via smartphone and\n> fill out their tickets using our app while on the move. With IDnow\n> AutoIdent, we can now accept orders independently from our service center –\n> around the clock, worldwide. This enables us to meet increasing global\n> demand and provide our users with an ideal customer experience from the\n> moment they sign up.\n\nNigel Birrell | CEO | Lottoland\n\n> With IDnow, we were able to take a big step in the right direction. The\n> technical implementation of their two solutions, AutoIdent and VideoIdent,\n> was flawless and our customers can look forward to a fully automated ID\n> check. We are excited to see how the new offering will be received.\n\nMarkus Huber | Head of Innovation and New Business Sectors & Till Sommerfeld |\nInnovation and New Business Sectors | RMV\n\n## We're innovators at heart so you can be ahead of the curve.\n\nAt IDnow, being attentive to what seems impossible today, but could be solved\nin the future, is at the heart of what we do and in the choices we make.  \nWe empower pioneers to create ground-breaking digital experiences, using our\nKYC solutions that protect against player fraud, identity theft or forging\nsignatures. Join us on our path toward a world where secured virtual selves\nmay be safer and more trusted than identities in everyday life.\n\nLearn more\n\n## News & Insights\n\n###  Unpacking PVID and the double-edged sword of technology, with Baptiste\nForestier.\n\n2nd November 2023\n\n###  Road to regulation: UK’s proposed crypto regime.\n\n1st November 2023\n\n###  Ghosting fraud: Are you doing business with the dead?\n\n30th October 2023\n\n###  IDnow supports IATA in demonstrating first integrated shopping to travel\njourney using digital identity\n\n30th October 2023\n\nSee all\n\n## Questions?\n\nLet's talk!\n\nContact Us\n\nIssues with your identification or our app?\n\nContact us via our IDnow Support Center.\n\nIDnow GmbH HQ  \nAuenstraße 100  \n80469 Munich, Germany\n\nIDnow UK Limited  \nLondon, Manchester, United Kingdom\n\nIDnow SAS  \nParis, France\n\nIDnow GmbH  \nDüsseldorf, Germany\n\nIDnow SAS  \nCesson-Sévigné, France\n\nBusiness Hours\n\n**Ident-Center**  \n8 a.m.– 12 a.m. CET regular hours  \n12 a.m.– 8 a.m. CET night service hours\n\n**IT**  \n24/7\n\nQuick Links\n\n  * About IDnow\n  * Press\n  * Proofing Platform\n  * FAQ\n  * IDnow Support\n  * Revocation\n  * Developer Hub\n  * Certification Policies\n  * Team\n  * Career Opportunities\n  * Imprint / Legal Notice\n\nCopyright © 2023 IDnow.\n\nPrivacy Policy Imprint / Legal Notice\n\nPlay\n\n",
    "links": "[{\"link\": \"https://www.idnow.io/pr/idnow-and-french-identity-technology-provider-ariadnext-combine-to-create-leading-pan-european-identity-verification-platform/\", \"text\": \"Learn more\"}, {\"link\": \"https://www.idnow.io/\", \"text\": \"\"}, {\"link\": \"https://www.idnow.io/fintech/\", \"text\": \"Fintech\"}, {\"link\": \"https://www.idnow.io/fintech/\", \"text\": \"Maximized conversions and streamlined operations.\"}, {\"link\": \"https://www.idnow.io/traditional-banking/\", \"text\": \"Traditional Banking\"}, {\"link\": \"https://www.idnow.io/traditional-banking/\", \"text\": \"Multi-jurisdictional compliance and a seamless banking experience.\"}, {\"link\": \"https://www.idnow.io/mobility/\", \"text\": \"Mobility\"}, {\"link\": \"https://www.idnow.io/mobility/\", \"text\": \"Driving enhanced client onboarding in today’s dynamic mobility landscape.\"}, {\"link\": \"https://www.idnow.io/gaming/\", \"text\": \"Gaming\"}, {\"link\": \"https://www.idnow.io/gaming/\", \"text\": \"Fast and secure player onboarding across Europe and beyond.\"}, {\"link\": \"https://www.idnow.io/crypto/\", \"text\": \"Crypto\"}, {\"link\": \"https://www.idnow.io/crypto/\", \"text\": \" Secure onboarding in various cryptocurrency markets.\"}, {\"link\": \"https://www.idnow.io/travel/\", \"text\": \"Travel\"}, {\"link\": \"https://www.idnow.io/travel/\", \"text\": \"Convenient travel bookings and digitized check-in processes.\"}, {\"link\": \"https://www.idnow.io/telecommunication/\", \"text\": \"Telecommunication\"}, {\"link\": \"https://www.idnow.io/telecommunication/\", \"text\": \"Comprehensive KYC solutions and services – all from a single source.\"}, {\"link\": \"https://www.idnow.io/portfolio_category/case-studies-en/\", \"text\": \"Case Studies\"}, {\"link\": \"https://www.idnow.io/portfolio_category/case-studies-en/\", \"text\": \" \"}, {\"link\": \"https://www.idnow.io/portfolio/solarisbank/\", \"text\": \"Solarisbank\"}, {\"link\": \"https://www.idnow.io/portfolio/solarisbank/\", \"text\": \" \"}, {\"link\": \"https://www.idnow.io/portfolio/selma-finance/\", \"text\": \"Selma Finance\"}, {\"link\": \"https://www.idnow.io/portfolio/selma-finance/\", \"text\": \" \"}, {\"link\": \"https://www.idnow.io/portfolio/teledoctor24/\", \"text\": \"TeleDoctor24\"}, {\"link\": \"https://www.idnow.io/portfolio/teledoctor24/\", \"text\": \" \"}, {\"link\": \"https://www.idnow.io/portfolio/holvi/\", \"text\": \"Holvi\"}, {\"link\": \"https://www.idnow.io/portfolio/holvi/\", \"text\": \" \"}, {\"link\": \"https://www.idnow.io/portfolio/syncier/\", \"text\": \"Syncier\"}, {\"link\": \"https://www.idnow.io/portfolio/syncier/\", \"text\": \" \"}, {\"link\": \"https://www.idnow.io/portfolio/aib/\", \"text\": \"AIB\"}, {\"link\": \"https://www.idnow.io/portfolio/aib/\", \"text\": \" \"}, {\"link\": \"https://www.idnow.io/products/idnow-autoident/\", \"text\": \"AutoIdent AML\"}, {\"link\": \"https://www.idnow.io/products/idnow-autoident/\", \"text\": \"Automated, AI-powered identity verification for AML-compliance. \"}, {\"link\": \"https://www.idnow.io/products/idnow-videoident/\", \"text\": \"VideoIdent\"}, {\"link\": \"https://www.idnow.io/products/idnow-videoident/\", \"text\": \"AML-compliant video verification for high security requirements, backed by AI -technology.  \"}, {\"link\": \"https://www.idnow.io/products/idcheck-io/\", \"text\": \"IDCheck.io\"}, {\"link\": \"https://www.idnow.io/products/idcheck-io/\", \"text\": \"Automated, AI-powered identity verification for lower assurance use cases.\"}, {\"link\": \"https://www.idnow.io/products/identity-wallet/\", \"text\": \"Identity Wallet\"}, {\"link\": \"https://www.idnow.io/products/identity-wallet/\", \"text\": \"Storage and reuse of a verified identity documents to make identity proofing faster and more efficient. \"}, {\"link\": \"https://www.idnow.io/platform/\", \"text\": \"THE PLATFORM FOR IDENTITY VERIFICATION\"}, {\"link\": \"https://www.idnow.io/platform/\", \"text\": \"Learn more \"}, {\"link\": \"https://www.idnow.io/platform/#addons\", \"text\": \"Add-ons\"}, {\"link\": \"https://www.idnow.io/platform/#sec3\", \"text\": \"eSign\"}, {\"link\": \"https://www.idnow.io/platform/#sec3\", \"text\": \"PEP & Sanctions\"}, {\"link\": \"https://www.idnow.io/platform/#sec3\", \"text\": \"Identification archiving\"}, {\"link\": \"https://www.idnow.io/platform/#sec3\", \"text\": \"Address verification\"}, {\"link\": \"https://www.idnow.io/platform/#sec3\", \"text\": \"Flexible delivery model\"}, {\"link\": \"https://www.idnow.io/developers/\", \"text\": \"Developer Hub\"}, {\"link\": \"https://www.idnow.io/developers/\", \"text\": \"Provides the iOS and Android SDK tools and full API documentation.\"}, {\"link\": \"https://www.idnow.io/blog/\", \"text\": \"Blog\"}, {\"link\": \"https://www.idnow.io/blog/\", \"text\": \"Get inspired and stay on top of the latest industry news and insights.\"}, {\"link\": \"https://www.idnow.io/portfolio_category/reports-guides/\", \"text\": \"Reports & Guides\"}, {\"link\": \"https://www.idnow.io/portfolio_category/reports-guides/\", \"text\": \"Would you like to get to the bottom of things? We have reports, guides and further insights available for download.\"}, {\"link\": \"https://www.idnow.io/portfolio_category/case-studies-en/\", \"text\": \"Case Studies\"}, {\"link\": \"https://www.idnow.io/portfolio_category/case-studies-en/\", \"text\": \"Take a look behind the scenes with our industry case studies available for download.\"}, {\"link\": \"https://www.idnow.io/portfolio_category/webinars/\", \"text\": \"Webinars\"}, {\"link\": \"https://www.idnow.io/portfolio_category/webinars/\", \"text\": \"Our experts keep you up to date on all trends & topics in our webinars.\"}, {\"link\": \"https://www.idnow.io/glossary/\", \"text\": \"Glossary\"}, {\"link\": \"https://www.idnow.io/glossary/\", \"text\": \"Our glossary provides up-to-date definitions and explanations.\"}, {\"link\": \"https://www.idnow.io/regulation/what-is-kyc/\", \"text\": \"KYC\"}, {\"link\": \"https://www.idnow.io/regulation/aml-kyc-overview/\", \"text\": \"AML & KYC\"}, {\"link\": \"https://www.idnow.io/fintech/what-is-fintech-regulation/\", \"text\": \"Fintechs\"}, {\"link\": \"https://www.idnow.io/gaming/online-gambling-regulation/\", \"text\": \"Online Gaming\"}, {\"link\": \"https://www.idnow.io/regulation/data-security/\", \"text\": \"Data Security\"}, {\"link\": \"https://www.idnow.io/regulation/data-security/\", \"text\": \" \"}, {\"link\": \"https://www.idnow.io/certification-policies/\", \"text\": \"Certification Policies\"}, {\"link\": \"https://www.idnow.io/certification-policies/\", \"text\": \" \"}, {\"link\": \"https://www.idnow.io/press/\", \"text\": \"Press Room\"}, {\"link\": \"https://www.idnow.io/press/\", \"text\": \"Access the latest press releases and download IDnow company branding assets.\"}, {\"link\": \"https://www.idnow.io/partner/\", \"text\": \"Partners\"}, {\"link\": \"https://www.idnow.io/partner/\", \"text\": \"Become a partner in the global IDnow partnership network.\"}, {\"link\": \"https://www.idnow.io/career/\", \"text\": \"Careers\"}, {\"link\": \"https://www.idnow.io/career/\", \"text\": \"Check out job opportunities in a fast growing B2B software company in Europe.\"}, {\"link\": \"https://www.idnow.io/references/\", \"text\": \"References\"}, {\"link\": \"https://www.idnow.io/references/\", \"text\": \"Get an impression of the customers around the world who trust IDnow with their identity verifications.\"}, {\"link\": \"https://www.idnow.io/core-values/\", \"text\": \"Core Values\"}, {\"link\": \"https://www.idnow.io/core-values/\", \"text\": \" Learn more about the values that guide us as a company.\"}, {\"link\": \"https://www.idnow.io/about-us/\", \"text\": \"About us\"}, {\"link\": \"https://www.idnow.io/about-us/\", \"text\": \"Learn more about IDnow, the company milestones and meet the management.\"}, {\"link\": \"https://www.idnow.io/contact/\", \"text\": \"Contact Us\"}, {\"link\": \"https://www.idnow.io/contact/\", \"text\": \" Are you interested in one of our services? Get in touch with our sales team.\"}, {\"link\": \"https://www.idnow.io/partner/\", \"text\": \"Partners\"}, {\"link\": \"https://www.idnow.io/press/\", \"text\": \"Press\"}, {\"link\": \"https://www.idnow.io/contact/\", \"text\": \"Get in touch\"}, {\"link\": \"https://www.idnow.io/contact/\", \"text\": \" \"}, {\"link\": \"https://www.idnow.io/de/\", \"text\": \"\\n        de        \"}, {\"link\": \"https://www.idnow.io/fr/\", \"text\": \"\\n        fr        \"}, {\"link\": \"https://www.idnow.io/es/\", \"text\": \"\\n        es        \"}, {\"link\": \"https://www.idnow.io/pt/\", \"text\": \"\\n        pt        \"}, {\"link\": \"https://www.idnow.io/platform/\", \"text\": \"Learn more\"}, {\"link\": \"https://www.idnow.io/fintech/\", \"text\": \"Learn more\"}, {\"link\": \"https://www.idnow.io/traditional-banking/\", \"text\": \"Learn more\"}, {\"link\": \"https://www.idnow.io/mobility/\", \"text\": \"Learn more\"}, {\"link\": \"https://www.idnow.io/gaming/\", \"text\": \"Learn more\"}, {\"link\": \"https://www.idnow.io/crypto/\", \"text\": \"Learn more about KYC for crypto\"}, {\"link\": \"https://www.idnow.io/travel/\", \"text\": \"Learn more\"}, {\"link\": \"https://www.idnow.io/telecommunication/\", \"text\": \"Learn more\"}, {\"link\": \"https://www.idnow.io/products/idnow-videoident/\", \"text\": \"Learn more\"}, {\"link\": \"https://www.idnow.io/products/idnow-autoident/\", \"text\": \"Learn more\"}, {\"link\": \"https://www.idnow.io/products/idcheck-io/\", \"text\": \"Learn more\"}, {\"link\": \"https://www.idnow.io/products/idcheck-io/solution-pvid/\", \"text\": \"Learn more\"}, {\"link\": \"https://www.idnow.io/products/idnow-eid/\", \"text\": \"Learn more\"}, {\"link\": \"https://www.idnow.io/platform/\", \"text\": \"\"}, {\"link\": \"https://www.idnow.io/portfolio/holvi/\", \"text\": \"Read the Holvi case study\"}, {\"link\": \"https://www.idnow.io/blog/baptiste-forestier-interview-pvid-technology/\", \"text\": \"\\n      Unpacking PVID and the double-edged sword of technology, with Baptiste Forestier.    \"}, {\"link\": \"https://www.idnow.io/blog/uk-crypto-regulatory-regime/\", \"text\": \"\\n      Road to regulation: UK’s proposed crypto regime.    \"}, {\"link\": \"https://www.idnow.io/blog/ghosting-fraud-dead/\", \"text\": \"\\n      Ghosting fraud: Are you doing business with the dead?    \"}, {\"link\": \"https://www.idnow.io/pr/iata-first-integrated-journey-digital-identity/\", \"text\": \"\\n      IDnow supports IATA in demonstrating first integrated shopping to travel journey using digital identity    \"}, {\"link\": \"https://www.idnow.io/press/#latest\", \"text\": \"See all\"}, {\"link\": \"https://www.idnow.io/contact/\", \"text\": \"Let's talk!\"}, {\"link\": \"https://www.idnow.io/about-us/\", \"text\": \"About IDnow\"}, {\"link\": \"https://www.idnow.io/press/\", \"text\": \"Press\"}, {\"link\": \"https://www.idnow.io/platform/\", \"text\": \"Proofing Platform\"}, {\"link\": \"https://www.idnow.io/faq/\", \"text\": \"FAQ\"}, {\"link\": \"https://www.idnow.io/revocation/\", \"text\": \"Revocation\"}, {\"link\": \"https://www.idnow.io/developers/\", \"text\": \"Developer Hub\"}, {\"link\": \"https://www.idnow.io/certification-policies/\", \"text\": \"Certification Policies\"}, {\"link\": \"https://www.idnow.io/about-us/#management\", \"text\": \"Team\"}, {\"link\": \"https://www.idnow.io/career/\", \"text\": \"Career Opportunities\"}, {\"link\": \"https://www.idnow.io/legal-notice/\", \"text\": \"Imprint / Legal Notice\"}, {\"link\": \"https://www.idnow.io/privacy/\", \"text\": \"Privacy Policy\"}, {\"link\": \"https://www.idnow.io/legal-notice/\", \"text\": \"Imprint / Legal Notice\"}]"
}