{
    "summary": "# THE ADVENTURE MOTORCYCLE CLUB\n\nJoin the Club\n\n## Who We Are\n\nBackcountry Expeditions is an exclusive Adventure Motorcycle Club with a\nunique membership of ADV enthusiasts. The ADV Moto Club delivers four\nfantastic riding opportunities for its members throughout each year, with one\nbeing run overseas. All rides are planned and supported to ensure the very\nbest experience for all riders taking part.\n\n### Why a Club?\n\nBetween 2017 and 2023 we ran tours and training opportunities but quickly\nreached capacity as demand increased. In our experience, too many incompatible\nriders undermines a great riding experience. We’ve found that combining a\ngroup of likeminded riders alongside an epic location, at the right time of\nyear, on a well planned route is the secret to success. The ADV Moto Club\nbrings riders together with a bond and similar approach to their ADV riding\nambitions.\n\n### How does it work?\n\nMembership numbers are capped to guarantee we can maintain and deliver the\nhighest standards of any riding experience. Club members have access to four\nriding opportunities each year, timed to allow plenty of opportunity for\nvariety. All ride planning, delivery and support is provided by the ADV Moto\nClub. Riders either use their own motorcycle or rent one through our partners.\nThe Club also provides a logistical service that picks up, delivers and\nreturns members' motorcycles to ride locations.\n\nBackcountry Expeditions goes above and beyond again and again to make sure the\nclient is taken care of and has the best experience!  \n\nKlaus L\n\nJoin the Club\n\n### Our Experience\n\nPrior to the formation of Backcountry Expeditions in 2017, our two- and four-\nwheel expeditionary experience was honed in a military context. With over 21\nyears experience in planning and delivering global operations, we turned our\nattention to training and running tours in the western United States. Between\n2017 and 2023, we successfully delivered more than 100 motorcycle expeditions\ncovering 500,000+ miles of off-road adventures. We now focus our attention on\nrunning the best ADV Moto Club for our members.\n\n### Should I consider joining?\n\nThe ADV Moto Club is limited in numbers to protect the experience of all our\nmembers, but we are always looking for applicants to join when a place becomes\navailable. If you have the time, knowledge, experience and inclination to plan\nyour own ADV rides, then this might not be for you. But if you're looking for\nan organization to provide four great riding opportunities each year, with the\nknowledge that safety and support is assured, and that you’ll be in the\ncompany of like minded riders, then we invite you to apply.\n\nNeil is a true professional who delivers a unique and exciting experience.\nHighly recommended!!!  \n\nMatthew B\n\nJoin the Club\n\n## Apply to Join the ADV Moto Club\n\nGreat adventure riding experiences depend on the motorcycle, location,\nweather, planning & most importantly, the other riders involved. It is our\ngoal to maintain a membership of respectful and considerate riders.  \n  \nYou don’t have to be the best ADV rider, but you do have to be a team player.\nPut simply, overly demanding and inconsiderate riders need not apply.  \n  \nIf you’d like to find out more about the ADV Moto Club, we’d love to hear from\nyou. Please fill out this quick questionnaire and a member of our team will be\nin touch with further instructions on how to apply:\n\nClub Application\n\nFirst Name\n\nLast Name\n\nEmail\n\nWould you consider yourself a team player?\n\nYes\n\nNo\n\nAre you willing to help other riders in need (who in turn help you)?\n\nYes\n\nNo\n\nDo you ride with respect for other trail users, wildlife and the environment?\n\nYes\n\nNo\n\nDo you agree that a group ride should be fun and enjoyable for everyone?\n\nYes\n\nNo\n\nAre you a competent ADV rider (no-one else can ride your bike for you)?\n\nYes\n\nNo\n\nDo you see value in multiple annual riding experiences with variety in\nlocation?\n\nYes\n\nNo\n\nDo you see value in supported and organized rides?\n\nYes\n\nNo\n\nDo you see value in being part of a like minded ADV rider community?\n\nYes\n\nNo\n\n _(obviously, if you answered ‘No’ to any of the above, this probably isn’t\nfor you)_\n\nIn your own words, please tell us why you would like to join the club\n\nTell us about your best ADV motorcycle experience\n\nSUBMIT APPLICATION\n\nIt was a 5 star experience. Neil made every effort to make the perfect\nexperience for riders.\n\nPradeep K\n\nJoin the Club\n\n## Partners\n\n  1.   2.   3.   4.   5.   6.   7.   8. \n\n## Follow Our Adventures on Instagram\n\nRiding into Navajo Nation on the #AZBDR 🏜️ #\n\nEast of Ophir we climb and ride past toppled Aspen\n\n10 miles of great riding around Anderson Ranch Dam\n\nWho else can’t wait to ride the #UTBDR this year\n\n##### FOLLOW US\n\nCopyright © 2024 · Backcountry Expeditions, LLC · All Rights Reserved ·\nPrivacy Policy · Terms of Service\n\nchevron-rightlinkedin-squarefacebookarrow-circle-rightyoutube-playinstagram\n\n",
    "links": "[{\"link\": \"https://advmotoclub.com/wp-content/uploads/2022/02/mosko-moto-logo.png\", \"text\": \"\"}, {\"link\": \"https://advmotoclub.com/wp-content/uploads/2022/02/woodys-wheel-works-logo.png\", \"text\": \"\"}, {\"link\": \"https://advmotoclub.com/wp-content/uploads/2022/02/klim-logo.png\", \"text\": \"\"}, {\"link\": \"https://advmotoclub.com/wp-content/uploads/2022/02/logo-touratech-usa.png\", \"text\": \"\"}, {\"link\": \"https://advmotoclub.com/wp-content/uploads/2022/02/butler-motorcycle-maps-logo.png\", \"text\": \"\"}, {\"link\": \"https://advmotoclub.com/wp-content/uploads/2022/02/revzilla-logo.png\", \"text\": \"\"}, {\"link\": \"https://advmotoclub.com/wp-content/uploads/2022/03/doubletake-mirror-com-logo.jpg\", \"text\": \"\"}, {\"link\": \"https://advmotoclub.com/wp-content/uploads/2022/02/backcountry-discovery-routes-logo.png\", \"text\": \"\"}, {\"link\": \"https://advmotoclub.com/\", \"text\": \"\"}, {\"link\": \"https://advmotoclub.com/privacy-policy/\", \"text\": \"Privacy Policy\"}, {\"link\": \"https://advmotoclub.com/terms/\", \"text\": \"Terms of Service\"}]"
}