{
    "summary": "This site uses cookies and similar methods to deliver adverts to your\ninterests on third party platforms and analyse our web traffic.  Learn more\nabout how we use cookies.\n\nGot it!\n\n  * Home \n  * About Us \n  * Motorcycle Tours \n  * FAQ's \n  * Contact Us \n\n  1.   2.   3.   4.   5. \n\n# Alpine Motorcycle Tour\n\n30 Jun 2024 - 06 Jul 2024\n\nIf youre looking for a short break that has stunning alpine scenery, some of\nthe best motorcycling roads in the world, covering 3 countries and 13 alpine\npasses, then you have found the right tour.\n\n# Corsica and Sardinia Motorcycle Tour 2024\n\n01 Sep 2024 - 14 Sep 2024\n\n# Grand Alps and Route Napoleon Motorcycle Tour\n\n26 Jul 2024 - 02 Aug 2024\n\nThe tour leads over 16 alpine passes, 6 of which are over 2000m high. Riding\nsouth through French Alps down to the Mediterranean Coast for a day off the\nbikes with the waves lapping over our toes.\n\n# Spanish Picos and Portugal Motorcycle Tour\n\n16 Jun 2024 - 25 Jun 2024\n\nSpanish Picos and Portugal Motorcycle Tour is a touring holiday on some of the\nbest motorcycling roads that Spain and Portugal have to offer.\n\nPrevious Next\n\nLiving the Dream\n\n## Amazing European Guided Motorcycle Tours\n\n### Incredible Roads\n\nEvery biker has a bucket list of roads, or places that they want/need to see.\nWe love the fact that it is our job to help you achieve this. Our tours cover\nsome of the best roads throughout Europe. It doesn't matter if this is your\nfirst time getting on the Euro Tunnel and giving it all a go, or whether this\nis a regular occurrence for you, the roads never disappoint.\n\n### Amazing Scenery\n\nEverything from the gently rolling hills of France to the breath taking beauty\nof the Swiss Alps, the mesmerising Dalmatian Coast road of Croatia, and the\njaw dropping gorges of the French Vercors, we cover them all.\n\n### Unforgettable Experience\n\nMemories that will last a life time. Yes there are fantastic roads, and\nawesome scenery but the friendships and the memories that you create along the\nway are priceless.\n\nGuided Tours\n\n### Looking to ride self guided? We've got you covered.\n\nIf you like to ride in your own time, we now offer a self guided package on\nall of our tours.\n\nView our tours\n\n## Our Tours\n\nAll our motorcycle tour packages include 4-5 star accommodation, a full tour\npack (satnav routes, maps and full daily itinerary), along with an experienced\nguide leading every tour and available 24/7 to ensure you have the best\nexperience.\n\nAdvanced\n\n#### Corsica and Sardinia Motorcycle Tour 2024\n\n01 Sep - 14 Sep 2024\n\nFrom £2930\n\nIntermediate Fully Booked\n\n#### Spanish Picos and Portugal Motorcycle Tour\n\n16 Jun - 25 Jun 2024\n\nFrom £1795\n\nSpanish Picos and Portugal Motorcycle Tour is a touring holiday on some of the\nbest motorcycling roads that Spain and Portugal have to offe…\n\nCheck out all our tours here\n\nIntermediate Fully Booked\n\n#### Vercors Motorcycle Tour\n\n02 Jun - 08 Jun 2024\n\nFrom £1349\n\nThe Vercors Park stands out thanks to its diverse wild and stunning\nlandscapes. Tall limestone cliffs, deep gorges, chasms and caves, high…\n\nBeginner Fully Booked\n\n#### D-Day Landings\n\n14 Jun - 18 Jun 2024\n\nFrom £939\n\nA tour packed full of history while riding your bike around France. Some great\nmotorcycling roads, fantastic Historical sights and museums…\n\nSee all tours\n\n__________\n\nThe Ardennes tour (2023) was my first European riding experience, having only\npassed my bike test 2 years ago (perfect storm of pandemic and mid-life\ncrisis!). As a relatively new rider, I had some reservations about my ability,\nbut I needn’t have worried - the Freedom Motorcycle Tour experience is\nincredibly welcoming and set up from the start to accommodate all levels of\nexperience. I spent a fantastic few days with a great group of people, had a\nload of laughs, the riding was amazing, and the hotel was superb (great\nweather too!). Face and Dee are incredibly knowledgeable and supportive, and\nthey make sure you have a great trip - I honestly can’t recommend it enough.\nMany of our group had been on previous tours with FMT, which says a lot, and\nI’ll definitely be going on another one; can’t wait!\n\nMichael Taylor\n\n26/05/23\n\n__________\n\nI have met and ridden with some of the nicest people that you could ever meet\nand trust whilst riding your bike. Any tour will only be as good as the people\nwho run them, and Freedom Motorcycles Tours are truly awesome and amazing\npeople.\n\nKeith Walters\n\nNovember 18\n\n__________\n\nWell what can I say that others haven't, first time on tour with a group from\nstart to finish all instructions very clear and check in at EuroTunnel very\neasy, marker system explained well before hand and on the train and works very\nwell. Then on to the best part the roads , views and people met on the tour\nwas exceptional and I can't thank Face , the Freedom team and the rest of the\ngroup enough, for making it such a great experience they really know there\nstuff to get the most out of the tour with memorable for life. See you next\nyear guys for another great tour.\n\nStephen Gregory\n\nVercors Motorcycle Tour | June 23\n\n__________\n\nWhy he chooses Freedom, They’re a great company, cover all aspects of customer\nrequirements. Excellent hosts and basically a great laugh. Couldn’t imagine\ndoing these type of tours with another company. We are one big family, friends\nall over the UK. Great roads, great people, great company and a massive laugh.\nLets you forget about general life and concentrate on biking.\n\nStuart Ross\n\nVosges Mountain Motorcycle Tour B | Spanish Picos and Portugal Motorcycle Tour\n| Jan 2019\n\n__________\n\nThe name says it all, I have done a few trips with FMT all been ace, trust me\nyou have the BIGGEST smile ever an as always Dee an Face will literally move\nmountains to help you.\n\nKeith Ramsden\n\nSpanish Picos and Portugal Motorcycle Tour | Vosges Mountain Motorcycle Tour B\n| Black Forest Motorcycle Tour | 03/12/2019\n\n__________\n\n\"I've ridden through and around France for many years, but this was my first\ntime in the Vercors Massif region as a base for daily rideouts and I'm so glad\nI booked it. A day and a half of riding got us into the foothills of the Alps\nand as soon as we reached the Vercors the big grin appeared and never left.\nThis area of France has it all, a great mix of roads to test all abilities,\nfantastic mountain gorge views and safe viewing points for the all important\nphotos. I enjoyed some of my best riding days on this trip and Freedom\nMotorcycle Tours certainly picked some of the best roads to ride on and made\nit an exciting & thoroughly enjoyable experience.\"\n\nCharlie Spicer\n\nVosges Mountain Motorcycle Tour B | Aug 21\n\n__________\n\nWe are now in our third year of touring with Freedom Motorcycle Tours and we\nhonestly can not fault them. The pace is right, no one is pushed beyond their\nlimits, the routes are great and the people they attract make it more\nworthwhile. Within hours everyone knows each other and friendships develop\nfrom an early stage to remain even outside of touring. Cant recommend Face and\nDee enough and loads more touring to come!!\n\nGary and Kelly Cooper\n\nBlack Forest Motorcycle Tour | Spanish Picos and Portugal Motorcycle Tour | 19\nFebruary 2020\n\n__________\n\nI have been riding for 40 year and I chose Freedom Motorcycle Tours based on\nthe reviews that I read. I think the bit I liked the most was the hotels.\nFreedom to me is professionalism and excellence.\n\nLu Mazzoni\n\nSpanish Picos and Portugal Motorcycle Tour | Nov 2019\n\n__________\n\nTicked all the Boxes. Back from another great tour with Freedom Motorcycles,\nthrough the sweeping and winding roads of France, to the Millau Viaduct. Led\nby Michael (AKA Face) and supported by Dee back in the office or, as sometimes\nhappens, from the rear of the group, FMT Tours are well organised and never\nfail to disappoint - I’ve been on a few and have more booked. Face always\nseems to find roads to challenge riders of all abilities with a suitable\nbalance of great riding, scenery, fuel, lunch and coffee stops. Hotels are\nalways to a good standard and in locations close to suitable eateries allowing\nthe group banter to continue well into the evening. I will be back again soon\n\nDavid McConnachie\n\nMillau Bridge and Tarn Gorge Motorcycle Tour | 28/07/23\n\n__________\n\nFace is an absolute legend for making sure that everyone is happy with every\naspect of the tour and is the perfect host to share a few beers with over a\nmeal. His tolerance of my initial inexperience was a very significant factor\nin my returning each year along with my gaining confidence.\n\nIan Leedham\n\nBlack Forest Motorcycle Tour | Alpine Motorcycle Tour | Vosges Mountain\nMotorcycle Tour B | June 2019\n\n__________\n\nWith FMT you get exactly that FREEDOM! Freedom to enjoy yourself not having to\nworry about routes, destinations, hotels etc. Its all well planned in a\nprofessional but relaxed manner so you can just enjoy the ride and chill out\nat night and enjoy your holiday. Once you have been on tour with FMT you just\ncome back for more.\n\nGlenn Regan\n\nAlpine Motorcycle Tour | Grand Alps and Route Napoleon Motorcycle Tour |\nDalmatian Coast and Dubrovnik Motorcycle Tour | 02/12/2019\n\n__________\n\nThe Black Forest tour was my first organised motorcycle tour I had taken part\nin , the whole experience from start to finish was simply fantastic and\nmemorable, Face and Dee are passionate about motorcycle touring and are the\nperfect tour hosts and guides, friendly, approachable and ready to share\nadvice and knowledge at anytime during the tour , I was made most welcomed and\nwas able to ride at my own pace without any pressure whatsoever, this is\nwithout doubt a 5 star recommendation from me and will definitely be touring\nwith FMT again in the future , big thank you to Face and Dee for a wonderful\nexperience\n\nPaul Johnson\n\nBlack Forest Motorcycle Tour | 27/07/23\n\n__________\n\nI have just completed the 2023 Black forest tour B with\nhttps://freedommotorcycletours.com/ In short, don’t know these guys, never met\nthem before the tour and therefore totally unbiased. Never done a tour before,\nnever ridden in a group larger than 3 and never taken a bike to Europe. Start\nto finish, excellent!! Would not hesitate to recommend or use them again. Very\ngood hosts and they worked very hard to give me a truly fab holiday. Thank you\nvery much Dee and Face (Company owners and host on this tour) you made me feel\nvery welcome and at home. Great company, fab group and amazing holiday. Big\nhugs and would be a pleasure to come on tour with you again. If you are in any\ndoubt about which company to go on tour with in Europe. These guys are\nstraight talking, no BS and excellent.\n\nKeith Jolly\n\nBlack Forest Motorcycle Tour | 27/07/23\n\n__________\n\nFreedom were very friendly and more accommodating. Just the dynamics of it was\nexcellent. You just get out and ride. Dont need to worry about routes,\nbookings etc. You can actually enjoy riding stress free. Just outstanding and\nfriendly.\n\nSuresh Kopathalli\n\nSpanish Picos and Portugal Motorcycle Tour | Dec 18\n\n__________\n\nFor us when we book a tour company we really are putting our trust in the\nhands of that company and the people that run it. And since our first trip in\n2016 through to our last trip at the end of the 2019 season, Face, Dee and\nFreedom have made sure our tours away are the best they can be.\n\nMatt and Shirley Ilott\n\nBlack Forest Motorcycle Tour | Black Forest Motorcycle Tour | Spanish Picos\nand Portugal Motorcycle Tour | August 2018\n\n__________\n\nI chose Freedom because of the reviews, plus a personal recommendation. My\nfavourite aspect was mixing with a bunch of like minded riders, and knowing\nyou are going to be shown some great roads. This is a great way to tour Europe\nif you prefer to have it all arranged for you.\n\nAnthony Ford\n\nSpanish Picos and Portugal Motorcycle Tour | Nov 2019\n\n__________\n\n“My recent Vosges Mountains tour with FMT was not only my first group trip,\nbut after many years of UK based riding also my first venture to mainland\nEurope by bike. Everything was really well organised, with clear\ncommunications and guidance from Face & Dee. The experience exceeded all my\nexpectations and I thoroughly enjoyed the whole trip! I will definitely go\nwith FMT again, and it’s a 5-star review from me!”\n\nIan Page\n\nVosges Mountain Motorcycle Tour B | 23/05/23\n\n__________\n\nHello all of you beautiful dolls. Thanks for a great weeks holiday and plenty\nof laughs. Sorry about the singing, I can't help myself lol. A special thanks\nto Face and of course Dee for our great trip. Last but not list I'm now at\nhome safe and sound. Two ring's as my mum would say. Hope to see you all again\nsomewhere over rainbow. There's a song there somewhere I think. I will learn\nthe words for next year. Cheers Kevin. 😁 😁 😁\n\nKevin Hurrell\n\nVercors Motorcycle Tour | June 23\n\n__________\n\nI chose Freedom after doing some research online and checking out a few\nreviews and thought the package looked like the right type of holiday for me -\nand I was right! The riding was superb through beautiful scenery and the\naccommodation was excellent. Key factor which (for me) made it a success was\nthe fact that it was well organised but with a laid back relaxed feel. Drop\noff marker system worked well and lets everyone ride at their own pace. Best\nrecommendation is a re-booking - I have booked the Italian Lakes 2020.\n\nAndrew Rowley\n\nNov 2019\n\nGet in touch\n\n### Got any questions? We'll call you back.\n\nRequest a callback\n\n×\n\n#### We'll call you back.\n\nJust fill in your name and number, we'll do the rest. Speak soon!\n\n__Thanks, we've received your submission.\n\n__There was an issue submitting the form. Please try again.\n\nI give permission for Freedom Motorcycle Tours to handle my personal\ninformation in line with their privacy policy.\n\nCall me\n\nLoading...\n\nFreedom Motorcycle Tours\n\nWe are an European motorcycle tour operator, offering stress-free, fully\nguided motorcycle tours along the very best scenic roads of Europe. We offer\nmany tours including Grand Alps, Spain & Portugal, Dubrovnik & Dalmatian Coast\nand other scenic destinations. Freedom Motorcycle Tours is a company that is\nabout passion, fun, adrenaline, challenges, and brilliant motorcycling\nholidays. If this is what you are looking for then you have come to the right\nplace.\n\n**Follow us!**\n\n__ __\n\n© Freedom Motorcycle Tours 2024 **|** Terms and Conditions **|** Privacy\nPolicy **|** Cookie Policy **|** This website was crafted by\n\n",
    "links": "[{\"link\": \"https://freedommotorcycletours.com/policies/cookie-policy\", \"text\": \"Learn more about how we use cookies.\"}, {\"link\": \"https://freedommotorcycletours.com/\", \"text\": \"\"}, {\"link\": \"https://freedommotorcycletours.com/\", \"text\": \"\\n                        Home                    \"}, {\"link\": \"https://freedommotorcycletours.com/about-us\", \"text\": \"\\n                        About Us                    \"}, {\"link\": \"https://freedommotorcycletours.com/motorcycle-tours\", \"text\": \"\\n                        Motorcycle Tours                    \"}, {\"link\": \"https://freedommotorcycletours.com/faqs\", \"text\": \"\\n                        FAQ's                    \"}, {\"link\": \"https://freedommotorcycletours.com/contact-us\", \"text\": \"\\n                        Contact Us                    \"}, {\"link\": \"https://freedommotorcycletours.com/motorcycle-tours\", \"text\": \"Guided Tours\"}, {\"link\": \"https://freedommotorcycletours.com/motorcycle-tours\", \"text\": \"View our tours\"}, {\"link\": \"https://freedommotorcycletours.com/motorcycle-tours/2024/corsica-and-sardinia-motorcycle-tour-2024\", \"text\": \"\"}, {\"link\": \"https://freedommotorcycletours.com/motorcycle-tours/2024/spain-picos-and-portugal-motorcycle-tour-24\", \"text\": \"\"}, {\"link\": \"https://freedommotorcycletours.com/motorcycle-tours\", \"text\": \"\"}, {\"link\": \"https://freedommotorcycletours.com/motorcycle-tours/2024/vercors-motorcycle-tour-24\", \"text\": \"\"}, {\"link\": \"https://freedommotorcycletours.com/motorcycle-tours/2024/d-day-landings\", \"text\": \"\"}, {\"link\": \"https://freedommotorcycletours.com/motorcycle-tours\", \"text\": \"See all tours\"}, {\"link\": \"https://freedommotorcycletours.com/policies/privacy-policy\", \"text\": \"privacy policy\"}, {\"link\": \"https://freedommotorcycletours.com/policies/terms-and-conditions\", \"text\": \"Terms and Conditions\"}, {\"link\": \"https://freedommotorcycletours.com/policies/privacy-policy\", \"text\": \"Privacy Policy\"}, {\"link\": \"https://freedommotorcycletours.com/policies/cookie-policy\", \"text\": \"Cookie Policy\"}]"
}