{
    "summary": "  * **Menu** Menu\n\n  * ROUTES\n\n    * BDR ROUTES:\n      * Northern California BDR\n      * North East BDR\n      * Nevada BDR\n      * Arizona BDR\n      * Washington BDR\n    *  \n      * Oregon BDR\n      * Southern California BDR\n      * New Mexico BDR\n      * Colorado BDR\n    *  \n      * Wyoming BDR\n      * Mid Atlantic BDR\n      * Idaho BDR\n      * Utah BDR\n    * BDR-X ROUTES:\n      * Black Hills South Dakota\n      * Steens/Alvord Oregon\n      * PA Wilds Pennsylvania\n      * Red Desert Wyoming\n    * IN DEVELOPMENT:\n      * South East BDR\n      * Montana BDR\n      * Michigan BDR\n      * British Columbia BDR\n      * BITE-SIZE BDR MAP COLLECTION\n\n  * ROUTES\n    * BDR ROUTES:\n      * Northern California BDR\n      * Oregon BDR\n      * Wyoming BDR\n      * North East BDR\n      * Southern California BDR\n      * Mid Atlantic BDR\n      * New Mexico BDR\n      * Arizona BDR\n      * Utah BDR\n      * Nevada BDR\n      * Idaho BDR\n      * Colorado BDR\n      * Washington BDR\n    * BDR-X:\n      * Black Hills South Dakota\n      * Steens/Alvord Oregon\n      * PA Wilds Pennsylvania\n      * Red Desert Wyoming\n    * IN DEVELOPMENT:\n      * California BDR North\n      * Montana BDR\n      * South East BDR\n    * BITE-SIZE BDR MAP COLLECTION\n  * NEWS\n    * Events\n    * Route Updates\n    * Latest News\n    * Articles\n  * RIDER RESOURCES\n    * Touring\n    * Training\n    * Bike Rentals\n    * Gear\n    * Bike Shipping\n    * Motorcycle Dealers\n  * STORE\n  * PARTNERS\n    * Industry Sponsors\n    * Supporting Partners\n    * Advocacy Partners\n  * ABOUT\n\n    *       * Mission\n      * Awareness Programs\n      * Film Festival\n      * Frequently Asked Questions\n      * Staff\n      * Board of Directors & Officers\n      * Contact Us\n    * FOR INTERNATIONAL RIDERS:\n      * BDR International Tourism\n\n  * SUPPORT BDR\n    * Become A Supporter\n    * Become A Donor\n    * Our Supporters & Donors\n    * BDR Ambassadors\n    *   * GPS TRACKS\n    * Download GPS Tracks\n  * ROUTE UPDATES\n  * **Menu** Menu\n\nMenu\n\n  * Touring\n  * Training\n  * Bike Rentals\n  * Gear\n  * Bike Shipping\n  * Motorcycle Dealers\n\n# TOURING\n\nIt doesn’t matter if you are a beginner or an accomplished ADV rider, we\nguarantee, if you look through the offerings of these adventure motorcycle\ntouring companies, you will find something worthy of your bucket list –\nwhether its a BDR ride, or a motorcycle tour the world over.\n\n## Colorado Motorcycle Adventures\n\n**WEBSITE**  | **PHOTOS** | **VIDEO**\n\nColorado Motorcycle Adventures has been running top-quality, premiere tours\nfor over 6 years.\n\nRead More\n\nThey are proud to have earned the distinct honor of being the only\nInternational BMW Motorrad Tour Guide Academy certified tour company in the\nentire USA. They wear that badge with honor and continue to develop, and run,\nthe best 5-star tours and adventures in the USA. In addition to their guided\ntours, they offer a wide selection of self-guided tours that you can do on\nyour own, or, they can design a custom tour for you and/or your group to\nwhatever length and level of difficulty you desire!  They offer a complete,\nlate-model rental fleet, as well as Klim riding gear so all you need to do is\nshow up. Colorado Motorcycle Adventures is your premiere facility for a\nmotorcycle adventure that  _excites your senses_  and _  inspires your soul_!\n\n## WEST38MOTO Tours\n\n**WEBSITE**\n\nWest 38 Moto offers tours on the BDR’s and in Baja, CA, as well as custom and\nprivate tours in destinations of your choice.\n\nRead More\n\nFounded by Dusty Wessels, a veteran of the ADV industry, who’s logged over\n250,000 miles on a wide array of big-bike Dual Sport and Adventure motorcycles\nover the last 10 years, their tours go well beyond the typical paths well-\ntraveled.\n\n## Edelweiss Bike Travel\n\n**WEBSITE**\n\nGuided motorcycle tours since 1980. Experience the motorcycle trip of a\nlifetime with Edelweiss Bike Travel – worldwide the #1 in guided motorcycle\nand scooter tours.\n\nRead More\n\n They offer guided, self-guided and custom tours as well as motorcycle\nrentals. Discover the world with Edelweiss Bike Travel and explore the most\nfascinating routes, ride on the newest motorcycles and enjoy the guidance of\nexperienced Edelweiss tour guides.\n\n## Emmaus MotoTours\n\n**WEBSITE**\n\nEmmaus MotoTours is an adventure motorcycle touring company founded with the\ngoal of helping riders of all levels create unforgettable experiences and\nmemories by exploring on two wheels.\n\nRead More\n\nTheir annual roster of tours includes off-road week-long adventures on select\nBDR’s. They are currently offering tours of the AZBDR, COBDR , MABDR and the\nNEBDR.\n\nWhen riding with Emmaus, you’ll enjoy the most breathtaking scenery you could\nimagine, experience varied terrain that will test your skills and focus, and\nyou’ll feel a sense of accomplishment every day. Emmaus also organizes custom\ntours for small groups.  \n\n## Austin Moto Adventures\n\n**WEBSITE**\n\nAustin Moto Adventures is an immersive ADV motorcycle training resort\nexperience in Burnet, Texas, for the new or seasoned rider who wants to learn\nhow to push an adventure motorcycle to its limits, or simply learn the basics\nof off-road riding.\n\nRead More\n\nThey offer some of the best instructors in the country, they emphasize luxury\ncabins and great food, and time around the campfire is priceless. They also\noffer custom BDR tours. Your tribe awaits!  \n\n## MotoVenue\n\n**WEBSITE**\n\nDiscover the untamed spirit of adventure on two wheels at MotoVenue in\nChicago, Illinois.\n\nRead More\n\n  Our off-road motorcycle touring experiences redefine exhilaration, offering\na thrilling blend of expert-led training, real-world BDR Tour preparation, and\nimmersive camping adventures. Whether you’re a beginner seeking the rush of\nthe trail or a seasoned rider craving new challenges, MotoVenue invites you to\njoin our vibrant community and embark on unforgettable off-road journeys in\nthe heart of the Midwest. Unleash your inner explorer today.\n\n## Pine Barrens Adventures\n\n**WEBSITE**\n\nLooking for  Single and Multi day self-guided adventure loops in NJ / PA / VA\n/ WV that are easily accessible from the Mid Atlantic area?  Look no further\nthan the Pine Barrens Adventures GPS TRACK Subscription Service. ****\n\nRead More\n\nOwned and operated by Jack O’Connor (MABDR route co-architect and PA Wilds\nBDR-X architect), for over 20 years Pine Barrens Adventures has organized\nevents and created tracks for AMA National Adventure Rides, Touratech Rallies,\na KTM Adventure Ride, BMW XPLOR events, BDR’s and others.\n\nThrough this  subscription service you will have access to GPS File archives\nand receive new tracks as they’re created. The tracks are similar to past\nevents, such as the Pine Barrens 500, without the crowds and can be done on\nyour schedule. Their GPS experts also offer advice on GPS setup, and can\nprovide enhanced tracks with more info and optional sections. For more info\ncontact Jack O’Connor, Founder, Pine Barrens Adventures LLC at 732-232-7921,\nemail pinebarrensadventures@gmail.com or visit www.pinebarrensadventures.com\n\n## MotoVermont\n\n**WEBSITE**\n\nMotoVermont offers motorcycle tours and training opportunities throughout New\nEngland.\n\nRead More\n\nCome discover and explore Vermont, the New England coast, Nova Scotia and many\nmore amazing riding destinations within a few days ride from our location in\nBurlington, Vermont. Moto-escorts and private tours also available.\n\n## Appalachian ADV\n\n**WEBSITE**\n\nAre you ready to unplug, escape to the wilderness, and challenge yourself?\n\nRead More\n\nFollow Appalachian ADV into sparsely utilized forest service roads and\ndrivable trails, past awe inspiring views and historical sites, and through\nsmall town charms with eclectic Mom n’ Pops at our Rallies and Guided Tours.\nWe offer affordable experiences with a friends & family feel that stretch from\nbeginner to expert, allow people to test their mettle, and learn their limits\nso they can push past them.\n\n## Waypoints West Moto\n\n**WEBSITE**\n\nWaypoints West Moto Adventures believes finding your own way, at your own pace\nis at the heart of a great tour. They are experienced in Colorado, Wyoming &\nUtah routes with flexible options to build your adventure, your way.\n\nRead More\n\nWhether it’s self-guided tours throughout the Rockies or full BDR and the Red\nDesert BDR-X, they have you covered with gear, safety, lodging, so you can\nfocus on the fun.\n\nAs moto enthusiasts, they know executing a smooth trip takes careful attention\nto detail and a focus on empowering riders. They specialize in small-group,\ncustom tours. Bring your own bike or rent one of their KTM 790 Adventures.\nChoose from great local hotels, out-of-the-way guest ranches, or full-on\ncamping.\n\nTour options include a 3-day Red Desert BDR-X, 3-day Alpine loop, 4-day red\nrocks southern Utah loop, and full Colorado & Wyoming BDRs. Their depth of\nexperience exploring the Western U.S. mountains and plains ensures that you\nhave a unique adventure!\n\n## ElePhanT Moto\n\n**WEBSITE**\n\nElePhanT Moto a motorcycle rental and tour company based in Costa Rica and\nColombia.\n\nRead More\n\nAs Official Partner of BMW Motorrad worldwide they offer the latest models of\nBMW dual-sport and adventure motorcycles. Their team is happy to assist with\nroutes suggestions, and offer local knowledge, attention to detail and\nprofessionalism for an unforgettable experience.\n\n## épiCO MoTo ADVentures\n\n**WEBSITE**\n\népiCO MoTo ADVentures is an Adventure Motorcycle Touring company based in Cali\n– Colombia since 2016.\n\nRead More\n\n We offer Guided and Self Guided dual/sport Adventure tours and Motorcycle\nRentals in Colombia – South America.\n\nVisit our website www.epicomotoadv.com for more detailed information about who\nwe are and what we offer.  \nYou can also find costumer reviews on Google and TripAdvisor under epico Moto\nAdventures and Social media.\n\n## WV Adventure Rides\n\n**WEBSITE**\n\nWV Adventure Rides LLC emerged out of a love of nature and the joy of the\nride.\n\nRead More\n\nFocusing on guided tours through MABDR and other West Virginia majestic\njewels, the WV Adventure Rides team believes in achieving well-being through\ncultivating friendships, uniting with nature, expanding human horizons, and\nimproving rider skills. A Romney WV based campsite and entertainment venue is\ncurrently under development to support MABDR riders.\n\n### Subscribe to our mailing list:\n\n  * Email*\n\n  * Untitled\n\n  * Comments\n\nThis field is for validation purposes and should be left unchanged.\n\nΔ\n\n### General Questions:\n\nPhone: (206) 383-6233  \nEmail: info@ridebdr.com\n\n### Route Questions:\n\nEmail: routeinfo@ridebdr.com\n\n###  FREQUENTLY ASKED QUESTIONS\n\n### FOLLOW US!\n\n  \n\n**Backcountry Discovery Routes** is a 501c(3) non-profit corporation. © 2022 -\n2024 Backcountry Discovery Routes, Inc. All rights reserved. Terms of Use.\n\nScroll to top\n\nThis site uses cookies. By continuing to browse the site, you are agreeing to\nour use of cookies.\n\nAccept settingsSettings\n\n### Cookie and Privacy Settings\n\n  \n\n  \n\nHow we use cookies\n\nEssential Website Cookies\n\nGoogle Analytics Cookies\n\nOther external services\n\nOther cookies\n\nHow we use cookies\n\nWe may request cookies to be set on your device. We use cookies to let us know\nwhen you visit our websites, how you interact with us, to enrich your user\nexperience, and to customize your relationship with our website.\n\nClick on the different category headings to find out more. You can also change\nsome of your preferences. Note that blocking some types of cookies may impact\nyour experience on our websites and the services we are able to offer.\n\nEssential Website Cookies\n\nThese cookies are strictly necessary to provide you with services available\nthrough our website and to use some of its features.\n\nBecause these cookies are strictly necessary to deliver the website, refusing\nthem will have impact how our site functions. You always can block or delete\ncookies by changing your browser settings and force blocking all cookies on\nthis website. But this will always prompt you to accept/refuse cookies when\nrevisiting our site.\n\nWe fully respect if you want to refuse cookies but to avoid asking you again\nand again kindly allow us to store a cookie for that. You are free to opt out\nany time or opt in for other cookies to get a better experience. If you refuse\ncookies we will remove all set cookies in our domain.\n\nWe provide you with a list of stored cookies on your computer in our domain so\nyou can check what we stored. Due to security reasons we are not able to show\nor modify cookies from other domains. You can check these in your browser\nsecurity settings.\n\nCheck to enable permanent hiding of message bar and refuse all cookies if you\ndo not opt in. We need 2 cookies to store this setting. Otherwise you will be\nprompted again when opening a new browser window or new a tab.\n\nClick to enable/disable essential site cookies.\n\nGoogle Analytics Cookies\n\nThese cookies collect information that is used either in aggregate form to\nhelp us understand how our website is being used or how effective our\nmarketing campaigns are, or to help us customize our website and application\nfor you in order to enhance your experience.\n\nIf you do not want that we track your visit to our site you can disable\ntracking in your browser here:\n\nClick to enable/disable Google Analytics tracking.\n\nOther external services\n\nWe also use different external services like Google Webfonts, Google Maps, and\nexternal Video providers. Since these providers may collect personal data like\nyour IP address we allow you to block them here. Please be aware that this\nmight heavily reduce the functionality and appearance of our site. Changes\nwill take effect once you reload the page.\n\nGoogle Webfont Settings:\n\nClick to enable/disable Google Webfonts.\n\nGoogle Map Settings:\n\nClick to enable/disable Google Maps.\n\nGoogle reCaptcha Settings:\n\nClick to enable/disable Google reCaptcha.\n\nVimeo and Youtube video embeds:\n\nClick to enable/disable video embeds.\n\nOther cookies\n\nThe following cookies are also needed - You can choose if you want to allow\nthem:\n\nClick to enable/disable _ga - Google Analytics Cookie.\n\nClick to enable/disable _gid - Google Analytics Cookie.\n\nClick to enable/disable _gat_* - Google Analytics Cookie.\n\nAccept settingsHide notification only\n\nNotifications\n\n",
    "links": "[{\"link\": \"https://ridebdr.com/orbdr/\", \"text\": \"\"}, {\"link\": \"https://ridebdr.com/blackhills\", \"text\": \"\"}, {\"link\": \"https://ridebdr.com/in-dev\", \"text\": \"\"}, {\"link\": \"https://ridebdr.com/in-dev\", \"text\": \"\"}, {\"link\": \"https://ridebdr.com/news/bite-size-bdrs/\", \"text\": \"\"}, {\"link\": \"https://ridebdr.com/orbdr\", \"text\": \"\"}, {\"link\": \"https://ridebdr.com/blackhills\", \"text\": \"\"}, {\"link\": \"https://ridebdr.com/in-dev\", \"text\": \"\"}, {\"link\": \"https://ridebdr.com/in-dev\", \"text\": \"\"}, {\"link\": \"https://ridebdr.com/in-dev\", \"text\": \"\"}, {\"link\": \"https://ridebdr.com/news/bite-size-bdrs/\", \"text\": \"\"}, {\"link\": \"https://ridebdr.com/touring/#top\", \"text\": \"\"}, {\"link\": \"https://ridebdr.com/touring/\", \"text\": \"\"}, {\"link\": \"https://ridebdr.com/bdr-faqs/\", \"text\": \"\\n\\tFREQUENTLY ASKED QUESTIONS\\n\\t\"}, {\"link\": \"https://ridebdr.com/terms-of-use\", \"text\": \"Terms of Use\"}]"
}