{
    "summary": "\n\n**Individual request**\n\n**Newsletter**\n\n**Account**\n\nLog In\n\nSign up\n\n**Contact us**\n\n**About us**\n\n**Become a partner**\n\n**Privacy**\n\n**Terms of use**\n\n**FAQs**\n\n**Legal Notice**\n\n$TEXT\n\nCategory\n\nMotorcycle Tours\n\nMotorcycle Training\n\nMotorcycle Shipping\n\nMotorcycle Hotels\n\nFerries\n\nMost Popular\n\nUSA\n\nGermany\n\nItaly\n\nSpain\n\nNorway\n\nFrance\n\nSouth Africa\n\nNamibia\n\nNew Zealand\n\nCorsica\n\nSardinia\n\nScotland\n\nBalkans\n\nContinents\n\nEurope\n\nAfrica\n\nAsia\n\nNorth America\n\nSouth America\n\nOceania\n\nCountries\n\nAlbania\n\nAndorra\n\nArgentina\n\nArmenia\n\nAustralia\n\nAustria\n\nBaltics\n\nBelize\n\nBolivia\n\nBosnia-Herz.\n\nBotswana\n\nBrazil\n\nBulgaria\n\nCambodia\n\nCanada\n\nChile\n\nChina\n\nColombia\n\nCosta Rica\n\nCroatia\n\nCuba\n\nCzech Republik\n\nEcuador\n\nFrance\n\nGeorgia\n\nGermany\n\nGreat Britain\n\nGreece\n\nIceland\n\nIndia\n\nIran\n\nIreland\n\nItaly\n\nKazakhstan\n\nKenya\n\nKyrgyzstan\n\nLaos\n\nLuxembourg\n\nMadagascar\n\nMexico\n\nMongolia\n\nMontenegro\n\nMorocco\n\nMyanmar\n\nNamibia\n\nNepal\n\nNew Zealand\n\nNicaragua\n\nNorway\n\nOman\n\nPeru\n\nPoland\n\nPortugal\n\nRomania\n\nRussia\n\nScotland\n\nSlovakia\n\nSlovenia\n\nSouth Africa\n\nSpain\n\nSri Lanka\n\nSweden\n\nSwitzerland\n\nTajikistan\n\nTanzania\n\nThailand\n\nTurkey\n\nUSA\n\nVenezuela\n\nVietnam\n\nZimbabwe\n\nTerrains\n\nOnroad\n\nOffroad\n\nCombo Onroad / Offroad\n\nBrands\n\nTours on Harley®\n\nTours and training on BMW\n\nTours and training on KTM\n\nBlog\n\nde | en\n\nde\n\nen\n\n  *   *   * image/svg+xml\n\n MOTOURISMO suspends operations for now >\n\n# Find and Book Motorcycle Tours USA\n\n## Take the long way home\n\nMore info\n\nStart\n\nReturn\n\n  * Reset\n  * Andorra \n  * Argentina \n  * Armenia \n  * Australia \n  * Baltics \n  * Belize \n  * Bhutan \n  * Bolivia \n  * Bosnia-Herz. \n  * Botswana \n  * Brazil \n  * Bulgaria \n  * Chile \n  * China \n  * Costa Rica \n  * Germany \n  * Ecuador \n  * France \n  * Georgia \n  * Greece \n  * Great Britain \n  * India \n  * Iran \n  * Ireland \n  * Iceland \n  * Italy \n  * Cambodia \n  * Canada \n  * Kazakhstan \n  * Kenya \n  * Kyrgyzstan \n  * Colombia \n  * Croatia \n  * Cuba \n  * Laos \n  * Luxembourg \n  * Morocco \n  * Mexico \n  * Mongolia \n  * Montenegro \n  * Myanmar \n  * Namibia \n  * Nepal \n  * New Zealand \n  * Nicaragua \n  * Norway \n  * Oman \n  * Austria \n  * Peru \n  * Poland \n  * Portugal \n  * Romania \n  * Scotland \n  * Sweden \n  * Switzerland \n  * Zimbabwe \n  * Slovakia \n  * Slovenia \n  * Spain \n  * Sri Lanka \n  * South Africa \n  * Tanzania \n  * Thailand \n  * Czech Republik \n  * Turkey \n  * USA \n  * Venezuela \n  * Vietnam \n\nAll USA Motorcycle Tours\n\nAll USA Motorcycle Tours\n\n## What are you looking for?\n\n### Motorcycle tours  \nUSA 2023\n\nAre you a long-term planner? So are we - that's why you can already find many\nUSA motorcycle tours for 2023 here. Have fun planning!\n\n### Motorcycle tours USA  \nincl. flight\n\nJust put the entire travel organisation into the experienced hands of our\npartners. You will also be helped find the appropriate flight if you’re from\noutside the USA.\n\n### USA  \nRoute 66\n\nOf course, the heart of every motorcycle tour in the US is the Route 66.\nWhether a part or the whole route - here you will find what you are looking\nfor.\n\n### Motorcycle tours USA  \non a rental Harley®\n\nYou think a motorcycle tour in the USA is only real on a Harley-Davidson®?\nThen this way, please.\n\n### Motorcycle tours USA  \nself-guided\n\nWith these motorbike tours you are wild and free (but luckily everything is\norganized for you nevertheless).\n\n### Motorcycle tours USA  \nWest Coast\n\nFrom the wild Pacific Northwest to Baja California - maybe even in one go? Of\ncourse, the partial routes are also fascinating.\n\n#### Motorcycle shipping inside the U.S.\n\nWe understand that shipping your motorcycle can be a stressful event. Relax,\nand let the professional motorcycle movers handle the load.\n\n## Ride on, buddy!\n\nWelcome to the home of Route 66 and Highway No. 1, the Indian Summer and the\nRocky Mountains - and of course one of the biggest cult motorcycle brands. But\nriding Harley-Davidson® is not an obligation in the endlessly gigantic\ndreamland for motorcycle tours of all kinds.  \n  \nYou would already like to plan your USA motorcycle tour for 2022? Here you\nwill find the right offers.\n\nIt was Americans who have made riding as such a purpose in life - singing\nabout it in rock songs whose number is as infinite as the vastness of this\ntruly gigantic country: Canned Heat’s \"On the road again\", CCR’s \"Travelin’\nBand\", The Doobie Brother’s \"Rockin’ down the Highway\", Tom Cochrane’s \"Life\nis a highway\" - the list doesn’t end. Not to mention cult movies like \"Easy\nRider\". No wonder, after all, all roads in this huge country are long. Roads\nperfectly suited to enjoying the feeling of freedom on a motorcycle. And where\nelse would you want to do it, if not in the Land of the Free.  \n  \nA motorcycle tour in the United States not only offers the perfect motorcycle\nroutes for relaxed easy riding - there are also exciting, winding mountain\nroutes and of course endless off-road tracks. After all, freeriding is a\npopular sport in the USA.  \n  \nThe offers for a motorcycle tour USA take you to warm Florida or into the hot\ndesert of Nevada, through the New England states, across the country from East\nCoast to West Coast or all the way north through Canada to Alaska. We offer\nguided motorcycle tours or self-drive tours, each lasting several weeks as\nwell as day tours, on-road and off-road trips. If you want something uniquely\nyours, you can also get a custom motorcycle tour from us, designed to your\nliking.  \n  \nNothing is more authentic than experiencing America on a motorcycle. There are\nmotorcycle tours to suit every taste. You won’t forget your bike trip through\nthe endless vastness with stops at truck stops, diners and barbecue\nrestaurants for the rest of your life. Riding a motorcycle through the U.S. is\nthe epitome of freedom, life and rock’n’roll.\n\n### Classic No.1: USA Motorcycle Tours along Route 66\n\nRiding the most legendary route in the traditional direction on a motorcycle\nfrom east to west is the dream of many bikers, and rightly so - even if the\noriginall Route 66 no longer exists in its entirety. Nevertheless, endlessly\nlong highways, cosy biker bars and typical American burger restaurants next to\nthe big cities and national parks are the highlights of such a trip.  \n  \nThe best time to travel through the USA on a motorcycle tour are May, August\nand September. Since the route from Chicago to Santa Monica crosses different\nterritories and has to cope with different altitudes, you can expect weather\nfluctuations. You should be aware of this when packing your bike bags.  \n  \nYou can choose between guided motorcycle group tours with a tour guide,\noftentimes with an accompanying vehicle for luggage transport, which usually\ntake place on fixed dates, or tours for self-guided riders who want to start a\nfully organised tour on their own with their own or a rental motorcycle, pre-\nbooked hotels and route plan.  \n  \nYou travel to Chicago and spend the first night in a hotel so that you can\nstart your motorcycle trip the next day rested. The following day you can take\nover your motorcycle at the rental station in the morning and start your dream\nvacation.  \n  \nYou pass the \"Gateway to the West\", the pioneer city St. Louis. You look at\nthe over 600 feet high Gateway Arch, the landmark of the city, a steel arch,\ninside which gondolas take you to the top and a wonderful view of the city.\nLater, the Route 66 takes you through Missouri, Kansas and Oklahoma, heading\nfor Amarillo.  \n  \nA relic of the highway’s heyday awaits you here: the Cadillac Ranch. You know\nthe ten vehicles that were driven vertically into the ground as a fantastic\nphoto motif. You’ll rest your motorcycle at Adrian, the geo-mathematical\ncentre of the old route, where you’ll find a place for lunch and an\ninteresting car museum.  \n  \nYou ride your bike through Santa Fe, through Gallup and through Navajo Land to\nChinle. Along the way you’ll encounter not only endless wideness, but also the\nFour Corners, the only point in America where four states border each other:\nArizona, New Mexico, Colorado and Utah. On your motorcycle tour you’ll visit\nthe petrified forest and the natural wonder of the Painted Desert - both of\nwhich were created out of a whim of nature and show a spectacular play of\ncolors through different shades of light.  \n  \n\n  *   *   * \n\nFurther west you reach Flagstaff between the Navajo and Hopi Indian\nreservations and are already approaching one of the greatest highlights of\nyour motorcycle tour: the Grand Canyon. It’s hard to find anything more\ngigantic and impressive in this world.  \n  \nOnwards with your motorcycle via Williams to Seligman, where the historic\nroute leads to Santa Monica. On this part of the route you can still ride the\noriginal route, which you can find out about in Seligman in the Visitor Center\nof the route. Check out Angel Delgadillo’s legendary barbershop, get shaved\nand buy one of the many souvenirs along the way.  \n  \nOn your way to Las Vegas, be welcomed at Lilo’s Café, run by an emigrated\nGerman, before turning onto the dazzling Las Vegas Boulevard in the gambling\ncity.  \n  \nEnjoy the moment you enter, but don’t get too distracted from traffic by these\nthousand glittering neon signs. Turn night into day, go play in the casinos,\nlet yourself drift. Las Vegas is full of surprises and superlatives. Don’t\nmiss the Highroller, the biggest Ferris wheel in the world, and enjoy the wide\nview over the Las Vegas Strip at night in the closed gondolas.  \n  \nThe final part of Route 66 motorcycle tours takes you to the Sahara Oasis,\nAmboy and an old silver mine in the Mojave Desert. The place is called Calico\nand is a lovingly restored western town that really has a lot of atmosphere\nand is worth a visit.  \n  \nYou ride your bike your last stage and with it the last miles of the legendary\nRoute 66. Many motorcycle tours in the USA end here, at the Santa Monica Pier\nin Los Angeles, where the route officially ends. Here you have the chance to\nsavor the moment of your life when you could say that you have travelled\nacross the USA from the Atlantic to the Pacific coast.  \n  \nAfter handing in your motorcycles at the rental station in Santa Monica you\ncan stroll along the promenade and enjoy your fantastic impressions.  \n  \n\n### Classic No. 2: USA Motorcycle Tours along Highway No. 1\n\nMotorcycle tours in the U.S. often lead to Highway No. 1 - and rightly so.\nAmong connoisseurs some might complain about our classic ranking and instead\ndeclare Highway No. 1 without hesitation the most important of all motorcycle\ntours in the United States.  \n  \nFrom Los Angeles to San Francisco there is a beautiful route along the Pacific\ncoast. You start in Los Angeles, and after picking up the rental bikes, the\ntour starts at Santa Monica Pier towards Sunset Boulevard and Malibu.  \n  \nWhile the sun smiles on your bike and on the typical cityscape of L.A., you\nwill enjoy the passing route. The day’s destination is Morro Bay and takes you\npast the Danish capital of America, with its numerous wineries, windmills,\nhorses and farms. The scenery is really worth seeing.  \n  \nThe next big destination is approaching: San Francisco. The route hugs the\nPacific to the left and lures with sights like the infamous prison Alcatraz,\nthe Golden Gate Bridge as well as Lombard Street and San Francisco’s cable\ncars. As much as you enjoy riding your bike, it can’t be a mistake to stay San\nFrancisco two to three days to see the city’s highlights.  \n  \nHighway No. 1 connects the south and north of California from San Diego via\nLos Angeles to the north of San Francisco. It runs along particularly\nbeautiful stretches of coastline known from film and literature. The thriller\n\"Basic Instinct\" with Sharon Stone was shot there. The writer Jack Kerouac\ncreated a literary monument to the Big Sur area with his novel of the same\nname.  \n  \nSome motorcycle tours extend the classic Highway 1 tour by further impressive\ncuts along the Pacific Ocean far to the north - or start the route there going\nin the southern direction: in Seattle, where the much longer tour along the\nfamous coastal road Highway No. 1, combined with Highway 101, forms part of\nthe Panamericana, the \"dream road\" and longest road in the world. It leads\nfrom Alaska to Tierra del Fuego.\n\n### Classic No. 3: USA Motorcycle Tours in Florida\n\nIn Florida, summer, sun and sandy beaches welcome you next to the vibrant\ncities of Miami and Orlando. When not riding your motorcycle on one of our\nfantastic guided or self-guided tours, be sure to check out a sports event or\ntake a helicopter flight over Miami. In the evening you can drink a beer on\nthe famous Ocean Drive and see the most beautiful cars in the world pass by,\nwhich could only be surpassed by the even more beautiful sight of their co-\ndrivers.  \n  \nThe Florida Keys, which are especially recommended for motorcycle tours, are\nvery scenic. A long highway leads from the mainland to Key West - you and your\nbike - for a reward beer at Sloppy Joe’s on Key West. Have fun exploring our\nmotorcycle tours in the United States!  \n  \n\n#### Become a MOTOURISMO Insider and get the best deals to your inbox\n\n### MOTOURISMO\n\n  * Home\n  * Privacy\n  * Terms of use\n  * Legal Notice\n\n### Service\n\n  * About us\n  * FAQs\n  * Contact us\n\n### Extras\n\n  * Individual request\n  * Become a partner\n\n  *   *   * image/svg+xml\n\n© 2023\n\n\n\n",
    "links": "[{\"link\": \"https://www.motourismo.com/en\", \"text\": \"\"}, {\"link\": \"https://www.motourismo.com/en/login\", \"text\": \"\"}, {\"link\": \"https://www.motourismo.com/en/blog.html\", \"text\": \"Blog\"}, {\"link\": \"https://www.motourismo.com/infos/about\", \"text\": \" MOTOURISMO suspends operations for now > \"}, {\"link\": \"https://www.motourismo.com/?region_prefilled=true&view=list&q=&sort_option=start_asc&filter_option_88=88&filter_option_90=90&price_min=0&price_max=15000&duration_min=1&duration_max=90&startDate=01.01.2023&endDate=&bounds%5Bsouth%5D=23.28069345652922&bounds%5Bwest%5D= -171.53070299301146&bounds%5Bnorth%5D=71.08794285195054&bounds%5Beast%5D=-43.91351549301146\", \"text\": \"\"}, {\"link\": \"https://www.motourismo.com/?view=list&q=&sort_option=start_asc&latest_offers=0&filter_option_88=88&filter_option_90=90&filter_option_89=89&price_min=0&price_max=15000&duration_min=1&duration_max=90&startDate=&endDate=&checkbox_filter_option_181=181&bounds%5Bsouth%5D=23.066678951658826&bounds%5Bwest%5D=-128.15159485054005&bounds%5Bnorth%5D=53.217273898980494&bounds%5Beast%5D=-64.34300110054005\", \"text\": \"\"}, {\"link\": \"https://www.motourismo.com/?q=route-66&sort_option=start_asc&filter_option_88=88&price_min=0&price_max=15000&duration_min=1&duration_max=90&startDate=&endDate=&bounds[south]=19.139268206077006&bounds[west]=-124.64049625000001&bounds[north]=50.62111092084057&bounds[east]=-60.83190250000001&view=list\", \"text\": \"\"}, {\"link\": \"https://www.motourismo.com/?view=list&q=harley&sort_option=start_asc&price_min=0&price_max=15000&duration_min=0&duration_max=100&startDate=&endDate=&bounds%5Bsouth%5D=19.139268206077006&bounds%5Bwest%5D=-124.64049625000001&bounds%5Bnorth%5D=50.62111092084057&bounds%5Beast%5D=-60.83190250000001&view=list\", \"text\": \"\"}, {\"link\": \"https://www.motourismo.com/?view=list&q=&sort_option=start_asc&filter_option_88=88&price_min=0&price_max=15000&duration_min=0&duration_max=100&startDate=&endDate=&filter_option_51=51&filter_option_139=139&bounds[south]=21.71694541561919&bounds[west]=-128.64359375000004&bounds[north]=52.334198303919216&bounds[east]=-64.83500000000004\", \"text\": \"\"}, {\"link\": \"https://www.motourismo.com/?view=list&q=&sort_option=start_asc&filter_option_88=88&price_min=0&price_max=15000&duration_min=0&duration_max=100&startDate=&endDate=&bounds%5Bsouth%5D=27.409027774363356&bounds%5Bwest%5D=-175.66418906250004&bounds%5Bnorth%5D=55.99727355803881&bounds%5Beast%5D=-111.85559531250004&view=list\", \"text\": \"\"}, {\"link\": \"https://www.motourismo.com/en/listings/2777-motorcycle-shipping-inside-the-us\", \"text\": \"\"}, {\"link\": \"https://www.motourismo.com/en/\", \"text\": \"Home\"}, {\"link\": \"https://www.motourismo.com/en/infos/privacy\", \"text\": \"Privacy\"}, {\"link\": \"https://www.motourismo.com/en/infos/terms\", \"text\": \"Terms of use\"}, {\"link\": \"https://www.motourismo.com/en/infos/imprint\", \"text\": \"Legal Notice\"}, {\"link\": \"https://www.motourismo.com/en/infos/about\", \"text\": \"About us\"}, {\"link\": \"https://www.motourismo.com/en/infos/how_to_use\", \"text\": \"FAQs\"}, {\"link\": \"https://www.motourismo.com/en/infos/about\", \"text\": \"Contact us\"}, {\"link\": \"https://www.motourismo.com/en/infos/about\", \"text\": \"Individual request\"}, {\"link\": \"https://www.motourismo.com/en/infos/about\", \"text\": \"Become a partner\"}]"
}