{
    "summary": "__Menu\n\n  * Home\n  * Tours (guided/self-guide) __\n    * Route 66 Motorcycle (guided), 15 days\n    * Route 66 Motorcycle (self-guide), 15 days\n    * Route 66 Motorcycle Small Group Tour (guided), 17 days\n    * Half of Route 66 - 8 Days, East\n    * Half of Route 66 - 9 Days, West\n    * Route 66 + Wild West Motorcycle, 16 days\n    * Route 66 + Wild West Motorcycle, 9 days\n    * Route 66 + Wild West Motorcycle, 8 days\n    * Minibus tour on Route 66 (small group)\n    * Bus tour on Route 66\n    * Route 66 by car (11-20+ day holidays)\n    * USA coast to coast via Route 66\n    * Easy Rider Self-Guide Tour\n    * Accommodation on Route 66\n  * Rental __\n    * Motorcycle rental\n    * Car rental\n    * Insurance\n  * Map\n  * Gallery __\n    * Route 66 Magazine\n    * Video gallery\n    * The Fascinating Journey on Route 66: An Iconic American Road Trip\n    * The Fun of Riding Route 66 - A Journey of Adventure and Nostalgia\n  * Shop __\n    * Memorabilia\n    * Programs and tours\n  * F.A.Q.\n  * You say\n  * Contact\n\n# Travel Route 66: exclusive 17 day small group motorcycle tour with free\nexcursion to Milwaukee to visit the Harley-Davidson factory and museum! Best\ntour ever!\n\nRoute 66, AKA \"The Mother Road\". With its 97 years of history this year, Route\n66 began as the road to travel for migrants, dreamers and desperadoes. Later\nit became a must, for generations of holidaymakers, who wanted to explore the\nold pathway to the west. The 1950s were Route 66's peak, when thousands of\ncars drove \"bumper-to-bumper\" to experience the western emigration route.\nHotels, motels, gas stations and other symbols of \"Americana\" sprung up\neverywhere along the way. Much of Route 66's original roads, restaurants, gas\nstations, and landmarks are preserved much as they were in the 50s. In 2024,\nRoute 66 is not only heaven for bikers of all kinds, it’s also one heck of a\nnostalgia trip.\n\nSomewhere in Texas\n\n  * 4500 km\n  * 8 states\n  * 3 time zones\n  * 16 nights/17 days\n  * Experienced guide (gt*)\n  * Quality accommodation\n  * 50+ roadside attractions\n  * Small group (2-4 motorcycles)\n  * Day to Day itinerary\n  * Route 66 music and films\n  * Motorcycle rental and tax\n  * Free gas (gt*)\n\n  * 2 national parks, 1 national monument\n  * Trip to Milwaukee Museum and Factory*\n  * Optional helicopter flight over the Grand Canyon (gt*)\n  * A chance to eat a free 72 oz. steak in Texas\n  * Free transfers (gt*)\n  * Roadside Assistance\n  * Day to Day itinerary with stops on your smart-phone\n  * Usually one departure/year - books quickly\n  * Rated 5/5 based on 23 reviews   \ngt* = On Guided Tour Only\n\n**Contact us** **Current rates** **Tour dates** **Route 66 East (8 days)**\n**Route 66 West (9 days)**\n\n**Book tour**\n\n## Itinerary (17 days)\n\n#### Day 1 - Sunday, September 08, 2024: Meet you in Chicago\n\nWelcome to Chicago the 'Windy City'. Meet you downtown at our hotel where we\nenjoy a great Welcome Dinner and celebration with your fellow riders. Before\nthat you may want to visit some of the highlights Chicago has got to offer: a\nriver sightseeing tour, Willis Tower, Navy Pier, Sphere, some blues or jazz\nclubs - just to name a few.\n\n#### Day 2 - Monday, September 09, 2024 - miles: 142, kilometers: 228\n\nBig day today: We start riding Route 66! When you hear \"Gentlemen Start Your\nEngines\" the fab Route 66 starts indeed and we say good-bye to the windy city\nfor good. One hour out of town is Wilmington. For many this is the spot where\nRoute 66 really begins. It’s here that you’ll find that kitsch classic, the\nGemini giant. It’s a 30 foot tall fiberglass \"muffler man\" from the 1960s.\nBack in those days these giant colossal men were all over the good old US of\nA. They typically held \"tools\" in their hands from mufflers, to hot dogs, to\naxes, and more. In this case, the Gemini Giant holds a rocket ship, a reminder\nof the 1960s space race. As the American landscape changed most of these\nenormous men were eventually retired. But here in Wilmington, the large green\nman holds on.\n\nContinuing on IL 53 to Braidwood, the next photo opportunity is the Polka Dot\nDrive-In at 222 N. Front St with its Elvis, Marilyn, James Dean and Betty Boop\nstatues.\n\nAt 400 S. West St. in Odell, there is a restored Depression-era gas station,\nwhich happens to be very cool. It was built in 1932 and served travelers on\nRoute 66 until the 1960s. Then it became a body shop - until that eventually\nclosed its doors in 1975. Years of neglect took their toll on this old\nStandard station, which is still here today thanks entirely to the\npreservation efforts of the Illinois Route 66 Association and their\nPreservation Committee. Check out the glass visible register type pump, in\nwhich the amount of gas you wanted to purchase was pumped into the glass tank,\nand gravity fed it into the fuel tank.\n\nJust a block away from the old Mobil station, an old Catholic Church stands\nalong Route 66. During what might be called the golden days of Route 66 there\nwas a tunnel which ran underneath Route 66 at this very spot, directly between\nthe school and this church. The tunnel was constructed to give children and\nadults alike safe passage to and from the church. It was eventually filled in\nafter Route 66 and Odell was bypassed by the Interstate.\n\nFurther south and before arriving in Pontiac, we stop for a look at number\n18700 Old Rt. 66. This is the intersection of Pontiac Rd. (2 lane 66) and the\n4 lane Route 66 on the north side of town. Check out the Old Log Cabin Inn. It\nmay look like it’s always been there – but in actual fact it originally faced\nthe much older Route 66 alignment. When the alignment changed the whole\nbuilding was lifted and turned around 180 degrees.\n\nIf we get to Pontiac before 5PM we should visit the museum and Packard\nshowroom in town for a preview of the adventure which lies ahead. Don’t forget\nto take a picture of the mural on the wall of the museum!\n\nIn Towanda at Route 66’s 1954 alignment, an abandoned piece of asphalt with a\npainted map created by volunteers just reinforces the fact that our journey\nhas only just begun.\n\n#### Day 3 - Tuesday, September 10, 2024 - miles: 197, kilometers: 317\n\nAbout four miles beyond Shirley, Illinois, we will arrive to Funks Grove Road.\nThis is a secret place that many people miss on their way. We may stop at the\nMaple Sirup Shop if they can accommodate us.\n\nSoon our bikes will take us to Atlanta IL to check out another huge fibreglass\nman – this one named Tall Paul. This particular \"Muffler Man\" stood for many\nyears in front of Bunyon's across town in Cicero, Illinois along Ogden Ave.\nWhen Bunyon's closed the owners were offered $10,000 for Tall Paul but decided\ninstead to \"permanently loan\" it to the City of Atlanta as one of their Route\n66 Heritage Exhibits. Tall Paul is accessible 24 hours a day.\n\nAcross the street it is Coffee time! We not only have a chance to enjoy\nespresso shots but we also meet Angel in 'The Palms Grill Cafe' - a great\nlittle place with faithfully restored small tables and vinyl-covered chairs\nthat has been serving Route 66 travelers since the 1934!\n\nWe continue our way to the rare still drivable brick-paved 2 lane roads from\n1931! Listed on the National Register of Historic Places, this beautiful 1.4\nmile long piece of restored hand-laid brick road is a segment of 66, placed\nover a concrete roadbed. Located just off this section Rick is waiting for us\nwith antiques, collectibles and great selection of Route 66 souvenirs.\n\nWhen the original route 66 concrete was laid around Virden IL in 1926 a turkey\ncame out of the wild, did a little walking on the fresh surface and made his\nmarks for the next millennium. Now there is a sign we stop at and take a\npicture – how FUN it is (also a smoke break)!\n\nIn Carlinville, the old folks still get to talking about the legend of Angus\nBailey. The man in question was a loner who rode into town on a cold, windy\nnight way back in 1890. He wanted a nice, juicy steak and some fine sipping\nwhiskey, so Bailey walked into a saloon on this spot and sat down to enjoy his\nmeal. Just then a fight broke out. Well it turned out that Angus Bailey was\nthe cause of it, as he was falsely accused of cattle rustling by an ornery\nindividual known as Old Man Merriweather. Before he knew it, Angus was\nswinging from a rope on the north side of the town square. As the snow fell\nthat night, the quiet loner was buried in a shallow grave on the edge of town.\nSo far so tragic but here’s where it gets strange. The story goes that the\nvery next night Angus Bailey walked back into the saloon to finish his meal.\nThe saloon owner, though terrified, prepared one of his finest cuts of beef\nand opened his best bottle of whiskey. When he finished, Angus was seen to\nride back out of town, the same way he had come in. With the wind blowing and\nthe snow falling he never once looked back. Legend has it, the ghost of Angus\nBailey can still be seen north side of the square in Carlinville on nights\nwhen the weather is foul, enjoying the best food and drink in all the county.\nWe had better be fast if we want to do the same, there is no lunch served in\ntown between 2 and 5 PM.\n\nNext stop is Mt. Olive, and the Soulsby's gas station. Open from 1926 until\nthe early 90s this was one of the longest operating gas stations on the old\nMother Road. Henry Soulsby built it in order to have a business to pass on to\nhis son Russell, and the landmark filling station would continue pumping gas\nfor another fifty years after the Route 66 designation had been removed from\nthe pavement outside. Russell Soulsby was trained in the Army as an\nelectronics repairman and used the north side of the station to run a second\nbusiness - of servicing the community's radios and televisions.\n\nAlong with the bright reds and yellows of the recent restoration, the most\nstriking feature of Soulsby's Station is on the south side of the property\nwhere the repair rack shares space - quite intimately - with an old oak tree.\nWith no room inside for automobile service, repairs were all made on the steel\nramp outside. Over the years a tree began to spring up between the tire rails\non the rack. It’s still there, rising up out of the middle, preventing modern\nautomobiles from venturing up onto it. This Mount Olive landmark gives Route\n66 another signature quirk.\n\nNext stop is the **Country Classic Cars** \\- a dealer that has about 600\nclassic cars for sale in sheds we can visit. This sight is too much to\nabsorb...\n\nStaunton has another special treat for true Route 66 aficionados. We can't\npass through Staunton without a stop at Henry's Rabbit Ranch. Look out for the\nbright \"Hare It Is\" sign located on the old 1930 - 1940 alignment of Route 66.\nThis sign is actually a riff on the renowned \"Here It Is\" sign at the\nJackrabbit Trading Post on Old Route 66 in Arizona.\n\nThe Chain of Rocks Bridge was, for a time, the path used by Route 66 to cross\nover the Mississippi river, carried Route 66 traffic across the Mississippi\nfrom Illinois to Missouri from 1929 through 1967. It’s most notable feature is\nthe 22-degree bend occurring at the middle. This peculiarity was necessary to\nestablish sound footings in the treacherous channel. The bridge now only\ncarries walking and biking trails over the river.\n\nCORB was added to the National Register of Historic Places in 2006.\n\n####  Day 4 - Wednesday, September 11, 2024 - miles: 247, kilometers: 397\n\nToday we will not only ride on Route 66's finest roads, but stop at the\nFanning 66 Outpost. Stocked with a goodly selection of Route 66 souvenirs and\ncollectibles including a taxidermy shop, archery range and the world’s largest\nrocking chair, according to the Guinness Book of Records. At 46 inches tall\nand weighing some 26,500 pounds it could hardly be anything else!\n\nDevil’s Elbow is a famous or should we say infamous stretch of Missouri Route\n66 legend - and the Big Cut area of the Mother Road. It used to be considered\none of the most dangerous sections of old Route 66. Today it is an agreeable\nbreak in a pleasant, park-like setting.\n\nDevil's Elbow was a popular resort town in the 1930s and 40s. With the\npicturesque Big Piney River’s and the beautiful Ozark Hills as a backdrop it’s\neasy to see why.\n\n####  Day 5 - Thursday, September 12, 2024 - miles: 202, kilometers: 325  \n\nWe visit \"Gay Parita Service Station\" first thing in the morning. This is a\nmust stop in a wonderful world of Route 66 attractions. We could easily spend\nhours just going through all the treasures there.\n\nWelcome to Kansas! Kansas has got the shortest stretch of Route 66 asphalt:\nonly 13 beautiful miles. In Galena there is a chance we meet \"Tow Mater\" from\nthe movie CARS – the original 1951 International boom truck next to the old\ngarage on the old Route 66 where we have lunch.\n\nOn our way to Baxter Springs, Kansas and just few miles west of Riverton we\ncome to the Marsh Arch \"Rainbow Bridge\" on the old alignment of Route 66. This\nis one elegant old bridge, though it is far smaller than the old Spring River\nBridge, which did not survive the \"new is better\" ethos so evident during the\n1970s and 80s.\n\nAs we ride through Miami (and we are starving) we won’t miss Waylan’s Ku-Ku\nBurger with its giant Cuckoo Clock outside. This little fast food restaurant\nwith a cuckoo bird popping out of its cuckoo clock roof has been a Route 66\nicon for decades.\n\nThen, listed on the National Register of Historic Places, the appropriately\nnamed Totem Pole Park is home to the World’s Largest Concrete Totem Pole, a 90\nfoot totem pole that towers over the park in an astonishing array of folk art\ncolors, with the four nine-foot Indians near the top each representing a\ndifferent tribe.\n\nBetween 1937 and 1948, one Ed Galloway built the totem pole utilizing some 28\ntons of cement, six tons of steel, and 100 tons of sand and rock. Ed’s\npersonal tribute to the American Indian features a collection of some 200\ncarved pictures.\n\n#### Day 6 - Friday, September 13, 2024 - miles: 217, kilometers: 350\n\nWe begin the Ozark Trail section by crossing over Rock Creek, an iron bridge\nwith a brick deck from 1925; passing by a real relic of Americana, a defunct\ndrive-in movie theater, and then hang onto the curves through a narrow RR\nsubway.\n\nSeaba Filling Station: listed on the National Register of Historic Places,\nthis Route 66 landmark is now filled with over 65 vintage motorcycles from\n1908 to present. The Seaba Station was built in 1921, five years before\nhistoric Route 66 was certified as a national highway. Let us pay a visit to\nbrowse through motorcycle displays, antiques, souvenirs and more.\n\nAt Arcadia, Travelers frequently pause to consider the statue of Washington\nIrving, and all his works and deeds. Then there’s the iconic Round Barn,\naccording to many the most photographed spot of all on Route 66. These days\nthere is yet another reason to stop in Arcadia: POP'S, a somewhat futuristic\nlooking restaurant on Route 66 that’s bound to become one of the many\ninstantly recognizable landmarks on \"America’s Main Street\"!\n\nThe National Cowboy & Western Heritage Museum on Oklahoma City features a\nsuperb collection of classic and contemporary western art. The exhibition wing\nhouses a turn-of-the-century town and interactive history galleries that focus\non the American cowboy, rodeos, Native American culture, Victorian firearms,\nfrontier military and western performers.\n\nWe continue our trip West reaching the interestingly named South Canadian\nRiver and the 38-arch bridge which traverses it. This bridge was indeed\nconstructed using 38 low-rise truss arches, some 19 on each side. These arches\nare also known as \"ponies\": they are painted yellow and visible from some\ndistance. Take a quick look at our little video of crossing the bridge, which\nhappens to be gateway to one of the most pleasant drives on all of Route 66.\nIt’s here you get the authentic feeling that comes from riding on a two-lane\ncement road which hugs the very contours of the earth, and rises and falls\ngently with the hills. Going down this road you get a sense of what it must’ve\nbeen like crossing Route 66 back in the 1930s ... except that you're almost\ncertainly going much faster than they did back then!\n\nThe seams in the cement reverberate with a gentle rhythm on the ride up to the\nOklahoma Route 66 Museum. Largely due to Jim Ross and Shellee Graham's many\nfine Route 66 photographs, probably this is the best out of the many museums\non Route 66.\n\n#### Day 7 - Saturday, September 14, 2024 - miles: 193, kilometers: 311\n\nAs befits its name, The National Route 66 Museum in Eric celebrates Route 66,\nnot just in the state of Oklahoma, but all eight Route 66 states. The museum\nfeatures a walk through scale model of all eight states focusing on the\nordinary folk who lived, worked and traveled the old Mother Road. The murals\nare quite realistic and the exhibits include vintage automobiles and antiques\nfrom the bygone hey-day of Route 66.\n\nOne of the loneliest sections of Route 66  \nErick OK\n\nThere was a time when everything west of Eric was considered to be the \"Great\nAmerican Desert\". This is also explained by the fact that until it was\nrealigned, Erick used to be right on the Texas border.\n\nWe go just one block south of Roger Miller Boulevard and check Bonebrake\nHardware \"Museum\". In the 1960s the owners retired: just locked the doors for\nthe night and left. Nobody has ever seen them after. Today you can look in the\nstore windows to see dusty counters and inventory, otherwise unchanged.\n\nThere was a time, the 1930s to be precise, when Shamrock was a prosperous oil\ntown. A conspicuous reminder that the old Route 66 ran through Shamrock, is\nthe Tower Service Station and **U-Drop Inn Conoco** , since 1936 it’s been a\nTexas Route 66 milestone. The U-Drop Inn Cafe, named by a local schoolboy in a\ncontest that awarded him $50.00 for his idea. To this day, it is still one of\nthe most upscale eateries on U.S. Highway 66 between Oklahoma City and\nAmarillo.\n\nOozing old time atmosphere, the small Panhandle town of McLean is a trip back\nin time to a true Route 66 experience.\n\nMcLean’s Devil's Rope Museum is dedicated to barbed wire, or the Devil's rope\nas it’s sometimes called around these parts. The Museum features the history\nof barbed wire, and artifacts which are a reminder of the significance of this\ninvention, and its impact on the Old West’s development.\n\nThe restored Phillips 66 Gas Station – Now this is truly history. Not only was\nit the first Phillips 66 Service Station in Texas, built as it was in 1927,\nbut the gas pumps show the price of gas at a mere 19¢ a gallon!\n\nOn we ride, to another historic railroad town, this one dating back to 1902,\nGroom, Texas. Arguably its chief attraction is the neck-turning \"Leaning Tower\nof Texas\" actually just a water tank tipping perilously to one side. One leg\nof the Britten USA water reservoir is actually shorter than the others. It was\nbuilt this way just to catch the tourist's eye and get them to stop for a\nwhile in Groom. Another attraction for the Interstate traveler is the Groom\nCross. With a height of 190 feet, the Groom Cross is reported as being the 2nd\nbiggest cross in the northern hemisphere. Built on private property it is\nvisible for miles as you approach this panhandle town. Though it doesn't date\nback to the very first days of Route 66 it’s definitely in the spirit of the\nold Mother Road.\n\nThen, you can’t miss them and why would you want to? We mean ten graffiti-\ncovered cars that are half-buried, nose-down and rise up out the desert\nterrain, and collectively known as The Cadillac Ranch. Built in 1974 by\nStanley Marsh and The Ant Farm, a San Francisco Art Collective, the ranch is\nlocated along the fringes of historic Route 66 facing west \"at the same angle\nas the Cheops' pyramids.\" The Cadillacs are all emblematic of the \"Golden Age\"\nin American Automobiles (1949 through 1963). The line-up of cars and their\nposition all the way out in a field allows for some atmospheric photography.\nTheir distance from any watchful eye of authority also encourages ever-\nchanging layers of painted graffiti, which Marsh has never had much of a\nproblem with. Interesting to note however, that in 1997 encroaching\ndevelopment forced Marsh to pick up and move the whole Caddy farm that much\nfurther West.\n\nWhen Amarillo and the 66 come to mind, one of the first places you probably\nthink of would be the Big Texan Steak Ranch, and if not, it should be. Open\nsince 1960, The Big Texan has become world-renowned for its 72oz steak eating\nchallenge. If you can eat a shrimp cocktail, salad, baked potato with fixin's,\nand a 72oz steak (about 2 kg) within 60 minutes your meal is free! But if you\ncan’t quite make it, you’ll have to foot a bill of around $70 plus tip. Only\naround 1 in 6 customers are successful, according to the **Big Texan\nwebsite**.\n\n####  Day 8 - Sunday, September 15, 2024 - miles: 301, kilometers: 485  \n\nWe have officially reached the halfway mark when we arrive at the town of\nAdrian, Texas. This little Route 66 town’s claim to fame is that it’s the\nmidpoint of the 2,278 miles between Chicago, IL and Santa Monica, CA. Some\npictures under the halfway sign are a photo opportunity too good to miss.\n\nOn the border of Texas and New Mexico we visit the \"Ghost Town\" of Glenrio\nbuilt in 1926. Current population now is 2.\n\nOnto to New Mexico and a full day of both riding and sightseeing, we ride\nthrough Tucumcari, where the neon lights of the archetypal motel The Blue\nSwallow have been a beacon for road weary travelers since 1939. Lunch at a\nMexican restaurant fortifies us for the afternoon in Tucumcari\n\n#### Day 9 - Monday, September 16, 2024 - Rest day!\n\nA well deserved break! It is time for a little rest now and Santa Fe is a\nperfect spot. You can do the laundry, visit the many galleries and art\nexhibitions or just relax by the pool!\n\n#### Day 10 - Tuesday, September 17, 2024 - miles: 176, kilometers: 238\n\nWhen **Wild Hogs** came to Madrid... If you have always been curious about\nwhat it would be like to be living in the midst of a major movie production\nwhile it’s being shot, than this site should be right up your street. It\nchronicles the shoot of the Disney movie Wild Hogs as it in took place in\nMadrid, New Mexico. The film is about ageing suburban bikers who face down a\nserious gang and starred John Travolta and Tim Allen. For an entirely\ndifferent kind of experience, it’s interesting to note that Madrid and the\narea surrounding it, is reputed to be haunted. There has been many a ghost\nsighting around the town, in the old church and the cemetery, but perhaps most\nof all the Mine Shaft Tavern. Both guests and staff have reported seeing doors\npushed open by unseen hands, doors that then swing eerily in the breeze.\nGlasses fall from shelves and smash on the floor, mysterious sounds are heard\nthrough the six inch abode walls, furniture is moved about in the middle of\nthe night, and perhaps strangest of all, employees at the Mine Shaft tell of\nlooking in the mirror to see a ghost staring back at them. Spooky!\n\nNext stop is The 66 Diner which looks, feels and even tastes like a Mother\nRoad classic. Uniformed waitresses work the dining area to the beat of 1950s\nera rock-and-roll blasting from an old time juke box. Bright red ceiling lamps\nare suspended over aqua-blue counter stools. There’s a hopscotch game built\ninto the black and white tiled floor. But best of all you can chow down on\ntraditional Route 66 roadside fare. Try their hamburger or a sloppy Joe with\nFrench fries and a world beater milk shake, or a pounded-tender chicken-fried\nsteak coated in gravy with a side of mashed potatoes. Check out their daily\nblue-plate specials, such as Tuesday’s chicken pot pie and Saturday’s hot\nturkey sandwiches.\n\nA little further west and we arrive at Grants, where we overnight.\n\n####  Day 11 - Wednesday, September 18, 2024 - miles: 211, kilometers: 340  \n\nLet’s check out a real slice of the Old West, Hollywood style. Gallup's El\nRancho Hotel was built in 1937 on historic Route 66, and is now protected and\ncared for by preservationists. Well, back in the olden days of the Western,\nthe Gallup rented rooms to literally 1000s of movie stars while they were in\ntown making movies. And it sure looks the part, with its sweeping staircase\nand huge stone fireplace, plus old Hollywood star portraits and Navajo art\nfilling the two story lobby of this rustic hotel. There’s also a fine\nselection of Southwestern and Mexican cuisine available in the \"Old West\" 49er\nLounge.\n\nIf it’s Native American pottery, baskets, beaded items, artifacts you’re\nafter, you will certainly find them at Richardson's Trading Company located in\nGallup’s downtown area. It’s a great place to select some one-of-a-kind Native\nAmerican artwork.\n\nSome of the most outstanding geologic and fossil records of the Late Triassic\nperiod anywhere can be found at our next destination, Petrified Forest\nNational Park. Driving through the park takes all of 45 minutes but if the\nriders are keen, we can stay a little longer for a prehistoric history lesson.\nResearch conducted in the park turns up new evidence all the time, ranging\nfrom petrified wood to dinosaur bones.\n\n_Tonight we stay in a Wigwam!_\n\nOld time trading posts and motels straight out of 1950s Americana still line\nRoute 66 in Holbrook. The area around Holbrook is a nirvana for rock hounds,\nas the so-called Painted Desert is still fertile ground for discovering\ndinosaur remains. Tonight’s accommodation is something special, for we sleep\nin a wigwam at the Wigwam Motel, where don’t worry, the tents are complete\nwith the amenities for a comfortable stay.\n\n#### Day 12 - Thursday, September 19, 2024 - miles: 106, kilometers: 171\n\nThere are of course many attractions along Route 66, some of which might best\nbe described as curiosities. We can’t stop for all of them, but who could\nresist the charms of a 10 foot high jackrabbit with a saddle across its back?\nThis is a great, tongue-in-cheek photo opportunity. There’s not much else to\ndo at this spot on the I-40 in the middle of the desert, aside from a visit to\nthe Jack Rabbit Trading Post that is.\n\nIt’s certainly curious that despite being in the proverbial middle of nowhere,\nthe Jack Rabbit Trading Post has its own on and off ramps for I-40. The story\nbehind them is this: Back in 1967 an Arizona state senator named Glenn\nBlansett purchased the Trading Post. One of his last acts as a Senator was to\nsee that the I-40 ramps were put in place here. The Jack Rabbit Trading Post\nis still in the Blansett family, but these days it’s his granddaughter Cindy\nwho runs the show.\n\nYou may wonder how these far flung trading outposts ever attracted customers,\nespecially in the days before the mass communications. Typically the owners of\nthese establishments would take a road trip themselves, all 1,000 miles to\nSpringfield, MO. On the way back, they dotted the roadside with billboards.\nThe cumulative effect was such that by the time travelers arrived at a place\nlike Joseph City their curiosity was so piqued they couldn't help but stop.\nPioneers in their own way, the proprietors brought customers to their stores,\nand didn’t let being \"in the middle of nowhere\" stand in their way. Good for\nthem.\n\nUp until the 1960s, Winslow was the biggest town in northern Arizona, but it’s\na familiar story, when the town was bypassed by the I-40 in the 1970s, shops\nand businesses began closing down and the population declined. In 1972\nhowever, \" **Take it Easy** \", the first hit single for those California\nrockers The Eagles came out, and immortalized the town in pop/rock\nconsciousness with the lyric, \"standing on a corner in Winslow, Arizona\".\n\nAbout six miles south of I-40 exit 233 and three miles east of the evocatively\nnamed Two Guns we arrive at Meteor Crater, another one of Arizona’s remarkable\nholes in the ground. It’s the result of an asteroid crashing to earth at a\nspeed of 26,000 miles, some 50,000 years ago. Some 550 feet deep and almost a\nmile in diameter, these days the crater is actually a privately owned tourist\nattraction. Its \"Astronauts Hall of Fame\" plays up the crater’s likeness to\nthe moon, not without justification when you learn that Apollo astronauts used\nto practice their moon-walk at Meteor Crater.\n\nWe ride on through the dense forestland southeast of Flagstaff, passing by the\nsmall seasonal stream of Walnut Creek, which over 1000s of years has engraved\na 600 foot deep canyon into the local Kaibab limestone. As it flows east, it\neventually joins with the Little Colorado River en route to the Grand Canyon.\nOver time, shallow caves were formed in the canyon walls. Way back in the 12th\nto 13th centuries the Sinagua Indians constructed many cave-dwellings high\nabove the canyon floor, along the steep, easily defensible ledges.\n\n#### Day 13 - Friday, September 20, 2024 - miles: 161, kilometers: 259\n\nHowever sky-high your expectations, there’s nothing that really prepares you\nfor the awesome reality of The Grand Canyon. There’s something humbling and\ntranscendent about seeing it for the first time. You will be overawed by both\nits beauty and size. Its great age stands in stark relief to our relatively\nshort time on Earth, and in its vast space, travelers can seek a respite from\nhectic 21st century life.\n\nThis enormous chasm was etched into the Colorado Plateau landscape over\nseveral millennia. Today it is enjoyed by those who come to explore its roads,\nhike its trails, or brave the Colorado River’s surging currents.\n\nWe will book a helicopter flight over the Grand Canyon, and experience the\nworld famous IMAX movie Grand Canyon: 'The Hidden Secrets' at the park\nentrance.\n\nOvernight in the town of Williams, with its quant downtown which is on the\nNational Register of Historic Places. To this day, Williams the town is a\nperfectly preserved piece of small-town America, with its virtually unchanged\nmain street and what’s more, a kind of small town life you just don’t find\nmuch anymore. They still hold a local beauty pageant in Williams, and store\nclerks will happily give you tips on where best to eat.\n\n#### Day 14 - Saturday, September 21, 2024 - miles: 194, kilometers: 311\n\nAs Route 66’s place in American history becomes the subject of ever more\ninterest, Ash Fork’s place on the map seems assured. With all the stone\nquarries surrounding it, Ash Fork bills itself as \"The Flagstone Capital of\nthe World\", It is also starting point for Crookton Road, which has the\ndistinction of being one of the longest stretches of unbroken Route 66 highway\nin existence today.\n\nEventually we arrive to Seligman, which is a great little town, with clean\nstreets and friendly people. There are, it has to be said, gift shops galore,\nmost of them focused on Route 66 and American memorabilia, but there’s also a\nfine selection of biking clothing and accessories such as boots and leather\njackets. Out on the street, there are vintage cars, colorfully dressed\nmannequins, and funny little street signs galore. We make a stop for a hearty\nbreakfast at Frank's place. As you’ll see, it’s a one of a kind.\n\nGrand Canyon Caverns have been a must-see Route 66 tourist spot ever since the\n1930s. A maze of limestone caves some 21 stories underground that wend their\nway all the way to the Grand Canyon, these caverns were formed over the course\nof 35 million years. You could fit 3 football fields inside the parts of the\ncaverns where we can take our tour.\n\nOn a smaller scale but interesting in its own way, is the old gas station at\nHackberry. This former gas station and general store doesn't sell gas these\ndays, but it does sell practically anything and everything associated with Old\nRoute 66. Run by John and Kerry Pritchard, we recommend a walk behind the\nstore, where they keep the really interesting memorabilia. That means old\ncars, sheds, garages, cactus, signs and more than we can list here. You can\neven take a carrot or two and feed the mules beyond the water garden.\n\nThen if you like root beer, may we recommend Mr. D’z Kingman Route 66 Diner,\nproudly serving the finest root beer in the world. Root beer is in fact a kind\nof soda.\n\nBeginning at the town of Kingman, Oatman Road is a winding two-lane road\ntraversing 42 miles of Arizona's striking desert terrain. In combination with\nthe byway's stirring Western history, the scenery creates an atmosphere that\nis unmistakably \"Old West\". In the surprisingly lively ghost town of Oatman,\nwe’ll come across free-roaming burros (wild donkeys), the occasional gunfight\n(staged for your enjoyment), and a collection of scenic storefronts straight\nout of an old John Wayne movie.\n\n#### Day 15 - Sunday, September 22, 2024 - miles: 215, kilometers: 354\n\nIn the Mojave desert on Historic Route 66 we arrive at Roy’s in the town of\nAmboy, California. Roy's Motel/Café and its gas stop is about as iconic a\nlonely desert stop can get, partly because of its many appearances in movies.\nYou could say the town of Amboy has it all: its own airport, garage, school,\nchurch and graveyard - and even a volcanic crater. Everything but a post\noffice, so don’t expect to send any postcards from Amboy.\n\nBottle farm: Elmer has filled his yard with sculptures that resemble trees\ncovered with **bottles**. They're actually pieces of pipe welded together,\nwith hundreds of bottles loosely slipped over the ends so that they tinkle in\nthe wind. There are lots of other odds and ends mixed in, including old signs,\nwheels, mechanical junk, all in all: a great stop, again!\n\n#### Day 16 - Monday, September 23, 2024 - miles: 114, kilometers: 183\n\nOn a palm-lined cliff at the edge of the Pacific Ocean in Santa Monica, only a\nfew blocks away from the city’s landmark pier, old Route 66 came to its\nwestern terminus. The pier supports a small amusement park and a charmingly\nquaint carousel. There’s a beach-front walkway which goes from the pier to\nVenice Beach, the heart of hippy trippy L.A. But keep your eyes peeled, for\nright where Santa Monica Boulevard dead-ends at Ocean Boulevard, there’s a\nbrass plaque which denotes the official end of the \"Main Street of America\".  \n**Your Route 66 tour finishes right on Santa Monica Pier under the sign \"End\nof the Trail\"**. It’s time to return the vehicles and stay the last night in\nLA. Soon you are on your way back home, unless you'd like to visit Las Vegas\nor spend a few more days in California in which case just let us know so we\ncan arrange extended bike hire and accommodation.\n\n#### Day 17 - Tuesday, September 24, 2024 - Los Angeles (California)\n\nDeparture day. Please note: you can take a flight home the previous evening,\nin this case the last night hotel accommodation is reimbursed to you.\n\n**Reverse route notice:**\n\nWe suggest the following route if you start in Los Angeles:\n\n**Option 1**\n\nDay 1: drive to Barstow (121 miles)  \nDay 2: drive to Las Vegas (154 miles) on Hgw 15 or take the old Route 66\n\n**Option 2**\n\nDrive to Las Vegas during day 1 and stay 2 nights there  \nTake Hwy #15 (273 miles) or drive the longer old Route 66 (365 miles)\n\n**Option 3**\n\nNot going to Las Vegas?  \nDrive to Barstow (121 miles) and then Laughlin on old route 66 (190 miles)\n\n####  Tour dates:  \nSep 08, 2024 \\- Sep 24, 2024\n\n**Back to top**\n\nGet your own travel/medical/health/trip cancellation insurance! Book online!\n\n**Contact us**\n\n####  Rates for Small Group Guided Tours (per person):\n\n**1 rider 1 motorcycle 1 room: US$11,500.00** (£8,970.00,  AU$17,365.00,\nNZ$18,630.00, 10.465,00 €)\n\n**2 people 1 motorcycle 1 room, per person: US$5,635.00** (£4,395.00,\nAU$8,509.00, NZ$9,129.00, 5.128,00 €)\n\n**2 people 2 motorcycles 1 room, per person: US$9,200.00** (£7,176.00,\nAU$13,892.00, NZ$14,904.00, 8.372,00 €)\n\nThe rate includes the following model rentals:\n\n  * Harley-Davidson® Street Glide®\n  * Harley-Davidson® Road Glide®\n  * Harley-Davidson® Heritage Softail® Classic\n  * BMW® R 18 Classic\n  * Yamaha® Super Tenere 1200\n\nPlease add $180 for following model rentals:\n\n  * Harley-Davidson® Street Glide® Touring Edition\n  * Harley-Davidson® Road Glide® Touring Edition\n  * BMW® R 1250 GS\n  * BMW R 1250 RT\n\nPlease add $550 for following model rentals:\n\n  * Harley-Davidson® Road Glide® Ultra\n  * Harley-Davidson® Electra Glide®\n\nVarious motorcycle insurances are available that you can book with your\nrental, for more information please have a look at our Insurance webpage.\n\nIt is possible to join the tour with a convertible or other rental car\ncategories:  \n**‘full size’ category, like Nissan Altima or similar from US$7,748.00 (one or\ntwo people)**  \n\\+ Chicago - Los Angeles one-way fee: from US$650.00 (approximately)\n\n**‘SUV’ category, like Jeep Grand Cherokee or similar from US$7,898.00 (one or\ntwo people)**  \n\\+ Chicago - Los Angeles one-way fee: from US$650.00 (approximately)\n\n**‘convertible’ category, like Ford Mustang or similar from US$8,423.00 (one\nor two people)**  \n\\+ Chicago - Los Angeles one-way fee: from US$650.00 (approximately)\n\nTour fee includes car rental **with insurance** \\+ 1 room and all the other\ninclusions as motorcycle riders. Extended roadside assistance is optional and\ncan be booked online by driver (approx. US$8.00 per day). The one-way fee must\nbe paid by driver in Chicago. **Gas is not included for cars on any tours**.\n\nPre-tour hotel nights in Chicago: from $230 (depending on dates)\n\nPost-tour hotel nights in Los Angeles: from $180 (depending on dates)\n\n## Cancellation\n\n#### Guided tours\n\nThe tour is definite-go when 8 riders are booked.\n\n**45 days or greater cancellation notice:** Security deposit is not\nrefundable, can be used next riding year as tour credit.\n\nCancellations received **less than 45 days prior to the tour departure date**\nwill be subject to the following penalties:\n\n**44-32 days cancellation notice:** Up to 50% loss of total Tour Fee to cover\nhotel & other costs. Rental Voucher for the remaining amount for future\ntravel.\n\n**31 days or less:** Up to 100% loss of total Tour Fee. Rental Voucher for any\nremaining value for future travel.\n\nBecause of the chance of illness, accident, airline inefficiency, company\ninsolvency or other unforeseen situations that may cause a customer (you) to\nmiss a tour, we suggests to purchase travel/medical/health/trip cancellation\ninsurance. It is a little expense that gives you piece of mind, highly\nrecommended!\n\n#### Self-guide tours\n\nSelf-guide tours with motorcycle rental:\n\n  * 31 days or greater cancellation notice: No charge, security deposit is (20%) non-refundable, but can be used as store credit.\n  * Cancelling between 30-21 out from your tour start date will have a 33% cancellation fee and the remainder will be put into store credit.\n  * Cancelling between 20-11 out from your tour start date will have a 66% cancellation fee and the remainder will be put into store credit.\n  * Cancelling inside of 10 days would forfeit everything as a cancellation fee.\n  * Refunds, if applicable, will be issued in a form of store credit that can be redeemed within 1 year from the date it was issued.\n  * Cancellation/Change Fees: Fees are based on Total Booking Amount (Daily rental rate + VIP/VIP Zero, Taxes & Fees).\n  * Payments: Deposits are non-refundable, some payments in the event of cancellation can be used as store credit.\n  * Any and all balances remaining after Cancellation Fees have been applied will be issued in the form of a **Store Credit** that may be redeemed within one year.\n\nSelf-guide tours with car rental:\n\n  * 14 day or greater cancellation notice: no charge, fees are to be refunded\n  * 14 day or less cancellation notice: 100% of Total Booking Amount\n\n## Insurance\n\nPlease see our insurance options on the Insurance page.\n\n**Contact us**\n\n#### What is included in the Small Group Guided Tour?\n\n  * Harley-Davidson motorcycle rental \n  * One-way fee for motorcycles\n  * Professional tour guide \n  * Tour day-to-day itinerary \n  * Baggage transportation in a car \n  * Fuel and oil \n  * National park entrance fees \n  * Museum and other attraction tickets (Route 66 Interpretive Center, National Cowboy & Western Heritage Museum, Route 66 Museum, National Route 66 Museum, Meteor Crater, IMAX Grand Canyon, Grand Canyon Caverns) \n  * Welcome & farewell dinner \n  * Transfer from hotel to motorcycle rental office \n  * Roadside assistance\n  * Helmet (half-face)\n  * Unlimited mileage \n  * Toll fees\n  * 17 tour days, 16 night accommodation in double room, riding days: 15\n  * Taxes\n\n#### What's not included in guided tours?\n\n  * Airfares to/from Chicago and Los Angeles\n  * Insurance\n  * 25 minute helicopter flight over the Grand Canyon (optional program, @$245 per person)\n  * Health, motorcycle damage, travel/medical/health/trip cancellation insurance (optional)\n  * Food and snacks (except for welcome & farewell meals)\n  * Beverages\n  * Motorcycle trailer (we have got roadside assistance)\n  * Helicopter flight in Grand Canyon: optional @$245 per person\n  * Gas, car insurance, car one-way fee (if you rent a car on this trip)\n  * Rain-gear\n  * Personal souvenirs\n  * Transfer airport to hotel in Chicago\n  * Parking fees (passenger cars only)\n  * Tour to Milwaukee to visit the Harley-Davidson museum - optional program, can be arranged at request\n  * Tips\n\n**Contact us**\n\n#### What is included in the self-guided version?\n\n  * Harley-Davidson motorcycle rental\n  * One-way fee for motorcycles\n  * Tour day-to-day itinerary\n  * 48 page sights and attractions database (pdf file)\n  * Route 66 navigation app on your smart-phone\n  * Unlimited mileage \n  * Helmet (half-face)\n  * 17 tour days, 16 night accommodation in double room, riding days: 15\n\n#### What's not included in self-guided tours?\n\n  * Airfares to/from Chicago and Los Angeles\n  * Insurance\n  * 25 minute helicopter flight over the Grand Canyon (optional program, @$245 per person)\n  * Food and snacks\n  * Beverages\n  * Fuel and oil\n  * Entry tickets to museums and attractions (optional)\n  * Tips\n  * Personal souvenirs\n  * Parking fees, park entrance fees, road or toll charges\n  * Seasonal surcharges\n  * Roadside assistance\n  * Rally surcharges\n  * Transfer airport-hotel-airport\n  * Tour to Milwaukee to visit the Harley-Davidson museum - optional program, can be arranged at request\n  * Rain-gear\n\n#### What is the difference between the \"Small Group\" and \"Standard\" Route 66\ntours?\n\n  * Small Group tour offers visiting Harley-Davidson Factory and Museum in Milwaukee (optional program)\n  * Small Group tour takes it easy: we ride 2 more days on road!\n  * Small Group tour has limited motorcycles on tours, no more than 12\n  * Small Group tour rides more 2 lane old roads, in fact everywhere it is possible\n  * Small Group tour visits a lot more stops and attractions (small groups are always easier to handle)\n  * Small Group tour participants spend more time at each sight or attraction\n  * Small Group tour rides in September with the most pleasant weather possible in season (there was no rain in 2015, little rain in 2016, some thunderstorm in 2017, little rain in 2018/2019, little rain in 2022)\n  * Small Group tour has easier day-to-day distances\n  * Small Group tour arrives to Los Angeles on Sunday to avoid horrible traffic\n  * Standard Tour: Tour days: 15, Nights: 14, Riding days: 13\n  * Small Group Tour: Tour days: 17, Nights: 16, Riding days: 15\n  * Standard Tour: all rooms are in hotels\n  * Small Group Tour: 14 nights in hotels, 2 nights in historic motels (Wigwam Motel Holbrook AZ and Railhaven in Springfield MO - once Elvis stayed here, too!)\n  * Standard Tour - meals: 2 meals (welcome and farewell dinner - soft drinks) are included + breakfast at all hotels\n  * Small Group Tour - meals: 2 meals (welcome and farewell dinner - soft drinks) are included + breakfast at most locations (we have to walk across the road to a **Cafe** at the Wigwam, no breakfast there)\n\n**Contact us**\n\nHARLEY-DAVIDSON MUSEUM: WHAT DO YOU FIND HERE?\n\n  * Over 450 motorcycles and artifacts, dating back to Serial Number One, the oldest known Harley-Davidson® motorcycle\n  * Stories of extraordinary products, people, history, and Harley-Davidson culture\n  * Never-before-seen Archives that **you can tour**\n  * A world-class Museum space and outlying buildings, designed by Pentagram Architects\n  * Unique Harley-Davidson Museum-inspired gifts at The Shop\n  * Distinctive dining at MOTOR® – no Museum admission required\n\n#### ** Las Vegas\n\nWe understand Las Vegas is fun, however, the extreme heat makes motorcycle\nriding dangerous and irresponsible. Safety first, we do not ride into Las\nVegas, but of course - you can enjoy the Sin City on your own after our tour\nis finished.\n\n#### Motorcycle Insurance\n\nNo Damage Waiver (no insurance)\n\n  * Damage to Motorcycle: Renter pays full retail value of ALL damages, no matter who's fault the damage was.\n  * Theft of Motorcycle: Renter pays full retail value of motorcycle.\n  * Breakdown Protection: Refund of daily rental rate or a portion thereof.\n  * Flat Tire Coverage: Not Included.\n  * **Security deposit: $5,000 on all rentals.**\n  * Cost: $0.00 / Day.\n\nLDW (Loss/Theft & Damage Waiver)\n\n  * Theft of Motorcycle: $5,000 deductible per occurrence. Covers Theft of Motorcycle and motorcycle accessories provided motorcycle was locked with all locks supplied from us. Does NOT include personal belongings left on motorcycle or in saddlebags. $2.500 deductible. Renter pays Up to $5,000 per occurrence. \n  * Damage to Motorcycle: Up to $2,500 per occurrence. covers any and all accidental; non-negligent, damage to motorcycle and motorcycle accessories. \n  * Personal Property Loss Protection: Not included.\n  * Additional Driver - Not included.\n  * Flat Tire Coverage - Not included.\n  * Security deposit: $750.\n  * Cost: $29.00 / Day.\n\nLDW Zero (Loss/Theft & Damage Waiver)\n\n  * Theft of Motorcycle: $1,000 deductible per occurrence. Covers Theft of Motorcycle and motorcycle accessories provided motorcycle was locked with all locks supplied from us. Does NOT include personal belongings left on motorcycle or in saddlebags. $1.000 deductible. Renter pays Up to $1.000 per occurrence. \n  * Damage to Motorcycle: $0 per occurrence. covers any and all accidental; non-neg ligent, damage to motorcycle and motorcycle accessories. Renter pays $0. \n  * Personal Property Loss Protection: Not included.\n  * Additional Driver - Not included.\n  * Flat Tire Coverage - Covers tire repair/labor. Towing is covered up to $100 per occurrence \n  * Security deposit: $100.\n  * Cost: $39.00 / Day.\n\n**Supplemental Liability Insurance (SLI), $29.00 per day** Insurance protects\nrenter against claims made by a third party for bodily injury and/or property\ndamage sustained as a result of an accident up to $300,000.\n\n**ROADSIDE ASSISTANCE**  \nRoadside Assistance Coverage $12.50 USD plus tax provides towing and roadside\nassistance by a approved vendor if your motorcycle becomes inoperable. The\nbenefits include emergency road service towing (within 30 miles of occurrence)\nemergency fuel delivery (up to 2 gallons) and jump start services. In\npurchasing the Roadside Assistance Coverage, we will waive the cost of any\napproved tow or road side assistance service unlimited.\n\nSecurity Deposit: The Security Deposit is an ‘Authorization Only’ onto a major\ncredit card meaning the funds must be available for hold but is not processed\nagainst your account unless required per Terms and Conditions of Rental\nAgreement.\n\nAll Theft and Damage Waivers and Supplemental Liability Insurance options are\nsubject to the express terms and conditions of the rental contract and do not\ninclude coverage for injury, personal property, or damage as the result of\nnegligence such as illegal use or use of rental while under the influence of\ndrugs or alcohol. A Police Report is required for all damages or accidents.\nAll damages to rented motorcycle without a police report will be considered to\nbe at the fault of the Renter.\n\nSupplemental Liability Insurance provides supplemental third-party liability\ninsurance at limits excess of state-required minimum financial responsibility\nlimits.\n\nPlease note that SLI is supplemental and secondary to all other available\ninsurance where permitted by law. It does not cover the rider or the\nmotorcycle passenger.\n\n**Tour Guide: Zsolt Nagy**  \n  \n_\"I have been riding this magnificent road since June 2006. My preference is\nto use smaller 2 lane country roads with less daily miles so my group not only\nenjoys rural America better but gets to know history, heritage and culture\nmore - not to mention meeting local folks who dedicated all their lives\nentirely to Route 66.  \nJoin us and I ensure you will remember this holiday for the rest of your\nlife!\" _\n\nTo book this tour we need following information from you:\n\n  * **Rider(s)** : scan of passport and drivers license, home address, mobile telephone number, e-mail address, required insurance option(s): LDW option, Liability option, motorcycle model choice, room type: one or two beds in room? Any additional hotel rooms before or after the tour?\n  * **Pillion(s)** : scan of passport\n  * Will you take the helicopter flight in Grand Canyon? The fee is $226 per person and we need your body-weight, too\n  * **Booking deposit** : $1,500 per motorcycle\n  * **Final payment: 6 weeks before tour commences**\n  * **Payment method:** bank transfer to our bank account. We also accept US personal checks (scanned to e-mail or mailed to our office)\n  * PayPal and MoneyGram payments are not accepted\n  * You will sign a rental contract with the motorcycle rental company, you will be renting with them (we already paid your rental fee to them, rental fee is part of the tour fee). Following information is required to complete your paperwork on location: street address, city, country, zip code, license number/expiration/date of birth. Show ID and driver's license. Pay security deposit (excess) with your credit card.\n\n**This tour is perhaps not for everyone: one must meet the following\nrequirements:**\n\n  * At least 1 year heavy-weight motorcycle riding experience\n  * Able to ride up to 70 mp/h (112 km/h) at times, especially on highways\n  * Ride in rain: half-face helmets are not the best choice. If possible bring your full-face or protect your face/eyes in rain\n  * Able to ride up to 1 hour continuously at times\n  * We do not plan to ride in dark, but you must be prepared to do so\n  * Must catch up with group, cannot leave much distance between motorcycles. Cars will cut in and you loose sight of group and can get lost eventually.\n  * Cannot leave group while in formation\n  * Cannot change riding position in group while in formation\n  * In traffic jam and extreme heat conditions (very rare but existing scenario) you must be able to ride between other vehicles on center white line (it is legal!) to avoid heatstroke\n  * No trikes can be rented on this tour\n\nPlease note: please do not purchase domestic/international airline tickets\nuntil tour is confirmed by us!\n\n**Contact us** **Back to top**\n\n#### Book your own programs:\n\nAddress: 3104 E Camelback Rd., PMB #2100, Phoenix, AZ 85016. Phone:\n1.602.354.9292.\n\nFacebook\n\nRidingroute66.us website is owned and managed by Panam Holidays INC, USA.  \n  \nIf you liked our website or services please support us with a link from your\nwebpage or blog.  \nEven better we would really appreciate if you would leave us a review on\nGoogle+ ...Cool, thank you!\n\nSome photographs used on this website are courtesy of Mr. James Kalemis. Links\n\n",
    "links": "[{\"link\": \"https://www.ridingroute66.us/\", \"text\": \"\"}, {\"link\": \"https://www.ridingroute66.us/\", \"text\": \"Home\"}, {\"link\": \"https://www.ridingroute66.us/riding-route-66-motorcycle-guided-tour-15day-holiday-guided-tour\", \"text\": \"Route 66 Motorcycle (guided), 15 days\"}, {\"link\": \"https://www.ridingroute66.us/riding-route-66-motorcycle-guided-tour-15day-holiday-self-guide-tour\", \"text\": \"Route 66 Motorcycle (self-guide), 15 days\"}, {\"link\": \"https://www.ridingroute66.us/Route-66-motorcycle-small-group-tour\", \"text\": \"Route 66 Motorcycle Small Group Tour (guided), 17 days\"}, {\"link\": \"https://www.ridingroute66.us/Riding-Route-66-USA-East\", \"text\": \"Half of Route 66 - 8 Days, East\"}, {\"link\": \"https://www.ridingroute66.us/Riding-Route-66-USA-West\", \"text\": \"Half of Route 66 - 9 Days, West\"}, {\"link\": \"https://www.ridingroute66.us/USA-Wild-West-Guided-Motorcycle-Tour\", \"text\": \"Route 66 + Wild West Motorcycle, 16 days\"}, {\"link\": \"https://www.ridingroute66.us/Wild-West-Motorcycle-Tour-Las-Vegas-to-Los-Angeles\", \"text\": \"Route 66 + Wild West Motorcycle, 9 days\"}, {\"link\": \"https://www.ridingroute66.us/Route-66-guided-motorcycle-tour-8days\", \"text\": \"Route 66 + Wild West Motorcycle, 8 days\"}, {\"link\": \"https://www.ridingroute66.us/route-66-travel-in-the-comfort-of-our-minibus\", \"text\": \"Minibus tour on Route 66 (small group)\"}, {\"link\": \"https://www.ridingroute66.us/Route-66-bus-tour\", \"text\": \"Bus tour on Route 66\"}, {\"link\": \"https://www.ridingroute66.us/Rent-a-car-self-guide-tours\", \"text\": \"Route 66 by car (11-20+ day holidays)\"}, {\"link\": \"https://www.ridingroute66.us/Coast-to-coast-via-route-66\", \"text\": \"USA coast to coast via Route 66\"}, {\"link\": \"https://www.ridingroute66.us/easy-rider-14-day-movie-tour\", \"text\": \"Easy Rider Self-Guide Tour\"}, {\"link\": \"https://www.ridingroute66.us/Route-66-Accommodation-Samples\", \"text\": \"Accommodation on Route 66\"}, {\"link\": \"https://www.ridingroute66.us/route-66-rent-a-harley-and-ride-on-your-own-self-guide-tour\", \"text\": \"Motorcycle rental\"}, {\"link\": \"https://www.ridingroute66.us/route-66-rent-a-car-and-drive-on-your-own-self-guide-tour\", \"text\": \"Car rental\"}, {\"link\": \"https://www.ridingroute66.us/trip-cancellation-and-health-insurance\", \"text\": \"Insurance\"}, {\"link\": \"https://www.ridingroute66.us/map-of-route-66\", \"text\": \"Map\"}, {\"link\": \"https://www.ridingroute66.us/Route-66-Magazine-digital-version\", \"text\": \"Route 66 Magazine\"}, {\"link\": \"https://www.ridingroute66.us/route-66-video-gallery\", \"text\": \"Video gallery\"}, {\"link\": \"https://www.ridingroute66.us/blog/The-Fascinating-Journey-on-Route-66-An-Iconic-American-Road-Trip\", \"text\": \"The Fascinating Journey on Route 66: An Iconic American Road Trip\"}, {\"link\": \"https://www.ridingroute66.us/blog/The-Fun-of-Riding-Route-66-A-Journey-of-Adventure-and-Nostalgia\", \"text\": \"The Fun of Riding Route 66 - A Journey of Adventure and Nostalgia\"}, {\"link\": \"https://www.ridingroute66.us/shop\", \"text\": \"Memorabilia\"}, {\"link\": \"https://www.ridingroute66.us/programs-and-tours\", \"text\": \"Programs and tours\"}, {\"link\": \"https://www.ridingroute66.us/faq\", \"text\": \"F.A.Q.\"}, {\"link\": \"https://www.ridingroute66.us/Reviews\", \"text\": \"You say\"}, {\"link\": \"https://www.ridingroute66.us/Contact/\", \"text\": \"Contact\"}, {\"link\": \"https://www.ridingroute66.us/Contact/1\", \"text\": \"Contact us\"}, {\"link\": \"https://www.ridingroute66.us/Riding-Route-66-USA-East\", \"text\": \"Route 66 East (8 days)\"}, {\"link\": \"https://www.ridingroute66.us/Riding-Route-66-USA-West\", \"text\": \"Route 66 West (9 days)\"}, {\"link\": \"https://www.ridingroute66.us/Appform/Create/10506\", \"text\": \"Book tour\"}, {\"link\": \"https://www.ridingroute66.us/Images/take.mp3\", \"text\": \"Take it Easy\"}, {\"link\": \"https://www.ridingroute66.us/Contact/1\", \"text\": \"Contact us\"}, {\"link\": \"https://www.ridingroute66.us/Route-66-guided-motorcycle-tour-8days\", \"text\": \"\\n        Rates for Small Group Guided Tours (per person):\\n    \"}, {\"link\": \"https://www.ridingroute66.us/rent-a-harley#Harley-Davidson® Street Glide®\", \"text\": \"Harley-Davidson® Street Glide®\"}, {\"link\": \"https://www.ridingroute66.us/rent-a-harley#Harley-Davidson® Road Glide®\", \"text\": \"Harley-Davidson® Road Glide®\"}, {\"link\": \"https://www.ridingroute66.us/rent-a-harley#Harley-Davidson® Heritage Softail® Classic\", \"text\": \"Harley-Davidson® Heritage Softail® Classic\"}, {\"link\": \"https://www.ridingroute66.us/rent-a-harley#BMW® R 18 Classic\", \"text\": \"BMW® R 18 Classic\"}, {\"link\": \"https://www.ridingroute66.us/rent-a-harley#Yamaha® Super Tenere 1200\", \"text\": \"Yamaha® Super Tenere 1200\"}, {\"link\": \"https://www.ridingroute66.us/rent-a-harley#Harley-Davidson® Street Glide® Touring Edition\", \"text\": \"Harley-Davidson® Street Glide® Touring Edition\"}, {\"link\": \"https://www.ridingroute66.us/rent-a-harley#Harley-Davidson® Road Glide® Touring Edition\", \"text\": \"Harley-Davidson® Road Glide® Touring Edition\"}, {\"link\": \"https://www.ridingroute66.us/rent-a-harley#BMW® R 1250 GS\", \"text\": \"BMW® R 1250 GS\"}, {\"link\": \"https://www.ridingroute66.us/rent-a-harley#BMW R 1250 RT\", \"text\": \"BMW R 1250 RT\"}, {\"link\": \"https://www.ridingroute66.us/rent-a-harley#Harley-Davidson® Road Glide® Ultra\", \"text\": \"Harley-Davidson® Road Glide® Ultra\"}, {\"link\": \"https://www.ridingroute66.us/rent-a-harley#Harley-Davidson® Electra Glide®\", \"text\": \"Harley-Davidson® Electra Glide®\"}, {\"link\": \"https://www.ridingroute66.us/trip-cancellation-and-health-insurance-small-group\", \"text\": \"Insurance webpage\"}, {\"link\": \"https://www.ridingroute66.us/trip-cancellation-and-health-insurance-small-group\", \"text\": \"Insurance page\"}, {\"link\": \"https://www.ridingroute66.us/Contact/1\", \"text\": \"Contact us\"}, {\"link\": \"https://www.ridingroute66.us/trip-cancellation-and-health-insurance-small-group\", \"text\": \"Insurance\"}, {\"link\": \"https://www.ridingroute66.us/Contact/1\", \"text\": \"Contact us\"}, {\"link\": \"https://www.ridingroute66.us/trip-cancellation-and-health-insurance-small-group\", \"text\": \"Insurance\"}, {\"link\": \"https://www.ridingroute66.us/Route-66-motorcycle-small-group-tour\", \"text\": \"Small Group\"}, {\"link\": \"https://www.ridingroute66.us/riding-route-66-motorcycle-guided-tour-15day-holiday-guided-tour\", \"text\": \"Standard\"}, {\"link\": \"https://www.ridingroute66.us/Contact/1\", \"text\": \"Contact us\"}, {\"link\": \"https://www.ridingroute66.us/trip-cancellation-and-health-insurance-small-group\", \"text\": \"LDW option, Liability option\"}, {\"link\": \"https://www.ridingroute66.us/rent-a-harley\", \"text\": \"motorcycle model choice\"}, {\"link\": \"https://www.ridingroute66.us/Contact/1\", \"text\": \"Contact us\"}, {\"link\": \"https://www.ridingroute66.us/Links\", \"text\": \"Links\"}]"
}