{
    "summary": "© www.rideadv.com | Privacy Policy\n\nBook Your Trip Now!\n\n  * Motorcycle Tours\n\n    * View All Tours\n    * Self-Guided Motorcycle Tours\n    * Guided Group Motorcycle Tours\n    * Dual Sport Adventures\n    * Pavement Only\n    * Private Group Tours\n    * Tours by Month\n\n  * Tours By Location\n\n    * View All Locations\n    * North American Motorcycle Trips\n    * South American Motorcycle Tours\n    * Asian Motorcycle Trips\n    * European Motorcycle Trips\n    * South America 4x4 / Jeep Tours\n\n  * Motorcycle Rentals\n\n    * North American Motorcycle Rentals\n    * South America Motorcycle Rentals\n    * European Motorcycle Rentals\n    * Why Rent a Motorcycle\n\n  * Training\n  * Online ADV Store\n  * Who We Are\n\n    * What We Do\n    * Customer Testimonials\n    * Free Motorcycle Travel Info\n    * Work With Us\n    * Travel Insurance\n    * e-Newsletter Sign Up\n    * Payments\n    * Registration\n    * Frequently Asked Questions\n\n  * Shop\n  * Video Gallery\n  * RIDE Adventures Blog\n  * Call Us +1 (458) 836-5426\n\n  * +1-458-836-5426\n  * Contact Us\n  * Blog\n  *  __\n  * Shop\n  * Request Information\n\n  * Motorcycle Tours\n    * View All Tours\n    * Self-Guided Motorcycle Tours\n    * Guided Group Motorcycle Tours\n    * Dual Sport Adventures\n    * Pavement Only\n    * Private Group Tours\n    * Tours by Month\n  * Tours By Location\n    * View All Locations\n    * North American Motorcycle Trips\n    * South American Motorcycle Tours\n    * Asian Motorcycle Trips\n    * European Motorcycle Trips\n    * South America 4x4 / Jeep Tours\n  * Motorcycle Rentals\n    * North American Motorcycle Rentals\n    * South America Motorcycle Rentals\n    * European Motorcycle Rentals\n    * Why Rent a Motorcycle\n  * Training\n  * Online ADV Store\n  * Who We Are\n    * What We Do\n    * Customer Testimonials\n    * Free Motorcycle Travel Info\n    * Work With Us\n    * Travel Insurance\n    * e-Newsletter Sign Up\n    * Payments\n    * Registration\n    * Frequently Asked Questions\n\n__\n\n### Adventure Awaits!\n\n# What Type of Motorcycle Tour Are You Looking For?\n\nThese motorcycle tour packages are only offered after months of our own\npersonal research and planning, so you can rest assured that RIDE Adventures\nisn't just another \"website full of links.\"\n\n**We are the actual people who drive, guide, and RIDE these routes!**\n\nWithin each trip option listed on the site, there are small variations that\nmight make one adventure more ideal for you than another.\n\nWith a wide range of terrain types, regions offered, and vehicle choices, we\nhave a Specialist for each region and will gladly consult with you on which\ntrip will **satisfy your craving for real adventure.**\n\nEach section below offers a quick video and description about what you can\nexpect on our various types of motorcycle tours.\n\nFeel free to watch them all to discover what sort of adventure would be best\nfor you and your riding friends, then browse around the site to see where\nyou'd like to go!\n\n  \n\n# Motorcycle Tours - General Information\n\n\n\n\n\nIf you’re looking for more information about a “motorcycle tour,” then you’ve\ncome to the right place. RIDE Adventures specializes in exactly that;\nadventurous, international motorcycle trips where we offer a variety of\nservices that make your dream RIDE a reality. If you’re looking to explore\nparts of the world that may be difficult to reach on your own, we’re here to\nmake it possible.\n\nFrom self-guided tours, to guided groups, to private tours, one of the major\nbenefits to booking with RIDE Adventures is that there is no need to ship your\nbike! You don’t need to deal with customs or freight agents because we provide\nyou with new, maintained, high-quality rental bikes as part of your package.\nRisks are reduced and it’s as easy as you fly, you RIDE.\n\nAdditionally, the RIDE Adventures staff are experts in each international tour\narea offered on the site. You can rest assured that we’re not a warehouse full\nof links to unfamiliar trips. We’ve been to, or currently live in, these\ndestinations. We’ve ridden them countless times and are here to make your\nadventure as exciting, and safe, as possible.\n\nThe videos on this page will provide you with a short intro on each of our\nmajor options, Self-Guided, Guided Group, Private Group, and Pavement Only, so\nbe sure to watch them, familiarize yourself with our offerings, and decide\nwhich style of motorcycle tour would be best for your upcoming RIDE!\n\n  \n\n# SELF GUIDED MOTORCYCLE TOURS\n\n\n\n\n\nThe self-guided motorcycle tours offered by RIDE Adventures are, in essence,\nan enhanced rental option designed for those of you who would rather\nexperience your quest solo. We’ll provide you with a terrain-appropriate\nrental motorcycle on our “Fly & RIDE” packages, so there’s no need to ship\nyour bike, saving you the time and effort of dealing with customs and shipping\ncosts.\n\nYour international paperwork, i.e. border crossing authorizations, etc., are\nalready taken care of for you, along with an entire hotel package that is laid\nout and pre-reserved throughout the duration of your adventure.\n\nIn addition to the pre-defined itinerary that you can use at your own pace\nthroughout the day, you’ll also be provided with a road book or a GPS unit to\nassist in navigation. The information we provide also offers suggestions on\nwhat sights to visit, where to get food, where to get fuel, and things of that\nnature to make your motorcycle adventure as smooth and carefree as possible.\n\nAs with all the tours and rentals on our site, these tour routes have been\nridden and explored by our staff so you can rest assured that you are being\nprovided with reliable, dependable information. The trips you can choose from\nare located in extremely popular riding destinations around the world, so in\norder to experience the dream tour that you want, be sure to book well in\nadvance of your projected travel dates!\n\nBrowse our Self-Guided Motorcycle Tours here.\n\n  \n\n# GUIDED GROUP TRIPS\n\n\n\n\n\nWe understand that our “Self-Guided” options are fairly self-explanatory, but\nwhat exactly is a “Guided Group” tour?\n\nGreat! Glad you asked.\n\nIf you’re uncomfortable with the idea of traveling in a foreign country by\nyourself, then that’s what we’re here for.  Our Guided Group offerings\nprimarily cover the same routes and tours as our self-guided options, but\nrather than handing you a map, a GPS unit, and a motorbike, then sending you\non your way, we’re here to make your trip the best it can be by providing one\nor two expert guides to join you on your adventure.\n\nBilingual and multilingual guides join your RIDE to help with international\npaperwork, border crossings, luggage transport, and sightseeing opportunities.\nMotorcycle maintenance? Check. Help with changing a flat tire? Check. Dealing\nwith border patrol agents? Check.\n\nOur guided group tours really are our most turn-key service, from picking you\nup at the airport, to securing your rental bike, to guiding your group, to\nfinally taking you back to the airport (sadly) for your return flight home.\n\nKeep in mind that these tours can potentially be made up of strangers,\nindividuals from all around the world, and are designed for people who are\ncomfortable traveling together in such situations. Above all, you’re riding\nwith people who bond, and make new lifelong friends, over the shared passion\nof adventure riding. (Note: it’s not a requirement to RIDE with strangers,\nespecially if you have enough people in your group or want to choose a Private\ntour option, explained below.)\n\nBrowse our Guided Group Motorcycle Tours here.\n\n  \n\n# DUAL SPORT ADVENTURES\n\n\n\nThis section of the page offers a more in-depth look at the nature of dual-\nsport adventure riding. If you’ve been getting dirty for years, riding off the\nbeaten path, so to speak, then you know what it feels like to get out into the\nwild. But, if you’re just getting into dual-sport riding, here’s what we mean…\n\nGoing on a dual sport RIDE involves experiencing the thrill of leaving the\nhustle and bustle of daily life behind. Turn off the paved roads (even though\nwe do offer pavement options) and get that bike into the dirt, mud, and sand\npathways through mountains, jungles, and deserts, while they still last.\n\nAs time goes on, particularly up and down the routes of South America, more\npaved roads are encroaching on the dirt ones, and the adventure riding\nopportunities in their natural state will eventually slip away.\n\nIt’s a good thing we know where the best routes to RIDE are located!\n\nAnother important thing to note is that the motorbikes we provide with your\nrental or tour options are appropriate for the terrain. They are not small cc\ndirt bikes, but rather, 500 to 650cc and higher dual sport motorcycles that\ncan handle the journey, and therefore, we recommend that riders are able to\nhandle these bikes.\n\nAs always, be sure to book your adventure RIDE early due to the limited nature\nof the motorcycles and the seasonal riding opportunities.\n\nBrowse our selection of Dual Sport motorcycle tour packages.\n\n  \n\n# PAVEMENT ONLY RIDING\n\n\n\nWhile RIDE Adventures has a reputation for specializing in off-road riding\ntours, we do have some pavement-focused opportunities for those of you who\nmight not be comfortable riding on surfaces like sand and gravel.\n\nAs much as it pains us to say it, pavement riding is a natural progression to\nthe state of motorcycle adventures as more roads get paved around the world.\nYou can still experience some thrilling adventure if your riding comfort level\nis more suited to hard surfaces! We can make that happen too.\n\nWhile you’re exploring the pavement-focused options here on the site, one\nthing we’d like you to note is the percentage of paved to off-road riding in\neach trip’s details. Some may be 90%, some may be 100%, but keep in mind the\npossibility that you may come across a hard-packed dirt road or be faced with\nriding through a construction zone. (Just be aware of the possibilities!)\n\nNote that our pavement-only opportunities to RIDE are just like any of the\nother tours we offer in that they can be Self-Guided or Guided Group. Self-\nGuided trips can start and end based on your schedule and bike availability,\nwhile Guided Groups tend to have specific dates and schedules to follow.\n\nWe’ve said it before and we’ll say it again… Bike availability is limited,\nwhich means you should reserve your trip dates well in advance!\n\nView our Pavement Only motorbike tour options.\n\n  \n\n# PRIVATE GROUP OPTIONS\n\n\n\n\n\nAs with all of the options we offer here on the site, we feel it’s important\nto remind you that there is no need to ship your bike. We’ll provide you with\nthe rental motorcycle when you get to your desired location, you just show up\nand begin making memories that last a lifetime!\n\nOur private group options can essentially be designed to fit your needs.\nWhether that involves creating your own private self-guided group with you and\na gang of your riding friends, or putting together a guided group option with\neither one or two local experts along for the adventure, it’s really up to\nyou! We can provide support trucks to carry luggage and tools if you like; it\ndepends on what your individual group needs and wants are.\n\nOne important thing to note is that our group options, particularly guided\ngroups, have shared costs, i.e. for the experienced guide and support truck,\netc., and more riders mean reduced fees. So, if you want to lower your total\ncosts, bring more riding friends!\n\nPrivate group tours can be organized to your liking, outside of the realm of\nour pre-packaged options, and can be ridden on dirt, pavement, or both. Let us\nknow what you’re looking for, and we’ll do all we can to accommodate it.\n\nAgain, we’d like to remind you that these are highly desirable, international\nriding locations, with a limited number of motorcycles available, especially\nduring peak riding seasons. We can’t say it enough—book your dates well in\nadvance!\n\nLearn more about our Private Group Tours.\n\n\n\n\n\nWant to share this image?\n\nRight click and select \"Save As\"!\n\n  \n\n### Remember, when choosing a type of tour, consider such factors as:\n\n  * altitude\n  * extreme temperatures\n  * riding or driving in extreme winds\n  * difficulty of terrain\n  * average distance per day\n\nIf you have thoughts of motorcycle travel or 4x4 adventure, just reach out to\nus and let us know what would make your ultimate adventure getaway! The list\nof trip packages we're offering continues to grow as we plan better routes\neach year, and a large part of our service offering is to talk with you about\nmaking sure you're choosing the right trip. Once you're booked, we help with\npacking & planning for the actual adventure!\n\n  * Motorcycle Tours\n  * Tours By Location\n  * Motorcycle Rentals\n  * Training\n  * Online ADV Store\n  * Who We Are\n\n© 2022 www.rideadv.com | Privacy Policy\n\n__\n\n",
    "links": "[{\"link\": \"https://www.rideadv.com/ride-adventures-privacy-policy\", \"text\": \"Privacy Policy\"}, {\"link\": \"https://www.rideadv.com/contact-ride-adventures\", \"text\": \"Book Your Trip Now!\"}, {\"link\": \"https://www.rideadv.com/motorcycle-tours\", \"text\": \"Motorcycle Tours\"}, {\"link\": \"https://www.rideadv.com/motorcycle-tours/self-guided-motorcycle-trips\", \"text\": \"Self-Guided Motorcycle Tours\"}, {\"link\": \"https://www.rideadv.com/motorcycle-tours/guided-group-motorcycle-adventure-tours\", \"text\": \"Guided Group Motorcycle Tours\"}, {\"link\": \"https://www.rideadv.com/motorcycle-tours/dual-sport-motorcycle-adventure-tours\", \"text\": \"Dual Sport Adventures\"}, {\"link\": \"https://www.rideadv.com/motorcycle-tours/pavement-only-motorcycle-tours\", \"text\": \"Pavement Only\"}, {\"link\": \"https://www.rideadv.com/motorcycle-tours/private-group-motorcycle-trips\", \"text\": \"Private Group Tours\"}, {\"link\": \"https://www.rideadv.com/motorcycle-adventure-tour-videos\", \"text\": \"Video Gallery\"}, {\"link\": \"https://www.rideadv.com/ride-adventures-tour-and-rentals-blog\", \"text\": \"RIDE Adventures Blog\"}, {\"link\": \"https://www.rideadv.com/contact-ride-adventures\", \"text\": \"Contact Us\"}, {\"link\": \"https://www.rideadv.com/ride-adventures-tour-and-rentals-blog\", \"text\": \"Blog\"}, {\"link\": \"https://www.rideadv.com/search-results\", \"text\": \"\"}, {\"link\": \"https://www.rideadv.com/contact-ride-adventures\", \"text\": \"Request Information\"}, {\"link\": \"https://www.rideadv.com/motorcycle-tours\", \"text\": \"Motorcycle Tours\"}, {\"link\": \"https://www.rideadv.com/motorcycle-tours/self-guided-motorcycle-trips\", \"text\": \"Self-Guided Motorcycle Tours\"}, {\"link\": \"https://www.rideadv.com/motorcycle-tours/guided-group-motorcycle-adventure-tours\", \"text\": \"Guided Group Motorcycle Tours\"}, {\"link\": \"https://www.rideadv.com/motorcycle-tours/dual-sport-motorcycle-adventure-tours\", \"text\": \"Dual Sport Adventures\"}, {\"link\": \"https://www.rideadv.com/motorcycle-tours/pavement-only-motorcycle-tours\", \"text\": \"Pavement Only\"}, {\"link\": \"https://www.rideadv.com/motorcycle-tours/private-group-motorcycle-trips\", \"text\": \"Private Group Tours\"}, {\"link\": \"https://www.rideadv.com/\", \"text\": \"\"}, {\"link\": \"https://www.rideadv.com/motorcycle-tours/self-guided-motorcycle-trips\", \"text\": \"Browse our Self-Guided Motorcycle Tours here\"}, {\"link\": \"https://www.rideadv.com/motorcycle-tours/guided-group-motorcycle-adventure-tours\", \"text\": \"Browse our Guided Group Motorcycle Tours here\"}, {\"link\": \"https://www.rideadv.com/motorcycle-tours/dual-sport-motorcycle-adventure-tours\", \"text\": \"Browse our selection of Dual Sport motorcycle tour packages\"}, {\"link\": \"https://www.rideadv.com/motorcycle-tours/pavement-only-motorcycle-tours\", \"text\": \"View our Pavement Only motorbike tour options\"}, {\"link\": \"https://www.rideadv.com/motorcycle-tours/private-group-motorcycle-trips\", \"text\": \"Learn more about our Private Group Tours\"}, {\"link\": \"https://www.rideadv.com/motorcycle-tours\", \"text\": \"Motorcycle Tours\"}, {\"link\": \"https://www.rideadv.com/ride-adventures-privacy-policy\", \"text\": \"Privacy Policy\"}]"
}