{
    "summary": "  * Join Now\n\n  *     *     * My History\n    *     * Account Settings\n    * Log out\n\n#### Specs\n\n#### Classifieds\n\n#### Bike Reviews\n\n####  Product Reviews\n\n  * Best Motorcycle Cameras\n  * Best Motorcycle Earplugs\n  * Best Motorcycle Oil\n  * Best Leather Jackets\n  * Best Winter Gloves\n  * Best Sportbike Tires\n  * GPS Buyers Guide\n  * Gear Deals\n\n####  Types\n\n  * Adventure Touring\n  * Cruiser\n  * Electric\n  * Off-Road\n  * On-Off-Road\n  * Other\n  * Scooter\n  * Sport-Touring\n  * Sportbikes\n  * Standard\n  * Touring\n  * Touring Scooter\n  * Track\n  * Youth\n\n####  Brands\n\n  * Aprilia\n  * BMW\n  * CFMoto\n  * Ducati\n  * Energica\n  * Gas-Gas\n  * Harley-Davidson\n  * Honda\n  * Husqvarna\n  * Indian\n  * Kawasaki\n  * KTM\n  * Kymco\n  * Moto Guzzi\n  * MV Agusta\n  * Piaggio\n  * Royal Enfield\n  * Suzuki\n  * Triumph\n  * Vespa\n  * Yamaha\n  * Zero\n\n####  Resources\n\n  * New Rider's Hub\n  * Dealers\n  * Safety\n  * Forums\n  * Videos\n\n#### Insurance\n\n  * Specs\n  * Classifieds\n  * Bike Reviews\n  * Product Reviews \n\n    * Best Motorcycle Cameras\n    * Best Motorcycle Earplugs\n    * Best Motorcycle Oil\n    * Best Leather Jackets\n    * Best Winter Gloves\n    * Best Sportbike Tires\n    * GPS Buyers Guide\n    * Gear Deals\n\n  * Types \n\n    * Adventure Touring\n    * Cruiser\n    * Electric\n    * Off-Road\n    * On-Off-Road\n    * Other\n    * Scooter\n    * Sport-Touring\n    * Sportbikes\n    * Standard\n    * Touring\n    * Touring Scooter\n    * Track\n    * Youth\n\n  * Brands \n\n    * Aprilia\n    * BMW\n    * CFMoto\n    * Ducati\n    * Energica\n    * Gas-Gas\n    * Harley-Davidson\n    * Honda\n    * Husqvarna\n    * Indian\n    * Kawasaki\n    * KTM\n    * Kymco\n    * Moto Guzzi\n    * MV Agusta\n    * Piaggio\n    * Royal Enfield\n    * Suzuki\n    * Triumph\n    * Vespa\n    * Yamaha\n    * Zero\n\n  * Resources \n\n    * New Rider's Hub\n    * Dealers\n    * Safety\n    * Forums\n    * Videos\n\n  * Insurance\n\n  * Join Now\n\n  *     *     * My History\n    *     * Account Settings\n    * Log out\n\n##### Top stories\n\nBest Motorcycle Airbag Jackets 2023 European Middleweight Naked Bike Shootout\nThis Week's Motorcycle Gear Deals\n\nSee Edits\n\n  * Features\n\n652 Views\n\n# Best Motorcycle Touring Companies\n\nby Motorcycle.com Staff (IC: employee)\n\n**Updated:  ** October 15th, 2019 **Published:  ** July 31st, 2018    Share\n\n## Just show up and let the good times roll...\n\n  *   *   *   *   *   *   *   *   *   * \n\nNothing spells adventure like hitting the open road on a motorcycle with your\nfamily and friends. America is an incredibly big country, encompassing\nseemingly endless places to go and see. With all its vastly different\nlandscapes and attractions, the U.S. is a haven for motorcycle travel and\nadventure. So, where do you even start? Well, you could plan your own trip,\nmap out your route, make your lodging arrangements, find places to eat and\nfuel up along the way, and hope you don’t run into any bike troubles. Or, you\ncan kick back, relax, and let one of the many motorcycle touring companies\nhere in the U.S. take care of all that for you. After all, they’re experts on\nthe subject with everything you need to know, and more. All _you_ have to do\nis enjoy the ride and the beautiful scenery (and fork over a little cash).\n\nAnother major bonus when booking through a motorcycle touring company is that\nyou don’t have to ride your own bike, worry about it breaking down, or worse,\nfix it on the side of the road with tools you forgot to bring. Fortunately,\nthe motorcycle touring companies listed below use rentals or bikes within\ntheir own fleet, so if something happens and they break down, it becomes\nsomeone else’s problem, not yours.\n\nThe first step to planning your future motorcycle tour is deciding where you\nwant to go, what you want to see, and where you’re going to start. Many of the\nfollowing motorcycle touring companies specialize in certain regions of the\ncountry, but they’re spread out all over the place, because there’s great\nriding everywhere. So, odds are there’s something near you. Once you’re all\nsigned up, just don’t forget you motorcycle touring necessities and your\ncamera, because any of these motorcycle tours could and should be a trip of a\nlifetime.\n\n### AdMo-Tours\n\nAdMo (Adventure Motorcycle) Tours is based in Southern California and offers\nstreet, off-road and dual-sport/ADV tours. Their guided motorcycle tours are\nprimarily based here in the Southwestern United States, all over California,\nNevada and Baja Mexico. They also offer international tours all over Europe.\nThe tours vary from day rides to full-on 11-day adventures, and they’re\noffered year round. AdMo will handle and provide just about everything you\nmight need including the bikes, of course. All you have to do is show up.\n\nMore info about AdMo-Tours and all their offerings  here.\n\n### Bike Week Motorcycle Tours\n\nThere’s no shortage of different motorcycle rallies and bike weeks here in the\nU.S. Motorcyclists travel from all over to attend Sturgis, Daytona, Laconia,\nLaughlin and Arizona Bike Week – just to name a few. Bike Week Motorcycle\nTours takes its riders around all the best and most scenic roads surrounding\neach event. Together you’ll ride, eat, ride some more, and get to know each\nother, all while getting a true biker’s taste for Americana motorcycle\nculture.\n\nInterested? Check out bikeweekmotorcycletours.com for details on how you can\njoin in on the fun.\n\n### EagleRider\n\nEagleRider is perhaps the biggest and best known motorcycle touring company\nhere in the U.S. There are EagleRider locations all over the place and many\nHarley-Davidson dealerships also have partnerships serving as EagleRider\nrental and return hubs, with additional locations being added regularly. With\nsuch an expansive network of pickup and drop off locations, one-way rentals\nand tours are easy to arrange. With 35 different domestic guided motorcycle\ntours from coast to coast and everywhere in between, there’s an EagleRider\nadventure for every motorcyclist out there. EagleRider guided tour packages\nrange from short day trips to almost month-long conquests, and the company\noperates year round.\n\nFor more information and a complete list of every trip EagleRider offers,\nvisit their website here.\n\n### Edelweiss\n\nEdleweiss has been doing this whole guided motorcycle adventure tour thing for\n38 years, with over 2,350+ tours in more than 180 different destinations\nworldwide. You could say they know a thing or two about a thing or two when it\ncomes to motorcycle trips. For guided tours here in the U.S., Edelweiss offers\nan Alaska/Yukon adventure, a West Coast California/Oregon/Washington trip, a\nSouthwest Arizona/California/Utah/Nevada ride, and if you’re really looking\nfor some two-wheeled adventure, a North/Central American tour from Hollywood\nall the way down to Panama City. Edelweiss’ tours range from shorter week or\ntwo-week long tours, or you can spend up to 75 days in the saddle – it’s up to\nyou!\n\nFor endless motorcycle adventure opportunities, check out Edelweiss’ tours\nhere.\n\n### Moto Discovery\n\nMoto Discovery has been around since 1981, and they’ve been riding the often\noverlooked roads of the world seeking authentic destinations off the beaten\npath. That’s right, the world. There’s almost virtually nowhere Moto Discovery\ndoesn’t operate. For riders looking to explore dual-sport and ADV routes here\nin America, Moto Discovery offers guided tours in Colorado, Alaska, Utah and\nArizona. Almost all the rides Moto Discovery and its tour guides take you on\nare dirt roads. There’s no boring interstate freeway travel here.\n\nFor more information about the company and how you can get linked up, check\nout www.motodiscovery.com.\n\n### MotoQuest\n\nMotoQuest started in Alaska – yup, Alaska – and has since spread to all over\nthe world. MotoQuest likes to keep their guided tour groups on the smaller,\nmore intimate side with the motto: small groups, big adventures. This guided\nmotorcycle touring company is more ADV oriented and prefers to take the path\nless traveled into places and destinations one might never expect to go for\nreal-life experiences with the locals. Their U.S. tours are primarily focused\nall over Alaska, the Yukon, and all the way down the West Coast into Baja\nMexico, but there are guided tours on every single continent, too, except\nAntarctica…\n\nFor more info and how to get started, head to motoquest.com.\n\n### RawHyde Adventures\n\nRawHyde Adventures is another ADV-focused motorcycle touring company. In the\nUnited States, there are 4,127,000 miles of public roads, and of those,\n1,392,000 are unpaved, including most of the roads in our National Parks. That\nmeans nearly one-third of the available roads in the U.S. are ones that most\nfolks don’t get to investigate or ride. That’s where RawHyde Adventures comes\nin. This ADV guided motorcycle touring company has routes all over California,\nBaja Mexico, Utah, New Mexico, Colorado, Wyoming, Idaho, and Montana. There\nare also routes down into South America. All of these rides are professionally\nguided, range from five days to multiple-week journeys and are offered year\nround so long as the particular route isn’t snowed in!\n\nFor more details and information on how to get registered, head over to\nrawhyde-offroad.com.\n\n### Rocky Mountain Moto Adventures\n\nFrom the Canadian and Colorado Rockies to the Pacific Northwest, our National\nParks, Alaska, and the Pacific Coast Highway, the options are almost limitless\nwith Rocky Mountain Moto Adventures. All you have to do is show up ready to\nride, RMMA will handle the rest. You can keep it short with a two-day ride\nfrom Southern California to Las Vegas, or stretch it out to three weeks across\nAlaska and Canada. Whether you’re a newer rider or a seasoned veteran, Rocky\nMountain Moto Adventures has a guided tour in a location you’ll never forget.\n\nMore info and scheduling availability can be found at\nrockymountainmotoadventures.com.\n\n### Twisted Road\n\nTwisted Road isn’t a guided motorcycle touring company, but we felt it needed\nto be included on this list because you should know about it. Basically, it’s\nAirBnB for your motorcycle. Twisted Road members can rent other people’s\nmotorcycles – or rent out their own as well. If you’re travelling somewhere\nand would like to ride a motorcycle, you can log onto Twisted Road to see\nwho’s bike you can rent and for how long – and vice versa for renting out your\nown motorcycle when you’re not using it. Motorcycle owners/renters can then\ngive you local knowledge about roads to ride and places to see. It’s pretty\nneat!\n\nFor more information and details on how you can become a member, visit\ntwistedroad.com.\n\n### Women’s Motorcycle Tours\n\nBy women, for women, this guided motorcycle touring company is focused on\nsupporting women and encouraging them to pursue two-wheeled adventure both on-\nand off-road as well as promoting the camaraderie that comes with it. Their\ntours span all four corners of the U.S. and even include Cuba and Africa if\nyou’re really looking to get off the grid. The tours range from 10 days to\nthree weeks and explore some of America’s most scenic locations. Talk to your\ngirlfriends, wives and sisters, and do something different, hit the road!\n\nFind out more information and all about their tours here.\n\nShare\n\nPrint\n\n#####\n\n#Edelweiss #RawhydeAdventures #Eaglerider #TwistedRoad\n#BestMotorcycleTouringCompanies #ADVMotorcycleTouring\n#AdventureMotorcycleTours #MotorcycleTouringCompanies #AdMoTours\n#BikeweekMotorcycleTours #EagleRider #EdelweissMotorcycleTours #MotoDiscovery\n#MotoQuest #MotoQuest #RawHydeAdventures #Rare #WomensMotorcycleTours\n#MotorcycleAirbnb\n\nAdd/Edit  \\+ Add Hashtags\n\nMotorcycle.com Staff\n\nMotorcycle.com presents an unrivaled combination of bike reviews and news\nwritten by industry experts\n\nMore by Motorcycle.com Staff\n\nPublished  July 31st, 2018 9:53 PM\n\n**Motorcycle Insurance**\n\n##### Comments\n\n##### Join the conversation\n\n2 of 7 comments\n\nSee more\n\n  * Joeletaxi on Dec 09, 2019 \n\nCheck out Native Moto Adventures, based in San Francisco.  \nwww.ridenative.com\n\nI was in SF on a business trip and wanted to explore the backroads with\nlocals, on 2 wheels ideally. They hooked me up with one of their bikes (KTM\nAdventure R) and we covered over 120 miles of stunning scenery in one full\nday. Jen + Saf were great, and very personable. Will make sure to book a\nlonger tour with them next time i'm in the Bay Area.\n\nhttps://www.youtube.com/wat...\n\nLike  Reply\n\n  *   * Ale Copos on Jan 14, 2020 \n\nFor BMW motorcycle tours in Europe I recommend Adventure Motorcycle Tours and\nRentals, a BMW Motorrad travel partner based in Transylvania one hour away\nfrom Transfagarasan and Transalpina, some of the most beautiful road for a\nrider. Transylvania''s main airport Cluj Napoca is 30 minutes away from the\ngarage and so is Turda Salt Mine and Turda Gorges.  \nhttps://motorcycle-tours.travel/\n\nLike  Reply\n\n  * \n\nSign Up to Comment\n\n##### New Rider's Hub\n\nGet Started\n\n##### Find your Motorcycle\n\n#####\n\nSpecs\n\nClassifieds\n\nCategory Chopper Cruiser Off-Road On-Off Road Scooter Sport Sport-Touring\nStandard Touring Touring Scooter Track Youth\n\nMake AlphaSports American IronHorse Aprilia Benelli Bennche BETA Big Bear\nChoppers Big Dog BMW Brammo Buell California Scooter Co. Can-Am CFMOTO Chicago\nScooter Co. CSC Motorcycles Ducati E-ton Erik Buell Racing Fischer Flyscooters\nGAS GAS GASGAS Genuine Scooter Co. Harley-Davidson Honda Husaberg Husqvarna\nHyosung Indian Kawasaki Kayo KTM Kymco Lambretta Lance LiveWire Moto Guzzi\nMotus MV Agusta MZ NIU Norton Peirspeed Piaggio Polaris QLINK Royal Alloy\nRoyal Enfield Saxon Motorcycle Schwinn SSR Motorsports Suzuki SYM Tomberlin\nTomos Triumph United Motors Ural Vectrix Vento Vespa Victory Yamaha Zero\n\nYear 2024 2023 2022 2021 2020 2019 2018 2017 2016 2015 2014 2013 2012 2011\n2010 2009 2008 2007 2006 2005 2004\n\nModel\n\nFind\n\nManufacturer Aprilia BMW Ducati Energica Harley-Davidson Honda Husqvarna\nIndian Kawasaki KTM Kymco Moto Guzzi MV Piaggio Suzuki Triumph Vespa Yamaha\nZero\n\nFind\n\n##### Top Brands\n\n  * Aprilia\n  * BMW\n  * Ducati\n  * Honda\n  * Kawasaki\n  * KTM\n  * Triumph\n  * CFMoto\n  * Indian\n  * Yamaha\n  * Harley-Davidson\n  * Suzuki\n\n##### Popular Articles\n\n##### 2024 Suzuki GSX-8R Review – First Ride\n\n##### A Storm is Coming for the Triumph Rocket 3 R and GT\n\n##### 2024 CFMOTO 800NK Review\n\n##### What’s the Worst Motorcycle Color? – Question of the Day\n\n##### Polaris Says Indian Motorcycle Turned A Profit For the First Time\n\nNext\n\nPrev\n\n##### You may also be interested in\n\n######  2024 BMW F 800 GS, F 900 GS and F 900 GS Adventure Announced for USA\n\n######  Evans Brasfield's Motorcycles Are For Sale\n\n######  MO Tested: Michelin Road 6 Tire Review\n\n######  Best Sport-Touring Motorcycle of 2023\n\n######  Best Sport-Touring Motorcycle of 2022\n\n######  Best Sport-Touring Motorcycle of 2021\n\n######  Livewire’s Next Motorcycle Will Be the S2 Mulholland\n\n######  The KTM 890 SMT is Coming to North America for 2024\n\n######  How to Set Up Your Motorcycle Controls to Fit\n\n######  Friday Forum Foraging: A Sweet Little Monster\n\n######  2024 Kawasaki Ninja 500 and Z500 – First Look\n\n######  Friday Forum Foraging: 2021 Ducati Supersport – With A Twist\n\n######  2023 Honda SCL500 Review – First Ride\n\n######  Friday Forum Foraging: The Honda Blackbird Sport-Tourer\n\n######  2024 KTM 990 Duke – First Look\n\n######  Church Of MO: 2009 Ducati Multistrada 1100 S Review\n\n######  Polaris Says Indian Motorcycle Turned A Profit For the First Time\n\n######  Husqvarna Norden 901 Receives Minor Tweaks For 2024\n\nAbout Privacy Terms Contact us Advertising Copyright\n\nFollow us\n\n© 2024  VerticalScope Inc. All rights reserved.\n\n",
    "links": "[{\"link\": \"https://www.motorcycle.com/\", \"text\": \"\"}, {\"link\": \"https://www.motorcycle.com/my-history\", \"text\": \"My History\"}, {\"link\": \"https://www.motorcycle.com/sharebox/post\", \"text\": \"\"}, {\"link\": \"https://www.motorcycle.com/my-account\", \"text\": \"Account Settings\"}, {\"link\": \"https://www.motorcycle.com/specs/\", \"text\": \"Specs\"}, {\"link\": \"https://www.motorcycle.com/classifieds/motorcycle-classifieds.html\", \"text\": \"Classifieds\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/reviews.html\", \"text\": \"Bike Reviews\"}, {\"link\": \"https://www.motorcycle.com/products/\", \"text\": \"Product Reviews\"}, {\"link\": \"https://www.motorcycle.com/products/the-5-best-motorcycle-cameras\", \"text\": \"Best Motorcycle Cameras\"}, {\"link\": \"https://www.motorcycle.com/products/best-motorcycle-earplugs\", \"text\": \"Best Motorcycle Earplugs\"}, {\"link\": \"https://www.motorcycle.com/products/best-motorcycle-oil\", \"text\": \"Best Motorcycle Oil\"}, {\"link\": \"https://www.motorcycle.com/products/best-leather-motorcycle-jackets\", \"text\": \"Best Leather Jackets\"}, {\"link\": \"https://www.motorcycle.com/products/best-winter-motorcycle-gloves\", \"text\": \"Best Winter Gloves\"}, {\"link\": \"https://www.motorcycle.com/products/best-sportbike-tires\", \"text\": \"Best Sportbike Tires\"}, {\"link\": \"https://www.motorcycle.com/products/motorcycle-gps-buyers-guide\", \"text\": \"GPS Buyers Guide\"}, {\"link\": \"https://www.motorcycle.com/products/motorcycle-gear-deals\", \"text\": \"Gear Deals\"}, {\"link\": \"https://www.motorcycle.com/categories/adventure-touring\", \"text\": \"Adventure Touring\"}, {\"link\": \"https://www.motorcycle.com/categories/cruiser.html\", \"text\": \"Cruiser\"}, {\"link\": \"https://www.motorcycle.com/categories/electric.html\", \"text\": \"Electric\"}, {\"link\": \"https://www.motorcycle.com/categories/off-road.html\", \"text\": \"Off-Road\"}, {\"link\": \"https://www.motorcycle.com/categories/on-off-road.html\", \"text\": \"On-Off-Road\"}, {\"link\": \"https://www.motorcycle.com/categories/other.html\", \"text\": \"Other\"}, {\"link\": \"https://www.motorcycle.com/categories/scooter.html\", \"text\": \"Scooter\"}, {\"link\": \"https://www.motorcycle.com/categories/sport-touring.html\", \"text\": \"Sport-Touring\"}, {\"link\": \"https://www.motorcycle.com/categories/sportbikes.html\", \"text\": \"Sportbikes\"}, {\"link\": \"https://www.motorcycle.com/categories/standard.html\", \"text\": \"Standard\"}, {\"link\": \"https://www.motorcycle.com/categories/touring.html\", \"text\": \"Touring\"}, {\"link\": \"https://www.motorcycle.com/categories/touring-scooter.html\", \"text\": \"Touring Scooter\"}, {\"link\": \"https://www.motorcycle.com/categories/track.html\", \"text\": \"Track\"}, {\"link\": \"https://www.motorcycle.com/categories/youth.html\", \"text\": \"Youth\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/aprilia.html\", \"text\": \"Aprilia\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/bmw.html\", \"text\": \"BMW\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/cfmoto.html\", \"text\": \"CFMoto\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/ducati.html\", \"text\": \"Ducati\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/energica\", \"text\": \"Energica\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/gasgas\", \"text\": \"Gas-Gas\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/harley-davidson.html\", \"text\": \"Harley-Davidson\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/honda.html\", \"text\": \"Honda\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/husqvarna.html\", \"text\": \"Husqvarna\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/indian.html\", \"text\": \"Indian\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/kawasaki.html\", \"text\": \"Kawasaki\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/ktm.html\", \"text\": \"KTM\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/kymco.html\", \"text\": \"Kymco\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/moto-guzzi.html\", \"text\": \"Moto Guzzi\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/mv-agusta.html\", \"text\": \"MV Agusta\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/piaggio.html\", \"text\": \"Piaggio\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/royal-enfield.html\", \"text\": \"Royal Enfield\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/suzuki.html\", \"text\": \"Suzuki\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/triumph.html\", \"text\": \"Triumph\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/vespa.html\", \"text\": \"Vespa\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/yamaha.html\", \"text\": \"Yamaha\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/zero.html\", \"text\": \"Zero\"}, {\"link\": \"https://www.motorcycle.com/content/new-rider-hub-getting-started\", \"text\": \"New Rider's Hub\"}, {\"link\": \"https://www.motorcycle.com/dealers/motorcycle-dealers.html\", \"text\": \"Dealers\"}, {\"link\": \"https://www.motorcycle.com/rider-safety/rider-training-safety.html\", \"text\": \"Safety\"}, {\"link\": \"https://www.motorcycle.com/videos.html\", \"text\": \"Videos\"}, {\"link\": \"https://www.motorcycle.com/buyers-guide/motorcycle-insurance.html\", \"text\": \"Insurance\"}, {\"link\": \"https://www.motorcycle.com/specs/\", \"text\": \"Specs\"}, {\"link\": \"https://www.motorcycle.com/classifieds/motorcycle-classifieds.html\", \"text\": \"Classifieds\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/reviews.html\", \"text\": \"Bike Reviews\"}, {\"link\": \"https://www.motorcycle.com/products/\", \"text\": \"\"}, {\"link\": \"https://www.motorcycle.com/products/the-5-best-motorcycle-cameras\", \"text\": \"Best Motorcycle Cameras\"}, {\"link\": \"https://www.motorcycle.com/products/best-motorcycle-earplugs\", \"text\": \"Best Motorcycle Earplugs\"}, {\"link\": \"https://www.motorcycle.com/products/best-motorcycle-oil\", \"text\": \"Best Motorcycle Oil\"}, {\"link\": \"https://www.motorcycle.com/products/best-leather-motorcycle-jackets\", \"text\": \"Best Leather Jackets\"}, {\"link\": \"https://www.motorcycle.com/products/best-winter-motorcycle-gloves\", \"text\": \"Best Winter Gloves\"}, {\"link\": \"https://www.motorcycle.com/products/best-sportbike-tires\", \"text\": \"Best Sportbike Tires\"}, {\"link\": \"https://www.motorcycle.com/products/motorcycle-gps-buyers-guide\", \"text\": \"GPS Buyers Guide\"}, {\"link\": \"https://www.motorcycle.com/products/motorcycle-gear-deals\", \"text\": \"Gear Deals\"}, {\"link\": \"https://www.motorcycle.com/categories/adventure-touring\", \"text\": \"Adventure Touring\"}, {\"link\": \"https://www.motorcycle.com/categories/cruiser.html\", \"text\": \"Cruiser\"}, {\"link\": \"https://www.motorcycle.com/categories/electric.html\", \"text\": \"Electric\"}, {\"link\": \"https://www.motorcycle.com/categories/off-road.html\", \"text\": \"Off-Road\"}, {\"link\": \"https://www.motorcycle.com/categories/on-off-road.html\", \"text\": \"On-Off-Road\"}, {\"link\": \"https://www.motorcycle.com/categories/other.html\", \"text\": \"Other\"}, {\"link\": \"https://www.motorcycle.com/categories/scooter.html\", \"text\": \"Scooter\"}, {\"link\": \"https://www.motorcycle.com/categories/sport-touring.html\", \"text\": \"Sport-Touring\"}, {\"link\": \"https://www.motorcycle.com/categories/sportbikes.html\", \"text\": \"Sportbikes\"}, {\"link\": \"https://www.motorcycle.com/categories/standard.html\", \"text\": \"Standard\"}, {\"link\": \"https://www.motorcycle.com/categories/touring.html\", \"text\": \"Touring\"}, {\"link\": \"https://www.motorcycle.com/categories/touring-scooter.html\", \"text\": \"Touring Scooter\"}, {\"link\": \"https://www.motorcycle.com/categories/track.html\", \"text\": \"Track\"}, {\"link\": \"https://www.motorcycle.com/categories/youth.html\", \"text\": \"Youth\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/aprilia.html\", \"text\": \"Aprilia\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/bmw.html\", \"text\": \"BMW\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/cfmoto.html\", \"text\": \"CFMoto\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/ducati.html\", \"text\": \"Ducati\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/energica\", \"text\": \"Energica\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/gasgas\", \"text\": \"Gas-Gas\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/harley-davidson.html\", \"text\": \"Harley-Davidson\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/honda.html\", \"text\": \"Honda\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/husqvarna.html\", \"text\": \"Husqvarna\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/indian.html\", \"text\": \"Indian\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/kawasaki.html\", \"text\": \"Kawasaki\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/ktm.html\", \"text\": \"KTM\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/kymco.html\", \"text\": \"Kymco\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/moto-guzzi.html\", \"text\": \"Moto Guzzi\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/mv-agusta.html\", \"text\": \"MV Agusta\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/piaggio.html\", \"text\": \"Piaggio\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/royal-enfield.html\", \"text\": \"Royal Enfield\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/suzuki.html\", \"text\": \"Suzuki\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/triumph.html\", \"text\": \"Triumph\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/vespa.html\", \"text\": \"Vespa\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/yamaha.html\", \"text\": \"Yamaha\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/zero.html\", \"text\": \"Zero\"}, {\"link\": \"https://www.motorcycle.com/content/new-rider-hub-getting-started\", \"text\": \"New Rider's Hub\"}, {\"link\": \"https://www.motorcycle.com/dealers/motorcycle-dealers.html\", \"text\": \"Dealers\"}, {\"link\": \"https://www.motorcycle.com/rider-safety/rider-training-safety.html\", \"text\": \"Safety\"}, {\"link\": \"https://www.motorcycle.com/videos.html\", \"text\": \"Videos\"}, {\"link\": \"https://www.motorcycle.com/buyers-guide/motorcycle-insurance.html\", \"text\": \"Insurance\"}, {\"link\": \"https://www.motorcycle.com/my-history\", \"text\": \"My History\"}, {\"link\": \"https://www.motorcycle.com/sharebox/post\", \"text\": \"\"}, {\"link\": \"https://www.motorcycle.com/my-account\", \"text\": \"Account Settings\"}, {\"link\": \"https://www.motorcycle.com/products/best-motorcycle-airbag-jackets\", \"text\": \"\"}, {\"link\": \"https://www.motorcycle.com/bikes/shoot-outs/2023-european-middleweight-naked-bike-shootout-44597167\", \"text\": \"\"}, {\"link\": \"https://www.motorcycle.com/products/motorcycle-gear-deals\", \"text\": \"\"}, {\"link\": \"https://www.motorcycle.com/features\", \"text\": \"Features\"}, {\"link\": \"https://www.motorcycle.com/member/40/motorcycle-com-staff\", \"text\": \"Motorcycle.com Staff\"}, {\"link\": \"https://www.motorcycle.com/content/new-rider-hub-getting-started\", \"text\": \"\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/aprilia.html\", \"text\": \"\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/bmw.html\", \"text\": \"\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/ducati.html\", \"text\": \"\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/honda.html\", \"text\": \"\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/kawasaki.html\", \"text\": \"\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/ktm.html\", \"text\": \"\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/triumph.html\", \"text\": \"\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/cfmoto.html\", \"text\": \"\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/indian.html\", \"text\": \"\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/yamaha.html\", \"text\": \"\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/harley-davidson.html\", \"text\": \"\"}, {\"link\": \"https://www.motorcycle.com/manufacturer/suzuki.html\", \"text\": \"\"}, {\"link\": \"https://www.motorcycle.com/bikes/manufacturer/suzuki/2024-suzuki-gsx-8r-review-first-ride-44598256\", \"text\": \"\"}, {\"link\": \"https://www.motorcycle.com/bikes/new-model-preview/a-storm-is-coming-for-the-triumph-rocket-3-r-and-gt-44598304\", \"text\": \"\"}, {\"link\": \"https://www.motorcycle.com/bikes/manufacturer/cfmoto/2024-cfmoto-800nk-review-44598145\", \"text\": \"\"}, {\"link\": \"https://www.motorcycle.com/bikes/features/whats-the-worst-motorcycle-color-question-of-the-day-44598316\", \"text\": \"\"}, {\"link\": \"https://www.motorcycle.com/bikes/news/polaris-says-indian-motorcycle-turned-a-profit-for-the-first-time-44598298\", \"text\": \"\"}, {\"link\": \"https://www.motorcycle.com/bikes/new-model-preview/2024-bmw-f-800-gs-f-900-gs-and-f-900-gs-adventure-announced-for-usa-44598055\", \"text\": \"\"}, {\"link\": \"https://www.motorcycle.com/bikes/new-model-preview/2024-bmw-f-800-gs-f-900-gs-and-f-900-gs-adventure-announced-for-usa-44598055\", \"text\": \"2024 BMW F 800 GS, F 900 GS and F 900 GS Adventure Announced for USA\"}, {\"link\": \"https://www.motorcycle.com/bikes/features/evans-brasfield-s-motorcycles-are-for-sale-44598019\", \"text\": \"\"}, {\"link\": \"https://www.motorcycle.com/bikes/features/evans-brasfield-s-motorcycles-are-for-sale-44598019\", \"text\": \"Evans Brasfield's Motorcycles Are For Sale\"}, {\"link\": \"https://www.motorcycle.com/products/mo-tested-michelin-road-6-tire-review\", \"text\": \"\"}, {\"link\": \"https://www.motorcycle.com/products/mo-tested-michelin-road-6-tire-review\", \"text\": \"MO Tested: Michelin Road 6 Tire Review\"}, {\"link\": \"https://www.motorcycle.com/bikes/mobos/best-sport-touring-motorcycle-of-2023-44597152\", \"text\": \"\"}, {\"link\": \"https://www.motorcycle.com/bikes/mobos/best-sport-touring-motorcycle-of-2023-44597152\", \"text\": \"Best Sport-Touring Motorcycle of 2023\"}, {\"link\": \"https://www.motorcycle.com/mobos/best-sport-touring-motorcycle-of-2022.html\", \"text\": \"\"}, {\"link\": \"https://www.motorcycle.com/mobos/best-sport-touring-motorcycle-of-2022.html\", \"text\": \"Best Sport-Touring Motorcycle of 2022\"}, {\"link\": \"https://www.motorcycle.com/mobos/best-sport-touring-motorcycle-of-2021.html\", \"text\": \"\"}, {\"link\": \"https://www.motorcycle.com/mobos/best-sport-touring-motorcycle-of-2021.html\", \"text\": \"Best Sport-Touring Motorcycle of 2021\"}, {\"link\": \"https://www.motorcycle.com/bikes/new-model-preview/livewires-next-motorcycle-will-be-the-s2-mulholland-44596849\", \"text\": \"\"}, {\"link\": \"https://www.motorcycle.com/bikes/new-model-preview/livewires-next-motorcycle-will-be-the-s2-mulholland-44596849\", \"text\": \"Livewire’s Next Motorcycle Will Be the S2 Mulholland\"}, {\"link\": \"https://www.motorcycle.com/bikes/new-model-preview/ktm-890-smt-is-coming-to-north-america-for-2024-44596825\", \"text\": \"\"}, {\"link\": \"https://www.motorcycle.com/bikes/new-model-preview/ktm-890-smt-is-coming-to-north-america-for-2024-44596825\", \"text\": \"The KTM 890 SMT is Coming to North America for 2024\"}, {\"link\": \"https://www.motorcycle.com/bikes/how-to/how-to-set-up-your-motorcycle-controls-to-fit-44596795\", \"text\": \"\"}, {\"link\": \"https://www.motorcycle.com/bikes/how-to/how-to-set-up-your-motorcycle-controls-to-fit-44596795\", \"text\": \"How to Set Up Your Motorcycle Controls to Fit\"}, {\"link\": \"https://www.motorcycle.com/bikes/features/friday-forum-foraging-a-sweet-little-monster-44596414\", \"text\": \"\"}, {\"link\": \"https://www.motorcycle.com/bikes/features/friday-forum-foraging-a-sweet-little-monster-44596414\", \"text\": \"Friday Forum Foraging: A Sweet Little Monster\"}, {\"link\": \"https://www.motorcycle.com/bikes/new-model-preview/2024-kawasaki-ninja-500-and-z500-first-look-44596372\", \"text\": \"\"}, {\"link\": \"https://www.motorcycle.com/bikes/new-model-preview/2024-kawasaki-ninja-500-and-z500-first-look-44596372\", \"text\": \"2024 Kawasaki Ninja 500 and Z500 – First Look\"}, {\"link\": \"https://www.motorcycle.com/bikes/features/friday-forum-foraging-2021-ducati-supersport-with-a-twist-44597347\", \"text\": \"\"}, {\"link\": \"https://www.motorcycle.com/bikes/features/friday-forum-foraging-2021-ducati-supersport-with-a-twist-44597347\", \"text\": \"Friday Forum Foraging: 2021 Ducati Supersport – With A Twist\"}, {\"link\": \"https://www.motorcycle.com/bikes/manufacturer/honda/2023-honda-scl500-review-first-ride-44594134\", \"text\": \"\"}, {\"link\": \"https://www.motorcycle.com/bikes/manufacturer/honda/2023-honda-scl500-review-first-ride-44594134\", \"text\": \"2023 Honda SCL500 Review – First Ride\"}, {\"link\": \"https://www.motorcycle.com/bikes/features/friday-forum-foraging-the-honda-blackbird-sport-tourer-44593831\", \"text\": \"\"}, {\"link\": \"https://www.motorcycle.com/bikes/features/friday-forum-foraging-the-honda-blackbird-sport-tourer-44593831\", \"text\": \"Friday Forum Foraging: The Honda Blackbird Sport-Tourer\"}, {\"link\": \"https://www.motorcycle.com/bikes/new-model-preview/2024-ktm-990-duke-first-look-44596321\", \"text\": \"\"}, {\"link\": \"https://www.motorcycle.com/bikes/new-model-preview/2024-ktm-990-duke-first-look-44596321\", \"text\": \"2024 KTM 990 Duke – First Look\"}, {\"link\": \"https://www.motorcycle.com/bikes/church-of-mo/church-of-mo-2009-ducati-multistrada-1100-s-review-44596006\", \"text\": \"\"}, {\"link\": \"https://www.motorcycle.com/bikes/church-of-mo/church-of-mo-2009-ducati-multistrada-1100-s-review-44596006\", \"text\": \"Church Of MO: 2009 Ducati Multistrada 1100 S Review\"}, {\"link\": \"https://www.motorcycle.com/bikes/news/polaris-says-indian-motorcycle-turned-a-profit-for-the-first-time-44598298\", \"text\": \"\"}, {\"link\": \"https://www.motorcycle.com/bikes/news/polaris-says-indian-motorcycle-turned-a-profit-for-the-first-time-44598298\", \"text\": \"Polaris Says Indian Motorcycle Turned A Profit For the First Time\"}, {\"link\": \"https://www.motorcycle.com/bikes/news/husqvarna-norden-901-receives-minor-tweaks-for-2024-44595646\", \"text\": \"\"}, {\"link\": \"https://www.motorcycle.com/bikes/news/husqvarna-norden-901-receives-minor-tweaks-for-2024-44595646\", \"text\": \"Husqvarna Norden 901 Receives Minor Tweaks For 2024\"}, {\"link\": \"https://www.motorcycle.com/content/about-us\", \"text\": \"About\"}, {\"link\": \"https://www.motorcycle.com/content/terms-of-service\", \"text\": \"Terms\"}, {\"link\": \"https://www.motorcycle.com/content/contact-us\", \"text\": \"Contact us\"}, {\"link\": \"https://www.motorcycle.com/content/advertising-info\", \"text\": \"Advertising\"}]"
}