{
    "summary": "Open in app\n\nSign up\n\nSign in\n\nWrite\n\nSign up\n\nSign in\n\nAmazon Brand Analytics Report\n\n# Amazon Brand Analytics Search Terms: Untapped Potential\n\n## Making smarter decisions with direct, automated access to Amazon search\ndata\n\nThomas Spicer\n\n·\n\nFollow\n\nPublished in\n\nOpenbridge\n\n·\n\n6 min read\n\n·\n\nJul 18, 2022\n\n\\--\n\nListen\n\nShare\n\nTo make your products appear in Amazon search results, Seller Central and\nVendor Central merchants must provide keywords that potential customers might\nuse when searching for a product they want.\n\nKeywords are the words search engines use to match an ASIN with a query — in\nthis post, keywords mean terms sellers enter into search terms fields when\nthey list or update an ASIN.\n\nAs a result, keywords are critical to an effective and efficient marketing\nstrategy that improves organic rankings, enhances product listings, and drives\nproduct sales.\n\nIn a prior post, we detailed How to download the Amazon search terms report.\nThis post will show you how to harness the power of using the Amazon Seller\nCentral search term report to supercharge Amazon KPIs with a private keyword\ntool for Amazon retail analytics.\n\nFirst, we will cover the broader category the search falls under, Brand\nAnalytics. Next, we will dig into the Search Term Report data.\n\n# What is Amazon Brand Analytics?\n\nAmazon Brand Analytics provides brands with insights into how customers\nperceive their brand. This includes understanding the impact of Amazon\nreviews, products, price changes, and promotions. Brands can use this\ninformation to improve their overall consumer experience.\n\nBrands can see where their customers spend most of their time online,\nincluding browsing, searching, buying, watching videos, reading reviews, and\nsharing. They can also track whether people shop during prime times, holidays,\nweekends, or weekdays. These insights help brands understand how people\ninteract with their brands across different channels.\n\nAmazon Brand Analytics helps businesses make better decisions based on data\nrather than gut instinct. For example, it allows companies to identify\nseasonal fluctuations, how much money people spent per purchase, and how many\npurchases occurred on mobile devices versus desktop computers.\n\nThe search data report will help brands understand how people use Amazon to\ndiscover products. It includes keyword data from searches conducted on Amazon.\nIt provides insight into the queries that lead people to specific product\ncategories and subcategories.\n\nThe report includes information about the following areas:\n\n  * Keywords used to find products\n  * Product category and subcategory terms\n  * Number of times each term was searched\n  * Average position of each term within the search results\n  * Percentage of total searches performed on Amazon.com\n\n# Amazon Search Terms Report\n\nDirect Amazon supplied search data reflects real customer shopping behavior.\nAccess to customer behavior via the Amazon Brand Analytics Search Terms report\noffers critical shopper Insights.\n\n## What is the Amazon Brand Analytics Search Terms report?\n\nUnder your Amazon Brand Analytics Reports is a treasure trove report called\nthe Amazon Search Terms report. This report provides insight into search-\nrelated customer behavior on Amazon. This tool lets you see how often\nparticular keywords are searched for within Amazon. You can view the data for\nspecific terms, categories, or regions. For example, you could look up how\noften “iPhone XR” was searched for in the United States. Or you could check\nout how frequently “Amazon Alexa” is used in Canada.\n\nYou can filter the data based on date range, location, product type, and\ndevice type. When viewing the data for a particular term, you’ll notice that\nthere are three columns:\n\n• Total searches — How many total searches were performed for the given\nkeyword.\n\n• Average position — The average position for each item that had a match for\nthe given keyword. If multiple items were matched, the average position is\ncalculated across all those items.\n\n• Items clicked — How many items had a match for the keyword.\n\nIf you want to know how often a keyword is searched for, it makes sense to\nfocus on the number of total searches. However, if you’re interested in\nlearning whether a keyword is being searched for more now than in the past,\nyou might want to pay attention to the average position. And if you’re curious\nabout how much traffic a keyword generates, you’d probably like to keep tabs\non the number of clicked items. This is critical data for a robust competitive\nkeywords strategy.\n\nIn addition to providing insights into how people interact with Amazon.com,\nthe Search Terms report gives you access to historical data.\n\nSo, if you want to find out how often a keyword was searched for in the past,\nyou can select a date range and start searching.\n\n# Amazon Search Term Report Metrics and Dimensions\n\nThe report will contain performance metrics for individual search terms that\nreflect the actual buying behavior of Amazon customers resulting from billions\nof searches. The metrics and dimensions in the report provide performance\nmetrics that fuel invaluable insights for more intelligent business decisions.\n\nBelow are the essential metrics and dimensions in the data:\n\n  * The numeric rank of the search\n  * The popular search terms by category (department)\n  * The sales volume of products\n  * The current market share of a product and category\n  * The conversion rate for the product and keyword\n  * The percentage of conversions\n  * The percentage of sales\n  * The product title is associated with a keyword\n\nData is broken down into four date dimensions: DAY, WEEK, MONTH, and QUARTER,\nallowing for trending exact search volume over a more extended period of time.\n\n## What is search frequency rank?\n\nSearch frequency ranks are an essential indication for sellers looking into\nkeyword data. They provide insight into how much traffic you can expect to\nreceive for each keyword over time.\n\nHundreds of thousands of keywords are available in the weekly search frequency\nreport. This includes both broad match and exact match searches. You can see\nhow often people searched for a specific phrase and what percentage of those\nsearches came up during the previous week.\n\nThe search frequency rank is based on the average search volume per day. The\nlower the number, the less likely someone is to search for that term.\n\n## What are click share and conversion share?\n\nClick share gives you an idea of how often a visitor clicks on one of the\nlistings. Conversion share tells you how many visitors converted into sales.\nThis information helps you understand what percentage of people who see your\nlisting buy it. These are essential cues to how a specific competitor’s\nproduct may perform.\n\n# What is an Amazon search analytics dashboard?\n\nAn Amazon Search Analytics dashboard is a visual interface that allows sellers\nto view and analyze data about the performance of their products in search\nresults on the Amazon website. The dashboard typically includes a variety of\ngraphs, charts, and other visual elements that allow sellers to see how their\nproducts are performing in terms of key metrics such as the number of times\nthey appear in search results, the number of clicks they receive, and the\nconversion rate of those clicks into sales.\n\nYou can also automate search data via code-free pipelines. Unified search term\ndata can be used in tools like Google Data Studio, Tableau, Microsoft Power\nBI, Looker, or Amazon Quicksight. Powerful data tools like these allow your\nAmazon Search Analytics dashboard to filter and drill down into the data, such\nas the ability to view data for specific periods, products, or product\ncategories. This can help sellers identify trends and patterns in their search\nperformance and make informed decisions about optimizing their products to\nimprove their ranking in search results and increase sales.\n\n# Get Started With Amazon Brand Analytics Search Terms— For Free\n\nDirect, automated access to first-party search data gives you everything you\nneed to create a private Amazon Brand Analytics Tool for your business. Create\nreports that provide valuable insights into current search trends and\nactionable insights to shape advertising decisions or traffic diagnostic\ninformation for your marketing channels.\n\nOpenbridge offers an automated, code-free data connector for Amazon Search\nTerms. You can have;\n\n  1. Unified search term data into industry-leading data destinations like Amazon Redshift, Amazon Redshift Spectrum, Google BigQuery, Snowflake, Azure Data Lake, and Amazon Athena.\n  2. With search term data consolidated, use your favorite business intelligence, data visualization, SQL, or data science tools like Google Data Studio, Tableau, Microsoft Power BI, Looker, or Amazon Quicksight for valuable insights, custom search analytics dashboard, or brand dashboard for performance metrics.\n\nTap into new audience insights, optimize advertising activities or marketing\ncampaigns, or discover competitor insights that accelerate sales growth.\n\n## Sign up for a 30-day free trial of our fully automated Amazon Search Term\ndata pipeline today!\n\nThe Amazon Brand Analytics Search Terms are available to both Amazon Vendor\nCentral and Seller Central. Access requires that you be registered in the\nAmazon Brand Registry. Only a brand owner will have access to Amazon's brand\nanalytics data.\n\n## References:\n\n## How to download the Amazon Search Terms report?\n\n### Keep using manual file downloads or start using SP-API data automation?\n\nblog.openbridge.com\n\n## Why Amazon Brand Analytics Fuels Growth\n\n### Build your brand and crush the competition with accelerated sales,\nprofitability, and selling efficiency\n\nblog.openbridge.com\n\n## Amazon Detail Page Sales and Traffic Business Reports\n\n### How automating key Amazon business reports can turbocharge data-driven\ngrowth\n\nblog.openbridge.com\n\n## Google Data Studio + Amazon Seller Central\n\n### We are excited to announce Google Data Studio users can now leverage our\nAmazon Seller Central (SP-API) partner…\n\nblog.openbridge.com\n\n## Sign up to discover human stories that deepen your understanding of the\nworld.\n\n## Free\n\nDistraction-free reading. No ads.\n\nOrganize your knowledge with lists and highlights.\n\nTell your story. Find your audience.\n\nSign up for free\n\n## Membership\n\nAccess the best member-only stories.\n\nSupport independent authors.\n\nListen to audio narrations.\n\nRead offline.\n\nJoin the Partner Program and earn for your writing.\n\nTry for $5/month\n\nAmazon\n\nAmazon Selling Tips\n\nAnalytics\n\nEcommerce\n\nAmazon Seo\n\n\\--\n\n\\--\n\nFollow\n\n## Written by Thomas Spicer\n\n700 Followers\n\n·Editor for\n\nOpenbridge\n\nhttps://www.openbridge.com\n\nFollow\n\nHelp\n\nStatus\n\nAbout\n\nCareers\n\nBlog\n\nPrivacy\n\nTerms\n\nText to speech\n\nTeams\n\n",
    "links": "[{\"link\": \"https://blog.openbridge.com/how-to-download-the-amazon-search-terms-report-b2d383561e42\", \"text\": \"How to download the Amazon search terms report\"}, {\"link\": \"https://blog.openbridge.com/amazon-kpi-8b3110d2e51a\", \"text\": \"Amazon KPIs\"}, {\"link\": \"https://blog.openbridge.com/amazon-analytics-drive-profit-with-seller-tools-2d016c1e445c\", \"text\": \"Amazon retail analytics\"}, {\"link\": \"https://blog.openbridge.com/how-to-download-the-amazon-search-terms-report-b2d383561e42?source=post_page-----7a3e4e0a39a3--------------------------------\", \"text\": \"\"}, {\"link\": \"https://blog.openbridge.com/why-amazon-brand-analytics-fuels-growth-524d73ea40cf?source=post_page-----7a3e4e0a39a3--------------------------------\", \"text\": \"\"}, {\"link\": \"https://blog.openbridge.com/amazon-detail-page-sales-and-traffic-business-reports-84226741e7a3?source=post_page-----7a3e4e0a39a3--------------------------------\", \"text\": \"\"}, {\"link\": \"https://blog.openbridge.com/google-data-studio-amazon-seller-central-6311bf862c6c?source=post_page-----7a3e4e0a39a3--------------------------------\", \"text\": \"\"}]"
}