{
    "summary": "Go to Openbridge\n\nEnglish;\n\nEnglish\n\nGo to Openbridge\n\nEnglish;\n\nEnglish\n\nAll Collections\n\nData Sources\n\nAmazon\n\nTroubleshooting Amazon Brand Analytics Permissions\n\nTroubleshooting Amazon Brand Analytics Permissions\n\nWritten by Openbridge Support\n\nUpdated over a week ago\n\nAmazon Search Terms, Market Basket, and Repeat Purchase reports are part of\nBrand Analytics. As a result, these report is only available to sellers or\nvendors who own a brand (see Amazon Brand Registry). Per Amazon, an\n**_authorizing Seller Central or Vendor Central account must be internal to\nthe brand and responsible for selling the brand in the Amazon store._**\n\nHere is an example of a permission error you may see if you are access\nrestricted:\n\n##  **Checking Your Permissions**\n\n  *  **Sellers:** If you are not able to access Brand Analytics, go to the Brand Benefit Eligibility page where you can click ‘ **Review my eligibility** ’ to correct your status and gain access to Brand Analytics reports.\n\n  *  **Vendors: Confirm your brand is registered in** Amazon Brand Registry. Also, make sure the authorizing user account has all reporting access types (Operations, Finance, Digital, etc.) enabled.\n\n## **Fixing Permissions Issues**\n\n **Sellers**\n\nIf you see an error message stating “You do not have permission to access this\npage,” request the Primary Account Administrator grant you permission to\n“Amazon Brand Analytics” on the Global User Permissions page.\n\nYou may also see the following notice on the Brand Benefit Eligibility page:\n\n  *  _You are designated as a secondary user and do not have permission to view this page._\n\nTo resolve this, you must contact the Primary Account Administrator to grant\n\"View\" permissions under - _Settings - > User Permissions -> Manage Global\nPermissions -> Select user_ and set the status to “View” for “Brand Benefit\nEligibility” under the “Performance” category.\n\n**Vendors**\n\nTo validate permissions in your vendor account, please check your permissions\nas shown below. Unlike Sellers, there is no Brand Benefits page in Vendor\nCentral. As a result, you need to assess the permissions granted to your\nVendor Central user account.\n\nFor additional permissions information, see How To Configure Amazon Selling\nPartner Permissions or Troubleshooting SP-API User Permissions.\n\nDid this answer your question?\n\n😞😐😃\n\n  * blog.openbridge.com\n  * www.openbridge.com\n\n  *   * \n\nIntercomWe run on Intercom\n\n",
    "links": "[{\"link\": \"https://docs.openbridge.com/en/\", \"text\": \"\"}, {\"link\": \"https://docs.openbridge.com/en/\", \"text\": \"All Collections\"}, {\"link\": \"https://docs.openbridge.com/en/\", \"text\": \"\"}]"
}