{
    "summary": "Create briefs that empower agency partners and level up your campaigns.\nDownload our Ebook here →\n\n  * About Us \n  * Services  Expand arrow Coral Services  Expand arrow Coral\n\n    * Our Services \n    * Content Marketing & SEO \n    * Creative & Branding \n    * Social Media & Email Marketing \n    * Website Development \n    * LinkedIn Lead Generation \n    * VC Content Strategy \n\n  * Case Studies \n  * Blog \n  * Podcast \n  *   * Schedule strategy session \n\n## Menu\n\nBack\n\n  * Home\n  * About Us \n  * Services  Expand arrow Coral Services  Expand arrow Coral\n\n    * Our Services \n    * Content Marketing & SEO \n    * Creative & Branding \n    * Social Media & Email Marketing \n    * Website Development \n    * LinkedIn Lead Generation \n    * VC Content Strategy \n\n  * Case Studies \n  * Blog \n  * Podcast \n  * Schedule strategy session \n\n  * Contact Us\n  * Subscribe to Our Newsletter\n  * Listen to Our Podcast “Tech Can’t Save Us”\n  * Connect with Us on LinkedIn\n\nBack\n\n# Top 5 Brand Analytics to Keep an Eye on\n\nby Paul David Perry\n\nOct 18, 2023•5 min read\n\nWhat you'll learn:\n\nDiscover the top 5 Brand Analytics you should keep an eye on and how to use\nAmazon's tool. Understand customer behavior, optimize search terms, and\nthrive.\n\n  * __\n  * __\n  * __\n  * __\n\nBranding is all about how a company represents itself, inside and out. With\nanalytics, you can see if people are loving what your stuff is, or hating it.\n\nNo matter how smart you are, it’s impossible to do this alone. Advanced tools\ncan quickly and accurately gather tons of qualitative and quantitative data\nbefore putting it together in a user-friendly report. Ready for you to take\naction and tweak your branding strategy if need be.\n\nOne of which is Amazon Brand Analytics, which we will cover in much more\ndetail later on. And trust us, if you want help becoming the best seller on\nthe behemoth marketplace that is Amazon, you’ll want to hear us out.\n\nSource\n\n## Why should you care about Brand Analytics?\n\nAmazon Brand Analytics (ABA) is a handy Amazon Seller Central and Amazon\nVendor Central tool for sellers wanting marketplace insights to improve their\nproduct’s success.\n\nBrand Analytics isn’t just for people who _love_ numbers and line graphs; it\nis for anyone who is struggling to make the desired impact on their\nmarketplace. Amazon has always tried to bump up the underdogs and give them a\nshot at success, and with this tool, they have done just that.\n\nThe Brand Analytics tool covers in fine detail how a seller’s product is\nperforming on Amazon through search terms, search frequency rank, conversion\nrates, and much more.\n\n## The top 5 Brand Aalytics to keep an eye on\n\nAmazon is vast, and with this comes _lots_ of data. Amazon’s Brand Analytics\ntool does all the hard work and collects metrics from searches, purchases, and\nproduct views to include in its reports, all the while protecting customer\nprivacy.\n\nFor those beginning their journey with Amazon’s Brand Analytics software, it’s\nhard to make sense of all the numbers and jargon. Fortunately, they have\nfocused on the five most important areas of Brand Analytics to keep an eye on.\n\n### 1\\. Amazon search terms\n\nWhen users look for a product, they type in search terms, also known as\nkeywords. Amazon’s Brand Analytics search terms report compiles these\nkeywords, displaying the best ones to use going forward.\n\nYou’ll want to pay attention to these terms as they give you the knowledge\nneeded for incorporating more of them into product titles, descriptions, and\ndetail pages.\n\nIn the search terms report, you will see details of the following: ****\n\n  * **Search terms:** The keywords users type into Amazon’s search bar when looking for a product. \n  * **Search frequency:** Compares the strength of each keyword by showing how different products rank at any given time. \n  * **Click share** **:** The percentage of how often your (or a competitor’s) product is clicked on after searching a particular term. \n  * **Conversion share** **:** The number of users who completed a purchase after using search terms to find it.\n\nAmazon’s Brand Analytics software also shows the top three product ASINs\n(Amazon Standard Identification Number) that are clicked on most depending on\nthe term used to find them.\n\nSource\n\nThe keyword search report is incredibly valuable for seeing what possible\nsearch terms you’re missing out on. By applying what you now know, you can\nbump up your product listings and enjoy higher conversion rates.\n\nLeaving keywords up to guesswork or trial and error may sound like a good\nidea, but in the competitive land of online marketplaces, risking the success\nof your product should not be taken lightly.\n\nAfter all, why waste time at the bottom when you deserve to be at the top?\n\n### 1\\. Repeat purchase behavior\n\nThis report will tell you everything about products with a high chance of\nbeing purchased repeatedly. It also shows if they were bought by unique\ncustomers or repeat ones, with an overview of the total number of orders to\ngive you the bigger picture.\n\nRetaining customers is one of the many battles companies face due to\ncompetition swooping in and taking them away. However, if you maintain high\nrates of repeat purchases, customers will only have eyes for you.\n\nSource\n\nGetting your hands on this report will do wonders for knowing which products\nto promote and which ones to you’re throwing money down the drain for.\nHowever, remember that the repeat purchase behavior report data is limited in\nshowing individual customer details. It only displays what products have been\npurchased more than once.\n\nThere are many benefits to knowing which of your products are most successful,\nsuch as: ****\n\n  * **Knowing what products to keep well-stocked**\n  * **Finding a** **target audience** ** **\n  * **Where to focus** **marketing strategies**\n\n### 3\\. Market basket analysis\n\nAmazon’s market basket analysis shows the top three products bought along with\nyours in the same basket. It shows each product’s ASIN, title, and purchase\ncombinations. This report is especially useful for increasing revenue.\n\nHow so? You can see missed opportunities by seeing what other items are in a\ncustomer’s basket at checkout. For example, if you sell pencils but no\nerasers, it’s only natural for customers to buy the missing part of the duo\nelsewhere. Giving competitors this kind of power is doing you no favors.\n\nSo, by bundling the pencil and eraser together, suddenly, they have everything\nthey need in just one click, and you get to enjoy increased revenue and market\nshare.\n\n### 4\\. Item comparison and alternate purchase behavior\n\nThis Brand Analytics report shows the top three products that were compared to\nyours and how often you were tossed aside as a result. You’ll definitely want\nto see this, though, as it will give valuable insight into where your product\nis falling short.\n\nYou can use this information to develop new advertising strategies aimed at\ncompetitors, showcasing how your product is in fact better than theirs. This\nreport may also change business decisions as far back as production. Marketing\ncan only go so far, so in most instances, a product tweak here and there could\nbe the best way forward.\n\nThis report also helps with:\n\n  * Search Engine Optimization (SEO): Keywords in competitors’ product pages can be incorporated into your own to rank higher in search results. As your product gets more visibility, it will soon become the favored option.\n\n  * Pay-per-click (PPC): By knowing what makes Amazon shoppers choose a competitor over you, it is easier to focus on these points in targeted advertising.\n\n### 5\\. Demographics\n\nKnowing your audience is essential for accommodating their needs and\npreferences. With Amazon’s demographics report, you will see your customers’:\n\n  * Gender\n\n  * Age\n\n  * Education\n\n  * Marital status\n\n  * Household income\n\nMetrics such as the total product sales, the percentage of unique buyers, and\ntotal orders placed are all laid out for you in this report. All that’s left\nfor you to do is harness it and cater to the target audience.\n\nSource\n\nIs there an age group you hoped to attract but have proven unsuccessful? Or\nmaybe there’s a surprising amount of married people buying your product aimed\nat bachelors? Whatever hitch you are experiencing, having insight into these\ndemographics helps navigate future marketing efforts.\n\n## Before you can use Amazon’s Brand Analytics\n\nUnfortunately, not just anyone can use Brand Analytics. You must become a\nmember of the Amazon brand registry. Not only is this a requirement, but it\nalso helps to protect and manage your brand’s intellectual property.\n\nTo make the cut for the registry, you must:\n\n  1. Be a brand owner or representative\n  2. Sell on Amazon\n  3. Have an active registered trademark\n\nOnce you have done that, the next step is to access the software and get\nstarted. To do this, open up the Amazon Seller Central account and head to the\nBrand Analytics tab in the top right. From there, the reports available to you\nwill show in a dropdown menu.\n\n## Why you should use Amazon’s Brand Analytics\n\nTo earn a spot on the front page using Brand Analytics is more of a necessity\nthan a choice. Here are just some of the many benefits that come with using\nthis software.\n\n### Understand customer behavior\n\nWith the item comparison and alternate purchase behavior report, valuable\ninformation is given on what products are beating yours when compared by\ncustomers. What is it they’re looking for that you can’t give? With Amazon’s\nBrand Analytics, it all becomes much clearer.\n\nCustomers are no longer just numbers on a screen, and by better understanding\nthem, marketing strategies and targeted advertising can be customized to give\nthem what they’ve been missing.\n\nIn fact, almost all strategic decisions concerning your product’s performance\non Amazon’s marketplace will (and should) be influenced by customer behavior.\nThis not only makes your product more successful but also instills confidence\nand trust in your target audience.\n\nUnderstanding what customers want goes a long way, and when done sooner rather\nthan later, it can take you right to the top.\n\n### Gain competitive insights\n\nIt’s vital to know what you’re up against regarding competitors. This is the\nonly way to be inspired by their strengths and leveraged by their weaknesses.\nThey say comparison is the thief of joy, but a failing e-commerce business is\narguably more so in this instance.\n\nWith the brand analytics tool, aspects include search terms they are using,\nwhat products they have alongside yours in customer baskets, and instances\nwhere they were favored over you or vice versa.\n\nHaving this information on hand allows you to identify competitors in the\nfirst place and how to differentiate yourself from them. Take a hard look and\nsee what you can offer that they can’t, and use it as a strength in future\nmarketing strategies.\n\n### Discover search terms and keywords\n\nThe Brand Analytics tool shows specific search terms and keywords that users\nhave typed into the search bar when looking for products.\n\nWith the Amazon search terms report, you can see what language is used to\ndescribe what they’re looking for, giving a human perspective on the Amazon\nstore typically dominated by numbers.\n\nWith this collection of search terms at your fingertips, it’s now easier than\never to incorporate ones you hadn’t thought of before. Product titles and\ndescriptions are the perfect places to incorporate SEO with _relevant,_\ndescriptive search terms to boost your product’s search results.\n\n### Gauge popular products\n\nBy analyzing the reports from Amazon’s Brand Analytics, you can paint a\npicture of what products dominate your market. How often are they chosen over\nothers, and what particular terms are used to find them? These are just some\nof the questions that are answered with brand analytics.\n\nWhen it comes to your inventory, knowing what items are bestsellers helps a\nlot with managing stock. Focusing resources on keeping a specific product in\nstock is less risky when you trust you’ll get a return on investment (ROI).\n\nDue to things moving so fast in the digital world, if your item is out of\nstock even for a moment, it’s too easy for a once loyal customer to purchase a\nsimilar product from a competitor instead.\n\nTo rub salt in the wound, not only does an out-of-stock sign disappoint\npeople, but it also makes your brand look unprepared and disorganized.\n\n### Better product positioning\n\nThe position of a product is essentially the proof that your product has a\nrightful place in the market and is offering something that competitors\naren’t. The main focus should be highlighting unique selling points (USPs) to\nmake it stand out and convince users they cannot be freed from their troubles\nelsewhere.\n\nEstablishing a gap in the market and using it as an advantage for selling a\nproduct sounds pretty straightforward – and it is as long as you know what\nyou’re doing. All you need is Brand Analytics, and you will have the knowledge\nrequired to find common pain points in your target audience and how you can\nfix them more efficiently than competitors.\n\nWith a comfy spot in the market, it won’t take long for your product to be the\nnext one to beat. To keep hold of this position, we suggest you keep tracking\nbrand analytics and market trends.  \n\n### It’s free and easy to use\n\nFinally, what more convincing do you need other than Amazon’s Brand Analytics\nbeing completely free to use? It’s quite rare for software as useful as this\nnot to require a subscription. Instead, it asks that you become a member of\nthe brand registry program (also free).\n\nIn addition to this, you don’t need to be a computer whizz to figure out how\nit all works. Just a few simple clicks here and there, and reports will pop up\nin an easy-to-read format.\n\n## What else can Brand Analytics tell you?\n\nWe’ve covered the five reports that Amazon provides, but what other nuggets of\nwisdom can you get stuck into? By accessing Amazon’s Search Analytics\nDashboard in your Seller Central account, there are metrics detailing product\nperformance.\n\nTwo primary dashboards, namely Search Query Performance and Search Catalog\nPerformance, have been kindly provided by Amazon. We will break these down to\ndetail how you can benefit from them.\n\n## Search query performance\n\nThis dashboard monitors and analyzes Amazon’s search queries and what this\nmeans for your sales funnel. Here are examples of what you can find out\nthrough this dashboard.\n\n### Search impressions\n\nThis is a bit different from the search term report as it covers more than\nwhat keywords were used. Search impressions are how often your product popped\nup in a day, week, month, or any period of time. It will also display what\nterms were used for each search.\n\nAs you can imagine, if you have low search impressions, there’s something that\nneeds fixing, whether it be product positioning or SEO. This tool is found on\nthe Brand Analytics dashboard and lets you see where clicks can lead to\nconversions.\n\nSource\n\n### Click rates\n\nJust because a product is doing great in the search impressions area, it\ndoesn’t necessarily mean they are getting clicks. Amazon has a way of\ndisplaying products where the product image, price, and average review can be\nseen without having to click on them.\n\nTherefore, if you are getting high impressions but low clicks, there’s clearly\nsomething putting people off before the product is given the time of day.\nRightfully so, with so much choice, why would we settle?\n\nFixing whatever it is that’s making people scroll past is a huge benefit in\nletting your product page do the rest of the talking. If you’ve nailed the\nmarketing, then high search impressions along with high click rates are a\ncombination for success.\n\n### Conversions\n\nWhen a user buys your product, it is referred to as a conversion as they are\n‘converted’ from traffic into a buyer. With the Search Query Performance\ndashboard, you get a front-row seat to how particular search terms are used\nbefore a successful conversion.\n\nThis lets you see what terms are most valuable and may be missing from your\nproduct titles or descriptions. Over time, the performance of these keywords\ntends to fluctuate due to trends, seasons, and other external events.\nMonitoring these highs and lows can make the most of customer behavior instead\nof being blindsided by it.\n\n## Search catalog performance\n\nNow that we have focused on the customers, it’s time to turn our attention to\nproducts. With the Search Catalog Performance Dashboard, sellers can break\ndown the sales funnel of each product to see where Amazon shoppers are\ndropping off.\n\nFixing issues in the sales funnel could be as small as changing the tone of\nvoice in product descriptions or fixing internal links. Whatever it may be,\nthe buying experience must be as streamlined as possible. Any doubts,\nhesitations, or technical inconveniences are enough to make a product’s\nconversions plummet.\n\n## Using Brand Analytics to drive success\n\nAmazon’s Brand Analytics tool is undoubtedly the best way to see where you’re\nfalling short in the eyes of Amazon customers. It sounds like a lot of data to\ndigest, but Amazon breaks it down into five reports deemed most important.\n\nBrand Analytics’ power rests in understanding customer behavior, offering a\nclear advantage on what products resonate with consumers and why.\nUnderstanding the language they used to search, gauging their repeat purchase\nbehavior, and peeking inside their baskets are vital for future decisions.\n\nThis is only a fraction of what this software can tell you. Amazon is a very\nbusy, competitive place, and without using Brand Analytics, keeping up is\nharder than it needs to be.\n\n  * Branding & Design\n  * Brand analytics\n  * Branding\n\nWritten by Paul David Perry\n\nPrior to launching Literal Humans, Paul worked as a freelance writer and\ncontent strategist for a number of different tech brands, including\nContentstack and Submittable. He's also helped take a previous agency from\n$500K to $1.5 million ARR through high-quality content strategy and resilient\ninternal agency systems.\n\nFollow me:\n\nLinkedIn\n\nShare the love:\n\n  * __\n  * __\n  * __\n  * __\n\n## Keep Reading\n\n###  Why Rebrand? 8 Reasons to Give Your Brand a Makeover\n\nBranding & Design\n\n6 min read\n\n###  Logo Rebranding 101: How to Know When It’s Time for a New Logo\n\nBranding & Design\n\n5 min read\n\n###  Is the Minimalist Branding Trend Right for Your Company?\n\nBranding & Design\n\n5 min read\n\n## Subscribe to our newsletter for more branding wisdom.\n\nSign me up!\n\n## Services\n\n  * Content Marketing & SEO\n  * Creative & Branding\n  * Social Media & Email Marketing\n  * Website Development\n  * LinkedIn Lead Generation\n  * VC Content Strategy\n\n## Resources\n\n  * Case Studies\n  * Blog\n  * Subscribe to Our Newsletter\n  * Listen to Our Podcast “Tech Can’t Save Us”\n\nSchedule strategy session\n\n  * Contact Us\n  * About Literal Humans\n  * Privacy Policy\n  * Terms & Conditions\n\n  * \n\n© Copyright Literal Humans 2024\n\nWe use cookies to improve your experience on our site. By using our site, you\nagree to our use of cookies. Read more here.\n\nAcceptReject\n\nManage consent\n\nClose\n\n#### Privacy Overview\n\nThis website uses cookies to improve your experience while you navigate\nthrough the website. Out of these, the cookies that are categorized as\nnecessary are stored on your browser as they are essential for the working of\nbasic functionalities of the ...\n\nNecessary\n\nNecessary\n\nAlways Enabled\n\nNecessary cookies are absolutely essential for the website to function\nproperly. These cookies ensure basic functionalities and security features of\nthe website, anonymously.\n\nCookie| Duration| Description  \n---|---|---  \ncookielawinfo-checbox-analytics| 11 months| This cookie is set by GDPR Cookie\nConsent plugin. The cookie is used to store the user consent for the cookies\nin the category \"Analytics\".  \ncookielawinfo-checbox-functional| 11 months| The cookie is set by GDPR cookie\nconsent to record the user consent for the cookies in the category\n\"Functional\".  \ncookielawinfo-checbox-others| 11 months| This cookie is set by GDPR Cookie\nConsent plugin. The cookie is used to store the user consent for the cookies\nin the category \"Other.  \ncookielawinfo-checkbox-necessary| 11 months| This cookie is set by GDPR Cookie\nConsent plugin. The cookies is used to store the user consent for the cookies\nin the category \"Necessary\".  \ncookielawinfo-checkbox-performance| 11 months| This cookie is set by GDPR\nCookie Consent plugin. The cookie is used to store the user consent for the\ncookies in the category \"Performance\".  \nviewed_cookie_policy| 11 months| The cookie is set by the GDPR Cookie Consent\nplugin and is used to store whether or not user has consented to the use of\ncookies. It does not store any personal data.  \n  \nFunctional\n\nFunctional\n\nFunctional cookies help to perform certain functionalities like sharing the\ncontent of the website on social media platforms, collect feedbacks, and other\nthird-party features.\n\nPerformance\n\nPerformance\n\nPerformance cookies are used to understand and analyze the key performance\nindexes of the website which helps in delivering a better user experience for\nthe visitors.\n\nAnalytics\n\nAnalytics\n\nAnalytical cookies are used to understand how visitors interact with the\nwebsite. These cookies help provide information on metrics the number of\nvisitors, bounce rate, traffic source, etc.\n\nAdvertisement\n\nAdvertisement\n\nAdvertisement cookies are used to provide visitors with relevant ads and\nmarketing campaigns. These cookies track visitors across websites and collect\ninformation to provide customized ads.\n\nOthers\n\nOthers\n\nOther uncategorized cookies are those that are being analyzed and have not\nbeen classified into a category as yet.\n\nSAVE & ACCEPT\n\nPowered by\n\n",
    "links": "[]"
}