{
    "summary": "Our Software\n\nAbout Us\n\nservices\n\n    * ## Our Services\n\n      * Amazon PPC Management\n      * Amazon DSP Ad Services\n      * Amazon Product Ranking\n      * Amazon PPC Audit\n      * Our Software\n\n    * Guides\n\n#### Checklist: How to Get Ready for Amazon Prime Day in 2022\n\nRead checklist\n\nBlog\n\n    * ## Blog\n\n      * Articles\n      * Guides\n      * Case studies\n      * Webinars\n\n    * Webinars\n\n#### Amazon pricing strategy webinar\n\nWatch on DEMAND\n\nContact Us\n\n  * About Us\n  * Amazon PPC Management\n  * Amazon DSP Ad Services\n  * Amazon Product Ranking\n  * Amazon PPC Audit\n  * Our Services\n    * Amazon PPC Management\n    * Amazon DSP Ad Services\n    * Amazon Product Ranking\n    * Amazon PPC Audit\n  * Articles\n  * Guides\n  * Case studies\n  * Webinars\n  * Blog\n    * Articles\n    * Guides\n    * Case studies\n    * Webinars\n\nContact Us\n\n# How to Use Amazon Brand Analytics: Step-by-Step Guide\n\n#### **Ihor Dubovetskyi** on Feb 17, 2022 in Step by Step Guides\n\n\n\n\n\nAmazon is known for its smart algorithms and its almost unparalleled knowledge\nabout what the consumer wants. So it makes sense that Amazon is appealing to\nbrands who need a boost in sales, or those just looking for information about\nthe consumer. In this article, we take a look at Amazon’s treasured Brand\nAnalytics Tool and its major features.\n\nWant to apply it to your business? Read on and find out how exactly you can do\nit.\n\n\n\n**Table of content:**\n\n  * #### Amazon Brand Analytics Definition\n\n  * #### Why Amazon Brand Analytics is Vital\n\n  * #### Who Can Use Amazon Brand Analytics\n\n  * #### Amazon Brand Analytics Access\n\n  * #### Amazon Brand Analytics Reports\n\n    * #### Amazon Search Term Report\n\n    * #### Repeat Purchase Behavior Report\n\n    * #### Market Basket Analysis Report\n\n    * #### Item Comparison Report\n\n    * #### Alternate Purchase Report\n\n    * #### Demographics Report\n\n  * #### Using Brand Dashboard in Amazon Brand Analytics\n\n  * #### Using Amazon Brand Analytics for Your Business\n\n  * #### Metrics to Monitor in Amazon Brand Analytics\n\n    * #### Each ASIN’s Click Share\n\n    * #### Percentage of Consumers Who Buy Competitors’ Products\n\n    * #### Repeat Sales’ Value\n\n    * #### Number of Pending Ads in Your Account\n\n    * #### Click-Through Rate\n\n  * #### Final Word\n\n\n\n## **What is Brand Analytics Tool on Amazon**\n\nAmazon Brand Analytics is Amazon’s marketplace insights software. It is a web-\nenabled, cloud software solution that captures the data and insights about\nyour brand to better understand your customer shopping journey. The tool\nallows sellers to leverage data on consumer purchasing behavior and thus make\nmore efficient strategic decisions and contrast effectively with competitors.\n\nThe Amazon Brand Analytics tool is a unique and valuable resource for\nbusinesses to leverage. The tool provides rich data from the millions of\nproducts in its database. Additionally, the tool collects product sales data\nand insights from other Amazon data sets to help businesses better understand\nthe needs and preferences of their target customers.\n\n\n\n## **Why Amazon Brand Analytics is Vital**\n\nAmazon is continually working hard to make it easier for small businesses and\nentrepreneurs to sell on the marketplace. That is exactly the goal of the\nsolution we’re discussing in this article. At its core, Amazon Brand Analytics\nis designed to help correctly answer a question that’s common to every\nmarketer: how do my products rank on Amazon?\n\nThe Amazon Brand Analytics Tool enables you to aggregate and track important\ndata related to your brand: your ranks in sales, your largest sales channels,\nand your fastest-growing products. It helps you find the best keywords for\nyour brand and products. It analyzes the user’s online behavior and cross-\nreferences it with the data from your competitor’s sales data.\n\nBrand analytics is the measurement of the actual and perceived value a brand\nhas within its chosen target market. In fact, brand analytics can play a part\nin both the set-up and the ongoing management of brands, including\ninvestments, business development, and a multitude of other decisions along\nthe way.  \n\n### Profit Whales Case Study\n\nSee the results to get why Brand Analytics serves as a reliable source of\ninformation for Amazon sellers\n\n\n\n\n\n\n\n\n\nView Case Study\n\n  \n\n\n## **Who Can Use Amazon Brand Analytics**\n\nThose willing to use Amazon Brand Analytics must meet the following criteria:\n\n  * be brand-registered (Amazon Brand Registry member)\n  * hold responsibility for selling products on Amazon\n  * have a brand-registered active trademark.\n\nThere are a lot of scammers on the market who steal logos and provide fake\nproducts to consumers – they copy and sell your product as if it’s genuine. It\ncan harm your business a lot. That’s why you need to be a member of the Amazon\nBrand Registry program  – it protects you from that.\n\n\n\n## **Amazon Brand Analytics Access  **\n\nYou can begin using Amazon Brand Analytics by following these easy steps:\n\n  1. Head to your **Amazon Seller Central** account.\n  2. Click **Reports** in the main navigation menu.\n  3. Pick **Brand Analytics** from the dropdown menu.\n  4. Tap on Brand Analytics and you’re ready to go!\n\n\n\n## **Amazon Brand Analytics Reports**\n\nAmazon Brand Analytics is a powerful reporting tool that allows you to\nunderstand your brand’s performance and goals. Amazon measures and calculates\nkey metrics of your brand’s performance, such as the quality of reviews for\nyour products and the revenue of your brand.\n\n\n\n### **Amazon Search Term Report**\n\nWhat shoppers enter in the search field when looking for products can affect\nhow you advertise and position copies of related products. According to\nStatista, as of January 2020, 40 percent of all US web searches contained two\nkeywords.\n\n\n\nThe Amazon Search Term Report features invaluable insights into the trends and\nbehaviors of consumers in searches over the short and long term. The report\nprovides much-needed context and something to refer to when looking at trends\nwithin your own verticals.\n\nThe report covers data on:\n\n  * most widely-used search terms for a certain period of time\n  * search frequency rating for each term\n  * the first 3 items shoppers clicked on the search result page\n  * each click on a product and the percentage of conversions.\n\n\n\nYou can use the report in two ways: you can either take one specific search\nterm and investigate which items users interacted with on the search results,\nor you can analyze a product and related search terms shoppers used to find\nit.\n\n\n\n### **Repeat Purchase Behavior Report**\n\nWhen a shopper buys a good quality product, it’s likely that they will make a\nrepeat order of the same product. Amazon Repeat Purchase Behavior Report is a\ntool that can help sellers to better understand customer purchasing behaviors\nand thus work on maintaining their loyalty.\n\nThis report details the total number of orders received for each product or\nbrand. It also provides the total number of consumers who have ordered from\nthe given brand or were exposed to the given product, and how many customers\nare unique.\n\nThe report covers data on:\n\n  * ASIN\n  * The product’s name\n  * Orders\n  * Unique Clients\n  * Income from repeat buys.\n\nUsing this info you can determine products that might be ordered again in the\nfuture and then you can focus your efforts on promoting these products.\n\n\n\n### **Market Basket Analysis Report**\n\nThe Market Basket Report allows you to compare products on Amazon based on\npurchases. The report will show the top three products that shoppers bought\nmost often simultaneously purchasing your products. Products that have been\npurchased with a significant portion of your own products may be considered\nadd-ons, allowing them to be used for cross-marketing or bundling.\n\nThis report is a crucial tool for learning shoppers purchasing decisions and\nsetting ad campaigns accordingly. The report covers data on:\n\n  * ASIN\n  * Product title\n  * #1 Purchased ASIN\n  * #1 Purchased Title\n  * #1 Combination\n  * #2 Purchased ASIN\n  * #2 Purchased Title\n  * #2 Combination\n  * #3 Purchased ASIN\n  * #3 Purchased Title\n  * #3 Combination\n\nThis data can assist you in the process of creating Sponsored Product Ad\nCampaigns. And, if your products are bought together through PPC campaigns,\nthey may appear in the “Customers who bought this item also bought” section.\n\n\n\n### **Item Comparison Report**\n\nThe report displays the five products that had the most views within 24 hours.\nThe data can be used by sellers to leverage competitor information and make\nmore informed advertising and product decisions. The report covers data on:\n\n  * Compared ASIN: the ASIN your product was compared to.\n  * Compared percentage: the frequency of viewing the product on the same day as your own.\n  * Alternate purchase behavior: what products shoppers acquired from your competitors after seeing your product.\n  * Purchased percentage: the percentage of orders with the ASIN compared to the total number of orders using alternative products.\n\n\n\n### **Alternate Purchase Report**\n\nThis report provides info on the five products that shoppers bought most often\nwhile neglecting your offering. It also gives an indication of the percentage\nof time period each product has been used as an alternative product of choice.\n\nSince it is similar to the comparison report, it utilizes metrics we listed\nabove, plus allows for filtering the report by choosing one of the following\nfeatures:\n\n  * ASIN\n  * Brand\n  * Category\n  * Subcategory\n  * Search term \n\nYou receive specific data on your product’s ranking comparison (to the top\ncompared products). This provides useful data on the ASINs shoppers viewed and\nthe prices of competing products.\n\n\n\n### **Demographics Report**\n\nThe Amazon demographics report is an analysis of data pulled from Amazon to\ngive a deep dive into your target audience. With the help of the data provided\nby the report, you can optimize your ads off-Amazon or improve product pages\nto match your target audience.\n\nSpecifically, this report highlights key metrics such as:\n\n  * Amazon’s core demographic characteristics\n  * Ordered unit sales\n  * Unique customers: the number of buyers of a specific product\n  * Unique customers: unique buyers as a percentage of all buyers\n  * Ordered unit: sales as a percentage of all sales\n\n\n\nYou can also find info in the report taking into account factors such as age,\nfamily income, gender, marital status, and education. You can filter report\ndata according to any of these metrics.\n\n\n\n## **Using Brand Dashboard in Amazon Brand Analytics**\n\nIn addition to the reports within Amazon Brand Analytics, Brand Dashboard can\nalso be used to gain valuable insights regarding products that:\n\n  * received under five reviews;\n  * have no detailed page attributes;\n  * need better content;\n  * are not included in the Sponsored Product Ads campaign;\n  * gained three or fewer stars in the reviews;\n  * with little-used search terms;\n  * etc.\n\nYou can access Brand Analytics Dashboard by logging into your **Amazon Seller\nCentral** account, clicking **Performance** in the main navigation, tapping on\n**Brand Dashboard** in the dropdown menu.\n\n\n\n## **Using Amazon Brand Analytics for Your Business**\n\nYour Amazon Seller account is a key to audience and sales data. Amazon Brand\nAnalytics is ready-to-use for your business, it is only left for you to learn\nhow to utilize its information to your own advantage. When you’re ready, you\ncan start tracking your inventory, pricing decisions, and promotional\nactivity. Use Amazon Brand Analytics in order to:\n\n  * check reports regularly to withdraw key insights;\n  * utilize reports’ data to improve listings by finding the most relevant keywords;\n  * update and thus enhance your Amazon ad campaigns;\n  * analyze purchasing behavior of your consumers;\n  * upgrade your SEO and PPC tactics to boost sales;\n  * generate more value from your advertising efforts as a whole.\n\n\n\n## **Metrics to Monitor in Amazon Brand Analytics**\n\nYou can check the performance of your brand across Amazon with these top five\nAmazon metrics.\n\n\n\n### **Each ASIN’s Click Share**\n\nAmazon’s Search Term report is truly helpful in determining which keyword\nperforms well and which doesn’t. It’s easy to see the most viewed, purchased,\nand searched-for items for each of the distinct terms you enter. This way\nyou’ll be able to gain useful knowledge of your competing products. Also,\nyou’ll have a chance to review data on your most popular product and any\nimpressions related to it.\n\n\n\n### **Percentage of Consumers Who Buy Competitors’ Products**\n\nIn the Alternate Purchase report, you can see the percentage of consumers that\nviewed your product and then decided to purchase the same or another option\nfrom your competitors. The ability to determine what brands pose the biggest\nthreat is a helpful strategy for marketing.\n\nYou can also use the report for your listing optimization. This way you can\nincrease your store’s ranking and traffic.\n\n\n\n### **Repeat Sales’ Value**\n\nThe value of a performance assessment and evaluation of your product is\ncrucial for any company in the business. With the help of the Repeat Purchase\nBehavior report, you can get a lot of useful data. You can check the number of\norders coming from repeating shoppers. Though more importantly, you can see\nexactly how much revenue you generated from these repeating purchases.\n\nIf your business can manage to grow this figure every week or month, you will\nhave the opportunity to propel your company in the best and most profitable\ndirection.\n\n\n\n### **Number of Pending Ads in Your Account**\n\nIn the Amazon Brand Analytics dashboard, you can find data on your product\nlistings and find ways to improve them. For instance, you can discover which\nlistings might need A+ Content, PPC ads, or more reviews. In short, you’ll\ndiscover major weaknesses of your listings, including poorly-developed5 detail\npages and missing search terms.\n\nIt is important for brands with a lot of products or inventory to be able to\nkeep track of the numbers on their dashboard.\n\n\n\n### **Click-Through Rate**\n\nAmazon ad attribution can be employed to keep track of search ads, social ads,\ndisplay ads, and email promotions outside Amazon. You’ll be able to access a\nlot of helpful metrics (impressions, click-through rate, conversion, etc.)\nonce you set up all the tracking tags. By figuring out your click-through\nrate, you’ll be able to measure the performance of your channel including the\nresults of your individual campaigns.\n\nBrands that mostly rely on Amazon’s merchandising platform, can greatly\nbenefit from using these performance metrics to properly adjust their ad\nstrategies.\n\n﻿﻿\n\n\n\n## **Final Word**\n\nHow do you set marketing budgets and decide which marketing channels are best\nfor your business? It can be challenging to compare the performance of\ndifferent marketing channels, especially when the data is siloed in different\nreporting tools without any way to visualize it.\n\nAmazon Brand Analytics is a program that allows you to analyze your brand in\ngreat depth. It’s a powerful tool for gaining insight into customer buying\nbehavior.\n\n### Comments\n\n### Leave a Reply\n\n### Leave a Reply Cancel reply\n\nYour email address will not be published. Required fields are marked *\n\nComment *\n\nName *\n\nEmail *\n\nWebsite\n\nRate this article\n\n#### Read next\n\n  * Mastering Amazon PPC Budgeting: Strategies for Maximizing ROI Feb 05, 2024\n\n  * What Is Brand Positioning On and Off Amazon? Dec 28, 2022\n\n  * How to Sell Seasonal Products on Amazon and Get Profit\n\nShare this article\n\nSign up for our newsletter\n\nSubscribe __\n\n#### About Us\n\nProfit Whales is a full-service Amazon marketing company for e-commerce\nbrands, that scales them on Amazon and beyond via a cross-channel approach.\n\n#### Our Services\n\n  * Amazon PPC Management\n  * Amazon DSP Ad Services\n  * Amazon Product Ranking\n  * Amazon PPC Audit\n  * Our Software\n\n#### Blog\n\n  * Articles\n  * Guides\n  * Case studies\n  * Webinars\n\n#### Contact Us\n\nofficial@profitwhales.com\n\n2846 Otero Court Carlsbad, 92010\n\n+18143519477\n\n  * LinkedIn\n  * Facebook\n  * Instagram\n  * YouTube\n\nProfit Whales © 2024 All Right Reserved\n\n  * Terms and Conditions\n  * Terms and Conditions\n  * Privacy Policy\n  * Privacy Policy\n  * Cookie Policy\n  * Cookie Policy\n\n  *   * \n\nWe use cookies to ensure that we give you the best experience on our website.\nIf you continue to use this site we will assume that you are happy with\nit.OkPrivacy policy\n\n",
    "links": "[{\"link\": \"https://profitwhales.com/\", \"text\": \"\"}, {\"link\": \"https://profitwhales.com/\", \"text\": \"\"}, {\"link\": \"https://profitwhales.com/archives/articles/how-use-amazon-brand-analytics#respond\", \"text\": \"Cancel reply\"}]"
}