{
    "summary": "New sellers can get $50 credit toward Sponsored Products ads—and other\nbenefits.Learn more\n\nEnglishLog in\n\n  * Back\n  *   * Start\n    * Back\n    *     * Start\n    * How to sell on Amazon\n    * Sell products online\n    * Build an online store\n    * Launch your brand\n    * Amazon selling programs\n  * Grow\n    * Back\n    *     * Grow\n    * Fulfillment by Amazon\n    * International ecommerce\n    * Advertise your products\n    * Apps, services, and tools\n    * Case studies\n  * Learn\n    * Back\n    *     * Learn\n    * Seller University\n    * Ecommerce business guide\n    * Inventory management\n    * Ecommerce Fulfillment\n    * What is ecommerce?\n    * What is dropshipping?\n    * How to sell books\n  * Pricing\n    * Back\n    *     * Pricing\n    * Standard selling fees\n    * Compare selling plans\n    * Product category fees\n    * Revenue Calculator\n  * Blog\n    * Back\n    *     * Blog\n    * Selling Partner Blog\n    * Announcements\n    * Getting started\n    * Grow your business\n    * Seller stories\n\nSign up\n\n✕\n\n### Select your preferred language\n\n  * English - US\n  * Español - US\n  * 中文 - CN\n\nGrow your business\n\n# Amazon Brand Analytics: Get data to grow your business\n\nNov 2, 2022\n\n7 Min read\n\nDaisy Quaker\n\n  * Copy\n\nLink copied\n\n  * Twitter\n  * Print\n  * LinkedIn\n\n  * Copy\n\nLink copied\n\n  * Twitter\n  * Print\n  * LinkedIn\n\n## Amazon Brand Analytics helps you make strategic decisions about your\nproducts and advertising by giving you access to aggregated customer and brand\nperformance data.\n\nImagine having a crystal ball that could answer questions like:  \n\n  * Am I using the best keywords to connect with customers?\n  * How often are customers buying my products?\n  * What other products do customers buy when they buy from my brand?\n\nAmazon Brand Analytics isn’t a crystal ball, but it can help you find answers\nto these questions and more. In this post, we’ll explain how it works.\n\nDid you know?\n\nYou can grow your business with Amazon Brand Registry\n\nIn 2022, brand owners’ sales grew **more than 20%** in the Amazon store\ncompared to the previous year.\n\nEnroll in Brand Registry\n\n## What is Amazon Brand Analytics?\n\nAmazon Brand Analytics is available to brands enrolled in Amazon Brand\nRegistry. Brand Analytics helps businesses better understand their customers\nand brand performance through aggregated customer search and purchase data. It\ncontains multiple dashboards that brands can use to make strategic decisions\nto optimize their products and advertising:\n\n  * Search Catalog Performance\n  * Search Query Performance\n  * Top Search Terms\n  * Repeat Purchase Behavior\n  * Demographics\n  * Market Basket Analysis\n  * Customer Loyalty Analytics\n\nYou can use these Brand Analytics dashboards to analyze sales metrics and gain\ninsights into keywords, search impressions, purchases, and more. Let’s dive\ninto the details.\n\n> Cardinal & Crest started on Amazon about a year ago. It’s probably the first\n> time in the history of the world that somebody can go from idea to product\n> creation to putting it in front of millions of customers just like that.\n\nKyle Schmidt, Cardinal & Crest\n\nHow Kyle Schmidt’s Cardinal & Crest grew in the Amazon store\n\n## How to access Amazon Brand Analytics\n\nTo access Brand Analytics, sign up for an Amazon selling account and choose a\nProfessional selling plan, if you don’t already have one. Then enroll your\nbrand in Amazon Brand Registry using an active, registered trademark. In some\ncases, you can also use a pending trademark application or registration to\nenroll.\n\nIf you don’t have an active or pending trademark, or want to speed up the\nprocess of getting one, check out the IP Accelerator program.\n\nOnce enrolled in Brand Registry, hover over **Brands** in the Seller Central\nmain menu, then click **Brand Analytics** to access the tool.\n\nIntro to Brand Analytics\n\nWatch\n\nIntro to Brand Analytics\n\nFind out how Brand Analytics dashboards help brands enrolled in Amazon Brand\nRegistry better understand their customers, products, and overall performance\nin the Amazon store.\n\n## 7 ways to grow your business with Amazon Brand Analytics\n\n### **1\\. Get key metrics with the Search Catalog Performance dashboard**\n\nHow well are products performing in Amazon search? Are customers finding\nproducts, but dropping off before they hit the buy **** button? You can find\nout by selecting the **Search Catalog Performance** dashboard from the\n**Search Analytics** drop-down menu at the top of the Brand Analytics page.\n\nUsing the Search Catalog Performance dashboard, you’ll gain insights into how\nmany times your brand’s products appeared in Amazon search results\n(impressions) for a selected time frame. You’ll also see clicks and click\nrates, median prices, cart adds, purchases, and conversion rates.\n\nWith these key metrics, you can learn how customers engage with products\nthroughout their shopping journey.\n\nBrand Analytics: Search Catalog Performance dashboard\n\nWatch\n\nBrand Analytics: Search Catalog Performance dashboard\n\nFind out how the Brand Analytics Search Catalog Performance dashboard helps\nbrands enrolled in Amazon Brand Registry better understand how customers\ninteract with their products after searching the Amazon store.\n\nPro Tip\n\nOptimize each part of the sales funnel\n\nWith ecommerce, you can make improvements at each stage of the customer\njourney. Here are a few ideas:  \n\n  * **Top of the funnel** : Adjust keywords to help products rank in search results and earn more impressions.\n  * **Middle of the funnel:** Analyze clicks to tweak product descriptions for higher click-through rates.\n  * **Bottom of the funnel:** Set competitive prices to improve conversion rates and boost purchases.\n\nIt’s worth taking a look at your options for ecommerce automation that can\nhelp, such as Automate Pricing.\n\n### 2\\. **Understand how customers search for your brand’s products with the\nSearch Query Performance dashboard**\n\nWhat search terms are driving customers to your products? How is your brand\nperforming relative to other brands in the Amazon store? Find out using the\n**Search Query Performance** **** dashboard, which is under the **Search\nAnalytics** drop-down menu at the top of the Brand Analytics page. This\ndashboard lists the top queries that led customers to your products. It shows\ndata for impressions, clicks, cart adds, and other sales metrics for specific\nqueries and also provides a breakdown of your brand’s share of performance\ncompared to overall query performance in the Amazon store.\n\nUsing the Search Query Performance dashboard, you can find:  \n\n  * The number of search impressions for queries relevant to your brand\n  * The percentage of clicks for your brand’s catalog compared to the total count for all brands\n  * How same-day shipping might be contributing to sales\n\nYou can use a **Brand View** or **ASIN View** to dig into the data for\nspecific keywords, including search query score (which indicates how\nindividual keywords are performing) and search query volume (which tells you\nhow many times customers used a given keyword in Amazon search within a\ncertain time frame).\n\nThis info can shed light on how customers are finding your brand and searching\nfor products like the ones you sell. It can also give you ideas for keywords\nto include in content like product descriptions.\n\nBrand Analytics: Search Query Performance dashboard\n\nWatch\n\nBrand Analytics: Search Query Performance dashboard\n\nFind out how the Brand Analytics Search Query Performance dashboard helps\nbrands enrolled in Amazon Brand Registry better understand how customers\nsearch for their products in the Amazon store.\n\nPro Tip\n\nWeave target keywords into A+ Content\n\nIn the Amazon store, A+ Content is an advanced option for adding rich text,\nimagery, videos, and other features to product detail pages. This can help\ncustomers discover your brand, learn about product benefits, and make informed\npurchasing decisions.\n\nLearn more and start creating A+ Content for your brand\n\n### 3\\. Dig into keywords with the Top Search Terms dashboard\n\nInstead of guessing what keywords customers are using to find products, you\ncan see it firsthand through the **Top Search Terms** dashboard, which is\nlocated under the **Search Analytics** tab at the top of Brand Analytics page.\nThis dashboard shows:  \n\n  * Search frequency rank for top search terms\n  * Top-clicked brands\n  * Top-clicked categories\n\nYou can also see the product titles for the three top-clicked products for\neach search term, along with click shares and conversion shares. This data\nprovides visibility into the top search terms customers are using across the\nAmazon store. You can use the filters to search by ASIN, brand name, product\ncategory, or keyword.\n\nBrand Analytics: Top Search Terms dashboard\n\nWatch\n\nBrand Analytics: Top Search Terms dashboard\n\nFind out how the Brand Analytics Top Search Terms dashboard helps brands\nenrolled in Amazon Brand Registry better understand the keywords customers use\nto locate and purchase products across the Amazon store.\n\nPro Tip\n\nA/B test keywords to optimize product content\n\nConsider using keyword strategy to boost visibility of products. To take it to\nthe next level, you can run A/B tests to see which keywords get the most\nclicks.\n\nLearn more and give A/B testing a try\n\n### 4\\. **Encourage return buyers with the Repeat Purchase Behavior\ndashboard**\n\nRepeat purchases can offer valuable insight into customer engagement and\nsatisfaction. The **Repeat Purchase Behavior** **** dashboard is under the\n**Customer Behavior Analytics** drop-down menu on the Brand Analytics pages\nand shows how often unique customers place multiple orders of the same\nproduct. It displays:  \n\n  * Repeat ordered product sales and units\n  * Number of repeat customers\n  * The percentage of repeat buyers (out of all customers who place orders)\n\nYou can view this information using a **Brand View** or **ASIN View**.\n\nData-driven strategies can help you build a loyal customer base. By seeing\nwhich products customers buy repeatedly, you can get a leg up on deciding\nwhich products to focus on in your advertising.\n\nBrand Analytics: Repeat Purchase Behavior dashboard\n\nWatch\n\nBrand Analytics: Repeat Purchase Behavior dashboard\n\nFind out how the Brand Analytics Repeat Purchase Behavior dashboard helps\nbrands enrolled in Amazon Brand Registry better understand the products\ncustomers are purchasing more than once.\n\n### 5\\. Learn about your audience with the Demographics dashboard\n\nWho’s buying? How can you expand your reach? You can find out by exploring the\n**Demographics** dashboard, located under the **Customer Behavior Analytics**\ndrop-down menu on the Brand Analytics page. This dashboard is only available\nfor our US store, and ASINs need to have 100 or more unique customers in a\nselect time range in order to be displayed. For ASINs meeting this criteria,\nthe dashboard will display aggregate customer data for:  \n\n  * Age\n  * Income\n  * Education\n  * Gender\n  * Marital status\n\nWith this data, you can get insights into how your audience might be changing\nover time. Use filters to view data for a specific week, month, or quarter.\nData in Brand Analytics usually goes back three years and is generally\navailable within three days, with quarter-end data typically available within\none week.\n\nBrand Analytics: Demographics dashboard\n\nWatch\n\nBrand Analytics: Demographics dashboard\n\nFind out how the Brand Analytics Demographics dashboard helps brands enrolled\nin Amazon Brand Registry better understand the US customers purchasing their\nproducts.\n\nPro Tip\n\nTailor your marketing campaigns\n\nIs your brand attracting a certain demographic? Do you want to broaden your\nreach, or connect with other audiences?\n\nCheck out our guide to ecommerce markting for tips\n\n### 6\\. **Increase orders with the Market Basket Analysis dashboard**\n\nWhat products do customers purchase together the most? Located under the\n**Customer Behavior Analytics** drop-down menu on the Brand Analytics page,\nthe **Market Basket Analysis** **** dashboard can reveal the answer to this\nquestion based on patterns in aggregate purchasing data.\n\nThis dashboard displays the top three products customers most frequently\npurchase with the products you offer. Use the **Products displayed** drop-down\nmenu to filter so results include or exclude results from other brands. Use\nthis info to:  \n\n  * Make decisions about products you might want to add or remove from your inventory\n  * Create Virtual Bundles to increase average order size\n  * Identify cross-marketing opportunities to promote related products\n\nFor example, let’s say customers are buying baby bottles from your brand. They\nalso frequently purchase baby bottle brushes from other sellers. So, if you\nbundle together a bottle and brush set, you might increase order sizes.\n\nBrand Analytics: Market Basket Analysis dashboard\n\nWatch\n\nBrand Analytics: Market Basket Analysis dashboard\n\nFind out how the Brand Analytics Market Basket Analysis dashboard helps brands\nenrolled in Amazon Brand Registry better understand the products that\ncustomers are purchasing in combination with their products.\n\n### 7\\. Dive deep into audience trends with Customer Loyalty Analytics\n\nThe **Customer Loyalty Analytics** dashboard at the top of the Brand Analytics\npage offers insight into audience loyalty levels for your brand and how they\nmight be changing over time. It divides your audience into four segments:  \n\n  * **Top Tier** : customers who recently placed purchases, spend the most compared to the rest of your audience, or buy frequently from your brand\n  * **Promising** : customers who purchased recently, buy occasionally, and spend above average\n  * **At Risk** : customers who haven’t purchased recently or frequently, or have varied spend\n  * **Hibernating** : customers who haven’t purchased in a long time, or purchase infrequently\n\nFor instance, maybe within the last week, your brand attracted 80 new\ncustomers who placed 90 orders, resulting in $3,500 in sales. The Customer\nLoyalty Analytics dashboard can show you this, and also tell you that an\nadditional 45,000 people recently showed interest in your products, but have\nnot yet placed a purchase. In this case, the dashboard might provide\nrecommended ways for engaging these potential customers, such as with a promo\ncode.\n\nHere’s another example: under Repeat Customers, you might see that in the past\nweek, you had 43 repeat customers, down 18% from the week before. However, the\nrepeat purchase rate is 5% higher than it was last week. What’s going on? Do\nsome detective work and use this data as a starting point for discovering\naudience trends you might be able to capitalize on.\n\nBrand Analytics: Customer Loyalty Analytics dashboard\n\nWatch\n\nBrand Analytics: Customer Loyalty Analytics dashboard\n\nThis dynamic session shares new Brand Analytics capabilities on Seller\nCentral. You’ll learn how this tool can help you organize customers, analyze\npurchase patterns, and perform engagements to track and increase customer\nlifetime value.\n\n## Build your business with Amazon Brand Analytics\n\nWithout data, it can be tough to make sound decisions and improve sales.\nInstead of operating in the dark and basing your strategy on a guessing game,\nuse Brand Analytics to study customer behavior, grow your brand’s visibility,\nand boost revenue.\n\nIn addition to Brand Analytics, Amazon Brand Registry gives you access to\ntools and benefits that can help you establish yourself in ecommerce and\nscale. Learn more about building your brand.\n\nGet started with Brand Analytics\n\nDaisy Quaker\n\nDaisy Quaker is a Sr. Marketing Manager at Amazon who’s driven by helping\nentrepreneurs and brands discover opportunities to reach more customers\nthrough Amazon stores. She also enjoys the outdoors, art museums, and good\nfood.\n\nRelated articles\n\nBrand management: Guide to growing your brand on Amazon\n\nDec 19, 2023\n\n8 Min read\n\nBrand Referral Bonus: Drive traffic and boost your bottom line\n\nOct 20, 2023\n\n4 Min read\n\nAmazon selling stats\n\nOct 10, 2023\n\n2 Min read\n\nBack to top\n\nRead more\n\nHow a family-owned sauce and spice company grew its brand with Amazon’s Black\nBusiness Accelerator\n\nJan 10, 2024\n\n3 Min read\n\nSeller stories\n\nA productivity brand achieves six-figure sales and focuses on what matters\nmost with Amazon’s Black Business Accelerator\n\nJan 8, 2024\n\n4 Min read\n\nGetting started\n\nTop 10 training videos for new Amazon sellers\n\nDec 15, 2023\n\n2 Min read\n\nHome Blog Grow your business Amazon Brand Analytics: Get data to grow your\nbusiness\n\nEnglishUnited States\n\n✕\n\n### Explore selling on Amazon around the world\n\n  * Australia\n  * Belgium\n  * Brazil\n  * Canada\n  * China\n  * France\n  * Germany\n  * India\n  * Italy\n  * Japan\n  * Korea\n  * Mexico\n  * Netherlands\n  * Poland\n  * Saudi Arabia\n  * Singapore\n  * South Africa\n  * Spain\n  * Sweden\n  * Taiwan\n  * Thailand\n  * Turkey\n  * United Arab Emirates\n  * United Kingdom\n  * United States\n  * Vietnam\n\nAmazon operates stores worldwide, allowing you to grow your business\ninternationally regardless of where you’re located.\n\nFeedback\n\n  * Sell with Amazon\n    * Sell online\n    * How to sell on Amazon\n    * How much does it cost?\n    * Product ideas\n    * What is dropshipping\n    * Sell books online\n  * Selling Programs\n    * Fulfillment by Amazon\n    * Amazon Advertising\n    * Global selling\n    * Amazon Business\n    * Black Business Accelerator\n    * More programs\n  * Amazon for Brands\n    * Online store builder\n    * Amazon Brand Registry\n    * Brand management\n    * Product reviews\n    * Customer Behavior Analytics\n    * A+ Content\n  * Resources\n    * Selling Partner Blog\n    * Seller University\n    * Seller Central Help\n    * Accelerate Seller Event\n    * Seller FAQs\n    * More ways to make money\n  * Tools\n    * Login to your seller account\n    * Amazon Seller App\n    * Seller Central\n    * Selling Partner Appstore\n    * Find products to sell\n    * Revenue calculator\n\n✕\n\nRate this page\n\nRate your experience with this page\n\nFeedback subject\n\nSuggestionComplimentWebsite contentTechnical issueOther\n\nSelect subject\n\n  * Suggestion\n  * Compliment\n  * Website content\n  * Technical issue\n  * Other\n\nPlease tell us the reason for your rating\n\n500characters remaining\n\n_Privacy statement_ Personal or sensitive data are not necessary to complete\nthis survey and should not be provided. By submitting my feedback, I represent\nand warrant that no personal or sensitive data(e.g., names, addresses,\ntelephone numbers or e-mail addresses) have been included in my responses.\n\nSubmit\n\nThanks for the feedback!\n\nYour feedback helps us continually improve our website experience.\n\n✕\n\n### Select your preferred language\n\n  * English - US\n  * Español - US\n  * 中文 - CN\n\nTerms of Service\n\nPrivacy Policy\n\n© 2024, Amazon.com Services LLC.\n\n",
    "links": "[{\"link\": \"https://sell.amazon.com/?ref_=sdus_soa_home_n\", \"text\": \"\"}, {\"link\": \"https://sell.amazon.com/?ref_=sdus_soa_home_n\", \"text\": \"\"}, {\"link\": \"https://sell.amazon.com/?ref_=sdus_soa_home_f\", \"text\": \"\"}, {\"link\": \"https://sell.amazon.com/privacy\", \"text\": \"Privacy Policy\"}]"
}