{
    "summary": "NEW ✨  Let's Crush It on Amazon Together!  _Contact Us Today_\n\n  * Solutions\n    * Amazon PPC Tool\n    * AI Automation\n    * Product Research\n    * Keyword Research\n    * Product Ideas\n    * Listing Quality\n    * Profit Dashboard\n    * API Integration\n  * Services\n    * Amazon PPC Agency\n    * Amazon Listing Service Provider\n  * Pricing\n  * Schedule Demo\n  * Free Tools\n    * FBA Calculator\n    * Keyword Research\n    * Amazon PPC Audit\n    * Listing Quality Checker\n    * Sales Estimator\n\nSign up for Free\n\n  * __Solutions\n    * Amazon PPC Tool\n    * AI Automation\n    * Product Research\n    * Keyword Research\n    * Product Ideas\n    * Listing Quality\n    * Profit Dashboard\n    * API Integration\n  *  __Services\n    * Amazon PPC Agency\n    * Amazon Listing Service Provider\n  * Pricing\n  * Schedule Demo\n  *  __Free Tools\n    * FBA Calculator\n    * Keyword Research\n    * Amazon PPC Audit\n    * Listing Quality Checker\n    * Sales Estimator\n\n© 2023 Powered by  SellerApp\n\n# Amazon Brand Analytics: A Deep Dive for Brands\n\n###### Arishekar N\n\nOctober 30, 2023  14 mins to read\n\nShares2FacebookTweetPinEmail\n\nGrowing your Amazon business sustainably requires you to build loyalty among\nyour customers.\n\nTo do that, it’s important to understand the customers well. Their needs,\ninterests, and purchasing powers – all of these will help you craft a\npersonalized marketing strategy that speaks directly to your customers and\ngets them to buy your product.\n\nBut you need data for that!\n\nLaunched in 2019, Amazon Brand Analytics gives you access to all the data you\nneed to understand the purchasing behavior of customers.\n\nUsing that, you can effectively craft your marketing strategy and build brand\nawareness and revenue.\n\nLet’s understand in detail what Amazon Brand Analytics does and how it can\nhelp you increase your sales.\n\n **A quick peek into the article:**\n\n  1. What is Amazon Brand Analytics?\n  2. Amazon Brand Analytics Eligibility Requirements\n  3. What Reports Can You Get From Amazon Brand Analytics?\n  4. Benefits of Using Amazon Brand Analytics?\n  5. Final Thoughts\n\n## What is Amazon Brand Analytics?\n\nAmazon released Amazon Brand Analytics solutions for registered brand owners\nto help them grow sales and customer loyalty.\n\nThis tool gives you an inside view of:\n\n  * What keywords do shoppers use to find products, \n  * The products customers compare and buy after viewing their offers, \n  * The items customers frequently buy together, \n  * And the products customers buy repeatedly. \n\nBrand Analytics also provides demographic data on customer location, gender,\nage, income, and marital status.\n\nWith this information, you can:\n\n  * Improve product visibility with targeted advertising\n  * Drive more online sales with smart pricing and attractive offers\n  * Understand shopping habits to reach new customers\n  * Offer the right product mix to get ahead of competitors \n\nNot only does Amazon Brand Analytics (ABA) provide these insights, but it also\nmakes them easy to understand and actionable, thanks to its intuitive and\nuser-friendly interface.\n\n## Amazon Brand Analytics Eligibility Requirements\n\nAmazon Brand Analytics is available in Seller Central for all Amazon Brand\nregistered sellers.\n\nIf you don’t see it in your Seller Central dashboard, you simply don’t meet\nthe criteria to become a brand-registered seller on Amazon.\n\nLearn about how to register your brand on Amazon from this **detailed guide**\n**.  **\n\n### Where Can You Find The Brand Analytics Tool?\n\nNow, if you are brand-registered, simply log into your Seller Central account\nand find “Brand Analytics” under the “Brand” section in the left navigation\npane.\n\n## What Reports Can You Get From Amazon Brand Analytics?\n\nIn the Brand Analytics Dashboard, you can see six reports in two segments:\n\n  1. Search Analytics\n  2. Consumer Behavior Analytics\n\nUnder **search analytics** , you get\n\n  * Search Catalog Performance\n  * Search Query Performance\n  * Top Search Terms\n\nUnder **consumer behavior analytics** ,\n\n  * Repeat Purchase Behavior\n  * Demographics\n  * Market basket Analysis\n\nAll these reports help you understand the nitty gritty of the shopping\njourney, and create a data-driven marketing strategy.\n\n### Search Catalog Performance\n\nThis report reveals how customers interact with your brand’s product\nthroughout the shopping journey.\n\nThe Search Catalog Performance Dashboard displays the following metrics for\neach ASIN:\n\n  *  **Search Funnel – Impressions**\n    * Impressions: Total number of impressions across all search queries during the selected time period\n    * Rating (Median): Median rating of the ASIN while showing on the search result\n\n  *  **Search Funnel – Clicks**\n    * Clicks: The total number of ASIN clicks or glance views during the selected time period.\n    * Click Rate (CTR): It represents the percentage of clicks to impressions for ASINs originating from the search results page.\n\n  *  **Search Funnel – Cart Adds**\n    * Cart Adds: The total number of ASINs added to the cart during the selected time period, generated from the search result\n\n  *  **Search Funnel – Purchases**\n    * Purchases: The total number of ASIN purchases during the selected time period, originating from the search results page.\n    * Search Traffic Sales: The grand total of all sales revenues during the selected time period, originating from the search results page.\n    * Conversion Rate:  It’s the percentage of purchases to clicks for ASINs originating from the search results page.\n\nApart from these, you also get some other metrics for each stage of the\npurchasing funnel:\n\n  *  **Same-Day Shipping Speed:** Indicates the number of times an ASIN, viewed/ clicked/ placed in the cart/ purchased, displayed a message offering same-day delivery on the search results page.\n  *  **1D Shipping Speed:** It records the number of times an “impressed/ clicked/ cart-added/ purchased” ASIN displays a message for “one-day delivery” on the search results page.\n  *  **2D Shipping Speed:** Tracks the frequency of an ASIN, viewed/ clicked/ placed in the cart/ purchased, displaying a two-day delivery message on the search results page.\n\nThese metrics help you understand how your customers move from one stage to\nanother in their customer journey.\n\nFor example, if you see a high number of impressions but a low CTR, it\nindicates your product listing is not appealing enough, or it may not match\ncustomers’ intent. You need to work on the product image and product title to\nget more clicks.\n\nSimilarly, if the cart adds are high but actual purchases are low, it means\nyou have a high cart abandonment rate. Here, you can reduce the friction in\nthe checkout process or implement a retargeting strategy to get people back to\nyour listing and complete the purchase.\n\nWith the Shipping Speed (Same day, 1D, 2D) metric, you can determine how it\ninfluences the buyer’s decision.\n\n### Search Query Performance\n\nThis dashboard displays top search queries that lead to your brand’s products\nfrom the search. It also shows overall metrics (impressions, clicks, cart\nadds, purchases) for each query and your brand’s share.\n\nBy default, Amazon shows the Brand view to understand your overall brand(s)\nperformance. But you can also look at the ASIN view to understand the\nperformance of your individual ASIN.\n\nIn the Search Query Performance Dashboard, you can find the following metrics\nfor customer queries associated with your brand’s products:\n\n  *  **Search Query Score** : The rank of each search query from top to bottom.\n  *  **Search Query Volume** : The number of times customers search for a specific query on Amazon.\n  *  **Impressions:** The number of times products appear on the Amazon search page for a query.\n\nIn the impressions section, you can find the following metrics:\n\n  *  **Total Count:** It shows the number of product impressions for the search query on the Amazon search page.\n  *  **Brand Count:** It indicates the number of product impressions for your brand on the Amazon search page. \n  *  **Brand Share:** It is the percentage ratio of Brand Count to the Total Count. It helps you understand where your brand stands compared to the category.\n\nSimilar to Brand Count and Brand Share, in the ASIN view report, you get the\nfollowing metrics:\n\n  *  **ASIN Count:** It signifies the number of impressions your ASIN receives on the Amazon search page for the given query.\n  *  **ASIN Share:** It represents the percentage ratio of ASIN Count to the Total Count for the query.\n  *  **Clicks** : It indicates the number of times customers click on products in search results.\n\nSimilar to impressions, the following metrics are available for clicks:\n\n  * Total Count\n  * Brand Count\n  * Brand Share\n\nIt also provides some additional metrics:\n\n  *  **Click Rate** : The percentage ratio of the total number of clicks to the search query volume count within a specific time period. For example, if the search query volume is 10 and customers click on products twice, the Click Rate will be 20%.\n  *  **Price (Maiden):** The average price of all products related to the query at the time the impression is generated.\n  *  **Brand Price (Maiden)** : The average price of all products belonging to the brand related to the query at the time the impression is generated.\n  *  **Same-Day Shipping Speed:** This reflects the number of times an ASIN is clicked when same-day shipping options are available for the query.\n  *  **1-Day Shipping Speed** : The number of times an ASIN with a “One-Day Shipping” message is clicked for the search query.\n  *  **2-Day Shipping Speed:** The number of times an ASIN with a “Two-Day Shipping” message is clicked for the search query.\n  *  **Cart Adds:** It’s the number of times a product is added to a cart after a search. It includes the following metrics:\n    * Total Count\n    * Cart Add Rate\n    * Brand/ASIN Count\n    * Brand/ASIN Share\n    * Price (Median)\n    * Brand/ASIN Price (Median)\n    * Same-Day Shipping Speed\n    * 1D Shipping Speed\n    * 2D Shipping Speed\n\n  *  **Purchases** : It’s the number of times shoppers order a product after using the search query. It includes the following metrics:\n    * Total Count\n    * Purchase Rate\n    * Brand/ASIN Count\n    * Brand/ASIN Share\n    * Price (Median)\n    * Brand/ASIN Price (Median)\n    * Same-Day Shipping Speed\n    * 1D Shipping Speed\n    * 2D Shipping Speed\n\nThe Amazon Search Query Performance Dashboard provides valuable insights for\nbrands and sellers throughout the purchasing journey. With this data, sellers\ncan refine their advertising strategy to get more conversions.\n\nRead the complete **Search Query Dashboard guide** to learn more about it.\n\n### Top Search Terms\n\nKnowing what customers search for is extremely valuable data for any Amazon\nbrands and advertisers.\n\nInstead of throwing stones in the dark, you can finally see the top search\nterms in this dashboard. It provides insights into the most frequently\nsearched terms within a selected timeframe.\n\nSearch terms are ranked based on their frequency of searches, and for each\nterm, the dashboard shows 3 top-clicked products, categories, and brands.\n\nHere are some key metric definitions to help you navigate and understand the\ndashboard:\n\n  *  **Search Frequency Rank** : Indicates the ranking order of search terms based on their search frequency. Terms with the same frequency will have the same rank.\n  *  **Top Clicked Products** : Displays the top 3 products that generated the most results for a specific search term. These products are highly relevant to the search query and attract a significant number of clicks.\n  *  **Top Clicked Categories** : Highlights the top 3 categories that generated the most results for a particular search term. This information helps identify popular categories related to the search term.\n  *  **Top Clicked Brands** : Identifies the top 3 brands that generated the most results for a specific search term. Knowing which brands attract the most clicks can provide insights into consumer preferences and competitor analysis.\n\nAdditionally, the dashboard shows the following metrics for the top three\nclicked products on the Amazon search page:\n\n  *  **Click Share:** It’s the percentage of clicks received by the ASIN compared to the total clicks generated from the search results within the selected timeframe.\n  *  **Conversion Share** : Indicates the percentage of conversions for an ASIN compared to the total conversions of all ASINs based on the search results within the selected timeframe. \n\nThese metrics give sellers valuable insights into popular search terms,\nproducts, categories, and more.\n\n### Repeat Purchase Behavior Report\n\nThousands of people are buying your product, but how many of them are coming\nback for a repeat purchase?\n\nThe Repeat Purchase Behavior Report provides insights into repeat purchase and\ncustomer retention patterns by ASIN or brand. It gives you a breakdown of\ncustomer purchase behavior and helps you make data-driven decisions to\nincrease brand loyalty.\n\nThe metrics found in the Repeat Purchase Behavior Report are\n\n  *  **Total Number of Orders:** It gives the total number of orders generated for a brand or ASIN. One order can have multiple product units. \n  *  **Repeat Ordered Product Sales:**\n    * Sales: It’s the sales generated from customers who have placed more than one order within the specified reporting time frame.\n    * Change vs. Prior Period: This is the percentage change in repeat ordered product sales compared to the closest previous period to the selected time range.\n    * % Share of Total Sales: It showcases the percentage of repeat ordered product sales in relation to the total ordered product sales.\n  *  **Repeat Ordered Units**\n    * Units: It’s the number of product units purchased by customers who made more than one order within the selected reporting time range.\n    * Change vs. Prior Period: The percentage change in repeat ordered units compared to the closest previous period before the selected reporting time range.\n    * % Share of Total Sales: The percentage of repeat ordered units out of the total unit sales.\n  *  **Repeat Customer Count**\n    * Repeat Customers: It’s the total number of distinct customers who placed multiple orders within the specified reporting time period.\n    * Change from Previous Period: **** It’s the percentage change in repeat customers from the most recent period before the selected reporting time period.\n  *  **Repeat Customer Share**\n    * Customer Share: It’s the percentage of repeat customers from the total number of customers who made an order within the selected time period.\n    * Change from Previous Period: **** It’s the percentage change for repeat customers compared to the most recent period prior to the selected reporting time period.\n\n### Demographic Report\n\nDo you know who are your target customers? Do you know how old are they? How\nmuch do they earn?\n\nIn the demographic report, you can get insights into all these, including\ntheir age, household income, education, gender, and marital status.\n\nIt helps you understand your target audience on a granular level. You can use\nthis information to optimize your on and off-Amazon marketing messaging to\nmaximize awareness and conversions.\n\n### Market Basket Analysis\n\nYou can see customers are visiting your product and purchasing. But is there\nany way to increase the average order value?\n\nFor example, customers are buying yoga mats. They also tend to purchase\nsweatpants and sports shoes. Since you don’t offer them, customers naturally\nshift towards some other brands.\n\nInstead, if you bundle a yoga mat with sweatpants and shoes, it can increase\nthe average order value.\n\nBut how do you know what products shoppers commonly buy together?\n\n **Market Basket Analysis** provides insights into the products that are\nfrequently purchased together, allowing you to create effective bundling and\ncross-selling opportunities.\n\nThe report gives the following metrics for the top three purchase\ncombinations:\n\n  * Product Title\n  * Product ASIN\n  * Combination %\n\nThe Market Basket Report helps you identify cross-marketing opportunities and\ncreate value-based bundles to increase the average order value.\n\n## Benefits of Amazon Brand Analytics\n\nThe Amazon Brand Analytics tool comes with multiple benefits. Here are some of\nthem:\n\n### Get First-hand Marketplace Data\n\nAmazon Brand Analytics provides accurate market data straight from Amazon’s\nin-house reporting. This includes customer behaviors, search trends, and\nbuying habits on the platform.\n\nYou can use this data to create data-backed marketing strategies.\n\nABA tool also provides market-wide reporting without restricting itself to a\nsingle brand. It gives brands a birds-eye view of the broader market, allowing\nthem to identify trends and opportunities for growth.\n\n### Identify Target Audience\n\nWith the Demographic report, you can tap into your target audience with utmost\naccuracy.\n\nLet’s assume that you are selling organic moisturizers. When you went through\nthe Demographic data, you saw that most of your audience who are purchasing\nthe product are between 18 – 24 women, earning $50,000 – $74,999, and\nunmarried.\n\nWith this information, you can create personalized ad copy directed to your\ntarget audience that generates better results.\n\n### Understand Customer Shopping Behavior\n\nWith the Repeat purchase analysis dashboard, you can understand which ASINs\nand brands get the most repeat purchases. This information helps you optimize\nyour advertising strategy to get more sales for these products.\n\n### Identify High-Performing Keywords\n\nYou can also find search terms that perform well from Amazon Brand Analytics.\n\nFor example, if you see on the Search Query Performance report that some\nkeywords have high search volume and also have significant cart-add and\npurchase count, it means it’s a high-performing search query.\n\nYou can increase your advertising budget for this keyword to increase\nconversion chances.\n\nEven though ABA is a sophisticated tool, it doesn’t give all the information\nabout a search query.\n\nYou should pick search terms with decent search volume and are moderately\ncompetitive, and you want to find better insights into keywords. Here’s what\nyou can do:\n\n  * Step 1: Navigate to SellerApp Keyword Research tool.\n  * Step 2: Type the search term you want to search and analyze.\n\n  * Step 3: Analyze the result based on search volume, relevancy score, estimated orders, and conversion rate to find the most profitable keywords. \n\n#### Final Thoughts\n\nScaling an e-commerce business can be tricky, and Amazon is no exception.\n\nWith the data from Amazon Brand Analytics, you can optimize your business on a\ndeeper level and increase the chances of sales.\n\nHowever, Amazon Brand Analytics does not provide you with everything. You\nstill need a seller tool like SellerApp to get additional insights on\nkeywords, conduct competitor analysis, optimize your listing, and automate\nyour advertising campaigns.\n\nOn top of that, you need experts who can help you create and optimize your PPC\ncampaigns to maximize your ROAS. We’ve already helped 20,000+ brands,\nincluding Philips and Coca-Cola,  create full-funnel advertising strategies.\n\nAnd we can do the same for you.\n\nSchedule a call with us and kickstart your e-commerce growth now!\n\n### Was this post helpful?\n\nLet us know if you liked the post. That’s the only way we can improve.\n\nYes 2\n\nNo 2\n\n### Related posts:\n\n  * How to Turn your Amazon Product Returns into Profits!\n  * Amazon Prime Day 2021 surpasses all previous records\n  * What Is An Amazon FBA Aggregator?\n  * How to Improve Your Amazon Order Defect Rate (ODR)\n\n##  Post Written by:\n\nArishekar N  Arishekar N, Sr. Director of Marketing & Growth at SellerApp, is\na specialist in digital marketing, in addition to website keyword optimization\nfor search engines. His areas of expertise include enhancing the organic &\npaid ranking of webpages on search engines with innovative SEO & SEM\nstrategies and online promotions. Ask anything or share your feedback Email:\narishekar.n@sellerapp.com\n\n__ __ __\n\n### Was this post helpful?\n\nLet us know if you liked the post. That’s the only way we can improve.\n\nYes 2\n\nNo 2\n\n###  4 Comments on “Amazon Brand Analytics: A Deep Dive for Brands”\n\n  1. ###### Valech\n\nMay 1, 2019\n\nReply\n\nAppreciate you guys\n\n  2. ###### Bajensen\n\nMay 2, 2019\n\nReply\n\nThank you SellerApp for helping Amazon brand owners  \nWonderful information\n\n  3. ###### Israel Nickerson\n\nFebruary 25, 2021\n\nReply\n\nVery Informative article. Thanks again  \nPerfectly explained each and every step of Amazon Brand Analytics  \nThank you SellerApp.\n\n    1. ###### Arishekar N\n\nJune 29, 2021\n\nReply\n\nWe are happy to hear that you liked the blog.  \nThank you.\n\n#### Leave a comment Cancel Reply\n\nYour email address will not be published. Required fields are marked *\n\nComment *\n\nName *\n\nEmail *\n\nWebsite\n\n  \n\n###  Related posts\n\n###  Boost your Sales Velocity on Amazon With this Ultimate Guide\n\n###  What Is An Amazon FBA Aggregator?\n\n###  Amazon Merchant – Who Are They and How to Become One?\n\n###  Amazon FBA Guide 2023: Everything you need to know about it\n\n###  Importing from China to Australia: An Amazon seller’s checklist\n\n###  **Understanding Amazon Best Seller Rank: A Comprehensive Guide**\n\n###  How Repricing Fits into your Amazon Growth Stack\n\n###  Start Selling On Amazon Australia Shortcuts – The Easy Way\n\n###  The Ultimate Amazon Product Launch Checklist – 12 Steps to Success\n\n##### Recent Posts\n\n  * Amazon On-Box Advertising: Boost Your Sales with Targeted Visibility\n  * Retail Media Networks: A Complete Guide for Brands and Sellers\n  * Why Amazon’s Small Business Academy Matters for Entrepreneurs\n  * Amazon Is Set To Show Ads on Prime Videos Starting 2024\n  * AmazonBasics 101: What You Need to Know\n\n###### Talk to us\n\nLoad More\n\nTo enable every eCommerce seller to monitor, optimize and scale their business\nglobally\n\n##### Free Tools\n\n  * FBA Calculator\n  * Amazon Keyword Tool\n  * Product Sourcing\n  * Listing Quality Checker\n  * Amazon PPC Audit\n  * Product Description Editor\n  * Duplicate Keyword Remover\n  * Amazon ACoS Calculator\n  * Amazon Sales Estimator\n\n###### Resources\n\n  * Careers\n  * Become an Affiliate\n  * Partner With Us\n  * Facebook Group\n  * Help\n  * Blog\n  * API Integrations\n\n###### Help & Legal\n\n  * Contact Us\n  * Privacy\n  * Terms of Use\n  * GDPR\n\n© 2023 Powered by  SellerApp\n\n  * Follow Us\n  *  __Facebook\n  *  __Linkedin\n  *  __Twitter\n  *  __YouTube\n  *  __Instagram\n  *  __Amazon\n\nSchedule Demo\n\n__\n\n",
    "links": "[{\"link\": \"https://www.facebook.com/sharer/sharer.php?u=https://www.sellerapp.com/blog/amazon-brand-analytics/&display=popup&ref=plugin&src=share_button\", \"text\": \"\"}, {\"link\": \"https://twitter.com/share?url=https://www.sellerapp.com/blog/amazon-brand-analytics/&text=Amazon%20Brand%20Analytics%3A%20A%20Deep%20Dive%20for%20Brands\", \"text\": \"\"}, {\"link\": \"https://pinterest.com/pin/create/button/?url=https://www.sellerapp.com/blog/amazon-brand-analytics/&media=https://www.sellerapp.com/blog/wp-content/uploads/2023/09/amazon-brand-analytics.jpg&description=Amazon%20Brand%20Analytics:%20A%20Deep%20Dive%20for%20Brands\", \"text\": \"\"}, {\"link\": \"https://www.sellerapp.com/blog/amazon-brand-analytics/#respond\", \"text\": \"Cancel Reply\"}]"
}