{
    "summary": "PAGE.ONE\n\n  * Home\n  * Services\n    * Listing Optimization for Amazon\n    * Product Videos\n    * Photography\n      * Product Photography\n      * 360 Degree Photography\n    * Enhanced Brand & A+ Content Design\n    * PPC Management for Amazon\n      * Complete Ad Management\n    * All Services\n  * Case Studies\n  * Meet The Team\n  * Contact Us\n  * Sign In\n  * 833-467-2431\n  * Blog\n\nCopyright 2019.Page.One. All Rights Reserved\n\n  * \n\n  * Home\n  * Services\n    * Brand Management for Amazon\n    * Listing Optimization for Amazon\n    * Product Videos\n    * Photography\n      * Product Photography\n      * 360 Degree Photography\n    * A+ Content and Storefront Design\n    * PPC Management for Amazon\n      * Full Service Management\n  * Case Studies\n  * Our Team\n  * Contact\n  * Sign In\n  * Blog\n  * 833-467-2431\n\nHome > Business Analytics > Amazon Brand Analytics: An Overview of The\nFeatures & Benefits\n\n## Amazon Brand Analytics: An Overview of The Features & Benefits\n\nBy Page.One Team | March 14, 2021 |  Business Analytics\n\nOne of the competitive advantages you gain when you become a member of\nAmazon’s Brand Registry program is that you get access to Brand Analytics.\n\nBrand Analytics is Amazon’s exclusive suite of data tools that allow you to\ntrack customer behavior and search term trends, and see how your products\nperform compared to your competitors.\n\nThe tools inside Brand Analytics provide four main benefits:\n\n  1. Search Term Analysis\n  2. Competitor Insights\n  3. Customer Behavior Insights\n  4. Demographic Insights\n\nWith access to this data, you’re able to make more well-informed decisions\nabout how to market and advertise your current products and what products to\nlaunch next.\n\nIn this article, we’re going to break down four features that Brand Analytics\noffers.\n\n## Brand Analytics Feature #1 – Amazon Search Terms\n\nThe most valuable feature of Brand Analytics is Amazon Search Terms. This\nfeature gives you insight into how customers find you and your competitors’\nproducts.\n\nYou can take those insights and optimize your listing with targeted keywords\nthat increase your page visits, and thus your odds of getting sales.\n\nWith this feature, you’re able to thoroughly identify and analyze your\ncompetitors because you’ll get to see what listings have the highest\nclickthrough rates for specific keywords.\n\nOnce you identify those listings, you can analyze their title, photos,\nbullets, and descriptions, and see what areas you might be able to adapt and\nmold to fit your product listing and offers.\n\nThe chart for the Amazon Search Terms feature has four data points:\n\n**Search Frequency Rank** – A numeric rank given to a search term based on how\npopular it is compared to other search terms in a given time period. It’s\nimportant to note that Amazon doesn’t reveal search volume for the search\nterms, but you can get search volume estimates with tools like Helium 10 and\nJungleScout.\n\n**Top Clicked ASINs** – The top three ASINs with the highest clickthrough rate\nfor a search term in a given time period.\n\n**Click Share** – The percentage of clicks an ASIN gets for a search term,\ncompared to the total clicks that search term received in a given time period.\n\n**Conversion Share** – The percentage of sales an ASIN receives from a search\nterm in comparison to the total sales that the search term produces in a given\ntime period.\n\nYou can see each of the columns in the photo below:\n\nAnother way you can use the Amazon Search Term feature is if you see a listing\nthat’s selling like crazy, and you want to find out what search terms get that\nlisting the highest clickthrough rate, then you can search the ASIN directly.\n\nLet’s look at the OXO Garlic Press product listing on Amazon.\n\nWhen we enter the product ASIN in the search field, we get the following\nresults:\n\nOnce you know what’s working for your competitors, you can use those same\nsearch terms in your listing and your advertising.\n\nWith Amazon Search Terms, a lot of the effort and guesswork is removed because\nyou get data straight from the source—i.e., Amazon.\n\n## Brand Analytics Feature #2 – Market Basket Analysis\n\nThe Market Basket Analysis feature allows you to see what products your\ncustomers purchase along with your product. With this information, you gain\nclarity on what new products or bundles you can launch that would most likely\nsucceed.\n\nA very valuable aspect of this feature is that you can also search other\nbrands’ products to see what customers tend to buy with those products.\n\nAnd if you want to expand your product line, you can use this data to develop\na product (or bundle) that is new and valuable to the marketplace and is\nlikely to succeed.\n\n## Brand Analytics Feature #3 – Item Comparison and Alternate Purchase\nBehavior\n\nThe Item Comparison and Alternate Purchase Behavior feature is where you find\nout who your real competitors are and how customers view you in comparison.\nThis feature also gives you insight into how your market sees their problem\nand what they believe the best solutions are.\n\nLet’s start with the Item Comparison feature:\n\nThe Item Comparison feature gives you insight into customer browsing patterns.\nThe chart shows you the top five products that are viewed parallel to your\nproduct.\n\nOn the chart, besides each product, you’ll see the percentage of times each\nproduct was viewed by customers who viewed your product on the same day.\n\nSimilar to the Item Comparison feature, the Alternate Purchase Behavior\nfeature shows you the top five products that prospects purchase after viewing\nyour product.\n\nOn the chart, you’ll see each product ranked from the top alternative product\nthat’s most frequently purchased, to the lowest. You’ll also see a percentage\nof the sales each alternative product got compared to the other five\nalternative products.\n\nOnce you know what items prospects who viewed your product end up purchasing,\nyou can analyze those offerings and listings and see what those sellers are\ndoing that makes prospects purchase from them instead of you.\n\nAnother advantage of the Item Comparison and Alternate Purchase Behavior\nfeature is that you get to see your main competitors’ ASINs, so you can target\nthem directly in your PPC campaigns.\n\n## Brand Analytics Feature #4 – Demographics Insights\n\nUnderstanding your customer demographics helps you target the right audience\nand craft the right marketing messages that lead to sales.\n\nThe Brand Analytics Demographics Insights feature gives you sales statistics\nacross five demographics:\n\n  * Age\n  * Household Income\n  * Education\n  * Gender\n  * Marital status\n\nThe feature allows you to see the demographics of your customers, but you can\nalso search the demographics of other ASINs.\n\nIf you’ve run ads on Facebook, this feature is similar to Facebook’s Audience\nInsight tool.\n\n## Wrapping Up\n\nAmazon’s Brand Analytics tool is a great addition to your other third-party\nresearch tools like Helium10, Zonguru, and JungleScout.\n\nBut what’s great about Brand Analytics is that you get first-hand data from\nAmazon—so you’re getting the most accurate data.\n\nIf you’re not already brand registered, make sure you enroll in Amazon’s Brand\nRegistry program so you can get access to these exclusive tools to help you\nmake accurate and successful decisions.\n\nHappy Selling,\n\nThe Page.One Team\n\n## The Last Word:\n\nBecause Amazon keeps a lot of their data private, anytime you can get data\nfrom them directly, you save yourself time, money, and effort.\n\nUse the Amazon Search Term tool to see what search terms are most responsive.\nThen enter those search terms in a third-party search volume tool and\nstrategically target keywords in your listings and advertising from there.\n\n\n\n### Categories\n\nCategories Select Category Amazon Listing Optimization Amazon News Amazon PPC\nAmazon Product Photography Amazon Storefronts Business Analytics Business\nBranding for Amazon Client Case Study Education and Conferences Interview\nMarketing on Amazon Podcast Sell on Amazon Uncategorized\n\n### Find Something\n\n### Recent Posts\n\n  * Amazon Storefronts – Using Video to Enhance The Customer Experience and Drive Sales\n  * Amazon Competitor Research: How to Use Your Competitors’ Listings to Improve Your Amazon Product Page\n  * Amazon Restricted Words: Terms and Phrases to Avoid In Your Product Listing\n  * How to Use Product Variations on Your Amazon Listing\n  * Amazon Lightning Deals: Capturing Extra Sales with Time-Sensitive Promotions\n\n###### QUICK LINKS\n\n  * Home\n  * Services\n  * Case Studies\n  * Careers\n  * Contact Us\n  * Sign In\n\n###### OUR SERVICES\n\n  * Brand Management for Amazon\n  * Product Videos\n  * Product Listing Optimization for Amazon\n  * Professional Product Photography\n  * A+ Content and Storefront Design\n  * PPC Management for Amazon\n\n###### CONTACT US\n\nSouth Florida  \n1231 Stirling Road #108  \nDania Beach, Fl 33004\n\nCall: 833-467-2431  \nEmail: info@page.one\n\nCopyright 2023.Page.One. All Rights Reserved | Privacy Policy   Terms Of Use\n\n## Whoooaaa! Where Are You Going?\n\n ** **\n\n**How About A Free Advertising Audit?**\n\n** **\n\n**A Quote On A Creative Project?**\n\n\n\n  \nFill This Out And One Of Our Strategic Account Managers Will Get Right Back To\nYou.\n\nLet's Go!\n\n##\n\nPerfect! We'll be in touch soon!\n\nShopping Cart\n\nProducts\n\n0\n\nTotal\n\n$0.00\n\nView Cart\n\n0\n\n",
    "links": "[]"
}