{
    "summary": "Clear\n\nSearchLoading\n\n##### Regions\n\n  * Americas\n\n  * Asia & Oceania\n\n  * Europe\n\n  * Middle East & Africa\n\n  * ### Americas\n\n###### Americas\n\n    * Argentina\n    * Brasil\n    * Canada\n    * Colombia\n    * Ecuador\n    * Mexico\n    * United States\n\n  * ### Asia & Oceania\n\n###### Asia & Oceania\n\n    * Asia Pacific\n    * Australia & NZ\n    * 中国\n    * India\n    * Japan\n    * 대한민국\n    * Southeast Asia\n    * Sri Lanka\n\n  * ### Europe\n\n###### A-I\n\n    * Adriatic\n    * Belgium\n    * Bulgaria\n    * Czech Republic\n    * Deutschland\n    * España\n    * France\n    * Greece\n    * Hungary\n    * Ireland\n    * Israel\n    * Italia\n\n###### J-Z\n\n    * Nederland\n    * Nordics\n    * Poland\n    * Portugal\n    * Romania\n    * Russia\n    * Slovakia\n    * Switzerland\n    * Turkey\n    * Ukraine\n    * United Kingdom\n\n##### EMEA Thought Leadership\n\nDeveloping IQVIA’s positions on key trends in the pharma and life sciences\nindustries, with a focus on EMEA.\n\nLearn more\n\n  * ### Middle East & Africa\n\n###### Middle East & Africa\n\n    * Middle East and Africa\n\n##### EMEA Thought Leadership\n\nDeveloping IQVIA’s positions on key trends in the pharma and life sciences\nindustries, with a focus on EMEA.\n\nLearn more\n\n  * IQVIA.COM\n  * United States\n\n  * United States (English)\n\nregions search Artboard 1\n\nMAIN/REGIONS\n\nregions/\n\n###### Regions\n\n  1. Americas\n\n  2. Asia & Oceania\n\n  3. Europe\n\n  4. Middle East & Africa\n\n  * ### Americas\n\n###### Americas\n\n    * Argentina\n    * Brasil\n    * Canada\n    * Colombia\n    * Ecuador\n    * Mexico\n    * United States\n\n  * ### Asia & Oceania\n\n###### Asia & Oceania\n\n    * Asia Pacific\n    * Australia & NZ\n    * 中国\n    * India\n    * Japan\n    * 대한민국\n    * Southeast Asia\n    * Sri Lanka\n\n  * ### Europe\n\n###### Europe\n\n    * Adriatic\n    * Belgium\n    * Bulgaria\n    * Czech Republic\n    * Deutschland\n    * España\n    * France\n    * Greece\n    * Hungary\n    * Ireland\n    * Israel\n    * Italia\n    * Nederland\n    * Nordics\n    * Poland\n    * Portugal\n    * Romania\n    * Russia\n    * Slovakia\n    * Switzerland\n    * Turkey\n    * Ukraine\n    * United Kingdom\n\n##### EMEA Thought Leadership\n\nDeveloping IQVIA’s positions on key trends in the pharma and life sciences\nindustries, with a focus on EMEA.\n\nLearn more\n\n  * ### Middle East & Africa\n\n###### Middle East & Africa\n\n    * Middle East and Africa\n\n##### EMEA Thought Leadership\n\nDeveloping IQVIA’s positions on key trends in the pharma and life sciences\nindustries, with a focus on EMEA.\n\nLearn more\n\n  1. Solutions\n\n##### SOLUTIONS\n\n    1. Life Sciences Solutions\n\n    2. Healthcare Solutions\n\n    3. Medical Device and Diagnostic\n\n    4. U.S. Government\n\n### Life Sciences Solutions\n\nBringing together unparalleled healthcare data, advanced analytics, innovative\ntechnologies, and healthcare expertise to create intelligent connections that\nspeed the development and commercialization of innovative medicines to improve\npatient lives.\n\nLearn More\n\n###### Life Sciences Solutions\n\n    1. Commercial Solutions\n    2. Contract Sales and Medical Solutions\n    3. Financial Services\n    4. Information Solutions\n    5. Medical Affairs\n    6. Real World Evidence\n\n### Healthcare Solutions\n\nAccelerate digital innovation to enable smarter decisions that reduce cost,\nmodernize patient and consumer engagement, and improve health outcomes.\n\nLearn More\n\n###### Healthcare Solutions\n\n    1. Health Plans\n    2. Hospitals and Health Systems\n    3. Insurers and Risk\n    4. Medical Specialty Societies\n    5. Patient Advocacy Organizations\n\n### Medical Device and Diagnostic Solutions\n\nYour world is unique – and quite different from pharma. In the U.S., decision-\nmaking has shifted from individual physicians to integrated networks--GPOs,\nIDNs and payers. These groups have heightened the focus on proving your\nsolution’s value, demanding outcomes analyses and putting pressure on pricing.\n\nLearn More\n\n###### Medical Device and Diagnostic Solutions\n\n    1. Hospital Procedures and Diagnosis\n    2. Medical Device Supply Audit\n    3. MedTech Business Insights and Trends Podcast Series\n\n### U.S. Government Solutions\n\nFor government agencies and organizations at every level—from federal or\nnational to regional and local—Big Data can have a huge impact on public\nhealth.\n\nLearn More\n\n###### U.S. Government Solutions\n\n    1. CIO-CS\n\n  2. Insights\n\n##### U.S. PROGRESS POINT\n\nA curation of IQVIA's best thinking on topics and trends driving change,\ndisruption, and progress in the United States healthcare market.\n\nLEARN MORE\n\n##### U.S. BLOGS\n\nGet the latest insights on our life sciences, healthcare, and medical\ntechnology solutions in the United States. Follow our blog today!\n\nLEARN MORE\n\n##### U.S. INSIGHTS LIBRARY\n\nBrowse our library of insights and thought leadership.\n\nLEARN MORE\n\n  3. Events\n\n##### ON-DEMAND WEBINARS\n\nVisit our library of on-demand webinars.\n\nLEARN MORE\n\n##### UPCOMING EVENTS & WEBINARS\n\nView our upcoming events and webinars.\n\nLEARN MORE\n\n##### FEATURED WEBINAR\n\nTop Issues for Pharma to Watch in 2022 and 2023\n\nWATCH NOW\n\nContact Us\n\nREGIONS Search\n\n  1. Solutions\n  2. Insights\n  3. Events\n  4. Contact Us\n\nMAIN/search\n\nsearch\n\nMAIN/Solutions\n\nSolutions/\n\n###### SOLUTIONS\n\n  * Life Sciences Solutions \n\n  * Healthcare Solutions \n\n  * Medical Device and Diagnostic \n\n  * U.S. Government \n\n##### Life Sciences Solutions\n\nBringing together unparalleled healthcare data, advanced analytics, innovative\ntechnologies, and healthcare expertise to create intelligent connections that\nspeed the development and commercialization of innovative medicines to improve\npatient lives.\n\nLearn More\n\n###### Life Sciences Solutions\n\n  * Commercial Solutions\n  * Contract Sales and Medical Solutions\n  * Financial Services\n  * Information Solutions\n  * Medical Affairs\n  * Real World Evidence\n\n##### Healthcare Solutions\n\nAccelerate digital innovation to enable smarter decisions that reduce cost,\nmodernize patient and consumer engagement, and improve health outcomes.\n\nLearn More\n\n###### Healthcare Solutions\n\n  * Health Plans\n  * Hospitals and Health Systems\n  * Insurers and Risk\n  * Medical Specialty Societies\n  * Patient Advocacy Organizations\n\n##### Medical Device and Diagnostic Solutions\n\nYour world is unique – and quite different from pharma. In the U.S., decision-\nmaking has shifted from individual physicians to integrated networks--GPOs,\nIDNs and payers. These groups have heightened the focus on proving your\nsolution’s value, demanding outcomes analyses and putting pressure on pricing.\n\nLearn More\n\n###### Medical Device and Diagnostic Solutions\n\n  * Hospital Procedures and Diagnosis\n  * Medical Device Supply Audit\n  * MedTech Business Insights and Trends Podcast Series\n\n##### U.S. Government Solutions\n\nFor government agencies and organizations at every level—from federal or\nnational to regional and local—Big Data can have a huge impact on public\nhealth.\n\nLearn More\n\n###### U.S. Government Solutions\n\n  * CIO-CS\n\nMAIN/Insights\n\nInsights/\n\n##### U.S. PROGRESS POINT\n\nA curation of IQVIA's best thinking on topics and trends driving change,\ndisruption, and progress in the United States healthcare market.\n\nLEARN MORE\n\n##### U.S. BLOGS\n\nGet the latest insights on our life sciences, healthcare, and medical\ntechnology solutions in the United States. Follow our blog today!\n\nLEARN MORE\n\n#### U.S. INSIGHTS LIBRARY\n\n\"Browse our library of insights and thought leadership.\n\nLEARN MORE\n\nMAIN/Events\n\nEvents/\n\n##### ON-DEMAND WEBINARS\n\nVisit our library of on-demand webinars.\n\nLEARN MORE\n\n##### UPCOMING EVENTS & WEBINARS\n\nView our upcoming events and webinars.\n\nLEARN MORE\n\n#### FEATURED WEBINAR\n\n\"Top Issues for Pharma to Watch in 2022 and 2023\n\nWATCH NOW\n\nMAIN/Contact Us\n\nContact Us/\n\nFact Sheet\n\nIQVIA Brand Analytics Platform\n\nA self-service, intuitive technology that provides immediate access and\ncomplete visibility into critical patient and market insights\n\nAug 26, 2022\n\n  *   * Locations\n  * United States\n  * IQVIA Brand Analytics Platform\n\nShare PAGE\n\n  * Copy Link\n  * email\n  * facebook\n  * twitter\n  * linkedin\n  * wechat\n  * xing\n\n#### Get instant access\n\nDownload\n\nToday, every commercial decision starts with access to the right information\nat the right time.\n\nPowered by IQVIA's Analytics Engine, featuring best-in-class data and\nanalytics methodologies, IQVIA's Brand Analytics Platform is a self-service,\nintuitive technology that provides companies with immediate and seamless\naccess to critical information, powerful analytics, and dynamic visualization\ncapabilities that empower commercial teams to quickly identify market insights\nand easily view, manipulate, and export the data and visuals they want, when\ntheir teams need it the most.\n\nRead the fact sheet to learn more.\n\n##  You may also be interested in\n\nFact Sheet\n\nIQVIA Analytics Engine\n\nCase Study\n\nStrategically Preparing for New Product Launch by Assessing the Full Obesity\nMarket Landscape\n\nFact Sheet\n\nIQVIA Brand Analytics Platform— Data Science Workbench Module\n\nVideo\n\nIQVIA Brand Analytics Platform Video\n\nScientific Poster\n\nPricing and Market Access Posters\n\nInfographic\n\nInfographic - IQVIA Analytics Engine\n\n__Prev\n\nNext __\n\n## Related solutions\n\n__\n\n__\n\nReporting and Analytics\n\nTransform data into action\n\nCommercial Solutions\n\nInformation Solutions\n\nLife Sciences\n\nContact Us\n\n  * Investor Relations\n  * Customer Portal\n  * Careers\n  * Code of Conduct\n  * Events\n  * Contact Us\n\n  * Third-Party Access\n  * Suppliers\n  * Privacy\n  * Your Privacy Choices\n  * Terms of Use\n  * Sitemap\n\n©2023 IQVIA Inc, All Rights Reserved.\n\n  *   *   *   * \n\nYou are about to exit for another IQVIA country or region specific website\n\nPlease be aware that the website you have requested is intended for the\nresidents of particular country or region, as noted on that site.\n\nFor this browsing session please remember my choice and don't ask again.\n\nOK  Open in a new tab\n\n## We care about your privacy\n\nWe and our 492 partners store and/or access information on a device, such as\nunique IDs in cookies to process personal data. You may accept or manage your\nchoices by clicking below or at any time in the privacy policy page. These\nchoices will be signaled to our partners and will not affect browsing data.\n\n### We and our partners process data to provide:\n\nUse precise geolocation data. Actively scan device characteristics for\nidentification. Store and/or access information on a device. Personalised\nadvertising and content, advertising and content measurement, audience\nresearch and services development.  List of partners (vendors)\n\nI accept Reject all Show purposes\n\nYour Opt Out Preference Signal is Honored\n\n## About Your Privacy\n\nWe process your data to deliver content or advertisements and measure the\ndelivery of such content or advertisements to extract insights about our\nwebsite. We share this information with our partners on the basis of consent.\nYou may exercise your right to consent, based on a specific purpose below or\nat a partner level in the link under each purpose. These choices will be\nsignaled to our vendors participating in the Transparency and Consent\nFramework.  \nMore information\n\nAllow All\n\n###  Manage Consent Preferences\n\n#### Strictly Necessary Cookies\n\nAlways Active\n\nThese cookies are necessary for the website to function and cannot be switched\noff in our systems. They are usually only set in response to actions made by\nyou which amount to a request for services, such as setting your privacy\npreferences, logging in or filling in forms.    You can set your browser to\nblock or alert you about these cookies, but some parts of the site will not\nthen work. These cookies do not store any personally identifiable information.\n\n#### Functional Cookies\n\nFunctional Cookies\n\nThese cookies enable the website to provide enhanced functionality and\npersonalisation. They may be set by us or by third party providers whose\nservices we have added to our pages.    If you do not allow these cookies then\nsome or all of these services may not function properly.\n\n#### Performance Cookies\n\nPerformance Cookies\n\nThese cookies allow us to count visits and traffic sources so we can measure\nand improve the performance of our site. They help us to know which pages are\nthe most and least popular and see how visitors move around the site.    All\ninformation these cookies collect is aggregated and therefore anonymous. If\nyou do not allow these cookies we will not know when you have visited our\nsite, and will not be able to monitor its performance.\n\n#### Tracking Cookies\n\nTracking Cookies\n\nTracking cookies are text files set by websites on a user’s browser to collect\ndata about the user. They collect data such as clicks, shopping preferences,\ndevice specifications, location, and search history.\n\n#### Targeting Cookies\n\nTargeting Cookies\n\nThese cookies may be set through our site by our advertising partners. They\nmay be used by those companies to build a profile of your interests and show\nyou relevant adverts on other sites.    They do not store directly personal\ninformation, but are based on uniquely identifying your browser and internet\ndevice. If you do not allow these cookies, you will experience less targeted\nadvertising.\n\n#### Store and/or access information on a device 430 partners can use this\npurpose\n\nStore and/or access information on a device\n\nCookies, device or similar online identifiers (e.g. login-based identifiers,\nrandomly assigned identifiers, network based identifiers) together with other\ninformation (e.g. browser type and information, language, screen size,\nsupported technologies etc.) can be stored or read on your device to recognise\nit each time it connects to an app or to a website, for one or several of the\npurposes presented here.\n\nList of IAB Vendors‎ | View Illustrations\n\n#### Personalised advertising and content, advertising and content\nmeasurement, audience research and services development 480 partners can use\nthis purpose\n\nPersonalised advertising and content, advertising and content measurement,\naudience research and services development\n\n  * ##### Use limited data to select advertising 384 partners can use this purpose \n\nSwitch Label\n\nAdvertising presented to you on this service can be based on limited data,\nsuch as the website or app you are using, your non-precise location, your\ndevice type or which content you are (or have been) interacting with (for\nexample, to limit the number of times an ad is presented to you).\n\nView Illustrations\n\n  * ##### Create profiles for personalised advertising 328 partners can use this purpose \n\nSwitch Label\n\nInformation about your activity on this service (such as forms you submit,\ncontent you look at) can be stored and combined with other information about\nyou (for example, information from your previous activity on this service and\nother websites or apps) or similar users. This is then used to build or\nimprove a profile about you (that might include possible interests and\npersonal aspects). Your profile can be used (also later) to present\nadvertising that appears more relevant based on your possible interests by\nthis and other entities.\n\nView Illustrations\n\n  * ##### Use profiles to select personalised advertising 322 partners can use this purpose \n\nSwitch Label\n\nAdvertising presented to you on this service can be based on your advertising\nprofiles, which can reflect your activity on this service or other websites or\napps (like the forms you submit, content you look at), possible interests and\npersonal aspects.\n\nView Illustrations\n\n  * ##### Create profiles to personalise content 128 partners can use this purpose \n\nSwitch Label\n\nInformation about your activity on this service (for instance, forms you\nsubmit, non-advertising content you look at) can be stored and combined with\nother information about you (such as your previous activity on this service or\nother websites or apps) or similar users. This is then used to build or\nimprove a profile about you (which might for example include possible\ninterests and personal aspects). Your profile can be used (also later) to\npresent content that appears more relevant based on your possible interests,\nsuch as by adapting the order in which content is shown to you, so that it is\neven easier for you to find content that matches your interests.\n\nView Illustrations\n\n  * ##### Use profiles to select personalised content 112 partners can use this purpose \n\nSwitch Label\n\nContent presented to you on this service can be based on your content\npersonalisation profiles, which can reflect your activity on this or other\nservices (for instance, the forms you submit, content you look at), possible\ninterests and personal aspects, such as by adapting the order in which content\nis shown to you, so that it is even easier for you to find (non-advertising)\ncontent that matches your interests.\n\nView Illustrations\n\n  * ##### Measure advertising performance 432 partners can use this purpose \n\nSwitch Label\n\nInformation regarding which advertising is presented to you and how you\ninteract with it can be used to determine how well an advert has worked for\nyou or other users and whether the goals of the advertising were reached. For\ninstance, whether you saw an ad, whether you clicked on it, whether it led you\nto buy a product or visit a website, etc. This is very helpful to understand\nthe relevance of advertising campaigns.\n\nView Illustrations\n\n  * ##### Measure content performance 201 partners can use this purpose \n\nSwitch Label\n\nInformation regarding which content is presented to you and how you interact\nwith it can be used to determine whether the (non-advertising) content e.g.\nreached its intended audience and matched your interests. For instance,\nwhether you read an article, watch a video, listen to a podcast or look at a\nproduct description, how long you spent on this service and the web pages you\nvisit etc. This is very helpful to understand the relevance of (non-\nadvertising) content that is shown to you.\n\nView Illustrations\n\n  * ##### Understand audiences through statistics or combinations of data from different sources 285 partners can use this purpose \n\nSwitch Label\n\nReports can be generated based on the combination of data sets (like user\nprofiles, statistics, market research, analytics data) regarding your\ninteractions and those of other users with advertising or (non-advertising)\ncontent to identify common characteristics (for instance, to determine which\ntarget audiences are more receptive to an ad campaign or to certain contents).\n\nView Illustrations\n\n  * ##### Develop and improve services 321 partners can use this purpose \n\nSwitch Label\n\nInformation about your activity on this service, such as your interaction with\nads or content, can be very helpful to improve products and services and to\nbuild new products and services based on user interactions, the type of\naudience, etc. This specific purpose does not include the development or\nimprovement of user profiles and identifiers.\n\nView Illustrations\n\n  * ##### Use limited data to select content 71 partners can use this purpose \n\nSwitch Label\n\nContent presented to you on this service can be based on limited data, such as\nthe website or app you are using, your non-precise location, your device type,\nor which content you are (or have been) interacting with (for example, to\nlimit the number of times a video or an article is presented to you).\n\nView Illustrations\n\nList of IAB Vendors‎\n\n#### Use precise geolocation data 176 partners can use this purpose\n\nUse precise geolocation data\n\nWith your acceptance, your precise location (within a radius of less than 500\nmetres) may be used in support of the purposes explained in this notice.\n\nList of IAB Vendors‎\n\n#### Actively scan device characteristics for identification 70 partners can\nuse this purpose\n\nActively scan device characteristics for identification\n\nWith your acceptance, certain characteristics specific to your device might be\nrequested and used to distinguish it from other devices (such as the installed\nfonts or plugins, the resolution of your screen) in support of the purposes\nexplained in this notice.\n\nList of IAB Vendors‎\n\n#### Ensure security, prevent and detect fraud, and fix errors 319 partners\ncan use this purpose\n\nAlways Active\n\nYour data can be used to monitor for and prevent unusual and possibly\nfraudulent activity (for example, regarding advertising, ad clicks by bots),\nand ensure systems and processes work properly and securely. It can also be\nused to correct any problems you, the publisher or the advertiser may\nencounter in the delivery of content and ads and in your interaction with\nthem.\n\nList of IAB Vendors‎ | View Illustrations\n\n#### Deliver and present advertising and content 306 partners can use this\npurpose\n\nAlways Active\n\nCertain information (like an IP address or device capabilities) is used to\nensure the technical compatibility of the content or advertising, and to\nfacilitate the transmission of the content or ad to your device.\n\nList of IAB Vendors‎ | View Illustrations\n\n#### Match and combine data from other data sources 235 partners can use this\npurpose\n\nAlways Active\n\nInformation about your activity on this service may be matched and combined\nwith other information relating to you and originating from various sources\n(for instance your activity on a separate online service, your use of a\nloyalty card in-store, or your answers to a survey), in support of the\npurposes explained in this notice.\n\nList of IAB Vendors‎\n\n#### Link different devices 221 partners can use this purpose\n\nAlways Active\n\nIn support of the purposes explained in this notice, your device might be\nconsidered as likely linked to other devices that belong to you or your\nhousehold (for instance because you are logged in to the same service on both\nyour phone and your computer, or because you may use the same Internet\nconnection on both devices).\n\nList of IAB Vendors‎\n\n#### Identify devices based on information transmitted automatically 291\npartners can use this purpose\n\nAlways Active\n\nYour device might be distinguished from other devices based on information it\nautomatically sends when accessing the Internet (for instance, the IP address\nof your Internet connection or the type of browser you are using) in support\nof the purposes exposed in this notice.\n\nList of IAB Vendors‎\n\nBack Button\n\n### Cookie List\n\nSearch Icon\n\nFilter Icon\n\nClear\n\ncheckbox label label\n\nApply Cancel\n\nConsent Leg.Interest\n\ncheckbox label label\n\ncheckbox label label\n\ncheckbox label label\n\nReject All Confirm My Choices\n\n",
    "links": "[{\"link\": \"https://www.iqvia.com/\", \"text\": \"\"}, {\"link\": \"https://www.iqvia.com/\", \"text\": \"IQVIA.COM\"}, {\"link\": \"https://www.iqvia.com/locations/united-states/library/fact-sheets/iqvia-brand-analytics-platform\", \"text\": \"United States (English)\"}, {\"link\": \"mailto:?subject=IQVIA Brand Analytics Platform - IQVIA&body=https://www.iqvia.com/locations/united-states/library/fact-sheets/iqvia-brand-analytics-platform\", \"text\": \"email\"}, {\"link\": \"https://www.facebook.com/sharer/sharer.php?u=https://www.iqvia.com/locations/united-states/library/fact-sheets/iqvia-brand-analytics-platform&t=IQVIA Brand Analytics Platform - IQVIA\", \"text\": \"facebook\"}, {\"link\": \"https://twitter.com/intent/tweet?url=https://www.iqvia.com/locations/united-states/library/fact-sheets/iqvia-brand-analytics-platform&text=IQVIA Brand Analytics Platform - IQVIA\", \"text\": \"twitter\"}, {\"link\": \"http://www.linkedin.com/shareArticle?mini=true&url=https://www.iqvia.com/locations/united-states/library/fact-sheets/iqvia-brand-analytics-platform&title=IQVIA Brand Analytics Platform - IQVIA\", \"text\": \"linkedin\"}, {\"link\": \"https://chart.apis.google.com/chart?cht=qr&chs=154x154&chl=https://www.iqvia.com/locations/united-states/library/fact-sheets/iqvia-brand-analytics-platform\", \"text\": \"wechat\"}, {\"link\": \"https://www.xing.com/spi/shares/new?url=https://www.iqvia.com/locations/united-states/library/fact-sheets/iqvia-brand-analytics-platform\", \"text\": \"xing\"}, {\"link\": \"https://www.iqvia.com/-/media/iqvia/pdfs/us/fact-sheet/iqvia-brand-analytics-fact-sheet-2022.pdf\", \"text\": \"\"}, {\"link\": \"https://www.iqvia.com/locations/united-states/library/fact-sheets/iqvia-brand-analytics-platform-data-science-workbench-module\", \"text\": \"\"}, {\"link\": \"https://www.iqvia.com/locations/united-states/library/fact-sheets/iqvia-brand-analytics-platform-data-science-workbench-module\", \"text\": \"IQVIA Brand Analytics Platform— Data Science Workbench Module\"}, {\"link\": \"https://www.iqvia.com/\", \"text\": \"\"}]"
}