{
    "summary": "  * Menu\n\n  * Search for\n\n  * Amazon\n\n    * Opportunities\n      * How to Find a Product to Sell on Amazon\n      * How to Do Amazon Retail Arbitrage\n      * How to Flip Amazon Return Pallets\n      * How to Dropship on Amazon\n      * How to Make Money with Amazon Affiliates\n    * Marketing\n      * How to Create an Amazon Storefront\n      * 14 Ways to Get Amazon Product Reviews\n      * Amazon SEO Guide\n      * Amazon Seller Promotions and Coupon Codes\n      * Amazon PPC Guide\n      * The Ultimate Guide to Amazon EBC\n    * Amazon Shoppers\n      * How to Become an Amazon Product Tester and Get Freebies and Discounts\n      * How to Contact Amazon Customer Service\n      * How to Get Free Amazon Samples\n\n  * Import from China\n\n    * Finding Products\n      * How to Import From China to Sell Profitably in 2024\n      * How to Use Alibaba\n      * How Non-Americans Can Sell Their Products on Amazon FBA\n      * How to Clear Customs\n    * Shipping & Freight\n      * Sea Freight Step by Step Instructions\n      * Shipping Incomterms\n      * FCL Freight vs. LCL Freight\n\n  * Research\n\n    * Amazon\n      * Top 100 Amazon Third-Party Sellers\n      * Amazon Software Winners\n      * The Complete List of Amazon FBA Aggregators in 2023\n      * List of All Amazon Private Label Brands\n      * Annual Amazon Consumer Survey\n      * Canadians Selling on Amazon [2021 Report]\n    * eBay\n      * Top 100 eBay Sellers\n    * Others\n      * Top 50 DTC Canadian Brands To Track In 2023\n\n  * Podcast\n\n  * Latest\n\n  * Premium\n\n  * Search for\n\nHome _/_Blog _/_ How to Use Amazon Brand Analytics the RIGHT WAY\n\nBlog\n\n# How to Use Amazon Brand Analytics the RIGHT WAY\n\nAugust 10, 2019Last Updated: July 19, 2023\n\n5 5 minutes read\n\nIn this post, I'll review one of the most powerful FREE tools Amazon has\nreleased in a long time and why it may be one of the best product and\ncompetitor research tools you'll use.\n\n### Topics Covered\n\n  1. What is Amazon Brand Analytics?\n  2. Amazon Search Terms Report\n  3. Amazon Basket Analysis\n  4. Item Comparison and Alternate Purchase Behavior\n  5. Amazon Demographics\n\n\n\n## What is Amazon Brand Analytics?\n\nAmazon Brand Analytics is a tool that provides insight into your product's\nperformance, customer search behavior, and competitors. Around 2017, Amazon\nemployees started stealing and selling many similar reports that are now\navailable in Amazon Brand Analytics.\n\nOne could say that Amazon Brand Analytics is, arguably, at least a _partial_\nresponse to this problem.\n\n**Related Listening:E178: How Chinese Sellers Are Manipulating Amazon and\nOutsmarting You**\n\nFor better or worse, Amazon Brand Analytics is currently only available to\nBrand Registered Sellers. You access it by going to Reports -> Brand\nAnalytics.\n\nAmazon Brand Analytics gives you access to four primary types of reports:\n\n  * **Amazon Search Terms:** See the overall **rank  **of keywords in terms of volume; see how what percentage of sales and clicks the top three search terms for any keyword gets\n  * **Market Basket Analysis:  **Allows you to see what other items are being purchased  _along  _with your products\n  * **Item Comparison and Alternate Purchase Behavior:  **See the top five _other items_ that customers also viewed along with yours\n  * **Demographics** : Gives an overview of the certain key demographics of your audience.\n\nLet's break each of these reports down a little bit further.\n\n## Amazon Search Terms Report\n\n**What the Amazon Search Terms Report Does:** The Amazon Search Terms report\nis perhaps the most interesting and valuable report within Amazon Brand\nAnalytics. The Search Term Report tells us a numerical rank of the volume of a\nparticular search term AND what percentage of sales and clicks the top three\nitems for that search term get. **You will notice it does NOT tell us the\nactual search volume**.\n\nSo we can see from this report that from April to June 2019 (Q2 2019) the top\nthree search terms were _wireless earbuds_ , _bluetooth headphones,_ and\n_iphone charger_.\n\nWe can also see that the Pasonomi Bluetooth Earbuds were the most purchased\nitem for this search term, being purchased 11.32% of the time.\n\nYou can also type in individual search terms to see how they rank. So we can\nsee that in Q2 2019,  _camping gear_ was the  #556 most frequent search term.\nHowever, we can also generate some great keyword and product ideas. _Kids\ncamping gear_ was the #38,064 searched-for term while _dog camping gear_ was\nthe #73,478 most searched-for term.\n\nYou can also search for a particular ASIN and find out what their most\nimportant search terms are. For instance, for the Jackery Portable Power\nStation we can see some of their top terms are as follows:\n\nThe ASIN report is a bit finicky and inconsistent as it's unclear how exactly\nAmazon is deciding which search terms to show (in our random testing of\nseveral items, many _known_ high-volume keywords for our items were not\nshown).\n\n**Why It's Useful:  **The search term report is incredibly useful for many\nthings:\n\n  * **See Your Market Share:** See what percent of conversions you get for a particular search term and what percentage your competitors are getting.\n  * **See Clickthrough Rates for a Particular Term** : You can see what percentage of the time your competitors are getting clicked, which gives you a solid indication of whether your titles and/or main gallery image can be better optimized to increase click rates.\n  * **Verify Keyword Volume** : Tools like Helium 10 are invaluable for estimating Keyword Volume however, they are only estimations. Before making important business decisions, I verify the volume in Brand Analytics to confirm the estimated numbers make sense (for instance, if Helium 10 reported massive volume for a search term but Amazon Brand Analytics showed it had a search frequency of #150,000 I would be suspicious of Helium 10's numbers).\n  * **Product Research** : Downloading the list of the top 250,000 search terms and/or filtering by keywords in your niche is a great way to find high-volume search terms that may (potentially) not have a lot of competitors.\n\n**Caveats** :\n\n  * **Search Rank, Not Volume** : The Search Term report only shows you the rank of frequency, not volume.\n  * **Only Top Three Products Shown** : The search term report only shows the top three items for a search term so you can't see what percentage of conversions/clicks the #4 ranked item or lower is getting\n  * **ASIN Report Inconsistent** : Want to see the top search terms for an item? Don't rely on Amazon Brand Analytics ‘ ASIN report as it gives inconsistent data.\n\n## Amazon Basket Analysis\n\n**What Amazon Basket Analysis Does:** Amazon basket analysis allows you to see\nwhat other items are being purchased along with your items.\n\n**Why It's Useful:** The Basket Analysis tool is not terribly useful if your\nitems have relatively low sales. Amazon is relying on a lot of customers\npurchasing the same item _along  _with yours to compile the data. For most\nitems though, especially those without natural compliments, there's not enough\nsimilar buying behavior for Amazon to generate meaningful data. If you do have\na high-volume product, however, it may be a good way to generate complementary\nproduct ideas.\n\n**Caveat**\n\n  * **High Volume Product Required** : Your item needs to have a lot of sales volume in order for Amazon to generate meaningful Basket Analysis data.\n\n## Item Comparison and Alternate Purchase Behavior\n\n**What Item Comparison and Alternate Purchase Behavior Does:** This shows the\ntop five _other items_ customers viewed along with your product.\n\n  \nSo in my case, we can see that the Escaper Buddy traction mats were viewed\n7.39% of the time before or after my item was viewed.\n\n**Why It's Useful** : This data isn't terribly useful except for one main\nthing: **these are great ASINs to plugin to aProduct Targeting Campaign within\nAmazon**. The easiest thing to do is to download a CSV of the report and copy\nthe products into a Product Targeting Campaign.\n\n**Caveat**\n\n  * Unlike some of the other reports within Amazon Brand Analytics, the Item Comparison report only allows you to see your items. You cannot look up another ASIN to see what other items are viewed.\n\n## Demographics\n\n**What is Amazon Demographics** : Amazon Demographics gives you an overview of\nparticular demographics of your audience including age, household income,\neducation, gender, and marital status. If you're familiar with Facebook's\nAudience Insight tool, Amazon Demographics is very similar.\n\n**Why It's Useful** : Amazon's Demographics tool is useful for giving some\ninsight into key demographics of your audience. If you don't have a website,\nthis data is intriguing as you probably haven't seen an overview like this\nbefore. However, if you do have a website (with a Facebook pixel) Amazon's\nDemographic data it isn't quite as valuable as Facebook's Audience Insight\ntool gives more detailed and reliable data.\n\n\n\n**Caveat**\n\n  * **Reflects _Purchaser's_ Account, Not Necessarily Customer**: The overall demographics show the demographics of the purchaser's account, not necessarily the customer. For example, I purchase everything on Amazon with my wife's account including my Size 10 Male Soccer Cleats. Amazon's Demographic Data is subsequently not entirely accurate.\n\n\n\n## Conclusion\n\nAmazon Brand Analytics tool is one of my favorite reporting tools within\nSeller Central now. While it doesn't replace other third-party tools like\nHelium 10 or Jungle Scout, it is a nice compliment.\n\nHave you tried using the Amazon Brand Analytics tool? If so, what is your\nfavorite report within it?\n\nTags\n\nAmazon tools brand analytics\n\nAugust 10, 2019Last Updated: July 19, 2023\n\n5 5 minutes read\n\n### Dave Bryant\n\nDave Bryant has been importing from China for over 10 years and has started\nnumerous product brands. He sold his multi-million dollar ecommerce business\nin 2016 and create another 7-figure business within 18 months. He's also a\nformer Amazon warehouse employee of one week.\n\n### Related Articles\n\n### How to Buy & Flip Amazon Pallets (And Not Fail)\n\nJune 27, 2023\n\n### How to Become an Amazon Product Tester and Get Freebies and Discounts\n\nFebruary 9, 2023\n\n### 2024 Buying on Alibaba Guide: How to Get Low Prices & Easy Shipping\n\nJanuary 2, 2022\n\n### How Chinese Sellers are Manipulating Amazon in 2024\n\nAugust 2, 2023\n\n###  5 Comments\n\n  1. **Muhammmad Muneeb Khan** says:\n\nFebruary 19, 2020 at\n\nYou said don’t rely on ASIN search term report, why is that? I have found it\nuseful, actually, when you extract data for an ASIN it shows all phrases on\nwhich this ASIN is ranked on top 3.  \nAnd if it is in the second or third place it will show the competitors ASIN\nthat ranked in that place.\n\nReply\n\n    1. **Dave Bryant** says:\n\nFebruary 20, 2020 at\n\nDefinitely not my experience. Take the Instapot (B01B1VC13K) for example. One\nof the most popular products on Amazon. It shows it ranking in the top 3 for\nonly 67 keywords. Helium 10 shows it ranking for thousands of keywords.\n\nReply\n\n      1. **Jack Cavellier** says:\n\nJuly 5, 2022 at\n\nHey Dave, you mentioned that Amazon Brand Analytics can’t replace a tool like\nHelium 10 or Jungle Scout, why is that the case?\n\nReply\n\n        1. **Dave Bryant** says:\n\nAugust 3, 2022 at\n\nReal search data and for free :)\n\nReply\n\n  2. **Mohib Ullah** says:\n\nDecember 16, 2022 at\n\nWithout Brand register How i can get this sheet is this possible or any\nplatform which they provide Sheets?\n\nReply\n\n### Leave a Reply Cancel reply\n\nYour email address will not be published. Required fields are marked *\n\nComment *\n\nName *\n\nEmail *\n\nWebsite\n\nSave my name, email, and website in this browser for the next time I comment.\n\nΔ\n\nTable of Contents\n\n    * Topics Covered\n  * What is Amazon Brand Analytics?\n  * Amazon Search Terms Report\n  * Amazon Basket Analysis\n  * Item Comparison and Alternate Purchase Behavior\n  * Demographics\n  * Conclusion\n\n###\n\n© Copyright 2024, All Rights Reserved  |  ECC Media Inc.\n\n  * About Us\n  * Resources\n  * Media Kit\n  * Meet the Crew\n  * Premium Login\n  * Sponsorships\n  * Privacy Policy\n  * Affiliate Disclosure\n\n  * Facebook\n  * Twitter\n  * LinkedIn\n  * YouTube\n\nBack to top button\n\nClose\n\nSearch for:\n\nClose\n\nSearch for\n\nClose\n\nSearch for\n\nDO NOT SELL OR SHARE MY INFORMATION\n\n",
    "links": "[{\"link\": \"https://www.ecomcrew.com/chinese-sellers-manipulating-amazon/\", \"text\": \"Amazon employees started stealing and selling many similar reports\"}, {\"link\": \"https://www.ecomcrew.com/e178-how-chinese-sellers-are-manipulating-amazon-and-outsmarting-you/\", \"text\": \"E178: How Chinese Sellers Are Manipulating Amazon and Outsmarting You\"}, {\"link\": \"https://www.ecomcrew.com/amazon-brand-analytics/#comment-21512\", \"text\": \"February 19, 2020 at \"}, {\"link\": \"https://www.ecomcrew.com/amazon-brand-analytics/#comment-21525\", \"text\": \"February 20, 2020 at \"}, {\"link\": \"https://www.ecomcrew.com/amazon-brand-analytics/#comment-48489\", \"text\": \"July 5, 2022 at \"}, {\"link\": \"https://www.ecomcrew.com/amazon-brand-analytics/#comment-49693\", \"text\": \"August 3, 2022 at \"}, {\"link\": \"https://www.ecomcrew.com/amazon-brand-analytics/#comment-53952\", \"text\": \"December 16, 2022 at \"}, {\"link\": \"https://www.ecomcrew.com/amazon-brand-analytics/#respond\", \"text\": \"Cancel reply\"}]"
}