{
    "summary": "bidx-logo\n\n  * Pricing\n  * Success stories\n  * Blog\n  * Support __\n\n  * Login\n  * Try for free\n  * \n\n# Amazon reveals the most searched keywords: Brand Analytics is available!\n\nThe infinite amounts of data created daily by searching and selling via Amazon\nwere previously well guarded information that was only accessible to Amazon\ndealers in the form of click and sales figures for their own products.\nHowever, with the rollout of Brand Analytics a few weeks ago, Amazon has now\ncaused a small sensation. Through this feature, sellers now get an insight\ninto the frequency of search term entries as well as into the relative click\nand sales figures of competing products. With a few \"calculation steps\", even\napproximate statements on search behavior and market data, such as total sales\nfigures of a product on Amazon can be made - at least in part.\n\nIn this blog article we explain what exactly this feature has to offer, why we\nspeak of a small data revolution and how you as a retailer can profit from it.\n\n## What is Amazon Brand Analytics?\n\nBrand Analytics is a feature of Amazon that gives access to customer behavior\nand the most popular search terms within a country and time period. This\nprovides insights into how customers search and which terms are most\nfrequently entered in the Amazon search bar. Since February 2019, Amazon has\nstarted offering this feature in Seller Central free of charge to brand\nowners. Previously, similar data was available through Amazon Retail Analytics\nPremium (ARA Premium or ARAP). However, access via ARAP is very cost-intensive\nat around EUR 30 000 per year and is only possible for vendors.\n\n## Where can I find Brand Analytics?\n\nThe function can be accessed via Seller Central → Reports → Brand Analytics.\nAmazon rolls out this function successively, so that not all sellers can view\nthe menu item yet.\n\nIf you don't have access to it yet, you can open a case in your Seller Central\naccount and Amazon will give you access.\n\n_Access to Brand Analytics in Seller Central_\n\nAccess is conditional on successful participation in Amazon's Brand Registry\nProgramme, i.e. a word or figurative mark registered with the DPMA or EUIPO\nmust exist. Further information on registration can be found here.\n\n## What data does Brand Analytics contain?\n\nThe Brand Analytics Dashboard is currently divided into  **three sections** :\n\n  1. **Amazon Search Terms**  \nDisplay of a ranking of search terms with the three most clicked products\nincluding relative click figures and conversions\n\n  2. **Item Comparison**  \nPresentation of the products that are most frequently viewed together with\nthose of your own brand\n\n  3. **Demographics**  \nEvaluation of the demographic customer characteristics for the own brand\n\n_Brand Analytics Dashboard_\n\n With the data a ranking of the search terms is visible, by which the\nfrequency of entered search terms is recognizable at a glance. Specific\nfigures are not published, but the ranking gives sellers a good idea of which\nsearch terms are entered frequently and which less frequently. For each of\nthese search terms, the three most clicked products are displayed, including\nthe Click Share and the respective Conversion Share.\n\nThe exact meaning of these terms can be read in the next section.\n\nIn addition, Amazon offers the possibility to download these data directly or\nto send them via e-mail as CSV or Excel.  \n\n## Why does Amazon open access to this data?\n\nAmazon probably wants to give sellers a better overview of their current\npositioning through free brand analytics and offer more opportunities for\ntheir own optimization through data on customer behavior and competition. In\naddition, the display of search terms enables sellers to expand their\nadvertised keywords, enabling Amazon to increase its own advertising revenues.\n\n## 1\\. \"Amazon Search Terms\"\n\nIn Brand Analytics, you can categorize reports by country and specify a time\nperiod. For this period, the following data will be displayed in the \"Amazon\nSearch Terms\" section:\n\n### Search Term\n\nThe search term indicates what the customer has entered into Amazon. This can\nbe a single word like \"laptop\" or a half-sentence like \"laptop sleeve in\npink\".\n\nThe following diagram shows the frequency of the number of words entered per\nquery.\n\n_Frequency of the number of words per search query_\n\n### Search Frequency Rank\n\nThe so-called search frequency rank indicates the frequency rank of a search\nterm in your selected period. A search term at rank 1 has been searched more\noften than a term at rank 3. Brand Analytics does not show the exact search\nvolume, i.e. the actual number of searches for a certain term, but the rank is\nstill of great value to see what exactly customers enter into the search\nfield. This information was not previously available by Amazon and could only\nbe estimated through PPC campaigns and evaluation.\n\n**Filter by category and time period**  \nThe filter function by category is very advantageous and practical for your\nown campaign optimization regarding PPC management. This allows the search\nfrequency rank to be displayed exclusively for a \"department\" of Amazon and\nthus the relevance of keywords for a specific category to be determined.\n\n_Brand Analytics Filters by Category_\n\nBy selecting and comparing different time periods, seasonal differences in\nkeyword relevance can also be examined.\n\n**Search function**  \nThe search function is also very helpful for determining the relevance of\ndifferent keywords for a specific product at a glance. By searching for a term\nin Brand Analytics, further terms from this root word are listed with\ncorresponding rank. This information is of great value in keyword research and\nplanning for PPC campaigns.\n\n_Brand Analytics Search Function_\n\nBefore the introduction of this feature, keyword relevance could only be\ndetermined via the auto-completion function in the Amazon search bar. The\nautomatically completed search terms are displayed there in descending order\nof relevance and thus also allow an assessment of the frequency of search term\nentries - at least within a word stem.\n\n**Restrictions**  \nAlthough the display of the search frequency rank is very valuable for the\noptimization of PPC campaigns, it should be kept in mind that especially in\nthe long-tail area many search terms and therefore keywords are not captured.\nThe number of search terms displayed in Brand Analytics varies depending on\nthe period entered. On average, about 350,000 - 400,000 search terms are\nlisted. However, depending on the absolute search volume of individual search\nterms in certain periods, the number can increase significantly.\n\n### #1 Clicked ASIN\n\nThis field shows the ASIN, i.e. the product that received the most clicks\nafter entering the specified search term.\n\nBut: This field does not necessarily mean that the product was on top of the\nsearch results page. Instead, it accumulates the organic and advertised\nclicks.\n\n### #1 Product Title\n\nThis is the product title of the #1 clicked ASIN.\n\n### #1 Click Share\n\nThe so-called Click Share is the percentage of clicks for the #1 clicked ASIN\nand this search term. The percentage results from the total number of clicks\nthat were made by customers when they entered this search term.\n\n**_Example:_** _  \nIf customers enter the search term \"belt\" and then a total of 2,000 clicks\nwere made on various (belt) products and our product #1 received 500 clicks of\nthis, the click percentage for product #1 for the search term \"belt\" would be\n500/2000=25%_\n\n**Attention:**  \nDifference between the German term \"Klickrate\" (Click Share) in Brand\nAnalytics and \"Klickrate\" (Click Rate) in Seller Central!\n\nThe Click Share is the proportion of clicks of the #1 product compared to the\ntotal number of clicks generated by the respective keyword search. The Click\nRate in PPC Management is the ratio of clicks to impressions (CTR = Click\nThrough Rate) → This is only about your own product.\n\n### #1 Conversion Share\n\nThe Conversion Share represents the percentage of total sales that the #1\nClicked ASIN has received for the search term entered.\n\n**_Example:_** _  \nIf after entering the search term \"belt\", a total of 1,000 sales were achieved\nand 100 times our product #1 was sold, the Conversion Share would be 10%._\n\n_It is therefore possible that the most frequently clicked ASINs do not\nachieve the most conversions (orders) for the specified search term._\n\n### #2 & #3 ASINs\n\nAmazon also displays the Click and Conversion Shares for the second and third\nmost clicked ASINs (on search term level).\n\n_Extract from Brand Analytics_\n\n## 2\\. \"Item Comparison\"\n\nIn addition to the Amazon Search Terms, two further areas in Brand Analytics\nwere added a few weeks ago.\n\nOne of these areas is \" **Item Comparison** \", which was rolled out in\nMarch/April.\n\nThis makes it possible to identify the products that were most frequently\nviewed together with one's own. In addition, the relative number of views that\nwere made on the same day (24-hour period) together with the own product views\ncan be determined and a statement on the relevance of different competitor\nproducts can be made.\n\nThe long-term analysis and evaluation of this data may even reveal the\nimportance of product differentiation or diversification.  \n\n## 3\\. \"Demographics\"\n\nThe \" **Demographics** \" division was rolled out approximately at the same\ntime as \"Item Comparison\". This makes it possible to display five demographic\ncharacteristics of your customers:\n\n  * Age\n  * Household Income\n  * Education\n  * Gender\n  * Marital Status\n\nThis information can also be valuable beyond PPC campaigns for the\noptimization of advertising measures. For example, it can be analyzed whether\nthe target group that is to be reached with your own products and marketing\nalso reflects the actual buyers on Amazon. If it does not do this, the\nmarketing orientation should possibly be reconsidered.\n\n## Your benefit of Brand Analytics for PPC campaigns\n\nBy displaying the frequency of search terms, it is possible to estimate the\nrelevance of individual keywords for PPC campaigns. Until now, this could only\nbe determined by the automatic suggestions in the search bar. However, keyword\ncomparisons regarding their relevance were only possible within one word stem.\nAmazon now significantly simplifies keyword evaluation and optimization of\nyour PPC campaigns with Brand Analytics.\n\nBidX analyzes and optimizes your PPC campaigns continuously. This saves you\nvaluable time and resources. Convince yourself!\n\nThe following diagram shows how important this optimization and a good\nvisibility on Amazon is.\n\nOn average, the three most clicked products receive 71% of the total clicks\ngenerated when entering a search term.\n\nInteresting: On average, these three most clicked products also account for\n66% of total sales triggered by a search term!\n\n_Click Share and Conversion Share of the three most clicked ASINs_\n\nYou can also compare yourself with the competition and see at a glance the\ncompetition product that generated the most clicks.\n\nIf you are in the top 3 of the most clicked products on keyword level with one\nof your products, you can derive more interesting information from the\nConversion Share and Click Share!\n\nThe following example demonstrates this.\n\n**_Example for an approximate calculation of the total sales on Amazon after\nentering a search term:_**\n\n_You sell belts via Amazon and use PPC campaigns to increase your sales\nfigures. Through Brand Analytics you can see that one of your products in\nFebruary is the second most clicked product for the search term \"brown belt\"\nand has a Conversion Share of 40%. This product was continuously found as a\nsponsored ad (SPA) with high bids for this keyword in February on the first\nsearch results page.  _\n\n→ in Seller Central you can see that in February you made 100 sales with your\nSponsored Product Ads (SPAs) using the keyword \"brown belt\".\n\n→ the Conversion Share of 40% refers to both organic and sponsored sales\n\n→ by taking a look at your product's own sales figures, you can determine a\nfactor that represents the ratio of organic to sponsored products → Total\norders / orders via SPAs\n\n(If 300 total orders and 150 orders have been placed via SPAs, the factor is\ncorrespondingly 2)\n\n→ we assume that the ratio of organic to sponsored product orders also applies\nto orders at keyword level, i.e. for our example, the 100 belts sold via\nadvertising were also sold organically via the keyword \"brown belt\".\n\n→ if you multiply the factor 2 with your 100 sponsored sales, you will get the\napproximate number of your own total sales via the term \"brown belt\": in our\nexample 2 x 100 = 200 sales\n\n→ the Conversion Share of 40% represents approx. 200 sales\n\n→ with this, a total sales figure of approx. 500 can be estimated\n\n→ means: approx. 500 products were sold on Amazon after entering the search\nterm \"brown belt\"\n\n**_Note:_**  \nSince the ratio of organic to sponsored sales at keyword level is different\nfor each keyword (depending on the SPA playout through individual keyword\nbids), the figures determined can only represent rough values. Nevertheless,\nthese approximate values provide a good insight into the magnitude of the\nabsolute sales figures. The more often the SPA was played out on page 1 of the\nresults list for all keywords in the period examined, the more the calculated\nabsolute figures reflect the actual figures in practice.\n\nSo if your product appears in the keyword rankings, you can get valuable\ninsights from brand analytics, which you can hardly gain in the usual way and\neven through your PPC campaigns.\n\nThe following two  **cases  **illustrate the benefit of the data:\n\n  * If your Conversion Share is higher than the Click Share, this can mean that your product meets the expectations of your customers more than the products of your competitors.\n\n> **Our tip:**  \n>  Even if your product is the #1 most clicked product and your Conversion\n> Share is higher than your Click Share, it doesn't mean that your product\n> also has the highest Conversion Share compared to competing products.\n\n  * The other way around can be said: If the Click Share is very high, but the Conversion Share is low, you should urgently compare your product with those of your competitors and find out what customers might like more about the higher ranked products than about your own: Are you more expensive, of inferior quality, or are ratings, presentations or descriptions in need of improvement?\n\nThis is probably the biggest potential of the feature: You can constantly\ncompare yourself with brands whose products convert better and thereby\nincrease your own sales. In addition, it helps you to optimize your PPC\ncampaigns. If a product is sponsored and the Conversion Share is worse than\nthat of the competing products, even though it shows high Click Shares, you\ncan search directly for the reason and reduce the sponsoring first in order\nnot to \"waste\" your advertising budget.\n\n> **Our tip:**  \n>  With regard to your PPC campaigns, it is important that a search term with\n> a high rank does not necessarily convert excellently as a keyword for your\n> products. Keywords with little traffic may perform successfully for a\n> particular product and those with a lot of traffic may generate a high cost\n> per click (CPC) as they are likely to bring a lot of competition.  \n> A regular performance analysis and corresponding adjustments of your PPC\n> campaigns are therefore still the best method to secure suitable, individual\n> and successful keywords for your products and to make them visible for your\n> customers.\n\nIt will be exciting to see what other Amazon functions and features will be\nrolled out in the coming months. Follow us on facebook to stay up to date and\ninformed!\n\nBy Selina Krüger\n\npublished:  \nTue, May 21, '19\n\n  * Brand Analytics\n  * Amazon Keywords\n\n##  Related Posts\n\nBlog\n\n##  Sponsored Display Ads: All you need to know\n\nMon, Oct 12, '20\n\nBlog\n\n##  Brand protection on Amazon - How to protect your brand\n\nThu, Oct 27, '22\n\nBlog\n\n##  The best way to use Sponsored Brands\n\nMon, Feb 21, '22\n\nbidx-logo\n\nLanguage\n\n  * Deutsch \n  * English \n\n________\n\n###### BidX\n\n  * Home\n  * Pricing\n  *   *   * Support\n  * Release Notes\n\n###### About Us\n\n  * Team\n  * Career\n  * Press\n  * Partner\n\n###### Legal\n\n  * Imprint\n  * Privacy\n  * Terms\n\n###### Contact\n\nhello@bidx.io  \n+49 6151 152 40 60\n\n  *   *   *   * \n\n",
    "links": "[{\"link\": \"https://www.bidx.io/blog/brand-analytics\", \"text\": \"\"}]"
}