{
    "summary": "Skip to content\n\n__\n\n  * Services \n\n__\n\n####  Amazon\n\n    * Amazon Account Management \n\n    * Amazon Advertising \n\n    * Amazon DSP Advertising \n\n    * Amazon SEO \n\n    * Amazon A+ Content & Design \n\n    * Amazon Listing Optimization \n\n    * Amazon Vendor Recovery Services \n\n    * Amazon Seller Analytics \n\n####  Walmart\n\n    * Walmart Account Management \n\n    * Walmart Advertising \n\n    * Walmart SEO \n\n#### Full Service Growth Agency\n\nbeBOLD is an extension of your beauty business and truly a partner – not just\nanother agency.\n\nSchedule a Call Today\n\n  * Our Expertise \n\n__\n\n    * Beauty \n  * Company \n\n__\n\n    * Our Team \n    * Careers \n    * Reviews \n  * Case Studies\n  * Blog\n\nBook a Call\n\n**I hope you enjoy reading this blog post.**\n\nIf you want my team to grow your Amazon & Walmart brand, click here.\n\n# Amazon Brand Analytics in Vendor Central Explained 2024\n\nBlog  /  Amazon Brand Analytics in Vendor Central Explained 2024\n\nAmazon Vendor Analytics Tutorial: A step-by-step guide to help you understand\nAnalytics & Reports.\n\n**Free 14-Day-Trial of beBOLD Analytics**  \nfor Amazon Vendor & Seller, Walmart and more >>\n\nGetting to grips with the nuances of Vendor Central is no easy feat.  It’s a\ncomplex platform with hyper-specific data points and terminology.  Failing to\nunderstand Amazon vendor central reports will negatively impact your brand’s\nrelationship with Amazon, the integrity of your catalog on the marketplace, as\nwell as your channel profitability, market share, and revenue.\n\n## The Amazon Brand Analytics dashboard is divided into three main sections:\n\n  1. Sales and Traffic\n  2. Operations\n  3. Consumer Behavior\n\n## Amazon Vendor Central Analytics: A Brief Overview\n\nAll the data you need to know about your Amazon vendor listing is right in\nfront of you. However, AWS lacks a user-friendly interface, making navigation\nand analytics very difficult. This is thanks to the fact that AWS was first\ndeveloped as a platform for internal use only.\n\nWith little to no training, Vendor Central can be frustratingly complicated –\neven for experienced eCommerce professionals. This is why we’ve compiled this\nresource to help you navigate Vendor Central’s back end like a pro.\n\n## ARA (Amazon Retail Analytics) Basic\n\nAmazon has recently announced that several new features will be added to the\nfree version of its Amazon Retail Analytics (ARA) tool. This is great news for\nbrands who have previously relied on basic ARA, as it offers a much more\nrobust feature set.\n\nBasic Amazon Retail Analytics subscribers will now be granted access to the\nfollowing:\n\n  * Historical sales data (up to 90 days)\n  * Search terms reports\n  * Brand loyalty reports\n  * Product performance reports\n\n## **ARA** (Amazon Retail Analytics) **Premium  **\n\nAmazon Retail Analytics Premium is a suite of additional reports beyond what\nis available in Amazon Retail Analytics (ARA) Basic. ARA Premium includes all\nthe functionality of ARA Basic, as well as new features that give you greater\nvisibility into historical and real-time sales performance.\n\nAs a prerequisite to keeping this reporting, a vendor must enroll in Brand\nRegistry or they will lose access.\n\nHighlights of Amazon Vendor Central Reports include:\n\n  * Past 90 days of data updated daily\n  * Customizable date range, with up to 12 months of data\n  * Filters by categories, brands, ASINs, item condition and more\n  * Ability to download reports into Excel or CSV formats for further analysis\n  * Reports on top-selling items by category or brand\n  * Reports on items in your catalog that are included in Amazon’s Top 100 Most Wished For & Gifted lists\n  * Reports that show which products have seen an increase in sales velocity over the last 30 days and which have decreased over the same time period\n\n## Amazon Vendor Central Reports\n\nAmazon Analytics for vender central provides you with access to more than 15\nhigh-level reports with an ability to deep-dive specific parts to expand the\nnumber of reports to above 30.\n\nThe Analytics reports cover in-depth sales, marketing, operations, customer\nbehavior and enhanced trends that enable you to make more informed business\ndecisions.\n\nThis will help you to optimize your retail strategy, assess your market share,\nidentify new opportunities, and monitor factors that impact sales. Data is\ngenerally available in Amazon store analytics within 72 hours of the close of\na given period.\n\nThe key features of the Vendor Central Analytics are:\n\n  * Pre-Orders Data: Measure your pre-order sales by product and state to get early signals of demand.\n  * Search Terms: See how customers (in aggregate) are finding your products and other products on Amazon, including each product's relative search popularity, click share, and conversion share.\n  * Alternate Purchase: View which products Amazon customers (in aggregate) most frequently purchased on the same day they viewed your products but did not purchase.\n  * Market Basket Analysis: Learn what other products are purchased along with your products.\n\nYou can find Brand Analytics under the Reports tab in Vendor Central. This\nfeature is only available if you own your brand, and are responsible for\nselling the brand on Amazon. You must also be internal to the brand and not a\nthird party company supporting the brand.\n\nIf you don't have access to Brand Analytics in your Vendor Central account\nthen you have not been identified as a vendor and brand owner who meets the\nBrand Registry criteria.\n\na. To be sure, check with your Amazon Vendor Central account manager (you may\nnot have one)\n\nb. If you are not registered, the first step as a brand owner is to apply for\nthe Brand Registry.\n\n**Free 14-Day-Trial of beBOLD Analytics**  \nfor Amazon Vendor & Seller, Walmart and more >>\n\n## Sales and Traffic (Amazon Vendor Central)\n\n### **Sales Diagnostic Report**\n\n****\n\nBy using the Sales Diagnostic report, you can quickly identify which factors\ncontributed to sales performance. The report shows the dollar amount and\npercentage change in sales for the selected period.\n\nIf you’re monitoring real time sales data, you can use this report to\nunderstand what is contributing to sales performance. The following example\nshows a summary of the year-to-date data for a specific product.\n\nThe first column shows the percentage change of each item compared with the\nsame period last year. The second column shows the dollar amount change for\neach item compared with the same period (week, month, quarter or year).\n\n### **Sales Performance Trends Report**\n\nThis report in the amazon vendor central reports provides a quick view of your\nsales performance, trends over time and sell through rate.\n\nUse the Date Range selector to select the period of time you'd like to view\nyour sales performance for. Note that your data will be available as early as\nJan 1, 2018.\n\n  * The Sales Performance Trends card provides insight into the following key performance indicators (KPIs):\n  * Sales revenue: Your total sales revenue for the selected time period.\n  * Units sold: The total number of units sold for the selected time period.\n\nAverage selling price: The average selling price of all products sold during\nthe selected time period. You can use this metric to compare how much revenue\nis being generated on average per product, helping you identify which products\nare driving revenue growth.\n\nGlance views: The total number of glance views on all your products during the\nselected time period.\n\nGlance views represent an important first step in the buying journey and may\nindicate a customer's interest in a product, but there's no guarantee that a\nglance view will result in a purchase. Use this metric to track general\ninterest in your products and compare it to other KPIs such as conversion rate\nchange, which indicates whether or not that interest is translating into sales\nor not.\n\n### Geographic Sales Insights Report\n\nThe report gives information on the state, city and ZIP where your products\ngot shipped.\n\nGeographic Sales Insights is available in Seller Central's Reports section.\n\nChoose a date range. You can select the last 30 days or create a custom date\nrange of up to 3 months (90 days).\n\nYou can filter the results by sales channel and select to see either all U.S.\norders or orders from a specific State, City or Zip code.\n\nYou can sort the results by clicking on one of the headers for \"State,\"\n\"City,\" \"Zip Code,\" \"Orders\" and \"Sales.\"\n\n### **Net PPM (Net Pure Product Margin) Report**\n\nWith just a few clicks, the new Net PPM report will show you your top products\nbased on gross revenue and net profit. This is a great tool for identifying\nwhich products are really working for you and which you might want to consider\nre-evaluating.\n\nThe report is easy to read and gives you product information at a glance\nincluding:\n\n  * Net PPM (Net Pure Product Margin - margin after cost of goods sold and various agreed services such as damage allowance are deducted. Note: any sales discounts are not factored in)\n  * Percentage of Total\n  * Prior Period\n  * Previous Year\n\n### **Pre-Orders Report**\n\nPre-orders can be a great way to kick up sales weeks or months before your new\nproduct hits the shelves. But they also can be a trap, sucking up marketing\nresources and inventory space that could be used on more productive\npromotions. Effectively manage new product releases by closely monitoring pre-\norder performance.\n\n### **Traffic Diagnostic Report**\n\nThis dashboard provides a quick, at-a-glance view of changes in performance\nand industry benchmarking for your brand's products on Amazon.com. It also\noffers a detailed view of your conversion metrics, so you can see where to\nfocus your efforts. You can identify changes by comparing performance from the\ncurrent period to the previous period or the same time last year.\n\nQuickly identify changes in glance views and conversion by viewing prior\nperiod, previous year, and industry benchmark.\n\n  * Glance views help customers determine if your product is relevant to their search.\n  * Conversion helps customers decide whether to buy your product or move on to the next search result.\n  * Glance views and conversions are a key indicator of whether your ads are driving interest in your product.\n  * Glance view rate is the percentage of customers who view your product details after clicking on your ad.\n  * Conversion rate is the percentage of customers who buy your product after viewing the details page.\n\n### **Real Time Sales Report  **\n\nThe Real Time Sales page displays real-time sales data for a specific ASIN\nover the last 24 hours. It also shows how the current day's sales compare to\nprevious days to gauge Amazon sales performance trends.\n\nReal Time Sales provides a snapshot of your product's sales over the last 24\nhours. You can use this information to see how your product is performing and\nto make decisions about how you want to sell it.\n\nBy default, data is shown in UTC time. You can change the time zone that is\ndisplayed on the page by clicking on the time zone settings link above the\ngraph.\n\n## **Operations Dashboard (Vendor Central)**\n\n### **Forecast and Inventory Planning Report**\n\nPrevent replenishable out of stock revenue losses with data-driven inventory\nplanning that shows how much inventory Amazon will be ordering in the upcoming\nperiod. There are 4 types of forecast:\n\n  * Mean Forecast: Amazon’s best estimate of customer demand\n  * P70 Forecast: Means there is a 70% chance Amazon will purchase the level of demand indicated or less and a 30% chance they will purchase more.\n  * P80 Forecast: Means there is a 80% chance Amazon will purchase the level of demand indicated or less and a 20% chance they will purchase more.\n  * P90 Forecast: Means there is a 90% chance Amazon will purchase the level of demand indicated or less and a 10% chance they will purchase more.\n\n### **  Inventory Health Report**\n\n### ****\n\nMonitor the inventory health of your products through weekly updates – this\nallows you to quickly identify and respond to unfavorable trends. The most\nimportant KPIs to analyze include Sell-Through Rate, Sellable On Hand\nInventory and Open Purchase Order Quantity.\n\nSell Through Rate (STR) is the percentage of inventory sold over a given\nperiod of time relative to the total amount of inventory available for sale\nduring that period. STR = Sold Units / Total Units Available for Sale\n\nSellable On Hand Inventory is the total number of units that can be sold on\nAmazon.com, including both inbound inventory and existing on-hand inventory in\nour fulfillment centers.  Maintaining your inventory health through data\ndriven inventory planning is vital to success on Amazon.\n\nOpen Purchase Order Quantity is the total number of units which are reserved\nfor your active purchase orders from your suppliers but have not yet been\nreceived by our fulfillment centers.\n\n## **Consumer Behavior Dashboard (Amazon Vendor Central)**\n\n### **Amazon Search Terms Report**\n\nThe Amazon analytics search terms dashboard gives you a window into the mind\nof your customers. Discover what products are winning the most clicks and\nconversions on strategic search terms. Assess the impact of your marketing\ncampaigns, watch for seasonal trends, and identify opportunities to improve\nyour own product page's visibility and conversion rate.\n\nThis dashboard is designed to help you understand where your product ranks and\nwhat it takes to climb that ladder. The keyword filter allows you to monitor\nspecific keywords or keywords related to a specific product, category or\nbrand.\n\nYou can also discover which keywords have high conversion rates but low sales\nvolume, so you can focus on improving visibility for those keywords. By\nfiltering for keywords with high conversion rates but low sales volume (in\nother words, low ranking), you can identify opportunities where small changes\non your product page could lead to significant improvements in sales.\n\nFor example, if you want to sell more cases of wine online, you can leverage\nthis tool by filtering by the keyword \"wine.\" You'll discover that \"wine\nbottle covers\" has a 100% conversion rate but only one sale in the last 30\ndays. In comparison, \"wine glasses\" has only a 25% conversion rate with 516\nsales over the 30-day period. This suggests that shoppers who\n\n### **Repeat Purchase Behavior Report**\n\nAs a seller on Amazon, you can use the repeat purchase behavior analysis to\ngain insight into how customers are interacting with your products. This\ninformation can help you identify where to focus your marketing efforts so\nthat you can optimize both repeat customers and new customer acquisition.\n\nThe repeat purchase behavior analysis displays the number of orders from\nunique customers compared to the number of orders from repeat customers. The\nreport shows these metrics over time, segmented by country and product group.\n\nAn order is considered repeated if it follows an order by the same customer\nwithin a 90-day period. If a customer places another order more than 90 days\nlater, that order is considered a first-time order. This calculation is based\non the date when Amazon processes the payment for an order (the \"order date\")\nrather than when the customer places an order.\n\n### **Market Basket Analysis Report**\n\nIdentify cross-selling and bundling opportunities by gaining insight on\nproducts that are being purchased together by your customers.\n\nMarket Basket Analysis section gives you the ability to identify cross-selling\nand bundling opportunities by gaining insight on products that are being\npurchased together by your customers. The reports surface associations between\nyour brands’ products and other products, helping you identify items that are\nfrequently purchased together.\n\nDuring the shopping process, customers typically check out multiple items in a\nsingle transaction. The basket analysis is a statistical method that helps you\nunderstand the associations between these products in order to optimize and\nenhance your marketing efforts.\n\nBy analyzing which products were purchased together and when, you can achieve\na better understanding of what consumers want and can then potentially\nposition new offerings to meet their needs. For example, you might find that\nyour bike accessory is often purchased along with a specific bike helmet.\n\nThis information helps you dedicate resources more efficiently as well as\ncreate better promotions (e.g., bundling). Market basket analysis also gives\nyou insight into which products are bought most frequently, which enables you\nto better staff customer service representatives to handle questions about\nhigh volume items.\n\n### **  Item Comparison and Alternate Purchase Behavior Report**\n\n### ****\n\nUpdate: From June 30, 2022, these amazon vendor central reports will no longer\nbe available.\n\nThese two new reports that Amazon is rolling out to help sellers understand\nhow customers are interacting with the products on their site. They’re similar\nin that they look at how customers move from one product to another, but they\ntake different approaches:\n\nItem comparison in the Amazon vendor central reports shows you how often your\nproduct is viewed alongside other products. Use this report to see if your\nproducts are frequently compared to others, or if there’s a competitor you\nshould be keeping a close eye on.\n\nAlternate purchase behavior looks at which products customers add to their\ncart after viewing yours, and which ones they actually buy. Use this report to\nsee if there are other products you should be considering selling, or if the\nitems that you sell have very different add-to-cart and purchase rates.\n\n### **Demographics Report**\n\nThe Demographics report enables brands to view the types of customers that\nhave purchased their brand's products on Amazon. Data from the Demographics\nreport can help brands connect with their target audience more effectively or\nidentify customization opportunities.\n\nDemographic data is collected through Amazon Retail and based on customer\norders for your brand's products. For example, if someone purchases a product\nfrom your brand, but doesn't create an account, we use information such as\nshipping address to assign an age, gender, and location-based demographic to\nthat order. We then extrapolate out based on the total number of orders to\nmake predictions about your target audience.\n\nData points include Age, Household Income, Education, Gender and Marital\nStatus. The data may not be available for some brands due to small sample\nsizes or because certain demographics are not present in the brand's target\naudience.\n\n## Amazon Vendor Analytics: Frequently Asked Questions\n\n### What is the Best Amazon Brand Analytics Tools?\n\nIf you are looking for Amazon Vendor Reporting software to replace Amazon\nBrand Analytics or ARA Premium - you need to check out the beBOLD Global\nVendor Reporting Analytics software.  beBOLD iis more powerful version of the\nAmazon analytics tools using in Amazon com vendor central.\n\n### What is Amazon Retail Analytics?\n\nAmazon Brand Analytics (formerly known as Amazon Retail Analytics or ARA)\nPremium for Vendor Central is an add-on suite of additional reports which\nVendors have access to through Vendor Central. These reports provide\ninformation regarding: Customer Behavior. Sales. Geographic Performance.\n\n### **What happened to the Amazon Vendor Sales Performance Trends Report?**\n\nAmazon removed this report in  April 2022 and we all users were told to use\nSales Diagnostic report found Brand Analytics > Sales and Traffic Dashboards >\nSales Diagnostic.\n\n### Where did Geographic Sales Insights Report in Vendor Brand Analytics go?\n\nAmazon removed this report in April 2022 without any future plans of bringing\nback that report from the date this blog article was published.\n\n### Where did Item Comparison & Alternate Purchase Behavior Dashboard go?\n\nAmazon removed Item Comparison & Alternate Purchase Behavior Dashboard in\nAmazon Brand Analytics in June 2022 without any future plans of bringing back\nthat report from the date this blog article was published.\n\n**Attention:** BeBOLD helps beauty brands grow on markets like Amazon and\nWalmart by leveraging its expertise in the digital beauty space.\n\n**Interest:** You say you want to expand your brand's footprint in new\nmarkets, but you don't have time to do it alone? Let BeBOLD help you. If\nyou're looking for a partner who has 60 years of experience in the beauty\nindustry, look no further.\n\n**Desire:** If you're looking for more information on what BeBOLD can do for\nyour brand, contact us now. We're ready to chat!\n\n**Action:** Talk to us today to learn more about how we can help your brand\ngrow.\n\n\n\n**Free 14-Day-Trial of beBOLD Analytics**  \nfor Amazon Vendor & Seller, Walmart and more >>\n\n\n\n##  Comments\n\nFirst Name*\n\nLast Name\n\nEmail*\n\nWebsite\n\nComment*\n\n## Do you want **more growth?**\n\nHey, we are beBOLD.   We are determined to make your Amazon & Walmart business\ngrow.  Our only question is, will it be yours business?\n\n###\n\n### About Denny Smolinski\n\nHe is the CEO and founder of beBOLD Digital - A Full-Service Amazon and\nWalmart agency that focuses on Sustainable Growth and Profitability for Our\nPartners (clients).\n\nDenny has been selling on Amazon since 2007 and has had to adapt for every\nchange that Amazon has made along the way.   Amazon and Walmart are an ever\nchanging environment and Denny has his beBOLD team ready to handle any and\nevery challenge.\n\nIs your brand having challenges with growth, profitability, advertising,\nreporting etc - If yes, please contact us today!\n\nSchedule a Call Today\n\n## Agency Services\n\n  * Amazon Account Management \n  * Amazon Advertising \n  * Amazon DSP Advertising \n  * Amazon SEO \n  * Amazon A+ Content \n  * Amazon Listing Optimization \n  * Walmart Account Management \n\n## Case Studies\n\n  * Premium Beauty Brand 262% Growth \n  * Sephora Brand 40% Overall Growth \n  * Recovered $325,000 from Amazon Vendor Chargebacks \n\n## Do you want **more growth?**\n\nHey, we are beBOLD.   We are determined to make your Amazon & Walmart business\ngrow.  Our only question is, will it be yours business?\n\n###\n\n## Latest posts\n\nBrowse all articles\n\nDec 28, 2023\n\n#### New Era of Influencer Marketing with Amazon's Creator Connections 2024\n\nRead more\n\nNov 05, 2023\n\n#### Amazon FBA vs. FBM: Which Method Is Best for Your Business?\n\nRead more\n\nNov 03, 2023\n\n#### How to Use Amazon Brand Analytics for Your Sales Strategy\n\nRead more\n\nAmazon & Walmart Full Service Digital Agency\n\n\n\n##### Services\n\nAmazon Account Management\n\nAmazon Advertising\n\nAmazon DSP Advertising\n\nAmazon SEO\n\nAmazon A+ Content & Design\n\nAmazon Listing Optimization\n\nAmazon Vendor Recovery Services\n\nAmazon Seller Analytics\n\n##### Category Management\n\nPremium Beauty  \nBaby  \nGrocery  \nHealth and Wellness  \nSexual Wellness\n\n##### Company\n\nOur Team  \nCareers  \nAmazon Agency Reviews  \nPrivacy Policy\n\n##### Resources\n\nCase Studies  \nBlog\n\nCopyright 2023 © beBOLD Digital\n\n",
    "links": "[{\"link\": \"https://www.bebolddigital.com/blog/amazon-vendor-central-reporting-software\", \"text\": \"Amazon Vendor Central Reports\"}, {\"link\": \"https://www.bebolddigital.com/blog/new-amazon-vendor-retail-analytics-experience-july-2022\", \"text\": \"Amazon store analytics\"}, {\"link\": \"https://www.bebolddigital.com/blog/amazon-hybrid-selling-seller-central-vendor-central\", \"text\": \"Amazon Vendor Central account\"}, {\"link\": \"https://www.bebolddigital.com/blog/changes-to-amazon-brand-analytics-dashboard\", \"text\": \"amazon vendor central reports \"}, {\"link\": \"https://www.bebolddigital.com/blog/new-amazon-vendor-retail-analytics-experience-july-2022\", \"text\": \"Amazon Retail Analytics\"}, {\"link\": \"https://www.bebolddigital.com/blog/changes-to-amazon-brand-analytics-dashboard\", \"text\": \"Item Comparison & Alternate Purchase Behavior Dashboard\"}]"
}