{
    "summary": "Books Articles Newsletter Quotes Speaking\n\nMenu Close\n\nAbout\n\nBooks Articles Newsletter Quotes Speaking About\n\n# The Ultimate Habit Tracker Guide: Why and How to Track Your Habits\n\nwritten by James Clear\n\nHabits\n\n_This article includes an excerpt fromAtomic Habits, my New York Times\nbestselling book._\n\nIf you want to stick with a habit for good, one simple and effective thing you\ncan do is keep a habit tracker.\n\nHere’s why:\n\nElite performers will often measure, quantify, and track their progress in\nvarious ways. Each little measurement provides feedback. It offers a signal of\nwhether they are making progress or need to change course.\n\nGabrielle Hamilton, a chef in New York City, provides a good example. During\nan interview with the _New York Times_ , she said, “The one thing I see that\nconsistently separates the chef from the home cook is that we taste\neverything, all the time, before we commit it to the dish, right down to the\ngrains of salt. We slurp shot glasses of olive oil and aerate them in our\nmouths as if it were a wine we were trying to know. We taste the lamb, the\nfish, the butter, the milk before we use it… we chew salt to see how we like\nit in our teeth, on our tongues, and to know its flavor, its salinity.”\n\nFor the chef, tasting the ingredients tells them whether they are making\nprogress toward their desired end goal. It provides the immediate feedback\nthey need to get the recipe _just right_.\n\nLike a chef improving a recipe through trial and error, we often improve our\nhabits through trial and error. If one approach doesn’t deliver the desired\neffect, then we adjust—like a chef tweaking the amount of an ingredient.\n\nHowever, there is an important difference between getting feedback while\ncooking a meal and getting feedback while building a habit. When it comes to\nbuilding a habit, feedback is often delayed. It’s easy to taste an ingredient\nor to watch bread rise in the oven. But it can be difficult to visualize the\nprogress you are making with your habits. Perhaps you’ve been running for a\nmonth, but you still don’t see a change in your body. Or maybe you managed to\nmeditate for 16 straight days, but you still feel stressed and anxious at\nwork.\n\nHabit formation is a long race. It often takes time for the desired results to\nappear. And while you are waiting for the long-term rewards of your efforts to\naccumulate, you need a reason to stick with it in the short-term. You need\nsome immediate feedback that shows you are on the right path.\n\nAnd this is where a habit tracker can help.\n\n## The Habit Tracker: What It Is and How It Works\n\nA habit tracker is a simple way to measure whether you did a habit.\n\nThe most basic format is to get a calendar and cross off each day you stick\nwith your routine. For example, if you meditate on Monday, Wednesday, and\nFriday, each of those dates gets an X. As time rolls by, the calendar becomes\na record of your habit streak.\n\nTo make this process as easy as possible, I created the Habit Journal, which\nincludes 12 habit tracker templates—one for each month. All you have to do is\nadd your habit and start crossing off the days.\n\nPlacing an X on each day is the classic look. I prefer something a little more\ndesign-oriented, so I shade in the cells on my habit tracker. You could also\nuse checkmarks or fill your habit tracker with dots.\n\nNo matter what design you choose, the key point is your habit tracker provides\nimmediate evidence that you completed your habit. It’s a signal that you are\nmaking progress. Of course, that’s not all it does…\n\nHabit tracking is powerful for three reasons.\n\n  1. It creates a visual cue that can remind you to act.\n  2. It is motivating to see the progress you are making. You don’t want to break your streak.\n  3. It feels satisfying to record your success in the moment.\n\nLet’s break down each one.\n\n## Benefit #1: A habit tracker reminds you to act.\n\nHabit tracking naturally builds a series of visual cues. When you look at the\ncalendar and see your streak, you’ll be reminded to act again.\n\nResearch has shown that people who track their progress on goals like losing\nweight, quitting smoking, and lowering blood pressure are all more likely to\nimprove than those who don’t. One study of more than sixteen hundred people\nfound that those who kept a daily food log lost twice as much weight as those\nwho did not. A habit tracker is a simple way to log your behavior, and the\nmere act of tracking a behavior can spark the urge to change it.\n\nHabit tracking also keeps you honest. Most of us think we act better than we\ndo. Measurement offers one way to overcome our blindness to our own behavior\nand notice what’s really going on each day. When the evidence is right in\nfront of you, you’re less likely to lie to yourself.\n\n## Benefit #2: A habit tracker motivates you to continue.\n\nThe most effective form of motivation is progress. When we get a signal that\nwe are moving forward, we become more motivated to continue down that path. In\nthis way, habit tracking can have an addictive effect on motivation. Each\nsmall win feeds your desire.\n\nThis can be particularly powerful on a bad day. When you’re feeling down, it’s\neasy to forget about all the progress you have already made. Habit tracking\nprovides visual proof of your hard work—a subtle reminder of how far you’ve\ncome. Plus, the empty square you see each morning can motivate you to get\nstarted because you don’t want to lose your progress by breaking your streak.\n\n## Benefit #3: A habit tracker provides immediate satisfaction.\n\nFinally, tracking feels rewarding. It is satisfying to cross an item off your\nto-do list, to complete an entry in your workout log, or to mark an X on the\ncalendar. It feels good to watch your results grow and if it feels good, then\nyou’re more likely to endure.\n\nHabit tracking also helps keep your eye on the ball: you’re focused on the\nprocess rather than the result. You’re not fixated on getting six-pack abs,\nyou’re just trying to keep the streak alive and become the type of person who\ndoesn’t miss workouts.\n\n## Habit Tracker Ideas\n\nAlright, those benefits sound great, but it’s not necessary to fill your habit\ntracker with every habit that makes up your day. In fact, if you’re already\nsticking to a habit, then it seems like extra work to me to track it as well.\nSo what should you measure in your habit tracker?\n\nHabit tracking can help kickstart a new habit or keep you on track with\nbehaviors that you tend to forget or let slide when things get busy.\n\nIn Atomic Habits, I recommend using the Two-Minute Rule, which suggests you\nscale your habits down until they take two minutes or less to perform. You can\ntrack whatever habits you want in your habit tracker, but I recommend starting\nwith these super small habits to make sure that you are at least showing up in\na small way each day. I’ll share some examples below and break them out by\ndaily, weekly, and monthly habits.\n\n**Common daily habits to track:**\n\n  * journal 1 sentence\n  * read 1 page\n  * meditate 1 minute\n  * do 1 push up\n  * stretch for 1 minute\n  * write 1 thing I’m grateful for\n  * make your bed\n  * wake up by [TIME]\n  * go to bed by [TIME]\n  * take a shower\n  * floss teeth\n  * weigh myself\n  * take medication\n  * take vitamins/supplements\n  * play [INSTRUMENT] for 1 minute\n  * contact 1 potential client\n  * prioritize to-do list\n  * say “I love you” at least once\n  * put all dishes put away\n  * take a walk outside\n  * call mom\n  * walk the dog\n\nNotice that most items on this list can be completed in two minutes or less.\nMake your habits so easy that you can stick to them even on the hard days.\n\nFor something to become truly habitual, you need to repeat it frequently. As a\nresult, most habits are daily. But it can also be helpful to use a habit\ntracker for various weekly or monthly routines. These behaviors won’t become\n“automatic” like tying your shoes or brushing your teeth, but a habit tracker\ncan remind you to complete them nonetheless.\n\n**Common weekly habits to track:**\n\n  * publish blog post\n  * vacuum\n  * take out trash/recycling\n  * do the laundry\n  * water the plants\n  * tidy up your bedroom\n  * write a thank you note\n\n**Monthly habits:**\n\n  * review finances\n  * transfer money to savings account\n  * pay off credit cards\n  * pay bills\n  * deep clean the house\n\nYou can also use a habit tracker to simply count how often you do something.\nFor example, if you want to keep track of how many days you travel for work\neach month.\n\n**Other ideas:**\n\n  * days spent traveling\n  * conduct weekly review\n  * conduct monthly review\n\nFinally, you can use a habit tracker to measure what you _don’t_ do. I call\nthese “habits of avoidance” (that is, behaviors you are trying to avoid).\n\n**Habits of avoidance:**\n\n  * no alcohol\n  * no Netflix\n  * no online purchases\n  * no soda\n  * no sugar\n  * no caffeine\n  * no smoking\n\nAgain, the Habit Journal offers a proven template and the fastest way to\ncreate your habit tracker. No need to spend an hour drawing your own grid.\nJust write your habits down and you’re ready to go.\n\n## How to Get in the Habit of Using Your Habit Tracker\n\nDespite all of the benefits, a habit tracker is not something that makes sense\nin every situation or for every person. Many people resist the idea of\ntracking and measuring. It can feel like a burden because it forces you into\ntwo habits: the habit you’re trying to build and the habit of tracking it.\nThat said, nearly anyone can benefit from habit tracking in one form or\nanother—even if it’s only temporary.\n\nWhat can we do to make habit tracking easier?\n\nFirst, manual tracking should be limited to your most important habits. It is\nbetter to consistently track one habit than to sporadically track ten. I tend\nto keep my habit tracker simple and limit it to my three or four most\nimportant habits.\n\nSecond, record each measurement immediately after the habit occurs. The\ncompletion of the habit is the cue to write it down. (This is a twist on the\n“habit stacking” approach I discuss in Chapter 5 of Atomic Habits.)\n\nHere’s the basic formula: After [CURRENT HABIT], I will [TRACK MY HABIT].\n\nFor example:\n\n  * After I hang up the phone from a sales call, I will mark the “call 1 potential client” column.\n  * After I finish meditating, I will fill the “meditate for 1 minute” column.\n  * After I put my plate in the dishwasher, I will complete the “put all dishes away” column.\n\nBasically, what we are talking about here is getting in the habit of using\nyour habit tracker. These little rules help you remember to pick up your habit\ntracker and mark off another accomplishment.\n\n## How to Recover Quickly When Your Habits Break Down\n\nFinally, I want to discuss what to do when you fall off the wagon.\n\nEvery habit streak ends at some point. Perfection is not possible. Before\nlong, an emergency will pop up—you get sick or you have to travel for work or\nyour family needs a little more of your time. Whenever this happens to me, I\ntry to remind myself of a simple rule:\n\nNever miss twice.\n\nIf I miss one day, I try to get back into it as quickly as possible. Missing\none workout happens, but I’m not going to miss two in a row. Maybe I’ll eat an\nentire pizza, but I’ll follow it up with a healthy meal. As soon as one streak\nends, I get started on the next one. I can’t be perfect, but I can avoid the\nsecond mistake.\n\nGenerally speaking, the first mistake is never the one that ruins you. It is\nthe spiral of repeated mistakes that follows. As I write in Atomic Habits,\n“Missing once is an accident. Missing twice is the start of a new habit.”\n\nToo often, we fall into an all-or-nothing cycle with our habits. The problem\nis not slipping up; the problem is thinking that if you can’t do something\nperfectly, then you shouldn’t do it at all.\n\nSure, a perfectly filled-in habit tracker looks beautiful and you should\nstrive to achieve it whenever possible. But life is messy. In the long run,\nwhat matters is that you find a way to get back on track.\n\n## How Long Do I Need to Track My Habits?\n\nOne of the most common questions I get is “How long does it take to build a\nhabit?”\n\nYou’ll see all kinds of answers: 21 days, 30 days, 100 days. One popular\nanswer right now is 66 days because there was one study that found that, on\naverage, it took 66 days to build a habit. However, even within that study the\nrange was quite wide depending on the difficulty of the habit.\n\nI find that people are really trying to get at something else when they ask,\n“How long does it take to build a habit?” What they often mean is, “How long\nuntil it’s easy? How long until I don’t have to put much effort in anymore?”\n\nLook, all habits get easier with practice. But this line of questioning\nignores the real purpose of building better habits in the first place.\n\nHow long does it take? The honest answer is: forever. Because once you stop\ndoing it, it is no longer a habit.\n\nA habit is a lifestyle to be lived, not a finish line to be crossed. You are\nlooking to make small, sustainable changes you can stick with for years. And a\nhabit tracker is one tool in your toolbox on the road to behavior change. It\nis an effective way to visualize your progress and motivate you to show up\nagain tomorrow.\n\n_This article is an excerpt from Chapter 16 of my New York Times bestselling\nbook  Atomic Habits. Read more here._\n\nFootnotes\n\n  1. “The Wonder of Three Ingredients,” New York Times, March 23, 2017.\n\n  2. Sure, there are some habits that lend themselves to more immediate signs of progress. Even if you haven’t hit retirement yet, you can still watch your savings grow with each deposit. And while your book manuscript may need more work, you can see the word count increasing after each writing session. But even in these cases, it can be helpful to have a simple way to take stock of where you stand.\n\n  3. As I mentioned in Atomic Habits, I use the term habit stacking to refer to linking a new habit to an old one. For this idea, I give credit to BJ Fogg. In his work, Fogg uses the term anchoring to describe this approach because your old habit acts as an “anchor” that keeps the new one in place. No matter what term you prefer, I believe it is a very effective strategy. You can learn more about Fogg’s work and his Tiny Habits Method at https://www.tinyhabits.com.\n\n##\n\nThanks for reading. You can get more actionable ideas in my popular email\nnewsletter. Each week, I share 3 short ideas from me, 2 quotes from others,\nand 1 question to think about. **Over 3,000,000 people subscribe**. Enter your\nemail now and join us.\n\n####\n\n# Join the Newsletter\n\nSubscribe to get our latest content by email.\n\nTry the free newsletter\n\n​\n\nAbout the Author\n\n**James Clear** writes about habits, decision making, and continuous\nimprovement. He is the author of the #1 _New York Times_ bestseller, Atomic\nHabits. The book has sold over 15 million copies worldwide and has been\ntranslated into more than 50 languages.\n\nClick here to learn more →\n\nRead Next\n\n  * The Surprising Benefits of Journaling One Sentence Every Day\n  * My 2018 Annual Review\n  * How to Make Your Future Habits Easy\n  * The Habits Scorecard: Use This Simple Exercise to Discover Which Habits You Should Change\n  * When the 80/20 Rule Fails: The Downside of Being Effective\n  * All Articles \n\nAtomic Habits\n\nMasterClass\n\nHabit Journal\n\nPrivacy & Terms of Use\n\nHosting by LiquidWeb\n\nForms by OptinMonster\n\n",
    "links": "[{\"link\": \"https://jamesclear.com/about\", \"text\": \"Click here to learn more →\"}, {\"link\": \"https://jamesclear.com/articles\", \"text\": \"\"}, {\"link\": \"https://jamesclear.com/privacy-policy\", \"text\": \"Privacy & Terms of Use\"}]",
    "priceAndPlans": "Error: Timeout 30000ms exceeded. =========================== logs\n=========================== navigating to\n\"http://web.archive.org/web/20240124114940/https://jamesclear.com/\", waiting\nuntil \"load\" ============================================================\n\n"
}