{
    "summary": "Catch up on the latest product launches, demos, and trainings from Next '23.\nLet's go.\n\nJump to\n\nCloud GPUsKey featuresWhat's newDocumentationPricingTake the next step\n\n# Cloud GPUs\n\nHigh-performance GPUs on Google Cloud for machine learning, scientific\ncomputing, and generative AI.\n\nTry Google Cloud free\n\n  * Speed up compute jobs like generative AI, 3D visualization, and HPC\n\n  * A wide selection of GPUs to match a range of performance and price points\n\n  * Flexible pricing and machine customizations to optimize for your workload\n\nKey features\n\n## Key features\n\n### A range of GPU types\n\nNVIDIA H100, L4, P100, P4, T4, V100, and A100 GPUs provide a range of compute\noptions to cover your workloads for a broad set of cost and performance needs.\n\n### Flexible performance\n\nOptimally balance the processor, memory, high performance disk, and up to 8\nGPUs per instance for your individual workload. All with the per-second\nbilling, so you only pay only for what you need while you are using it.\n\n### All the benefits of Google Cloud\n\nRun GPU workloads on Google Cloud where you have access to industry-leading\nstorage, networking, and data analytics technologies.\n\nWhat's new\n\n## What's new\n\nSign up for Google Cloud newsletters to receive product updates, event\ninformation, special offers, and more.\n\nBlog post\n\nA3 supercomputers with NVIDIA H100 GPUs, purpose-built for AIRead the blog\n\nReport\n\nIntroducing G2 VMs with NVIDIA L4 GPUs — a cloud-industry firstLearn more\n\nBlog post\n\nCheaper Cloud AI deployments with NVIDIA T4Read the blog\n\nVideo\n\nNext: An overview of Cloud GPU for ML and HPCWatch video\n\nEvent\n\nWebinar: 8 reasons to run your ML workloads on NVIDIA T4 GPUsRegister now\n\nDocumentation\n\n## Documentation\n\nGoogle Cloud Basics\n\n###  GPUs on Compute Engine\n\nCompute Engine provides GPUs that you can add to your virtual machine\ninstances. Learn what you can do with GPUs and what types of GPU hardware are\navailable.\n\nLearn more\n\nTutorial\n\n###  Adding or removing GPUs on Compute Engine\n\nLearn how to add or remove GPUs from a Compute Engine VM.\n\nLearn more\n\nTutorial\n\n### Installing GPUs drivers\n\nThis guide shows ways to install NVIDIA proprietary drivers after you’ve\ncreated an instance with one or more GPUs.\n\nLearn more\n\nTutorial\n\n### GPUs on Google Kubernetes Engine\n\nLearn how to use GPU hardware accelerators in your Google Kubernetes Engine\nclusters’ nodes.\n\nLearn more\n\nGoogle Cloud Basics\n\n###  Using GPUs for training models in the cloud\n\nAccelerate the training process for many deep learning models, like image\nclassification, video analysis, and natural language processing.\n\nLearn more\n\nGoogle Cloud Basics\n\n###  Attaching GPUs to Dataproc clusters\n\nAttach GPUs to the master and worker Compute Engine nodes in a Dataproc\ncluster to accelerate specific workloads, such as machine learning and data\nprocessing.\n\nLearn more\n\n### Not seeing what you’re looking for?\n\nView all product documentation\n\n### Explore more docs\n\n  * Get a quick intro to using this product.\n\n  * Learn to complete specific tasks with this product.\n\n  * Browse walkthroughs of common uses and scenarios for this product.\n\n  * View APIs, references, and other resources for this product.\n\nPricing\n\n### Pricing\n\nFor information about GPU pricing for the different GPU types and regions that\nare available on Compute Engine, refer to the GPU pricing document.\n\nView pricing details\n\n#### Take the next step\n\nStart building on Google Cloud with $300 in free credits and 20+ always free\nproducts.\n\nTry Google Cloud free\n\n  * ##### Need help getting started?\n\nContact sales\n\n  * ##### Work with a trusted partner\n\nFind a partner\n\n  * ##### Continue browsing\n\nSee all products\n\nmenu\n\nOverviewSolutionsProductsPricingResourcesDocsSupportContact Us\n\n\n\nDocsSupport\n\n_language_ ‪English‬\n\n  * ‪English‬\n  * ‪Deutsch‬\n  * ‪Español‬\n  * ‪Español (Latinoamérica)‬\n  * ‪Français‬\n  * ‪Indonesia‬\n  * ‪Italiano‬\n  * ‪Português (Brasil)‬\n  * ‪简体中文‬\n  * ‪繁體中文‬\n  * ‪日本語‬\n  * ‪한국어‬\n\nConsole\n\nSign in\n\nStart free\n\nStart free\n\nContact Us\n\nclose\n\n  * Accelerate your digital transformation\n  * Whether your business is early in its journey or well on its way to digital transformation, Google Cloud can help solve your toughest challenges.\n  * Learn more\n\n  * Key benefits\n  * Why Google Cloud\n\nTop reasons businesses choose us.\n\n  * AI and ML\n\nGet enterprise-ready AI.\n\n  * Multicloud\n\nRun your apps wherever you need them.\n\n  * Global infrastructure\n\nBuild on the same infrastructure as Google.\n\n  * Data Cloud\n\nMake smarter decisions with unified data.\n\n  * Open cloud\n\nScale with open, flexible technology.\n\n  * Trust and security\n\nKeep your data secure and compliant.\n\n  * Productivity and collaboration\n\nConnect your teams with AI-powered apps.\n\n  * Reports and insights\n  * Executive insights\n\nCurated C-suite perspectives.\n\n  * Analyst reports\n\nRead what industry analysts say about us.\n\n  * Whitepapers\n\nBrowse and download popular whitepapers.\n\n  * Customer stories\n\nExplore case studies and videos.\n\nclose\n\n  * Industry Solutions\n  * Application Modernization\n  * Artificial Intelligence\n  * APIs and Applications\n  * Databases\n  * Data Cloud\n  * Digital Transformation\n  * Infrastructure Modernization\n  * Productivity and Collaboration\n  * Security\n  * Smart Analytics\n  * Startups and SMB\n\nSee all solutions\n\n  * Industry Solutions\n\nReduce cost, increase operational agility, and capture new market\nopportunities.\n\n  * Retail\n\nAnalytics and collaboration tools for the retail value chain.\n\n  * Consumer Packaged Goods\n\nSolutions for CPG digital transformation and brand growth.\n\n  * Financial Services\n\nComputing, data management, and analytics tools for financial services.\n\n  * Healthcare and Life Sciences\n\nAdvance research at scale and empower healthcare innovation.\n\n  * Media and Entertainment\n\nSolutions for content production and distribution operations.\n\n  * Telecommunications\n\nHybrid and multi-cloud services to deploy and monetize 5G.\n\n  * Games\n\nAI-driven solutions to build and scale games faster.\n\n  * Manufacturing\n\nMigration and AI tools to optimize the manufacturing value chain.\n\n  * Supply Chain and Logistics\n\nEnable sustainable, efficient, and resilient data-driven operations across\nsupply chain and logistics operations.\n\n  * Government\n\nData storage, AI, and analytics solutions for government agencies.\n\n  * Education\n\nTeaching tools to provide more engaging learning experiences.\n\n  * Not seeing what you're looking for?\n  * See all industry solutions\n\n  * Application Modernization\n\nAssess, plan, implement, and measure software practices and capabilities to\nmodernize and simplify your organization’s business application portfolios.\n\n  * CAMP\n\nProgram that uses DORA to improve your software delivery capabilities.\n\n  * Modernize Traditional Applications\n\nAnalyze, categorize, and get started with cloud migration on traditional\nworkloads.\n\n  * Migrate from PaaS: Cloud Foundry, Openshift\n\nTools for moving your existing containers into Google's managed container\nservices.\n\n  * Migrate from Mainframe\n\nAutomated tools and prescriptive guidance for moving your mainframe apps to\nthe cloud.\n\n  * Modernize Software Delivery\n\nSoftware supply chain best practices - innerloop productivity, CI/CD and S3C.\n\n  * DevOps Best Practices\n\nProcesses and resources for implementing DevOps in your org.\n\n  * SRE Principles\n\nTools and resources for adopting SRE in your org.\n\n  * Day 2 Operations for GKE\n\nTools and guidance for effective GKE management and monitoring.\n\n  * FinOps and Optimization of GKE\n\nBest practices for running reliable, performant, and cost effective\napplications on GKE.\n\n  * Run Applications at the Edge\n\nGuidance for localized and low latency apps on Google’s hardware agnostic edge\nsolution.\n\n  * Architect for Multicloud\n\nManage workloads across multiple clouds with a consistent platform.\n\n  * Go Serverless\n\nFully managed environment for developing, deploying and scaling apps.\n\n  * Artificial Intelligence\n\nAdd intelligence and efficiency to your business with AI and machine learning.\n\n  * Contact Center AI\n\nAI model for speaking with customers and assisting human agents.\n\n  * Document AI\n\nDocument processing and data capture automated at scale.\n\n  * Product Discovery\n\nGoogle-quality search and product recommendations for retailers.\n\n  * APIs and Applications\n\nSpeed up the pace of innovation without coding, using APIs, apps, and\nautomation.\n\n  * New Business Channels Using APIs\n\nAttract and empower an ecosystem of developers and partners.\n\n  * Unlocking Legacy Applications Using APIs\n\nCloud services for extending and modernizing legacy apps.\n\n  * Open Banking APIx\n\nSimplify and accelerate secure delivery of open banking compliant APIs.\n\n  * Databases\n\nMigrate and manage enterprise data with security, reliability, high\navailability, and fully managed data services.\n\n  * Database Migration\n\nGuides and tools to simplify your database migration life cycle.\n\n  * Database Modernization\n\nUpgrades to modernize your operational database infrastructure.\n\n  * Databases for Games\n\nBuild global, live games with Google Cloud databases.\n\n  * Google Cloud Databases\n\nDatabase services to migrate, manage, and modernize data.\n\n  * Migrate Oracle workloads to Google Cloud\n\nRehost, replatform, rewrite your Oracle workloads.\n\n  * Open Source Databases\n\nFully managed open source databases with enterprise-grade support.\n\n  * SQL Server on Google Cloud\n\nOptions for running SQL Server virtual machines on Google Cloud.\n\n  * Data Cloud\n\nUnify data across your organization with an open and simplified approach to\ndata-driven transformation that is unmatched for speed, scale, and security\nwith AI built-in.\n\n  * Databases Solutions\n\nMigrate and manage enterprise data with security, reliability, high\navailability, and fully managed data services.\n\n  * Smart Analytics Solutions\n\nGenerate instant insights from data at any scale with a serverless, fully\nmanaged analytics platform that significantly simplifies analytics.\n\n  * AI Solutions\n\nAdd intelligence and efficiency to your business with AI and machine learning.\n\n  * Data Cloud for ISVs\n\nInnovate, optimize and amplify your SaaS applications using Google's data and\nmachine learning solutions such as BigQuery, Looker, Spanner and Vertex AI.\n\n  * Data Cloud Alliance\n\nAn initiative to ensure that global businesses have more seamless access and\ninsights into the data required for digital transformation.\n\n  * Digital Transformation\n  * Accelerate business recovery and ensure a better future with solutions that enable hybrid and multi-cloud, generate intelligent insights, and keep your workers connected.\n\n  * Digital Innovation\n\nReimagine your operations and unlock new opportunities.\n\n  * Operational Efficiency\n\nPrioritize investments and optimize costs.\n\n  * COVID-19 Solutions\n\nGet work done more safely and securely.\n\n  * COVID-19 Solutions for the Healthcare Industry\n\nHow Google is helping healthcare meet extraordinary challenges.\n\n  * Infrastructure Modernization\n\nMigrate quickly with solutions for SAP, VMware, Windows, Oracle, and other\nworkloads.\n\n  * Application Migration\n\nDiscovery and analysis tools for moving to the cloud.\n\n  * SAP on Google Cloud\n\nCertifications for running SAP applications and SAP HANA.\n\n  * High Performance Computing\n\nCompute, storage, and networking options to support any workload.\n\n  * Windows on Google Cloud\n\nTools and partners for running Windows workloads.\n\n  * Data Center Migration\n\nMigration solutions for VMs, apps, databases, and more.\n\n  * Active Assist\n\nAutomatic cloud resource optimization and increased security.\n\n  * Virtual Desktops\n\nRemote work solutions for desktops and applications (VDI & DaaS).\n\n  * Rapid Migration Program (RaMP)\n\nEnd-to-end migration program to simplify your path to the cloud.\n\n  * Backup and Disaster Recovery\n\nEnsure your business continuity needs are met.\n\n  * Productivity and Collaboration\n\nChange the way teams work with solutions designed for humans and built for\nimpact.\n\n  * Google Workspace\n\nCollaboration and productivity tools for enterprises.\n\n  * Google Workspace Essentials\n\nSecure video meetings and modern collaboration for teams.\n\n  * Cloud Identity\n\nUnified platform for IT admins to manage user devices and apps.\n\n  * Chrome Enterprise\n\nChromeOS, Chrome Browser, and Chrome devices built for business.\n\n  * Cloud Search\n\nEnterprise search for employees to quickly find company information.\n\n  * Security\n\nDetect, investigate, and respond to online threats to help protect your\nbusiness.\n\n  * Security Analytics and Operations\n\nSolution for analyzing petabytes of security telemetry.\n\n  * Web App and API Protection\n\nThreat and fraud protection for your web applications and APIs.\n\n  * Security and Resilience Framework\n\nSolutions for each phase of the security and resilience life cycle.\n\n  * Risk and compliance as code (RCaC)\n\nSolution to modernize your governance, risk, and compliance function with\nautomation.\n\n  * Software Supply Chain Security\n\nSolution for improving end-to-end software supply chain security.\n\n  * Security Foundation\n\nRecommended products to help achieve a strong security posture.\n\n  * Smart Analytics\n\nGenerate instant insights from data at any scale with a serverless, fully\nmanaged analytics platform that significantly simplifies analytics.\n\n  * Data Warehouse Modernization\n\nData warehouse to jumpstart your migration and unlock insights.\n\n  * Data Lake Modernization\n\nServices for building and modernizing your data lake.\n\n  * Spark on Google Cloud\n\nRun and write Spark where you need it, serverless and integrated.\n\n  * Stream Analytics\n\nInsights from ingesting, processing, and analyzing event streams.\n\n  * Business Intelligence\n\nSolutions for modernizing your BI stack and creating rich data experiences.\n\n  * Data Science\n\nPut your data to work with Data Science on Google Cloud.\n\n  * Marketing Analytics\n\nSolutions for collecting, analyzing, and activating customer data.\n\n  * Geospatial Analytics and AI\n\nSolutions for building a more prosperous and sustainable business.\n\n  * Datasets\n\nData from Google, public, and commercial providers to enrich your analytics\nand AI initiatives.\n\n  * Startups and SMB\n\nAccelerate startup and SMB growth with tailored solutions and programs.\n\n  * Startup Solutions\n\nGrow your startup and solve your toughest challenges using Google’s proven\ntechnology.\n\n  * Startup Program\n\nGet financial, business, and technical support to take your startup to the\nnext level.\n\n  * Small and Medium Business\n\nExplore solutions for web hosting, app development, AI, and analytics.\n\n  * Software as a Service\n\nBuild better SaaS products, scale efficiently, and grow your business.\n\nclose\n\n  * Featured Products\n  * AI and Machine Learning\n  * Business Intelligence\n  * Compute\n  * Containers\n  * Data Analytics\n  * Databases\n  * Developer Tools\n  * Distributed Cloud\n  * Hybrid and Multicloud\n  * Industry Specific\n  * Integration Services\n  * Management Tools\n  * Maps and Geospatial\n  * Media Services\n  * Migration\n  * Mixed Reality\n  * Networking\n  * Operations\n  * Productivity and Collaboration\n  * Security and Identity\n  * Serverless\n  * Storage\n  * Web3\n\nSee all products (100+)\n\n  * Featured Products\n\n  * Compute Engine\n\nVirtual machines running in Google’s data center.\n\n  * Cloud Storage\n\nObject storage that’s secure, durable, and scalable.\n\n  * BigQuery\n\nData warehouse for business agility and insights.\n\n  * Cloud Run\n\nFully managed environment for running containerized apps.\n\n  * Google Kubernetes Engine\n\nManaged environment for running containerized apps.\n\n  * Vertex AI Platform\n\nUnified platform for ML models and generative AI.\n\n  * Looker\n\nPlatform for BI, data applications, and embedded analytics.\n\n  * Apigee API Management\n\nManage the full life cycle of APIs anywhere with visibility and control.\n\n  * Cloud SQL\n\nRelational database services for MySQL, PostgreSQL and SQL Server.\n\n  * Cloud SDK\n\nCommand-line tools and libraries for Google Cloud.\n\n  * Cloud CDN\n\nContent delivery network for delivering web and video.\n\n  * Not seeing what you're looking for?\n  * See all products (100+)\n\n  * AI and Machine Learning\n\n  * Vertex AI Platform\n\nUnified platform for ML models and generative AI.\n\n  * Generative AI on Vertex AI\n\nBuild, tune, and deploy foundation models on Vertex AI.\n\n  * Vertex AI Search and Conversation\n\nGenerative AI apps for search and conversational AI.\n\n  * Dialogflow\n\nLifelike conversational AI with state-of-the-art virtual agents.\n\n  * Natural Language AI\n\nSentiment analysis and classification of unstructured text.\n\n  * Speech-to-Text\n\nSpeech recognition and transcription across 125 languages.\n\n  * Text-to-Speech\n\nSpeech synthesis in 220+ voices and 40+ languages.\n\n  * Translation AI\n\nLanguage detection, translation, and glossary support.\n\n  * Document AI\n\nDocument processing and data capture automated at scale.\n\n  * Vision AI\n\nCustom and pre-trained models to detect emotion, text, and more.\n\n  * Contact Center AI\n\nAI model for speaking with customers and assisting human agents.\n\n  * Not seeing what you're looking for?\n  * See all AI and machine learning products\n\n  * Business Intelligence\n\n  * Looker\n\nPlatform for BI, data applications, and embedded analytics.\n\n  * Looker Studio\n\nInteractive data suite for dashboarding, reporting, and analytics.\n\n  * Compute\n\n  * Compute Engine\n\nVirtual machines running in Google’s data center.\n\n  * App Engine\n\nServerless application platform for apps and back ends.\n\n  * Cloud GPUs\n\nGPUs for ML, scientific computing, and 3D visualization.\n\n  * Migrate to Virtual Machines\n\nServer and virtual machine migration to Compute Engine.\n\n  * Spot VMs\n\nCompute instances for batch jobs and fault-tolerant workloads.\n\n  * Batch\n\nFully managed service for scheduling batch jobs.\n\n  * Sole-Tenant Nodes\n\nDedicated hardware for compliance, licensing, and management.\n\n  * Bare Metal\n\nInfrastructure to run specialized workloads on Google Cloud.\n\n  * Recommender\n\nUsage recommendations for Google Cloud products and services.\n\n  * VMware Engine\n\nFully managed, native VMware Cloud Foundation software stack.\n\n  * Cloud Run\n\nFully managed environment for running containerized apps.\n\n  * Not seeing what you're looking for?\n  * See all compute products\n\n  * Containers\n\n  * Google Kubernetes Engine\n\nManaged environment for running containerized apps.\n\n  * Cloud Run\n\nFully managed environment for running containerized apps.\n\n  * Cloud Build\n\nSolution for running build steps in a Docker container.\n\n  * Artifact Registry\n\nPackage manager for build artifacts and dependencies.\n\n  * Cloud Code\n\nIDE support to write, run, and debug Kubernetes applications.\n\n  * Cloud Deploy\n\nFully managed continuous delivery to GKE and Cloud Run.\n\n  * Migrate to Containers\n\nComponents for migrating VMs into system containers on GKE.\n\n  * Deep Learning Containers\n\nContainers with data science frameworks, libraries, and tools.\n\n  * Knative\n\nComponents to create Kubernetes-native cloud-based software.\n\n  * Data Analytics\n\n  * BigQuery\n\nData warehouse for business agility and insights.\n\n  * Looker\n\nPlatform for BI, data applications, and embedded analytics.\n\n  * Dataflow\n\nStreaming analytics for stream and batch processing.\n\n  * Pub/Sub\n\nMessaging service for event ingestion and delivery.\n\n  * Dataproc\n\nService for running Apache Spark and Apache Hadoop clusters.\n\n  * Cloud Data Fusion\n\nData integration for building and managing data pipelines.\n\n  * Cloud Composer\n\nWorkflow orchestration service built on Apache Airflow.\n\n  * Dataprep\n\nService to prepare data for analysis and machine learning.\n\n  * Dataplex\n\nIntelligent data fabric for unifying data management across silos.\n\n  * Dataform\n\nBuild, version control, and deploy SQL workflows in BigQuery.\n\n  * Analytics Hub\n\nService for securely and efficiently exchanging data analytics assets.\n\n  * Not seeing what you're looking for?\n  * See all data analytics products\n\n  * Databases\n\n  * AlloyDB for PostgreSQL\n\nFully managed, PostgreSQL-compatible database for enterprise workloads.\n\n  * Cloud SQL\n\nFully managed database for MySQL, PostgreSQL, and SQL Server.\n\n  * Firestore\n\nCloud-native document database for building rich mobile, web, and IoT apps.\n\n  * Cloud Spanner\n\nCloud-native relational database with unlimited scale and 99.999%\navailability.\n\n  * Cloud Bigtable\n\nCloud-native wide-column database for large-scale, low-latency workloads.\n\n  * Datastream\n\nServerless change data capture and replication service.\n\n  * Database Migration Service\n\nServerless, minimal downtime migrations to Cloud SQL.\n\n  * Developer Tools\n\n  * Artifact Registry\n\nUniversal package manager for build artifacts and dependencies.\n\n  * Cloud Code\n\nIDE support to write, run, and debug Kubernetes applications.\n\n  * Cloud Build\n\nContinuous integration and continuous delivery platform.\n\n  * Cloud Deploy\n\nFully managed continuous delivery to GKE and Cloud Run.\n\n  * Cloud Deployment Manager\n\nService for creating and managing Google Cloud resources.\n\n  * Cloud SDK\n\nCommand-line tools and libraries for Google Cloud.\n\n  * Cloud Scheduler\n\nCron job scheduler for task automation and management.\n\n  * Cloud Source Repositories\n\nPrivate Git repository to store, manage, and track code.\n\n  * Cloud Tasks\n\nTask management service for asynchronous task execution.\n\n  * Cloud Workstations\n\nManaged and secure development environments in the cloud.\n\n  * Tools for PowerShell\n\nFull cloud control from Windows PowerShell.\n\n  * Not seeing what you're looking for?\n  * See all developer tools\n\n  * Distributed Cloud\n\n  * Google Distributed Cloud Edge\n\nDistributed cloud services for edge workloads.\n\n  * Google Distributed Cloud Hosted\n\nDistributed cloud for air-gapped workloads.\n\n  * Hybrid and Multicloud\n\n  * Google Kubernetes Engine\n\nManaged environment for running containerized apps.\n\n  * Apigee API Management\n\nAPI management, development, and security platform.\n\n  * Migrate to Containers\n\nTool to move workloads and existing applications to GKE.\n\n  * Traffic Director\n\nTraffic control pane and management for open service mesh.\n\n  * Cloud Build\n\nService for executing builds on Google Cloud infrastructure.\n\n  * Operations\n\nMonitoring, logging, and application performance suite.\n\n  * Anthos\n\nPlatform for modernizing existing apps and building new ones.\n\n  * Distributed Cloud\n\nFully managed solutions for the edge and data centers.\n\n  * Industry Specific\n\n  * Anti Money Laundering AI\n\nDetect suspicious, potential money laundering activity with AI.\n\n  * Cloud Healthcare API\n\nSolution for bridging existing care systems and apps on Google Cloud.\n\n  * Device Connect for Fitbit\n\nGain a 360-degree patient view with connected Fitbit data on Google Cloud.\n\n  * Telecom Network Automation\n\nReady to use cloud-native automation for telecom networks.\n\n  * Telecom Data Fabric\n\nTelecom data management and analytics with an automated approach.\n\n  * Telecom Subscriber Insights\n\nIngests data to improve subscriber acquisition and retention.\n\n  * Spectrum Access System (SAS)\n\nControls fundamental access to the Citizens Broadband Radio Service (CBRS).\n\n  * Integration Services\n\n  * Application Integration\n\nConnect to 3rd party apps and enable data consistency without code.\n\n  * Workflows\n\nWorkflow orchestration for serverless products and API services.\n\n  * Apigee API Management\n\nManage the full life cycle of APIs anywhere with visibility and control.\n\n  * Cloud Tasks\n\nTask management service for asynchronous task execution.\n\n  * Cloud Scheduler\n\nCron job scheduler for task automation and management.\n\n  * Dataproc\n\nService for running Apache Spark and Apache Hadoop clusters.\n\n  * Cloud Data Fusion\n\nData integration for building and managing data pipelines.\n\n  * Cloud Composer\n\nWorkflow orchestration service built on Apache Airflow.\n\n  * Pub/Sub\n\nMessaging service for event ingestion and delivery.\n\n  * Eventarc\n\nBuild an event-driven architecture that can connect any service.\n\n  * Management Tools\n\n  * Cloud Shell\n\nInteractive shell environment with a built-in command line.\n\n  * Cloud console\n\nWeb-based interface for managing and monitoring cloud apps.\n\n  * Cloud Endpoints\n\nDeployment and development management for APIs on Google Cloud.\n\n  * Cloud IAM\n\nPermissions management system for Google Cloud resources.\n\n  * Cloud APIs\n\nProgrammatic interfaces for Google Cloud services.\n\n  * Service Catalog\n\nService catalog for admins managing internal enterprise solutions.\n\n  * Cost Management\n\nTools for monitoring, controlling, and optimizing your costs.\n\n  * Operations\n\nMonitoring, logging, and application performance suite.\n\n  * Carbon Footprint\n\nDashboard to view and export Google Cloud carbon emissions reports.\n\n  * Config Connector\n\nKubernetes add-on for managing Google Cloud resources.\n\n  * Active Assist\n\nTools for easily managing performance, security, and cost.\n\n  * Not seeing what you're looking for?\n  * See all management tools\n\n  * Maps and Geospatial\n\n  * Earth Engine\n\nGeospatial platform for Earth observation data and analysis.\n\n  * Google Maps Platform\n\nCreate immersive location experiences and improve business operations.\n\n  * Media Services\n\n  * Cloud CDN\n\nContent delivery network for serving web and video content.\n\n  * Live Steam API\n\nService to convert live video and package for streaming.\n\n  * OpenCue\n\nOpen source render manager for visual effects and animation.\n\n  * Transcoder API\n\nConvert video files and package them for optimized delivery.\n\n  * Video Stitcher API\n\nService for dynamic or server side ad insertion.\n\n  * Migration\n\n  * Migration Center\n\nUnified platform for migrating and modernizing with Google Cloud.\n\n  * Application Migration\n\nApp migration to the cloud for low-cost refresh cycles.\n\n  * Migrate to Virtual Machines\n\nComponents for migrating VMs and physical servers to Compute Engine.\n\n  * Cloud Foundation Toolkit\n\nReference templates for Deployment Manager and Terraform.\n\n  * Database Migration Service\n\nServerless, minimal downtime migrations to Cloud SQL.\n\n  * Migrate to Containers\n\nComponents for migrating VMs into system containers on GKE.\n\n  * BigQuery Data Transfer Service\n\nData import service for scheduling and moving data into BigQuery.\n\n  * Rapid Migration Program (RaMP)\n\nEnd-to-end migration program to simplify your path to the cloud.\n\n  * Transfer Appliance\n\nStorage server for moving large volumes of data to Google Cloud.\n\n  * Storage Transfer Service\n\nData transfers from online and on-premises sources to Cloud Storage.\n\n  * VMware Engine\n\nMigrate and run your VMware workloads natively on Google Cloud.\n\n  * Mixed Reality\n\n  * Immersive Stream for XR\n\nHosts, renders, and streams 3D and XR experiences.\n\n  * Networking\n\n  * Cloud Armor\n\nSecurity policies and defense against web and DDoS attacks.\n\n  * Cloud CDN and Media CDN\n\nContent delivery network for serving web and video content.\n\n  * Cloud DNS\n\nDomain name system for reliable and low-latency name lookups.\n\n  * Cloud Load Balancing\n\nService for distributing traffic across applications and regions.\n\n  * Cloud NAT\n\nNAT service for giving private instances internet access.\n\n  * Cloud Connectivity\n\nConnectivity options for VPN, peering, and enterprise needs.\n\n  * Network Connectivity Center\n\nConnectivity management to help simplify and scale networks.\n\n  * Network Intelligence Center\n\nNetwork monitoring, verification, and optimization platform.\n\n  * Network Service Tiers\n\nCloud network options based on performance, availability, and cost.\n\n  * Virtual Private Cloud\n\nSingle VPC for an entire organization, isolated within projects.\n\n  * Private Service Connect\n\nSecure connection between your VPC and services.\n\n  * Not seeing what you're looking for?\n  * See all networking products\n\n  * Operations\n\n  * Cloud Logging\n\nGoogle Cloud audit, platform, and application logs management.\n\n  * Cloud Monitoring\n\nInfrastructure and application health with rich metrics.\n\n  * Error Reporting\n\nApplication error identification and analysis.\n\n  * Cloud Debugger\n\nReal-time application state inspection and in -production debugging.\n\n  * Cloud Trace\n\nTracing system collecting latency data from applications.\n\n  * Cloud Profiler\n\nCPU and heap profiler for analyzing application performance.\n\n  * Productivity and Collaboration\n\n  * AppSheet\n\nNo-code development platform to build and extend applications.\n\n  * Appsheet Automation\n\nBuild automations and applications on a unified platform.\n\n  * Google Workspace\n\nCollaboration and productivity tools for individuals and organizations.\n\n  * Google Workspace Essentials\n\nSecure video meetings and modern collaboration for teams.\n\n  * Duet AI for Workspace\n\nEmbeds generative AI across Workspace apps.\n\n  * Cloud Identity\n\nUnified platform for IT admins to manage user devices and apps.\n\n  * Chrome Enterprise\n\nChrome OS, Chrome Browser, and Chrome devices built for business.\n\n  * Security and Identity\n\n  * Cloud IAM\n\nPermissions management system for Google Cloud resources.\n\n  * Assured Workloads\n\nCompliance and security controls for sensitive workloads.\n\n  * Cloud Key Management\n\nManage encryption keys on Google Cloud.\n\n  * Confidential Computing\n\nEncrypt data in use with Confidential VMs.\n\n  * Security Command Center\n\nPlatform for defending against threats to your Google Cloud assets.\n\n  * Cloud Data Loss Prevention\n\nSensitive data inspection, classification, and redaction platform.\n\n  * Mandiant Products and Services\n\nCybersecurity technology and expertise from the frontlines.\n\n  * Chronicle SIEM\n\nExtract signals from your security telemetry to find threats instantly.\n\n  * Chronicle Security Operations\n\nDetect, investigate, and respond to cyber threats.\n\n  * Secret Manager\n\nStore API keys, passwords, certificates, and other sensitive data.\n\n  * BeyondCorp Enterprise\n\nZero-trust access control for your internal web apps.\n\n  * Not seeing what you're looking for?\n  * See all security and identity products\n\n  * Serverless\n\n  * Cloud Run\n\nFully managed environment for running containerized apps.\n\n  * Cloud Functions\n\nPlatform for creating functions that respond to cloud events.\n\n  * App Engine\n\nServerless application platform for apps and back ends.\n\n  * Workflows\n\nWorkflow orchestration for serverless products and API services.\n\n  * API Gateway\n\nDevelop, deploy, secure, and manage APIs with a full managed gateway.\n\n  * Storage\n\n  * Cloud Storage\n\nObject storage that’s secure, durable, and scalable.\n\n  * Backup and DR Service\n\nService for centralized, application-consistent data protection.\n\n  * Filestore\n\nFile storage that is highly scalable and secure.\n\n  * Persistent Disk\n\nBlock storage for virtual machine instances running on Google Cloud.\n\n  * Cloud Storage for Firebase\n\nObject storage for storing and serving user-generated content.\n\n  * Local SSD\n\nBlock storage that is locally attached for high-performance needs.\n\n  * Storage Transfer Service\n\nData transfers from online and on-premises sources to Cloud Storage.\n\n  * Web3\n\n  * Blockchain Node Engine\n\nFully managed node hosting for developing on the blockchain.\n\nclose\n\n  * Save money with our transparent approach to pricing\n  * Google Cloud's pay-as-you-go pricing offers automatic savings based on monthly usage and discounted rates for prepaid resources. Contact us today to get a quote.\n  * Request a quote\n\n  * Pricing overview and tools\n  * Google Cloud pricing\n\nPay only for what you use with no lock-in.\n\n  * Pricing calculator\n\nCalculate your cloud savings.\n\n  * Google Cloud free tier\n\nExplore products with free monthly usage.\n\n  * Cost optimization framework\n\nGet best practices to optimize workload costs.\n\n  * Cost management tools\n\nTools to monitor and control your costs.\n\n  * Product-specific Pricing\n  * Compute Engine\n\n  * Cloud SQL\n\n  * Google Kubernetes Engine\n\n  * Cloud Storage\n\n  * BigQuery\n\n  * See full price list with 100+ products\n\nclose\n\n  * Learn & build\n  * Google Cloud Free Program\n\n$300 in free credits and 20+ free products.\n\n  * Quickstarts\n\nGet tutorials and walkthroughs.\n\n  * Cloud computing basics\n\nLearn more about cloud computing topics.\n\n  * Blog\n\nRead our latest product news and stories.\n\n  * Learning Hub\n\nGrow your career with role-based learning\n\n  * Training\n\nEnroll in on-demand or classroom training.\n\n  * Certification\n\nPrepare and register for certifications.\n\n  * Cloud Architecture Center\n\nGet reference architectures and best practices.\n\n  * Connect\n  * Innovators\n\nJoin Google Cloud's developer program.\n\n  * Developer Center\n\nStay in the know and stay connected.\n\n  * Events and webinars\n\nBrowse upcoming and on demand events.\n\n  * Google Cloud Community\n\nAsk questions, find answers, and connect.\n\n  * Third-party tools and partners\n  * Google Cloud Marketplace\n\nDeploy ready-to-go solutions in a few clicks.\n\n  * Google Cloud partners\n\nExplore benefits of working with a partner.\n\n  * Become a partner\n\nJoin the Partner Advantage program.\n\nclose\n\n  * Overview\n    * arrow_forward\n  * Solutions\n    * arrow_forward\n  * Products\n    * arrow_forward\n  * Pricing\n    * arrow_forward\n  * Resources\n    * arrow_forward\n  * Docs\n  * Support\n  * Console\n\n  * Accelerate your digital transformation\n  * Learn more\n  * Key benefits\n  * Why Google Cloud\n  * AI and ML\n  * Multicloud\n  * Global infrastructure\n  * Data Cloud\n  * Open cloud\n  * Trust and security\n  * Productivity and collaboration\n  * Reports and insights\n  * Executive insights\n  * Analyst reports\n  * Whitepapers\n  * Customer stories\n\n  * Industry Solutions\n  * Retail\n  * Consumer Packaged Goods\n  * Financial Services\n  * Healthcare and Life Sciences\n  * Media and Entertainment\n  * Telecommunications\n  * Games\n  * Manufacturing\n  * Supply Chain and Logistics\n  * Government\n  * Education\n  * See all industry solutions\n  * See all solutions\n  * Application Modernization\n  * CAMP\n  * Modernize Traditional Applications\n  * Migrate from PaaS: Cloud Foundry, Openshift\n  * Migrate from Mainframe\n  * Modernize Software Delivery\n  * DevOps Best Practices\n  * SRE Principles\n  * Day 2 Operations for GKE\n  * FinOps and Optimization of GKE\n  * Run Applications at the Edge\n  * Architect for Multicloud\n  * Go Serverless\n  * Artificial Intelligence\n  * Contact Center AI\n  * Document AI\n  * Product Discovery\n  * APIs and Applications\n  * New Business Channels Using APIs\n  * Unlocking Legacy Applications Using APIs\n  * Open Banking APIx\n  * Databases\n  * Database Migration\n  * Database Modernization\n  * Databases for Games\n  * Google Cloud Databases\n  * Migrate Oracle workloads to Google Cloud\n  * Open Source Databases\n  * SQL Server on Google Cloud\n  * Data Cloud\n  * Databases Solutions\n  * Smart Analytics Solutions\n  * AI Solutions\n  * Data Cloud for ISVs\n  * Data Cloud Alliance\n  * Digital Transformation\n  * Digital Innovation\n  * Operational Efficiency\n  * COVID-19 Solutions\n  * COVID-19 Solutions for the Healthcare Industry\n  * Infrastructure Modernization\n  * Application Migration\n  * SAP on Google Cloud\n  * High Performance Computing\n  * Windows on Google Cloud\n  * Data Center Migration\n  * Active Assist\n  * Virtual Desktops\n  * Rapid Migration Program (RaMP)\n  * Backup and Disaster Recovery\n  * Productivity and Collaboration\n  * Google Workspace\n  * Google Workspace Essentials\n  * Cloud Identity\n  * Chrome Enterprise\n  * Cloud Search\n  * Security\n  * Security Analytics and Operations\n  * Web App and API Protection\n  * Security and Resilience Framework\n  * Risk and compliance as code (RCaC)\n  * Software Supply Chain Security\n  * Security Foundation\n  * Smart Analytics\n  * Data Warehouse Modernization\n  * Data Lake Modernization\n  * Spark on Google Cloud\n  * Stream Analytics\n  * Business Intelligence\n  * Data Science\n  * Marketing Analytics\n  * Geospatial Analytics and AI\n  * Datasets\n  * Startups and SMB\n  * Startup Solutions\n  * Startup Program\n  * Small and Medium Business\n  * Software as a Service\n\n  * Featured Products\n  * Compute Engine\n  * Cloud Storage\n  * BigQuery\n  * Cloud Run\n  * Google Kubernetes Engine\n  * Vertex AI Platform\n  * Looker\n  * Apigee API Management\n  * Cloud SQL\n  * Cloud SDK\n  * Cloud CDN\n  * See all products (100+)\n  * AI and Machine Learning\n  * Vertex AI Platform\n  * Generative AI on Vertex AI\n  * Vertex AI Search and Conversation\n  * Dialogflow\n  * Natural Language AI\n  * Speech-to-Text\n  * Text-to-Speech\n  * Translation AI\n  * Document AI\n  * Vision AI\n  * Contact Center AI\n  * See all AI and machine learning products\n  * Business Intelligence\n  * Looker\n  * Looker Studio\n  * Compute\n  * Compute Engine\n  * App Engine\n  * Cloud GPUs\n  * Migrate to Virtual Machines\n  * Spot VMs\n  * Batch\n  * Sole-Tenant Nodes\n  * Bare Metal\n  * Recommender\n  * VMware Engine\n  * Cloud Run\n  * See all compute products\n  * Containers\n  * Google Kubernetes Engine\n  * Cloud Run\n  * Cloud Build\n  * Artifact Registry\n  * Cloud Code\n  * Cloud Deploy\n  * Migrate to Containers\n  * Deep Learning Containers\n  * Knative\n  * Data Analytics\n  * BigQuery\n  * Looker\n  * Dataflow\n  * Pub/Sub\n  * Dataproc\n  * Cloud Data Fusion\n  * Cloud Composer\n  * Dataprep\n  * Dataplex\n  * Dataform\n  * Analytics Hub\n  * See all data analytics products\n  * Databases\n  * AlloyDB for PostgreSQL\n  * Cloud SQL\n  * Firestore\n  * Cloud Spanner\n  * Cloud Bigtable\n  * Datastream\n  * Database Migration Service\n  * Developer Tools\n  * Artifact Registry\n  * Cloud Code\n  * Cloud Build\n  * Cloud Deploy\n  * Cloud Deployment Manager\n  * Cloud SDK\n  * Cloud Scheduler\n  * Cloud Source Repositories\n  * Cloud Tasks\n  * Cloud Workstations\n  * Tools for PowerShell\n  * See all developer tools\n  * Distributed Cloud\n  * Google Distributed Cloud Edge\n  * Google Distributed Cloud Hosted\n  * Hybrid and Multicloud\n  * Google Kubernetes Engine\n  * Apigee API Management\n  * Migrate to Containers\n  * Traffic Director\n  * Cloud Build\n  * Operations\n  * Anthos\n  * Distributed Cloud\n  * Industry Specific\n  * Anti Money Laundering AI\n  * Cloud Healthcare API\n  * Device Connect for Fitbit\n  * Telecom Network Automation\n  * Telecom Data Fabric\n  * Telecom Subscriber Insights\n  * Spectrum Access System (SAS)\n  * Integration Services\n  * Application Integration\n  * Workflows\n  * Apigee API Management\n  * Cloud Tasks\n  * Cloud Scheduler\n  * Dataproc\n  * Cloud Data Fusion\n  * Cloud Composer\n  * Pub/Sub\n  * Eventarc\n  * Management Tools\n  * Cloud Shell\n  * Cloud console\n  * Cloud Endpoints\n  * Cloud IAM\n  * Cloud APIs\n  * Service Catalog\n  * Cost Management\n  * Operations\n  * Carbon Footprint\n  * Config Connector\n  * Active Assist\n  * See all management tools\n  * Maps and Geospatial\n  * Earth Engine\n  * Google Maps Platform\n  * Media Services\n  * Cloud CDN\n  * Live Steam API\n  * OpenCue\n  * Transcoder API\n  * Video Stitcher API\n  * Migration\n  * Migration Center\n  * Application Migration\n  * Migrate to Virtual Machines\n  * Cloud Foundation Toolkit\n  * Database Migration Service\n  * Migrate to Containers\n  * BigQuery Data Transfer Service\n  * Rapid Migration Program (RaMP)\n  * Transfer Appliance\n  * Storage Transfer Service\n  * VMware Engine\n  * Mixed Reality\n  * Immersive Stream for XR\n  * Networking\n  * Cloud Armor\n  * Cloud CDN and Media CDN\n  * Cloud DNS\n  * Cloud Load Balancing\n  * Cloud NAT\n  * Cloud Connectivity\n  * Network Connectivity Center\n  * Network Intelligence Center\n  * Network Service Tiers\n  * Virtual Private Cloud\n  * Private Service Connect\n  * See all networking products\n  * Operations\n  * Cloud Logging\n  * Cloud Monitoring\n  * Error Reporting\n  * Cloud Debugger\n  * Cloud Trace\n  * Cloud Profiler\n  * Productivity and Collaboration\n  * AppSheet\n  * Appsheet Automation\n  * Google Workspace\n  * Google Workspace Essentials\n  * Duet AI for Workspace\n  * Cloud Identity\n  * Chrome Enterprise\n  * Security and Identity\n  * Cloud IAM\n  * Assured Workloads\n  * Cloud Key Management\n  * Confidential Computing\n  * Security Command Center\n  * Cloud Data Loss Prevention\n  * Mandiant Products and Services\n  * Chronicle SIEM\n  * Chronicle Security Operations\n  * Secret Manager\n  * BeyondCorp Enterprise\n  * See all security and identity products\n  * Serverless\n  * Cloud Run\n  * Cloud Functions\n  * App Engine\n  * Workflows\n  * API Gateway\n  * Storage\n  * Cloud Storage\n  * Backup and DR Service\n  * Filestore\n  * Persistent Disk\n  * Cloud Storage for Firebase\n  * Local SSD\n  * Storage Transfer Service\n  * Web3\n  * Blockchain Node Engine\n\n  * Save money with our transparent approach to pricing\n  * Request a quote\n  * Pricing overview and tools\n  * Google Cloud pricing\n  * Pricing calculator\n  * Google Cloud free tier\n  * Cost optimization framework\n  * Cost management tools\n  * Product-specific Pricing\n  * Compute Engine\n  * Cloud SQL\n  * Google Kubernetes Engine\n  * Cloud Storage\n  * BigQuery\n  * See full price list with 100+ products\n\n  * Learn & build\n  * Google Cloud Free Program\n  * Quickstarts\n  * Cloud computing basics\n  * Blog\n  * Learning Hub\n  * Training\n  * Certification\n  * Cloud Architecture Center\n  * Connect\n  * Innovators\n  * Developer Center\n  * Events and webinars\n  * Google Cloud Community\n  * Third-party tools and partners\n  * Google Cloud Marketplace\n  * Google Cloud partners\n  * Become a partner\n\n  * ### Why Google\n\n    * Choosing Google Cloud\n    * Trust and security\n    * Open cloud\n    * Multicloud\n    * Global infrastructure\n    * Customers and case studies\n    * Analyst reports\n    * Whitepapers\n    * Blog\n  * ### Products and pricing\n\n    * Google Cloud pricing\n    * Google Workspace pricing\n    * See all products\n  * ### Solutions\n\n    * Infrastructure modernization\n    * Databases\n    * Application modernization\n    * Smart analytics\n    * Artificial Intelligence\n    * Security\n    * Productivity & work transformation\n    * Industry solutions\n    * DevOps solutions\n    * Small business solutions\n    * See all solutions\n  * ### Resources\n\n    * Google Cloud documentation\n    * Google Cloud quickstarts\n    * Google Cloud Marketplace\n    * Learn about cloud computing\n    * Support\n    * Code samples\n    * Cloud Architecture Center\n    * Training\n    * Certifications\n    * Google Developers\n    * Google Cloud for Startups\n    * System status\n    * Release Notes\n  * ### Engage\n\n    * Contact sales\n    * Find a Partner\n    * Become a Partner\n    * Events\n    * Podcasts\n    * Developer Center\n    * Press Corner\n    * Google Cloud on YouTube\n    * Google Cloud Tech on YouTube\n    * Follow on Twitter\n    * Join User Research\n    * We're hiring. Join Google Cloud!\n    * Google Cloud Community\n\n  * About Google\n  * Privacy\n  * Site terms\n  * Google Cloud terms\n  * Our third decade of climate action: join us\n  * Sign up for the Google Cloud newsletterSubscribe\n\n_language_ ‪English‬\n\n  * ‪English‬\n  * ‪Deutsch‬\n  * ‪Español‬\n  * ‪Español (Latinoamérica)‬\n  * ‪Français‬\n  * ‪Indonesia‬\n  * ‪Italiano‬\n  * ‪Português (Brasil)‬\n  * ‪简体中文‬\n  * ‪繁體中文‬\n  * ‪日本語‬\n  * ‪한국어‬\n\n",
    "links": "[{\"link\": \"https://cloud.google.com/gpu#section-1\", \"text\": \"Key features\"}, {\"link\": \"https://cloud.google.com/gpu#section-2\", \"text\": \"What's new\"}, {\"link\": \"https://cloud.google.com/gpu#section-3\", \"text\": \"Documentation\"}, {\"link\": \"https://cloud.google.com/gpu#section-4\", \"text\": \"Pricing\"}, {\"link\": \"https://cloud.google.com/gpu#section-5\", \"text\": \"Take the next step\"}, {\"link\": \"https://cloud.google.com/blog/products/ai-machine-learning/cheaper-cloud-ai-deployments-with-nvidia-t4-gpu-price-cut\", \"text\": \"\"}, {\"link\": \"https://cloud.google.com/kubernetes-engine/docs/how-to/gpus\", \"text\": \"Learn more\"}, {\"link\": \"https://cloud.google.com/compute/docs/gpus\", \"text\": \"View all product documentation\"}, {\"link\": \"https://cloud.google.com/ai-platform/deep-learning-vm/docs/create-vm-instance-gcloud\", \"text\": \"Get a quick intro to using this product.\"}, {\"link\": \"https://cloud.google.com/compute/docs/gpus/add-gpus#create-new-gpu-instance\", \"text\": \"Learn to complete specific tasks with this product.\"}, {\"link\": \"https://cloud.google.com/compute/docs/tutorials/ml-inference-t4\", \"text\": \"Browse walkthroughs of common uses and scenarios for                this product.\"}, {\"link\": \"https://cloud.google.com/compute/docs/gpus\", \"text\": \"View APIs, references, and other resources for this product.\"}, {\"link\": \"https://cloud.google.com/compute/gpus-pricing\", \"text\": \"GPU pricing document\"}, {\"link\": \"https://cloud.google.com/compute/gpus-pricing\", \"text\": \"View pricing details\"}, {\"link\": \"https://cloud.google.com/gpu/\", \"text\": \"\"}, {\"link\": \"https://cloud.google.com/gpu/\", \"text\": \"Cloud GPUs\"}]",
    "priceAndPlans": "Catch up on the latest product launches, demos, and trainings from Next '23.\nLet's go.\n\nJump to\n\nCloud GPUsKey featuresWhat's newDocumentationPricingTake the next step\n\n# Cloud GPUs\n\nHigh-performance GPUs on Google Cloud for machine learning, scientific\ncomputing, and generative AI.\n\nTry Google Cloud free\n\n  * Speed up compute jobs like generative AI, 3D visualization, and HPC\n\n  * A wide selection of GPUs to match a range of performance and price points\n\n  * Flexible pricing and machine customizations to optimize for your workload\n\nKey features\n\n## Key features\n\n### A range of GPU types\n\nNVIDIA H100, L4, P100, P4, T4, V100, and A100 GPUs provide a range of compute\noptions to cover your workloads for a broad set of cost and performance needs.\n\n### Flexible performance\n\nOptimally balance the processor, memory, high performance disk, and up to 8\nGPUs per instance for your individual workload. All with the per-second\nbilling, so you only pay only for what you need while you are using it.\n\n### All the benefits of Google Cloud\n\nRun GPU workloads on Google Cloud where you have access to industry-leading\nstorage, networking, and data analytics technologies.\n\nWhat's new\n\n## What's new\n\nSign up for Google Cloud newsletters to receive product updates, event\ninformation, special offers, and more.\n\nBlog post\n\nA3 supercomputers with NVIDIA H100 GPUs, purpose-built for AIRead the blog\n\nReport\n\nIntroducing G2 VMs with NVIDIA L4 GPUs — a cloud-industry firstLearn more\n\nBlog post\n\nCheaper Cloud AI deployments with NVIDIA T4Read the blog\n\nVideo\n\nNext: An overview of Cloud GPU for ML and HPCWatch video\n\nEvent\n\nWebinar: 8 reasons to run your ML workloads on NVIDIA T4 GPUsRegister now\n\nDocumentation\n\n## Documentation\n\nGoogle Cloud Basics\n\n###  GPUs on Compute Engine\n\nCompute Engine provides GPUs that you can add to your virtual machine\ninstances. Learn what you can do with GPUs and what types of GPU hardware are\navailable.\n\nLearn more\n\nTutorial\n\n###  Adding or removing GPUs on Compute Engine\n\nLearn how to add or remove GPUs from a Compute Engine VM.\n\nLearn more\n\nTutorial\n\n### Installing GPUs drivers\n\nThis guide shows ways to install NVIDIA proprietary drivers after you’ve\ncreated an instance with one or more GPUs.\n\nLearn more\n\nTutorial\n\n### GPUs on Google Kubernetes Engine\n\nLearn how to use GPU hardware accelerators in your Google Kubernetes Engine\nclusters’ nodes.\n\nLearn more\n\nGoogle Cloud Basics\n\n###  Using GPUs for training models in the cloud\n\nAccelerate the training process for many deep learning models, like image\nclassification, video analysis, and natural language processing.\n\nLearn more\n\nGoogle Cloud Basics\n\n###  Attaching GPUs to Dataproc clusters\n\nAttach GPUs to the master and worker Compute Engine nodes in a Dataproc\ncluster to accelerate specific workloads, such as machine learning and data\nprocessing.\n\nLearn more\n\n### Not seeing what you’re looking for?\n\nView all product documentation\n\n### Explore more docs\n\n  * Get a quick intro to using this product.\n\n  * Learn to complete specific tasks with this product.\n\n  * Browse walkthroughs of common uses and scenarios for this product.\n\n  * View APIs, references, and other resources for this product.\n\nPricing\n\n### Pricing\n\nFor information about GPU pricing for the different GPU types and regions that\nare available on Compute Engine, refer to the GPU pricing document.\n\nView pricing details\n\n#### Take the next step\n\nStart building on Google Cloud with $300 in free credits and 20+ always free\nproducts.\n\nTry Google Cloud free\n\n  * ##### Need help getting started?\n\nContact sales\n\n  * ##### Work with a trusted partner\n\nFind a partner\n\n  * ##### Continue browsing\n\nSee all products\n\nmenu\n\nOverviewSolutionsProductsPricingResourcesDocsSupportContact Us\n\n\n\nDocsSupport\n\n_language_ ‪English‬\n\n  * ‪English‬\n  * ‪Deutsch‬\n  * ‪Español‬\n  * ‪Español (Latinoamérica)‬\n  * ‪Français‬\n  * ‪Indonesia‬\n  * ‪Italiano‬\n  * ‪Português (Brasil)‬\n  * ‪简体中文‬\n  * ‪繁體中文‬\n  * ‪日本語‬\n  * ‪한국어‬\n\nConsole\n\nSign in\n\nStart free\n\nStart free\n\nContact Us\n\nclose\n\n  * Accelerate your digital transformation\n  * Whether your business is early in its journey or well on its way to digital transformation, Google Cloud can help solve your toughest challenges.\n  * Learn more\n\n  * Key benefits\n  * Why Google Cloud\n\nTop reasons businesses choose us.\n\n  * AI and ML\n\nGet enterprise-ready AI.\n\n  * Multicloud\n\nRun your apps wherever you need them.\n\n  * Global infrastructure\n\nBuild on the same infrastructure as Google.\n\n  * Data Cloud\n\nMake smarter decisions with unified data.\n\n  * Open cloud\n\nScale with open, flexible technology.\n\n  * Trust and security\n\nKeep your data secure and compliant.\n\n  * Productivity and collaboration\n\nConnect your teams with AI-powered apps.\n\n  * Reports and insights\n  * Executive insights\n\nCurated C-suite perspectives.\n\n  * Analyst reports\n\nRead what industry analysts say about us.\n\n  * Whitepapers\n\nBrowse and download popular whitepapers.\n\n  * Customer stories\n\nExplore case studies and videos.\n\nclose\n\n  * Industry Solutions\n  * Application Modernization\n  * Artificial Intelligence\n  * APIs and Applications\n  * Databases\n  * Data Cloud\n  * Digital Transformation\n  * Infrastructure Modernization\n  * Productivity and Collaboration\n  * Security\n  * Smart Analytics\n  * Startups and SMB\n\nSee all solutions\n\n  * Industry Solutions\n\nReduce cost, increase operational agility, and capture new market\nopportunities.\n\n  * Retail\n\nAnalytics and collaboration tools for the retail value chain.\n\n  * Consumer Packaged Goods\n\nSolutions for CPG digital transformation and brand growth.\n\n  * Financial Services\n\nComputing, data management, and analytics tools for financial services.\n\n  * Healthcare and Life Sciences\n\nAdvance research at scale and empower healthcare innovation.\n\n  * Media and Entertainment\n\nSolutions for content production and distribution operations.\n\n  * Telecommunications\n\nHybrid and multi-cloud services to deploy and monetize 5G.\n\n  * Games\n\nAI-driven solutions to build and scale games faster.\n\n  * Manufacturing\n\nMigration and AI tools to optimize the manufacturing value chain.\n\n  * Supply Chain and Logistics\n\nEnable sustainable, efficient, and resilient data-driven operations across\nsupply chain and logistics operations.\n\n  * Government\n\nData storage, AI, and analytics solutions for government agencies.\n\n  * Education\n\nTeaching tools to provide more engaging learning experiences.\n\n  * Not seeing what you're looking for?\n  * See all industry solutions\n\n  * Application Modernization\n\nAssess, plan, implement, and measure software practices and capabilities to\nmodernize and simplify your organization’s business application portfolios.\n\n  * CAMP\n\nProgram that uses DORA to improve your software delivery capabilities.\n\n  * Modernize Traditional Applications\n\nAnalyze, categorize, and get started with cloud migration on traditional\nworkloads.\n\n  * Migrate from PaaS: Cloud Foundry, Openshift\n\nTools for moving your existing containers into Google's managed container\nservices.\n\n  * Migrate from Mainframe\n\nAutomated tools and prescriptive guidance for moving your mainframe apps to\nthe cloud.\n\n  * Modernize Software Delivery\n\nSoftware supply chain best practices - innerloop productivity, CI/CD and S3C.\n\n  * DevOps Best Practices\n\nProcesses and resources for implementing DevOps in your org.\n\n  * SRE Principles\n\nTools and resources for adopting SRE in your org.\n\n  * Day 2 Operations for GKE\n\nTools and guidance for effective GKE management and monitoring.\n\n  * FinOps and Optimization of GKE\n\nBest practices for running reliable, performant, and cost effective\napplications on GKE.\n\n  * Run Applications at the Edge\n\nGuidance for localized and low latency apps on Google’s hardware agnostic edge\nsolution.\n\n  * Architect for Multicloud\n\nManage workloads across multiple clouds with a consistent platform.\n\n  * Go Serverless\n\nFully managed environment for developing, deploying and scaling apps.\n\n  * Artificial Intelligence\n\nAdd intelligence and efficiency to your business with AI and machine learning.\n\n  * Contact Center AI\n\nAI model for speaking with customers and assisting human agents.\n\n  * Document AI\n\nDocument processing and data capture automated at scale.\n\n  * Product Discovery\n\nGoogle-quality search and product recommendations for retailers.\n\n  * APIs and Applications\n\nSpeed up the pace of innovation without coding, using APIs, apps, and\nautomation.\n\n  * New Business Channels Using APIs\n\nAttract and empower an ecosystem of developers and partners.\n\n  * Unlocking Legacy Applications Using APIs\n\nCloud services for extending and modernizing legacy apps.\n\n  * Open Banking APIx\n\nSimplify and accelerate secure delivery of open banking compliant APIs.\n\n  * Databases\n\nMigrate and manage enterprise data with security, reliability, high\navailability, and fully managed data services.\n\n  * Database Migration\n\nGuides and tools to simplify your database migration life cycle.\n\n  * Database Modernization\n\nUpgrades to modernize your operational database infrastructure.\n\n  * Databases for Games\n\nBuild global, live games with Google Cloud databases.\n\n  * Google Cloud Databases\n\nDatabase services to migrate, manage, and modernize data.\n\n  * Migrate Oracle workloads to Google Cloud\n\nRehost, replatform, rewrite your Oracle workloads.\n\n  * Open Source Databases\n\nFully managed open source databases with enterprise-grade support.\n\n  * SQL Server on Google Cloud\n\nOptions for running SQL Server virtual machines on Google Cloud.\n\n  * Data Cloud\n\nUnify data across your organization with an open and simplified approach to\ndata-driven transformation that is unmatched for speed, scale, and security\nwith AI built-in.\n\n  * Databases Solutions\n\nMigrate and manage enterprise data with security, reliability, high\navailability, and fully managed data services.\n\n  * Smart Analytics Solutions\n\nGenerate instant insights from data at any scale with a serverless, fully\nmanaged analytics platform that significantly simplifies analytics.\n\n  * AI Solutions\n\nAdd intelligence and efficiency to your business with AI and machine learning.\n\n  * Data Cloud for ISVs\n\nInnovate, optimize and amplify your SaaS applications using Google's data and\nmachine learning solutions such as BigQuery, Looker, Spanner and Vertex AI.\n\n  * Data Cloud Alliance\n\nAn initiative to ensure that global businesses have more seamless access and\ninsights into the data required for digital transformation.\n\n  * Digital Transformation\n  * Accelerate business recovery and ensure a better future with solutions that enable hybrid and multi-cloud, generate intelligent insights, and keep your workers connected.\n\n  * Digital Innovation\n\nReimagine your operations and unlock new opportunities.\n\n  * Operational Efficiency\n\nPrioritize investments and optimize costs.\n\n  * COVID-19 Solutions\n\nGet work done more safely and securely.\n\n  * COVID-19 Solutions for the Healthcare Industry\n\nHow Google is helping healthcare meet extraordinary challenges.\n\n  * Infrastructure Modernization\n\nMigrate quickly with solutions for SAP, VMware, Windows, Oracle, and other\nworkloads.\n\n  * Application Migration\n\nDiscovery and analysis tools for moving to the cloud.\n\n  * SAP on Google Cloud\n\nCertifications for running SAP applications and SAP HANA.\n\n  * High Performance Computing\n\nCompute, storage, and networking options to support any workload.\n\n  * Windows on Google Cloud\n\nTools and partners for running Windows workloads.\n\n  * Data Center Migration\n\nMigration solutions for VMs, apps, databases, and more.\n\n  * Active Assist\n\nAutomatic cloud resource optimization and increased security.\n\n  * Virtual Desktops\n\nRemote work solutions for desktops and applications (VDI & DaaS).\n\n  * Rapid Migration Program (RaMP)\n\nEnd-to-end migration program to simplify your path to the cloud.\n\n  * Backup and Disaster Recovery\n\nEnsure your business continuity needs are met.\n\n  * Productivity and Collaboration\n\nChange the way teams work with solutions designed for humans and built for\nimpact.\n\n  * Google Workspace\n\nCollaboration and productivity tools for enterprises.\n\n  * Google Workspace Essentials\n\nSecure video meetings and modern collaboration for teams.\n\n  * Cloud Identity\n\nUnified platform for IT admins to manage user devices and apps.\n\n  * Chrome Enterprise\n\nChromeOS, Chrome Browser, and Chrome devices built for business.\n\n  * Cloud Search\n\nEnterprise search for employees to quickly find company information.\n\n  * Security\n\nDetect, investigate, and respond to online threats to help protect your\nbusiness.\n\n  * Security Analytics and Operations\n\nSolution for analyzing petabytes of security telemetry.\n\n  * Web App and API Protection\n\nThreat and fraud protection for your web applications and APIs.\n\n  * Security and Resilience Framework\n\nSolutions for each phase of the security and resilience life cycle.\n\n  * Risk and compliance as code (RCaC)\n\nSolution to modernize your governance, risk, and compliance function with\nautomation.\n\n  * Software Supply Chain Security\n\nSolution for improving end-to-end software supply chain security.\n\n  * Security Foundation\n\nRecommended products to help achieve a strong security posture.\n\n  * Smart Analytics\n\nGenerate instant insights from data at any scale with a serverless, fully\nmanaged analytics platform that significantly simplifies analytics.\n\n  * Data Warehouse Modernization\n\nData warehouse to jumpstart your migration and unlock insights.\n\n  * Data Lake Modernization\n\nServices for building and modernizing your data lake.\n\n  * Spark on Google Cloud\n\nRun and write Spark where you need it, serverless and integrated.\n\n  * Stream Analytics\n\nInsights from ingesting, processing, and analyzing event streams.\n\n  * Business Intelligence\n\nSolutions for modernizing your BI stack and creating rich data experiences.\n\n  * Data Science\n\nPut your data to work with Data Science on Google Cloud.\n\n  * Marketing Analytics\n\nSolutions for collecting, analyzing, and activating customer data.\n\n  * Geospatial Analytics and AI\n\nSolutions for building a more prosperous and sustainable business.\n\n  * Datasets\n\nData from Google, public, and commercial providers to enrich your analytics\nand AI initiatives.\n\n  * Startups and SMB\n\nAccelerate startup and SMB growth with tailored solutions and programs.\n\n  * Startup Solutions\n\nGrow your startup and solve your toughest challenges using Google’s proven\ntechnology.\n\n  * Startup Program\n\nGet financial, business, and technical support to take your startup to the\nnext level.\n\n  * Small and Medium Business\n\nExplore solutions for web hosting, app development, AI, and analytics.\n\n  * Software as a Service\n\nBuild better SaaS products, scale efficiently, and grow your business.\n\nclose\n\n  * Featured Products\n  * AI and Machine Learning\n  * Business Intelligence\n  * Compute\n  * Containers\n  * Data Analytics\n  * Databases\n  * Developer Tools\n  * Distributed Cloud\n  * Hybrid and Multicloud\n  * Industry Specific\n  * Integration Services\n  * Management Tools\n  * Maps and Geospatial\n  * Media Services\n  * Migration\n  * Mixed Reality\n  * Networking\n  * Operations\n  * Productivity and Collaboration\n  * Security and Identity\n  * Serverless\n  * Storage\n  * Web3\n\nSee all products (100+)\n\n  * Featured Products\n\n  * Compute Engine\n\nVirtual machines running in Google’s data center.\n\n  * Cloud Storage\n\nObject storage that’s secure, durable, and scalable.\n\n  * BigQuery\n\nData warehouse for business agility and insights.\n\n  * Cloud Run\n\nFully managed environment for running containerized apps.\n\n  * Google Kubernetes Engine\n\nManaged environment for running containerized apps.\n\n  * Vertex AI Platform\n\nUnified platform for ML models and generative AI.\n\n  * Looker\n\nPlatform for BI, data applications, and embedded analytics.\n\n  * Apigee API Management\n\nManage the full life cycle of APIs anywhere with visibility and control.\n\n  * Cloud SQL\n\nRelational database services for MySQL, PostgreSQL and SQL Server.\n\n  * Cloud SDK\n\nCommand-line tools and libraries for Google Cloud.\n\n  * Cloud CDN\n\nContent delivery network for delivering web and video.\n\n  * Not seeing what you're looking for?\n  * See all products (100+)\n\n  * AI and Machine Learning\n\n  * Vertex AI Platform\n\nUnified platform for ML models and generative AI.\n\n  * Generative AI on Vertex AI\n\nBuild, tune, and deploy foundation models on Vertex AI.\n\n  * Vertex AI Search and Conversation\n\nGenerative AI apps for search and conversational AI.\n\n  * Dialogflow\n\nLifelike conversational AI with state-of-the-art virtual agents.\n\n  * Natural Language AI\n\nSentiment analysis and classification of unstructured text.\n\n  * Speech-to-Text\n\nSpeech recognition and transcription across 125 languages.\n\n  * Text-to-Speech\n\nSpeech synthesis in 220+ voices and 40+ languages.\n\n  * Translation AI\n\nLanguage detection, translation, and glossary support.\n\n  * Document AI\n\nDocument processing and data capture automated at scale.\n\n  * Vision AI\n\nCustom and pre-trained models to detect emotion, text, and more.\n\n  * Contact Center AI\n\nAI model for speaking with customers and assisting human agents.\n\n  * Not seeing what you're looking for?\n  * See all AI and machine learning products\n\n  * Business Intelligence\n\n  * Looker\n\nPlatform for BI, data applications, and embedded analytics.\n\n  * Looker Studio\n\nInteractive data suite for dashboarding, reporting, and analytics.\n\n  * Compute\n\n  * Compute Engine\n\nVirtual machines running in Google’s data center.\n\n  * App Engine\n\nServerless application platform for apps and back ends.\n\n  * Cloud GPUs\n\nGPUs for ML, scientific computing, and 3D visualization.\n\n  * Migrate to Virtual Machines\n\nServer and virtual machine migration to Compute Engine.\n\n  * Spot VMs\n\nCompute instances for batch jobs and fault-tolerant workloads.\n\n  * Batch\n\nFully managed service for scheduling batch jobs.\n\n  * Sole-Tenant Nodes\n\nDedicated hardware for compliance, licensing, and management.\n\n  * Bare Metal\n\nInfrastructure to run specialized workloads on Google Cloud.\n\n  * Recommender\n\nUsage recommendations for Google Cloud products and services.\n\n  * VMware Engine\n\nFully managed, native VMware Cloud Foundation software stack.\n\n  * Cloud Run\n\nFully managed environment for running containerized apps.\n\n  * Not seeing what you're looking for?\n  * See all compute products\n\n  * Containers\n\n  * Google Kubernetes Engine\n\nManaged environment for running containerized apps.\n\n  * Cloud Run\n\nFully managed environment for running containerized apps.\n\n  * Cloud Build\n\nSolution for running build steps in a Docker container.\n\n  * Artifact Registry\n\nPackage manager for build artifacts and dependencies.\n\n  * Cloud Code\n\nIDE support to write, run, and debug Kubernetes applications.\n\n  * Cloud Deploy\n\nFully managed continuous delivery to GKE and Cloud Run.\n\n  * Migrate to Containers\n\nComponents for migrating VMs into system containers on GKE.\n\n  * Deep Learning Containers\n\nContainers with data science frameworks, libraries, and tools.\n\n  * Knative\n\nComponents to create Kubernetes-native cloud-based software.\n\n  * Data Analytics\n\n  * BigQuery\n\nData warehouse for business agility and insights.\n\n  * Looker\n\nPlatform for BI, data applications, and embedded analytics.\n\n  * Dataflow\n\nStreaming analytics for stream and batch processing.\n\n  * Pub/Sub\n\nMessaging service for event ingestion and delivery.\n\n  * Dataproc\n\nService for running Apache Spark and Apache Hadoop clusters.\n\n  * Cloud Data Fusion\n\nData integration for building and managing data pipelines.\n\n  * Cloud Composer\n\nWorkflow orchestration service built on Apache Airflow.\n\n  * Dataprep\n\nService to prepare data for analysis and machine learning.\n\n  * Dataplex\n\nIntelligent data fabric for unifying data management across silos.\n\n  * Dataform\n\nBuild, version control, and deploy SQL workflows in BigQuery.\n\n  * Analytics Hub\n\nService for securely and efficiently exchanging data analytics assets.\n\n  * Not seeing what you're looking for?\n  * See all data analytics products\n\n  * Databases\n\n  * AlloyDB for PostgreSQL\n\nFully managed, PostgreSQL-compatible database for enterprise workloads.\n\n  * Cloud SQL\n\nFully managed database for MySQL, PostgreSQL, and SQL Server.\n\n  * Firestore\n\nCloud-native document database for building rich mobile, web, and IoT apps.\n\n  * Cloud Spanner\n\nCloud-native relational database with unlimited scale and 99.999%\navailability.\n\n  * Cloud Bigtable\n\nCloud-native wide-column database for large-scale, low-latency workloads.\n\n  * Datastream\n\nServerless change data capture and replication service.\n\n  * Database Migration Service\n\nServerless, minimal downtime migrations to Cloud SQL.\n\n  * Developer Tools\n\n  * Artifact Registry\n\nUniversal package manager for build artifacts and dependencies.\n\n  * Cloud Code\n\nIDE support to write, run, and debug Kubernetes applications.\n\n  * Cloud Build\n\nContinuous integration and continuous delivery platform.\n\n  * Cloud Deploy\n\nFully managed continuous delivery to GKE and Cloud Run.\n\n  * Cloud Deployment Manager\n\nService for creating and managing Google Cloud resources.\n\n  * Cloud SDK\n\nCommand-line tools and libraries for Google Cloud.\n\n  * Cloud Scheduler\n\nCron job scheduler for task automation and management.\n\n  * Cloud Source Repositories\n\nPrivate Git repository to store, manage, and track code.\n\n  * Cloud Tasks\n\nTask management service for asynchronous task execution.\n\n  * Cloud Workstations\n\nManaged and secure development environments in the cloud.\n\n  * Tools for PowerShell\n\nFull cloud control from Windows PowerShell.\n\n  * Not seeing what you're looking for?\n  * See all developer tools\n\n  * Distributed Cloud\n\n  * Google Distributed Cloud Edge\n\nDistributed cloud services for edge workloads.\n\n  * Google Distributed Cloud Hosted\n\nDistributed cloud for air-gapped workloads.\n\n  * Hybrid and Multicloud\n\n  * Google Kubernetes Engine\n\nManaged environment for running containerized apps.\n\n  * Apigee API Management\n\nAPI management, development, and security platform.\n\n  * Migrate to Containers\n\nTool to move workloads and existing applications to GKE.\n\n  * Traffic Director\n\nTraffic control pane and management for open service mesh.\n\n  * Cloud Build\n\nService for executing builds on Google Cloud infrastructure.\n\n  * Operations\n\nMonitoring, logging, and application performance suite.\n\n  * Anthos\n\nPlatform for modernizing existing apps and building new ones.\n\n  * Distributed Cloud\n\nFully managed solutions for the edge and data centers.\n\n  * Industry Specific\n\n  * Anti Money Laundering AI\n\nDetect suspicious, potential money laundering activity with AI.\n\n  * Cloud Healthcare API\n\nSolution for bridging existing care systems and apps on Google Cloud.\n\n  * Device Connect for Fitbit\n\nGain a 360-degree patient view with connected Fitbit data on Google Cloud.\n\n  * Telecom Network Automation\n\nReady to use cloud-native automation for telecom networks.\n\n  * Telecom Data Fabric\n\nTelecom data management and analytics with an automated approach.\n\n  * Telecom Subscriber Insights\n\nIngests data to improve subscriber acquisition and retention.\n\n  * Spectrum Access System (SAS)\n\nControls fundamental access to the Citizens Broadband Radio Service (CBRS).\n\n  * Integration Services\n\n  * Application Integration\n\nConnect to 3rd party apps and enable data consistency without code.\n\n  * Workflows\n\nWorkflow orchestration for serverless products and API services.\n\n  * Apigee API Management\n\nManage the full life cycle of APIs anywhere with visibility and control.\n\n  * Cloud Tasks\n\nTask management service for asynchronous task execution.\n\n  * Cloud Scheduler\n\nCron job scheduler for task automation and management.\n\n  * Dataproc\n\nService for running Apache Spark and Apache Hadoop clusters.\n\n  * Cloud Data Fusion\n\nData integration for building and managing data pipelines.\n\n  * Cloud Composer\n\nWorkflow orchestration service built on Apache Airflow.\n\n  * Pub/Sub\n\nMessaging service for event ingestion and delivery.\n\n  * Eventarc\n\nBuild an event-driven architecture that can connect any service.\n\n  * Management Tools\n\n  * Cloud Shell\n\nInteractive shell environment with a built-in command line.\n\n  * Cloud console\n\nWeb-based interface for managing and monitoring cloud apps.\n\n  * Cloud Endpoints\n\nDeployment and development management for APIs on Google Cloud.\n\n  * Cloud IAM\n\nPermissions management system for Google Cloud resources.\n\n  * Cloud APIs\n\nProgrammatic interfaces for Google Cloud services.\n\n  * Service Catalog\n\nService catalog for admins managing internal enterprise solutions.\n\n  * Cost Management\n\nTools for monitoring, controlling, and optimizing your costs.\n\n  * Operations\n\nMonitoring, logging, and application performance suite.\n\n  * Carbon Footprint\n\nDashboard to view and export Google Cloud carbon emissions reports.\n\n  * Config Connector\n\nKubernetes add-on for managing Google Cloud resources.\n\n  * Active Assist\n\nTools for easily managing performance, security, and cost.\n\n  * Not seeing what you're looking for?\n  * See all management tools\n\n  * Maps and Geospatial\n\n  * Earth Engine\n\nGeospatial platform for Earth observation data and analysis.\n\n  * Google Maps Platform\n\nCreate immersive location experiences and improve business operations.\n\n  * Media Services\n\n  * Cloud CDN\n\nContent delivery network for serving web and video content.\n\n  * Live Steam API\n\nService to convert live video and package for streaming.\n\n  * OpenCue\n\nOpen source render manager for visual effects and animation.\n\n  * Transcoder API\n\nConvert video files and package them for optimized delivery.\n\n  * Video Stitcher API\n\nService for dynamic or server side ad insertion.\n\n  * Migration\n\n  * Migration Center\n\nUnified platform for migrating and modernizing with Google Cloud.\n\n  * Application Migration\n\nApp migration to the cloud for low-cost refresh cycles.\n\n  * Migrate to Virtual Machines\n\nComponents for migrating VMs and physical servers to Compute Engine.\n\n  * Cloud Foundation Toolkit\n\nReference templates for Deployment Manager and Terraform.\n\n  * Database Migration Service\n\nServerless, minimal downtime migrations to Cloud SQL.\n\n  * Migrate to Containers\n\nComponents for migrating VMs into system containers on GKE.\n\n  * BigQuery Data Transfer Service\n\nData import service for scheduling and moving data into BigQuery.\n\n  * Rapid Migration Program (RaMP)\n\nEnd-to-end migration program to simplify your path to the cloud.\n\n  * Transfer Appliance\n\nStorage server for moving large volumes of data to Google Cloud.\n\n  * Storage Transfer Service\n\nData transfers from online and on-premises sources to Cloud Storage.\n\n  * VMware Engine\n\nMigrate and run your VMware workloads natively on Google Cloud.\n\n  * Mixed Reality\n\n  * Immersive Stream for XR\n\nHosts, renders, and streams 3D and XR experiences.\n\n  * Networking\n\n  * Cloud Armor\n\nSecurity policies and defense against web and DDoS attacks.\n\n  * Cloud CDN and Media CDN\n\nContent delivery network for serving web and video content.\n\n  * Cloud DNS\n\nDomain name system for reliable and low-latency name lookups.\n\n  * Cloud Load Balancing\n\nService for distributing traffic across applications and regions.\n\n  * Cloud NAT\n\nNAT service for giving private instances internet access.\n\n  * Cloud Connectivity\n\nConnectivity options for VPN, peering, and enterprise needs.\n\n  * Network Connectivity Center\n\nConnectivity management to help simplify and scale networks.\n\n  * Network Intelligence Center\n\nNetwork monitoring, verification, and optimization platform.\n\n  * Network Service Tiers\n\nCloud network options based on performance, availability, and cost.\n\n  * Virtual Private Cloud\n\nSingle VPC for an entire organization, isolated within projects.\n\n  * Private Service Connect\n\nSecure connection between your VPC and services.\n\n  * Not seeing what you're looking for?\n  * See all networking products\n\n  * Operations\n\n  * Cloud Logging\n\nGoogle Cloud audit, platform, and application logs management.\n\n  * Cloud Monitoring\n\nInfrastructure and application health with rich metrics.\n\n  * Error Reporting\n\nApplication error identification and analysis.\n\n  * Cloud Debugger\n\nReal-time application state inspection and in -production debugging.\n\n  * Cloud Trace\n\nTracing system collecting latency data from applications.\n\n  * Cloud Profiler\n\nCPU and heap profiler for analyzing application performance.\n\n  * Productivity and Collaboration\n\n  * AppSheet\n\nNo-code development platform to build and extend applications.\n\n  * Appsheet Automation\n\nBuild automations and applications on a unified platform.\n\n  * Google Workspace\n\nCollaboration and productivity tools for individuals and organizations.\n\n  * Google Workspace Essentials\n\nSecure video meetings and modern collaboration for teams.\n\n  * Duet AI for Workspace\n\nEmbeds generative AI across Workspace apps.\n\n  * Cloud Identity\n\nUnified platform for IT admins to manage user devices and apps.\n\n  * Chrome Enterprise\n\nChrome OS, Chrome Browser, and Chrome devices built for business.\n\n  * Security and Identity\n\n  * Cloud IAM\n\nPermissions management system for Google Cloud resources.\n\n  * Assured Workloads\n\nCompliance and security controls for sensitive workloads.\n\n  * Cloud Key Management\n\nManage encryption keys on Google Cloud.\n\n  * Confidential Computing\n\nEncrypt data in use with Confidential VMs.\n\n  * Security Command Center\n\nPlatform for defending against threats to your Google Cloud assets.\n\n  * Cloud Data Loss Prevention\n\nSensitive data inspection, classification, and redaction platform.\n\n  * Mandiant Products and Services\n\nCybersecurity technology and expertise from the frontlines.\n\n  * Chronicle SIEM\n\nExtract signals from your security telemetry to find threats instantly.\n\n  * Chronicle Security Operations\n\nDetect, investigate, and respond to cyber threats.\n\n  * Secret Manager\n\nStore API keys, passwords, certificates, and other sensitive data.\n\n  * BeyondCorp Enterprise\n\nZero-trust access control for your internal web apps.\n\n  * Not seeing what you're looking for?\n  * See all security and identity products\n\n  * Serverless\n\n  * Cloud Run\n\nFully managed environment for running containerized apps.\n\n  * Cloud Functions\n\nPlatform for creating functions that respond to cloud events.\n\n  * App Engine\n\nServerless application platform for apps and back ends.\n\n  * Workflows\n\nWorkflow orchestration for serverless products and API services.\n\n  * API Gateway\n\nDevelop, deploy, secure, and manage APIs with a full managed gateway.\n\n  * Storage\n\n  * Cloud Storage\n\nObject storage that’s secure, durable, and scalable.\n\n  * Backup and DR Service\n\nService for centralized, application-consistent data protection.\n\n  * Filestore\n\nFile storage that is highly scalable and secure.\n\n  * Persistent Disk\n\nBlock storage for virtual machine instances running on Google Cloud.\n\n  * Cloud Storage for Firebase\n\nObject storage for storing and serving user-generated content.\n\n  * Local SSD\n\nBlock storage that is locally attached for high-performance needs.\n\n  * Storage Transfer Service\n\nData transfers from online and on-premises sources to Cloud Storage.\n\n  * Web3\n\n  * Blockchain Node Engine\n\nFully managed node hosting for developing on the blockchain.\n\nclose\n\n  * Save money with our transparent approach to pricing\n  * Google Cloud's pay-as-you-go pricing offers automatic savings based on monthly usage and discounted rates for prepaid resources. Contact us today to get a quote.\n  * Request a quote\n\n  * Pricing overview and tools\n  * Google Cloud pricing\n\nPay only for what you use with no lock-in.\n\n  * Pricing calculator\n\nCalculate your cloud savings.\n\n  * Google Cloud free tier\n\nExplore products with free monthly usage.\n\n  * Cost optimization framework\n\nGet best practices to optimize workload costs.\n\n  * Cost management tools\n\nTools to monitor and control your costs.\n\n  * Product-specific Pricing\n  * Compute Engine\n\n  * Cloud SQL\n\n  * Google Kubernetes Engine\n\n  * Cloud Storage\n\n  * BigQuery\n\n  * See full price list with 100+ products\n\nclose\n\n  * Learn & build\n  * Google Cloud Free Program\n\n$300 in free credits and 20+ free products.\n\n  * Quickstarts\n\nGet tutorials and walkthroughs.\n\n  * Cloud computing basics\n\nLearn more about cloud computing topics.\n\n  * Blog\n\nRead our latest product news and stories.\n\n  * Learning Hub\n\nGrow your career with role-based learning\n\n  * Training\n\nEnroll in on-demand or classroom training.\n\n  * Certification\n\nPrepare and register for certifications.\n\n  * Cloud Architecture Center\n\nGet reference architectures and best practices.\n\n  * Connect\n  * Innovators\n\nJoin Google Cloud's developer program.\n\n  * Developer Center\n\nStay in the know and stay connected.\n\n  * Events and webinars\n\nBrowse upcoming and on demand events.\n\n  * Google Cloud Community\n\nAsk questions, find answers, and connect.\n\n  * Third-party tools and partners\n  * Google Cloud Marketplace\n\nDeploy ready-to-go solutions in a few clicks.\n\n  * Google Cloud partners\n\nExplore benefits of working with a partner.\n\n  * Become a partner\n\nJoin the Partner Advantage program.\n\nclose\n\n  * Overview\n    * arrow_forward\n  * Solutions\n    * arrow_forward\n  * Products\n    * arrow_forward\n  * Pricing\n    * arrow_forward\n  * Resources\n    * arrow_forward\n  * Docs\n  * Support\n  * Console\n\n  * Accelerate your digital transformation\n  * Learn more\n  * Key benefits\n  * Why Google Cloud\n  * AI and ML\n  * Multicloud\n  * Global infrastructure\n  * Data Cloud\n  * Open cloud\n  * Trust and security\n  * Productivity and collaboration\n  * Reports and insights\n  * Executive insights\n  * Analyst reports\n  * Whitepapers\n  * Customer stories\n\n  * Industry Solutions\n  * Retail\n  * Consumer Packaged Goods\n  * Financial Services\n  * Healthcare and Life Sciences\n  * Media and Entertainment\n  * Telecommunications\n  * Games\n  * Manufacturing\n  * Supply Chain and Logistics\n  * Government\n  * Education\n  * See all industry solutions\n  * See all solutions\n  * Application Modernization\n  * CAMP\n  * Modernize Traditional Applications\n  * Migrate from PaaS: Cloud Foundry, Openshift\n  * Migrate from Mainframe\n  * Modernize Software Delivery\n  * DevOps Best Practices\n  * SRE Principles\n  * Day 2 Operations for GKE\n  * FinOps and Optimization of GKE\n  * Run Applications at the Edge\n  * Architect for Multicloud\n  * Go Serverless\n  * Artificial Intelligence\n  * Contact Center AI\n  * Document AI\n  * Product Discovery\n  * APIs and Applications\n  * New Business Channels Using APIs\n  * Unlocking Legacy Applications Using APIs\n  * Open Banking APIx\n  * Databases\n  * Database Migration\n  * Database Modernization\n  * Databases for Games\n  * Google Cloud Databases\n  * Migrate Oracle workloads to Google Cloud\n  * Open Source Databases\n  * SQL Server on Google Cloud\n  * Data Cloud\n  * Databases Solutions\n  * Smart Analytics Solutions\n  * AI Solutions\n  * Data Cloud for ISVs\n  * Data Cloud Alliance\n  * Digital Transformation\n  * Digital Innovation\n  * Operational Efficiency\n  * COVID-19 Solutions\n  * COVID-19 Solutions for the Healthcare Industry\n  * Infrastructure Modernization\n  * Application Migration\n  * SAP on Google Cloud\n  * High Performance Computing\n  * Windows on Google Cloud\n  * Data Center Migration\n  * Active Assist\n  * Virtual Desktops\n  * Rapid Migration Program (RaMP)\n  * Backup and Disaster Recovery\n  * Productivity and Collaboration\n  * Google Workspace\n  * Google Workspace Essentials\n  * Cloud Identity\n  * Chrome Enterprise\n  * Cloud Search\n  * Security\n  * Security Analytics and Operations\n  * Web App and API Protection\n  * Security and Resilience Framework\n  * Risk and compliance as code (RCaC)\n  * Software Supply Chain Security\n  * Security Foundation\n  * Smart Analytics\n  * Data Warehouse Modernization\n  * Data Lake Modernization\n  * Spark on Google Cloud\n  * Stream Analytics\n  * Business Intelligence\n  * Data Science\n  * Marketing Analytics\n  * Geospatial Analytics and AI\n  * Datasets\n  * Startups and SMB\n  * Startup Solutions\n  * Startup Program\n  * Small and Medium Business\n  * Software as a Service\n\n  * Featured Products\n  * Compute Engine\n  * Cloud Storage\n  * BigQuery\n  * Cloud Run\n  * Google Kubernetes Engine\n  * Vertex AI Platform\n  * Looker\n  * Apigee API Management\n  * Cloud SQL\n  * Cloud SDK\n  * Cloud CDN\n  * See all products (100+)\n  * AI and Machine Learning\n  * Vertex AI Platform\n  * Generative AI on Vertex AI\n  * Vertex AI Search and Conversation\n  * Dialogflow\n  * Natural Language AI\n  * Speech-to-Text\n  * Text-to-Speech\n  * Translation AI\n  * Document AI\n  * Vision AI\n  * Contact Center AI\n  * See all AI and machine learning products\n  * Business Intelligence\n  * Looker\n  * Looker Studio\n  * Compute\n  * Compute Engine\n  * App Engine\n  * Cloud GPUs\n  * Migrate to Virtual Machines\n  * Spot VMs\n  * Batch\n  * Sole-Tenant Nodes\n  * Bare Metal\n  * Recommender\n  * VMware Engine\n  * Cloud Run\n  * See all compute products\n  * Containers\n  * Google Kubernetes Engine\n  * Cloud Run\n  * Cloud Build\n  * Artifact Registry\n  * Cloud Code\n  * Cloud Deploy\n  * Migrate to Containers\n  * Deep Learning Containers\n  * Knative\n  * Data Analytics\n  * BigQuery\n  * Looker\n  * Dataflow\n  * Pub/Sub\n  * Dataproc\n  * Cloud Data Fusion\n  * Cloud Composer\n  * Dataprep\n  * Dataplex\n  * Dataform\n  * Analytics Hub\n  * See all data analytics products\n  * Databases\n  * AlloyDB for PostgreSQL\n  * Cloud SQL\n  * Firestore\n  * Cloud Spanner\n  * Cloud Bigtable\n  * Datastream\n  * Database Migration Service\n  * Developer Tools\n  * Artifact Registry\n  * Cloud Code\n  * Cloud Build\n  * Cloud Deploy\n  * Cloud Deployment Manager\n  * Cloud SDK\n  * Cloud Scheduler\n  * Cloud Source Repositories\n  * Cloud Tasks\n  * Cloud Workstations\n  * Tools for PowerShell\n  * See all developer tools\n  * Distributed Cloud\n  * Google Distributed Cloud Edge\n  * Google Distributed Cloud Hosted\n  * Hybrid and Multicloud\n  * Google Kubernetes Engine\n  * Apigee API Management\n  * Migrate to Containers\n  * Traffic Director\n  * Cloud Build\n  * Operations\n  * Anthos\n  * Distributed Cloud\n  * Industry Specific\n  * Anti Money Laundering AI\n  * Cloud Healthcare API\n  * Device Connect for Fitbit\n  * Telecom Network Automation\n  * Telecom Data Fabric\n  * Telecom Subscriber Insights\n  * Spectrum Access System (SAS)\n  * Integration Services\n  * Application Integration\n  * Workflows\n  * Apigee API Management\n  * Cloud Tasks\n  * Cloud Scheduler\n  * Dataproc\n  * Cloud Data Fusion\n  * Cloud Composer\n  * Pub/Sub\n  * Eventarc\n  * Management Tools\n  * Cloud Shell\n  * Cloud console\n  * Cloud Endpoints\n  * Cloud IAM\n  * Cloud APIs\n  * Service Catalog\n  * Cost Management\n  * Operations\n  * Carbon Footprint\n  * Config Connector\n  * Active Assist\n  * See all management tools\n  * Maps and Geospatial\n  * Earth Engine\n  * Google Maps Platform\n  * Media Services\n  * Cloud CDN\n  * Live Steam API\n  * OpenCue\n  * Transcoder API\n  * Video Stitcher API\n  * Migration\n  * Migration Center\n  * Application Migration\n  * Migrate to Virtual Machines\n  * Cloud Foundation Toolkit\n  * Database Migration Service\n  * Migrate to Containers\n  * BigQuery Data Transfer Service\n  * Rapid Migration Program (RaMP)\n  * Transfer Appliance\n  * Storage Transfer Service\n  * VMware Engine\n  * Mixed Reality\n  * Immersive Stream for XR\n  * Networking\n  * Cloud Armor\n  * Cloud CDN and Media CDN\n  * Cloud DNS\n  * Cloud Load Balancing\n  * Cloud NAT\n  * Cloud Connectivity\n  * Network Connectivity Center\n  * Network Intelligence Center\n  * Network Service Tiers\n  * Virtual Private Cloud\n  * Private Service Connect\n  * See all networking products\n  * Operations\n  * Cloud Logging\n  * Cloud Monitoring\n  * Error Reporting\n  * Cloud Debugger\n  * Cloud Trace\n  * Cloud Profiler\n  * Productivity and Collaboration\n  * AppSheet\n  * Appsheet Automation\n  * Google Workspace\n  * Google Workspace Essentials\n  * Duet AI for Workspace\n  * Cloud Identity\n  * Chrome Enterprise\n  * Security and Identity\n  * Cloud IAM\n  * Assured Workloads\n  * Cloud Key Management\n  * Confidential Computing\n  * Security Command Center\n  * Cloud Data Loss Prevention\n  * Mandiant Products and Services\n  * Chronicle SIEM\n  * Chronicle Security Operations\n  * Secret Manager\n  * BeyondCorp Enterprise\n  * See all security and identity products\n  * Serverless\n  * Cloud Run\n  * Cloud Functions\n  * App Engine\n  * Workflows\n  * API Gateway\n  * Storage\n  * Cloud Storage\n  * Backup and DR Service\n  * Filestore\n  * Persistent Disk\n  * Cloud Storage for Firebase\n  * Local SSD\n  * Storage Transfer Service\n  * Web3\n  * Blockchain Node Engine\n\n  * Save money with our transparent approach to pricing\n  * Request a quote\n  * Pricing overview and tools\n  * Google Cloud pricing\n  * Pricing calculator\n  * Google Cloud free tier\n  * Cost optimization framework\n  * Cost management tools\n  * Product-specific Pricing\n  * Compute Engine\n  * Cloud SQL\n  * Google Kubernetes Engine\n  * Cloud Storage\n  * BigQuery\n  * See full price list with 100+ products\n\n  * Learn & build\n  * Google Cloud Free Program\n  * Quickstarts\n  * Cloud computing basics\n  * Blog\n  * Learning Hub\n  * Training\n  * Certification\n  * Cloud Architecture Center\n  * Connect\n  * Innovators\n  * Developer Center\n  * Events and webinars\n  * Google Cloud Community\n  * Third-party tools and partners\n  * Google Cloud Marketplace\n  * Google Cloud partners\n  * Become a partner\n\n  * ### Why Google\n\n    * Choosing Google Cloud\n    * Trust and security\n    * Open cloud\n    * Multicloud\n    * Global infrastructure\n    * Customers and case studies\n    * Analyst reports\n    * Whitepapers\n    * Blog\n  * ### Products and pricing\n\n    * Google Cloud pricing\n    * Google Workspace pricing\n    * See all products\n  * ### Solutions\n\n    * Infrastructure modernization\n    * Databases\n    * Application modernization\n    * Smart analytics\n    * Artificial Intelligence\n    * Security\n    * Productivity & work transformation\n    * Industry solutions\n    * DevOps solutions\n    * Small business solutions\n    * See all solutions\n  * ### Resources\n\n    * Google Cloud documentation\n    * Google Cloud quickstarts\n    * Google Cloud Marketplace\n    * Learn about cloud computing\n    * Support\n    * Code samples\n    * Cloud Architecture Center\n    * Training\n    * Certifications\n    * Google Developers\n    * Google Cloud for Startups\n    * System status\n    * Release Notes\n  * ### Engage\n\n    * Contact sales\n    * Find a Partner\n    * Become a Partner\n    * Events\n    * Podcasts\n    * Developer Center\n    * Press Corner\n    * Google Cloud on YouTube\n    * Google Cloud Tech on YouTube\n    * Follow on Twitter\n    * Join User Research\n    * We're hiring. Join Google Cloud!\n    * Google Cloud Community\n\n  * About Google\n  * Privacy\n  * Site terms\n  * Google Cloud terms\n  * Our third decade of climate action: join us\n  * Sign up for the Google Cloud newsletterSubscribe\n\n_language_ ‪English‬\n\n  * ‪English‬\n  * ‪Deutsch‬\n  * ‪Español‬\n  * ‪Español (Latinoamérica)‬\n  * ‪Français‬\n  * ‪Indonesia‬\n  * ‪Italiano‬\n  * ‪Português (Brasil)‬\n  * ‪简体中文‬\n  * ‪繁體中文‬\n  * ‪日本語‬\n  * ‪한국어‬\n\n"
}