{
    "summary": "Skip to main content\n\nOpen menu\n\n  * Notifications\n\n    * Back to menu \n    * No pending order \n\n    * No pending ticket \n\n  * My Account \n  * Contact Sales \n  * Support \n    * Back to menu \n    * Help Center \n    * Guides \n    * Professional Services \n  * Resources \n    * Back to menu \n    * Case Studies \n    * API \n    * Tutorials \n    * Featured Guides \n    * Use Cases \n    * White Papers \n    * Videos \n  * OVHcloud Blog \n  * United States [$] \n\nBack to menu\n\nEurope\n\n    * Deutschland [€] \n\n    * España [€] \n\n    * France [€] \n\n    * Ireland [€] \n\n    * Italia [€] \n\n    * Nederland [€] \n\n    * Polska [PLN] \n\n    * Portugal [€] \n\n    * United Kingdom [£] \n\nAmerica\n\n    * Canada (en) [$] \n\n    * Canada (fr) [$] \n\n    * United States [$] \n\n    * América Latina [$] \n\nAfrica\n\n    * Maroc [Dhs] \n\n    * Sénégal [FCFA] \n\n    * Tunisie [DT] \n\nOceania\n\n    * Australia [A$] \n\nAsia\n\n    * Singapore [S$] \n\n    * India [₹] \n\nWorld\n\n    * World [$] \n\n    * World [€] \n\nOpen login menu\n\nWelcome to OVHcloud.\n\nLog in to order, manage your products and services, and track your orders.\n\nMy Account\n\n  * Bare Metal & VPS \n    * Back to menu \n    * Bare Metal & VPS \n\n    * Dedicated Servers \n      * Back to menu \n      * Dedicated Servers \n\n      * Products All OVHcloud dedicated servers \n\n        * Rise Servers  The most affordable bare-metal servers offered by OVHcloud \n        * Advance Servers New in Singapore Versatile servers for small and medium businesses. \n        * Game servers  For video games and streaming platforms. \n        * Infrastructure servers  Computing capacity and storage adapted to server clusters. \n        * Scale Servers New Specifically designed for complex, high-resilience infrastructures. \n        * High Grade Servers  The most powerful servers, optimised for critical loads. \n      * Use Cases \n\n        * Virtualization, Containerization & Orchestration  VMware ESXi, Proxmox VE, KVM, Citrix XenServer, Microsoft Hyper-V, Docker, Kubernetes, Apache Mesos \n        * Hyper-converged infrastructure  Proxmox VE, OpenStack \n        * Software-defined storage (SDS)  Netapp, Ceph, OpenIO, Scality \n        * Big Data & Analytics  Hadoop, Cloudera, Spark, Solr, Elasticsearch \n        * Archiving, Backup & Recovery  Restic, Rsync \n    * Eco Dedicated Servers \n      * Back to menu \n      * Eco Dedicated Servers \n\n      * Eco Dedicated Servers Explore our Dedicated Servers \n\n        * Kimsufi Servers  Low-cost servers to get you started \n        * So you Start Servers  A range of dedicated servers that are perfect for startups and very small businesses \n        * Rise Servers  Tried-and-tested Intel and AMD platforms for competitive performance and price \n        * Operating systems and distributions  Find the versions compatible with your Eco server \n    * VPS - Virtual Private Servers \n      * Back to menu \n      * VPS - Virtual Private Servers \n\n      * VPS - Virtual Private Servers\n\n        * All VPSs  View our full range of Virtual Private Servers. \n        * Our limited edition VPS  Based on AMD Epyc platforms - limited stock is available \n        * Distributions and licenses  See all our distributions and licenses \n        * VPS guides \n    * Managed Bare Metal \n      * Back to menu \n      * Managed Bare Metal \n\n      * Managed Bare Metal\n\n        * Managed Bare Metal Essentials powered by VMware®  Your dedicated cloud available in 90 minutes. \n        * Managed Bare Metal Options  Options available with Managed Bare Metal Essentials. \n    * Storage and backup \n      * Back to menu \n      * Storage and backup \n\n      * Storage and backup Explore all our solutions \n\n        * Veeam Enterprise Plus  A backup management solution, managed by OVHcloud and based on Veeam Backup & Replication \n        * Storage servers  Dedicated servers with more disk space for archiving, backup and distributed storage \n    * Network \n      * Back to menu \n      * Network \n\n      * Network\n\n        * Additional IP  Assign and move dynamic IP addresses from one service to another \n        * Private Network (vRack)  Connect all your OVHcloud services together with an isolated private network \n        * OVHcloud Link Aggregation  Get a redundant, high-bandwith private network \n        * OVHcloud Connect  Connect your data center to OVHcloud \n        * Public Bandwith  Upgrade your default guaranteed bandwidth \n        * Bring Your Own IP (BYOIP)  Bring your IP addresses and simplify your migration to OVHcloud \n    * Network Security \n      * Back to menu \n      * Network Security \n\n      * Network Security\n\n        * Anti DDoS infrastructure  Keep your infrastructures protected against DDoS attacks \n        * Game DDoS Protection  Protect your gaming and e-sport business with best-in-class security solution \n    * Identity and Security \n      * Back to menu \n      * Identity and Security \n\n      * Identity and Security\n\n        * Identity and Access Management (IAM)  Secure your access management and enhance your productivity \n  * Public Cloud \n    * Back to menu \n    * Public Cloud \n\n    * Public Cloud \n      * Back to menu \n      * Public Cloud \n\n      * Public Cloud Discover Public Cloud \n\n        * Ecosystem of services  Accelerate your business, automate your infrastructure \n        * Pricing  View our simple, accessible pricing \n        * The advantages of the Public Cloud solution  Explore cloud computing solutions to fit your needs \n        * Cloud computing  Find out more about this growing practice \n        * Compliance & Certifications  Explore how OVHcloud builds trusted solutions \n        * Availability by region  Explore our catalog coverage by region \n        * Our documentation  Read our guides and tutorials \n    * Compute \n      * Back to menu \n      * Compute \n\n      * Compute Explore all our Compute products \n\n        * Guaranteed resources  Deploy instances with resources guaranteed 100% of the time \n        * GPU  Try out our instances that are up to 1,000 times faster than a CPU \n        * Discovery  Get started with Public Cloud instances with shared resources \n        * Our documentation  Browse our documentation for the Compute range \n    * Storage \n      * Back to menu \n      * Storage \n\n      * Storage Explore all our Storage products \n\n        * Block Storage  Create storage volumes, which can be used as additional disks \n        * Object Storage  Get unlimited on-demand storage, accessible via the S3 API \n        * Cloud Archive  Archive your data over the long term \n        * Volume Snapshot  Trigger a snapshot on your Block Storage volumes \n        * Volume Backup  Back up your Block Storage volumes. The backed-up data is stored on our Object Storage service \n        * Instance Backup  Get a backup service for your instances \n        * Our documentation  Browse our documentation for the Storage range \n    * Network \n      * Back to menu \n      * Network \n\n      * Network Explore all our Network products \n\n        * Private Network  Deploy private networks via the OVHcloud vRack \n        * Load Balancer  Manage variable traffic by spreading it across multiple resources \n        * Floating IP  Assign and move your public IP from one service to another \n        * Gateway  Manage a single connection point between your private network & internet \n        * Our documentation  View our documentation for the Network range \n    * Containers & Orchestration \n      * Back to menu \n      * Containers & Orchestration \n\n      * Containers & Orchestration Explore all our Containers & Orchestration products \n\n        * Managed Kubernetes Service  Orchestrate your containerised applications with a CNCF-certified Kubernetes cluster \n        * Public Image Catalog  Choose from dozens of cloud images offered & managed by OVHcloud \n        * Our documentation  View our documentation for the Containers & Orchestration range \n    * Identity and security \n      * Back to menu \n      * Identity and security \n\n      * Identity and security\n\n        * Identity and Access Management (IAM)  Secure your access management and improve your productivity \n  * Hosted Private Cloud \n    * Back to menu \n    * Hosted Private Cloud \n\n    * VMware \n      * Back to menu \n      * VMware \n\n      * Hosted Private Cloud\n\n        * VMware on OVHcloud  Explore the flexibility of the cloud with our starter packs. \n        * Veeam option for VMware backup  The Backup as a Service solution for your virtual machines. \n        * Disaster Recovery Plan (Zerto DRP)  Stay one step ahead protecting your data. \n        * Veeam Enterprise platform for all your backups  Transform Your Existing On-Premises Infrastructure. \n      * Quick Access \n\n        * View our prices \n        * Images & Licenses \n        * View all solutions \n    * Nutanix \n      * Back to menu \n      * Nutanix \n\n      * Hosted Private Cloud\n\n        * Nutanix on OVHcloud  Our scalable, hyperconverged platform (HCI), ready-to-use in just a few hours \n      * Use cases \n\n        * Hybrid Multicloud \n        * Disaster Recovery Plan (DRP) \n        * Hyperconvergence, savings and ecology \n    * Attestations & Certifications \n      * Back to menu \n      * Attestations & Certifications \n\n      * Attestations & Certifications Full list of standards and regulations \n\n        * HIPAA and HITECH  Hosting healthcare data in the US \n        * PCI DSS  Financial data hosting \n        * ISO/IEC 27001, 27017 and 27018  Information Security Management \n        * ISO/IEC 27701  Managing the security of personal data processing \n        * SOC 1, 2 and 3  AICPA SSAE 16/ISAE 3402 type II attestation and reports \n    * Network \n      * Back to menu \n      * Network \n\n      * Network\n\n        * Additional IP  Assign and move dynamic IP addresses from one service to another \n        * Private Network (vRack)  Connect all your OVHcloud services together with an isolated private network \n        * OVHcloud Connect  Connect your data center to OVHcloud \n        * Bring Your Own IP (BYOIP)  Bring your IP addresses and simplify your migration to OVHcloud \n    * Network Security \n      * Back to menu \n      * Network Security \n\n      * Network Security\n\n        * Anti-DDoS infrastructure  Keep your infrastructures protected against DDoS attacks \n    * Identity and Security \n      * Back to menu \n      * Identity and Security \n\n      * Identity and Security\n\n        * Identity and Access Management (IAM)  Secure your access management and enhance your productivity \n  * Enterprise \n    * Back to menu \n    * Enterprise \n\nEnterprise Find out more about Enterprise\n\n    *       * Hosted Private Cloud  Get a fully dedicated, high availability hosted Cloud. \n      * Datacenter Extensions with Cloud Solutions  Prepare to transform your on-site infrastructure. \n      * Attestations & Certifications  List of OVHcloud attestations and certifications and the compliance standards we meet \n      * High Performance Servers  Custom servers designed for the most resource-intensive environments. \n    * Quick Access \n\n      * View our solutions \n  * Ecosystem \n\n    * Back to menu \n    * Ecosystem\n    *       * Partner Program  An initiative dedicated to our reseller partners, integrators, administrators and consultants. \n      * Startup Program  A support program for startups and scaleups to accelerate their growth \n    * Quick Access \n\n      * Sign up for the OVHcloud Partner Program \n      * Sign up for the OVHcloud Startup Program \n  * About \n    * Back to menu \n    * About \n\nAbout\n\n    *       * Company Overview \n      * Press \n      * Contact Us \n      * Careers \n      * Patent Pledge \n      * Legal \n    * Quick Access \n\n      * Privacy Policy \n      * Attestations & Certifications \n  * Black Friday \n\nReceive $400.00 (USD) in additional Public Cloud credits (the \"Additional\nCredits\") when you create your first Public Cloud infrastructure project.\nOffer applies only to Public Cloud services purchased from OVHcloud\ndatacenters in the United States. Offer available only to select customers\nwho, at the time when the Additional Credits are applied, are not purchasing\nPublic Cloud services from OVHcloud and who purchase at least $0.99 (USD)\nPublic Cloud services from OVHcloud. No code is required. The Additional\nCredits will be added to eligible accounts within 30 days of OVHcloud's\nreceipt of the $0.99 for your purchase of Public Cloud credits. The Additional\nCredits are valid until December 31, 2023, at 23:59:59 ET. The Additional\nCredits will automatically be applied to your next bill(s) up to a maximum\namount of $400.00. Any unused portion of the Additional Credits will expire.\nThe Additional Credits have no monetary value, and cannot be exchanged,\ntransferred, or refunded. Once the Additional Credits are exhausted or\nexpired, your account will be debited in accordance with OVHcloud’s billing\nguide.\n\n**Public Cloud Credit Offer** : $400 Public Cloud credit to new customers\nopening their first project[1]. Get started\n\n# GPU\n\n  * Overview\n  * Use cases\n  * How to\n  * Prices\n  * Create a project\n\n  *   * Public Cloud\n  * Compute\n  * GPU\n\n##  GPU cloud servers, designed for massive parallel processing\n\nGPU instances leverage NVIDIA Tesla V100S graphic processors to deliver the\npower and performance needed for massive parallel processing, including\nmachine learning and deep learning projects. They are available on demand and\ncan be purchased on a monthly or hourly basis.\n\nStart Now\n\n###  Powered by NVIDIA Tesla V100S\n\nThese GPUs are among the most powerful on the market and are designed for use\nin data centers. They accelerate computing in the fields of artificial\nintelligence (AI) and graphic computing.\n\n###  NVIDIA GPU Cloud\n\nTo provide the best user experience, OVHcloud and NVIDIA have partnered up to\noffer an excellent GPU-accelerated platform. Designed for deep learning and\nhigh-performance computing, and artificial intelligence (AI). It is one of the\nsimplest ways to deploy and maintain GPU-accelerated containers.\n\n###  Between one and four cards with guaranteed performance\n\nTesla cards are delivered directly to the instance via PCI Passthrough,\nwithout a virtualization layer. This gives you full usage of the cards as they\nare fully dedicated to your instance. Up to four cards can be connected to\ncombine their performance. As a result, the hardware delivers all of its\ncomputing power to your application.\n\nIcons/concept/Page/Page Certificate Created with Sketch.\n\n###  ISO/IEC 27001, 27017, 27018, & 27701 Certificate and HIPAA Attestation\n\nOur cloud infrastructures and services are ISO/IEC 27001, 27017, 27018, and\n27701 certified. These certifications demonstrate the presence of an\ninformation security management system (ISMS) for managing risks, and\nvulnerabilities and implementing business continuity, as well as a privacy\ninformation management system (PIMS).\n\n## NVIDIA Tesla V100S Features\n\nPerformance with NVIDIA GPU Boost |\n\nBidirectional connection bandwidth\n\n| CoWoS Stacked HBM2 memory  \n---|---|---  \n  \n  * double-precision: 8.2 TeraFLOPS\n  * single-precision: 16.4 TeraFLOPS\n  * tensor performance: 130 TeraFLOPS\n\n|\n\n  * PCIe 32 GB/s\n\n|\n\n  * capacity: 32 GB HBM2\n  * bandwidth: 1134 GB/s\n\n  \n  \n\n\n## Use cases\n\n###  Image recognition\n\nExtracting data from images to classify them, identify an element or build\nricher documents is necessary for many industries. With frameworks like Caffe2\ncombined with the Tesla V100S GPU, medical imaging, social networks, public\nprotection, and security become easily accessible.\n\n###  Situation analysis\n\nReal-time analysis is required in some cases, where an appropriate reaction is\nexpected to face varied and unpredictable situations. This kind of technology\nis used for self-driving cars and internet network traffic analysis, for\nexample. This is where deep learning comes in, to form neural networks that\nlearn independently through a training stage.\n\n###  Human interaction\n\nIn the past, people learned to communicate with machines. We are now in an era\nwhere machines are learning to communicate with people. Whether through speech\nrecognition or emotion recognition through sound and video, tools such as\nTensorFlow push the boundaries of these interactions, opening up a multitude\nof new uses.\n\n## How to\n\n1\n\n### Start\n\nLaunch your instance by choosing a T1 model and NGC image to suit you.\n\n2\n\n### Configure\n\n$ docker pull nvcr.io/nvidia/tensorflow  \n$ nvidia-docker run nvidia/tensorflow t1\n\n3\n\n### Use\n\nYour AI framework is now ready to go!\n\nReady to get started?\n\nCreate an account and launch your services in minutes\n\nGet Started\n\n## GPU billing\n\nGPU instances are billed like all of our other instances, on a pay-as-you-go\nbasis at the end of each month. The price depends on the size of the instance\nyou have booted, and the duration of its use.\n\nSee the price list\n\n## Other products\n\nGuaranteed Resources\n\nDeploy cloud instances with fully-guaranteed resources that cover a very wide\nrange of uses.\n\nFind out more\n\nDiscovery\n\nStart your Public Cloud journey with instances that have shared resources,\ndelivering stable performance at a very affordable price.\n\nFind out more\n\n## FAQ\n\n###  What SLA does OVHcloud guarantee for a GPU instance?\n\nThe SLA guarantees 99.99% monthly availability on GPU instances. For further\ninformation, please refer to the Terms of Service.\n\n###  Which hypervisor is used for instance virtualization?\n\nJust like other instances, GPU instances are virtualized by the KVM hypervisor\nin the Linux kernel.\n\n###  What is PCI Passthrough?\n\nCards with GPUs are served via the physical server's PCI bus. PCI Passthrough\nis a hypervisor feature that allows you to dedicate hardware to a virtual\nmachine by giving direct access to the PCI bus, without going through\nvirtualization.\n\n###  Can I resize a GPU instance?\n\nYes, GPU instances can be upgraded to a higher model after a reboot. However,\nthey cannot be downgraded to a lower model.\n\n###  Do GPU instances have anti-DDoS protection?\n\nYes, our anti-DDoS protection is included with all OVHcloud solutions at no\nextra cost.\n\n###  If my instance is on a monthly billing cycle, can I switch over to an\nhourly billing cycle in the middle of the month?\n\nIf your instance is on a monthly billing cycle, you cannot switch to an hourly\nbilling cycle in the middle of the month. Before you launch an instance,\nplease take care to select the billing method that is best suited to your\nproject.\n\n1\n\nReceive $400.00 (USD) in additional Public Cloud credits (the \"Additional\nCredits\") when you create your first Public Cloud infrastructure project.\nOffer applies only to Public Cloud services purchased from OVHcloud\ndatacenters in the United States. Offer available only to select customers\nwho, at the time when the Additional Credits are applied, are not purchasing\nPublic Cloud services from OVHcloud and who purchase at least $0.99 (USD)\nPublic Cloud services from OVHcloud. No code is required. The Additional\nCredits will be added to eligible accounts within 30 days of OVHcloud's\nreceipt of the $0.99 for your purchase of Public Cloud credits. The Additional\nCredits are valid until December 31, 2023, at 23:59:59 ET. The Additional\nCredits will automatically be applied to your next bill(s) up to a maximum\namount of $400.00. Any unused portion of the Additional Credits will expire.\nThe Additional Credits have no monetary value, and cannot be exchanged,\ntransferred, or refunded. Once the Additional Credits are exhausted or\nexpired, your account will be debited in accordance with OVHcloud’s billing\nguide.\n\nBack to top\n\n  * Tools\n\n    * My Account\n    * API\n    * Service Status\n    * Report Abuse\n\n  * Support\n\n    * Help Center\n    * Featured Guides\n    * Glossary\n    * Professional Services\n\n  * Contact us\n\nNew orders, technical advice, questions?\n\nRequest a Callback\n\nTalk to an Expert\n\n  * News\n\n    * Press\n    * Blog\n    * Black Friday Deals\n\n  * Social Networks\n\n    *     *     *     *     *     *     *     * \n\n  * Copyright ©2023 OVH US LLC and affiliated companies all rights reserved. OVHcloud, the OVHcloud logo and all other OVH marks contained herein are registered trademarks of OVH SAS.  \nAll other marks contained herein are the property of their respective owners.\n\n  * Terms of Service\n  * Legal\n  * About OVHcloud\n  * OVHcloud Careers\n\nThis website uses cookies, web beacons, and other similar technologies to\nprovide you with the best browsing experience, to perform marketing\nactivities, and to analyze our traffic. OVHcloud uses this technology in\naccordance with our Privacy Policy and Cookie Policy. Click here to change\nyour settings.\n\nAccept\n\n",
    "links": "[{\"link\": \"https://us.ovhcloud.com/public-cloud/gpu/\", \"text\": \"\"}, {\"link\": \"https://us.ovhcloud.com/public-cloud/gpu/\", \"text\": \"\"}]",
    "priceAndPlans": "Skip to main content\n\nOpen menu\n\n  * Notifications\n\n    * Back to menu \n    * No pending order \n\n    * No pending ticket \n\n  * My Account \n  * Contact Sales \n  * Support \n    * Back to menu \n    * Help Center \n    * Guides \n    * Professional Services \n  * Resources \n    * Back to menu \n    * Case Studies \n    * API \n    * Tutorials \n    * Featured Guides \n    * Use Cases \n    * White Papers \n    * Videos \n  * OVHcloud Blog \n  * United States [$] \n\nBack to menu\n\nEurope\n\n    * Deutschland [€] \n\n    * España [€] \n\n    * France [€] \n\n    * Ireland [€] \n\n    * Italia [€] \n\n    * Nederland [€] \n\n    * Polska [PLN] \n\n    * Portugal [€] \n\n    * United Kingdom [£] \n\nAmerica\n\n    * Canada (en) [$] \n\n    * Canada (fr) [$] \n\n    * United States [$] \n\n    * América Latina [$] \n\nAfrica\n\n    * Maroc [Dhs] \n\n    * Sénégal [FCFA] \n\n    * Tunisie [DT] \n\nOceania\n\n    * Australia [A$] \n\nAsia\n\n    * Singapore [S$] \n\n    * India [₹] \n\nWorld\n\n    * World [$] \n\n    * World [€] \n\nOpen login menu\n\nWelcome to OVHcloud.\n\nLog in to order, manage your products and services, and track your orders.\n\nMy Account\n\n  * Bare Metal & VPS \n    * Back to menu \n    * Bare Metal & VPS \n\n    * Dedicated Servers \n      * Back to menu \n      * Dedicated Servers \n\n      * Products All OVHcloud dedicated servers \n\n        * Rise Servers  The most affordable bare-metal servers offered by OVHcloud \n        * Advance Servers New in Singapore Versatile servers for small and medium businesses. \n        * Game servers  For video games and streaming platforms. \n        * Infrastructure servers  Computing capacity and storage adapted to server clusters. \n        * Scale Servers New Specifically designed for complex, high-resilience infrastructures. \n        * High Grade Servers  The most powerful servers, optimised for critical loads. \n      * Use Cases \n\n        * Virtualization, Containerization & Orchestration  VMware ESXi, Proxmox VE, KVM, Citrix XenServer, Microsoft Hyper-V, Docker, Kubernetes, Apache Mesos \n        * Hyper-converged infrastructure  Proxmox VE, OpenStack \n        * Software-defined storage (SDS)  Netapp, Ceph, OpenIO, Scality \n        * Big Data & Analytics  Hadoop, Cloudera, Spark, Solr, Elasticsearch \n        * Archiving, Backup & Recovery  Restic, Rsync \n    * Eco Dedicated Servers \n      * Back to menu \n      * Eco Dedicated Servers \n\n      * Eco Dedicated Servers Explore our Dedicated Servers \n\n        * Kimsufi Servers  Low-cost servers to get you started \n        * So you Start Servers  A range of dedicated servers that are perfect for startups and very small businesses \n        * Rise Servers  Tried-and-tested Intel and AMD platforms for competitive performance and price \n        * Operating systems and distributions  Find the versions compatible with your Eco server \n    * VPS - Virtual Private Servers \n      * Back to menu \n      * VPS - Virtual Private Servers \n\n      * VPS - Virtual Private Servers\n\n        * All VPSs  View our full range of Virtual Private Servers. \n        * Our limited edition VPS  Based on AMD Epyc platforms - limited stock is available \n        * Distributions and licenses  See all our distributions and licenses \n        * VPS guides \n    * Managed Bare Metal \n      * Back to menu \n      * Managed Bare Metal \n\n      * Managed Bare Metal\n\n        * Managed Bare Metal Essentials powered by VMware®  Your dedicated cloud available in 90 minutes. \n        * Managed Bare Metal Options  Options available with Managed Bare Metal Essentials. \n    * Storage and backup \n      * Back to menu \n      * Storage and backup \n\n      * Storage and backup Explore all our solutions \n\n        * Veeam Enterprise Plus  A backup management solution, managed by OVHcloud and based on Veeam Backup & Replication \n        * Storage servers  Dedicated servers with more disk space for archiving, backup and distributed storage \n    * Network \n      * Back to menu \n      * Network \n\n      * Network\n\n        * Additional IP  Assign and move dynamic IP addresses from one service to another \n        * Private Network (vRack)  Connect all your OVHcloud services together with an isolated private network \n        * OVHcloud Link Aggregation  Get a redundant, high-bandwith private network \n        * OVHcloud Connect  Connect your data center to OVHcloud \n        * Public Bandwith  Upgrade your default guaranteed bandwidth \n        * Bring Your Own IP (BYOIP)  Bring your IP addresses and simplify your migration to OVHcloud \n    * Network Security \n      * Back to menu \n      * Network Security \n\n      * Network Security\n\n        * Anti DDoS infrastructure  Keep your infrastructures protected against DDoS attacks \n        * Game DDoS Protection  Protect your gaming and e-sport business with best-in-class security solution \n    * Identity and Security \n      * Back to menu \n      * Identity and Security \n\n      * Identity and Security\n\n        * Identity and Access Management (IAM)  Secure your access management and enhance your productivity \n  * Public Cloud \n    * Back to menu \n    * Public Cloud \n\n    * Public Cloud \n      * Back to menu \n      * Public Cloud \n\n      * Public Cloud Discover Public Cloud \n\n        * Ecosystem of services  Accelerate your business, automate your infrastructure \n        * Pricing  View our simple, accessible pricing \n        * The advantages of the Public Cloud solution  Explore cloud computing solutions to fit your needs \n        * Cloud computing  Find out more about this growing practice \n        * Compliance & Certifications  Explore how OVHcloud builds trusted solutions \n        * Availability by region  Explore our catalog coverage by region \n        * Our documentation  Read our guides and tutorials \n    * Compute \n      * Back to menu \n      * Compute \n\n      * Compute Explore all our Compute products \n\n        * Guaranteed resources  Deploy instances with resources guaranteed 100% of the time \n        * GPU  Try out our instances that are up to 1,000 times faster than a CPU \n        * Discovery  Get started with Public Cloud instances with shared resources \n        * Our documentation  Browse our documentation for the Compute range \n    * Storage \n      * Back to menu \n      * Storage \n\n      * Storage Explore all our Storage products \n\n        * Block Storage  Create storage volumes, which can be used as additional disks \n        * Object Storage  Get unlimited on-demand storage, accessible via the S3 API \n        * Cloud Archive  Archive your data over the long term \n        * Volume Snapshot  Trigger a snapshot on your Block Storage volumes \n        * Volume Backup  Back up your Block Storage volumes. The backed-up data is stored on our Object Storage service \n        * Instance Backup  Get a backup service for your instances \n        * Our documentation  Browse our documentation for the Storage range \n    * Network \n      * Back to menu \n      * Network \n\n      * Network Explore all our Network products \n\n        * Private Network  Deploy private networks via the OVHcloud vRack \n        * Load Balancer  Manage variable traffic by spreading it across multiple resources \n        * Floating IP  Assign and move your public IP from one service to another \n        * Gateway  Manage a single connection point between your private network & internet \n        * Our documentation  View our documentation for the Network range \n    * Containers & Orchestration \n      * Back to menu \n      * Containers & Orchestration \n\n      * Containers & Orchestration Explore all our Containers & Orchestration products \n\n        * Managed Kubernetes Service  Orchestrate your containerised applications with a CNCF-certified Kubernetes cluster \n        * Public Image Catalog  Choose from dozens of cloud images offered & managed by OVHcloud \n        * Our documentation  View our documentation for the Containers & Orchestration range \n    * Identity and security \n      * Back to menu \n      * Identity and security \n\n      * Identity and security\n\n        * Identity and Access Management (IAM)  Secure your access management and improve your productivity \n  * Hosted Private Cloud \n    * Back to menu \n    * Hosted Private Cloud \n\n    * VMware \n      * Back to menu \n      * VMware \n\n      * Hosted Private Cloud\n\n        * VMware on OVHcloud  Explore the flexibility of the cloud with our starter packs. \n        * Veeam option for VMware backup  The Backup as a Service solution for your virtual machines. \n        * Disaster Recovery Plan (Zerto DRP)  Stay one step ahead protecting your data. \n        * Veeam Enterprise platform for all your backups  Transform Your Existing On-Premises Infrastructure. \n      * Quick Access \n\n        * View our prices \n        * Images & Licenses \n        * View all solutions \n    * Nutanix \n      * Back to menu \n      * Nutanix \n\n      * Hosted Private Cloud\n\n        * Nutanix on OVHcloud  Our scalable, hyperconverged platform (HCI), ready-to-use in just a few hours \n      * Use cases \n\n        * Hybrid Multicloud \n        * Disaster Recovery Plan (DRP) \n        * Hyperconvergence, savings and ecology \n    * Attestations & Certifications \n      * Back to menu \n      * Attestations & Certifications \n\n      * Attestations & Certifications Full list of standards and regulations \n\n        * HIPAA and HITECH  Hosting healthcare data in the US \n        * PCI DSS  Financial data hosting \n        * ISO/IEC 27001, 27017 and 27018  Information Security Management \n        * ISO/IEC 27701  Managing the security of personal data processing \n        * SOC 1, 2 and 3  AICPA SSAE 16/ISAE 3402 type II attestation and reports \n    * Network \n      * Back to menu \n      * Network \n\n      * Network\n\n        * Additional IP  Assign and move dynamic IP addresses from one service to another \n        * Private Network (vRack)  Connect all your OVHcloud services together with an isolated private network \n        * OVHcloud Connect  Connect your data center to OVHcloud \n        * Bring Your Own IP (BYOIP)  Bring your IP addresses and simplify your migration to OVHcloud \n    * Network Security \n      * Back to menu \n      * Network Security \n\n      * Network Security\n\n        * Anti-DDoS infrastructure  Keep your infrastructures protected against DDoS attacks \n    * Identity and Security \n      * Back to menu \n      * Identity and Security \n\n      * Identity and Security\n\n        * Identity and Access Management (IAM)  Secure your access management and enhance your productivity \n  * Enterprise \n    * Back to menu \n    * Enterprise \n\nEnterprise Find out more about Enterprise\n\n    *       * Hosted Private Cloud  Get a fully dedicated, high availability hosted Cloud. \n      * Datacenter Extensions with Cloud Solutions  Prepare to transform your on-site infrastructure. \n      * Attestations & Certifications  List of OVHcloud attestations and certifications and the compliance standards we meet \n      * High Performance Servers  Custom servers designed for the most resource-intensive environments. \n    * Quick Access \n\n      * View our solutions \n  * Ecosystem \n\n    * Back to menu \n    * Ecosystem\n    *       * Partner Program  An initiative dedicated to our reseller partners, integrators, administrators and consultants. \n      * Startup Program  A support program for startups and scaleups to accelerate their growth \n    * Quick Access \n\n      * Sign up for the OVHcloud Partner Program \n      * Sign up for the OVHcloud Startup Program \n  * About \n    * Back to menu \n    * About \n\nAbout\n\n    *       * Company Overview \n      * Press \n      * Contact Us \n      * Careers \n      * Patent Pledge \n      * Legal \n    * Quick Access \n\n      * Privacy Policy \n      * Attestations & Certifications \n  * Black Friday \n\nReceive $400.00 (USD) in additional Public Cloud credits (the \"Additional\nCredits\") when you create your first Public Cloud infrastructure project.\nOffer applies only to Public Cloud services purchased from OVHcloud\ndatacenters in the United States. Offer available only to select customers\nwho, at the time when the Additional Credits are applied, are not purchasing\nPublic Cloud services from OVHcloud and who purchase at least $0.99 (USD)\nPublic Cloud services from OVHcloud. No code is required. The Additional\nCredits will be added to eligible accounts within 30 days of OVHcloud's\nreceipt of the $0.99 for your purchase of Public Cloud credits. The Additional\nCredits are valid until December 31, 2023, at 23:59:59 ET. The Additional\nCredits will automatically be applied to your next bill(s) up to a maximum\namount of $400.00. Any unused portion of the Additional Credits will expire.\nThe Additional Credits have no monetary value, and cannot be exchanged,\ntransferred, or refunded. Once the Additional Credits are exhausted or\nexpired, your account will be debited in accordance with OVHcloud’s billing\nguide.\n\n**Public Cloud Credit Offer** : $400 Public Cloud credit to new customers\nopening their first project[1]. Get started\n\n# GPU\n\n  * Overview\n  * Use cases\n  * How to\n  * Prices\n  * Create a project\n\n  *   * Public Cloud\n  * Compute\n  * GPU\n\n##  GPU cloud servers, designed for massive parallel processing\n\nGPU instances leverage NVIDIA Tesla V100S graphic processors to deliver the\npower and performance needed for massive parallel processing, including\nmachine learning and deep learning projects. They are available on demand and\ncan be purchased on a monthly or hourly basis.\n\nStart Now\n\n###  Powered by NVIDIA Tesla V100S\n\nThese GPUs are among the most powerful on the market and are designed for use\nin data centers. They accelerate computing in the fields of artificial\nintelligence (AI) and graphic computing.\n\n###  NVIDIA GPU Cloud\n\nTo provide the best user experience, OVHcloud and NVIDIA have partnered up to\noffer an excellent GPU-accelerated platform. Designed for deep learning and\nhigh-performance computing, and artificial intelligence (AI). It is one of the\nsimplest ways to deploy and maintain GPU-accelerated containers.\n\n###  Between one and four cards with guaranteed performance\n\nTesla cards are delivered directly to the instance via PCI Passthrough,\nwithout a virtualization layer. This gives you full usage of the cards as they\nare fully dedicated to your instance. Up to four cards can be connected to\ncombine their performance. As a result, the hardware delivers all of its\ncomputing power to your application.\n\nIcons/concept/Page/Page Certificate Created with Sketch.\n\n###  ISO/IEC 27001, 27017, 27018, & 27701 Certificate and HIPAA Attestation\n\nOur cloud infrastructures and services are ISO/IEC 27001, 27017, 27018, and\n27701 certified. These certifications demonstrate the presence of an\ninformation security management system (ISMS) for managing risks, and\nvulnerabilities and implementing business continuity, as well as a privacy\ninformation management system (PIMS).\n\n## NVIDIA Tesla V100S Features\n\nPerformance with NVIDIA GPU Boost |\n\nBidirectional connection bandwidth\n\n| CoWoS Stacked HBM2 memory  \n---|---|---  \n  \n  * double-precision: 8.2 TeraFLOPS\n  * single-precision: 16.4 TeraFLOPS\n  * tensor performance: 130 TeraFLOPS\n\n|\n\n  * PCIe 32 GB/s\n\n|\n\n  * capacity: 32 GB HBM2\n  * bandwidth: 1134 GB/s\n\n  \n  \n\n\n## Use cases\n\n###  Image recognition\n\nExtracting data from images to classify them, identify an element or build\nricher documents is necessary for many industries. With frameworks like Caffe2\ncombined with the Tesla V100S GPU, medical imaging, social networks, public\nprotection, and security become easily accessible.\n\n###  Situation analysis\n\nReal-time analysis is required in some cases, where an appropriate reaction is\nexpected to face varied and unpredictable situations. This kind of technology\nis used for self-driving cars and internet network traffic analysis, for\nexample. This is where deep learning comes in, to form neural networks that\nlearn independently through a training stage.\n\n###  Human interaction\n\nIn the past, people learned to communicate with machines. We are now in an era\nwhere machines are learning to communicate with people. Whether through speech\nrecognition or emotion recognition through sound and video, tools such as\nTensorFlow push the boundaries of these interactions, opening up a multitude\nof new uses.\n\n## How to\n\n1\n\n### Start\n\nLaunch your instance by choosing a T1 model and NGC image to suit you.\n\n2\n\n### Configure\n\n$ docker pull nvcr.io/nvidia/tensorflow  \n$ nvidia-docker run nvidia/tensorflow t1\n\n3\n\n### Use\n\nYour AI framework is now ready to go!\n\nReady to get started?\n\nCreate an account and launch your services in minutes\n\nGet Started\n\n## GPU billing\n\nGPU instances are billed like all of our other instances, on a pay-as-you-go\nbasis at the end of each month. The price depends on the size of the instance\nyou have booted, and the duration of its use.\n\nSee the price list\n\n## Other products\n\nGuaranteed Resources\n\nDeploy cloud instances with fully-guaranteed resources that cover a very wide\nrange of uses.\n\nFind out more\n\nDiscovery\n\nStart your Public Cloud journey with instances that have shared resources,\ndelivering stable performance at a very affordable price.\n\nFind out more\n\n## FAQ\n\n###  What SLA does OVHcloud guarantee for a GPU instance?\n\nThe SLA guarantees 99.99% monthly availability on GPU instances. For further\ninformation, please refer to the Terms of Service.\n\n###  Which hypervisor is used for instance virtualization?\n\nJust like other instances, GPU instances are virtualized by the KVM hypervisor\nin the Linux kernel.\n\n###  What is PCI Passthrough?\n\nCards with GPUs are served via the physical server's PCI bus. PCI Passthrough\nis a hypervisor feature that allows you to dedicate hardware to a virtual\nmachine by giving direct access to the PCI bus, without going through\nvirtualization.\n\n###  Can I resize a GPU instance?\n\nYes, GPU instances can be upgraded to a higher model after a reboot. However,\nthey cannot be downgraded to a lower model.\n\n###  Do GPU instances have anti-DDoS protection?\n\nYes, our anti-DDoS protection is included with all OVHcloud solutions at no\nextra cost.\n\n###  If my instance is on a monthly billing cycle, can I switch over to an\nhourly billing cycle in the middle of the month?\n\nIf your instance is on a monthly billing cycle, you cannot switch to an hourly\nbilling cycle in the middle of the month. Before you launch an instance,\nplease take care to select the billing method that is best suited to your\nproject.\n\n1\n\nReceive $400.00 (USD) in additional Public Cloud credits (the \"Additional\nCredits\") when you create your first Public Cloud infrastructure project.\nOffer applies only to Public Cloud services purchased from OVHcloud\ndatacenters in the United States. Offer available only to select customers\nwho, at the time when the Additional Credits are applied, are not purchasing\nPublic Cloud services from OVHcloud and who purchase at least $0.99 (USD)\nPublic Cloud services from OVHcloud. No code is required. The Additional\nCredits will be added to eligible accounts within 30 days of OVHcloud's\nreceipt of the $0.99 for your purchase of Public Cloud credits. The Additional\nCredits are valid until December 31, 2023, at 23:59:59 ET. The Additional\nCredits will automatically be applied to your next bill(s) up to a maximum\namount of $400.00. Any unused portion of the Additional Credits will expire.\nThe Additional Credits have no monetary value, and cannot be exchanged,\ntransferred, or refunded. Once the Additional Credits are exhausted or\nexpired, your account will be debited in accordance with OVHcloud’s billing\nguide.\n\nBack to top\n\n  * Tools\n\n    * My Account\n    * API\n    * Service Status\n    * Report Abuse\n\n  * Support\n\n    * Help Center\n    * Featured Guides\n    * Glossary\n    * Professional Services\n\n  * Contact us\n\nNew orders, technical advice, questions?\n\nRequest a Callback\n\nTalk to an Expert\n\n  * News\n\n    * Press\n    * Blog\n    * Black Friday Deals\n\n  * Social Networks\n\n    *     *     *     *     *     *     *     * \n\n  * Copyright ©2023 OVH US LLC and affiliated companies all rights reserved. OVHcloud, the OVHcloud logo and all other OVH marks contained herein are registered trademarks of OVH SAS.  \nAll other marks contained herein are the property of their respective owners.\n\n  * Terms of Service\n  * Legal\n  * About OVHcloud\n  * OVHcloud Careers\n\nThis website uses cookies, web beacons, and other similar technologies to\nprovide you with the best browsing experience, to perform marketing\nactivities, and to analyze our traffic. OVHcloud uses this technology in\naccordance with our Privacy Policy and Cookie Policy. Click here to change\nyour settings.\n\nAccept\n\n"
}