{
    "summary": "  * Skip to content\n  * Accessibility Policy\n\nContact Sales Sign in to Oracle Cloud\n\n  * About\n\n  * Services\n\n  * Solutions\n\n  * Pricing\n\n  * Partners\n\n  * Resources\n\nClose Search\n\nSearch Oracle.com\n\n  * QUICK LINKS\n  * Oracle Cloud Infrastructure\n  * Oracle Fusion Cloud Applications\n  * Oracle Database\n  * Download Java\n  * Careers at Oracle\n\nSearch\n\nCountry\n\nClose\n\nWould you like to visit an Oracle country site closer to you?\n\nVisit Oracle United States\n\nNo thanks, I'll stay here\n\nSee this page for a different country/region\n\nMenu Menu Contact Sales Sign in to Oracle Cloud\n\n  * Overview\n\n  * Compute Services\n    * Arm-Based Compute\n    * Bare Metal Servers\n    * Compute Cloud@Customer\n    * Container Engine for Kubernetes\n    * Functions\n    * HPC Compute\n    * GPU-Accelerated Compute\n    * Operating Systems\n    * Virtual Desktop\n    * Virtual Machines\n    * VMware\n\n  * Pricing\n\n  * Documentation\n\n  * Customers\n\n  * More\n\n    * Arm-Based Compute\n    * Bare Metal Servers\n    * Compute Cloud@Customer\n    * Container Engine for Kubernetes\n    * Functions\n    * HPC Compute\n    * GPU-Accelerated Compute\n    * Operating Systems\n    * Virtual Desktop\n    * Virtual Machines\n    * VMware\n\n# GPU instances\n\nOracle Cloud Infrastructure (OCI) Compute provides bare metal and virtual\nmachine instances powered by NVIDIA GPUs for a variety of use cases, including\nmainstream graphics and videos as well as the most demanding AI training and\nHPC workloads. OCI excels at both training time and cost compared to Amazon\nWeb Services (AWS) and Google Cloud Platform (GCP) because of its ultralow\nlatency and near line-rate network performance.\n\nNew: NVIDIA H100 and L40S on OCI\n\nLearn more about OCI Supercluster\n\nSoundHound scales voice AI on OCI, improving performance 50% to 60% (3:28)\n\n### OCI at NVIDIA GTC, the conference for AI and the metaverse\n\nWatch the sessions on demand\n\n## GPU instances—key features\n\nRemote direct memory access (RDMA) communication between instances supports\nlarge GPU clusters with 3,200 Gb/sec of bandwidth and ultralow latency.\n\nAccelerate workloads Right-size applications Optimize price-performance Access\nreadily-available software Choice of operating systems Secure cloud\ninfrastructure\n\n  * Accelerate workloads\n  * Right-size applications\n  * Optimize price-performance\n  * Access readily-available software\n  * Choice of operating systems\n  * Secure cloud infrastructure\n\n### Accelerate workloads\n\n#### High performance NVIDIA GPU instances\n\n##### NVIDIA Tensor Core GPUs\n\nOCI offers the highest value and performance for bare metal and virtual\nmachine compute instances powered by these NVIDIA GPUs: H100, L40S (coming\nsoon), A100, A10, V100, and P100.\n\n##### Bare metal performance\n\nBare metal compute instances allow customers to run high performance, latency-\nsensitive, and specialized workloads directly on server hardware—just as they\nwould on-premises.\n\n##### High performance cluster networking\n\nOracle’s ultralow-latency cluster networking, based on RDMA, provides\nmicrosecond-level latency. Without compromising on performance, customers can\nhost clusters with 512 or fewer GPUs and OCI Superclusters with more than 512\nGPUs.\n\n  * Learn more about the performance of massively parallel GPU clusters\n\n  \n\nBandwidth against cluster nodes; 1 node = 8 NVIDIA A100 GPUs.\n\n### Right-size applications\n\n#### Choose from a variety of VM and bare metal compute instances\n\n##### Virtual machines and bare metal\n\nMatch your workload with the best instance type to find your ideal fit.\n\n##### VM instances\n\nFor VMs, choose from NVIDIA Ampere, Volta, and Pascal GPUs with one to four\ncores, 16 to 64 GB of GPU memory, and up to 480 GB of locally attached flash\nstorage.\n\n##### Bare metal instances\n\nCluster bare metal instances for HPC and AI training using NVIDIA H100 or A100\nTensor Core GPUs with 640 GB of GPU memory per node.\n\n  * Learn more about accelerating AI inference and graphics workloads\n\n  \n\nComparing the performance of NVIDIA V100 and A10 GPUs\n\n### Optimize price-performance\n\n#### Reduce networking and storage costs\n\n##### Up to 61% better compute pricing\n\nOCI E4 instances provide 57% to 61% better pricing than AWS, Microsoft Azure,\nand Google Cloud.\n\n##### Block storage price-performance advantage\n\nFor similar configurations, OCI can be 82% cheaper than AWS and Microsoft\nAzure and 61% cheaper than Google Cloud.\n\n##### Industry-leading networking prices\n\nOCI’s network egress pricing can be more than 80% less expensive than AWS in\nsome regions in North America and Europe.\n\n##### Consistent global pricing\n\nOCI’s pricing is simple and transparent across regions, ensuring that cloud\nspending is predictable regardless of the location where your workloads run.\n\n  * Learn more about cloud economics\n\n  \n\nComparing prices of cloud vendors across regions\n\n### Secure cloud infrastructure\n\n#### Secure cloud infrastructure\n\n##### Isolated network virtualization\n\nPrevent attacks on customer tenancies with isolated network virtualization. A\nfoundational element of Oracle Cloud Infrastructure’s security-first\narchitecture, the design stops malware in its tracks with a custom-designed\nSmartNIC to isolate and virtualize the network.\n\n##### Oracle Cloud Infrastructure Identity and Access Management\n\nUsing easy-to-define policies organized by logical groups of users and\nresources, control not only who has access to Oracle Cloud Infrastructure\nresources but which ones and the access type. Customers manage identities and\ngrant access by leveraging existing organizational hierarchies and federated\ndirectory services, including Microsoft, Okta, and other SAML directory\nproviders.\n\n##### Hardware root of trust\n\nReduce the risk of firmware-based attacks against Oracle Cloud Infrastructure\ncustomer tenants with custom-built, hardware-based, root-of-trust-technology\ndesigned to wipe and reinstall the firmware every time a new server is\nprovisioned or a new customer tenancy is established.\n\n##### Oracle Web Application Firewall\n\nProtect applications from malicious and unwanted internet traffic with a\ncloud-based, PCI-compliant, global web application firewall (WAF) service. By\ncombining threat intelligence with consistent rule enforcement, this service\nstrengthens defenses and protects internet-facing application servers.\n\n##### Oracle Cloud Infrastructure Vault\n\nCentrally manage and maintain control of the encryption keys and secret\ncredentials used to protect enterprise data and access resources. The security\nfor both are stored in Federal Information Processing Standards (FIPS) 140-2,\nLevel 3-certified, hardware security module (HSM).\n\nUsers can further control permissions for individual keys and vaults with OCI\nIdentity and Access Management and monitor key lifecycle changes with OCI\nAudit to meet enhanced compliance requirements.\n\n### Choice of operating systems\n\n#### Choice of operating systems\n\n##### Choose from popular operating systems\n\nOracle supports an extensive list of Microsoft Windows Server and enterprise\nLinux operating systems, including Oracle Linux, CentOS, Ubuntu, and many\nothers. Oracle Autonomous Linux is a free, autonomous operating environment\nthat reduces complexity and human error to deliver increased cost savings,\nsecurity, and availability.\n\n##### Automate operating system management\n\nThe OCI OS Management service allows customers to set policies for automated\nupdates and patches for their operating system environment.\n\nView documentation\n\n##### Bring your own image (BYOI)\n\nCustomers can run their own operating systems and hypervisors on Oracle\ncompute instances and use the same image across configuration sizes.\n\n### Access readily-available software\n\n#### Access readily-available software\n\n##### Access software and disk images\n\nOracle Cloud Marketplace provides software and disk images for data science,\nanalytics, artificial intelligence (AI), and machine learning (ML) models so\ncustomers can quickly gain insight from their data.\n\n##### NVIDIA GPU Cloud\n\nAccess hundreds of GPU-optimized applications for machine learning, deep\nlearning, and high performance computing covering a wide range of industries\nand workloads. Learn more.\n\n##### NVIDIA RTX Virtual Workstation\n\nCustomers can deliver powerful workstation performance wherever employees need\nit by running NVIDIA RTX Virtual Workstation on Oracle Cloud.\n\n#### Microservices and containers\n\n##### Container registry\n\nDevelopers building applications using containers leverage a highly available,\nOracle-managed private container registry service for storing and sharing\ncontainer images. Push or pull Docker images to and from the registry using\nthe Docker V2 API and the standard Docker command line interface (CLI). Images\ncan be pulled directly into a Kubernetes deployment.\n\n##### Oracle Functions\n\nFunctions as a service (FaaS) lets developers run serverless applications that\nintegrate with Oracle Cloud Infrastructure, Oracle Cloud Applications, and\nthird-party services. Gain developer efficiency along with the community of\nthe open source Fn Project.\n\n### Talk with Oracle about accelerating your GPU workloads.\n\nTalk with an AI/ML expert\n\n## GPU instances—use cases\n\n  * AI training and inferencing\n  * Virtual desktops\n  * Computational fluid dynamics (CFD)\n\nAI training and inferencing\n\n  *   * AI training and inferencing\n  * Virtual desktops\n  * Computational fluid dynamics (CFD)\n\n## AI infrastructure for deep learning training and inferencing\n\nTrain AI models using OCI Data Science, bare metal instances, cluster\nnetworking based on RDMA, and NVIDIA GPUs.\n\nLearn about GPUs for AI innovators\n\n  \nThis diagram describes two stages of deep learning model development: model\ntraining and model inferencing. In model training on the left, the untrained\nneural network is input to a training algorithm enabled by OCI Data Science,\nbare metal compute, local storage, and cluster networking. The output of the\ntraining algorithm is a trained model with a new capability. The model\ninferencing step is described on the right. Consider a trained model such as\nDALL-E 2, which can take text inputs and generate images. A text input is fed\ninto the trained model, and an image output from the model is provided.\n\n## Virtual desktop infrastructure (VDI)\n\nOCI Compute powered by NVIDIA GPUs provide consistent high performance for\nVDI.\n\nExplore virtual desktops and HPC\n\n  \nVirtual desktop infrastructure\n\n## CFD and high performance computing using GPU instances\n\nOCI enables computer-aided engineering and computational fluid dynamics for\nfast predictions of the aerodynamic properties of objects.\n\nSee how Punch Torino deployed HPC on OCI (3:18)\n\n  \nCFD and high performance computing using GPU instances\n\n## See how OCI and NVIDIA power next-generation AI models\n\n  * Explore more customer stories\n\n  \n\n  * Adept\n\n  * SoundHound\n\n  * Softdrive\n\n  * Twist Bioscience \n\n  * National Grid\n\n  * Tango Eye\n\n  * Altair\n\n  \n\n##### Adept builds a powerful AI teammate for everyone with Oracle and NVIDIA\n\n“With the scalability and computing power of OCI and NVIDIA technology, we are\ntraining a neural network to use every software application, website, and API\nin existence—building on the capabilities that software makers have already\ncreated.”\n\n**David Luan, CEO**  \nAdept\n\nRead the Adept press release\n\nCloudWorld: Watch the Adept conversation (7:10)\n\n##### National Grid analyzes weather 40% better on Oracle Cloud\n\n“Oracle Cloud Infrastructure allows us to process tens of thousands of models,\nso we can train our algorithms very quickly. It’s one of the best platforms in\nthe world for the type of work we do.”\n\n**James Kelloway, Energy Intelligence Manager**  \nNational Grid ESO\n\nRead the National Grid story\n\nWatch the National Grid video (1:40)\n\n##### SoundHound selects OCI to support huge company growth\n\n“We view this relationship with OCI as long term. We’re excited about taking\nadvantage of the GPUs and using that to train our next generation of voice AI.\nThere's a lot that we think that OCI will provide for us in terms of future\ngrowth.”\n\n**James Hom, Cofounder and Vice President of Products**  \nSoundHound\n\nRead the SoundHound story\n\nWatch the SoundHound video (3:28)\n\n##### Softdrive offers next-generation workstations with OCI Compute and\nNVIDIA A10\n\n“Softdrive is the future of business computers. In the cloud PC market,\nperformance means everything. NVIDIA GPUs on OCI bare metal servers have\ndramatically improved the experience for our customers.”\n\n**Leonard Ivey, Cofounder**  \nSoftdrive\n\nRead the Softdrive story\n\n##### Twist Bioscience leverages OCI and AI to advance protein initiatives\n\n“With NVIDIA GPUs running on OCI bare metal instances, Twist experiences\nsignificant performance improvements across its ParaFold and ESMFold AI\nmodels.”\n\nRead the Twist Bioscience story\n\n##### WEKA on OCI delivers 2 terabytes per second performance\n\n“Oracle Cloud Infrastructure is a top tier Hyperscaler cloud that provides\nXaaS compute and application services to Oracle customers, and offers a lot\nmore than you might expect, including AI/ML and GPU workloads.”\n\n**Joel Kaufman**  \nSenior Technical Marketing Manager, WEKA\n\nRead the WEKA story\n\nDownload the WEKA brief (PDF)\n\n##### Tango Eye serves more customers at lower cost with Oracle\n\n“Since moving off AWS, we have quadrupled our data footprint while reducing\nour costs by 40%. We use 33% less GPU compute capacity on OCI than AWS.”\n\n**Suren Gounder, CEO**  \nTango Eye\n\nRead the Tango Eye story\n\n##### Altair tests and runs complex simulations overnight on OCI\n\n“The integration with Oracle’s cloud platform provides us with state-of-the-\nart GPU compute resources, world-class security, and highly flexible VMware\nenvironments. Ultimately, this leads to improved productivity, optimized\nresource utilization, and faster time to market.”\n\n**Sam Mahalingam, Chief Technology Officer**  \nAltair\n\nRead the Altair story\n\nWatch the Altair video (1:06)\n\n## GPU specifications and pricing\n\nCurrency AUD - Australian Dollar ($) CAD - Canadian Dollar ($) EUR - Euro (€)\nGBP - British Pound (£) USD - US Dollar ($) ──────────────────── BGN -\nBulgarian Lev (лв.) BRL - Brazilian Real (R$) CHF - Swiss Franc (CHF) CZK -\nCzech Koruna (Kč) DKK - Danish Krone (kr) HKD - Hong Kong Dollar (HK$) HUF -\nHungarian Forint (Ft) JPY - Japanese Yen (¥) NOK - Norwegian Krone (kr) PLN -\nPolish Zloty (zł) RON - Romanian Leu (lei) SEK - Swedish Krona (kr) SGD -\nSingapore Dollar ($)\n\n####  GPU Instances Specifications\n\nInstances are available as virtual machines and bare metal, providing\nflexibility and high performance.\n\nShape\n\n|\n\nGPUs\n\n|\n\nArchitecture\n\n|\n\nGPU Interconnect\n\n|\n\nGPU Memory\n\n|\n\nCPU Cores\n\n|\n\nCPU Memory\n\n|\n\nStorage\n\n|\n\nNetwork\n\n|\n\nGPU Price Per Hour (US$)\n\n|\n\nServer Price Per Hour (US$)  \n  \n---|---|---|---|---|---|---|---|---|---|---  \nLarge scale-out AI training, data analytics, and HPC  \n  \nBM.GPU.A100-v2.8\n\n|\n\n8x NVIDIA A100 80GB Tensor Core\n\n|\n\nAmpere\n\n|\n\nNVIDIA NVLINK\n\n|\n\n640 GB\n\n|\n\n128\n\n|\n\n2,048 GB\n\n|\n\n4x 6.8TB NVMe\n\n|\n\n8x2x100 Gb/sec RDMA*\n\n|\n\n$4.00\n\n| $32  \n  \nBM.GPU4.8\n\n|\n\n8x NVIDIA A100 40GB Tensor Core\n\n|\n\nAmpere\n\n|\n\nNVIDIA NVLINK\n\n|\n\n320 GB\n\n|\n\n64\n\n|\n\n2,048 GB\n\n|\n\n4x 6.8TB NVMe\n\n|\n\n8x2x100 Gb/sec RDMA*\n\n|\n\n$3.05\n\n| $24.4  \nSmall AI training, inference, streaming, gaming, and virtual desktop\ninfrastructure  \n  \nVM.GPU.A10.1  \n(new)\n\n|\n\n1x NVIDIA A10 Tensor Core\n\n|\n\nAmpere\n\n|\n\nN/A\n\n|\n\n24 GB\n\n|\n\n15\n\n|\n\n240 GB\n\n|\n\nBlock storage\n\n|\n\n24 Gb/sec\n\n|\n\n$2.00\n\n|\n\n$2  \n  \nVM.GPU.A10.2  \n(new)\n\n|\n\n2x NVIDIA A10 Tensor Core\n\n|\n\nAmpere\n\n|\n\nN/A\n\n|\n\n48 GB\n\n|\n\n30\n\n|\n\n480 GB\n\n|\n\nBlock storage\n\n|\n\n48 Gb/sec\n\n|\n\n$2.00\n\n|\n\n$4  \n  \nBM.GPU.A10.4\n\n|\n\n4x NVIDIA A10 Tensor Core\n\n|\n\nAmpere\n\n|\n\nN/A\n\n|\n\n96 GB\n\n|\n\n64\n\n|\n\n1,024 GB\n\n|\n\n2x 3.84TB NVMe\n\n|\n\n2x50 Gb/sec\n\n|\n\n$2.00\n\n|\n\n$8  \n  \nVM.GPU3.1\n\n|\n\n1x NVIDIA V100 Tensor Core\n\n|\n\nVolta\n\n|\n\nN/A\n\n|\n\n16 GB\n\n|\n\n6\n\n|\n\n90 GB\n\n|\n\nBlock storage\n\n|\n\n4 Gb/sec\n\n|\n\n$2.95\n\n|\n\n$2.95  \n  \nVM.GPU3.2\n\n|\n\n2x NVIDIA V100 Tensor Core\n\n|\n\nVolta\n\n|\n\nNVIDIA NVLINK\n\n|\n\n32 GB\n\n|\n\n12\n\n|\n\n180 GB\n\n|\n\nBlock storage\n\n|\n\n8 Gb/sec\n\n|\n\n$2.95\n\n|\n\n$5.9  \n  \nVM.GPU3.4\n\n|\n\n4x NVIDIA V100 Tensor Core\n\n|\n\nVolta\n\n|\n\nNVIDIA NVLINK\n\n|\n\n64 GB\n\n|\n\n24\n\n|\n\n360 GB\n\n|\n\nBlock storage\n\n|\n\n25 Gb/sec\n\n|\n\n$2.95\n\n|\n\n$11.8  \n  \nBM.GPU3.8\n\n|\n\n8x NVIDIA V100 Tensor Core\n\n|\n\nVolta\n\n|\n\nNVIDIA NVLINK\n\n|\n\n128 GB\n\n|\n\n52\n\n|\n\n768 GB\n\n|\n\nBlock storage\n\n|\n\n2x 25 Gb/sec\n\n|\n\n$2.95\n\n|\n\n$23.6  \n  \nVM.GPU2.1\n\n|\n\n1x NVIDIA P100\n\n|\n\nPascal\n\n|\n\nN/A\n\n|\n\n16 GB\n\n|\n\n12\n\n|\n\n72 GB\n\n|\n\nBlock storage\n\n|\n\n8 Gb/sec\n\n|\n\n$1.275\n\n|\n\n$1.28  \n  \nBM.GPU2.2\n\n|\n\n2x NVIDIA P100\n\n|\n\nPascal\n\n|\n\nN/A\n\n|\n\n32 GB\n\n|\n\n28\n\n|\n\n192 GB\n\n|\n\nBlock storage\n\n|\n\n2x 25 Gb/sec\n\n|\n\n$1.275\n\n|\n\n$2.55  \n  \n  * *Each NVIDIA A100 node has eight 2-100 Gb/sec NVIDIA ConnectX SmartNICs connected through OCI’s high-performance cluster network blocks, resulting in 1,600 Gb/sec of bandwidth between nodes.\n\n**November 13, 2023**\n\n### Announcing plans to offer NVIDIA Grace Hopper Superchip on OCI\n\nSagar Rawal, Vice President, Oracle Cloud Infrastructure\n\nToday at SC23, we’re announcing our upcoming plans to offer Oracle Cloud\nInfrastructure (OCI) Compute instances powered by the NVIDIA GH200 Grace\nHopper Superchip. The GH200 consists of an Arm CPU (Grace) linked to an NVIDIA\nH100 Tensor Core GPU (Hopper) with a high-bandwidth memory space of 576 GB.\n\nRead the complete post\n\n#### Featured blogs\n\n  * **September 19, 2023**Announcing general availability for OCI Compute bare metal instances powered by NVIDIA H100 GPUs\n  * **September 19, 2023** Announcing OCI Compute with NVIDIA L40S GPUs \n  * **September 12, 2023** OCI’s exceptional performance for AI validated in MLPerf Inference v3.1 results\n  * **July 24, 2023** OCI accelerates HPC, AI, and database using RoCE and NVIDIA ConnectX\n\n## Get started with OCI Compute services\n\n  * Free trial\n  * Hands-on labs\n  * Resources\n  * Reference architectures\n  * Estimate your costs\n  * Contact sales\n\nFree trial\n\n  *   * Free trial\n  * Hands-on labs\n  * Resources\n  * Reference architectures\n  * Estimate your costs\n  * Contact sales\n\n### Try 20+ Always Free cloud services, with a 30-day trial for even more\n\nOracle offers a Free Tier with no time limits on more than 20 services such as\nCompute, Storage, and Autonomous Database, as well as US$300 in free credits\nto try additional cloud services. Get the details and sign up for your free\naccount today.\n\nTry OCI for free\n\n  * #### What’s included with Oracle Cloud Free Tier?\n\n    * AMD and Arm Compute VMs\n    * 200 GB total block storage\n    * 10 GB object storage\n    * 2 Autonomous Databases, 20 GB each\n    * 10 TB outbound data transfer per month\n    * 10+ more Always Free services\n    * US$300 in free credits for 30 days for even more\n\n### Learn with a hands-on lab\n\nThe best way to learn is to try it yourself. Use our tutorials and hands-on\nlabs with the Oracle Cloud Free Tier, your own Oracle Cloud tenancy, or for\nselected solutions in an Oracle-provided free lab environment.\n\nSee all tutorials and labs\n\n  * #### Deploy HA Applications Using Load Balancers\n\nIn this lab you will deploy web servers on two compute instances in Oracle\nCloud Infrastructure (OCI), configured in High Availability mode by using a\nLoad Balancer.\n\nStart this lab now\n\n  * #### Get started with OCI Core Services\n\nExplore basic OCI services, including Compute, Networking, and Storage.\n\nStart this lab now\n\n  * #### Deploy Oracle Container Engine for Kubernetes \n\nIn this lab you will deploy a Container Engine for Kubernetes cluster, connect\nto it, and run a sample application using OCI CLI.\n\nStart this lab now\n\n  * #### Migrate Tomcat Java Applications to OCI\n\nExplore how to migrate Tomcat to Oracle Cloud Infrastructure and connect to an\nAutonomous Database.\n\nStart this lab now\n\n### Additional resources\n\nLearn more about preemptible capacity, burstable instances, autoscaling, GPUs,\nflexible computing, and more.\n\nRun Workloads Your Way on OCI\n\n  * #### Documentation\n\n    * Compute overview\n    * Compute capacity types\n    * Burstable instances\n    * Autoscaling\n  * #### Related pages\n\n    * Bare metal servers\n    * Virtual machines\n    * GPU instances\n    * High performance computing (HPC)\n\n### Explore more than 150 best-practice designs\n\nSee how our architects and other customers deploy a wide range of workloads,\nfrom enterprise apps to HPC, from microservices to data lakes. Understand the\nbest practices, hear from other customer architects in our Built & Deployed\nseries, and even deploy many workloads with our \"click to deploy\"\ncapability—or do it yourself from our GitHub repo.\n\nSee all reference architectures\n\n#### Popular architectures\n\n  * Apache Tomcat with MySQL Database Service\n  * Oracle Weblogic on Kubernetes with Jenkins\n  * Machine learning (ML) and AI environments\n  * Tomcat on Arm with Oracle Autonomous Database\n  * Log analysis with ELK Stack\n  * HPC with OpenFOAM\n\n### See how much you can save with OCI\n\nOracle Cloud pricing is simple, with consistent low pricing worldwide,\nsupporting a wide range of use cases. To estimate your low rate, check out the\ncost estimator and configure the services to suit your needs.\n\nTry Cost Estimator\n\n#### Experience the difference\n\n  * 1/4 the outbound bandwidth costs\n  * 3X the compute price-performance\n  * Same low price in every region\n  * Low pricing without long term commitments\n\n### Contact sales\n\nInterested in learning more about Oracle Cloud Infrastructure? Let one of our\nexperts help.\n\nGet in touch\n\n  * #### They can answer questions such as\n\n    * How do I get started with Oracle Cloud?\n    * What kinds of workloads can I run on OCI?\n    * What types of services does OCI offer?\n\n#### Resources for\n\n  * Careers\n  * Developers\n  * Investors\n  * Partners\n  * Startups\n  * Students and Educators\n\n#### Why Oracle\n\n  * Analyst Reports\n  * Cloud Economics\n  * with Microsoft Azure\n  * vs. AWS\n  * vs. Google Cloud\n  * vs. MongoDB\n\n#### Learn\n\n  * What is AI?\n  * What is Cloud Computing?\n  * What is Cloud Storage?\n  * What is HPC?\n  * What is IaaS?\n  * What is PaaS?\n\n#### What’s new\n\n  * Oracle Supports Ukraine\n  * Oracle Cloud Free Tier\n  * Cloud Architecture Center\n  * Cloud Lift\n  * Oracle Support Rewards\n  * Oracle Red Bull Racing\n\n#### Contact us\n\n  * US Sales: +1.800.633.0738\n  * How can we help?\n  * Subscribe to emails\n  * Events\n  * News\n  * OCI Blog\n\n* * *\n\n  * © 2023 Oracle\n  * Privacy/Do Not Sell My Info\n  * Cookie Preferences\n\n  * Ad Choices\n  * Careers\n\n  *   *   *   * \n\n",
    "links": "[{\"link\": \"https://www.oracle.com/corporate/accessibility/\", \"text\": \"Accessibility Policy\"}, {\"link\": \"https://www.oracle.com/\", \"text\": \"\"}, {\"link\": \"https://www.oracle.com/cloud/\", \"text\": \"\"}, {\"link\": \"https://www.oracle.com/corporate/contact/\", \"text\": \"\"}, {\"link\": \"https://www.oracle.com/cloud/\", \"text\": \"Oracle Cloud Infrastructure\"}, {\"link\": \"https://www.oracle.com/applications/\", \"text\": \"Oracle Fusion Cloud Applications\"}, {\"link\": \"https://www.oracle.com/database/\", \"text\": \"Oracle Database\"}, {\"link\": \"https://www.oracle.com/java/technologies/downloads/\", \"text\": \"Download Java\"}, {\"link\": \"https://www.oracle.com/careers/\", \"text\": \"Careers at Oracle\"}, {\"link\": \"https://www.oracle.com/countries-list.html#countries\", \"text\": \"\"}, {\"link\": \"https://www.oracle.com/cloud/compute/gpu/\", \"text\": \"\"}, {\"link\": \"https://www.oracle.com/countries-list.html#countries\", \"text\": \"See this page for a different country/region\"}, {\"link\": \"https://www.oracle.com/oci-menu-v3/\", \"text\": \"\"}, {\"link\": \"https://www.oracle.com/corporate/contact/\", \"text\": \"\"}, {\"link\": \"https://www.oracle.com/cloud/compute/\", \"text\": \"Overview\"}, {\"link\": \"https://www.oracle.com/cloud/compute/arm/\", \"text\": \"Arm-Based Compute\"}, {\"link\": \"https://www.oracle.com/cloud/compute/bare-metal/\", \"text\": \"Bare Metal Servers\"}, {\"link\": \"https://www.oracle.com/cloud/compute/cloud-at-customer/\", \"text\": \"Compute Cloud@Customer\"}, {\"link\": \"https://www.oracle.com/cloud/cloud-native/container-engine-kubernetes/\", \"text\": \"Container Engine for Kubernetes\"}, {\"link\": \"https://www.oracle.com/cloud/cloud-native/functions/\", \"text\": \"Functions\"}, {\"link\": \"https://www.oracle.com/cloud/hpc/\", \"text\": \"HPC Compute\"}, {\"link\": \"https://www.oracle.com/cloud/compute/gpu/\", \"text\": \"GPU-Accelerated Compute\"}, {\"link\": \"https://www.oracle.com/cloud/compute/os/\", \"text\": \"Operating Systems\"}, {\"link\": \"https://www.oracle.com/cloud/compute/virtual-desktop/\", \"text\": \"Virtual Desktop\"}, {\"link\": \"https://www.oracle.com/cloud/compute/virtual-machines/\", \"text\": \"Virtual Machines\"}, {\"link\": \"https://www.oracle.com/cloud/compute/vmware/\", \"text\": \"VMware\"}, {\"link\": \"https://www.oracle.com/cloud/compute/pricing/\", \"text\": \"Pricing\"}, {\"link\": \"https://www.oracle.com/cloud/compute/arm/\", \"text\": \"Arm-Based Compute\"}, {\"link\": \"https://www.oracle.com/cloud/compute/bare-metal/\", \"text\": \"Bare Metal Servers\"}, {\"link\": \"https://www.oracle.com/cloud/compute/cloud-at-customer/\", \"text\": \"Compute Cloud@Customer\"}, {\"link\": \"https://www.oracle.com/cloud/cloud-native/container-engine-kubernetes/\", \"text\": \"Container Engine for Kubernetes\"}, {\"link\": \"https://www.oracle.com/cloud/cloud-native/functions/\", \"text\": \"Functions\"}, {\"link\": \"https://www.oracle.com/cloud/hpc/\", \"text\": \"HPC Compute\"}, {\"link\": \"https://www.oracle.com/cloud/compute/gpu/\", \"text\": \"GPU-Accelerated Compute\"}, {\"link\": \"https://www.oracle.com/cloud/compute/os/\", \"text\": \"Operating Systems\"}, {\"link\": \"https://www.oracle.com/cloud/compute/virtual-desktop/\", \"text\": \"Virtual Desktop\"}, {\"link\": \"https://www.oracle.com/cloud/compute/virtual-machines/\", \"text\": \"Virtual Machines\"}, {\"link\": \"https://www.oracle.com/cloud/compute/vmware/\", \"text\": \"VMware\"}, {\"link\": \"https://www.oracle.com/cloud/hpc/gpus-for-ai-innovators/\", \"text\": \"AI training and HPC workloads\"}, {\"link\": \"https://www.oracle.com/news/announcement/oci-compute-instances-nvidia-ampere-2023-09-19/\", \"text\": \"New: NVIDIA H100 and L40S on OCI\"}, {\"link\": \"https://www.oracle.com/news/announcement/nvidia-chooses-oracle-cloud-infrastructure-for-ai-services-2023-03-21/ \", \"text\": \"Learn more about OCI Supercluster\"}, {\"link\": \"https://www.oracle.com/ai-infrastructure/\", \"text\": \"OCI Superclusters\"}, {\"link\": \"https://www.oracle.com/a/ocom/img/rc30-nccl-performance-nvidia-a-100.png\", \"text\": \"\"}, {\"link\": \"https://www.oracle.com/a/ocom/img/rc30-precision-performance-nvidia-a10-v100.png\", \"text\": \"\"}, {\"link\": \"https://www.oracle.com/cloud/economics/\", \"text\": \"Learn more about cloud economics\"}, {\"link\": \"https://www.oracle.com/a/ocom/img/rc30-oci-low-global-pricing.png\", \"text\": \"\"}, {\"link\": \"https://www.oracle.com/linux/autonomous-linux/\", \"text\": \"Oracle Autonomous Linux\"}, {\"link\": \"https://www.oracle.com/data-science/\", \"text\": \"data science\"}, {\"link\": \"https://www.oracle.com/business-analytics/\", \"text\": \"analytics\"}, {\"link\": \"https://www.oracle.com/artificial-intelligence/\", \"text\": \"artificial intelligence (AI)\"}, {\"link\": \"https://www.oracle.com/cloud/hpc/gpus-for-ai-innovators/expert-form/\", \"text\": \"Talk with an AI/ML expert\"}, {\"link\": \"https://www.oracle.com/cloud/hpc/gpus-for-ai-innovators/\", \"text\": \"Learn about GPUs for AI innovators\"}, {\"link\": \"https://docs.oracle.com/en/solutions/vdi-and-hpc-in-oci/index.html#GUID-EB9841BF-9F05-4411-9355-65A920D2D5F5\", \"text\": \" Explore virtual desktops and HPC\"}, {\"link\": \"https://www.oracle.com/cloud/customers/\", \"text\": \"Explore more customer stories\"}, {\"link\": \"https://www.oracle.com/news/announcement/adept-builds-an-ai-teammate-for-everyone-with-oracle-and-nvidia-2022-08-11/\", \"text\": \"Read the Adept press release\"}, {\"link\": \"https://blogs.oracle.com/cloud-infrastructure/post/weka-on-oracle-cloud-infrastructure-delivers-2-terabytes-per-second-performance\", \"text\": \"Read the WEKA story\"}, {\"link\": \"https://www.oracle.com/cloud/hpc/gpus-for-ai-innovators/weka-form/\", \"text\": \"Download the WEKA brief (PDF)\"}, {\"link\": \"https://www.oracle.com/cloud/free/\", \"text\": \"Try OCI for free\"}, {\"link\": \"https://www.oracle.com/cloud/compute/bare-metal/\", \"text\": \"Bare metal servers\"}, {\"link\": \"https://www.oracle.com/cloud/compute/virtual-machines/\", \"text\": \"Virtual machines\"}, {\"link\": \"https://www.oracle.com/cloud/compute/gpu/\", \"text\": \"GPU instances\"}, {\"link\": \"https://www.oracle.com/cloud/hpc/\", \"text\": \"High performance computing (HPC)\"}, {\"link\": \"https://www.oracle.com/cloud/costestimator.html\", \"text\": \"Try Cost Estimator\"}, {\"link\": \"https://www.oracle.com/cloud/contact-form.html\", \"text\": \"Get in touch\"}, {\"link\": \"https://www.oracle.com/corporate/careers/\", \"text\": \"Careers\"}, {\"link\": \"https://www.oracle.com/partner/\", \"text\": \"Partners\"}, {\"link\": \"https://www.oracle.com/cloud/oracle-for-startups/\", \"text\": \"Startups\"}, {\"link\": \"https://www.oracle.com/corporate/analyst-reports/\", \"text\": \"Analyst Reports\"}, {\"link\": \"https://www.oracle.com/cloud/economics/\", \"text\": \"Cloud Economics\"}, {\"link\": \"https://www.oracle.com/cloud/azure/\", \"text\": \"with Microsoft Azure\"}, {\"link\": \"https://www.oracle.com/cloud/oci-vs-aws/\", \"text\": \"vs. AWS\"}, {\"link\": \"https://www.oracle.com/cloud/oci-vs-google-cloud/\", \"text\": \"vs. Google Cloud\"}, {\"link\": \"https://www.oracle.com/autonomous-database/autonomous-json-database/oracle-json-vs-mongodb-atlas/\", \"text\": \"vs. MongoDB\"}, {\"link\": \"https://www.oracle.com/artificial-intelligence/what-is-ai/\", \"text\": \"What is AI?\"}, {\"link\": \"https://www.oracle.com/cloud/what-is-cloud-computing/\", \"text\": \"What is Cloud Computing?\"}, {\"link\": \"https://www.oracle.com/cloud/storage/what-is-cloud-storage/\", \"text\": \"What is Cloud Storage?\"}, {\"link\": \"https://www.oracle.com/cloud/hpc/what-is-hpc/\", \"text\": \"What is HPC?\"}, {\"link\": \"https://www.oracle.com/cloud/what-is-iaas/\", \"text\": \"What is IaaS?\"}, {\"link\": \"https://www.oracle.com/cloud/what-is-paas/\", \"text\": \"What is PaaS?\"}, {\"link\": \"https://www.oracle.com/corporate/conflict-in-ukraine/\", \"text\": \"Oracle Supports Ukraine\"}, {\"link\": \"https://www.oracle.com/cloud/free/?source=:ow:o:h:nav:092121OCISiteFooter&intcmp=:ow:o:h:nav:092121OCISiteFooter\", \"text\": \"Oracle Cloud Free Tier\"}, {\"link\": \"https://www.oracle.com/cloud/architecture-center/\", \"text\": \"Cloud Architecture Center\"}, {\"link\": \"https://www.oracle.com/cloud/cloud-lift/\", \"text\": \"Cloud Lift\"}, {\"link\": \"https://www.oracle.com/cloud/rewards/\", \"text\": \"Oracle Support Rewards\"}, {\"link\": \"https://www.oracle.com/redbullracing/\", \"text\": \"Oracle Red Bull Racing\"}, {\"link\": \"https://www.oracle.com/corporate/contact/\", \"text\": \"How can we help?\"}, {\"link\": \"https://www.oracle.com/cloud/events/\", \"text\": \"Events\"}, {\"link\": \"https://www.oracle.com/news/\", \"text\": \"News\"}, {\"link\": \"https://www.oracle.com/legal/copyright.html\", \"text\": \"© 2023 Oracle\"}, {\"link\": \"https://www.oracle.com/legal/privacy/\", \"text\": \"Privacy\"}, {\"link\": \"https://www.oracle.com/legal/privacy/privacy-choices.html\", \"text\": \"Do Not Sell My Info\"}, {\"link\": \"https://www.oracle.com/legal/privacy/advertising-privacy-policy.html#adchoices\", \"text\": \"Ad Choices\"}, {\"link\": \"https://www.oracle.com/corporate/careers/\", \"text\": \"Careers\"}]",
    "priceAndPlans": "Error: Timeout 30000ms exceeded. =========================== logs\n=========================== navigating to\n\"http://web.archive.org/web/20231128075531/https://www.oracle.com/\", waiting\nuntil \"load\" ============================================================\n\n"
}