{
    "summary": "### Oblivus\n\n  * Oblivus Cloud\n    * Virtual Servers\n    * Storage\n    * Networking\n    * Data Centers\n    * Availability\n    * Instance Restrictions\n  * Company\n\n###### Company\n\n    * About Us\n    * Blog\n    * Our Difference\n    * Terms of Service\n\n###### Resources\n\n    * Company Documentation\n    * API Documentation\n\n  * Pricing\n  * Contact\n\nSign Up Login  \n  \nhello@oblivus.com  \n+44 7868 907919  \n____\n\n  * Sign Up\n  * Login\n  * \n\n### Oblivus\n\n  * Oblivus Cloud\n    * Virtual Servers\n    * Storage\n    * Networking\n    * Data Centers\n    * Availability\n    * Instance Restrictions\n  * Company\n\n###### Company\n\n    * About Us\n    * Blog\n    * Our Difference\n    * Terms of Service\n\n###### Resources\n\n    * Company Documentation\n    * API Documentation\n\n  * Pricing\n  * Contact\n\nSign Up Login  \n  \nhello@oblivus.com  \n+44 7868 907919  \n____\n\n  * Sign Up\n  * Login\n  * \n\n## OBLIVUS CLOUD\n\n# Sca|  \nHPC of the future!\n\nDemocratized GPU Cloud starting at only **$0.29/hr**!  \n  \n**No quotas, no restrictions.**\n\nGet Started\n\n  \n  \n\nTrusted by companies, institutions and researchers across the world\n\n# 80%\n\nCHEAPER\n\n### 3\n\nDATA CENTERS\n\n### 13\n\nGPU SKUS\n\n### +11,000\n\nENTERPRISE-GRADE GPUS\n\n### Fast & Scalable\n\nOur infrastructure is equipped to meet your computing requirements, be it one\nor thousands of GPUs, or one vCPU to tens of thousands of vCPUs, we've got you\ncovered. Our resources are readily available to cater to your needs, whenever\nyou need them.\n\n  * __Easy scalability\n  * __No quotas or complicated verification processes\n\n  * __Lightning-fast API\n  * __Up to 30x faster than major CSPs\n\n  \nLearn More\n\n### Flexible Infrastructure\n\nSwitching between GPU and CPU instances is a breeze with our platform. You\nhave the flexibility to deploy, modify, and rescale your instances according\nto your needs, without any hassle.\n\n  * __GPU Compute\n  * __CPU Compute\n\n  * __State-of-the-art infrastructure\n  * __Available on demand and by reservation\n\n  \nPricing Availability\n\n## Pricing\n\n### Industry-leading transparent pricing\n\n### GPU Instances\n\n$0.51/hr  \n\n## NVIDIA Tesla V100\n\n##### Outstanding machine learning performance without breaking the bank!\n\n  \n\n##### Available Stock: 186\n\n$1.4/hr  \n\n## NVIDIA RTX A6000\n\n##### The latest technology at a significantly lower cost!\n\n  \n  \n\n##### Available Stock: 826\n\n$0.27/hr - $5.17/hr  \n\n## More: H100, A100, etc.\n\n##### Cutting-edge GPUs designed to meet the demands of your workloads!\n\n  \n  \n\n##### Available Stock: 5723\n\n  \n  \n\n### CPU Instances\n\n$0.04/hr  \n\n## AMD EPYC Milan\n\n##### Highest performance, latest architecture!\n\n$0.033/hr  \n\n## AMD EPYC Rome & Intel Xeon Scalable\n\n##### Outstanding cost-effective performance!\n\n$0.023/hr  \n\n## Intel Xeon v4\n\n##### General purpose with high core counts and boost clocks!\n\n$0.015/hr  \n\n## Intel Xeon v3\n\n##### A great performance-to-cost ratio for the most extensive batch\nworkloads!\n\n## Use Cases\n\n### Oblivus Cloud is suitable for any use case.\n\n##### Deep Learning & AI\n\nGain access to computational resources that are tailored to suit the\nintricacies of your models. Leverage our infrastructure to perform large-scale\ninference and access necessary libraries with our OblivusAI OS.\n\n##### Cloud Gaming\n\nUnleash the full potential of your gaming experience by utilizing our robust\ninfrastructure to play games at the settings of your choice.\n\n##### VFX\n\nStreamline your team's workflows with the cloud-based production, or harness\nour platform's rendering capabilities to access render capacity at scale.\n\n##### Institutional Supercomputer\n\nMaximize the potential of your research endeavors without having to allocate a\nsignificant budget towards the infrastructure with our platform.\n\n## Frequenty Asked Questions\n\nHow is billing handled?\n\nOur billing is based on a pre-paid model. You simply deposit funds and then\nprovision an instance. We will keep you informed of your decreasing balance\nand offer safeguards to prevent accidental deletion of your data.\nAdditionally, you can use our built-in Auto Top-Up system to convert our pre-\npaid model into a Pay-As-You-Go model.\n\nFor reserved instances, there is a one-time payment for the contract term. If\nyou need to extend the contract, you can do so at any time during the\nreservation period.\n\nHow can you offer such low prices?\n\nOur company believes that other cloud providers are overcharging their\ncustomers. By operating our business efficiently, we are able to offer\nservices that are up to 80% cheaper than those offered by our competitors,\nwhile still maintaining profitability.\n\nWe also prioritize cost-saving measures in our marketing strategy. Rather than\nspending excessive amounts on advertising, we rely on our competitive pricing\nto attract customers, which ultimately serves as our marketing strategy.\n\nWhat payment methods do you accept?\n\nWe accept several payment methods including card payments through Revolut,\nbank transfers, and cryptocurrency payments through Binance Pay.\n\nHow do personal and business accounts differ?\n\nPersonal accounts have no specific requirements and can use card payments.\nHowever, business accounts must be associated with a company and are\nrestricted to using bank transfers and Binance Pay to ensure the security of\nour business environment.\n\nAdditionally, business accounts are eligible for up to 7% better pricing rates\nthan personal accounts.\n\nAre there any restrictions on my account?\n\nNo, there are no restrictions on any accounts when using Oblivus Cloud. Our\nsystem is a combination of pre-paid and Pay-As-You-Go, which provides full\naccess to our infrastructure for all of our customers. You do not need to deal\nwith meaningless quota processes that limit your usage.\n\nDo you offer an API for your infrastructure?\n\nYes, we provide a blazing-fast API for our infrastructure. Once you have\ncreated an account, you can find your API Key and API Token in the console\nunder the API > Credentials page. In the event that your token is compromised,\nyou can reset it on the same page.\n\nHow do organizations function under Oblivus Cloud?\n\nYou can create an organization for your company which allows you to use the\nsame billing profile with all users in your organization. You can invite users\nto Oblivus Cloud via the console and manage their permissions, making\nmanagement easier while maintaining separate credentials for each user.\n\nDo you offer a free trial or credits?\n\nWhile we do offer free credits for marketing campaigns, we do not provide a\nfree trial. However, you can test our system with as little as $5.\n\n## GET STARTED\n\n### Artificial Intelligence is the future, Oblivus is where it happens.\n\nJoin Us\n\nAI-Made\n\nThe next generation GPU Cloud.\n\n____  \n\n#### Get in Touch\n\n71-75 Shelton Street, Covent Garden, London, United Kingdom, WC2H 9JQ\nhello@oblivus.com  \n+44 7868 907919\n\n#### Oblivus Cloud\n\n  * Virtual Servers\n  * Storage\n  * Networking\n  * Data Centers\n  * Pricing\n\n#### Company\n\n  * About Us\n  * Blog\n  * Our Difference\n  * Terms of Service\n  * Contact\n\n",
    "links": "[]"
}