{
    "summary": "  * 800.223.2273\n  * 100 Years of Cleveland Clinic\n  * MyChart\n  * Need Help?\n  * Giving\n  * Careers\n  * Search\n\n  * ClevelandClinic.org\n  * Find A Doctor\n  * Locations & Directions\n  * Patients & Visitors\n  * Health Library\n  * Institutes & Departments\n  * Appointments\n\nHome/\n\nHealth Library/\n\nDiseases & Conditions/\n\nUrinary Incontinence\n\nAdvertisementAdvertisement\n\nAdvertisement\n\n# Urinary Incontinence\n\nThe experience of uncontrollably leaking urine can be an embarrassing issue\nfor many people. Urinary incontinence is a loss of bladder control that’s\ncommonly seen in older adults and women who have given birth or gone through\nmenopause. Urinary tract infections (UTIs), pelvic floor disorders and an\nenlarged prostate are other causes.\n\nContentsArrow DownOverviewSymptoms and CausesDiagnosis and TestsManagement and\nTreatmentPreventionOutlook / Prognosis\n\nContentsArrow DownOverviewSymptoms and CausesDiagnosis and TestsManagement and\nTreatmentPreventionOutlook / Prognosis\n\n## Overview\n\n### What is incontinence?\n\nUrinary incontinence is a condition that impacts many people’s lives. When you\nhave incontinence, you may experience bladder control issues and leak urine.\nThis leakage is often uncontrollable and can negatively impact your life.\n\nYour urinary system is made up of the kidneys, ureters, bladder and urethra.\nThese parts do several jobs. They filter, store and remove waste from your\nbody. Your kidneys are the filters of your body. Waste products are removed\nfrom your blood by the kidneys, creating urine. The urine then moves down\nthrough two thin tubes called the ureters. The ureters connect to the bladder,\nwhere the urine will collect until it’s time to leave the body. Your bladder\nis like a storage tank — once the bladder is full, the brain sends a signal\nthat it’s time to urinate. Urine then leaves the bladder when a muscle opens\nup (sphincter), allowing the urine to flow freely out of the body through the\nurethra.\n\nWhen this system is working smoothly, you usually have time to get to a\nbathroom before needing to urinate and you don’t experience any leakage of\nurine. Urinary incontinence can happen when these parts don’t operate as they\nshould. This can happen for many different reasons throughout your life.\n\nMany people think that incontinence is a normal part of aging that can’t be\nhelped. While it is true that your risk of incontinence increases as you get\nolder, there are also treatments available to help you manage this condition.\nIncontinence doesn’t have to disrupt your life and keep you from being active.\n\nAdvertisement\n\nCleveland Clinic is a non-profit academic medical center. Advertising on our\nsite helps support our mission. We do not endorse non-Cleveland Clinic\nproducts or services. Policy\n\n### What are the different types of incontinence?\n\nThere are several different types of incontinence. These types have different\ncauses, characteristics and triggers for urine leakage. Knowing the type of\nincontinence is often an important part of the diagnosis and treatment plan\nfor incontinence.\n\nThe types of incontinence include:\n\n  *  **Urge incontinence** : This type of incontinence is characterized by an intense need to urinate right away. Often, this happens too quickly for you to make it to a toilet and you end up leaking urine. Urge incontinence can be caused by a condition called overactive bladder (OAB). You could have OAB for a variety of reasons like having weak pelvic muscles, nerve damage, an infection, low levels of estrogen after menopause or a heavier body weight. Some medications and beverages like alcohol and caffeine can also cause OAB.\n  *  **Stress incontinence** : When you leak urine during activities, this is often stress incontinence. In this type of incontinence, your pelvic floor muscles are weak and no longer support your pelvic organs as they should. This muscle weakness means that you’re more likely to accidently leak urine when you move around. For many people, leakage issues happen when they laugh, cough, sneeze, run, jump or lift things. These actions all place pressure on your bladder. Without the support of strong pelvic muscles, you’re more likely to leak urine. Women who have given birth are at a higher risk of having stress incontinence. Men who have had prostate surgery may develop stress incontinence.\n  *  **Overflow incontinence** : If your bladder doesn’t empty completely each time you urinate, you could have overflow incontinence. Think of the bladder as a juice jug. If you only pour some of the juice out of the jug, but not all of it, there’s still a risk that you could spill when you move around. People with overflow incontinence never completely empty the bladder — placing them at risk for a spill. Usually, this results in small amounts of urine dripping out over time instead of one big gush of urine. This type of incontinence is more common in people with chronic conditions like multiple sclerosis (MS), stroke or diabetes. This may also occur in men with a large prostate.\n  *  **Mixed incontinence** : This type of incontinence is a combination of several problems that all lead to leakage issues. When you have mixed incontinence, you might be dealing with stress incontinence and an overactive bladder. It’s often important to pay attention to what you’re doing when you have leakage issues with this type of incontinence. Identifying what triggers mixed incontinence is usually the best way to manage it.\n\n### Who gets incontinence?\n\nIncontinence can happen to anyone. However, it’s more common in certain groups\nand at certain times in your life. Incontinence is much more common in women\nthan in men. This is often related to pregnancy, childbirth and menopause.\nEach of these experiences can cause a woman’s pelvic support muscles to weaken\nover time.\n\nYou’re also more likely to experience incontinence as you get older. The\nmuscles that support your pelvic organs can become weaker over time, causing\nyou to experience leakage issues.\n\nAdvertisement\n\n### Am I at a higher risk of incontinence at an older age?\n\nYour body constantly changes throughout your life. As you age, the muscles\nthat support your pelvic organs can weaken. This means that your bladder and\nurethra have less support — often leading to urine leakage. Your risk for\ndeveloping incontinence as you age might be higher if you have a chronic\nhealth condition, have given birth to children, went through menopause, have\nan enlarged prostate or have had prostate cancer surgery. It’s important to\ntalk to your healthcare provider over time about the risks of incontinence and\nways you can manage it without interference to your daily life.\n\n### Is incontinence more common in women?\n\nIncontinence is much more commonly seen in women than in men. A large part of\nthis is because of pregnancy, childbirth and menopause. Each of these events\nin a woman’s life can lead to bladder control issues. Pregnancy can be a\nshort-term cause of incontinence and the bladder control issues typically get\nbetter after the baby is born. Some women experience incontinence after\ndelivery because of the strain childbirth takes on the pelvic floor muscles.\nWhen these muscles are weakened, you’re more likely to experience leakage\nissues. Menopause causes your body to go through a lot of change. Your\nhormones (estrogen in particular) change during menopause and this can alter\nyour bladder control.\n\nMen can also experience incontinence, but it isn’t as common as it is in\nwomen.\n\nAdvertisement\n\n## Symptoms and Causes\n\n### What causes incontinence?\n\nThere are many different reasons that you could experience incontinence. These\ncauses can vary depending on if you’re a woman or man. Some causes are\ntemporary health conditions that usually go away once treated. In those cases,\nyour incontinence also usually stops once the condition is treated.\nIncontinence can be caused by long-term (chronic) medical conditions. When you\nexperience leakage issues because of a chronic condition, it’s usually\nsomething you will have to manage over a longer period of time. Even with\ntreatment, chronic conditions usually don’t go away. Incontinence may have to\nbe managed over time as a symptom of your chronic condition.\n\nTemporary or short-term causes of incontinence can include:\n\n  *  **Urinary tract infections (UTIs)**: An infection inside your urinary tract (urethra, ureters, bladder and kidneys) can cause pain and increase your need to pee more often. Once treated, the urge to urinate frequently usually goes away.\n  *  **Pregnancy:** During pregnancy, your uterus places extra pressure on the bladder as it expands. Most women who experience incontinence during pregnancy notice that it goes away in the weeks after delivery.\n  *  **Medications** : Incontinence can be a side effect of certain medications, including diuretics and antidepressants.\n  *  **Beverages** : There are certain drinks — like coffee and alcohol — that can make you need to urinate much more often. If you stop drinking these beverages, your need to urinate frequently typically goes down.\n  *  **Constipation**: Chronic constipation (stool that’s hard and dry) can cause you to have bladder control issues.\n\nChronic or long-term causes of incontinence can include:\n\n  *  **Pelvic floor disorders**: When you have an issue with your pelvic floor muscles, it can impact the way your organs function, including your bladder.\n  *  **Stroke**: A stroke can cause you to experience issues with muscle control. This can include the muscles that regulate your urinary system.\n  *  **Diabetes**: When you have diabetes, your body produces more urine. This increase in the amount of urine can cause leakage issues. In addition, peripheral neuropathy can affect the bladder’s function.\n  *  **Menopause** : Menopause is another time of change in a woman’s body when hormone levels change rapidly and pelvic floor muscles can also become weaker — something that also can happen as you get older.\n  *  **Multiple sclerosis (MS)** : If you have MS, you may experience a loss of control with your bladder, leading to leakage issues.\n  *  **Enlarged prostate** : When the prostate is larger than normal, it can cause several bladder control issues. You might also hear this condition called benign prostatic hyperplasia, or BPH.\n  *  **After prostate cancer surgery** : During prostate cancer surgery the sphincter muscle can sometimes be damaged leading to stress incontinence.\n\n### Why does pregnancy cause incontinence?\n\nDuring pregnancy, your body goes through a lot of physical changes. As your\nuterus stretches to hold the growing baby, a few things happen. Your bladder\ncan be squished by the expanding baby, making your bladder hold less than\nbefore. You might experience an increased urgency to pee during pregnancy\nbecause your bladder cannot hold as much as before. This might become even\nmore challenging towards the end of pregnancy when the baby is at its largest.\n\nAnother reason for incontinence during pregnancy is the weakening of your\npelvic floor muscles. These muscles are the support structures for all of the\norgans in your pelvis. During pregnancy, they can be stretched and weakened as\nyour uterus expands.\n\n### What are the symptoms of incontinence?\n\nThe main symptom of incontinence is a leakage of urine. This could be a\nconstant dripping of urine or an occasional experience of leakage. If you have\nincontinence, you might have large amounts or small amounts of leaked urine.\nYou might experience leakage for a wide variety of reasons — often depending\non the type of incontinence you have.\n\nYou might leak urine when you:\n\n  * Exercise.\n  * Cough.\n  * Laugh.\n  * Sneeze.\n  * Have an urge to urinate, but can’t make it to the toilet on time.\n  * Have to get up in the middle of night to urinate (nocturia).\n\n## Diagnosis and Tests\n\n### How is incontinence diagnosed?\n\nOften, the diagnosis process for incontinence will start with a conversation\nwith your healthcare provider about your medical history and bladder control\nissues. Your provider might ask you questions like:\n\n  * How often do you urinate?\n  * Do you leak urine between trips to the toilet, how often does this happen and how much urine do you leak each time?\n  * How long have you been experiencing incontinence?\n\nThese questions can help your provider figure out a pattern with your leakage,\nwhich often points to a specific type of incontinence. When your provider is\nasking about your medical history, it’s important to list all of your\nmedications because some medications can cause incontinence. Your provider\nwill also ask about any past pregnancies and the details around each delivery.\n\nThere are also several specific tests that your provider might do to diagnose\nincontinence, including:\n\n  *  **Physical exam** : Your healthcare provider will typically do a physical exam early in the diagnosis process. During this exam, your provider will look for any physical reason that could be causing your incontinence. This could include doing a pelvic exam if you’re a woman or checking the size of a man’s prostate.\n  *  **Urine samples** : Your provider may take samples of your urine to test for infections or blood. Testing your urine is also called urinalysis.\n  *  **Anultrasound of your bladder**: An ultrasound is a painless test that uses sound waves to create an image of your internal organs. This imaging test will allow your provider to look at the contents of your bladder and assess the emptying ability of your bladder in a non-invasive way.\n  *  **Stress test** : During this test, your provider will ask you to cough to see if any urine leaks from this action. If you’ve noticed leakage during other activities, like running or jumping, your provider may ask you to repeat those actions to see if you have a leakage issue.\n  *  **Cystoscopy**: A cystoscope is a thin flexible tube with a camera on the end that can be inserted into your urethra and bladder to get a close look at the inside of your urinary tract. This tool allows your provider to see a lot of detail inside your body.\n  *  **Urodynamic testing**: This testing involves several tests that check how much your bladder can hold and how well your urethral sphincter muscle (the muscle that holds your urethra shut) is working. One part of this testing may involve inserting a tube into your bladder that will fill the bladder up with fluid. This checks how much your bladder can actually hold.\n  *  **Pad test** : Your provider may give you a pad to wear, which will catch any leaked urine. At the end of the test, this pad will be checked to see how much urine you lost.\n\nWhile at home, your provider might recommend you keep track of any leakage in\na journal for a few days. By writing down how often you experience\nincontinence issues over the span of a few days, your provider might be able\nto identify a pattern. This can really help in the diagnosis process. Make\nsure to write down how often you need to urinate, how much you are able to go\neach time, if you leak between trips to the bathroom and any activities you\nmight be doing when you leak urine. You’ll then bring this journal with you to\nyour appointment and talk about it with your provider.\n\n### When should I see a doctor about incontinence?\n\nIt’s important to know that incontinence can be treated. Many people believe\nthat it’s something that just goes along with aging and is an unavoidable\nissue. If you find that incontinence is disturbing your daily activities and\ncausing you to miss out on things you typically enjoy, talk to your healthcare\nprovider. There are a wide range of options to treat incontinence.\n\n## Management and Treatment\n\n### How is incontinence treated?\n\nThere are many different factors that your healthcare provider will consider\nwhen creating a treatment plan for your incontinence. The type of incontinence\nand the ways it affects your life are both big considerations. Your provider\nwill also talk to you about the type of treatment you are most comfortable\nwith. There are three main types of treatment you can explore for incontinence\n— medications, lifestyle changes and surgery. Each option has pros and cons\nthat your provider will discuss with you.\n\n **Medications to treat incontinence**\n\nThere are quite a few medications that can reduce leakage. Some of these drugs\nstabilize the muscle contractions that cause problems with an overactive\nbladder. Other medications actually do the opposite thing — relaxing muscles\nto allow your bladder to empty completely. Hormone replacement therapies can —\noften involving replacing estrogen that’s decreased during menopause — may\nalso help restore normal bladder function.\n\nIn many cases, medications can work very well to return normal function to the\nbladder. Your provider will carefully select a medication that matches your\nspecific needs. Often, your provider will start you on a low dose of the\nmedication and then increase it slowly. This is done to try and reduce your\nrisks of side effects and to keep track of how well the medication is working\nto treat your incontinence.\n\nCommon medications that can be used to treat incontinence include:\n\n  * Oxybutynin (Ditropan®), oxybutynin XL (Ditropan XL®), oxybutynin TDDS (Oxytrol®).\n  * Tolterodine (Detrol®).\n  * Solifenacin (Vesicare®).\n  * Fesoterodine (Toviaz®).\n  * Darifenacin (Enablex®).\n  * Trospium (Sanctura XR®).\n  * Antidepressant medication — Imipramine (Norfranil, Tipramine, Trofranil).\n  * Mirabegron (Myrbetriq®).\n\n **Lifestyle changes to manage incontinence**\n\nSometimes, there are changes to your everyday life that can actually help your\nincontinence. These changes often include exercises you can do to strengthen\nyour pelvic floor muscles, changes to your normal habits and an improved diet.\nSome people notice improvements by making these changes at home and don’t need\nadditional treatment.\n\nTalk to your healthcare provider about these home treatment options for\nincontinence before starting any of them. You might not be able to treat all\ntypes of incontinence with these lifestyle changes. Your provider might also\nmake detailed suggestions to you about the best lifestyle changes to try given\nyour incontinence diagnosis.\n\nLifestyle changes to help improve incontinence can include:\n\n  * Emptying your bladder on a regular schedule. This is also called timed voidings — a practice of going to the bathroom on a regular schedule instead of waiting for the urge to go.\n  * Emptying your bladder before physical activities. If you’re planning to exercise or do a physical activity, plan to empty your bladder before the activity starts to avoid leakage.\n  * Avoiding lifting heavy objects. If you need to move something large, grab an additional person to help you.\n  * Doing regular Kegel exercises to help strengthen your pelvic floor muscles.\n  * Avoiding drinking caffeine or a lot of fluids before staring an activity. If you experience frequent urination and leakage at night, you might also want to avoid drinking beverages right before bed.\n  * Wearing pads and products that are designed to catch any leaked urine can also be a useful way to manage incontinence. These products can usually be worn under your clothes without anyone noticing and they provide reassurance that you won’t experience urine leaking through your clothes.\n  * Practicing bladder training to help stretch out the amount of time between each trip to the bathroom. The goal in bladder training is to try and wait a little longer between urinating each time to build up strength.\n  * Maintaining a healthy body weight. Having excess body weight can be one cause of incontinence. By eating a healthy diet and exercising, you can reduce the risk of incontinence.\n\nThere are also devices that you can use at home to help with incontinence. One\nover-the-counter device that you can use is a:\n\n  *  **Vaginal insert:** There are over-the-counter devices that can be placed in the vagina that can compress the urethra and help reduce stress incontinence in women.\n\n **Procedures and surgeries to treat incontinence**\n\nIf other non-invasive treatment options have failed to treat your\nincontinence, there are several procedures that your provider might suggest.\nThese procedures range from simple injections to more complicated surgeries.\nYour provider will discuss the best procedural option for you based on the\ntype of incontinence you have and your symptoms.\n\nProcedures to treat incontinence can include:\n\n  *  **Bulking agents** : This treatment option is an injection that’s typically used in women with stress incontinence. A permanent substance is injected into the lining of your urethra to help increase the size of the urethra’s lining.\n  *  **Botulinum toxin injections (Botox®)**: You might think of Botox® as a cosmetic treatment, but it can also be used to relax muscles in your body. Your provider might inject Botox® into your bladder to help relax the muscles — helping with urge incontinence. This treatment isn’t permanent and will need to be repeated over time.\n  *  **Neuromodulation devices** : Pacemakers that stimulate the nerves to the bladder to improve control can be implanted. Furthermore, a nerve near your ankle can be stimulated to achieve better bladder control.\n  *  **Sling procedures** : There are sling procedures to treat incontinence for both men and women. In women, either a synthetic material or strip of your own tissue is typically used to support the urethral channel.\n  *  **Artificial urethral sphincter** : This is a device that’s used in men with stress incontinence that is placed to close the urethra when not urinating. It’s typically used for leakage after prostate cancer surgery.\n\n### How do I do Kegel exercises?\n\nKegel exercises are a simple way to build strength in your pelvic floor\nmuscles. These exercises are done by lifting, holding and then relaxing your\npelvic floor muscles. You can find these muscles by stopping the flow of urine\nmid-stream while you’re urinating. Only do this until you learn how to find\nthe muscles — stopping the flow of urine mid-stream isn’t healthy over a long\nperiod of time.\n\nWhen you’re doing Kegel exercises, start small. Only hold it for a few second.\nOver time you can slowly work your way up to longer and longer stretches of\nholding the muscles tight.\n\nUnlike other types of workouts, no one can tell when you’re doing Kegel\nexercises. Aim to do several sets of Kegel exercises (a set is made up of 10\nexercises) twice a day.\n\nCare at Cleveland Clinic\n\nBladder Disorders Treatment\n\nFind a Doctor and Specialists\n\nMake an Appointment\n\n## Prevention\n\n### Can incontinence be prevented?\n\nDifferent events throughout your life can lead to many of the things that\ncause incontinence. The muscles that support your pelvic organs can weaken\nover time. For women, these muscles can also be weakened by big life events\nlike pregnancy and childbirth. However, in the same way you work out to build\nstrength in your legs or arms, you can do exercises to strengthen your pelvic\nfloor muscles. Doing exercises to strengthen your pelvic muscles may not\nprevent you from having any issues with incontinence, but it can help you\nregain control of your bladder. Maintaining a healthy body weight can also\nhelp with bladder control. Talk to your healthcare provider about the best\nways to maintain strong pelvic floor muscles throughout your life.\n\n## Outlook / Prognosis\n\n### Will I have incontinence for my entire life?\n\nSometimes incontinence is a short-term issue that will go away once the cause\nends. This is often the case when you have a condition like a urinary tract\ninfection (UTI). Once treated, frequent urination and leakage problems caused\nby a UTI typically end. This is also true for some women who experience\nbladder control issues during pregnancy. For many, the issues end in the weeks\nafter delivery. However, other causes of incontinence are long-term and\nrelated to conditions that are managed throughout your life. If you have a\nchronic condition like diabetes or multiple sclerosis, you may have\nincontinence for a long period of time. In those cases, it’s important to talk\nto your provider about the best ways to manage your incontinence so that it\ndoesn’t interfere with your life.\n\n **A note from Cleveland Clinic**\n\nIt can be embarrassing to talk about bathroom habits with your healthcare\nprovider. This embarrassment shouldn’t stop you from treating incontinence,\nthough. Often, your healthcare provider can help figure out the cause of your\nbladder control issue and help make it better. You don’t need to deal with it\nalone. Talk to your healthcare provider about the best ways to treat\nincontinence so that you can lead a full and active life without worrying\nabout leakage.\n\nMedically Reviewed\n\nLast reviewed by a Cleveland Clinic medical professional on 10/23/2020.\n\nLearn more about our editorial process.\n\n#### References\n\nAdvertisement\n\nCleveland Clinic is a non-profit academic medical center. Advertising on our\nsite helps support our mission. We do not endorse non-Cleveland Clinic\nproducts or services. Policy\n\nCare at Cleveland Clinic\n\nBladder Disorders Treatment\n\nFind a Doctor and Specialists\n\nMake an Appointment\n\nAd\n\nAdvertisementAdvertisement\n\nAdvertisement\n\nUrology 216.444.5600\n\nKidney Medicine 216.444.6771\n\nAppointments & Locations\n\nRequest an Appointment\n\nFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchat\n\n##### Actions\n\nAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive\nto Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual\nSecond OpinionsVirtual Visits\n\n##### Blog, News & Apps\n\nConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChart\n\n##### About Cleveland Clinic\n\n100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice\nof Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity\nCommitmentCareersFor EmployeesResources for Medical Professionals\n\n##### Site Information & Policies\n\nSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint &\nLicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-\nDiscrimination Notice\n\n9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2024 Cleveland\nClinic. All Rights Reserved.\n\n",
    "links": "[{\"link\": \"mailto:?subject=Cleveland Clinic - Urinary Incontinence&body=https://my.clevelandclinic.org/health/diseases/17596-urinary-incontinence\", \"text\": \"\"}]"
}