{
    "summary": "__\n\n  * Home\n  * Illnesses and conditions\n  * Symptoms and self-help\n  * Tests and treatments\n  * Healthy living\n  * Care, support and rights\n  * Scotland’s Service Directory\n\n__\n\n  *   * 0\n\n__\n\n  1. Home\n  2. Healthy living\n  3. Women's health\n  4. Middle years (around 25 to 50 years)\n  5. Pelvic health\n\nHealthy living Women's health Middle years (around 25 to 50 years) Pelvic\nhealth\n\n#  Urinary incontinence in women\n\nUrinary incontinence is when you pee by accident. You may find it can happen\nwhen doing exercise like running, or jumping on a trampoline. If this is\nsomething that happens to you, you are not alone.\n\nAlthough it’s common, it shouldn’t be thought of as normal. There are things\nyou can do to reduce the chance of this happening and improve your symptoms.\n\n## Prevention\n\nYou shouldn’t wait for symptoms to start. There are things you can do that may\nhelp reduce the chance of urinary incontinence in the future.\n\n### Exercising your pelvic floor\n\n### Do\n\n  * strengthen you pelvic floor muscles with simple pelvic floor exercises\n  * stay active\n  * maintain a healthy weight\n  * avoid or cut down on alcohol and caffeinated drinks, such as coffee, tea and some fizzy drinks\n\nHow to exercise your pelvic floor muscles\n\n## Types of urinary incontinence\n\nThe 2 most common types of urinary incontinence are:\n\n  * stress incontinence – when urine leaks out when your bladder is under pressure (when you laugh, cough, sneeze, are heavy lifting or exercising)\n  * urge incontinence – when you feel a sudden and very intense need to pass urine and are unable to stop it\n\nYou may experience both types of incontinence.\n\nCertain things can increase the chances of urinary incontinence developing,\nincluding:\n\n  * pregnancy and vaginal birth\n  * being overweight\n  * a family history of incontinence\n  * getting older – but incontinence isn’t an inevitable part of ageing\n\n## When to speak to your GP practice\n\nUrinary incontinence is a common problem, estimated to affect 1 in 3 people in\ntheir lifetime.\n\n###  Speak to your GP practice if:\n\n  * you have any symptoms of urinary incontinence\n\nYour GP will ask you some questions to understand what may be causing the\nincontinence and how bad it is.\n\nThey may ask you:\n\n  * whether you leak when you cough or laugh or sneeze or exercise\n  * whether you need the toilet a lot both in the day and during the night\n  * whether you have difficulty passing urine when you do go to the toilet\n  * how much fluid like water or juice, alcohol and caffeine you are drinking\n  * about any medications you may be taking\n\n## Diagnosis\n\nYour doctor may firstly look to rule out other things that could be causing\nyour symptoms, such as a urinary tract infection. Depending on your symptoms\nthey may refer you to a specialist, usually a physiotherapist.\n\nYour doctor, nurse or physiotherapist might suggest that you keep a bladder\ndiary.\n\nThey’ll tell you how to keep a bladder diary and the information that they\nwould like you to provide. This will give them more information about it’s\naffecting your day to day life and what your best treatment options might be.\n\nYour doctor may also undertake a pelvic examination. This may involve an\ninternal examination to check your womb (uterus) and pelvis as well as your\ntummy (abdomen). As this is an intimate examination, the doctor may have\nanother person (chaperone) present. You can ask for a female doctor if you\nprefer. If there isn’t a female doctor available, you can ask if there’s\nanother female health professional who can carry out the examination. The\ninternal examination is similar to a smear test and should only take a few\nminutes.\n\nIn some cases of incontinence, your doctor may find that you have a prolapse.\nThey’ll explain this to you at the time. The doctor may also ask you to\nsqueeze during an internal examination so that they can check your pelvic\nfloor muscles.\n\n## Treatment\n\nTreatments which do not involve taking medication or having surgery are\nusually tried first.\n\nPelvic floor muscle training\n\nYour doctor may refer you to a specialist, usually a physiotherapist, to start\na programme of pelvic floor muscle training.\n\nThey’ll assess your pelvic floor muscles and give you a programme of exercises\nthat is specific to your needs. They’ll help you to make sure you understand\nhow to do the exercises correctly.\n\nBladder training\n\nBladder training is used in cases of urge incontinence. Bladder training\ninvolves learning techniques to increase the length of time between feeling\nthe need to go to the toilet and peeing. A course of bladder training will\nusually last for at least 6 weeks, but often takes longer.\n\nLifestyle changes\n\nYour doctor or healthcare professional may suggest that you make some changes\nto your lifestyle. For example:\n\n  * reducing your caffeine intake (caffeine can increase the amount of urine your body produces – it’s found in tea, coffee and some fizzy drinks like cola)\n  * changing how much you drink (drinking too much or too little can make incontinence worse)\n  * maintaining a healthy weight\n\nIncontinence products\n\nIncontinence products (like pads) aren’t a treatment for urinary incontinence.\nHowever, you might find them helpful day-to-day while you are waiting for\nassessment or for a treatment to take effect.\n\nThese products might help you feel more confident during everyday activities\nsuch as socialising or exercising.\n\nIncontinence products t prevent leakage include:\n\n  * absorbent pads or pants\n  * devices that are placed into your vagina or urethra (the tube which carries urine from your bladder out of your body)\n\nIf these types of treatments don’t work for you, your healthcare professional\nmay suggest trying other treatments such as medication or surgery. This will\ndepend on the cause and type of incontinence you are experiencing.\n\nMedication for urge incontinence\n\nIf bladder training isn’t effective in treating your urge incontinence, your\ndoctor may prescribe medication.\n\nThese medications are usually taken orally, but sometimes a patch which you\nplace on your skin is also available. There are different medications\navailable and your doctor will help you to find the one which works best for\nyou.\n\nSurgery\n\nIf other treatments have been unsuitable or unsuccessful in treating your\nincontinence, your doctor may discuss surgery with you.\n\nIt’s ok to ask any questions about your care to help you get the information\nyou might need.\n\n#### Surgery for stress incontinence: urethral bulking agents\n\nA urethral bulking agent is a substance that can be injected into the walls of\nthe urethra. This increases the size of the urethral walls and allows the\nurethra to stay closed, preventing unwanted leakage.\n\nA variety of different bulking agents are available. This a less invasive\ntreatment as it doesn’t usually require any cuts. Instead, the injections are\nusually given through a cystoscope (thin viewing tube) directly into the\nurethra.\n\n#### Surgery for urge incontinence: sacral nerve stimulation\n\nThe sacral nerves are located at the bottom of your back. They carry signals\nfrom your brain to some of the muscles you use when going to the toilet, such\nas the detrusor muscle that surrounds the bladder.\n\nIf your incontinence is the result of your detrusor muscle contracting too\noften, sacral nerve stimulation may be recommended to help stop this from\nhappening.\n\nBotox injections\n\nBotox is not currently licensed to treat urge incontinence so it’s important\nthat you’re fully informed of the risks before proceeding with this treatment.\nBotox can be injected into the sides of your bladder to treat urge\nincontinence. These work by helping you to relax your bladder. The long term\neffects of this treatment are not yet known.\n\n__\n\n__\n\nSource:  Scottish Government \\- Opens in new browser window\n\nLast updated:  \n01 June 2023\n\n  1. Home\n  2. Healthy living\n  3. Women's health\n  4. Middle years (around 25 to 50 years)\n  5. Pelvic health\n\nHow can we improve this page?  __ __\n\n##  Help us improve NHS inform\n\n## Thank You\n\nYour feedback has been received\n\nDon’t include personal information e.g. name, location or any personal health\nconditions.\n\nEmail Address  e.g. you@example.com\n\nMessage  Maximum of 500 characters\n\nSend feedback  __\n\nAdd this page to Info For Me\n\n###  Also on NHS inform\n\n  * Pelvic floor muscles \n  * It's OK to Ask \n  * Urinary tract infection (UTI) \n\n###  Other health sites\n\n  * Pelvic, Obstetric and Gynaecological Physiotherapy: Bladder & Bowel Incontinence\n  * Pelvic, Obstetric and Gynaecological Physiotherapy: Promoting continence with physiotherapy (PDF, 609 KB)\n\n### NHS inform\n\n  * About NHS inform\n  * Editorial policy\n  * Contact us\n\n  * Webchat\n  * Give feedback about NHS inform\n  * Info for Me tool\n\n  * Terms and conditions\n  * Privacy and cookies policy\n  * Freedom of information (FOI)\n\n  * Accessibility\n  * Other languages and formats\n\n© 2023 NHS 24 – v1.1.1.17852\n\n  *   *   * \n\n",
    "links": "[{\"link\": \"https://www.nhsinform.scot/\", \"text\": \"\"}, {\"link\": \"https://www.nhsinform.scot/healthy-living/womens-health/middle-years-around-25-to-50-years/pelvic-health/pelvic-floor-muscles\", \"text\": \"\"}, {\"link\": \"https://www.nhsinform.scot/illnesses-and-conditions/kidneys-bladder-and-prostate/urinary-tract-infection-uti/\", \"text\": \"urinary tract infection\"}, {\"link\": \"https://www.nhsinform.scot/healthy-living/screening/cervical-screening-smear-test/\", \"text\": \"smear test\"}, {\"link\": \"https://www.nhsinform.scot/illnesses-and-conditions/sexual-and-reproductive/pelvic-organ-prolapse/\", \"text\": \"prolapse\"}, {\"link\": \"https://www.nhsinform.scot/healthy-living/food-and-nutrition/\", \"text\": \"healthy weight\"}, {\"link\": \"https://www.nhsinform.scot/campaigns/its-ok-to-ask/\", \"text\": \"It’s ok to ask any questions about your care\"}, {\"link\": \"https://www.nhsinform.scot/translations/\", \"text\": \"Other languages and formats\"}]"
}