{
    "summary": "Skip to Main Content\n\nLooks like you’re visiting UCSF Health on Internet Explorer. For the best\nexperience, try Chrome or Firefox.\n\nWhat can we help you find?\n\nPopular Searches\n\nFind a Doctor Refer a Patient Clinics Conditions Treatments Locations &\nDirections\n\nUniversity of California San Francisco\n\n  * Conditions & Treatments\n\nConditions & Treatments\n\nEPILEPSY BREAKTHROUGH\n\nStopping Seizures Before They Start\n\n    * Find Conditions\n\n    * Find Treatments\n\n    * Clinical Trials\n\n    * Patient Education\n\n    * Medical Tests\n\n  * Doctors\n\nDoctors\n\nMEET OUR DOCTORS\n\nDr. Jasleen Kukreja and the Life-Saving Gift of Breath\n\n    * Find a Doctor\n\n    * Doctor Stories\n\n    * Get a Second Opinion\n\n  * Clinics & Locations\n\nClinics & Locations\n\nBAKAR PRECISION CANCER MEDICINE BUILDING\n\nCare, Convenience and Support at New Cancer Facility\n\n    * Find a Clinic\n\n    * Locations & Directions\n\n    * Partners & Affiliates\n\n    * UCSF Benioff Children's Hospitals\n\n  * Patients & Visitors\n\nPatients & Visitors\n\nKNOW BEFORE YOU GO\n\n10 Ways to Get the Most Out of Your Doctor’s Visit\n\n    * Your Hospital Stay\n\n    * For Visitors\n\n    * International Services\n\n    * For Caregivers\n\n    * Support, Services & Groups\n\n    * Billing & Insurance\n\n    * Pricing Transparency\n\n    * 340B Drug Pricing Program\n\n    * Medical Records\n\n    * Patient Relations\n\n  * Why Choose Us?\n\nWhy Choose Us?\n\nU.S. News Best Hospital Rankings\n\nUCSF Health Ranked Among Nation's Top 10 Hospitals\n\n    * Our Mission\n\n    * Quality of Patient Care\n\n    * Patient Stories\n\n    * Embracing Diversity\n\n    * Our Leadership\n\n  * Refer a Patient\n  * MyChart\n  * Request Appointment\n  * Get a Second Opinion\n  * Call us: (888) 689-8273\n\nUniversity of California San Francisco\n\nObstetrics & Gynecology\n\n# Urge Incontinence in Women\n\n  * Overview\n  * Signs & symptoms\n  * Diagnosis\n  * Treatments\n  * Recommended reading\n  * Guides and forms\n  * Where to get care\n  * Support services\n\n##  Overview\n\nUrge incontinence is characterized by loss of urine that is associated with a\nsudden, strong desire to urinate that cannot be postponed. Other symptoms\ninclude a need to urinate frequently and waking often during the night to\nurinate. The condition is also known as overactive bladder.\n\nSome people manage to avoid urine loss by urinating frequently, but find the\ncontinual need to have a bathroom available restrictive to their lifestyles.\n\nTreatment for urge incontinence may include behavioral treatments such as\npelvic muscle exercises, medication, electrical stimulation or Botox\ninjections.\n\n## Our Approach to Urge Incontinence in Women\n\nIncontinence is not an inevitable part of growing older, and there are a\nvariety of treatments available. A leader in this field, UCSF offers\ninnovative, compassionate care to women with urge incontinence. Our team\nincludes gynecologists, urologists, colorectal surgeons and physical\ntherapists who specialize in pelvic floor rehabilitation. Treatment options\ninclude bladder training, medications and Botox injections, as well as\ntargeted exercises, biofeedback and electrical stimulation to strengthen the\npelvic floor muscles. For problems with the nerves regulating the bladder, we\nalso offer several types of nerve stimulation therapy.\n\nWe believe that empowering women with knowledge is an important part of the\nhealing process, and encourage each patient to participate in choosing the\nbest treatment option for her.\n\n## Awards & recognition\n\n  * Among the top hospitals in the nation\n\n  * One of the nation’s best in obstetrics & gynecology\n\n  * Best in Northern California for urology\n\n## Signs & symptoms\n\nThe main symptom is loss of urine associated with a sudden, strong desire to\nurinate that cannot be postponed. Women may describe mounting pressure or\nsudden loss of urine in a rush to reach the toilet. Often, this occurs with\ncertain triggering events, such as fumbling with the keys to open the front\ndoor, the sound or sensation of running water on the hands, or exposure to\nsudden cold.\n\nOther symptoms include a need to urinate frequently and waking often during\nthe night to urinate.\n\n## Diagnosis\n\nIf you have incontinence, keeping a urinary diary — a record of your daily\nurination, urine accidents and fluid intake — can help us make the proper\ndiagnosis and decide on the appropriate treatment.\n\nAt your first visit to UCSF, your provider will ask questions about your\ngeneral health, your history of incontinence, past surgeries, illnesses and\nmedications you are taking. The provider will also perform a physical\nexamination, including a pelvic exam. In addition, a urine sample will be\ntested. If your problem is complex, additional tests may be done at a later\nvisit.\n\n### Physical Exam Assessment\n\nDepending on the particular details of your medical history, your doctor may\nproceed to any or all of the following physical evaluations.\n\n  * Neurologic examination to evaluate strength, sensation and reflexes in your legs.\n  * Pelvic exam to assess whether you have any pelvic relaxation or pelvic organ prolapse.\n  * Pelvic floor assessment, in which your provider will evaluate the strength of your pelvic floor muscles, particularly your ability to contract and relax the appropriate muscle group.\n  * Postvoid residual urine assessment to measure how much urine remains in your bladder within 15 minutes of voiding. This test offers an estimation of your bladder's ability to efficiently \"empty the tank.\" The same urine sample may be analyzed for other factors, such as blood, sugar, crystals or signs of infection. Such an evaluation can be accomplished with an office urine dipstick or the hospital laboratory's microscopic urinalysis.\n  * Urine culture if a urine dipstick or urinalysis suggests signs of acute infection. The culture is sent to the microbiology lab and, in approximately 24 to 48 hours, bacterial growth can be detected and the specific strain identified.\n  * Cough stress test, in which your bladder is filled with water, and you are asked to cough or strain in the same manner that would cause you to leak urine. This test can be performed in the office or incorporated into more elaborate urodynamics testing.\n  * A urinary diary provides details about your fluid intake and urine output, which can be crucial to making the right diagnosis. Because this is not typically the sort of information we take notice of in our daily lives, your provider will give you a urinary diary and a measuring receptacle.  \n  \nYou may be asked to carefully record the time and amount of any fluids you\ndrink and the urine you void over a complete 24-hour period. You may be asked\nto repeat this 24-hour diary for three to five days. This allows us to notice\npatterns that might be important to planning your treatment.\n\n### Additional Diagnostic Tests\n\nIn some cases, the doctor may decide to pursue further diagnostic testing.\nBelow is a list of some scenarios that are more complex and merit further\ntesting:\n\n  * Uncertain diagnosis for bladder problems\n  * Inability to develop successful treatment plan\n  * Unimproved symptoms or failed treatment\n  * Patient is considering surgery\n  * Failed surgical procedure\n  * Prescence of other conditions, such as hematuria (blood in urine) without infection, recurrent urinary tract infections, elevated postvoid residual urine volume, neurologic condition\n\n#### Urodynamic Studies\n\nThe purpose of these studies is to evaluate the anatomy and function of the\nbladder and urethra, reproducing your symptoms.\n\n  * **Cystometrogram** During this test, catheters are placed in your bladder and vagina or rectum, and your bladder is filled with fluid via the catheter. The test is used to determine your perception of water filling the bladder, any urgency to urinate, uncontrollable bladder contractions, the volume at which your bladder cannot comfortably hold any more, and the pressures within your bladder during the fluid storage process.\n  * **Stress testing** You may be asked to perform a number of maneuvers such as coughing, changing positions, or bouncing on your heel with a catheter in place in an effort to reproduce any symptoms of incontinence.\n  * **Urethral pressure profile** A catheter in your urethra is manipulated to measure urethral function.\n  * **Uroflometry** During urination, a specially devised receptacle will measure the varying rate of urine flow, as well as duration of urination.\n  * **Pressure voiding study** This test identifies abnormal voiding patterns or urine obstruction.\n\n#### Other Tests\n\nIn cystoscopy, a slender camera is inserted via the urethra into the bladder,\nenabling the doctor to view the interior anatomy of your bladder and urethra\nin great detail. It is typically an outpatient procedure performed for the\nfollowing symptoms or situations:\n\n  * Blood or pus in urine with no bacteria present\n  * Bladder infections that are unusually difficult to treat\n  * New onset voiding irritation\n  * New onset bladder pain\n  * Suspected foreign body in the bladder\n  * Urodynamics tests fail to duplicate incontinence symptoms\n\nRadiologic tests identify upper or lower urinary tract structural\nabnormalities:\n\n  * **Intravenous pyelogram (IVP)** This test involves administering intravenous (IV) dye to your bloodstream and taking X-rays of the entire urinary tract while the kidneys are processing the injected dye. This test cannot be performed if you have an allergy to IV contrast dye or abnormal kidney function.\n  * **CT scan** A CT scan of the abdomen and pelvis may be performed, in which an X-ray machine takes a rapid sequence of two-dimensional, thin cross-sections of the body in the area of interest. This exam can be performed with or without contrast dye; mostly, this depends on what your doctor is looking for. The X-rays pictures provide great anatomic detail of most of the internal organs.\n  * **Ultrasound** Unlike the previous two tests, an ultrasound does not involve X-rays. It utilizes a skin probe that directs sound waves to bounce off the body's internal organs, producing an anatomic picture. It can be a very useful screening tool for a number of the above indications.\n\n## Treatments\n\n### Behavioral Treatments\n\nBehavioral treatments are simple, self-directed, have no side effects and are\noften used in conjunction with other treatment options. They have proven\neffective for many women and work well for certain types of incontinence. They\ninclude:\n\n  * **Bladder Training** The goals of bladder training are to increase the intervals between emptying your bladder and the amount of fluid your bladder can hold. This training can help diminish the sense of urgency and leakage.\n  * **Pelvic muscle exercises** Pelvic muscle exercises, also known as Kegels, are an essential part of improving incontinence and preventing it from worsening. They can also help you suppress the urge to urinate. The exercises strengthen and tone the muscles that support the pelvic organs. These muscles contract and relax under your command to control the opening and closing of the bladder. Achieving results requires commitment and regular exercise. Correct technique is also very important.\n  * **Biofeedback** Biofeedback has been proven effective in numerous research studies for the treatment of urinary incontinence. It can help you learn to control and strengthen your pelvic floor muscles, which play an important role in bladder control. Because you cannot see the pelvic floor muscles, you may find it difficult to locate them or to determine if you're doing pelvic muscle exercises correctly. Biofeedback therapy uses computer graphs and audible tones to show you the muscles you are exercising. It also allows the therapist to measure your muscle strength and individualize your exercise program.\n  * **Urge Suppression** Urge suppression is a way to help control the sudden urge to urinate, so that going to the bathroom is not an emergency. Running to the bathroom is the worst thing you can do, as it increases bladder irritability and interferes with your ability to concentrate on controlling your bladder.\n\n### Medications\n\nMedications can help relax the bladder. These medications do not cure urge\nincontinence, but they can be very useful in reducing or eliminating problems\nof bladder control. They can be used alone or in combination with behavioral\ntreatments.\n\nEstrogen replacement therapy taken in pill or skin patch form has not been\nshown to be an effective treatment for female urinary incontinence. Vaginal\nestrogen (creams, vaginal rings or vaginal pellets) have helped reduce\nrecurrent urinary tract infections in postmenopausal women, but their\neffectiveness for incontinence is unknown.\n\n### Electrical Stimulation\n\nPelvic floor electrical stimulation uses low-grade electrical current to\nstimulate weak or inactive pelvic muscles to contract. A tampon-like sensor\nthat connects to a handheld adjustable device is inserted in the vagina. The\npatient then increases the current to the level of a comfortable tingle.\nRegular electrical stimulation sessions can supplement or augment your pelvic\nmuscle exercise regime. Units are available for home use and may be covered by\nmedicare or insurers.\n\n### Percutaneous Tibial Nerve Stimulation (PTNS)\n\nNormal voiding depends not only on the normal function of organs and muscles,\nbut also on nerves that deliver appropriate signals regarding urination. In\nurge incontinence, the nerves regulating the bladder can become hyper-\nreactive, sending strong signals to empty before the bladder is full. Nerve\nstimulation therapies \"jam\" the pathways that transmit these abnormal\nmessages.\n\nIn PTNS, a small acupuncture needle is placed in the ankle along the tibial\nnerve. A handheld device connects to the needle to deliver mild electrical\nimpulses to the nerve. These travel up the tibial nerve to the sacral nerve\nplexus, which regulates the bladder. PTNS sessions are painless, last 30\nminutes and are repeated weekly for 12 weeks. All sessions take place in a\nmedical office.\n\n### Sacral Neuromodulation Therapy (Interstim)\n\nSacral neuromodulation therapy also uses electrical impulses applied directly\nto the sacral nerves. Wires are threaded through openings in the pelvic bones\nalong the sacral nerves. This is done in an operating room using local\nanesthesia. The wires are attached to a small external generator. If a two\nweek test using the external device shows improvement in symptoms, a permanent\ndevice, called Interstim, is implanted under the skin. This procedure requires\ngeneral anesthesia.\n\n### Botox Bladder Injections\n\nBotulinum toxin A, better known as botox, is used to treat patients with urge\nincontinence that does not improve with medications or other conservative\ntherapies. It works by paralyzing bladder muscle, which helps decrease\nunwanted bladder contractions. Maximum relief is usually seen seven days after\ninjection and normally lasts six to 12 months. Repeat injections are often\nneeded.\n\n_UCSF Health medical specialists have reviewed this information. It is for\neducational purposes only and is not intended to replace the advice of your\ndoctor or other health care provider. We encourage you to discuss any\nquestions or concerns you may have with your provider._\n\n##  Recommended reading\n\nBiofeedback for Incontinence\n\nBiofeedback takes information about something happening in the body and\npresents it in a way that you can see or hear and understand. Learn more here.\n\nBladder Training\n\nBladder training is an important form of behavior therapy that can be\neffective in treating urinary incontinence. Learn more here.\n\nFAQ: Incontinence\n\nUrinary incontinence is the involuntary loss of large or small amounts of\nurine, and it is thought to affect 13 million Americans. Learn more here.\n\nPelvic Muscle Exercises\n\nPelvic muscle exercises, also known as kegels, are an essential part of\nimproving incontinence and preventing it from worsening. Learn more.\n\nPessaries\n\nThe pessary is a device (firm ring) that is placed into the vagina to support\nthe uterus or bladder and rectum. Learn more here.\n\n## Guides and forms\n\n  * Urinary Diary\n\n##  Where to get care (2)\n\n##  Related conditions\n\n  * Mixed incontinence in women \n\n##  Support services\n\nPatient Resource\n\nCase Management & Social Work\n\nConnect with a team that can help you find resources, solve problems and\nadvocate for you during treatment at UCSF.\n\nClass\n\nMindfulness-Based Stress Reduction Class\n\nThis eight-week class teaches mindfulness practices that can reduce stress and\nimprove your overall health, such as meditation and body awareness.\n\nPatient Resource\n\nPatient Relations\n\nWe welcome feedback about your experience at UCSF Health. Find out how to\ncontact us with comments, questions or concerns.\n\nPatient Resource\n\nSpiritual Care Services\n\nChaplains representing many faiths are available around the clock to provide\nsupport, comfort and counsel to patients, families and caregivers.\n\nPatient Resource\n\nWomen's Health Resource Center\n\nAccess free health resources here, from classes and webinars to support groups\nand medical referrals, plus pregnancy, birth and breastfeeding services.\n\nDid you know?\n\n## Cutting-edge techniques for mapping the human brain – developed by UCSF\nneurologists – help us locate language, motor and sensory functions and make\nsurgery safer, more precise and less invasive. Brain mapping may one day lead\nto therapies for restoring healthy brain circuitry in patients with epilepsy,\ndepression, stroke and other conditions.\n\nFollow UCSF Health:\n\n  *   *   *   *   * \n\nGetting Care\n\n  * Find a Doctor\n  * Emergency Care\n  * Primary Care\n  * All Medical Services\n  * International Services\n  * Price Transparency\n\nGetting Involved\n\n  * Donate\n  * Volunteer\n  * Join Our Team\n\nAbout Us\n\n  * Locations & Directions\n  * Contact Us\n  * Contact Patient Relations\n  * Media Resources\n  * Accessibility Resources\n  * Report Misconduct\n  * Website Privacy Policy\n  * Quality of Patient Care\n  * Crisis Standards of Care\n  * Our Organization\n  * UCSF News\n  * Notice of Privacy Practices\n\nResearch and Education\n\n  * Clinical Trials\n  * UC San Francisco\n  * UCSF School of Medicine\n  * UCSF School of Nursing\n  * UCSF School of Pharmacy\n\nReferring Physicians\n\n  * Refer a Patient\n  * Transfer a Patient\n  * MDLink\n  * Request a Consultation\n  * Physician Channel\n\nFollow UCSF Health:\n\n  *   *   *   *   * \n\n© 2002 - 2024. The Regents of The University of California.\n\n  * Privacy Policy\n  * Terms and Conditions\n  * Some stock photos, posed by model.\n\n#### Share\n\n  * Share on Facebook\n  * Share on Twitter\n  * Email Link\n  * Copy Link \n\n",
    "links": "[{\"link\": \"https://www.ucsfhealth.org/\", \"text\": \"\"}, {\"link\": \"https://www.ucsfhealth.org/treatments/responsive-neurostimulation\", \"text\": \"\"}, {\"link\": \"https://www.ucsfhealth.org/conditions\", \"text\": \"Find Conditions\"}, {\"link\": \"https://www.ucsfhealth.org/treatments\", \"text\": \"Find Treatments\"}, {\"link\": \"https://www.ucsfhealth.org/education\", \"text\": \"Patient Education\"}, {\"link\": \"https://www.ucsfhealth.org/medical-tests\", \"text\": \"Medical Tests\"}, {\"link\": \"https://www.ucsfhealth.org/doctor-stories/jasleen-kukreja\", \"text\": \"\"}, {\"link\": \"https://www.ucsfhealth.org/find-a-doctor\", \"text\": \"Find a Doctor\"}, {\"link\": \"https://www.ucsfhealth.org/doctor-stories\", \"text\": \"Doctor Stories\"}, {\"link\": \"https://www.ucsfhealth.org/second-opinion\", \"text\": \"Get a Second Opinion\"}, {\"link\": \"https://www.ucsfhealth.org/lp/precision-cancer-medicine-building\", \"text\": \"\"}, {\"link\": \"https://www.ucsfhealth.org/clinics\", \"text\": \"Find a Clinic\"}, {\"link\": \"https://www.ucsfhealth.org/locations\", \"text\": \"Locations & Directions\"}, {\"link\": \"https://www.ucsfhealth.org/about/our-affiliates\", \"text\": \"Partners & Affiliates\"}, {\"link\": \"https://www.ucsfhealth.org/your-hospital-stay/10-ways-to-get-the-most-out-of-your-ucsf-doctor-appointment\", \"text\": \"\"}, {\"link\": \"https://www.ucsfhealth.org/your-hospital-stay\", \"text\": \"Your Hospital Stay\"}, {\"link\": \"https://www.ucsfhealth.org/for-visitors\", \"text\": \"For Visitors\"}, {\"link\": \"https://www.ucsfhealth.org/services/international-services\", \"text\": \"International Services\"}, {\"link\": \"https://www.ucsfhealth.org/education/self-care-for-caregivers\", \"text\": \"For Caregivers\"}, {\"link\": \"https://www.ucsfhealth.org/services\", \"text\": \"Support, Services & Groups\"}, {\"link\": \"https://www.ucsfhealth.org/billing-and-insurance\", \"text\": \"Billing & Insurance\"}, {\"link\": \"https://www.ucsfhealth.org/about/pricing-transparency\", \"text\": \"Pricing Transparency\"}, {\"link\": \"https://www.ucsfhealth.org/about/our-340b-story\", \"text\": \"340B Drug Pricing Program\"}, {\"link\": \"https://www.ucsfhealth.org/medical-records\", \"text\": \"Medical Records\"}, {\"link\": \"https://www.ucsfhealth.org/services/patient-relations\", \"text\": \"Patient Relations\"}, {\"link\": \"https://www.ucsfhealth.org/about/our-mission\", \"text\": \"Our Mission\"}, {\"link\": \"https://www.ucsfhealth.org/about/quality-of-patient-care\", \"text\": \"Quality of Patient Care\"}, {\"link\": \"https://www.ucsfhealth.org/patient-stories\", \"text\": \"Patient Stories\"}, {\"link\": \"https://www.ucsfhealth.org/about/diversity-at-ucsf-health\", \"text\": \"Embracing Diversity\"}, {\"link\": \"https://www.ucsfhealth.org/about/our-leadership\", \"text\": \"Our Leadership\"}, {\"link\": \"https://www.ucsfhealth.org/refer-a-patient\", \"text\": \"Refer a Patient\"}, {\"link\": \"https://www.ucsfhealth.org/mychart\", \"text\": \"MyChart\"}, {\"link\": \"https://www.ucsfhealth.org/request-an-appointment\", \"text\": \"Request Appointment\"}, {\"link\": \"https://www.ucsfhealth.org/second-opinion\", \"text\": \"Get a Second Opinion\"}, {\"link\": \"https://www.ucsfhealth.org/list-of-clinics/obstetrics-and-gynecology\", \"text\": \"Obstetrics & Gynecology\"}, {\"link\": \"https://www.ucsfhealth.org/conditions/urge-incontinence-in-women#Overview\", \"text\": \"Overview\"}, {\"link\": \"https://www.ucsfhealth.org/conditions/urge-incontinence-in-women#Signs_%26_symptoms\", \"text\": \"Signs & symptoms\"}, {\"link\": \"https://www.ucsfhealth.org/conditions/urge-incontinence-in-women#Diagnosis\", \"text\": \"Diagnosis\"}, {\"link\": \"https://www.ucsfhealth.org/conditions/urge-incontinence-in-women#Treatments\", \"text\": \"Treatments\"}, {\"link\": \"https://www.ucsfhealth.org/conditions/urge-incontinence-in-women#Recommended_reading\", \"text\": \"Recommended reading\"}, {\"link\": \"https://www.ucsfhealth.org/conditions/urge-incontinence-in-women#Guides_and_forms\", \"text\": \"Guides and forms\"}, {\"link\": \"https://www.ucsfhealth.org/conditions/urge-incontinence-in-women#Where_to_get_care\", \"text\": \"Where to get care\"}, {\"link\": \"https://www.ucsfhealth.org/conditions/urge-incontinence-in-women#Support_services\", \"text\": \"Support services\"}, {\"link\": \"https://www.ucsfhealth.org/-/media/project/ucsf/ucsf-health/pdf/urinary_diary.pdf\", \"text\": \"urinary diary\"}, {\"link\": \"https://www.ucsfhealth.org/conditions/pelvic-organ-prolapse\", \"text\": \"pelvic organ prolapse\"}, {\"link\": \"https://www.ucsfhealth.org/-/media/project/ucsf/ucsf-health/pdf/urinary_diary.pdf\", \"text\": \"urinary diary\"}, {\"link\": \"https://www.ucsfhealth.org/conditions/urinary-tract-infections\", \"text\": \"urinary tract infections\"}, {\"link\": \"https://www.ucsfhealth.org/medical-tests/cystometric-study\", \"text\": \"test\"}, {\"link\": \"https://www.ucsfhealth.org/medical-tests/uroflowmetry\", \"text\": \"a specially devised receptacle\"}, {\"link\": \"https://www.ucsfhealth.org/medical-tests/cystoscopy\", \"text\": \"cystoscopy\"}, {\"link\": \"https://www.ucsfhealth.org/medical-tests/intravenous-pyelogram\", \"text\": \"test\"}, {\"link\": \"https://www.ucsfhealth.org/medical-tests/ct-scan\", \"text\": \"CT scan\"}, {\"link\": \"https://www.ucsfhealth.org/medical-tests/ultrasound\", \"text\": \"ultrasound\"}, {\"link\": \"https://www.ucsfhealth.org/education/bladder-training\", \"text\": \"bladder training\"}, {\"link\": \"https://www.ucsfhealth.org/education/pelvic-muscle-exercises\", \"text\": \"Kegels\"}, {\"link\": \"https://www.ucsfhealth.org/education/biofeedback-for-incontinence\", \"text\": \"Biofeedback\"}, {\"link\": \"https://www.ucsfhealth.org/conditions/urinary-tract-infections\", \"text\": \"urinary tract infections\"}, {\"link\": \"https://www.ucsfhealth.org/education/biofeedback-for-incontinence\", \"text\": \"\"}, {\"link\": \"https://www.ucsfhealth.org/education/bladder-training\", \"text\": \"\"}, {\"link\": \"https://www.ucsfhealth.org/education/faq-incontinence\", \"text\": \"\"}, {\"link\": \"https://www.ucsfhealth.org/education/pelvic-muscle-exercises\", \"text\": \"\"}, {\"link\": \"https://www.ucsfhealth.org/education/pessaries\", \"text\": \"\"}, {\"link\": \"https://www.ucsfhealth.org/-/media/project/ucsf/ucsf-health/pdf/urinary_diary.pdf\", \"text\": \"Urinary Diary\"}, {\"link\": \"https://www.ucsfhealth.org/conditions/mixed-incontinence-in-women\", \"text\": \"\\nMixed incontinence in women\\n\"}, {\"link\": \"https://www.ucsfhealth.org/services/case-management-and-social-work\", \"text\": \"\"}, {\"link\": \"https://www.ucsfhealth.org/services/mindfulness-based-stress-reduction-class\", \"text\": \"\"}, {\"link\": \"https://www.ucsfhealth.org/services/patient-relations\", \"text\": \"\"}, {\"link\": \"https://www.ucsfhealth.org/services/spiritual-care-services\", \"text\": \"\"}, {\"link\": \"https://www.ucsfhealth.org/services/womens-health-resource-center\", \"text\": \"\"}, {\"link\": \"https://www.ucsfhealth.org/find-a-doctor\", \"text\": \"Find a Doctor\"}, {\"link\": \"https://www.ucsfhealth.org/clinics/emergency-department\", \"text\": \"Emergency Care\"}, {\"link\": \"https://www.ucsfhealth.org/list-of-clinics/primary-care\", \"text\": \"Primary Care\"}, {\"link\": \"https://www.ucsfhealth.org/clinics\", \"text\": \"All Medical Services\"}, {\"link\": \"https://www.ucsfhealth.org/services/international-services\", \"text\": \"International Services\"}, {\"link\": \"https://www.ucsfhealth.org/about/pricing-transparency\", \"text\": \"Price Transparency\"}, {\"link\": \"https://www.ucsfhealth.org/about/career-information\", \"text\": \"Join Our Team\"}, {\"link\": \"https://www.ucsfhealth.org/locations\", \"text\": \"Locations & Directions\"}, {\"link\": \"https://www.ucsfhealth.org/contact-us\", \"text\": \"Contact Us\"}, {\"link\": \"https://www.ucsfhealth.org/services/patient-relations\", \"text\": \"Contact Patient Relations\"}, {\"link\": \"https://www.ucsfhealth.org/services/accessibility-resources\", \"text\": \"Accessibility Resources\"}, {\"link\": \"https://www.ucsfhealth.org/about/sexual-harassment-reporting-and-nondiscrimination-notice\", \"text\": \"Report Misconduct\"}, {\"link\": \"https://www.ucsfhealth.org/website-privacy-policy\", \"text\": \"Website Privacy Policy\"}, {\"link\": \"https://www.ucsfhealth.org/about/quality-of-patient-care\", \"text\": \"Quality of Patient Care\"}, {\"link\": \"https://www.ucsfhealth.org/-/media/project/ucsf/ucsf-health/pdf/crisis-standards-of-care.pdf\", \"text\": \"Crisis Standards of Care\"}, {\"link\": \"https://www.ucsfhealth.org/about\", \"text\": \"Our Organization\"}, {\"link\": \"https://www.ucsfhealth.org/-/media/project/ucsf/ucsf-health/pdf/ucsfhipaa-072021.pdf\", \"text\": \"Notice of Privacy Practices\"}, {\"link\": \"https://www.ucsfhealth.org/refer-a-patient\", \"text\": \"Refer a Patient\"}, {\"link\": \"https://www.ucsfhealth.org/for-health-professionals/transfer-a-patient\", \"text\": \"Transfer a Patient\"}, {\"link\": \"https://www.ucsfhealth.org/mdlink\", \"text\": \"MDLink\"}, {\"link\": \"https://www.ucsfhealth.org/for-health-professionals/request-a-consultation\", \"text\": \"Request a Consultation\"}, {\"link\": \"https://www.ucsfhealth.org/website-privacy-policy\", \"text\": \"Privacy Policy\"}, {\"link\": \"https://www.ucsfhealth.org/about/terms-of-use\", \"text\": \"Terms and Conditions\"}]"
}