{
    "summary": "### Cookie Policy\n\nWe use cookies to give you the best possible user experience. By continuing to\nuse the site, you agree to the use of cookies. _Privacy Policy_ _Cookie\nPreferences_\n\nPrivacy Policy Cookie Preferences Accept Cookies\n\nError was Detected\n\nYour browser doesn't support JavaScript code, or you have disabled JavaScript.\n\nJump to content\n\n  * Set Your Location\n  * Sign in or Enroll\n\n__Set Your Location Set Your Location\n\n  * Find a Doctor\n  * Find a Location\n  * Donate Now\n  * Patient Login\n\n    * Sign In to My Health Online\n    * Enroll in My Health Online\n    * Learn About My Health Online\n\n  * Enter a search term:\n\n __ __\n\n  *     * Enter City or ZipGeolocateMake this my locationOpen  Choose a medical group or hospital \n    * Clear my location\n\n##### Change Location\n\nX\n\nSutter Health\n\n  * BOOK APPOINTMENT\n  *   *   * MENUOpen Menu\n\n##### Book Appointment\n\n###### Walk-In Care\n\nIn-person care for minor illnesses.\n\n###### Urgent Care\n\nIn-person care for moderate illnesses and injuries.\n\n###### Video Visits\n\nVirtual care with a Walk-In Care clinician.\n\n###### Primary Care\n\nOngoing care and wellness for everyone.\n\n###### COVID-19\n\nResources for vaccination and boosters.\n\n##### Patient Login\n\n  * Sign In to My Health Online\n  * Enroll in My Health Online\n  * Learn About My Health Online\n\n  * Patients and Visitors\n\n#### Patients and Visitors\n\nGet personalized, coordinated care across Northern California through the\nSutter network.\n\nView Patient Resources\n\n##### My Health Online\n\nMake appointments, message your doctor and more through our patient portal.\n\nEnroll Now\n\n    * Find a Doctor \n    * Find a Location \n    * View All Services \n    * Request Records \n    * Pay a Bill \n    * Check Symptoms \n\n##### Patient Resources\n\n    * Contact Us\n    * Patient and Visitor Information\n    * My Health Online Patient Portal\n    * Classes and Events\n    * Doctor Referrals\n    * Health and Wellness\n    * COVID-19 Vaccine Resources\n\n##### Billing and Insurance\n\n    * Pay a Bill\n    * Accepted Health Plans\n    * Cost Estimates/Charges\n    * Medicare Advantage\n    * Sutter Health Plus\n\n  * Treatments and Services\n\n#### Treatments and Services\n\nAccess award-winning, comprehensive primary and specialty care for your whole\nfamily.\n\nView All Services\n\n##### Schedule a Visit\n\nConvenient care options for your everyday health needs.\n\nBook Appointment\n\n##### Get Care\n\n    * Primary Care \n    * Video Visits \n    * Walk-In Care \n    * Urgent Care \n    * Emergency Care \n\n##### Featured Services\n\n    * Mental Health \n    * Pregnancy and Childbirth \n    * Imaging\n    * Pediatrics\n    * Orthopedics\n    * Cancer\n    * Heart and Vascular\n\n#####  \n\n    * Dermatology\n    * Physical Therapy\n    * Ear, Nose, and Throat (ENT)\n    * Labs\n    * Urology\n    * Neuroscience\n    * Women's Health (OB/GYN)\n    * View All Services\n\n  * Research and Education\n\n#### Research and Education\n\nOur contributions to medical research and education lead to better healthcare\noutcomes.\n\nResearch at Sutter\n\n##### Graduate Medical Education\n\nJoin our robust training programs led by nationally known healthcare leaders.\n\nExplore Opportunities\n\n##### Research\n\n    * Clinical Trials \n    * Research Studies \n    * Publications \n    * Investigators \n\n##### Education\n\n    * Residencies and Fellowships \n    * Continuing Medical Education \n\n  * About Sutter\n\n#### About Us\n\nExplore the ways we provide innovative, compassionate care through our\nnetwork.\n\nLearn About Sutter Health\n\n##### Work at Sutter Health\n\nShape the future of healthcare and build your career within our diverse teams.\n\nFind Jobs\n\n##### About Sutter Health\n\n    * About Us\n    * Diversity and Inclusion\n    * Awards and Honors\n    * Leadership\n    * Annual Report\n    * News and Media\n    * Patient Stories\n    * Business Programs\n\n##### Community\n\n    * Giving\n    * Volunteer With Us\n    * Community Benefit\n\n##### Careers\n\n    * Jobs at Sutter\n    * Physician Opportunities\n    * Residencies and Fellowships\n\n  * BOOK APPOINTMENT\n\n  * Patients and Visitors\n  * Treatments and Services\n  * Research and Education\n  * About Sutter\n\nFind a DoctorFind a LocationContact UsDonate Now\n\nBOOK APPOINTMENT\n\n  * My Health Online Patient Login \n  * Set My Location\n\nSearch\n\n __\n\n  * Find a Doctor \n  * Find a Location \n  * View All Services \n  * Request Records \n  * Pay a Bill \n  * Check Symptoms \n\n##### Patient Resources\n\n  * Contact Us\n  * Patient and Visitor Information\n  * My Health Online Patient Portal\n  * Classes and Events\n  * Doctor Referrals\n  * Health and Wellness\n  * COVID-19 Vaccine Resources\n\n##### Billing and Insurance\n\n  * Pay a Bill\n  * Accepted Health Plans\n  * Cost Estimates/Charges\n  * Medicare Advantage\n  * Sutter Health Plus\n\n#### Patients and Visitors\n\nGet personalized, coordinated care across Northern California through the\nSutter network.\n\nView Patient Resources\n\n##### My Health Online\n\nMake appointments, message your doctor and more through our patient portal.\n\nEnroll Now\n\n##### My Health Online\n\nMake appointments, message your doctor and more through our patient portal.\n\nEnroll Now\n\n##### Get Care\n\n  * Primary Care \n  * Video Visits \n  * Walk-In Care \n  * Urgent Care \n  * Emergency Care \n\n##### Featured Services\n\n  * Mental Health\n  * Pregnancy and Childbirth\n  * Imaging\n  * Pediatrics\n  * Orthopedics\n  * Cancer\n  * Heart and Vascular\n  * Dermatology\n  * Physical Therapy\n  * Ear, Nose, and Throat (ENT)\n  * Labs\n  * Urology\n  * Neuroscience\n  * Women's Health (OB/GYN)\n\n#### Treatments and Services\n\nAccess award-winning, comprehensive primary and specialty care for your whole\nfamily.\n\nView All Services\n\n##### Schedule a Visit\n\nConvenient care options for your everyday health needs.\n\nBook Appointment\n\n##### Research\n\n  * Clinical Trials \n  * Research Studies \n  * Publications \n  * Investigators \n\n##### Education\n\n  * Residencies and Fellowships\n  * Continuing Medical Education\n\n#### Research and Education\n\nOur contributions to medical research and education lead to better healthcare\noutcomes.\n\nResearch at Sutter\n\n##### Graduate Medical Education\n\nJoin our robust training programs led by nationally known healthcare leaders.\n\nExplore Opportunities\n\n##### Graduate Medical Education\n\nJoin our robust training programs led by nationally known healthcare leaders.\n\nExplore Opportunities\n\n##### About Sutter Health\n\n  * About Us \n  * Diversity and Inclusion\n  * Awards and Honors\n  * Leadership\n  * Annual Report\n  * News and Media\n  * Patient Stories\n  * Business Programs\n\n##### Community\n\n  * Giving\n  * Volunteer With Us\n  * Community Benefit\n\n##### Careers\n\n  * Jobs at Sutter \n  * Physician Opportunities\n  * Residencies and Fellowships\n\n#### About Us\n\nExplore the ways we provide innovative, compassionate care through our\nnetwork.\n\nLearn About Sutter Health\n\n##### Work at Sutter Health\n\nShape the future of healthcare and build your career within our diverse teams.\n\nFind Jobs\n\n##### Work at Sutter Health\n\nShape the future of healthcare and build your career within our diverse teams.\n\nFind Jobs\n\nSearch\n\n __\n\n  * Home\n  * Health and Wellness\n  * Women's Health\n  * Help for Women with Urinary Incontinence\n\nContent\n\n# Help for Women with Urinary Incontinence\n\nMany women lose bladder control with age or pregnancies, yet few seek help.\nLearn which treatment options may work for you.\n\nContributor\n\n### Savitha Krishnan, M.D.\n\nPalo Alto Medical Foundation\n\nIf you’re one of the estimated 17 million American women who suffer from\nurinary incontinence, feelings of shame, embarrassment and isolation may\ncompel you to suffer in silence. However, a growing number of treatments and\ntherapies can help improve your symptoms and restore your quality of life –\neven if you’ve previously had an unsuccessful procedure. According to the\nAmerican Urogynecologic Society, 80 to 90 percent of women who seek treatment\nfor urinary incontinence experience significant improvement.\n\n“Many patients ask me if urinary incontinence is a normal part of aging,” says\nSavitha Krishnan, M.D., a urogynecologist with the Palo Alto Medical\nFoundation. “And it does become more common as women age. But now the\ninterventions are less invasive and the success rate higher than ever before,\nso it’s worthwhile to explore solutions with your doctor no matter what your\nprior experience or your age.”\n\n\n\n## Understanding Incontinence\n\nIncontinence not caused by illness or injury typically falls into three\ncategories: stress, urge and mixed. Determining which type you have is the\nfirst step in determining the right treatment.\n\n  * Stress urinary incontinence involves the involuntary or accidental loss of urine during activities that increase internal abdominal pressure, such as coughing, sneezing, laughing, exercise or lifting. Stress urinary incontinence is usually related to weakened pelvic floor muscles, the muscular hammock that sits between the pubic bone and the tail bone and functions to support the pelvic organs (bladder, uterus, rectum), as well as increase sexual pleasure and stabilize the body’s core. In younger women, the main cause of stress urinary incontinence is vaginal childbirth. Certain surgeries and anatomic abnormalities can also play a part, as well as normal deterioration of the muscles as women age. Approximately 60 to 70 percent of women of all ages have stress urinary incontinence.\n  * Urge incontinence is a sudden, strong feeling of needing to urinate caused by overactive and uncontrolled contractions of the bladder. This urge is often accompanied by the involuntary leaking of urine, ranging from a small amount to the complete emptying of the bladder. A number of situations can serve as triggers: the sound of running water; actions such as putting the key in the door or walking by a bathroom; or consumption of certain foods and beverages such caffeinated drinks or citrus juices. The prevalence of urge incontinence increases with age and the loss of estrogen, affecting approximately 15 percent of women in their 50s, and increasing to about 50 percent of women in their 70s and 80s, according to Dr. Krishnan.\n  * If you have symptoms of both stress and urge urinary incontinence, you have mixed urinary incontinence.\n\n## Preventing Incontinence\n\nAlthough there is no magic formula to prevent incontinence – especially since\nthe causes range from genetics to natural aging to childbirth – there are a\nfew things you can do to reduce your chances of developing the problem, or to\nlimit symptoms.\n\n  * **Pelvic exercises** – A large study of Japanese women has shown that younger women who do pelvic floor exercises (Kegel exercises) after vaginal childbirth (and continuing) have more success preventing stress incontinence, Dr. Krishnan says. Older women may also benefit from pelvic exercises, since they strengthen and retrain the nerves and muscles of the pelvic floor that control the bladder.   \n  \nThe American Urogynecologic Society recommends 4 to 8 sets of 10 Kegel\nsqueezes spread throughout the day.  \n  \n“The key is to do these correctly and to continue the exercises. Studies show\nthat 60 percent of women do not do their Kegel exercises correctly. Women who\nvisit a pelvic floor physical therapist to learn correct technique do much\nbetter,” Dr. Krishnan says. Ask your doctor to refer you to someone with the\nright expertise.\n\n  * **Hormone therapy** – For women entering menopause, vaginal estrogen treatments applied locally with an applicator through a vaginal pill or cream can relieve symptoms of urge urinary incontinence.\n  * **Healthy living** – Some lifestyle changes can also help your bladder and bowel to work more effectively. First, eat a fiber-rich diet to prevent constipation, which can weaken and stretch pelvic floor muscles, nerves and tissues. Keep weight in check through exercise and a healthy diet, since extra weight increases both risk and severity of incontinence. And don’t smoke, since smoking – and especially related coughing – adds to your risk.\n\nYou can also avoid caffeine and reduce liquid intake strategically to reduce\nthe episodes of urgency.\n\n## Getting the Right Diagnosis\n\nIf you’re experiencing urinary incontinence, don’t hesitate to visit your\ndoctor and explain your symptoms. Many types of doctors can diagnose urinary\nincontinence, including a primary care physician, OB/GYN or urologist.\nUrogynecologists have special training and expertise in women’s incontinence\nissues.\n\nYour doctor will take a detailed medical history and conduct a physical exam.\nThis includes a detailed pelvic exam to assess the organs and muscles. Your\ndoctor will also look for signs of underlying medical conditions that may be\ncausing incontinence and perform any necessary diagnostic tests. You may be\nasked to keep a bladder diary to keep track of when you urinate and when you\nexperience leakage. After the doctor has examined all the data, he or she will\nmake a diagnosis and discuss potential treatments.\n\n## Choosing the Best Treatment\n\nTreatment options have expanded rapidly over the last few years, making\nsolutions much more feasible for women of all ages. These include:\n\n**For both stress and urge incontinence:**\n\n  * **Physical therapy** – Considered an effective and non-invasive treatment, physical therapy that includes techniques such as pelvic floor muscle exercise (Kegels), bladder retraining and biofeedback can reduce or eliminate both stress and urge urinary incontinence in most women. You’ll want to find a physical therapist specially trained in the area of incontinence; ask your doctor for a referral. The physical therapist will create a treatment plan designed to meet your needs.\n\n**For urge incontinence:**\n\n  * **Medications** – A number of drugs have proven successful in addressing urge incontinence by blocking signals that cause the bladder to contract too frequently or by helping the bladder to relax. Unfortunately, most of these have side effects including drowsiness, constipation and dry eyes. “We now have a newer medication, called Myrbetriq® or Mirabegron, that has fewer side effects. But it’s not covered by all insurances,” Dr. Krishnan says. Talk to your doctor to determine which drug will work for you.\n  * **Botox** – The same medication long used by plastic surgeons can be used to treat urge incontinence. In a 10-minute procedure, a specially-trained doctor will inject Botox into the back wall of the bladder. The Botox relaxes the bladder and decreases sensitivity to nerve fibers, which helps the bladder to contract more normally.  Dr. Krishnan says a small percentage of patients have difficulty emptying their bladder for a short time after surgery, but this resolves on its own. “Most patients do really well,” she says. “But you do have to return to your doctor every three to six months to repeat the procedure.”\n  * **Percutaneous tibial nerve stimulation** – Similar to acupuncture, this therapy for urge incontinence uses a small, needle electrode inserted near the ankle to send impulses to the nerves of the pelvis that control bladder function. “This therapy has been shown to be equal to medication in treating urge incontinence without the side effects,” Dr. Krishnan says. “But it does involve a time commitment: 12 weeks of therapy each week for 30 minutes, and then once a month to maintain results. The good news is, Medicare does cover it and many urology and urogynecology departments now offer it.”\n  * **Sacral neuromodulation** – This therapy involves implanting a system that sends electrical pulses directly to the third sacral nerve root to help improve bladder control in people with urge incontinence. If you and your doctor agree to this approach, the doctor will first test the effectiveness by implanting through the back a lead, which is attached to an external monitor. You can determine after seven to 10 days whether the therapy works, after which a long-term device will be implanted. “Women with severe urge incontinence who don’t respond to medicines are good candidates for this treatment. Sacral neuromodulation also has the advantage of addressing fecal incontinence, which is a problem for about a third of women who have urinary urge incontinence,” Dr. Krishnan says.\n\n**For stress urinary incontinence:**\n\n  * **Vaginal devices** – Some devices, inserted vaginally, can help improve stress urinary incontinence without the risks of surgery. A pessary is a silicone ring inserted into the vagina by your doctor, similar to a vaginal contraceptive diaphragm. The pessary helps support the urethra to prevent leakage. It can remain in place long-term but needs monitoring by the doctor to avoid problems with vaginal abrasions.  \n  \nAnother device, called Impressa®, can be inserted by a woman like a tampon to\nlift and give support to the urethra. It can reduce or prevent urine leaks for\nup to eight hours.\n\n  * **Urethral bulking** – This procedure for stress incontinence involves an injection of material around the urethra to help thicken its walls. It can be done in the doctor’s office or an ambulatory surgery center using local anesthesia. The procedure may need to be repeated every two to three years as the body absorbs the material. “Only 40 percent of women are dry after this procedure, but 70 to 80 percent are improved,” Dr. Krishnan says. “It’s a good option for women who can’t undergo a more invasive surgery. I think my oldest patient was 95 years old.”\n  * **Surgery** – Thanks to improved methods and higher success rates, surgical intervention is now a viable option for stress urinary incontinence. The most popular surgical method, called the mid-urethral synthetic sling, involves using a thin strip of surgical mesh to lift and support the urethra, preventing the leakage of urine. This surgery can be performed in less than an hour through a small incision in the vaginal area, rather than the abdomen. This helps reduce pain and recovery time. “Eighty to eighty-five percent of women are still dry 10 years after this procedure,” Dr. Krishnan says.\n\nAlthough most women choose to try less invasive methods first, Dr. Krishnan\nsays the advance of less invasive surgical approaches means even older women\nwith stress incontinence  or those who have had prior surgeries may want to\ngive surgery another look.\n\nFor all women, dealing with urinary incontinence no longer need be a\nhumiliating or hopeless endeavor. Learn more about urinary incontinence and\nevidence-based treatment options at the American Urogynecologic Society site\n“Voices for PFD” or talk to your doctor about treatment options available to\nyou.\n\n## Related Articles\n\n  * Birth Control Guide\n  * Facts About Vaginal Infections\n  * Pelvic Prolapse\n  * A Woman’s Guide to Osteoporosis\n  * 4 Benefits of Exercise for Women\n  * The Latest on Hormone Therapy\n\n### More Resources\n\n### Healthwise Resource Library\n\nLook up helpful health information.\n\n### Patient Information\n\nPractical info for Sutter patients.\n\n### Tools and Quizzes\n\nOnline tools to help you make decisions about your health.\n\n  * Next\n  * Previous\n  * Close\n\nThe Sutter Health Network of Care\n\nExpertise to fit your needs\n\nPrimary Care\n\nCheck-ups, screenings and sick visits for adults and children.\n\nSpecialty Care\n\nExpertise and advanced technologies in all areas of medicine.\n\nEmergency Care\n\nFor serious accidents, injuries and conditions that require immediate medical\ncare.\n\nUrgent Care\n\nAfter-hours, weekend and holiday services.\n\nWalk-In Care\n\nConvenient walk-in care clinics for your non-urgent health needs.\n\n  * __Contact Us\n  * __Find Doctors\n  * __Find Locations\n  * __Book Appointment\n  * __Request Medical Records\n  * __Donate Now\n\n__Sign in to My Health Online\n\n### Billing and Insurance\n\n  * Pay a Bill\n  * Accepted Health Plans\n  * Estimate Costs\n  * Medicare Advantage\n\n### About Sutter\n\n  * About Our Network\n  * Community Benefit\n  * Annual Report\n  * News and Media\n\n### Our Team\n\n  * For Employees\n  * For Medical Professionals\n  * For Vendors\n  * For Volunteers\n\n### Careers\n\n  * Jobs at Sutter\n  * Physician Jobs\n  * Graduate Medical Education\n\nCopyright © 2024 Sutter Health. All rights reserved. Sutter Health is a\nregistered trademark of Sutter Health ®, Reg. U.S. Patent & Trademark office.\n\n  * ADA Accessibility\n  * Price Transparency\n  * Privacy\n  * Do Not Sell My Personal Information\n  * Notice of Welltok MoveIt Event\n\n  * LinkedIn Opens new window\n  * YouTube Opens new window\n  * Facebook Opens new window\n  * XOpens new window\n  * Instagram Opens new window\n  * Glassdoor Opens new window\n\nPlease ensure Javascript is enabled for purposes of website accessibility\n\n",
    "links": "[{\"link\": \"https://www.sutterhealth.org/privacy/cookie-preference\", \"text\": \"Cookie Preferences\"}, {\"link\": \"https://www.sutterhealth.org/privacy/cookie-preference\", \"text\": \"Cookie Preferences\"}, {\"link\": \"https://www.sutterhealth.org/find-doctor\", \"text\": \"Find a Doctor\"}, {\"link\": \"https://www.sutterhealth.org/find-location\", \"text\": \"Find a Location\"}, {\"link\": \"https://www.sutterhealth.org/giving/give-now\", \"text\": \"Donate Now\"}, {\"link\": \"https://www.sutterhealth.org/myhealthonline/enroll\", \"text\": \"Enroll in My Health Online\"}, {\"link\": \"https://www.sutterhealth.org/myhealthonline\", \"text\": \"Learn About My Health Online\"}, {\"link\": \"https://www.sutterhealth.org/widgets/change-brand\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/\", \"text\": \"Sutter Health\"}, {\"link\": \"https://www.sutterhealth.org/appointments?type=walkincare\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/appointments?type=urgentcare\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/appointments?type=videovisits\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/appointments?type=primarycare\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/appointments?type=covid\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/myhealthonline/enroll\", \"text\": \"Enroll in My Health Online\"}, {\"link\": \"https://www.sutterhealth.org/myhealthonline\", \"text\": \"Learn About My Health Online\"}, {\"link\": \"https://www.sutterhealth.org/for-patients\", \"text\": \"View Patient Resources\"}, {\"link\": \"https://www.sutterhealth.org/myhealthonline/enroll\", \"text\": \"Enroll Now\"}, {\"link\": \"https://www.sutterhealth.org/find-doctor\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/find-location\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/services\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/for-patients/request-medical-record\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/for-patients/billing-insurance\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/health/symptom-checker\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/contact-us\", \"text\": \"Contact Us\"}, {\"link\": \"https://www.sutterhealth.org/for-patients\", \"text\": \"Patient and Visitor Information\"}, {\"link\": \"https://www.sutterhealth.org/myhealthonline\", \"text\": \"My Health Online Patient Portal\"}, {\"link\": \"https://www.sutterhealth.org/classes-events\", \"text\": \"Classes and Events\"}, {\"link\": \"https://www.sutterhealth.org/for-medical-professionals/sutter-specialty-network\", \"text\": \"Doctor Referrals\"}, {\"link\": \"https://www.sutterhealth.org/health\", \"text\": \"Health and Wellness\"}, {\"link\": \"https://www.sutterhealth.org/for-patients/health-alerts/covid-19-vaccine\", \"text\": \"COVID-19 Vaccine Resources\"}, {\"link\": \"https://www.sutterhealth.org/for-patients/billing-insurance\", \"text\": \"Pay a Bill\"}, {\"link\": \"https://www.sutterhealth.org/health-plan\", \"text\": \"Accepted Health Plans\"}, {\"link\": \"https://www.sutterhealth.org/for-patients/health-care-costs-and-charges\", \"text\": \"Cost Estimates/Charges\"}, {\"link\": \"https://www.sutterhealth.org/for-patients/medicare\", \"text\": \"Medicare Advantage\"}, {\"link\": \"https://www.sutterhealth.org/about/awards\", \"text\": \"award-winning\"}, {\"link\": \"https://www.sutterhealth.org/services\", \"text\": \"View All Services\"}, {\"link\": \"https://www.sutterhealth.org/appointments\", \"text\": \"Book Appointment\"}, {\"link\": \"https://www.sutterhealth.org/appointments?type=primarycare\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/video-visits\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/appointments?type=walkincare\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/appointments?type=urgentcare\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/location-search?location-type=emergency-rooms\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/services/behavioral-health\", \"text\": \"Mental Health \"}, {\"link\": \"https://www.sutterhealth.org/services/pregnancy-childbirth\", \"text\": \"Pregnancy and Childbirth \"}, {\"link\": \"https://www.sutterhealth.org/services/imaging\", \"text\": \"Imaging\"}, {\"link\": \"https://www.sutterhealth.org/services/pediatric\", \"text\": \"Pediatrics\"}, {\"link\": \"https://www.sutterhealth.org/services/orthopedic\", \"text\": \"Orthopedics\"}, {\"link\": \"https://www.sutterhealth.org/services/cancer\", \"text\": \"Cancer\"}, {\"link\": \"https://www.sutterhealth.org/services/heart-vascular\", \"text\": \"Heart and Vascular\"}, {\"link\": \"https://www.sutterhealth.org/services/dermatology\", \"text\": \"Dermatology\"}, {\"link\": \"https://www.sutterhealth.org/services/physical-therapy-rehabilitation\", \"text\": \"Physical Therapy\"}, {\"link\": \"https://www.sutterhealth.org/services/ear-nose-throat\", \"text\": \"Ear, Nose, and Throat (ENT)\"}, {\"link\": \"https://www.sutterhealth.org/services/lab-pathology\", \"text\": \"Labs\"}, {\"link\": \"https://www.sutterhealth.org/services/urology\", \"text\": \"Urology\"}, {\"link\": \"https://www.sutterhealth.org/services/neuroscience\", \"text\": \"Neuroscience\"}, {\"link\": \"https://www.sutterhealth.org/services/gynecology-womens-health\", \"text\": \"Women's Health (OB/GYN)\"}, {\"link\": \"https://www.sutterhealth.org/services\", \"text\": \"View All Services\"}, {\"link\": \"https://www.sutterhealth.org/research\", \"text\": \"Research at Sutter\"}, {\"link\": \"https://www.sutterhealth.org/research/clinical-trials\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/research-search?result-type=study\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/research-search?result-type=publication\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/research/investigators\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/about\", \"text\": \"Learn About Sutter Health\"}, {\"link\": \"https://www.sutterhealth.org/jobs\", \"text\": \"Find Jobs\"}, {\"link\": \"https://www.sutterhealth.org/about\", \"text\": \"About Us\"}, {\"link\": \"https://www.sutterhealth.org/about/diversity-inclusion\", \"text\": \"Diversity and Inclusion\"}, {\"link\": \"https://www.sutterhealth.org/about/awards\", \"text\": \"Awards and Honors\"}, {\"link\": \"https://www.sutterhealth.org/about/leadership\", \"text\": \"Leadership\"}, {\"link\": \"https://www.sutterhealth.org/annualreport\", \"text\": \"Annual Report\"}, {\"link\": \"https://www.sutterhealth.org/patient-stories\", \"text\": \"Patient Stories\"}, {\"link\": \"https://www.sutterhealth.org/business-units\", \"text\": \"Business Programs\"}, {\"link\": \"https://www.sutterhealth.org/giving\", \"text\": \"Giving\"}, {\"link\": \"https://www.sutterhealth.org/volunteering\", \"text\": \"Volunteer With Us\"}, {\"link\": \"https://www.sutterhealth.org/community-benefit\", \"text\": \"Community Benefit\"}, {\"link\": \"https://www.sutterhealth.org/jobs\", \"text\": \"Jobs at Sutter\"}, {\"link\": \"https://www.sutterhealth.org/physician-opportunities\", \"text\": \"Physician Opportunities\"}, {\"link\": \"https://www.sutterhealth.org/appointments\", \"text\": \"BOOK APPOINTMENT\"}, {\"link\": \"https://www.sutterhealth.org/\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/find-doctor\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/find-location\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/contact-us\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/giving/give-now\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/appointments\", \"text\": \"BOOK APPOINTMENT\"}, {\"link\": \"https://www.sutterhealth.org/\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/find-doctor\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/find-location\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/services\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/for-patients/request-medical-record\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/for-patients/billing-insurance\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/health/symptom-checker\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/contact-us\", \"text\": \"Contact Us\"}, {\"link\": \"https://www.sutterhealth.org/for-patients\", \"text\": \"Patient and Visitor Information\"}, {\"link\": \"https://www.sutterhealth.org/myhealthonline\", \"text\": \"My Health Online Patient Portal\"}, {\"link\": \"https://www.sutterhealth.org/classes-events\", \"text\": \"Classes and Events\"}, {\"link\": \"https://www.sutterhealth.org/for-medical-professionals/sutter-specialty-network\", \"text\": \"Doctor Referrals\"}, {\"link\": \"https://www.sutterhealth.org/health\", \"text\": \"Health and Wellness\"}, {\"link\": \"https://www.sutterhealth.org/for-patients/health-alerts/covid-19-vaccine\", \"text\": \"COVID-19 Vaccine Resources\"}, {\"link\": \"https://www.sutterhealth.org/for-patients/billing-insurance\", \"text\": \"Pay a Bill\"}, {\"link\": \"https://www.sutterhealth.org/health-plan\", \"text\": \"Accepted Health Plans\"}, {\"link\": \"https://www.sutterhealth.org/for-patients/health-care-costs-and-charges\", \"text\": \"Cost Estimates/Charges\"}, {\"link\": \"https://www.sutterhealth.org/for-patients/medicare\", \"text\": \"Medicare Advantage\"}, {\"link\": \"https://www.sutterhealth.org/for-patients\", \"text\": \"View Patient Resources\"}, {\"link\": \"https://www.sutterhealth.org/myhealthonline/enroll\", \"text\": \"Enroll Now\"}, {\"link\": \"https://www.sutterhealth.org/myhealthonline/enroll\", \"text\": \"Enroll Now\"}, {\"link\": \"https://www.sutterhealth.org/\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/appointments?type=primarycare\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/video-visits\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/appointments?type=walkincare\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/appointments?type=urgentcare\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/location-search?location-type=emergency-rooms\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/services/behavioral-health\", \"text\": \"Mental Health\"}, {\"link\": \"https://www.sutterhealth.org/services/pregnancy-childbirth\", \"text\": \"Pregnancy and Childbirth\"}, {\"link\": \"https://www.sutterhealth.org/services/imaging\", \"text\": \"Imaging\"}, {\"link\": \"https://www.sutterhealth.org/services/pediatric\", \"text\": \"Pediatrics\"}, {\"link\": \"https://www.sutterhealth.org/services/orthopedic\", \"text\": \"Orthopedics\"}, {\"link\": \"https://www.sutterhealth.org/services/cancer\", \"text\": \"Cancer\"}, {\"link\": \"https://www.sutterhealth.org/services/heart-vascular\", \"text\": \"Heart and Vascular\"}, {\"link\": \"https://www.sutterhealth.org/services/dermatology\", \"text\": \"Dermatology\"}, {\"link\": \"https://www.sutterhealth.org/services/physical-therapy-rehabilitation\", \"text\": \"Physical Therapy\"}, {\"link\": \"https://www.sutterhealth.org/services/ear-nose-throat\", \"text\": \"Ear, Nose, and Throat (ENT)\"}, {\"link\": \"https://www.sutterhealth.org/services/lab-pathology\", \"text\": \"Labs\"}, {\"link\": \"https://www.sutterhealth.org/services/urology\", \"text\": \"Urology\"}, {\"link\": \"https://www.sutterhealth.org/services/neuroscience\", \"text\": \"Neuroscience\"}, {\"link\": \"https://www.sutterhealth.org/services/gynecology-womens-health\", \"text\": \"Women's Health (OB/GYN)\"}, {\"link\": \"https://www.sutterhealth.org/about/awards\", \"text\": \"award-winning\"}, {\"link\": \"https://www.sutterhealth.org/services\", \"text\": \"View All Services\"}, {\"link\": \"https://www.sutterhealth.org/appointments\", \"text\": \"Book Appointment\"}, {\"link\": \"https://www.sutterhealth.org/\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/research/clinical-trials\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/research-search?result-type=study\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/research-search?result-type=publication\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/research/investigators\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/research\", \"text\": \"Research at Sutter\"}, {\"link\": \"https://www.sutterhealth.org/\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/about\", \"text\": \"About Us  \"}, {\"link\": \"https://www.sutterhealth.org/about/diversity-inclusion\", \"text\": \"Diversity and Inclusion\"}, {\"link\": \"https://www.sutterhealth.org/about/awards\", \"text\": \"Awards and Honors\"}, {\"link\": \"https://www.sutterhealth.org/about/leadership\", \"text\": \"Leadership\"}, {\"link\": \"https://www.sutterhealth.org/annualreport\", \"text\": \"Annual Report\"}, {\"link\": \"https://www.sutterhealth.org/patient-stories\", \"text\": \"Patient Stories\"}, {\"link\": \"https://www.sutterhealth.org/business-units\", \"text\": \"Business Programs\"}, {\"link\": \"https://www.sutterhealth.org/giving\", \"text\": \"Giving\"}, {\"link\": \"https://www.sutterhealth.org/volunteering\", \"text\": \"Volunteer With Us\"}, {\"link\": \"https://www.sutterhealth.org/community-benefit\", \"text\": \"Community Benefit\"}, {\"link\": \"https://www.sutterhealth.org/jobs\", \"text\": \"Jobs at Sutter \"}, {\"link\": \"https://www.sutterhealth.org/physician-opportunities\", \"text\": \"Physician Opportunities\"}, {\"link\": \"https://www.sutterhealth.org/about\", \"text\": \"Learn About Sutter Health\"}, {\"link\": \"https://www.sutterhealth.org/jobs\", \"text\": \"Find Jobs\"}, {\"link\": \"https://www.sutterhealth.org/jobs\", \"text\": \"Find Jobs\"}, {\"link\": \"https://www.sutterhealth.org/\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/health\", \"text\": \"Health and Wellness\"}, {\"link\": \"https://www.sutterhealth.org/health/womens-health\", \"text\": \"Women's Health\"}, {\"link\": \"https://www.sutterhealth.org/find-doctor/dr-savitha-krishnan\", \"text\": \"Savitha Krishnan, M.D.\"}, {\"link\": \"https://www.sutterhealth.org/health/womens-health/birth-control-guide\", \"text\": \"Birth Control Guide\"}, {\"link\": \"https://www.sutterhealth.org/health/womens-health/facts-about-vaginal-infections\", \"text\": \"Facts  About Vaginal Infections\"}, {\"link\": \"https://www.sutterhealth.org/health/womens-health/breaking-the-silence-about-pelvic-prolapse\", \"text\": \"Pelvic Prolapse\"}, {\"link\": \"https://www.sutterhealth.org/health/womens-health/a-womens-guide-to-osteoporosis\", \"text\": \"A Woman’s Guide to Osteoporosis\"}, {\"link\": \"https://www.sutterhealth.org/health/womens-health/health-benefits-of-exercise-for-women\", \"text\": \"4 Benefits of Exercise for Women\"}, {\"link\": \"https://www.sutterhealth.org/health/womens-health/the-latest-word-on-hormone-therapy\", \"text\": \"The Latest on Hormone Therapy\"}, {\"link\": \"https://www.sutterhealth.org/medical-library\", \"text\": \"Healthwise Resource Library\"}, {\"link\": \"https://www.sutterhealth.org/for-patients\", \"text\": \"Patient Information\"}, {\"link\": \"https://www.sutterhealth.org/health/tools-quizzes\", \"text\": \"Tools and Quizzes\"}, {\"link\": \"https://www.sutterhealth.org/services/primary\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/services\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/services/emergency\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/services/urgent\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/services/primary/walk-in\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/contact-us\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/find-doctor\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/find-location\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/appointments\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/for-patients/request-medical-record\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/giving\", \"text\": \"\"}, {\"link\": \"https://www.sutterhealth.org/for-patients/billing-insurance\", \"text\": \"Pay a Bill\"}, {\"link\": \"https://www.sutterhealth.org/health-plan\", \"text\": \"Accepted Health Plans\"}, {\"link\": \"https://www.sutterhealth.org/for-patients/health-care-costs-and-charges\", \"text\": \"Estimate Costs\"}, {\"link\": \"https://www.sutterhealth.org/for-patients/medicare\", \"text\": \"Medicare Advantage\"}, {\"link\": \"https://www.sutterhealth.org/about\", \"text\": \"About Our Network\"}, {\"link\": \"https://www.sutterhealth.org/community-benefit\", \"text\": \"Community Benefit\"}, {\"link\": \"https://www.sutterhealth.org/for-employees\", \"text\": \"For Employees\"}, {\"link\": \"https://www.sutterhealth.org/for-medical-professionals\", \"text\": \"For Medical Professionals\"}, {\"link\": \"https://www.sutterhealth.org/for-vendors\", \"text\": \"For Vendors\"}, {\"link\": \"https://www.sutterhealth.org/volunteering\", \"text\": \"For Volunteers\"}, {\"link\": \"https://www.sutterhealth.org/physician-opportunities\", \"text\": \"Physician Jobs\"}, {\"link\": \"https://www.sutterhealth.org/accessibility\", \"text\": \"ADA Accessibility\"}, {\"link\": \"https://www.sutterhealth.org/for-patients/healthcare-cost-transparency\", \"text\": \"Price Transparency\"}, {\"link\": \"https://www.sutterhealth.org/privacy\", \"text\": \"Privacy\"}, {\"link\": \"https://www.sutterhealth.org/privacy/privacy-request\", \"text\": \"Do Not Sell My Personal Information\"}]"
}