{
    "summary": "Skip to Main Content\n\n1-877-YALEMDS\n\nSearch for\n\nSpecialistsFact SheetsDepartmentsClinical TrialsNewsPatient Tools\n\n* * *\n\nSearch\n\n# Female Incontinence\n\n  * •The loss of bladder control in women, causing urine leakage\n  * •Types include urge incontinence, stress incontinence, and mixed incontinence\n  * •Treatment includes exercise, timed voiding, lifestyle changes, and surgery in some cases\n  * •Involves Female Urology, Female Pelvic Medicine & Reconstructive Surgery Program\n\nRelated Terms:\n\n* Urinary Incontinence in Women\n* Urinary Incontinence\n* Urinary Incontinency in Men\n* Urinary and Bowel Incontinence\n* Post-Prostatectomy Incontinence\n\n  * Overview\n  * What is female incontinence?\n  * What are the risk factors for female incontinence?\n  * What are the symptoms of female incontinence?\n  * How is female incontinence diagnosed?\n  * What treatment options are available?\n  * What makes Yale Medicine's approach to treating female incontinence unique?\n\n## Related Specialists\n\n  * #### Oz Harmanli\n\nMD\n\nUrogynecology, Obstetrics,...\n\n  * #### Cherrilyn Richmond\n\nMS\n\n  * #### Leslie M. Rickey\n\nMD, MPH\n\nMore Related Specialists\n\n# Female Incontinence\n\n  * Print\n  * Share\n\n## Overview\n\nAlthough many are reluctant to talk about it, urinary incontinence is a\nstruggle for women of all ages, from all walks of life. Many women experience\ninvoluntary loss of urine as they get older, but urinary incontinence should\nnot be considered a normal part of aging.\n\nThere are effective treatments available that can help prevent unintentional\nurine loss. At Yale Medicine's Pelvic Medicine & Continence Center, our\nclinicians use the latest diagnostic tools to determine which treatment is\nappropriate for you.\n\n\"Anyone who has had two babies and is 45 or older has likely had an experience\nwith urinary incontinence,\" says Oz Harmanli, MD, chief of Yale Medicine\nUrogynecology & Pelvic Reconstructive Surgery and a professor of obstetrics\nand gynecology and reproductive sciences at Yale School of Medicine\n\n\"They may not be at a point where they need to seek help, but when they get\ninto their 50s, it often becomes a more common problem. We have a 90-percent\ntreatment success rate when urinary incontinence comes from physical exertion,\nor stress.\"  \n\n## What is female incontinence?\n\nFemale incontinence is the loss of bladder control in women. It is not\nuncommon to lose urine during pregnancy or with urinary tract infections\ntemporarily. There are many reasons you might develop urinary incontinence as\na chronic problem. The most common causes are pelvic floor trauma with\nchildbirth, menopause, hysterectomy, obesity, cognitive impairment, chronic\ncough and constipation.\n\nThere are three types of female incontinence:  \n\n  *  **Urge incontinence:  **Women with urge incontinence feel the need to urinate frequently. They experience leakage of urine during times associated with this urge. \n  *  **Stress incontinence:  **Women with stress incontinence, also known as physical or exertion incontinence, may experience urine leakage, especially when coughing, laughing, exercising or sneezing.\n  *  **Mixed incontinence:  **Many women experience a combination of stress incontinence and urge incontinence.\n\n## What are the risk factors for female incontinence?\n\nFemale incontinence is very common, but there are a few factors that may\nincrease the risk. They include:\n\n  *  **Age:  **With age, the muscles in the bladder and surrounding areas begin to weaken, which may lead to incontinence.\n  *  **Pregnancy and vaginal delivery:  **A vaginal delivery can strain or damage the muscles of the pelvic floor, leading to future problems with incontinence. However, an uncomplicated vaginal delivery should not typically cause urinary incontinence, Dr. Harmanli says.\n  *  **Being overweight:  **Patients who carry extra weight are also putting increased strain on the bladder and its surrounding muscles.\n\n## What are the symptoms of female incontinence?\n\nInvoluntary loss of urine or leakage can be characterized by an overactive\nurge to urinate or an inability to control urination while laughing, sneezing\nor coughing.\n\n## How is female incontinence diagnosed?\n\nBecause there are many different factors that can contribute to urinary\nincontinence, a doctor will first take a take a detailed medical history and\nconduct a physical exam. A qualified nurse practitioner will also perform a\ntest for involuntary urine loss by inserting a small catheter (tube) to empty\nthe bladder completely and then fill it with water. With a bladder full of\nwater, you will be asked to cough and bear down, and the nurse will measure\nthe amount of water that escapes\n\nThis evaluation will help determine if the condition is severe enough to\nwarrant a urodynamic study, which measures the activity of the bladder as it\nfills and empties. This will help determine the cause and severity of the\nproblem and guide the best treatment.\n\n## What treatment options are available?\n\nWe offer surgical and nonsurgical urinary incontinence treatments. Since women\nwho experience urinary incontinence might also suffer from pelvic organ\nprolapse or other pelvic floor issues, we work with a team that includes\nsurgeons, urogynecologists, physical therapists and any other members of her\ncare team to determine the optimal treatment plan.\n\n **Nonsurgical options**\n\nDepending on the type of urinary incontinence, there are several nonsurgical\noptions available. The most effective ones include:\n\n  * Kegel exercises strengthen the pelvic floor. \"Pelvic floor exercises should be part of a woman’s routine just like brushing your teeth,\" Dr. Harmanli says. \"You need them for the health of your pelvic floor, even if you don’t experience any symptoms or even if you never had children. The best part, he says, is that you don't have to go to the gym and can do them sitting at your desk or in your car. \"Your medical provider can give you some feedback on how you are doing them at your next exam. It’s the same thing you do when you have a full bladder and you don’t want to leak. You contract for five to 10 seconds and then let go for five to 10 seconds and do a set of 10 to 15. Three sets a day at least is ideal.\" \n\n  * Timed voiding (going to the bathroom on a regular basis, for instance, every two hours even when there is no feeling of urge). Dr. Harmanli also suggests watching your fluids, the amount and the content. Coffee, tea, soda are all stimulants. It may be OK to drink a cup of coffee in the morning if you depend on it, he says, but maybe you want to avoid having two in a row.\n\n  * Weight loss and exercise. A doctor may also prescribe medication to relax bladder spasms or urges, or inject collagen to increase the resistance of the urethra. Botox injections are also sometimes used to relax the bladder.\n\n **Surgical options**\n\nIf you do not respond to non-surgical treatment or you have very severe\nincontinence, surgical management should be considered. While pelvic floor\nexercises and behavioral and lifestyle changes often work best for urge\nincontinence, stress incontinence responds extremely well to surgery, Dr.\nHarmanli says.\n\nThe leading surgical method for stress incontinence is the “sling” procedure.\nThis involves placing a thin, small sling made of synthetic material or mesh\nbeneath the urethra, the tube which drains the bladder outside. This minimally\ninvasive surgery can be done as same-day surgery.\n\n\"It takes less than 30 minutes and most women can go back to work in a few\ndays and can resume intercourse in three weeks, Dr. Harmanli says. \"You can\nsqueeze it into your busy life, and it is proven to be safe and effective.\nThis is one of the best studied procedures that we do.\"\n\n## What makes Yale Medicine's approach to treating female incontinence unique?\n\nIncontinence is a difficult subject for patients to talk about. Here at Yale\nMedicine, we know the best conversations start with listening. We guide you\ntowards treatments that best match your goals and lifestyle.  \n\nWe are experts in the latest non-surgical and surgical techniques, and we have\nan established Urogynecology fellowship program. \"We are training the future\nurogynecologists and that makes us stay sharp,\" Dr. Harmanli says. \"Plus, at\nYale, we are surrounded by other specialists such as urologists,\ngynecologists, and colorectal surgeons with whom we can coordinate your care.\"\n\nAt Yale Medicine Urogynecology & Reconstructive Pelvic Surgery, you will work\nwith not only doctors but physical therapists and our nurse practitioner\nCherrilyn Richmond, who will coach you through pelvic floor exercises.\n\nFurthermore, Yale researchers are at the forefront of developing new\ninnovative treatment modalities that in 20 years, Dr. Harmanli trusts, \"[are]\ngoing to fix most these problems.\"\n\n## Related Fact Sheets\n\nShowing 4 of 9\n\n  * ### Urinary Incontinence in Women\n\nUrinary incontinence is the involuntary loss of urine or urine leakage. Learn\nabout causes and treatment.\n\n  * ### Stress Incontinence\n\nStress incontinence refers to involuntary urine leakageduring moments of\nsudden abdominal pressure such as during a cough, sneeze, laugh, or other\nphysical activity.\n\n  * ### Pediatric Incontinence (Enuresis)\n\nPediatric incontinence refers to daytime or nighttime loss of bladder control\nin children. Learn about symptoms and treatment.\n\n  * ### Neurogenic Bladder and Incontinence\n\nNeurogenic bladder happens when the body's muscles and nerves fail to\ncommunicate correctly. The result can be loss of bladder control.\n\nMore Related Fact Sheets\n\n## Related Clinical Trials\n\nShowing 2 of 3\n\n  * Women's Health\n\n### Multi-center, parallel-group, randomized controlled trial of modified\nnatural versus programmed cycles for frozen embryo transfers and their\nassociation with preeclampsia and live births...\n\n    * Ages18 years - 41 years\n    * GenderFemale only\n\n  * Women's Health\n\n### Pre-IVF Treatment With a GnRH Antagonist in Women With Endometriosis\n(PREGnant)\n\n    * Ages18 years - 38 years\n    * GenderFemale only\n\nMore Related Clinical Trials\n\n## Related News\n\n  * Family Health, Doctors & Advice\n\n### Bedwetting and ‘Accidents’: Solutions for Children\n\n  * Family Health, Doctors & Advice\n\n### 5 Ways You Could Pee Better\n\n  * About Us\n  * Contact Us\n  * Donate\n  * Referring Doctors\n  * Clinical Keywords\n\n  *   *   *   *   * \n\n333 Cedar St.\n\nNew Haven, CT 06510\n\n  * Yale School of Medicine\n  * Yale University\n  * Website Feedback\n\n  * Terms & Privacy Policies\n  * Accessibility at YSM\n  * Patient Rights\n  * HIPAA at Yale\n  * Manage Cookie Preferences\n\nCopyright 2024 Yale Medicine\n\n[1073,43]{\"namedChunks\":[\"modules-factsheet-details-components-\nFactSheetDetails-factSheetDetails\"]} [8326,43]{\"namedChunks\":[\"modules-\nfactsheet-details-components-FactSheetDetails-factSheetDetails\"]}\n\n",
    "links": "[{\"link\": \"https://www.yalemedicine.org/\", \"text\": \"\"}, {\"link\": \"https://www.yalemedicine.org/specialists\", \"text\": \"Specialists\"}, {\"link\": \"https://www.yalemedicine.org/conditions\", \"text\": \"Fact Sheets\"}, {\"link\": \"https://www.yalemedicine.org/departments\", \"text\": \"Departments\"}, {\"link\": \"https://www.yalemedicine.org/clinical-trials\", \"text\": \"Clinical Trials\"}, {\"link\": \"https://www.yalemedicine.org/news\", \"text\": \"News\"}, {\"link\": \"https://www.yalemedicine.org/patient-tools\", \"text\": \"Patient Tools\"}, {\"link\": \"https://www.yalemedicine.org/specialists/oz-harmanli\", \"text\": \"\"}, {\"link\": \"https://www.yalemedicine.org/specialists/cherrilyn-richmond\", \"text\": \"\"}, {\"link\": \"https://www.yalemedicine.org/specialists/leslie-rickey\", \"text\": \"\"}, {\"link\": \"https://www.yalemedicine.org/search/specialists?entityType=FactSheet&entityId=2347&q=Female%20Incontinence%3Cbr%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F1999%2Fxhtml%22%20%2F%3E\", \"text\": \"\"}, {\"link\": \"https://www.yalemedicine.org/conditions/urinary-incontinence-in-women\", \"text\": \"\"}, {\"link\": \"https://www.yalemedicine.org/conditions/stress-incontinence\", \"text\": \"\"}, {\"link\": \"https://www.yalemedicine.org/conditions/bedwetting\", \"text\": \"\"}, {\"link\": \"https://www.yalemedicine.org/conditions/neurogenic-bladder-and-incontinence\", \"text\": \"\"}, {\"link\": \"https://www.yalemedicine.org/search/conditions?entityType=FactSheet&entityId=2347&q=Female%20Incontinence%3Cbr%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F1999%2Fxhtml%22%20%2F%3E\", \"text\": \"\"}, {\"link\": \"https://www.yalemedicine.org/clinical-trials/natpro\", \"text\": \"\"}, {\"link\": \"https://www.yalemedicine.org/clinical-trials/pregnant\", \"text\": \"\"}, {\"link\": \"https://www.yalemedicine.org/search/clinical-trials?entityType=FactSheet&entityId=2347&q=Female%20Incontinence%3Cbr%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F1999%2Fxhtml%22%20%2F%3E\", \"text\": \"\"}, {\"link\": \"https://www.yalemedicine.org/news/pediatric-bladder-continence-program-offers-solutions\", \"text\": \"\"}, {\"link\": \"https://www.yalemedicine.org/news/5-ways-to-pee-better\", \"text\": \"\"}, {\"link\": \"https://www.yalemedicine.org/about-us\", \"text\": \"About Us\"}, {\"link\": \"https://www.yalemedicine.org/about-us/contact-us\", \"text\": \"Contact Us\"}, {\"link\": \"https://www.yalemedicine.org/referring-doctors\", \"text\": \"Referring Doctors\"}, {\"link\": \"https://www.yalemedicine.org/\", \"text\": \"\"}, {\"link\": \"https://www.yalemedicine.org/privacy\", \"text\": \"Terms & Privacy Policies\"}]"
}