{
    "summary": "HealthPartners Home / Blog / Healthy living, Women’s health / What causes\nurinary incontinence in...\n\n**Elizabeth Frankman, MD** | 1 article\n\nDo you cross your legs when you feel a sneeze coming on? Do sudden urges to go\ncause you to panic? Do leaks just happen randomly, without notice? These are\nall symptoms of a condition known as urinary incontinence, or UI.\n\nIt’s estimated that about half of adult women experience UI. Yet of those who\nlive with the symptoms, less than half seek care. Common reasons for delaying\ntreatment for UI vary from embarrassment to fear of surgery to lack of\nawareness about nonsurgical treatment options.\n\nBelow, you’ll find a brief overview of the types of UI in women and their\ncauses. You’ll also learn how we diagnose UI. Finally, we’ll cover\nnonsurgical, medicinal and surgical treatments for UI.\n\n## What is urinary incontinence?\n\nUrinary incontinence is involuntary loss of bladder control, which is\ndifferent than frequent urination. It can happen when your bladder muscles are\ntoo weak or too active, and UI can be a temporary concern or a chronic issue.\n\nIt’s a myth that UI is just part of aging. It’s a medical condition that may\naffect women of any age, and there are many different ways to manage your\nsymptoms so you can say goodbye to surprise leaks.\n\n## Types of urinary incontinence\n\nThere are four different types of urinary incontinence: stress incontinence,\nurge incontinence, mixed incontinence and overflow incontinence. Each form of\nUI comes with its own distinct symptoms. Let’s talk about the different kinds\nof UI and the symptoms they’re known for:\n\n### Stress incontinence\n\nStress incontinence refers to any physical stress on the abdomen or bladder\nthat forces urine to escape. This could be from laughing, sneezing, lifting\nheavy things or performing certain physical activities. Stress incontinence\ntends to be more common in younger women.\n\n### Urge incontinence\n\nUrge incontinence happens when you feel a strong, persistent urge to urinate.\nThis type of UI is caused by bladder contractions that expel urine and is\ncommonly referred to as having an overactive bladder. Urge incontinence tends\nto be more common in women’s later years although it can occur in younger\nwomen, too.\n\n### Mixed incontinence\n\nMixed incontinence refers to the presence of stress and urge incontinence.\nMost women who have urinary incontinence have a component of both stress and\nurge.\n\n### Overflow incontinence\n\nOverflow incontinence results from bladder overflow. When your bladder becomes\ntoo full, urine will leak out. This can be either from the inability to fully\nempty your bladder during urination, or just not realizing you need to go.\nWith this kind of UI, your bladder leak may be continuous.\n\n## Symptoms of urinary incontinence in women\n\nThe symptoms of UI in women can vary from person to person. If you’re not sure\nwhether you’re dealing with urinary incontinence, pay attention to the\nfollowing symptoms:\n\n  * Leaking urine when you sneeze, laugh or cough\n  * Feeling like your bladder is never completely empty \n  * Constantly feeling like you need to pee\n  * Often waking up in the middle of the night to pee\n  * Feeling like you have to pee right after you pee\n  * Avoiding certain activities because you’re afraid of leaking\n  * Rushing to the restroom because you’ll leak if you don’t make it in time\n  * Suddenly noticing that you need to pee all the time\n\n## Causes of urinary incontinence in women\n\nThere are several causes of urinary incontinence in women, including weakened\npelvic muscles, pelvic organ prolapse and UTIs. Factors including your age,\nweight, medications you take, and whether you’ve ever been pregnant can also\naffect your bladder control.\n\nWhile the causes of UI are based on many factors, women are twice as likely as\nmen to experience UI because of body structure. A healthy man’s urinary system\nwill stay relatively the same throughout his life while a woman’s is built to\nbe more flexible. It’s this flexibility that enables women to bear children\nbut also leaves the urinary system more susceptible to weakening – even in\nwomen who never become pregnant.\n\n**Factors that can increase the risk of developing urinary incontinence in\nwomen include:**\n\n  * Pregnancy and delivery\n  * Aging\n  * Obesity\n  * Weakened pelvic floor muscles\n  * Pelvic organ prolapse\n  * Alcohol and caffeine consumption\n  * Excessive fluid intake\n  * Some medications\n  * Menopause\n  * Neurological conditions such as Alzheimer’s disease\n  * Urinary tract infections (UTIs)\n\n## When to see a doctor for urinary incontinence\n\nIn most cases, UI can be treated without surgery. If left untreated, UI can\nlead to sleep loss, depression, anxiety and loss of interest in sex. It might\nbe a good idea to see your doctor if your condition is causing you to:\n\n  * Frequently urinate (8 or more times per day)\n  * Feel tired from incontinence-related sleep loss\n  * Feel socially anxious about your urinary incontinence\n  * No longer participate in activities that bring you joy\n  * Miss out on big moments or lose productivity\n\n### When to seek immediate help\n\nIn some situations, UI may be a sign of something more serious. If you\nexperience any of these symptoms, please seek medical attention as soon as\npossible.\n\n  * Appearance of blood in urine\n  * Inability to urinate\n\n## How is urinary incontinence diagnosed?\n\nOur goal is to help you feel better and as comfortable as possible along the\nway. In addition to talking with you and performing a pelvic exam (a quick\ncheck of your pelvic organs such as the vagina, uterus and rectum), there are\na number of methods your doctor may recommend to diagnose your condition and\ndetermine the potential causes behind incontinence.\n\n### Keeping a bathroom journal\n\nYou may be asked to keep a bathroom journal before or after your appointment.\nIn your journal, you’ll log all your bathroom trips and bladder leakage or\nissues. It can also be helpful to record what you eat and drink in your\nbladder journal. This record will help your doctor get a more accurate idea of\nyour symptoms and how often they occur. Keeping a journal can also determine\nwhat triggers your need to pee or any accidents.\n\n### Urine testing\n\nFor a urine test, you’ll provide a small sample. The lab will then analyze for\ndifferent factors such as acidity, appearance, concentration and presence of\ninfection.\n\n### Bladder ultrasound\n\nDuring a bladder ultrasound, the nurse will move a handheld device across your\nabdomen to measure the amount of urine left inside your bladder after\nurinating.\n\n### Urodynamic testing\n\nYour doctor may recommend additional assessments that measure bladder\nfunction. Urodynamic testing measures how well your bladder, urethra and\nsphincter muscles work together to store and release urine.\n\n### Cystoscopy\n\nThis procedure allows your doctor to examine your urethra and bladder with the\nuse of a small camera.\n\n## Nonsurgical treatment options for UI\n\nFortunately, there are several nonsurgical treatments for urinary\nincontinence. From training your bladder and pelvic floor exercises to using a\nurethral support device, there are different options you can try to manage\nyour symptoms. We recommend discussing your options with a doctor before\ndeciding on the best course of action.\n\nIn some cases, your doctor might recommend lifestyle changes to help manage\nand prevent the symptoms of urinary incontinence. These range from adjustments\nto your diet, to exercise habits to management techniques between bathroom\nbreaks. Common nonsurgical treatments for urinary incontinence are:\n\n### Perform Kegel exercises\n\nKegels are a great way to strengthen the muscles in your pelvic floor – and\nget bonus points for being doable anywhere. If you’ve never done Kegels\nbefore, they’re simply the contracting and releasing of the muscles you use to\nstop and start the flow of urine. By practicing this quick exercise every day,\nyou’ll strengthen those muscles important for bladder control. Just make sure\nto only do them when you don’t need to go. Try to complete about 10 sets of 10\ncontractions per day to maintain a strong and reliable pelvic floor.\n\n### Reduce your fluid intake\n\nDrinking water is good for your body, and it’s important to stay hydrated, but\noverdoing fluid intake can lead to bladder urgency and leaks. The key to\nhealthy fluid intake is maintaining a good balance. Try to drink water when\nthirsty, but not more of it than your body asks for. And keep an eye on the\ncolor of your urine. If it’s clear, you could probably cut back on fluid\nintake, but dark urine is a sign that you need more fluids.\n\n### Exercise more\n\nEven though physical strain can trigger bladder leakage, it’s still important\nto remain active. By maintaining a healthy weight and exercising regularly,\nyou may reduce your chances of experiencing UI and other health-related\nissues. Worried about leaks? If concerns about incontinence are preventing you\nfrom participating in physical activities at the gym or in a public place, try\nfinding a more private space, like your living room, where you can feel\ncomfortable exercising – at least until you feel confident enough to get out\nthere again.\n\n### Change your diet\n\nCaffeine, alcohol and other bladder irritants can be major triggers for UI. If\nyou want to improve your symptoms, try to save the lattes and wine for special\noccasions, and use extra precaution indulging in them.\n\nAlso be careful with food and drinks that are spicy or acidic. They can\nirritate your bladder, prompting contractions, which can lead to leaks. As a\ngeneral rule, take note of any foods and drinks that make your symptoms worse,\nand try to keep a healthy, balanced diet rich in vitamins and nutrients.\n\n### Try training your bladder\n\nHaving a regular bathroom schedule can help teach your bladder to recognize\nwhen it’s time to go, reducing the number of leaks. It can also help slowly\n“train” your bladder to increase the amount of time between trips.\n\n### Use precaution\n\nPrecautionary products can protect yourself in high-risk situations, such as\nduring physical activity or when you have limited bathroom access. The most\ncommon precautionary products are disposable pads, liners and underwear\ndesigned to act as an absorbent barrier between you and your clothes.\n\n### Try pelvic floor therapy\n\nPelvic floor therapy is a type of specialized physical therapy that\nstrengthens the muscles that support your bladder and bowels. This can be very\neffective in treating urinary incontinence caused by an overactive bladder.\n\nDuring pelvic floor therapy, a physical therapist may lead you through\nexercises that target your pelvic floor, use mild electrical stimulation to\nhelp you have more awareness of your pelvic floor muscles, and use other\nspecialized techniques. If you’re interested in pelvic floor therapy, talk\nwith a doctor about getting a referral.\n\n### Use a urethral support device (pessary)\n\nYour doctor may recommend fitting you with a device worn in the vagina to help\nprevent bladder leakage with activity. An over-the-counter device called\nImpressa is also available.\n\n## Medical treatments for UI\n\nMedications for urinary incontinence are specifically designed to treat urge\nincontinence. These medicines help prevent leaks by reducing the spasms in\nyour bladder muscles that cause them.\n\n## Surgical treatments for UI\n\nBladder control surgery to treat stress incontinence is available and works by\ngiving more support to the urethra. The support keeps you from leaking when\npressure is put on your bladder or your urethra, putting you in control of\nwhen it’s time to go. There are also procedures available to treat urge\nincontinence.\n\nOur doctors will help to decide if a procedure or surgery is the best option\nfor you and will walk you through how it works as well as answer any questions\nyou may have.\n\n## How to get help for female urinary incontinence\n\nStill feeling unsure about your first step? Remember, incontinence doesn’t\nhave to stop you from enjoying daily life on your terms. Getting the right\ndiagnosis and treatment can be a life changer.\n\nIf you think that you might have urinary incontinence, reach out to one of our\nprimary care doctors or women’s health specialists. We’ll answer any questions\nyou may have and guide you toward treatment that will work for you. If\nspecialty care is needed, we’ll refer you to our team of compassionate\nurogynecology specialists.\n\nShare\n\n##  Related posts\n\n## HealthPartners\n\n  * 8170 33rd Ave S, Bloomington, MN 55425\n  * 952-883-6000\n\n  *   *   *   * \n\n## Clinics & hospitals\n\n  * HealthPartners Clinics\n  * Park Nicollet Clinics\n  * 24/7 online clinic\n  * Specialty Centers\n  * Hospitals\n  * TRIA\n  * Neck and Back Strengthening Program\n\n## Insurance\n\n  * Through work\n  * Buying your own\n  * Medicare\n  * Minnesota health care programs\n  * Employer portal\n  * Broker portal\n  * Provider portal\n\n## Resources\n\n  * Blog\n  * Pay a bill\n  * Press releases\n  * Get Adobe Reader\n  * Get Android app\n  * Get iPhone app\n\n## Language assistance\n\n  * Español\n  * ພາສາລາວ\n  * Oromiffa\n  * हिंदी\n  * ภาษาไทย\n  * Adamawa\n  * Hmoob\n  * Deutsch\n  * አማርኛ\n  * Shqip\n  * ελληνικά\n  * 日本語\n\n  * Tiếng Việt\n  * العربية\n  * unD\n  * Srpsko-hrvatski\n  * Diné Bizaad\n  * नेपाली\n  * 繁體中文\n  * Français\n  * ខ្មែរ\n  * ગુજરાતી\n  * Ikirundi\n  * Ukrainian\n\n  * Pусский\n  * 한국어\n  * Deitsch\n  * اردو\n  * Kiswahili\n  * Af Soomaali\n  * Tagalog\n  * Polski\n  * Italiano\n  * Norsk\n\n  * Español\n  * ພາສາລາວ\n  * Oromiffa\n  * हिंदी\n  * ภาษาไทย\n  * Adamawa\n\n  * Hmoob\n  * Deutsch\n  * አማርኛ\n  * Shqip\n  * ελληνικά\n  * 日本語\n\n  * Tiếng Việt\n  * العربية\n  * unD\n  * Srpsko-hrvatski\n  * Diné Bizaad\n  * नेपाली\n\n  * 繁體中文\n  * Français\n  * ខ្មែរ\n  * ગુજરાતી\n  * Ikirundi\n  * Ukrainian\n\n  * Pусский\n  * 한국어\n  * Deitsch\n  * اردو\n  * Kiswahili\n  * Af Soomaali\n\n  * Tagalog\n  * Polski\n  * Italiano\n  * Norsk\n\n  * © 2024 HealthPartners\n  *   *   *   *   *   *   *   * \n\n",
    "links": "[{\"link\": \"https://www.healthpartners.com/\", \"text\": \"HealthPartners Home\"}, {\"link\": \"https://www.healthpartners.com/blog/\", \"text\": \"Blog\"}, {\"link\": \"https://www.healthpartners.com/blog/uti-symptoms-causes/\", \"text\": \"Urinary tract infections (UTIs)\"}, {\"link\": \"https://www.healthpartners.com/blog/what-your-urine-says-about-your-health/\", \"text\": \"color of your urine\"}, {\"link\": \"https://twitter.com/share?url=https://www.healthpartners.com/blog/female-urinary-incontinence-causes-and-treatment-options/\", \"text\": \"\"}, {\"link\": \"https://www.facebook.com/sharer.php?u=https://www.healthpartners.com/blog/female-urinary-incontinence-causes-and-treatment-options/\", \"text\": \"\"}, {\"link\": \"https://www.linkedin.com/shareArticle?url=https://www.healthpartners.com/blog/female-urinary-incontinence-causes-and-treatment-options/\", \"text\": \"\"}, {\"link\": \"https://www.healthpartners.com/care/find/locations/?brand=HealthPartners&dist=10\", \"text\": \"HealthPartners Clinics\"}, {\"link\": \"https://www.healthpartners.com/care/find/locations/?brand=Park+Nicollet&dist=10\", \"text\": \"Park Nicollet Clinics\"}, {\"link\": \"https://www.healthpartners.com/care/specialty-centers/\", \"text\": \"Specialty Centers\"}, {\"link\": \"https://www.healthpartners.com/care/hospitals/\", \"text\": \"Hospitals\"}, {\"link\": \"https://www.healthpartners.com/insurance/individual-family/\", \"text\": \"Buying your own\"}, {\"link\": \"https://www.healthpartners.com/provider-public/\", \"text\": \"Provider portal\"}, {\"link\": \"https://www.healthpartners.com/blog/\", \"text\": \"Blog\"}, {\"link\": \"https://www.healthpartners.com/hp/about/press-releases/index.html\", \"text\": \"Press releases\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"Español\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"ພາສາລາວ\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"Oromiffa\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"हिंदी\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"ภาษาไทย\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"Adamawa\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"Hmoob\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"Deutsch\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"አማርኛ\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"Shqip\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"ελληνικά\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"日本語\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"Tiếng Việt\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"العربية\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"unD\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"Srpsko-hrvatski\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"Diné Bizaad\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"नेपाली\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"繁體中文\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"Français\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"ខ្មែរ\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"ગુજરાતી\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"Ikirundi\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"Ukrainian\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"Pусский\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"한국어\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"Deitsch\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"اردو\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"Kiswahili\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"Af Soomaali\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"Tagalog\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"Polski\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"Italiano\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"Norsk\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"Español\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"ພາສາລາວ\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"Oromiffa\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"हिंदी\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"ภาษาไทย\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"Adamawa\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"Hmoob\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"Deutsch\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"አማርኛ\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"Shqip\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"ελληνικά\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"日本語\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"Tiếng Việt\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"العربية\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"unD\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"Srpsko-hrvatski\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"Diné Bizaad\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"नेपाली\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"繁體中文\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"Français\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"ខ្មែរ\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"ગુજરાતી\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"Ikirundi\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"Ukrainian\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"Pусский\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"한국어\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"Deitsch\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"اردو\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"Kiswahili\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"Af Soomaali\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"Tagalog\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"Polski\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"Italiano\"}, {\"link\": \"https://www.healthpartners.com/content/dam/brand-identity/pdfs/corporate/language-assistance-for-patients-healthpartners.pdf\", \"text\": \"Norsk\"}]"
}