{
    "summary": "  * Products\n\n  * Company\n\n  * Partners\n\n  * Contact\n\n# Making Markets  \nFair & Square\n\nSystem 9 is a global market maker and software development company that offers\ncrypto projects and institutions the expertise, flexibility, and transparency\nthey need to succeed. We are passionate about supporting the future of digital\nassets.\n\nContact Us\n\n# What We Do\n\n* * *\n\nUsing quantitative methods and decades of trading experience to make markets\nmore efficient, we offer bespoke market making services and proprietary\nstrategies on retail and institutional exchanges.\n\n## Liquidity Provisioning\n\nWe use both our expertise in the digital asset marketplace and our years of\nquantitatively analyzed proprietary trading data to provide top-class\nliquidity solutions. Beyond trading tokens, we offer projects guidance on all\naspects of growing their market.\n\n## LP Arbitrage\n\nWe use our proprietary technology to efficiently and systematically identify\nand capitalize on inefficiencies across various markets. Our constantly\nimproving cross-exchange engine also improves liquidity in each market we\nparticipate in.\n\n## Treasury Management\n\nWe offer treasury management services for token issuers looking to liquidate\ntheir tokens without disrupting market stability. We assess your market and\ncurrent liquidity to determine the best way and time to sell, ensuring minimal\nimpact on your token's price movement.\n\n# Who We Are\n\n* * *\n\nWe are a team of engineers, analysts, and traders who are building the future\nof DeFi. We're dedicated to innovation, and fostering ideas in the digital\nasset marketplace. Our mission is to advance the way market making is done and\nprovide our services in a fair, transparent manner that benefits our clients.\n\nSee Jobs\n\n## Peter Sokolow\n\nChief Executive Officer\n\n## Noah Dahlman\n\nChief Technology Officer\n\n## Ken Stein\n\nChief Legal Officer\n\n## Minesh Makwana\n\nHead of Trading\n\nSee Jobs\n\n# Our Partners\n\n* * *\n\n# Get Updated\n\nGet regular updates about our business, products, and services. Unsubscribe at\nany time.\n\nFirst Name\n\nLast Name\n\nEmail\n\nSubmit\n\n# Get In Touch\n\nPlease contact us if you have any questions or queries and we will get back to\nyou\n\nFirst Name\n\nLast Name\n\nEmail\n\nMessage\n\nSubmit\n\n* * *\n\n",
    "links": "[{\"link\": \"https://system9.io/\", \"text\": \"\"}, {\"link\": \"https://system9.io/\", \"text\": \"\"}, {\"link\": \"https://system9.io/#products\", \"text\": \"Products\"}, {\"link\": \"https://system9.io/#company\", \"text\": \"Company\"}, {\"link\": \"https://system9.io/#partners\", \"text\": \"Partners\"}, {\"link\": \"https://system9.io/#contact\", \"text\": \"Contact\"}, {\"link\": \"https://system9.io/\", \"text\": \"\"}, {\"link\": \"https://system9.io/#contact\", \"text\": \"\"}, {\"link\": \"https://system9.io/jobs\", \"text\": \"\"}, {\"link\": \"https://system9.io/jobs\", \"text\": \"\"}]"
}