{
    "summary": "Skip to content\n\n  * Pluralsight\n  * Skills\n  * A Cloud Guru\n  * Flow\n  * Blog\n\nAn avatar icon Sign in\n\n  * A skills logo\n\nSign in to Skills\n\nThe Skills product logo icon\n\n  * A Cloud Guru small logo icon\n\nSign in to A Cloud Guru\n\nA Cloud Guru logo, color version\n\n  * Flow product logo\n\nSign in to Flow\n\nThe Flow product logo icon\n\nThe Pluralsight logo, color version\n\n  * Explore\n  * Software dev\n  * Cloud\n  * IT Ops\n  * Data\n  * Security\n  * Leadership\n\n  * A search magnifying glass icon\n\nA search magnifying glass icon\n\n  * Contact sales\n  * View plans\n\nClose Icon\n\nSign in Menu\n\n  *     * A skills logo\n\nSign in to Skills\n\nThe Skills product logo icon\n\n    * A Cloud Guru small logo icon\n\nSign in to A Cloud Guru\n\nA Cloud Guru logo, color version\n\n    * Flow product logo\n\nSign in to Flow\n\nThe Flow product logo icon\n\n  *     * Pluralsight\n    * Skills\n    * A Cloud Guru\n    * Flow\n    * Blog\n\nA search magnifying glass\n\n  * Explore\n  * Software dev\n  * Cloud\n  * IT Ops\n  * Data\n  * Security\n  * Leadership\n\n  * Contact sales\n  * View plans\n\n### Contact sales\n\nFirst Name*\n\nLast Name*\n\nEmail Address*\n\nCompany*\n\nJob Title*\n\nPhone*\n\nCountry* Select... United States Afghanistan Aland Islands Albania Algeria\nAmerican Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda\nArgentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain\nBangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia\nBonaire, Saint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet\nIsland Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria\nBurkina Faso Burundi Cambodia Cameroon Canada Cape Verde Cayman Islands\nCentral African Republic Chad Chile China Christmas Island Cocos (Keeling)\nIslands Colombia Comoros Congo Democratic Republic of the Congo Cook Islands\nCosta Rica Cote d'Ivoire Croatia Cuba Curacao Cyprus Czech Republic Denmark\nDjibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial\nGuinea Eritrea Estonia Ethiopia Falkland Islands (Malvinas) Faroe Islands Fiji\nFinland France French Guiana French Polynesia French Southern Territories\nGabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada\nGuadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard\nIsland and McDonald Islands Holy See (Vatican City State) Honduras Hong Kong\nHungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy\nJamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea Kosovo Kuwait\nKyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia\nLibyan Arab Jamahiriya Liechtenstein Lithuania Luxembourg Macao Republic of\nMacedonia Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands\nMartinique Mauritania Mauritius Mayotte Mexico Federated States of Micronesia\nRepublic of Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique\nMyanmar Namibia Nauru Nepal Netherlands Netherlands Antilles New Caledonia New\nZealand Nicaragua Niger Nigeria Niue Norfolk Island Northern Mariana Islands\nNorway Oman Pakistan Palau Palestinian Territory Panama Papua New Guinea\nParaguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Reunion\nRomania Russian Federation Rwanda Saint Barthelemy Saint Helena Saint Kitts\nand Nevis Saint Lucia Saint Martin Saint Pierre and Miquelon Saint Vincent and\nthe Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal\nSerbia Seychelles Sierra Leone Singapore Sint Maarten Slovakia Slovenia\nSolomon Islands Somalia South Africa South Georgia and the South Sandwich\nIslands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen\nSwaziland Sweden Switzerland Syria Taiwan Tajikistan United Republic of\nTanzania Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia\nTurkey Turkmenistan Turks and Caicos Islands Tuvalu Uganda Ukraine United Arab\nEmirates United Kingdom United States Minor Outlying Islands Uruguay\nUzbekistan Vanuatu Venezuela Viet Nam Virgin Islands, British Virgin Islands,\nU.S. Wallis and Futuna Yemen Zambia Zimbabwe\n\nHow many licenses will you need?* Select... 1 User 2 to 10 11 to 20 21 to 50\n51+\n\nBy filling out this form and clicking submit, you acknowledge our privacy\npolicy.\n\nSubmit\n\nThank you!\n\nClose button icon\n\n  1. Blog\n  2. Cloud\n\n# Blockchain cloud comparison: What is blockchain-as-a-service (BaaS)?\n\nWhat are blockchain and blockchain-as-a-service? We compare how AWS, Google\nCloud, Azure, IBM Cloud, and Oracle Cloud use blockchain technology. Read on!\n\nBy Scott Pletcher\n\nJun 08, 2023 • 8 Minute Read\n\n  * Cloud\n  * AWS\n  * azure\n\n* * *\n\nSubscribe to the newsletter\n\nWelcome to another installation of Cloud Provider Comparisons. In this series,\nwe take a look at the same cloud services across different cloud providers.\nWe'll look at the similarities, the differences, and anything else that might\nbe interesting. In this post, we're going to be digging into what the cloud\nproviders have to offer in the way of blockchain.\n\n## What is blockchain?\n\nTo understand blockchain, just know that a block is just some chunk of data.\nIt can be a financial transaction, an invoice, a bill of lading, most anything\nreally that can be stored digitally. That block also includes something else —\na hash from the block added to the chain right before it.\n\nWhat is a hash? Think of it as a mathematically calculated fingerprint that\nrepresents all the data in that block.\n\nEach block includes the fingerprint of the prior block, and it's this chaining\nof hashes that gives the blockchain its immutable properties. If someone were\nto go back and change a transaction in the chain, that would change the hash\nof that block and also all the subsequent hashes.\n\n## What is blockchain-as-service (BaaS)?\n\nBlockchain-as-a-service (or BaaS — though the \"BaaS\" acronym is also more\ncommonly used for \"backend as a service\") is a cloud-managed platform that\nallows people and organizations to more easily and quickly build, host, and\nmanage blockchain applications.\n\nWith blockchain-as-a-service, a third-party handles the backend and\ninfrastructure, lowering the barrier around blockchain adoption for\nindividuals and organizations.\n\n## The history of blockchain\n\nWhen you hear the word “blockchain,” you might think of bitcoin or\ncryptocurrency. For many people, that's the context in which they first heard\nthe term. But the concept of a blockchain predates all that.\n\nBack in 1982, David Chaum proposed a blockchain-like process in his PhD\ndissertation at the University of California, Berkeley.\n\nNearly a decade later, researchers at Bellcore published a paper on using a\nblockchain method to guarantee document timestamps. And they would go on to\ncreate a company called Surety (more on them in a second). It wasn't until\n2008 that a person or group of people, calling themselves Satoshi Nakamoto,\ncreated a blockchain concept that would go on to power Bitcoin.\n\nBack to Surety: Every week since 1995, Surety have been publishing the then-\ncurrent hash of every electronic record they have ever sealed in the Public\nNotices section of _The New York Times_. This taps into another strategy\nblockchains leverage, and that’s the fact that it is widely witnessed. The\nmore widely distributed a hash is, the more difficult it would be for someone\nto slyly change some block already in the chain. This concept ensures\nintegrity in public and consortium blockchains as all the participants have\ncopies of the current hash.\n\n## What applications use blockchain?\n\nToday, blockchains are used in a wide variety of applications, such as supply\nchain traceability, real estate transactions, retail loyalty rewards programs,\nand even digital voting.\n\n## How do cloud blockchain services compare?\n\nHow do the cloud providers stack up when it comes to blockchain? Pretty\ndifferently.\n\n### Google Cloud blockchain services\n\nAs of right now, Google Cloud Platform (GCP) does _not_ offer any blockchain\nservices. Of course, one could download and install a blockchain platform on\nsome VMs, but you're still going to have to manage it all.\n\n### Microsoft Azure blockchain services\n\nMicrosoft Azure exited the blockchain-as-a-service business in September 2021\nby retiring their Azure Blockchain Service product. Customers of that service\nare being directed to ConsenSys, a third party that provides Quorum\nblockchain-as-a-service on the Azure Cloud.\n\nThis doesn't mean that Microsoft Azure is completely turning its back on\nblockchain, though.\n\nMicrosoft has integrated blockchain technology into some new products that are\ncurrently in preview. A new ledger feature for the Azure SQL Database is built\nupon blockchain technology, enhancing record integrity and allowing customers\nto prove records haven't been tampered with.\n\nSimilarly, Microsoft has also introduced Azure Confidential Ledger for the\nsame purpose. Except with Confidential Ledger, your data is stored as objects\non your Azure storage account rather than in a SQL database.\n\n### AWS blockchain services\n\nAmazon Web Services (AWS) has by far the most comprehensive offering for those\nlooking to get on the blockchain train. If you're looking for a turnkey\nblockchain option, AWS offers Managed Blockchain. With the click of a few\nbuttons, customers can launch a node on the public Ethereum blockchain\nnetwork.\n\nCustomers can create or join private Hyperledger Fabric networks with just a\nfew clicks as well. These public nodes and private networks are fully managed\nso you don't have to mess with any of the details – you just pay by the hour.\n\nAWS also offers Amazon Quantum Ledger Database. This is a database geared\ntowards application developers who need to ensure absolute immutable data\nchange tracking. QLDB, as it's called for short, is comprised of two parts, a\nportion that stores the current state information and an append-only journal\nthat tracks each change to that current state database. As it's really just a\ndatabase, developers and applications can interact with it using SQL or the\nAPI. The blockchain ledger portion is handled behind the scenes.\n\nIf you're familiar with other databases, you'll notice that this ledger sounds\na lot like transaction logs or journaling. And that's because it's kind of the\nsame thing. The difference is that each entry in that journal is\ncryptographically bonded to the entry before it and after it. This makes it\neasy to verify and impossible to alter.\n\nAWS has landed some well-known names who use its blockchain products: Nestle,\nSony Music, The BMW Group, and Workday are some of the familiar names that\nhave put AWS’s blockchain products to work.\n\nAdditionally, AWS boasts over 70 verified blockchain solutions on its AWS\nMarketplace and claims to host at least 25% of all nodes on the Ethereum\nnetwork. But is AWS the only blockchain-as-a-service game in town? Not at all.\n\n### IBM Cloud\n\nIBM Cloud was one of the first significant cloud operators to get into the\nhosted blockchain game. As a result, it has one of the most mature offerings.\nIBM hosts blockchains for some mega corporations, such as Walmart, and\nshipping giant Maersk. Additionally, IBM has and continues to contribute\nheavily to Hyperledger Fabric, a very popular open-source blockchain framework\n– and the software behind their branded blockchain offerings.\n\n### Oracle Cloud\n\nThen there's Oracle. The Oracle Blockchain Platform is an implementation of\nHyperledger Fabric with some extra features built into it to make it work\nbetter with the Oracle Cloud. They currently host blockchains in the fashion,\ntransport, healthcare, and financial services industries. Both Oracle and IBM\nleverage their large enterprise customer relationships to promote their\nblockchain offerings – it’s just another tool in the toolbox for their\ncustomers.\n\n## Other blockchain services in the cloud\n\nBeyond the big cloud providers, there are dozens of cloud-native startups out\nthere looking to cash in on blockchain through industry-specific solutions or\nother unique value propositions. Because the use cases for blockchains are\nusually pretty long range, just be sure to consider carefully who you might\npartner with.\n\nSo that is the current scattered and varied cloud landscape for blockchain.\nWhile the public clouds like Azure and SAP Cloud may have stepped back from\nthe blockchain-as-a-service options, others are staying firm and continuing to\ninvest.\n\nAccording to Gartner's famed Hype Cycle, blockchain-as-a-service is currently\ndrudging through what Gartner calls “the trough of disillusionment.” Meaning,\nall those elevated expectations are being _hashed_ out, no pun intended.\n\n## Learn more about blockchain\n\nWant to learn more about blockchain? Continue your blockchain learning at ACG\nwith these courses and videos:\n\n  * Blockchain Explained\n  * Blockchain Essentials\n  * The Future of Tech: Blockchain\n  * AWS Service Spotlight: Amazon Managed Blockchain\n  * Azure This Week: Blockchain’s Role in Azure SQL Database Ledger\n\nAnd keep being awesome, cloud gurus!\n\nScott P.\n\nMore about this author\n\n  * ## Support\n\n    * Contact\n    * Help Center\n    * IP Allowlist\n    * Sitemap\n    * Download Pluralsight\n    * Skills Plans\n    * A Cloud Guru Plans\n    * Flow Plans\n  * ## Community\n\n    * Guides\n    * Teach\n    * Partner with Pluralsight\n    * Affiliate Partners\n    * Pluralsight One\n    * Authors\n  * ## Company\n\n    * About Us\n    * Careers\n    * Newsroom\n    * Resources\n  * ## Industries\n\n    * Education\n    * Financial Services (FSBI)\n    * Healthcare\n    * Insurance\n    * Non-Profit\n    * Public Sector\n  * ## Newsletter\n\nEmail Address:*\n\nI would like to receive emails from Pluralsight\n\nSubmit\n\nThank you!\n\n    * A facebook icon\n    *     *     *     * \n\n* * *\n\nPluralsight logo Copyright © 2004 - 2024 Pluralsight LLC. All rights reserved\n\n  * Terms of Use\n  * Privacy Notice\n  * Modern Slavery Statement\n\n",
    "links": "[{\"link\": \"https://www.pluralsight.com/\", \"text\": \"Pluralsight\"}, {\"link\": \"https://www.pluralsight.com/product/skills\", \"text\": \"Skills\"}, {\"link\": \"https://www.pluralsight.com/cloud-guru\", \"text\": \"A Cloud Guru\"}, {\"link\": \"https://www.pluralsight.com/product/flow\", \"text\": \"Flow\"}, {\"link\": \"https://www.pluralsight.com/\", \"text\": \"\"}, {\"link\": \"https://www.pluralsight.com/get-started\", \"text\": \"View plans\"}, {\"link\": \"https://www.pluralsight.com/\", \"text\": \"\\n\"}, {\"link\": \"https://www.pluralsight.com/\", \"text\": \"Pluralsight\"}, {\"link\": \"https://www.pluralsight.com/product/skills\", \"text\": \"Skills\"}, {\"link\": \"https://www.pluralsight.com/cloud-guru\", \"text\": \"A Cloud Guru\"}, {\"link\": \"https://www.pluralsight.com/product/flow\", \"text\": \"Flow\"}, {\"link\": \"https://www.pluralsight.com/get-started\", \"text\": \"View plans\"}, {\"link\": \"https://www.pluralsight.com/resources/blog\", \"text\": \"\"}, {\"link\": \"https://www.pluralsight.com/resources/blog/cloud\", \"text\": \"\"}, {\"link\": \"https://www.pluralsight.com/subscribe\", \"text\": \"\"}, {\"link\": \"https://www.pluralsight.com/resources/blog/cloud/what-is-google-cloud-platform-gcp\", \"text\": \"Google Cloud Platform (GCP)\"}, {\"link\": \"https://www.pluralsight.com/resources/blog/cloud/what-is-microsoft-azure\", \"text\": \"Microsoft Azure\"}, {\"link\": \"https://www.pluralsight.com/resources/blog/cloud/what-is-amazon-web-services-aws\", \"text\": \"Amazon Web Services (AWS)\"}, {\"link\": \"https://www.pluralsight.com/resources/blog/cloud/what-is-oracle-cloud-and-why-should-you-use-it\", \"text\": \"Oracle Cloud\"}, {\"link\": \"https://www.pluralsight.com/blog-contributors/scott-pletcher\", \"text\": \"More about this author\"}, {\"link\": \"https://www.pluralsight.com/contact\", \"text\": \"Contact\"}, {\"link\": \"https://www.pluralsight.com/product/downloads\", \"text\": \"Download Pluralsight\"}, {\"link\": \"https://www.pluralsight.com/pricing/skills\", \"text\": \"Skills Plans\"}, {\"link\": \"https://www.pluralsight.com/cloud-guru/pricing\", \"text\": \"A Cloud Guru Plans\"}, {\"link\": \"https://www.pluralsight.com/pricing/flow\", \"text\": \"Flow Plans\"}, {\"link\": \"https://www.pluralsight.com/teach\", \"text\": \"Teach\"}, {\"link\": \"https://www.pluralsight.com/partners\", \"text\": \"Partner with Pluralsight\"}, {\"link\": \"https://www.pluralsight.com/affiliate\", \"text\": \"Affiliate Partners\"}, {\"link\": \"https://www.pluralsight.com/authors\", \"text\": \"Authors\"}, {\"link\": \"https://www.pluralsight.com/about\", \"text\": \"About Us\"}, {\"link\": \"https://www.pluralsight.com/careers\", \"text\": \"Careers\"}, {\"link\": \"https://www.pluralsight.com/newsroom\", \"text\": \"Newsroom\"}, {\"link\": \"https://www.pluralsight.com/industries/public-sector/higher-education\", \"text\": \"Education\"}, {\"link\": \"https://www.pluralsight.com/industries/finance\", \"text\": \"Financial Services (FSBI)\"}, {\"link\": \"https://www.pluralsight.com/industries/healthcare\", \"text\": \"Healthcare\"}, {\"link\": \"https://www.pluralsight.com/industries/insurance\", \"text\": \"Insurance\"}, {\"link\": \"https://www.pluralsight.com/industries/government\", \"text\": \"Public Sector\"}]"
}