{
    "summary": "ToggleToggle\n\n  * PRODUCTS\n    *       *         *         * **Enterprise GenAI Platform**\n\n      *         *         * **GenAI Platform for Finance**\n\n      *         *         * **GenAI Platform for Manufacturing**\n\n      *         *         * **GenAI Platform for Automotive**\n\n    *       *         *         * **GenAI Platform for Hospitality**\n\n      *         *         * **GenAI Platform for Healthcare**\n\n      *         *         * **GenAI Platform for IT**\n\n      *         *         * **GenAI Platform for Logistics**\n\n  * SERVICES\n    * Generative AI\n      *         *           *           * **Generative AI Development**\n\n        *           *           * **Generative AI Integration Services**\n\n        *           *           * **Generative AI Consulting Company**\n\n        *           *           * **Hire Generative AI Engineers**\n\n      *         *           *           * **ChatGPT Developers**\n\n        *           *           * **Stable Diffusion Developers**\n\n        *           *           * **Adaptive AI Development Company**\n\n        *           *           * **Midjourney Developers**\n\n      *         *           *           * **Transformer Model Development**\n\n        *           *           * **ChatGPT Integration Service**\n\n        *           *           * **Large Language Model Development**\n\n        *           *           * **Hire Prompt Engineers**\n\n    * Artificial Intelligence & ML\n      *         *           *           * **AI Development**\n\n        *           *           * **AI Consulting**\n\n        *           *           * **Hire AI Engineers**\n\n        *           *           * **AI as a Service**\n\n      *         *           *           * **Hire Action Transformer Developers**\n\n        *           *           * **ML Model Engineering**\n\n        *           *           * **MLOps Consulting Services**\n\n        *           *           * **Enterprise AI Development**\n\n      *         *           *           * **Machine Learning Development**\n\n        *           *           * **ML and Data Science Consulting**\n\n        *           *           * **AI Chatbot Development Company**\n\n        *           *           * **Enterprise AI Chatbot Development Company**\n\n    * Data Engineering\n      *         *           *           * **Hire Data Scientist**\n\n        *           *           * **Data Analytics Services**\n\n        *           *           * **Data Annotation Services**\n\n        *           *           * **Big Data Consulting**\n\n    * Web3\n      *         *           *           * **Web3 Development**\n\n        *           *           * **State of Web3**\n\n        *           *           * **Rust Development**\n\n        *           *           * **Web3 Game Development**\n\n      *         *           *           * **Metaverse Development**\n\n        *           *           * **Metaverse Application**\n\n        *           *           * **Metaverse Gaming Space**\n\n        *           *           * **Metaverse Avatar Development**\n\n      *         *           *           * **NFT Marketplace Development**\n\n        *           *           * **NFT Marketplace Solution**\n\n        *           *           *         *           *           *     * Blockchain\n      *         *           *           * **Blockchain Development**\n\n        *           *           * **Blockchain Consulting**\n\n        *           *           * **Substrate Development**\n\n        *           *           * **Polygon Development**\n\n      *         *           *           * **Hyperledger Development**\n\n        *           *           * **Golang Development**\n\n        *           *           * **Cosmos Development**\n\n        *           *           * **Solana Development**\n\n      *         *           *           * **Tezos Development**\n\n        *           *           * **Stellar Development**\n\n        *           *           * **Smart Contract Audit**\n\n        *           *           * **Crypto Wallet Development Solution**\n\n    * Software Development\n      *         *           *           * **Software Development  **\n\n        *           *           * **SaaS Development**\n\n        *           *           * **Software Consulting**\n\n        *           *           * **UI/UX Design Service**\n\n      *         *           *           * **Enterprise Software Development**\n\n        *           *           * **Web Application Development**\n\n        *           *           * **Digital Transformation**\n\n        *     * Hire Developers\n      *         *           *           * **Hire ML Developers**\n\n        *           *           * **DevOps Engineers**\n\n        *           *           * **Offshore Engineers**\n\n        *           *           * **App Developer**\n\n      *         *           *           * **Hire Golang Developers**\n\n        *           *           * **Blockchain Developer**\n\n        *           *           * **Hire Dedicated Developers**\n\n        *           *           * **Hire Cosmos Developers**\n\n      *         *           *           * **Hire Stellar Developers**\n\n        *           *           * **Full Stack Developer**\n\n        *         *     * Internet of Things (IoT)\n      *         *           *           * **IoT Development**\n\n        *           *           * **Industrial IoT Solutions**\n\n        *           *           * **Firmware Development**\n\n        *           *           * **IoT Healthcare Software**\n\n      *         *           *           * **IoT Product Development**\n\n        *           *           * **Hardware Design**\n\n        *         *     * Metaverse\n      *         *           *           * **Metaverse Integration**\n\n        *           *           * **Metaverse 3D Space**\n\n        *           *           * **Metaverse Gaming Space**\n\n        *           *           * **Metaverse Social Media**\n\n      *         *           *           * **Metaverse Application**\n\n        *           *           * **Metaverse Decentralized**\n\n        *           *           * **Metaverse Development**\n\n        *     * Software Consulting\n      *         *           *           * **AI Consulting**\n\n        *           *           * **RPA Consulting**\n\n        *           *           * **Blockchain Consulting**\n\n        *           *           * **DevOps Consulting**\n\n      *         *           *           * **Covid-19 Technology Consulting**\n\n        *           *           * **Digital Risk Management**\n\n        *         *   * INDUSTRIES\n    *       *         *         * **Consumer Electronics**\n\n      *         *         * **Fintech**\n\n      *         *         * **Healthcare**\n\n      *         *         * **Insurance**\n\n      *         *         * **Logistics**\n\n    *       *         *         * **On-Demand App Development**\n\n      *         *         * **Manufacturing**\n\n      *         *         * **Retail**\n\n      *         *         * **Startup**\n\n      *         *         * **Travel**\n\n  * INSIGHTS\n  * WORK\n  * ABOUT\n  * CONTACT US\n\nSelect Page\n\n# A Beginner’s Guide to Blockchain as a Service\n\nTalk to our Consultant\n\nThe speed, breadth and depth of advances in technology today have heralded the\nFourth Industrial Revolution, which is by far the most extraordinary epoch in\nhuman history. The rate of technology disruption has pushed businesses and\norganizations to the razor’s edge, seldom leaving them with adequate time to\nnurture Information Technology (IT) skills in-house and build on-premises\ntechnology and platforms.\n\nEnter the Blockchain-as-a-service business model and cloud-based deployments.\nThough these business models are not a panacea for all business challenges,\nthey have succeeded in making IT transformation simpler and less risky for\norganizations whose core competencies remain in fields other than IT.\n\nThe emergence of Blockchain technology at such a juncture is no surprise, but\nwhile organizations are still grappling with questions about how to harness\nthe power of the distributed ledger to their advantage, a number of\nenterprises, as well as startup technology firms, have already buckled up to\noffer Blockchain as a Service (BaaS) to help ease the adoption journey. In\nthis article, we will discuss:\n\n  * What is Blockchain as a Service (BaaS)?\n  * Why Do Organizations Need Blockchain as a Service (BaaS)?\n  * How Does the BaaS Model Work?\n  * Cost of Self-Hosted Blockchains vs Cost of BaaS Offering\n  * How to Handle Security concerns Related to BaaS?\n  * Criteria for Selecting a Blockchain as a Service Partner\n  * The Pros and Cons of BaaS\n\n## **What is Blockchain as a Service (BaaS)?**\n\nBlockchain as a Service (BaaS)  is a type of blockchain service offering that\nallows business customers to use cloud-based solutions to develop, host and\nadopt their own blockchain applications, smart contracts and other relevant\nfunctions on the blockchain while the cloud-based IT partner or service\nprovider manages all the required tasks and activities to keep the\ninfrastructure up and running.\n\nThe emergence of Blockchain as a Service is a significant development and an\nessential milestone in the blockchain landscape, holding the promise to\naccelerate the adoption of the distributed ledger technology across\nbusinesses. Needless to say, the concept is based on and works on engagement\nprinciples similar to that of Software as a Service (SaaS).\n\n## **Why Do Organizations Need Blockchain as a Service (BaaS)?**\n\nIT organizations across many industries are increasingly exploring the\nstrategic advantages of adopting Blockchain technology. However, the inherent\ntechnical complexities, lack of domain expertise and the operational overhead\ncosts involved in developing and operating the Blockchain, and maintaining the\ninfrastructure often force key decision makers to go slow on adoption plans.\nHowever, BaaS is currently being viewed as a potentially viable solution to\nthis problem.\n\nChoosing the right Blockchain as a Service provider will give businesses the\naccess to skilled Blockchain developers, process and governance experts as\nwell as the entire cloud infrastructure for development and deployment,\nwithout having to worry about startup and overhead costs.\n\nAlso, a reputed BaaS partner in most cases is a rich source of practical\nexperience and wisdom, which can be leveraged to make the systems more secure.\nIt significantly limits the number of risks which one would have to deal with\nhad it been developed in-house.\n\n## **How Does the BaaS Model Work?**\n\nWhen an organization (customer) signs up for a Blockchain as a Service\ncontract with an IT partner, they essentially enter into an agreement whereby\nthe BaaS partner agrees to set up all the necessary Blockchain technology and\ninfrastructure for the customer for a service fee defined in the contract\nagreement.\n\nThe Blockchain as a Service partner or provider deploys the essential\nresources and leverages the required technology and infrastructure to set up\nand maintain Blockchain connected nodes on behalf of the customer.\n\nBased on the customer’s business requirements, the BaaS partner may configure\nthe Blockchain network on any distributed ledgers such as Ethereum, Bitcoin,\nHyperledger Fabric, R3 Corda, Quorum, Chain Core or BlockApps.\n\nFurthermore, the Blockchain as a Service partner assumes the responsibility of\nmaintaining all the critical Blockchain-related artifacts and keeping the\ninfrastructure up and running. BaaS contracts also include support activities\nsuch as bandwidth management, optimization of resources, incident management,\nsystem health monitoring, as well as proactive security surveillance such as\nprevention of hacking attempts.\n\nUsing a Blockchain as a Service model, customers can focus on their core\nbusinesses and competition strategies while counting on the BaaS partner to\nhandle the Blockchain infrastructure and its performance. Eventually, it\nempowers them to execute distributed-ledger workloads in environments that\ndemand an impeccable degree of fault tolerance.\n\n## **Cost of Self-Hosted Blockchains vs Cost of BaaS Offering**\n\nCost models for BaaS vary depending on several factors, but at any rate, a\nBlockchain application hosted on premises is far costlier than BaaS offered on\nthe cloud.\n\nIn the former model, the Total Cost of Ownership (TCO) for a Blockchain\napplication is significantly high due to the start-up costs (personnel,\ninfrastructure, hardware, software, licensing, consulting and so on),\noperational costs (management, monitoring, bandwidth expenses, cost per\ntransaction and so on), and retirement costs (expenses related to archiving,\ndecommissioning of server racks and so on).\n\nThe cost for developing and implementing a single Blockchain smart contract\nunder this model can run up to several hundred thousand dollars.\n\nOn the other hand, a Blockchain application hosted in the cloud as part of a\nBlockchain as a service offering can be purchased for as low as $0.29 USD per\nallocated CPU hour (IBM Blockchain Platform for IBM Cloud). It is also\ncommonly referred to as a pay as you go, pricing model, in which the customer\nonly pays for the units of service used.\n\nNonetheless, the actual costs in this model depend on additional factors such\nas, but not limited to, transaction rate, the number of channels used, the\npayload size on the transactions, and the maximum number of concurrent\ntransactions.\n\nSimilarly, the pricing for Amazon AWS Managed Blockchain service is based on\nfactors such as network membership, peer nodes, peer node storage, data\nwritten to the network, and data transfer.\n\nThe costs associated are included in the user’s hourly network membership\nrate, which is billed per second, starting at a total production network\nhourly rate of $1.93 USD per network member. It includes the network member\ncost, peer node cost, peer node storage cost, and data written cost.\n\nLikewise, Microsoft offers a tiered pricing model for its Azure Blockchain\nservice. Each tier has an hourly rate based on provisioned transaction and\nvalidator nodes and provisioned storage in GB per month for a member.\n\nThe cost involved in most of the BaaS offerings primarily depends on the units\nof service consumed. Of course, when you partner with a third-party to\nconfigure your IBM, AWS or Azure Blockchain application, additional costs for\nconsultation, solution development and any other support services will have to\nbe taken into account based on your service contract agreement.\n\n## Get unified blockchain solutions for your business needs\n\n **LeewayHertz Blockchain Development Services**\n\nContact Us\n\n## **How to Handle Security Concerns Related to BaaS?**\n\nFor enterprises exploring Blockchain for its increased security, the very idea\nof keeping data transactions on a public ledger is a big turn off. It is all\nthe more critical in the wake of stricter data privacy and protection\nregulations in countries such as the US and the European region. The positive\naspect of the entire scheme of things, however, is that Blockchain is\ngenerally seen as a step forward in the right direction.\n\nNonetheless, as elsewhere in the IT world, security is not an inherent\ncharacteristic. The distributed ledger technology uses public key encryption,\nhashing, digital signatures, and several other mechanisms to secure data and\ntransactions. However, most of these become vulnerable when not administered\ncorrectly.\n\nGlitches in securing a Blockchain or simple bugs in the platforms may cause\nserious disruption and lead to unforeseen situations, thus putting the entire\nsystem at risk. As such, before signing a contract, it is essential to\nthoroughly evaluate the BaaS vendor and assess the risks inherent in enlisting\ntheir services.\n\nEven before going to the market with the requirements, it would be worthwhile\nfor the IT department to clearly define the parameters and expectations from\nthe services, including assurances and guarantees that might go into the\ncontract.\n\n## **Criteria for Selecting a Blockchain as a Service Partner**\n\nA lot of deliberations and evaluations go into the process of selecting a\nbusiness vendor and when it comes to BaaS, this is going to be all the more\nrigorous because of the lack of readily available guidelines and best\npractices in the market. While the list of criteria can be endless, here are\nsome broad pointers to consider when selecting a BaaS partner.\n\n\n\n  * **Prior experience in setting up Blockchain infrastructure/Market Credential**  \nAlways ensure that the BaaS partner has proven experience in developing and\ndeploying Blockchain technology on a scale and environment similar to the one\nyou are planning to execute. If possible, ask for credentials or\nrecommendations provided by previous customers.\n\n  * **Commitment to Quality**  \nQuality is paramount in any enterprise application or software implementation\nproject. Blockchain is no different. Make it a point to probe the vendor’s\ncommitment to quality, process and standards.\n\n  * **Security Assurance**  \nLook for potential gaps in security assurance in the proposed implementation\nplan. It is very critical as a minor bug may lead to serious repercussions.\nYou must plan for the most robust output when it comes to distributed ledgers.\n\n  * **Choice of Operating Systems**  \nEvaluate the vendor’s experience in deploying cloud-based solutions for\noperating systems similar to that of your organization. You also need to\nensure that the new Blockchain infrastructure integrates seamlessly with your\nlegacy systems.\n\n  * **Ease of Use**  \nMake sure that the proposed Blockchain enabled systems and processes are user-\nfriendly and easy to adopt. After all, you do not want a system that your\nemployees find difficult to use or navigate, which in turn could affect\nadoption rates and negatively impact business results.\n\n  * **Pricing and Support**  \nFinally, you only want to pay based on the overall value proposition delivered\nby the BaaS partner. Carefully analyze the pricing options and post-deployment\nsupport options and modalities. Pay only for the option that provides the most\nvalue for your organization.\n\n## **The Pros and Cons of BaaS**\n\nLike any other business or service offering, potential customers would always\nwant to analyze the opportunities and threats associated with Blockchain as a\nService before signing up with a service partner. Here are some of the\npointers based on which you may draw some perspectives of your own.\n\n  * **Cost Savings**  \nMore often than not, businesses look for value beyond cost savings when they\nagree to partner with an IT service provider. The same also holds true for\nBaaS. However, the cost and effort advantage, in this case, is far more\noverwhelming to be second-grade by anything else.Outsourcing the tasks related\nto Blockchain implementation, operations and maintenance to a BaaS partner can\nhelp businesses save cost and effort involved in recruiting developers,\nmaintaining the headcount and managing the team as well as expenses related to\nsoftware, platforms and infrastructure.\n\n  * **Ease of Use**  \nBaaS providers often provide customizable templates and plug and play modules\nthat can be set up within a short time frame by users with essential know-how\nof programming. It helps organizations circumvent the entire learning curve\nand investments involved in the research and planning stage.Hence, instead of\nbuilding their architecture from the ground up, businesses can simply leverage\nthe ready-made platforms and templates provided by their Blockchain as a\nService partner for integration with existing systems and applications.\n\n  * **Focus on Customization**  \nSince BaaS allows businesses to use ready-made platforms and templates, the\nin-house development team can primarily focus on their own businesses\nrequirements and ensure the Blockchain service complements their needs. Once\nthe Blockchain’s infrastructure is set-up, the BaaS partner maintains it,\nusually with bandwidth management, resource allocation, hosting and security\nsurveillance.\n\n  * **Staff and Resource Optimization**  \nLimited on-premises IT means limited physical overhead in terms of equipment\nspace, power and cooling. It directly translates to reductions in staffing and\nfirefighting instances. This allows the organization’s IT staff to focus on\ntheir core business and strengths and enables employees to participate in more\ncritical and value-adding projects for the business.\n\n  * **Limited In-depth Knowledge**  \nBlockchain is still an emerging technology and many of the organizations are\nyet to be equipped with an in-depth understanding of how the technology works.\nIn this scenario, an implementation decision made with half-baked knowledge\nmay put existing business processes at a significant risk of failure and\nwasted investment.\n\n  * **Lack of Visibility and Control**  \nIn most of the cloud-based and plug and play BaaS models, the infrastructure,\nresources and the BaaS provider owns technical know-how. It may lead to\ncommunication breakdowns and lack of understanding or limited visibility into\nthe actual situation on the ground when technical issues arise.In times of\ncritical events such as a service breakdown or external sabotage, the customer\nwill have to depend on the information provided by the BaaS partner entirely.\nSometimes, such instances may lead to mistrust between the two parties.\n\n  * **Data Compliance Challenges**  \nBlockchain operates on the principle of dispersing information across a global\nnetwork. Now, it has the potential to open up a pandora’s box with regards to\nregulation and compliance, especially when data is shared across geographies\nor the main servers of the BaaS provider are hosted in third-party countries\nor in zones which are under economic sanctions.\n\n  * **Business Continuity**  \nMost service agreements are executed based on the assumption that the service\nprovider or partner will be in business and would be in a position to support\nthe business with the service as per the terms of the Service Level Agreements\nfor as long as it is required or at least for the duration of the\ncontract.However, in today’s dynamic business environment, it is not easy to\nassume for sure that the provider will stay in business. The same holds true\nfor BaaS. If the service provider goes bankrupt within a few years of the\nBlockchain implementation or undergoes a merger with another company, then the\nchances of service disruptions may increase manifold.\n\nBlockchain as a Service is a promising offering that can help your\norganization seize competitive advantage and make your business future-ready,\nwithout having to make significant investments in research, planning,\nresources and infrastructure. It also provides you with an opportunity to\nassume the role of a leader and pioneer among your peers in the industry. With\nthe risks managed proactively, a trusted BaaS partner can help you take the\nnext big technology leap.\n\n_To make your business processes more robust, efficient, and secure with the\nBlockchain,contact our experts and they will assist you through the entire\nprocess._\n\n#### Webinar Details\n\n#### Author’s Bio\n\nAkash Takyar\n\nCEO LeewayHertz\n\nAkash Takyar is the founder and CEO at LeewayHertz. The experience of building\nover 100+ platforms for startups and enterprises allows Akash to rapidly\narchitect and design solutions that are scalable and beautiful.  \nAkash's ability to build enterprise-grade technology solutions has attracted\nover 30 Fortune 500 companies, including Siemens, 3M, P&G and Hershey’s. Akash\nis an early adopter of new technology, a passionate technology enthusiast, and\nan investor in AI and IoT startups.\n\nWrite to Akash\n\n## Start a conversation by filling the form\n\nOnce you let us know your requirement, our technical expert will schedule a\ncall and discuss your idea in detail post sign of an NDA.  \n**All information will be kept confidential.**\n\nSend me the signed Non-Disclosure Agreement (NDA )\n\n## **Insights**\n\n## AI in decision making: Navigating the new frontier of smart business\ndecisions\n\nAI in decision-making marks a significant breakthrough, surpassing the\nconfines of human cognition and expertise.\n\nread more\n\n## AI in wealth management: Redefining financial planning\n\nAI in wealth management allows wealth managers to make informed investment\ndecisions and respond to market changes rapidly.\n\nread more\n\n## AI in construction: Innovating for safety, efficiency, and sustainability\n\nIn construction, AI-powered machinery and robotics perform tasks with\nprecision while ensuring worker safety and productivity through real-time\nmonitoring.\n\nread more\n\nShow all Insights\n\n#### LEEWAYHERTZ\n\n  * About Us\n  * Global AI Club\n  * Careers\n  * Case Studies\n  * Work\n  * Community\n\n#### PORTFOLIO\n\n  * TraceRx\n  * ESPN\n  * Filecoin\n  * Lottery of People\n  * Chrysallis.AI\n  * ZBrain\n\n#### SERVICES\n\n  * AI Development\n  * AI Consulting\n  * Web3\n  * Blockchain\n  * Software Development\n  * Hire AI Developers\n\n#### Generative AI\n\n  * Generative AI Development\n  * Generative AI Consulting\n  * Generative AI Integration\n  * LLM Development\n  * Prompt Engineering\n  * ChatGPT Developers\n\n#### INDUSTRIES\n\n  * Consumer Electronics\n  * Financial Markets\n  * Healthcare\n  * Logistics\n  * Manufacturing\n  * Startup\n\n#### INSIGHTS\n\n  * AI Use Cases\n  * Conversational AI\n  * Private LLM\n  * AI in Finance\n  * AI Document Processing\n  * AI Chatbot\n\n#### CONTACT US\n\nGet In Touch  \n415-301-2880  \ninfo@leewayhertz.com  \njobs@leewayhertz.com\n\n\n\n\n\n\n\n\n\n\n\nSitemap\n\n  *   \n\n  *   \n\n  *   \n\n  *   \n\n©2024 LeewayHertz. All Rights Reserved.\n\n  \n\nThis website uses cookies to enhance site navigation and improve\nfunctionality, analyze site usage, and assist in our marketing and advertising\nefforts. Read More  \n\n  \n\nThis website uses cookies to enhance site navigation and improve\nfunctionality, analyze site usage, and assist in our marketing and advertising\nefforts. Please click \"I accept cookies\" to let us know you're okay with our\nuse of all cookies. For more information please see the cookies section of our\nPrivacy Policy. Read More  \n\nI ACCEPT COOKIES\n\nPrivacy & Cookies Policy\n\nClose\n\n#### Privacy Overview\n\nThis website uses cookies to improve your experience while you navigate\nthrough the website. Out of these cookies, the cookies that are categorized as\nnecessary are stored on your browser as they are essential for the working of\nbasic functionalities of the website. We also use third-party cookies that\nhelp us analyze and understand how you use this website. These cookies will be\nstored in your browser only with your consent. You also have the option to\nopt-out of these cookies. But opting out of some of these cookies may have an\neffect on your browsing experience.\n\nNecessary\n\nNecessary\n\nAlways Enabled\n\nNecessary cookies are absolutely essential for the website to function\nproperly. This category only includes cookies that ensures basic\nfunctionalities and security features of the website. These cookies do not\nstore any personal information.\n\nNon-necessary\n\nNon-necessary\n\nAny cookies that may not be particularly necessary for the website to function\nand is used specifically to collect user personal data via analytics, ads,\nother embedded contents are termed as non-necessary cookies. It is mandatory\nto procure user consent prior to running these cookies on your website.\n\nSAVE & ACCEPT\n\n×\n\nFollow Us\n\n  *   *   *   *   *   * \n\n",
    "links": "[{\"link\": \"https://www.leewayhertz.com/guide-to-blockchain-as-a-service/#what\", \"text\": \"What is Blockchain as a Service (BaaS)?\"}, {\"link\": \"https://www.leewayhertz.com/guide-to-blockchain-as-a-service/#why\", \"text\": \"Why Do Organizations Need Blockchain as a Service (BaaS)?\"}, {\"link\": \"https://www.leewayhertz.com/guide-to-blockchain-as-a-service/#how\", \"text\": \"How Does the BaaS Model Work?\"}, {\"link\": \"https://www.leewayhertz.com/guide-to-blockchain-as-a-service/#cost\", \"text\": \"Cost of Self-Hosted Blockchains vs Cost of BaaS Offering\"}, {\"link\": \"https://www.leewayhertz.com/guide-to-blockchain-as-a-service/#handle\", \"text\": \"How to Handle Security concerns Related to BaaS?\"}, {\"link\": \"https://www.leewayhertz.com/guide-to-blockchain-as-a-service/#partner\", \"text\": \"Criteria for Selecting a Blockchain as a Service Partner\"}, {\"link\": \"https://www.leewayhertz.com/guide-to-blockchain-as-a-service/#pros\", \"text\": \"The Pros and Cons of BaaS\"}]"
}