{
    "summary": "  * Investing \n    * Stocks \n    * Bonds \n    * ETFs \n    * Options and Derivatives \n    * Commodities \n    * Trading \n    * FinTech and Automated Investing \n    * Brokers \n    * Fundamental Analysis \n    * Technical Analysis \n    * Markets \n    * View All \n  * Simulator \n    * Login / Portfolio \n    * Trade \n    * Research \n    * My Games \n    * Leaderboard \n  * Banking \n    * Savings Accounts \n    * Certificates of Deposit (CDs) \n    * Money Market Accounts \n    * Checking Accounts \n    * View All \n  * Personal Finance \n    * Budgeting and Saving \n    * Personal Loans \n    * Insurance \n    * Mortgages \n    * Credit and Debt \n    * Student Loans \n    * Taxes \n    * Credit Cards \n    * Financial Literacy \n    * Retirement \n    * View All \n  * News \n    * Markets \n    * Companies \n    * Earnings \n    * CD Rates \n    * Mortgage Rates \n    * Economy \n    * Government \n    * Crypto \n    * ETFs \n    * Personal Finance \n    * View All \n  * Reviews \n    * Best Online Brokers \n    * Best Savings Rates \n    * Best CD Rates \n    * Best Life Insurance \n    * Best Personal Loans \n    * Best Mortgage Rates \n    * Best Money Market Accounts \n    * Best Auto Loan Rates \n    * Best Credit Repair Companies \n    * Best Credit Cards \n    * View All \n  * Academy \n    * Investing for Beginners \n    * Trading for Beginners \n    * Become a Day Trader \n    * Technical Analysis \n    * All Investing Courses \n    * All Trading Courses \n    * View All \n\nLive\n\n  * Search Search\n\nPlease fill out this field.\n\nSearch Search\n\nPlease fill out this field.\n\n  * Investing \n\nInvesting\n\n    * Stocks \n    * Bonds \n    * ETFs \n    * Options and Derivatives \n    * Commodities \n    * Trading \n    * FinTech and Automated Investing \n    * Brokers \n    * Fundamental Analysis \n    * Technical Analysis \n    * Markets \n    * View All \n\n  * Simulator \n\nSimulator\n\n    * Login / Portfolio \n    * Trade \n    * Research \n    * My Games \n    * Leaderboard \n\n  * Banking \n\nBanking\n\n    * Savings Accounts \n    * Certificates of Deposit (CDs) \n    * Money Market Accounts \n    * Checking Accounts \n    * View All \n\n  * Personal Finance \n\nPersonal Finance\n\n    * Budgeting and Saving \n    * Personal Loans \n    * Insurance \n    * Mortgages \n    * Credit and Debt \n    * Student Loans \n    * Taxes \n    * Credit Cards \n    * Financial Literacy \n    * Retirement \n    * View All \n\n  * News \n\nNews\n\n    * Markets \n    * Companies \n    * Earnings \n    * CD Rates \n    * Mortgage Rates \n    * Economy \n    * Government \n    * Crypto \n    * ETFs \n    * Personal Finance \n    * View All \n\n  * Reviews \n\nReviews\n\n    * Best Online Brokers \n    * Best Savings Rates \n    * Best CD Rates \n    * Best Life Insurance \n    * Best Personal Loans \n    * Best Mortgage Rates \n    * Best Money Market Accounts \n    * Best Auto Loan Rates \n    * Best Credit Repair Companies \n    * Best Credit Cards \n    * View All \n\n  * Academy \n\nAcademy\n\n    * Investing for Beginners \n    * Trading for Beginners \n    * Become a Day Trader \n    * Technical Analysis \n    * All Investing Courses \n    * All Trading Courses \n    * View All \n\n  * Economy \n\nEconomy\n\n    * Government and Policy \n    * Monetary Policy \n    * Fiscal Policy \n    * Economics \n    * View All \n\n  * Financial Terms \n  * Newsletter \n  * About Us \n\nFollow Us\n\n  *   *   *   *   *   * \n\n  * Cryptocurrency\n  * Blockchain\n\n#  Blockchain-as-a-Service (BaaS) Meaning and Major Players\n\nBy Jake Frankenfield\n\nUpdated March 31, 2021\n\nReviewed by Julius Mansa\n\nTrending Videos\n\n##  What Is Blockchain-as-a-Service (BaaS)?\n\nBlockchain-as-a-service (BaaS) is the third-party creation and management of\ncloud-based networks for companies in the business of building blockchain\napplications. These third-party services are a relatively new development in\nthe growing field of blockchain technology. The application of blockchain\ntechnology has moved well beyond its best-known use in cryptocurrency\ntransactions and has broadened to address secure transactions of all kinds. As\na result, there is a demand for hosting services.\n\n###  Key Takeaways\n\n  * Blockchain-as-a-service (BaaS) refers to third-party cloud-based infrastructure and management for companies building and operating blockchain apps.\n  * BaaS functions like a sort of web host, running the back-end operation for a block-chain based app or platform.\n  * BaaS may be the catalyst that leads to the widespread adoption of blockchain technology.\n\n##  Understanding Blockchain-as-a-Service (BaaS)\n\nBaaS is based on the software as a service (SaaS) model and works in a similar\nfashion. It allows customers to leverage cloud-based solutions to build, host,\nand operate their own blockchain apps and related functions on the blockchain.\nAt the same time, the cloud-based service provider keeps the infrastructure\nagile and operational.\n\nAs a development in the greater blockchain ecosystem, BaaS is seen as boosting\nblockchain adoption across businesses.\n\nMajor players in the BaaS space include:\n\n  * Microsoft partnered with ConsenSys to introduce Ethereum blockchain-as-a-service on Microsoft Azure in 2015.1\n  * Amazon has introduced Amazon Managed Blockchain, a service that \"makes it easy to create and manage scalable blockchain networks\" using open-source frameworks, including Ethereum and Hyperledger Fabric.2\n  * R3, a consortium of global financial institutions that produced a distributed financial ledger called Corda.3\n  * PayStand, which specializes in sending and receiving payments between companies.4\n\nConsumers and businesses are increasingly willing to adapt to blockchain\ntechnology. However, the technical complexities and operational overhead\ninvolved in creating, configuring, and operating a blockchain and maintaining\nits infrastructure often act as a barrier.\n\nBaaS offers an external service provider to set up all the necessary\nblockchain technology and infrastructure for a fee. Once created, the provider\ncontinues to handle the complex back-end operations for the client.\n\nThe BaaS operator typically offers support activities, such as bandwidth\nmanagement, suitable allocation of resources, hosting requirements, and data\nsecurity features. The BaaS operator frees the client to focus on the core\njob: the functionality of the blockchain.\n\n##  Example of Blockchain-as-a-Service (BaaS)\n\nBelow is a graphic demonstrating the working model of Blockchain-as-a-Service\nHyperledger Cello, a BaaS-like blockchain module toolkit and utility system\nunder the Hyperledger project.\n\nImage by Julie Bang © Investopedia 2020\n\nIn fact, a BaaS’ provider's role is similar to that of a web hosting provider.\nThe website creators create and run all the website content on their own\npersonal computers. They may hire support staff or sign up with an external\nhosting provider like Amazon Web Services or HostGator. These third-party\ncompanies take care of the infrastructure and maintenance issues.\n\nBaaS may be the catalyst that leads to a wider and deeper penetration of\nblockchain technology across various industry sectors and businesses. Instead\nof creating and running their own blockchains, a business, large or small, can\nnow simply outsource the technically complex work and focus on its core\nactivities.\n\nArticle Sources\n\nInvestopedia requires writers to use primary sources to support their work.\nThese include white papers, government data, original reporting, and\ninterviews with industry experts. We also reference original research from\nother reputable publishers where appropriate. You can learn more about the\nstandards we follow in producing accurate, unbiased content in our editorial\npolicy.\n\n  1. Microsoft Azure. \"Ethereum Blockchain As a Service Now On Azure.\" Accessed Sept. 15, 2020.\n\n  2. Amazon Web Service. \"Announcing General Availability of Amazon Managed Blockchain.\" Accessed Sept. 15, 2020.\n\n  3. R3. \"About R3.\" Accessed Sept. 15, 2020.\n\n  4. PayStand. \"B2B Payments Reimagined.\" Accessed Sept. 15, 2020.\n\nCompare Accounts\n\nAdvertiser Disclosure\n\n×\n\nThe offers that appear in this table are from partnerships from which\nInvestopedia receives compensation. This compensation may impact how and where\nlistings appear. Investopedia does not include all offers available in the\nmarketplace.\n\nRelated Terms\n\nWhat is Cloud Computing? Pros and Cons of Different Types of Services\n\nCloud computing is a model for delivering information technology services\nwhere resources are retrieved from the internet through web-based tools.\n\nmore\n\nEnterprise Ethereum Alliance (EEA): Meaning, Examples, and Membership\n\nThe Enterprise Ethereum Alliance brings together start-ups and Fortune 500\ncompanies to work on Ethereum as an enterprise-grade technology.\n\nmore\n\nHyperledger Burrow: What It Was and How It Worked\n\nHyperledger Burrow was an open-source blockchain framework that handled\ntransactions and executed smart contracts on a permissioned virtual machine.\n\nmore\n\nHyperledger Fabric: Definition, Example, Risks and 2.0 Version\n\nHyperledger Fabric is a platform for building various blockchain-based\nproducts, solutions, and applications for business use.\n\nmore\n\nHyperledger: Open-Source Blockchain Framework and Standards\n\nHyperledger is an open-source umbrella project that offers tools for\ndeveloping and using blockchain systems and applications across industry\nsectors.\n\nmore\n\nHyperledger Iroha: What It Is, How It Works\n\nHyperledger Iroha is a business blockchain framework designed for\ninfrastructure projects that need distributed ledger technology.\n\nmore\n\nRelated Articles\n\nPublic, Private, Permissioned Blockchains Compared\n\nWhat is Cloud Computing? Pros and Cons of Different Types of Services\n\nAll About Amazon's New Blockchain Service\n\nPublic vs Private Blockchains: Challenges and Gaps\n\nBlockchain to Catalyze a Second-Wave API Economy\n\nNasdaq CEO Adena Friedman on the Future of Stock Exchanges\n\nPartner Links\n\n  *   *   *   *   * \n\n  * About Us\n  * Terms of Service\n  * Dictionary\n  * Editorial Policy\n  * Advertise\n  * News\n  * Privacy Policy\n  * Contact Us\n  * Careers\n  * EU Privacy\n\n  * #\n  * A\n  * B\n  * C\n  * D\n  * E\n  * F\n  * G\n  * H\n  * I\n  * J\n  * K\n  * L\n  * M\n  * N\n  * O\n  * P\n  * Q\n  * R\n  * S\n  * T\n  * U\n  * V\n  * W\n  * X\n  * Y\n  * Z\n\nInvestopedia is part of the Dotdash Meredith publishing family.\n\nPlease review our updated Terms of Service.\n\nWhen you visit the site, Dotdash Meredith and its partners may store or\nretrieve information on your browser, mostly in the form of cookies. Cookies\ncollect information about your preferences and your devices and are used to\nmake the site work as you expect it to, to understand how you interact with\nthe site, and to show advertisements that are targeted to your interests. You\ncan find out more about our use, change your default settings, and withdraw\nyour consent at any time with effect for the future by visiting Cookies\nSettings, which can also be found in the footer of the site.\n\nCookies Settings Reject All Accept All\n\n",
    "links": "[{\"link\": \"https://www.investopedia.com/\", \"text\": \"\"}, {\"link\": \"https://www.investopedia.com/\", \"text\": \"\"}, {\"link\": \"https://www.investopedia.com/investopedia-newsletter-opt-in-7095821\", \"text\": \"\"}, {\"link\": \"https://privacy.truste.com/privacy-seal/validation?rid=f8e1238d-6371-460f-8ea0-1b8cad9e9c4b\", \"text\": \"\"}, {\"link\": \"https://www.investopedia.com/about-us-5093223\", \"text\": \"About Us\"}, {\"link\": \"https://www.investopedia.com/financial-term-dictionary-4769738\", \"text\": \"Dictionary\"}, {\"link\": \"https://www.investopedia.com/legal-4768893#editorial-policy\", \"text\": \"Editorial Policy\"}, {\"link\": \"https://www.investopedia.com/news-4427706\", \"text\": \"News\"}]"
}