{
    "summary": "__ CIO __ Search the TechTarget Network __\n\nLogin Register\n\nExplore the Network\n\n  * TechTarget Network\n  * Cloud Computing\n  * Mobile Computing\n  * Data Center\n  * Sustainability and ESG\n\n  * CIO\n\n  *     * Apps, Infrastructure and Operations\n    * CIO Strategy\n    * Digital Transformation\n    * Risk Management & Governance\n\nOther Content\n\n    * News\n    * Features\n    * Tips\n    * Webinars\n    * 2023 IT Salary Survey Results\n    * More __\n\n      * Answers\n      * Conference Guides\n      * Definitions\n      * Opinions\n      * Podcasts\n      * Quizzes\n      * Tech Accelerators\n      * Tutorials\n      * Videos\n      * Sponsored Communities\n\n  * Follow:\n  * __\n  * __\n  * __\n  * __\n  * __\n\n  * Home\n  * Digital transformation\n\n__ Tech Accelerator Blockchain for businesses: The ultimate enterprise guide\n\nPrev Next __7 challenges with blockchain adoption and how to avoid them __Top\n9 blockchain platforms to consider in 2024\n\n__Download this guide 1\n\nFeature\n\n# 8 blockchain-as-a-service providers to have on your radar\n\n## You don't have to build your blockchain project from the ground up. These\ncloud-based service providers can provide the necessary infrastructure,\nnetworking and development tools.\n\n  * Share this item with your network:\n  * __\n  * __\n  * __\n  * __\n  * __\n\n  * __\n  * __\n  * __\n    * __\n    * __\n    * __\n    * __\n\nBy\n\n  * Christine Campbell, The Alpha Content Company\n  * Tony Kontzer\n\nPublished: 29 Jun 2023\n\nImagine if, 20 or even 30 years ago, companies could have realistically\nadopted cloud-based ERP. Packaged, server-based ERP software might never have\nbeen a thing -- and small organizations might have had access to the same\ntools as their large competitors.\n\nWell, it's 2023, and enterprises looking to adopt another rapidly growing\ntechnology, blockchain, have that option. Thanks to the maturation of cloud\ncomputing and a burgeoning marketplace of blockchain as a service (BaaS)\nproviders, organizations can adopt blockchain technologies without having to\ninvest in the underlying infrastructure.\n\n## __What is blockchain as a service?\n\nBaaS is a type of third-party managed service that provides a managed\nblockchain and its supporting network and development tools.\n\n\"With BaaS, you don't have to worry about the bottom parts of the stack,\" said\nJames Wester, director, cryptocurrency and co-head of payments at Javelin\nStrategy & Research. \"You don't have to worry about the protocols -- you're\njust able to build applications across a blockchain network.\"\n\nNumerous industries have already proved the value of BaaS services, including\nfinancial services and telecommunications.\n\nRonak Doshi\n\nBlockchain represents a potentially transformative approach to data for any\nindustry, with all the data contributed by the members of a complex supply\nchain or value chain verified, secure and available to all entities\nparticipating in the blockchain. But as with many new technologies, the\ncomplexity and expense of creating, operating and maintaining a blockchain's\nunderlying infrastructure have proved to be a significant barrier to companies\nlooking to dip their toes in the blockchain waters.\n\nThis article is part of\n\n### __Blockchain for businesses: The ultimate enterprise guide\n\n  * Which also includes:\n  * Top 10 benefits of blockchain for business\n  * What are the 4 different types of blockchain technology?\n  * 7 must-have blockchain developer skills\n\n__Download 1\n\nDownload this entire guide for FREE now!\n\n\"One of the challenges for enterprise blockchain adoption is the ecosystem\nreadiness to make it 'easy to build' and 'easy to buy' blockchain\ntechnologies,\" said Ronak Doshi, a partner at Everest Group.\n\n## __Next stop: Blockchain\n\nThat's where blockchain-as-a-service companies come into play. BaaS gives\norganizations a quicker and less complex path to experimenting with\nblockchain, and it also provides a platform for building and running\nblockchain applications, which act on all of the data flowing through a value\nchain. Wester said this is critical because blockchain participants can apply\nanalytics to the entire ecosystem's data, rather than just their own data,\nthereby learning things they might not have otherwise.\n\nProviding enterprises with the ability to work with blockchain technologies\nwithout the upfront infrastructure investments means the BaaS market could\nfurther blockchain adoption in much the same way SaaS companies spurred cloud\nadoption in the past decade.\n\n\"BaaS services will help spur mainstream enterprise adoption of blockchain,\"\nsaid Avivah Litan, an analyst at Gartner, via email.\n\nAvivah Litan\n\nHow much adoption BaaS will foster remains to be seen, but Gartner's 2018\n\"Blockchain-Based Transformation\" report predicted blockchain will add $360\nbillion in value to the global economy by 2026, and a whopping $3.1 trillion\nby 2030. Whether the market ultimately bears that out, it's clear that BaaS\nproviders play an important role in the market's development. In its \"Hype\nCycle for Blockchain and Web3, 2022,\" Gartner characterized enhanced BaaS as\nbeing on the upswing and likely to peak in two to five years. Litan said\nenhanced BaaS is a new generation of BaaS providers that focus on the data\nexchange needs of specific industries.\n\nGiven that most enterprises will be drawn to the technology by the idea of\nrunning analytics apps on top of a blockchain, there is a certain set of core\nfeatures they will want to look for, and which most, if not all, BaaS\nproviders will offer. These include the following:\n\n  * Platform architecture management.\n  * Modular, preconfigured networks and infrastructure.\n  * Bandwidth management.\n  * Resource allocation.\n  * Data security.\n  * App-building and monitoring tools.\n  * Support for smart contracts (automated agreements embedded in blockchain code).\n  * Dashboards to view and analyze code.\n  * Auditable transaction records.\n  * Built-in connections to needed services.\n  * Professional services.\n\nWhile some BaaS vendors have been offering their services for several years,\nWester cautions companies to temper their expectations. After all, we're still\ntalking about a nascent technology, and few organizations possess the\nexpertise to build blockchain apps, much less blockchains themselves.\n\n\"Blockchain is still a work in progress,\" Wester said. \"We still don't know\nall of the things that are going to go into long-lasting, successful\nblockchain applications.\"\n\nHe also said it's difficult to make clean ROI calculations for a technology\nthat's shared across multiple organizations and might deliver more value at\ntimes for one organization than another.\n\nThat said, blockchain has the kind of potential enterprises can't ignore, and\nif they're looking to give it a go, they might as well have some idea of where\nto turn. With that in mind, what follows is a quick look at eight BaaS\nproviders -- in no particular order -- that should be on the radar of any\nenterprise looking to experiment with blockchain.\n\n__\n\n## __1\\. IBM\n\nOne of the most mature blockchain services on the market, the IBM Blockchain\nPlatform is built on the Linux Foundation's open source community-based\nHyperledger Fabric. And it's already had plenty of success supporting\nblockchains. Its Food Trust blockchain is bringing more transparency to the\nfood supply chain, and it's helping to transform trade finance for a\nconsortium of 15 European banks collaborating over the We.Trade blockchain\nnetwork.\n\n## __2\\. Amazon Web Services (AWS)\n\nAs it is in any market that relies on cloud-based computing, AWS is a BaaS\nforce to be reckoned with. The Amazon Managed Blockchain is a fully managed\nservice that supports the creation and management of scalable blockchain\nnetworks. Its Quantum Ledger Database serves as a centralized, verifiable\ntransaction log. And unlike many of its competitors, AWS has options for\nrunning on either the Hyperledger Fabric or Ethereum blockchain frameworks.\n\n## __3\\. Oracle\n\nNever one to be left on the sideline of any enterprise technology trend,\nOracle offers two BaaS approaches. Its Blockchain Platform Cloud Service works\nlike any traditional SaaS offering, with subscribers able to quickly set up\nHyperledger Fabric blockchains. Alternatively, Oracle offers an on-premises\nversion in which it deploys a preassembled blockchain that runs as a software\nappliance on virtualization hypervisors.\n\n## __4\\. SAP\n\nWherever Oracle is playing, SAP is likely to be nearby, and blockchain is no\nexception. The company's website doesn't do a great job of clearly explaining\nSAP's blockchain options. However, the company offers several blockchain-based\nproducts, including SAP Business Network Material Traceability; GreenToken for\nsupply chain sustainability data; SAP Pharma Blockchain POC app for\nprescription returns; and Blockchain Business Connector, which extends SAP's\nintegration tools to bridge the transactional and analytical systems involved\nin blockchain applications. SAP also offers a detailed explanation of\nblockchain.\n\n## __5\\. Alibaba Cloud\n\nBuying blockchain technology from China might seem like heresy to some\nAmerican companies, but with so many countries buying just about everything\nelse from China, why not consider a mature BaaS offering that claims to be the\nservice with the largest number of primary patents? Alibaba Cloud BaaS offers\nall the needed features and functions, with a bonus: It can run on Hyperledger\nFabric, AntChain or Quorum.\n\n## __6\\. Hewlett Packard Enterprise (HPE)\n\nSince it entered the BaaS market in 2017, HPE has focused on the distributed\nledger technologies of blockchain with its Mission-Critical Distributed Ledger\nTechnology. In doing so, HPE has targeted environments that demand 100% fault\ntolerance and says it is focused on bringing enterprise-grade capabilities to\nblockchain workloads.\n\n## __7\\. VMware\n\nIt's no surprise that the champion of virtualization would play in this space.\nThe VMware Blockchain for Ethereum promises enterprise-grade reliability,\nscalability, ease of deployment monitoring and management as its next chapter\nin the blockchain saga. More importantly, VMware's existing BaaS entrant has\nproved itself in deployments in financial services, supply chain and\nhealthcare.\n\n## __8\\. R3\n\nIt's not exactly a household name compared to the other big BaaS providers on\nthis list, but R3's Corda BaaS platform has the attention of analysts, and the\nvendor claims its distributed ledger technology has made it a popular choice\nfor financial services firms. R3 bills Corda as a permissioned ledger, asset\nmodeling tool and workflow routing engine bundled into one platform.\n\n## __But wait, there's more\n\nThe eight vendors detailed above certainly don't represent the entire BaaS\nmarket. Organizations can turn to the frameworks themselves and experiment\nwith establishing blockchains on Hyperledger Fabric or Multichain.\n\nLikewise, they can try smaller players such as Kaleido. This full-stack BaaS\nplatform supports the management of blockchains spanning multiple clouds.\nAnother player is Dragonchain, whose serverless cloud architecture focuses on\nprotecting vital business assets and data.\n\nSmall vendors are well represented among the industry-focused enhanced BaaS\nproviders identified by Gartner's Litan. These include Vendia, which manages a\nblockchain BMW uses to exchange data with auto parts suppliers; and\nSettleMint, a blockchain piloted by beverage-maker AB InBev to provide\ntransparency and traceability in its barley supply chain. The Vatican uses\nShelterZoom to tokenize archived documents to make them securely accessible\nonline, while a hospital in Argentina uses the platform to provide patients\nownership and control over their medical records.\n\n#### __Next Steps\n\nToday's blockchain use cases and industry applications\n\nMust-know blockchain trends for 2023 and beyond\n\nAlternatives to blockchain for businesses to consider\n\nTips to successfully implement blockchain for businesses\n\n####  Related Resources\n\n  * How do we build trust in the digital world Video –Okta\n  * Enable Deep Visibility for Applications, Users, and Devices With FortiGate ... –Fortinet, Inc.\n  * ITSM Problem Management: What Are Your Pain Points? –ServiceNow\n  * Time to rekindle the Digital Transformation drive –TechTarget ComputerWeekly.com\n\n####  __Dig Deeper on Digital transformation\n\n  * ##### Top 8 Web 3.0 trends and predictions for 2024 and beyond\n\nBy: Lauren Paul\n\n  * ##### Blockchain for businesses: The ultimate enterprise guide\n\nBy: David Essex\n\n  * ##### Hyperledger\n\nBy: Alexander Gillis\n\n  * ##### 10 core features of Web 3.0 technology\n\nBy: Lauren Paul\n\n__Sponsored News\n\n  * Hybrid Cloud, Consumption-Based IT: Empowering Transformation in Healthcare ... –HPE\n  * Driving Digital Transformation With Flexible IT from Dell and VMware –Dell Technologies\n  * See More\n\n__Related Content\n\n  * Blockchain for businesses: The ultimate enterprise ... – CIO\n  * Web3 use cases for storage flimsy for now – Storage\n  * Salesforce Blockchain brings low-code to trusted ... – Cloud Computing\n\nLatest TechTarget resources\n\n  * Cloud Computing ____\n  * Mobile Computing ____\n  * Data Center ____\n  * Sustainability and ESG ____\n\nCloud Computing\n\n  * __Top 11 cloud certifications for 2024\n\nCloud certifications are available for all levels of cloud expertise. Use this\nguide to evaluate basic, topic-specific, ...\n\n  * __What you need to know about Microsoft Azure Spot VMs\n\nThe cost of spot prices can be a risk-and-reward kind of strategy. Better\nunderstand the risks that come with Azure Spot VMs so ...\n\n  * __How to build a successful FinOps team\n\nA successful FinOps team relies on clear team structure and roles, shared\naccountability and baseline measures of success. Use ...\n\nMobile Computing\n\n  * __Finding the best mobile hotspot option for remote work\n\nOrganizations that allow the use of mobile hotspots for remote work must know\nhow personal hotspots and dedicated hotspot devices...\n\n  * __How do personal hotspots work for remote work?\n\nA personal hotspot can be a valuable element of a remote work strategy, but IT\nteams must understand how they work and what ...\n\n  * __How to recycle mobile phones in the enterprise\n\nMobile device disposal requires careful planning. IT teams must learn how to\nrecycle mobile phones to keep e-waste out of ...\n\nData Center\n\n  * __Astera Labs uses CXL to accelerate AI, expand memory\n\nAstera Labs is using the CXL interface in its now longer Smart Cable Module to\nspread out energy consumption while enabling GPU ...\n\n  * __Top 5 colocation providers of 2024\n\nColocation companies offer a wide range of facilities and services that can\nhelp reduce costs of managing data centers. Compare ...\n\n  * __5 hyper-converged infrastructure trends for 2024\n\nHyper-converged infrastructure is rapidly changing. Read what HCI has to offer\nand what projected growth it may have within the ...\n\nSustainability and ESG\n\n  * __Hilti Group uses tools, tech to tackle circular manufacturing\n\nHilti Group's move to circular manufacturing helps with sustainability targets\nwhile building on existing processes and helping ...\n\n  * __10 business sustainability trends for 2024\n\nIn 2024, environmental sustainability will be thrust into the spotlight. Learn\nwhat's driving that change and what some of the ...\n\n  * __How to shrink your IT carbon footprint and why it matters\n\nOrganizations are shifting IT priorities toward efficient resource\nconsumption. Learn how strategies prioritizing sustainability ...\n\n  * About Us\n  * Editorial Ethics Policy\n  * Meet The Editors\n  * Contact Us\n  * Advertisers\n  * Partner with Us\n  * Media Kit\n  * Corporate Site\n\n  * Contributors\n  * Reprints\n  * Answers\n  * Definitions\n  * E-Products\n  * Events\n  * Features\n\n  * Guides\n  * Opinions\n  * Photo Stories\n  * Quizzes\n  * Tips\n  * Tutorials\n  * Videos\n\nAll Rights Reserved,  Copyright 2007 - 2024, TechTarget  \n  \nPrivacy Policy  \nCookie Preferences  \nCookie Preferences  \nDo Not Sell or Share My Personal Information\n\nClose\n\n",
    "links": "[]"
}