{
    "summary": "  * Quick launch\n    * Ankr.com\n    * Web3 API\n    * Staking\n    * AppChains\n    * Automate\n    * Block Explorer\n    * Docs\n\n  * Products\n\n#### Web3 API\n\nStart building with high-performance Multichain RPC services and Advanced API.\n\n#### Staking\n\nStake your assets or integrate Liquid Staking into your project with our SDK.\n\n#### Scaling Services\n\nLaunch your dedicated rollup or sidechain fast with Ankr Scaling Services.\n\n#### Automate\n\nExecute smart contract functions with time or custom logic triggers.\n\n#### See also\n\n#### Enterprise Solutions\n\n#### Block Explorer\n\n#### Ankr Network\n\n#### Ankr Token\n\n#### Ankr Verify\n\n  * Case Studies\n\n#### BNB Chain\n\nAnkr’s contributions take BNB Chain to the next level.\n\n#### Chiliz\n\nBuilding the foundation for Web3’s hottest sports apps.\n\n#### Polygon\n\nPowering Polygon with a Multi-Sided Solution.\n\n#### SushiSwap\n\nServing up a multi-chain connection for the DeFi chefs at SushiSwap.\n\n#### See all case studies\n\n  * Resources\n\n#### Docs\n\n#### Tutorials\n\n#### Github\n\n#### Ankr Whitepaper 2.0\n\n#### Brand Assets\n\n  * Company\n\n#### About Us\n\n#### Blog\n\n#### Press\n\n#### Careers\n\n    * Twitter\n\n    * Telegram\n\n    * Discord\n\n    * Medium\n\n    * Reddit\n\n    * Instagram\n\n    * YouTube\n\n    * LinkedIn\n\n  * Blog\n\n###### Docs\n\n# What Is Rollup-as-a-Service (RaaS) In Web3?\n\nKevin Dwyer\n\nOctober 11, 2023\n\n5 min read\n\nWhat if every decentralized application, enterprise, or crypto use case had\nthe opportunity to operate on its own layer-2 blockchain? This is the question\nthat Rollup-as-a-Service (RaaS) providers are seeking to answer. Layer-2s are\nbecoming increasingly important for scaling Web3 to handle any amount of\ntraffic. RaaS makes it easier than ever to launch a layer 2 rollup to provide\ndedicated infrastructure for a dApp so developers can focus on creating better\nexperiences for the end user without worrying about network congestion or gas\nfees.\n\n## What Are Rollup-as-a-Service Providers?\n\nRaaS providers are companies that offer a platform for developers to deploy\nand manage their own custom rollups. This produces a dedicated blockchain for\ntheir dApp or project to run on, meaning they don’t have to compete for\ntraffic from the hundreds or thousands of other dApps running on public\nblockchains like Ethereum or Polygon. RaaS platforms typically provide a\nvariety of features and services to make it easier for developers to launch\nand manage their rollups, such as:\n\n  * **Rollup infrastructure:** RaaS providers launch and operate the underlying node infrastructure needed to run a rollup, such as full nodes, validators, sequencers, and aggregators.\n  * **Development tools:** RaaS providers often provide development tools and frameworks to help developers build their rollups, such as SDKs and other tools.\n  * **Security and auditing:** RaaS providers can help developers secure their rollups and have them audited by third-party security firms.\n  * **Engineering services:** Some providers may provide complete engineering and deployment of the rollup for a hands-free and easy experience.\n  * **Ongoing support:** RaaS providers can provide ongoing support to developers, such as troubleshooting, performance optimization, and continued node operations.\n\nRaaS platforms can help lower the barrier to entry for developers who want to\nlaunch their own rollups. By providing the necessary infrastructure and tools,\nRaaS platforms can make it easier for developers to focus more on building\ntheir applications and less on the technical challenges of running a rollup.\n\n**Some examples of blockchain Rollup-as-a-Service providers include:**\n\n  * Caldera\n  * Conduit\n  * AltLayer\n\nRaaS platforms are a relatively new development in the blockchain space, but\nthey have the potential to play a major role in the future of scaling. By\nmaking it easier for developers to launch their own rollups, RaaS platforms\ncan help to bring the benefits of rollups to a wider range of applications and\nusers.\n\n## What Are Sidechain-as-a-Service Providers?\n\nSidechains, or AppChains as they are sometimes called, are a different type of\nblockchain scaling solution architecture. One of the key differences between\nsidechains and layer-2 chains is that sidechains have their own security model\nand validator infrastructure, while layer-2 chains inherit the security and\ndecentralization of the layer-1 blockchain. This means that sidechains are\nmore independent and flexible, but lack some of the benefits inherited from\nL1s like Ethereum.\n\nSidechain-as-a-Service (SaaS) providers are companies that offer a platform\nfor developers to deploy and manage their own sidechains. Examples of SaaS\nproviders include:\n\n  * Ankr\n  * Kaliedo\n  * Horizen Labs\n\n## Zero-Knowledge vs. Optimistic Rollups: What’s the difference?\n\nZero-knowledge (ZK) rollups and optimistic rollups are two types of layer-2\nscaling solutions that are designed to improve the throughput and scalability\nof Ethereum. Both types of rollups work by bundling transactions together and\nprocessing them off-chain, but they differ in how they verify the validity of\ntransactions.\n\nZero-knowledge rollups use zero-knowledge proofs to verify the validity of\ntransactions without revealing any underlying data. Since the data relayed in\nthese proofs is much smaller and more efficient than including all of the\ntransaction info, it makes for a faster and more affordable means of\nverification.\n\n**Examples of ZK Rollups:**\n\n  * zkSync\n  * StarkNet\n  * Polygon zkEVM\n\nOptimistic rollups assume that all transactions are valid until proven\notherwise, hence the “optimism.” This allows optimistic rollups to process\ntransactions very quickly and cheaply, but it also introduces a risk of fraud.\nIf a fraudulent transaction is submitted to an optimistic rollup, anyone can\nsubmit a fraud-proof to challenge it.\n\n**Examples of Optimistic Rollups:**\n\n  * Optimism\n  * Arbitrum\n  * Boba\n\n## Why Should Developers Launch Their Own Rollup?\n\nThere are a number of reasons why Web3 developers should consider launching\ntheir own Layer 2 (L2) rollup:\n\n  * **Improve scalability and performance:** Rollups can significantly improve the scalability and speed of decentralized applications, enabling developers to onboard nearly any number of users – something very important for large enterprises entering the space.\n  * **Reduce transaction fees and improve efficiency:** Rollups can process more transactions at a lower cost by bundling them for processing off-chain. This means your users will have a much better experience with low or even zero gas fees.\n  * **Tailor the rollup to the specific needs of the application:** Developers can tailor their rollup to the specific needs of their application. This can include things like supporting custom smart contracts, transaction types, and security features.\n  * **Capture value:** Developers who launch their own rollup can capture value from the network by charging fees for transactions and data storage, launching their own on-chain assets, and other opportunities that otherwise go to public chains like Ethereum.\n  * **Build a community:** Launching a rollup can help developers to build a community around their project. This can lead to more users, developers, and investors supporting the project.\n\n## Join the Conversation on Ankr’s Channels\n\nTwitter | Telegram Announcements | Telegram English Chat | Help Desk | Discord\n| YouTube | LinkedIn | Instagram | Ankr Staking\n\nReturn to blog\n\nFind on\n\n  * Products\n\n    * Web3 API\n\n    * Staking\n\n    * Scaling Services\n\n    * Automate\n\n    * Enterprise Solutions\n\n    * Block Explorer\n\n    * Ankr Network\n\n    * Ankr Token\n\n  * RPCs\n\n    * Polygon\n\n    * See All\n\n  * Staking\n\n    * Ethereum\n\n    * Polygon\n\n    * Avalanche\n\n    * Binance Smart Chain\n\n    * Polkadot\n\n    * Fantom\n\n    * See All\n\n  * Case Studies\n\n    * BNB Chain\n\n    * Chiliz\n\n    * Polygon\n\n    * SushiSwap\n\n    * Meta Apes\n\n    * Mantle Network\n\n    * See all case studies\n\n  * Resources\n\n    * Docs\n\n    * Tutorials\n\n    * Github\n\n    * Ankr Whitepaper 2.0\n\n    * Brand Assets\n\n  * Company\n\n    * About Us\n\n    * Blog\n\n    * Press\n\n    * Careers\n\n  * Socials\n\n    * Twitter\n\n    * Telegram\n\n    * Discord\n\n    * Medium\n\n    * Reddit\n\n    * Instagram\n\n    * YouTube\n\n    * LinkedIn\n\n© 2024 Ankr All rights reserved     info@ankr.com\n\n  * Terms of service\n  * Privacy Policy\n\n",
    "links": "[{\"link\": \"https://ankr.com/blog/\", \"text\": \"\"}]"
}