{
    "summary": "Open in app\n\nSign up\n\nSign in\n\nWrite\n\nSign up\n\nSign in\n\n#  **Embracing the Rollup Revolution: How Rollups-as-a-Service (RaaS) are\nShaping the Future of Blockchain Scalability and Web3 Development**\n\nChris Smalley\n\n·\n\nFollow\n\nPublished in\n\nBlock Magnates\n\n·\n\n13 min read\n\n·\n\nApr 19, 2023\n\n3\n\nListen\n\nShare\n\nAs the blockchain industry continues to evolve, the demand for scalable\nsolutions has expanded across the ecosystem. Rollups-as-a-Service (RaaS) are\nan emerging trend that aim to address the need by providing developers with\nuser-friendly tools and services for the easy deployment of rollups. In this\nblog post, I will explore the key insights, background, and current state of\nRaaS, as well as its potential impact on the future of blockchain scalability\nand Web3 development.\n\n#  **Key Insights**\n\n· The rise of modular blockchain architecture has paved the way for Rollups-\nas-a-Service (RaaS)\n\n· RaaS projects are dedicated to creating tools and services for the\neffortless deployment of tailored rollups\n\n· Presently, RaaS solutions encompass rollup SDKs, no-code rollup deployment,\nand shared sequencer sets\n\n· RaaS solutions hold great significance as rollups enable blockchains to\nscale vertically and alleviate network bottlenecks faced by smart contract\nL1s. Additionally, RaaS solutions reduce the burden of launching application\nspecific chains\n\n· Rollups are set to streamline the experience for Web3 builders and users\nthrough enhanced UI, lower operating costs, and an expanded design space for\ntheir own native tokens\n\n· Rollups represent a potential cornerstone for blockchain scalability and\ndApp development, offering customizable execution environments and plug-and-\nplay modular components for Web3 applications\n\n· The proliferation of RaaS projects is expected to give rise to a new and\ndistinctive rollup ecosystem in 2023\n\n#  **Background on Rollups**\n\nScalability is the means of increasing the speed and throughput of a\nblockchain while minimizing cost, without sacrificing decentralization or\nsecurity. Rollups are poised to be the key scalability solution across L1s by\ntaking activity off-chain to an L2 or L3. Rollups help reduce L1 congestion by\nexecuting transactions on the rollup and then provide that compressed\ntransaction data back to the L1 for validation. In turn, the rollups derive\nsecurity from the consensus and data availability provided by the underlying\nlayers. As I will discuss, there are different forms of rollups currently with\neach having its own set of tradeoffs and there are two primary ways to\ncompress transaction data back to the L1, Optimistic and Zero-Knowledge.\n\nRollup-as-a-Service (RaaS) initiatives aim to simplify the deployment of\nrollups by providing user-friendly tools and services that abstract away\ntechnical complexities, making rollups accessible to everyone. Typically,\nthese tools and services can speed up developer deployment of their project by\nover a year (depending on developer team and background), drastically\nincreasing feasibility of diverse rollup projects. Current RaaS initiatives\ninclude SDKs, no-code rollup deployment, and the development of rollup\nsequencer solutions aimed at providing shared, decentralized sequencing\ncapabilities for multiple rollups. In the following sections, I will delve\ndeeper into the RaaS ecosystem, but first, let’s examine how L1s accept\ntransaction data from rollups and outline the existing rollup architectures.\n\n#  **Optimistic vs Zero-Knowledge**\n\nOptimistic rollups, such as Arbitrum or Optimism, operate on the premise that\nall transactions are valid until proven otherwise. To ensure transaction\nsecurity, the protocol includes a challenge period during which verifiers can\ndispute a transaction’s legitimacy using a fraud-proof on the parent chain. By\nexecuting proofs less frequently than zero-knowledge, optimistic rollups\nsignificantly enhance throughput and reduce latency (transaction confirmation\ntime). However, the challenge period typically lasts seven days, during which\nusers can utilize their funds within the L2 ecosystem but cannot withdraw them\nback to the L1. In response to these lengthy waiting periods, many developers\nhave turned to the more technically demanding Zero-Knowledge proofs for faster\nsolutions.\n\nZero-Knowledge (ZK) rollups, like StarkNet, function similarly to Optimistic\nrollups in that they aggregate numerous off-chain transactions and submit a\nbatched version to the L1. However, ZK-rollups employ validity proofs to\ninstantly validate transactions, rather than assuming all transactions are\nvalid until proven otherwise. The validity proofs and compressed data are then\nsubmitted to the L1 as a proxy for their corresponding bundles of raw\ntransactions, which undergo on-chain validation.\n\nCreating validity proofs is highly complex and time-consuming (currently),\nresulting in increased latency compared to Optimistic rollups. The heavy\ncomputations required for generating these cryptographic proofs necessitate\nsequencers with high-spec hardware, making it challenging for everyday users\nto participate.\n\nFor reference, see the top Optimistic and ZK rollups below:\n\nSource: Layer 2 Beat\n\n#  **Modular Architecture in Rollups**\n\nRollup’s modular architecture can be broadly divided into four categories:\nsmart contract rollups, settlement rollups, sovereign rollups, and enshrined\nrollups.\n\n **Smart Contract Rollup**\n\nSmart contract rollups essentially exist within a series of L1 smart\ncontracts. Rollup execution occurs off-chain, and operators periodically post\nupdates back to the L1. The smart contracts verify proofs or arbitrate\ndisputes as needed, while also tracking all rollup state roots and transaction\ndata to recompute the state. Fraud or validity proofs confirm the validity of\nstate transitions. Operators post a bond in the L1 smart contract to publish\nblocks; if the block or proof is invalid, their bond can be slashed, and the\ntransactions will not be finalized. This process may take over a week for\nOptimistic rollups but is instantaneous with validity proofs. Design mechanics\nare outlined below:\n\nSource: Delphi Digital\n\n **Settlement Rollup**\n\nTypically, an L1 is responsible for consensus and data availability, while the\nsettlement layer operates independently. The rollup is built atop the\nsettlement layer, and the resulting rollup shares the settlement layer with\nthat base layer. In a settlement rollup, however, the settlement layer is\ndetached from the L1, and the rollup assumes responsibility for settlement.\nThis approach offers several advantages:\n\n· Settlement layer facilitates trust-minimized bridging\n\n· Shared liquidity among the execution layer\n\n· More affordable, customizable bridging\n\n **Sovereign Rollup**\n\nA sovereign rollup is a type of rollup that does not rely on a settlement\nlayer to determine its canonical chain and validity rules. Instead, the\nrollup’s canonical chain is determined by the nodes in the rollup’s P2P\nnetwork. This means that settlement takes place on the rollup rather than on a\nseparate settlement layer. Sovereign rollups provide key benefits such as\ngreater freedom over the execution environment, no sharing of computation\nresources, and the ability to hard fork in case of issues (hence the\n“Sovereign” moniker)\n\n **Enshrined Rollup**\n\nA type of rollup that is serviced natively from the settlement layer and is\nbuilt directly into the L1 spec instead of being deployed as a smart contract,\nas seen in platforms like Arbitrum and Optimism on Ethereum. Being built\ndirectly into the L1 is beneficial as it removes the risk of malicious\ngovernance and multisig upgrades or bug risk in the smart contract itself.\nHowever, unlike sovereign rollups, enshrined rollups are unable to hard fork\nin the event of disagreement or issues with L1 upgrades.\n\n#  **Rollups-as-a-Service Ecosystem**\n\nThe variety of modular rollup architectures presents numerous trade-offs, as\nwell as ample opportunities for value creation within the blockchain\necosystem. To address the complexity of blockchain development, the RaaS model\nhas emerged, enabling projects to minimize or abstract technical complexities\nassociated with deploying rollups. As mentioned previously, these solutions\nrange from rollup software development kits (SDKs) to fully customizable one-\nclick rollup deployments. Additionally, some teams are developing shared,\ndecentralized sequencer solutions to enhance censorship resistance and\nliveness. More details on each below and examples of companies providing these\ntools and services.\n\n#  **Rollup SDKs**\n\nRollup SDKs are customizable frameworks designed to assist developers in\nbuilding rollups. Here are some of the leading companies in this domain:\n\n· **Dymension RollApp Development Kit (RDK)** — An SDK derived from the Cosmos\nSDK, enabling developers to deploy RollApps effortlessly atop the settlement\nlayer. The RDK comes with pre-packed modules that streamline the process of\nbuilding and deploying RollApps on Dymension.\n\n· **The OP Stack** — This solution simplifies the process of constructing a\nmodular blockchain by decoupling distinct function levels (consensus,\nsettlement, execution) and merging the levels in the form of API software\nstacks\n\n· **Rollkit** — A rollup framework SDK originating from the Celestia\ncommunity. Rollkit allows developers to build on top of Celestia’s data\navailability and consensus layer with ease. Can currently be used to deploy\nsovereign rollups or sovereign settlement layers\n\n· **Slush** — Offers an SDK for building zkVM L3s solutions on StarkNet, with\na focus on app-specific rollup optimizations\n\n· **Orbit** — A developer-friendly solution for launching permissionless L3\nsolutions on Arbitrum. Orbit enables developers to launch L3 rollups like\nArbitrum One and Arbitrum Nova, as well as customize an L3 with Arbitrum Nitro\ncore\n\n· **Initia** — A Move L1 on Cosmos with an application-specific ZK L2 scaling\nsolution designed for an initial target of Web2.5 service onboarding. Initia\naims to eliminate the barriers for Web2 companies looking to build on Web3\ninfrastructure and will be one of the first to offer ZK rollups as a solution\n\n· **Stackr** — Developers can leverage the SDK to quickly set up their own\noptimistic rollups by using the included APIs to build and connect to the\nStackr ecosystem\n\n#  **No-Code Rollup Deployment**\n\nNo-code rollup deployment services are currently focused on building solutions\nthat settle to existing L1s (AltLayer, Constellation) or providing solutions\nthat share a settlement layer upon which app-specific rollups can be easily\ndeployed (Eclipse). These services allow for seamless rollup deployment\nwithout the need for extensive coding knowledge. Further descriptions below:\n\n· **Eclipse** — Provides a highly extensible rollup architecture that empowers\ndevelopers to choose their own virtual machine (VM), data availability, and\ncustomize the execution layer\n\n· **AltLayer** — Addresses the issue of a single popular dApp congesting the\nentire base layer network by offering a one-time execution layer dedicated to\nevents like NFT mints. The one-time execution layer can be shut down\nafterwards\n\n· **Caldera** — Built with the OP Stack and currently focused on Optimistic,\nEVM-compatible rollups. The rollups offer customizable parameters such as\nblock time and account permissions\n\n#  **Shared Sequencers**\n\nSequencers are vital nodes that bundle transactions, produce blocks, and\nsubmit compressed transaction data to underlying layers. Although most rollups\non mainnet use centralized sequencers, several projects are working to\nestablish decentralized sequencer sets:\n\n· **Dymension** — In addition to the SDK, Dymension offers a decentralized\nsequencer set for Dymension-specific RollApps. Nodes stake Dymension’s native\ntoken on the Dymension Hub and are elected based on stake weight\n\n· **Saga** — In partnership with Celestia, Saga is building a sequencer set\nfor Rollkit-enabled chains. Sequencers are required to perform duties across\nrollups based on stake weight and risk losing their stake for downtime or\ncensorship\n\n· **Optimism Sequencer Set** — Optimism is developing a shared sequencer for\nchains that utilize the OP Stack. OP Chains can opt into the sequencer set\nprovided by the Optimism Collective\n\n· **Espresso —** Espresso Sequencer is designed to offer rollups a way to\nachieve credible neutrality, improved interoperability, mitigation of negative\neffects of MEV, and long-term economic incentive alignment with L1 validators\n\nDecentralized sequencers hold immense potential for the rollup ecosystem, as\nthey can serve multiple rollups simultaneously while using economic incentives\nto hold operators accountable. Furthermore, shared sequencers can enable\natomic and trust-minimized cross-chain rollup communication as nodes produce\nblocks concurrently on individual chains.\n\nFor a visual representation of the RaaS ecosystem, refer to the diagram\nprovided by Messari. As noted above, more companies are joining the ecosystem\nby the month.\n\nSource: Messari\n\n#  **Benefits of RaaS**\n\nRaaS offers numerous advantages to developers, enabling them to customize\ntheir applications to suit their unique requirements:\n\n1) Enhanced control and customizability — RaaS allows developers to select\nfeatures and functionalities that best align with their project’s needs\n\n2) Protection against transaction fee spikes — Rollups can safeguard against\nunexpected increases in transaction fees due to network congestion, providing\ndevelopers with confidence to deploy their applications\n\n3) High performance — RaaS delivers low-latency and high-throughput\nexperiences, crucial for real-time transactional applications\n\n4) Enhanced utility for native tokens — RaaS increases the overall value and\nutility of a rollup’s native token, benefiting token holders\n\n5) Speed to market — Provides developers a more streamlined and accessible\napproach to building dApps\n\n6) Revenue generation — Offers revenue-generating opportunities, like\ninternalizing Maximal Extractable Value (MEV) to capture transaction fees as\nprotocol revenue\n\n#  **RaaS Considerations**\n\nWhile RaaS presents many advantages, it is important to consider potential\ndrawbacks and mitigation strategies:\n\n1) Composability and transaction flexibility — RaaS may result in lost\ncomposability and transaction flexibility due to moving away from a shared\nstate machine. This can cause onboarding and offboarding friction for new\nusers\n\n2) Liquidity fragmentation — Liquidity can become fragmented depending on the\nrollup type. Some projects are addressing this issue by embedding a native\nAutomated Market Maker (AM) within the settlement hub. Importantly, rollups\ncan process transactions asynchronously, without mandatory communication with\nother rollups using the same AMM liquidity pool. This is key to making shared\nAMMs possible. The diagram below shows how this is possible.\n\nSource: Delphi Digital\n\n3) Infrastructure development — Basic infrastructure, such as RPC endpoints,\nwallets, and block explorers, may not be readily available and require\nadditional development\n\n4) Infrastructure costs — Developers need to consider the expenses associating\nwith creating and maintaining the necessary infrastructure\n\nAs RaaS continues to evolve, developers aim to create fully agnostic solutions\nthat span execution environments, Optimistic and ZK rollup types, and\nsequencers. Moreover, they plan to offer modules that can be integrated with\nany settlement, consensus, and data availability layers. This progression will\nfurther empower developers to build innovative and tailored solutions,\nultimately benefiting the entire blockchain ecosystem.\n\n#  **Considering L1 Alternatives**\n\nAn overarching consideration is the potential redundancy of RaaS, as next-\ngeneration, fully modular L1 blockchains like Aptos and Sui already offer\nnative scalability and can potentially handle equivalent L2 transactions.\nThese L1 blockchains emphasize scalability, safety, reliability, and\nupgradeability, which could lead to significant network effects. Remaining on\na single L1 can reduce the complexity of moving across state machines and\nlayers of the tech stack, solving some of the issues mentioned earlier.\nHowever, it is unlikely that dApps on these blockchains can achieve the same\nlevel of customization as app-specific rollups, suggesting a rollup-centric\nfuture. Bearing this in mind, let’s examine how RaaS companies can generate\nrevenue.\n\n#  **Value Accrual for Rollups-as-a-Service**\n\nRaaS projects can accrue value through various models, including:\n\n· Validator fees for ZK rollups\n\n· MEV for sequencers\n\n· Bridging fees\n\n· Software licensing\n\n· Rollup deployment costs\n\n· Centralized and decentralized sequencing fees\n\n· Settlement layer fees\n\nIn many instances, these solutions do not require rollup end-users to interact\nwith a RaaS-native token. Rollup developers can collaborate with RaaS\nproviders to customize their rollup’s user interface and value accrual\nmechanisms. Ultimately, it is up to the projects themselves to decide whether\nto implement a native gas token, a stablecoin, or forego user transaction fees\naltogether.\n\n#  **Unlocking New Possibilities with Rollups-as-a-Service**\n\nProjects seeking to rapidly develop app-specific rollups can benefit from\nRaaS, which simplifies the process and accelerates time-to-market. RaaS\ncompanies are looking to assist projects with the below use cases.\n\n **Gaming —** RaaS and rollups are an ideal solution for gaming, which\nrequires speed, high storage capacity, and customization. With RaaS, gaming\nstudios can create engaging experiences that can process thousands of\ntransactions per second and support millions of players, all without the need\nfor constant wallet interactions.\n\n· Fully controllability and customizability — many developer teams want a\nrange of control over their technical stack\n\n· Massive scale — Process thousands of transactions per second to support\nmillions of players with low latency\n\n· Gasless transactions — Improve user experience by enabling gasless\ntransactions\n\n **Consumer Apps —** RaaS companies can enable more of a Web2 like experience\nfor users which will make consumer applications much more intuitive and reduce\nthe friction of onboarding. NFTs and social applications can massively benefit\nfrom app-specific rollups and they will be able to customize the experience\nfor their user.\n\n· Web2-like UX — Confirm transactions in less than a second, giving consumer\napp a snappy UX\n\n· Massive scale — Process thousands of transactions per second to support\nmillions of users\n\n· Gasless transactions — Improve user experience by enabling gasless\ntransactions\n\n **DAOs —** Organizations can take full advantage of RaaS’s customizability\nand native governance tokens, improving community engagement and user\nexperience.\n\n· Internalize the ecosystem — Enable DAO-supported projects to launch on\nchain, aligning incentives with the DAO\n\n· Governance token — Designate the governance token as the chain’s gas-paying\ntoken, increasing its utility\n\n· Sustainable revenue — Re-invest the proceeds from transaction fees and/or\nMEV back into the DAO, creating a revenue generating flywheel\n\n **Institutional Applications —** Institutions can focus on security and\npermissioning to reduce onboarding barriers.\n\n· Security — Inherit security from large public blockchains at the L1\n\n· Customizable — Institutions can choose parameters for gas fees and gas\nlimits\n\n· Sequencer-level permissioning — Can control who can interact with the chain\nand whitelist specific addresses or IPs\n\n#  **Rolling Into the Future with RaaS**\n\nRaaS companies have now started to emerge in earnest and are providing\ncritical solutions for the modular world. RaaS companies have finally\nsimplified the process of creating customizable rollups which unlocks serious\nuse cases for dApps. Furthermore, the customizable rollups will provide high\nthroughput, security, and functionality which have previously limited\napplications in the past.\n\nRaaS and app-specific rollups will enable exciting new use cases across\ngaming, NFTs, social, DAOs, institutional applications, and many others. More\nusers will be able to seamlessly interact with their favorite dApps with the\nimproved UX bridging millions of users over to Web3. I am excited to see this\nspace in the future and look forward to more innovation.\n\nLet me know if I missed anything and please give me a follow @Smalleyc_ on\nTwitter if you learned something new.\n\n## Sign up to discover human stories that deepen your understanding of the\nworld.\n\n## Free\n\nDistraction-free reading. No ads.\n\nOrganize your knowledge with lists and highlights.\n\nTell your story. Find your audience.\n\nSign up for free\n\n## Membership\n\nAccess the best member-only stories.\n\nSupport independent authors.\n\nListen to audio narrations.\n\nRead offline.\n\nJoin the Partner Program and earn for your writing.\n\nTry for $5/month\n\nRollup\n\nBlockchain\n\nCryptocurrency\n\nCryptocurrency Investment\n\nBlockchain Technology\n\n3\n\n3\n\nFollow\n\n## Written by Chris Smalley\n\n0 Followers\n\n·Writer for\n\nBlock Magnates\n\nMBA Candidate@Wharton. Investments@Franklin_DAO. Co-President@Pennblockchain\n\nFollow\n\nHelp\n\nStatus\n\nAbout\n\nCareers\n\nBlog\n\nPrivacy\n\nTerms\n\nText to speech\n\nTeams\n\nTo make Medium work, we log user data. By using Medium, you agree to our\nPrivacy Policy, including cookie policy.\n\n",
    "links": "[]"
}