{
    "summary": "NFT\n\nPrices\n\nProducts\n\nCompany\n\nLearn\n\nDownload App\n\nEN\n\n# The World’s Premier Crypto Trading Platform\n\n## Buy Bitcoin, Ethereum, and 250+ cryptocurrencies\n\n## Trade with 20+ fiat currencies and Apple/Google Pay\n\n## Leader in regulatory compliance and security certifications\n\n## Trusted by over 80 million users worldwide\n\nDownload App\n\n#### CRYPTO.COM PRICE\n\n## Buy Bitcoin, Ethereum, and 250+ cryptocurrencies\n\nCheck Crypto Prices\n\n## Your crypto journey starts here\n\n### Buy crypto\n\nBuy BTC, ETH, and other crypto easily via bank transfer.\n\nBuy BTC, ETH, and other crypto easily\n\nwith\n\n### Price Alerts\n\nBe notified on BTC, ETH, XRP prices, and more.\n\nRecurring Buy\n\nGrow your portfolio automatically with daily, weekly, or monthly trades.\n\nOn-chain Staking\n\nGenerate passive income by helping  \nto secure blockchains.\n\nJoin our 80M+ users\n\nGet started today\n\nScan to download  \nthe app\n\nJoin our 80M+ users\n\nGet started today\n\n### Buy crypto\n\nBuy BTC, ETH, and other crypto easily via bank transfer.\n\nBuy BTC, ETH, and other crypto easily\n\nwith\n\n### Price Alerts\n\nBe notified on BTC, ETH, XRP prices, and more.\n\nRecurring Buy\n\nGrow your portfolio automatically with daily, weekly, or monthly trades.\n\nOn-chain Staking\n\nGenerate passive income by helping  \nto secure blockchains.\n\nJoin our 80M+ users\n\nGet started today\n\nSorry, your browser doesn't support embedded videos.\n\n#### CRYPTO.COM VISA CARD\n\n## The only crypto card you need\n\nEnjoy up to 5% back on all spending with your sleek, pure metal card.  \nNo annual fees. Top-up with fiat or crypto.\n\nChoose Your Card\n\n#### CRYPTO EARN\n\n## Get the most out of your assets, safely\n\nChoose from 21+ cryptocurrencies including Bitcoin and stablecoins.\n\nCalculate Rewards\n\n#### CRYPTO.COM EXCHANGE\n\n## Trade bitcoin and other crypto with confidence on the world's fastest and\nmost secure crypto exchange\n\n#### DESKTOP\n\nGo to Crypto.com Exchange\n\n#### MOBILE\n\nDownload Exchange App\n\n##### Liquidity\n\nDeep order book liquidity in all market conditions\n\n##### Speed\n\n2.7m TPS matching engine\n\n50 micro second core latency\n\n##### Security\n\nSOC2 Type 1 Compliance\n\nPCI:DSS 3.2.1 Level 1 compliance\n\nISO/IEC 27001:2013\n\nISO/IEC 27701:2019\n\nISO 22301:2019\n\nSingapore Data Protection Trust Mark\n\n#### CRYPTO.COM DEFI\n\n## DeFi Made Simple\n\n### DeFi Wallet.  Your Keys, Your Crypto\n\n### DeFi Earn.  No lock-up period and stable returns.\n\n### DeFi Swap.  Swap DeFi coins and earn Triple Yield.\n\nGet DeFi Wallet\n\nExplore DeFi Features\n\nExplore DeFi Features\n\n#### OUR VISION\n\n## Cryptocurrency in Every Wallet™\n\nFounded in\n\n## 0\n\nUsers\n\n## 0M\n\nAbout Us\n\n### Frequently Asked Questions\n\n### What is crypto?\n\nCryptocurrency is a digital or virtual currency that operates on distributed\nledger technology called a blockchain and uses cryptography for security. It\nis decentralized and operates independently of a central bank.  \nUnlike traditional currencies, cryptocurrencies are not backed by a physical\ncommodity or government, and their value is determined by market demand and\nsupply. Cryptocurrencies can be used to buy goods and services, transfer\nfunds, and trade in markets. Popular cryptocurrencies include Bitcoin,\nEthereum, Litecoin, Ripple, and Cronos.  \nMany cryptocurrencies, like Bitcoin, are created through a process called\nmining, which involves solving complex mathematical equations to validate and\nrecord transactions on a blockchain. This mechanism is also called Proof of\nWork (PoW). Another consensus mechanism that has increased in popularity — as\nit is more energy efficient — is Proof of Stake (PoS). Instead of mining, PoS\nrelies on network participants validating transactions. Ethereum, the second-\nlargest cryptocurrency, uses this consensus mechanism.\n\n### What is Bitcoin?\n\nBitcoin is a cryptocurrency that operates on a peer-to-peer (P2P) network. It\nwas created in 2009 by an unknown person or group using the pseudonym Satoshi\nNakamoto. Bitcoin is the first and most well-known cryptocurrency, and it has\ngained significant popularity and value since its creation.  \nUnlike traditional fiat currency, which is controlled by central banks and\ngovernments, Bitcoin operates independently of any central authority.\nTransactions are verified and recorded on the blockchain, which is a\ndistributed ledger that maintains a permanent and transparent record of all\ntransactions.  \nBitcoin can be bought, sold, and exchanged on various cryptocurrency\nexchanges, and it can be used to purchase goods and services from merchants\nthat accept Bitcoin as a form of payment. The supply of bitcoins is limited to\n21 million units, and new bitcoins are created through mining, which involves\nusing specialized computer hardware to solve complex mathematical equations.  \nBitcoin is known for its high volatility, and its value can fluctuate rapidly\nin response to market conditions, news events, and other factors. Many\ntraders, including institutional investors, see Bitcoin as a store of value\nand a way to participate in the growing cryptocurrency ecosystem.\n\n### Where to buy crypto?\n\nThere are several ways to buy cryptocurrencies, including:  \n\n  1. Brokerage services: Crypto brokers allow users to simply buy and sell cryptocurrencies. A popular example is the Crypto.com App, trusted by over 80 million users. It is available at the Apple Store and on Google Play.\n  2. Cryptocurrency exchanges: These are online platforms where users can buy, sell, and trade cryptocurrencies using fiat currency or other cryptocurrencies. They offer more complex functions compared to a crypto brokerage, adding trading instruments like crypto derivatives. The Crypto.com Exchange is an example of a popular crypto exchange.\n  3. Peer-to-peer (P2P) marketplaces: These are platforms where buyers and sellers can directly trade cryptocurrencies without the involvement of a third-party exchange. This is also known as DeFi, short for decentralized finance. Multiple P2P crypto marketplaces can be accessed all in one app via the Crypto.com DeFi Wallet.\n\nIt is important to perform proper research and choose a reputable platform to\nbuy cryptocurrencies. For instance, Crypto.com holds the highest security\nrating in the industry. In addition, it is advisable to store cryptocurrencies\nsecurely in a wallet like the Crypto.com App or Crypto.com DeFi Wallet.\n\n### How to buy crypto?\n\nTo buy crypto, follow these general steps:  \n\n  1. Choose a crypto platform to use, like the Crypto.com Exchange or Crypto.com App.\n  2. Create an account on the chosen platform by providing personal information and ID verification, also known as ‘Know Your Customer’ (KYC) procedures.\n  3. Deposit fiat currency or another cryptocurrency into the newly created account. The Crypto.com App supports bank transfers, credit cards, debit cards, and cryptocurrency transfers to buy crypto, depending on region.\n  4. Navigate to the ‘Buy’ section of the Crypto.com Exchange or App and select the crypto to buy.\n  5. Enter the amount of cryptocurrency to buy and confirm the transaction.\n  6. The crypto will be deposited into the account. From here, it can be transferred to other crypto wallets or converted back to fiat currency and paid out to a bank account.\n\nIt is important to perform proper research and choose a reputable platform to\nbuy cryptocurrencies. For instance, Crypto.com holds the highest security\nrating in the industry. In addition, it is advisable to store cryptocurrencies\nsecurely in a wallet like the Crypto.com App or Crypto.com DeFi Wallet.\n\n### How to buy Bitcoin?\n\nUsers can buy Bitcoin from a cryptocurrency exchange, a crypto brokerage\nservice like the Crypto.com App, or a peer-to-peer (P2P) marketplace like\nthose found in the Crypto.com DeFi Wallet. Here are some general steps to\nbuying bitcoin from an exchange or brokerage service:  \n\n  1. Choose a reputable cryptocurrency platform that supports Bitcoin trading. Popular options include the Crypto.com App and the Crypto.com Exchange.\n  2. Create an account on the chosen platform and complete the KYC verification process, which may require providing personal identification documents.\n  3. Fund an account using a bank transfer, credit/debit card, or other cryptocurrency, depending on region.\n  4. Navigate to the ‘Buy’ section of the platform and select Bitcoin as the cryptocurrency to buy.\n  5. Enter the amount of bitcoin to buy, or the amount of fiat or cryptocurrency to spend.\n  6. Review the transaction details and confirm the purchase.\n  7. Once the transaction is complete, the bitcoin will be deposited into the chosen account. From here, the funds can be transferred to other crypto wallets or converted back to fiat currency and paid out to a bank account.\n\nIt is important to perform proper research and choose a reputable platform to\nbuy cryptocurrencies. For instance, Crypto.com holds the highest security\nrating in the industry. In addition, it is advisable to store cryptocurrencies\nsecurely in a wallet like the Crypto.com App or Crypto.com DeFi Wallet.\n\n### How to trade crypto?\n\nTo trade cryptocurrency, follow these general steps:  \n\n  1. Choose a cryptocurrency exchange that supports trading. A popular option is the Crypto.com Exchange.\n  2. Create an account on the chosen platform and perform ID verification, known as KYC (‘Know Your Customer’).\n  3. Deposit funds into the newly created account using a supported payment method. The Crypto.com Exchange supports bank transfers and credit/debit cards.\n  4. Navigate to the trading section of the platform and select the cryptocurrency pair to trade.\n  5. Choose whether to buy or sell the cryptocurrency, and enter the amount to trade.\n  6. Set the preferred price and order type. There are several types of orders, including market orders, limit orders, stop orders, and crypto options, which allow users to buy or sell at a specific price or under certain conditions.\n  7. Submit the trade order and wait for it to be executed. Depending on market conditions, the trade may be filled immediately, or it may take time to be filled.\n  8. Monitor trades and adjust strategies as necessary.\n\nHere is an introduction to trading on the Crypto.com Exchange.  \nIt is crucial to note that trading cryptocurrency carries risk, and it is\nimportant to trade only what you can afford to lose.\n\n### How to earn crypto?\n\nThere are several ways to earn cryptocurrency, including:  \n\n  1. Mining: Cryptocurrency mining involves using specialized computer hardware to solve complex mathematical equations that validate transactions on a blockchain network. Successful miners are rewarded with newly minted cryptocurrency for their efforts.\n  2. Staking/Lockups: Staking and lockups involve holding or locking up a certain amount of cryptocurrency in a wallet or on a platform to support the operations of the blockchain network. Stakers are rewarded with new cryptocurrency as a form of interest for their support.\n  3. Trading: Trading cryptocurrency involves buying and selling cryptocurrencies on exchanges or other trading platforms. Those who have a good understanding of market trends and are able to make informed trading decisions can earn profits through trading.\n  4. Airdrops: Airdrops are free distributions of cryptocurrency to users who meet certain criteria or participate in promotional activities.\n  5. Crypto Projects: Some blockchain projects offer rewards or bounties for users who contribute to their development or community. This can include activities like bug bounties, testing, or content creation.\n\nIt's important to note that each method of earning cryptocurrency carries its\nown risks and rewards. It is recommended to carefully research\ncryptocurrencies and understand the process before buying. Learn more about\nthe crypto market at Crypto.com University.\n\n### How to earn rewards on crypto?\n\nUsers can earn rewards on their cryptocurrency holdings through various\nproducts that offer rewards-bearing accounts or lending services. Here are\nsome ways to earn rewards on cryptocurrency:  \n\n  1. The Crypto.com App, Exchange, and DeFi Wallet all offer different ways to earn rewards on crypto, called Crypto Earn.\n  2. Create an account on the chosen platform and deposit cryptocurrency holdings into the rewards account.\n  3. Depending on the platform, users may earn rewards through lending their cryptocurrency to other users or by locking up their cryptocurrency for a period of time.\n  4. Some products offer fixed reward rates (e.g., the Crypto.com Visa Card), while others may offer variable rates that depend on market conditions (e.g., the 'Earn' feature in the Crypto.com DeFi Wallet).\n  5. Monitor rewards and adjust strategies as necessary.\n\nIt's important to note that earning interest and rewards on cryptocurrency\ncarries risks, including fluctuations in market conditions that may affect\ninterest rates. Make sure to carefully research and understand terms and\nconditions before depositing cryptocurrency.\n\nHave more questions? Contact Us\n\nGet started with crypto\n\nOr\n\nScan to Download\n\nFeatures\n\nBuy and Sell\n\nCrypto Earn\n\nOn-chain Staking\n\nCrypto.com Pay\n\nPay for Business\n\nMargin Trading\n\nDerivatives Trading\n\nSupercharger\n\nTrading Arena\n\nLearn\n\nUniversity\n\nResearch & Analysis\n\nGlossary\n\nBitcoin\n\nWhat is Ethereum?\n\nWhat is Blockchain?\n\nHow to buy Bitcoin?\n\nHow to buy Ethereum?\n\nHow to buy Crypto?\n\nWhat is Crypto?\n\nWhat is DeFi?\n\nPrices\n\nCrypto Prices\n\nBitcoin Price\n\nEthereum Price\n\nSite Widgets\n\nNews\n\nWhat's Trending\n\nMarket Updates\n\nProduct News\n\nCompany News\n\nEvents\n\nCompany\n\nAbout Us\n\nPartners\n\nSecurity\n\nProof of Reserves\n\nClimate\n\nCapital\n\nAffiliate\n\nCareers\n\nListing\n\nSupport\n\nFeatures\n\nBuy and Sell\n\nCrypto Earn\n\nOn-chain Staking\n\nCrypto.com Pay\n\nPay for Business\n\nMargin Trading\n\nDerivatives Trading\n\nSupercharger\n\nTrading Arena\n\nPrices\n\nCrypto Prices\n\nBitcoin Price\n\nEthereum Price\n\nSite Widgets\n\nNews\n\nWhat's Trending\n\nMarket Updates\n\nProduct News\n\nCompany News\n\nEvents\n\nLearn\n\nUniversity\n\nResearch & Analysis\n\nGlossary\n\nBitcoin\n\nWhat is Ethereum?\n\nWhat is Blockchain?\n\nHow to buy Bitcoin?\n\nHow to buy Ethereum?\n\nHow to buy Crypto?\n\nWhat is Crypto?\n\nWhat is DeFi?\n\nCompany\n\nAbout Us\n\nPartners\n\nSecurity\n\nProof of Reserves\n\nClimate\n\nCapital\n\nAffiliate\n\nCareers\n\nListing\n\nSupport\n\nGet started with crypto\n\nOr\n\nScan to Download\n\nProducts\n\nFeatures\n\nLearn\n\nPrices\n\nNews\n\nCompany\n\nGet started with crypto\n\nOr\n\nScan to Download\n\nThe purpose of this website is solely to display information regarding the\nproducts and services available on the Crypto.com App. It is not intended to\noffer access to any of such products and services. You may obtain access to\nsuch products and services on the Crypto.com App.\n\nPlease note that the availability of the products and services on the\nCrypto.com App is subject to jurisdictional limitations. Crypto.com may not\noffer certain products, features and/or services on the Crypto.com App in\ncertain jurisdictions due to potential or actual regulatory restrictions.\n\nCopyright © 2018 - 2024 Crypto.com. All rights reserved.\n\nPrivacy Notice\n\nStatus\n\nCookie Preferences\n\nWe use cookies on our website to operate our site, enhance your experience,\nanalyze our traffic and conduct advertising and analytics. For more\ninformation, or to customize your preferences, check \"Customize Settings\".\n\nCustomize Settings Disable All Accept All\n\n## Privacy Preference Center\n\nWhen you visit any website, it may store or retrieve information on your\nbrowser, in the form of cookies or other types of tracking technologies. This\ninformation might be about you, your preferences or your device and is used to\nmake the site work as you expect it to. The information does not usually\ndirectly identify you, but it can give you a more personalized web experience.\nWith respect to your privacy rights, you can choose not to allow some types of\ncookies. Click on the different category headings to find out more and\ncustomize your cookie preferences. However, blocking some types of cookies may\nimpact your experience of the site and the services we are able to offer.\n\nAllow All\n\n###  Manage Consent Preferences\n\n#### Strictly Necessary Cookies\n\nAlways Active\n\nStrictly Necessary Cookies\n\nThese cookies are necessary for the website to function and cannot be switched\noff in our systems. They are usually only set in response to actions made by\nyou which amount to a request for services, such as setting your privacy\npreferences, logging in or filling in forms. You can set your browser to block\nor alert you about these cookies, but some parts of the site will not then\nwork. These cookies do not store any personally identifiable information.\n\nCookies Details‎\n\n#### Performance Cookies\n\nPerformance Cookies\n\nThese cookies allow us to count visits and traffic sources so we can measure\nand improve the performance of our site. They help us to know which pages are\nthe most and least popular and see how visitors move around the site. All\ninformation these cookies collect is aggregated and therefore anonymous. If\nyou do not allow these cookies we will not know when you have visited our\nsite, and will not be able to monitor its performance.\n\nCookies Details‎\n\n#### Functional Cookies\n\nFunctional Cookies\n\nThese cookies enable the website to provide enhanced functionality and\npersonalization. They may be set by us or by third-party providers whose\nservices we have added to our pages. If you do not allow these cookies then\nsome or all of these services may not function properly.\n\nCookies Details‎\n\n#### Targeting Cookies\n\nTargeting Cookies\n\nThese cookies may be set through our site by our advertising partners. They\nmay be used by those companies to build a profile of your interests and show\nyou relevant adverts on other sites. They do not store directly personal\ninformation, but are based on uniquely identifying your browser and internet\ndevice. If you do not allow these cookies, you will experience less targeted\nadvertising.\n\nCookies Details‎\n\nDisable All Confirm My Choices\n\nBack Button\n\nBack\n\n### Performance Cookies\n\nVendor Search Search Icon Filter Icon\n\nClear Filters\n\nInformation storage and access\n\nApply\n\nConsent Leg.Interest\n\nAll Consent Allowed\n\nSelect All Vendors\n\nSelect All Vendors\n\nAll Consent Allowed\n\nDisable All Confirm My Choices\n\n",
    "links": "[{\"link\": \"https://crypto.com/\", \"text\": \"\"}, {\"link\": \"https://crypto.com/nft\", \"text\": \"NFT\"}, {\"link\": \"https://crypto.com/price\", \"text\": \"Prices\"}, {\"link\": \"https://crypto.com/exchange\", \"text\": \"\"}, {\"link\": \"https://crypto.com/defi-wallet\", \"text\": \"\"}, {\"link\": \"https://crypto.com/university/what-is-blockchain-consensus/\", \"text\": \"blockchain\"}, {\"link\": \"https://crypto.com/university/what-is-cryptography/\", \"text\": \"cryptography\"}, {\"link\": \"https://crypto.com/price/bitcoin\", \"text\": \"Bitcoin\"}, {\"link\": \"https://crypto.com/price/ethereum\", \"text\": \"Ethereum\"}, {\"link\": \"https://crypto.com/price/litecoin\", \"text\": \"Litecoin\"}, {\"link\": \"https://crypto.com/price/xrp\", \"text\": \"Ripple\"}, {\"link\": \"https://crypto.com/price/cronos\", \"text\": \"Cronos\"}, {\"link\": \"https://crypto.com/university/what-is-crypto-mining/\", \"text\": \"mining\"}, {\"link\": \"https://crypto.com/university/proof-of-stake-vs-proof-of-work/\", \"text\": \"Proof of Work (PoW)\"}, {\"link\": \"https://crypto.com/university/proof-of-stake-vs-proof-of-work/\", \"text\": \"Proof of Stake (PoS)\"}, {\"link\": \"https://crypto.com/university/what-is-bitcoin/\", \"text\": \"Bitcoin\"}, {\"link\": \"https://crypto.com/exchange\", \"text\": \"exchanges\"}, {\"link\": \"https://crypto.com/app\", \"text\": \"Crypto.com App\"}, {\"link\": \"https://crypto.com/exchange\", \"text\": \"Crypto.com Exchange\"}, {\"link\": \"https://crypto.com/university#de-fi\", \"text\": \"DeFi\"}, {\"link\": \"https://crypto.com/defi-wallet\", \"text\": \"Crypto.com DeFi Wallet\"}, {\"link\": \"https://crypto.com/security\", \"text\": \"highest security rating in the industry\"}, {\"link\": \"https://crypto.com/exchange\", \"text\": \"Crypto.com Exchange\"}, {\"link\": \"https://crypto.com/app\", \"text\": \"Crypto.com App\"}, {\"link\": \"https://crypto.com/university/what-is-kyc-in-crypto/\", \"text\": \"KYC\"}, {\"link\": \"https://crypto.com/security\", \"text\": \"highest security rating in the industry\"}, {\"link\": \"https://crypto.com/app\", \"text\": \"Crypto.com App\"}, {\"link\": \"https://crypto.com/defi-wallet\", \"text\": \"Crypto.com DeFi Wallet.\"}, {\"link\": \"https://crypto.com/university/what-is-bitcoin/\", \"text\": \"Bitcoin\"}, {\"link\": \"https://crypto.com/app\", \"text\": \"Crypto.com App\"}, {\"link\": \"https://crypto.com/defi-wallet\", \"text\": \"Crypto.com DeFi Wallet\"}, {\"link\": \"https://crypto.com/app\", \"text\": \"Crypto.com App\"}, {\"link\": \"https://crypto.com/exchange\", \"text\": \"Crypto.com Exchange\"}, {\"link\": \"https://crypto.com/university/what-is-kyc-in-crypto/\", \"text\": \"KYC\"}, {\"link\": \"https://crypto.com/security\", \"text\": \"highest security rating in the industry\"}, {\"link\": \"https://crypto.com/app\", \"text\": \"Crypto.com App\"}, {\"link\": \"https://crypto.com/defi-wallet\", \"text\": \"Crypto.com DeFi Wallet.\"}, {\"link\": \"https://crypto.com/exchange\", \"text\": \"Crypto.com Exchange\"}, {\"link\": \"https://crypto.com/university/what-is-kyc-in-crypto/\", \"text\": \"KYC\"}, {\"link\": \"https://crypto.com/university/how-does-crypto-exchange-work/\", \"text\": \"trading on the Crypto.com Exchange\"}, {\"link\": \"https://crypto.com/university/what-is-crypto-mining/\", \"text\": \"Mining\"}, {\"link\": \"https://crypto.com/university/staking-crypto/\", \"text\": \"Staking/Lockups\"}, {\"link\": \"https://crypto.com/university/how-does-crypto-exchange-work/\", \"text\": \"Trading\"}, {\"link\": \"https://crypto.com/university/how-to-dyor-crypto/\", \"text\": \"Crypto Projects\"}, {\"link\": \"https://crypto.com/university\", \"text\": \"Crypto.com University\"}, {\"link\": \"https://crypto.com/app\", \"text\": \"Crypto.com App\"}, {\"link\": \"https://crypto.com/exchange\", \"text\": \"Exchange\"}, {\"link\": \"https://crypto.com/defi-wallet\", \"text\": \"DeFi Wallet\"}, {\"link\": \"https://crypto.com/earn\", \"text\": \"Crypto Earn\"}, {\"link\": \"https://crypto.com/cards\", \"text\": \"Crypto.com Visa Card\"}, {\"link\": \"https://crypto.com/app\", \"text\": \"\"}, {\"link\": \"https://crypto.com/cards\", \"text\": \"\"}, {\"link\": \"https://crypto.com/exchange\", \"text\": \"\"}, {\"link\": \"https://crypto.com/defi-wallet\", \"text\": \"\"}, {\"link\": \"https://crypto.com/nft\", \"text\": \"\"}, {\"link\": \"https://crypto.com/app\", \"text\": \"Buy and Sell\"}, {\"link\": \"https://crypto.com/earn\", \"text\": \"Crypto Earn\"}, {\"link\": \"https://crypto.com/staking\", \"text\": \"On-chain Staking\"}, {\"link\": \"https://crypto.com/pay\", \"text\": \"Crypto.com Pay\"}, {\"link\": \"https://crypto.com/pay-merchant\", \"text\": \"Pay for Business\"}, {\"link\": \"https://crypto.com/exchange/trade/BTC_USD\", \"text\": \"Margin Trading\"}, {\"link\": \"https://crypto.com/exchange/trade/BTCUSD-PERP\", \"text\": \"Derivatives Trading\"}, {\"link\": \"https://crypto.com/exchange/supercharger\", \"text\": \"Supercharger\"}, {\"link\": \"https://crypto.com/exchange/trading-arena\", \"text\": \"Trading Arena\"}, {\"link\": \"https://crypto.com/university\", \"text\": \"University\"}, {\"link\": \"https://crypto.com/research\", \"text\": \"Research & Analysis\"}, {\"link\": \"https://crypto.com/glossary\", \"text\": \"Glossary\"}, {\"link\": \"https://crypto.com/bitcoin\", \"text\": \"Bitcoin\"}, {\"link\": \"https://crypto.com/university/ethereum-vs-ethereum-classic\", \"text\": \"What is Ethereum?\"}, {\"link\": \"https://crypto.com/university/what-is-blockchain-consensus\", \"text\": \"What is Blockchain?\"}, {\"link\": \"https://crypto.com/university/how-to-buy-bitcoin\", \"text\": \"How to buy Bitcoin?\"}, {\"link\": \"https://crypto.com/university/how-to-buy-ethereum\", \"text\": \"How to buy Ethereum?\"}, {\"link\": \"https://crypto.com/university/how-to-buy-bitcoin-cryptocurrencies\", \"text\": \"How to buy Crypto?\"}, {\"link\": \"https://crypto.com/university/what-is-cryptocurrency\", \"text\": \"What is Crypto?\"}, {\"link\": \"https://crypto.com/university/decentralised-finance-defi-intro\", \"text\": \"What is DeFi?\"}, {\"link\": \"https://crypto.com/price\", \"text\": \"Crypto Prices\"}, {\"link\": \"https://crypto.com/price/bitcoin\", \"text\": \"Bitcoin Price\"}, {\"link\": \"https://crypto.com/price/ethereum\", \"text\": \"Ethereum Price\"}, {\"link\": \"https://crypto.com/price/widget\", \"text\": \"Site Widgets\"}, {\"link\": \"https://crypto.com/trending\", \"text\": \"What's Trending\"}, {\"link\": \"https://crypto.com/market-updates\", \"text\": \"Market Updates\"}, {\"link\": \"https://crypto.com/product-news\", \"text\": \"Product News\"}, {\"link\": \"https://crypto.com/company-news\", \"text\": \"Company News\"}, {\"link\": \"https://crypto.com/events\", \"text\": \"Events\"}, {\"link\": \"https://crypto.com/about\", \"text\": \"About Us\"}, {\"link\": \"https://crypto.com/partners\", \"text\": \"Partners\"}, {\"link\": \"https://crypto.com/security\", \"text\": \"Security\"}, {\"link\": \"https://crypto.com/proof-of-reserves\", \"text\": \"Proof of Reserves\"}, {\"link\": \"https://crypto.com/company-news/crypto-coms-climate-commitment-2\", \"text\": \"Climate\"}, {\"link\": \"https://crypto.com/capital\", \"text\": \"Capital\"}, {\"link\": \"https://crypto.com/affiliate\", \"text\": \"Affiliate\"}, {\"link\": \"https://crypto.com/careers\", \"text\": \"Careers\"}, {\"link\": \"https://crypto.com/listing\", \"text\": \"Listing\"}, {\"link\": \"https://crypto.com/app\", \"text\": \"Buy and Sell\"}, {\"link\": \"https://crypto.com/earn\", \"text\": \"Crypto Earn\"}, {\"link\": \"https://crypto.com/staking\", \"text\": \"On-chain Staking\"}, {\"link\": \"https://crypto.com/pay\", \"text\": \"Crypto.com Pay\"}, {\"link\": \"https://crypto.com/pay-merchant\", \"text\": \"Pay for Business\"}, {\"link\": \"https://crypto.com/exchange/trade/BTC_USD\", \"text\": \"Margin Trading\"}, {\"link\": \"https://crypto.com/exchange/trade/BTCUSD-PERP\", \"text\": \"Derivatives Trading\"}, {\"link\": \"https://crypto.com/exchange/supercharger\", \"text\": \"Supercharger\"}, {\"link\": \"https://crypto.com/exchange/trading-arena\", \"text\": \"Trading Arena\"}, {\"link\": \"https://crypto.com/price\", \"text\": \"Crypto Prices\"}, {\"link\": \"https://crypto.com/price/bitcoin\", \"text\": \"Bitcoin Price\"}, {\"link\": \"https://crypto.com/price/ethereum\", \"text\": \"Ethereum Price\"}, {\"link\": \"https://crypto.com/price/widget\", \"text\": \"Site Widgets\"}, {\"link\": \"https://crypto.com/trending\", \"text\": \"What's Trending\"}, {\"link\": \"https://crypto.com/market-updates\", \"text\": \"Market Updates\"}, {\"link\": \"https://crypto.com/product-news\", \"text\": \"Product News\"}, {\"link\": \"https://crypto.com/company-news\", \"text\": \"Company News\"}, {\"link\": \"https://crypto.com/events\", \"text\": \"Events\"}, {\"link\": \"https://crypto.com/university\", \"text\": \"University\"}, {\"link\": \"https://crypto.com/research\", \"text\": \"Research & Analysis\"}, {\"link\": \"https://crypto.com/glossary\", \"text\": \"Glossary\"}, {\"link\": \"https://crypto.com/bitcoin\", \"text\": \"Bitcoin\"}, {\"link\": \"https://crypto.com/university/ethereum-vs-ethereum-classic\", \"text\": \"What is Ethereum?\"}, {\"link\": \"https://crypto.com/university/what-is-blockchain-consensus\", \"text\": \"What is Blockchain?\"}, {\"link\": \"https://crypto.com/university/how-to-buy-bitcoin\", \"text\": \"How to buy Bitcoin?\"}, {\"link\": \"https://crypto.com/university/how-to-buy-ethereum\", \"text\": \"How to buy Ethereum?\"}, {\"link\": \"https://crypto.com/university/how-to-buy-bitcoin-cryptocurrencies\", \"text\": \"How to buy Crypto?\"}, {\"link\": \"https://crypto.com/university/what-is-cryptocurrency\", \"text\": \"What is Crypto?\"}, {\"link\": \"https://crypto.com/university/decentralised-finance-defi-intro\", \"text\": \"What is DeFi?\"}, {\"link\": \"https://crypto.com/about\", \"text\": \"About Us\"}, {\"link\": \"https://crypto.com/partners\", \"text\": \"Partners\"}, {\"link\": \"https://crypto.com/security\", \"text\": \"Security\"}, {\"link\": \"https://crypto.com/proof-of-reserves\", \"text\": \"Proof of Reserves\"}, {\"link\": \"https://crypto.com/company-news/crypto-coms-climate-commitment-2\", \"text\": \"Climate\"}, {\"link\": \"https://crypto.com/capital\", \"text\": \"Capital\"}, {\"link\": \"https://crypto.com/affiliate\", \"text\": \"Affiliate\"}, {\"link\": \"https://crypto.com/careers\", \"text\": \"Careers\"}, {\"link\": \"https://crypto.com/listing\", \"text\": \"Listing\"}, {\"link\": \"https://crypto.com/privacy/global.pdf\", \"text\": \"Privacy Notice\"}]"
}