{
    "summary": "Docs\n\nCustomers\n\nIntegrations\n\nCompany\n\nDeploy Now\n\nBook Demo\n\nNow Supporting Celestia Data Availability!\n\n# Deploy Rollups  \nIn One Click\n\nLaunch\n\nOP Stack,\n\nArbitrum Orbit, and\n\nPolygon CDK rollups\n\nwith Caldera, your partner from development, to launch, and beyond\n\nBook Demo\n\nDeploy Now ->\n\nPowering ambitious teams across Web3\n\n  *   *   *   *   *   *   *   * \n\nExplore Customers\n\n## 1\\. Build\n\nBuild with Arbitrum Nitro, the OP Stack, or the Polygon CDK\n\nChoose whether to opt for shared, decentralized sequencing at inception\n\nLower fees by 10-100x by using Celestia, Eigen, or NEAR for DA\n\nChoose any token as the native, fee-paying token of your chain\n\n## 2\\. Launch\n\nConnect to your chain via Caldera RPCs - we'll host the infrastructure\n\nLaunch Solidity smart contracts. Caldera rollups are fully EVM-compatible\n\nLeverage Caldera’s native bridge UI to deposit and withdraw funds, or bridge\nvia one of our third-party partners\n\nGive builders a familiar developer experience, with a block explorer,\ntransaction data API, indexer, and more\n\n## 3\\. Scale\n\nNever run into performance issues. Caldera’s nodes scale as usage increases\n\nCaldera chains offer 99.99% uptime SLAs.\n\nLeverage Caldera’s audience to bootstrap user adoption\n\n24/7 access to our technical team — no coding required\n\nGet Started\n\nFeatures\n\n## Everything You Need\n\n### Block Explorer\n\nView and analyze transaction history and state\n\n### Bridge UI\n\nBridge assets to-and-from your chain on demand\n\n### Automatic Monitoring\n\nAutomatically report chain downtime and other alerts\n\n### Developer Tools\n\nAccess to SDKs across the Thirdweb product suite\n\n### Faucets\n\nTest with your Caldera chain’s native cryptocurrency token\n\n### Hub Page\n\nShareable Page with access all essential user-facing tooling\n\n### Self-Hosting\n\nOptionally, run your own archive or verifier nodes\n\n### Verifiers\n\nEnsure the chain is running correctly\n\nIntegrations\n\n## 50+  \nIntegrations\n\nIntegrate tooling into your rollup from any of our partners to support your\nusers on-chain.\n\nView all Integrations\n\nInfrastructure\n\n## Infrastructure You Can Rely On\n\n### Protection from Attacks\n\nIntegrated with Cloudflare for DDOS attack protection\n\n### Accessible Everywhere, Fast\n\nLeveraging Amazon Web Services’ exceptional network\n\n### High Availability\n\nIndustry-standard cloud infrastructure setup\n\n-> Learn more about our best-in-class reliability\n\n### Seriously Secure\n\nAudited by a leading cloud security firm, using best-practices for on-chain\nsecurity\n\n-> Learn more about our security practices\n\nThe Numbers\n\n## Our Ecosystem\n\nBuild with Caldera for seamless rollup deployment, powerful developer tooling,\nand reliable infrastructure.\n\nGet Started\n\n30+\n\nteams building with Caldera\n\n>$1.5B\n\nTVL across Caldera chains\n\n50+\n\nleading integration partners\n\n99.99%\n\nuptime SLAs\n\nTestimonials\n\n## What Our Teams Say\n\n  * \"Caldera has built a robust infrastructure stack for rapidly deploying state of the art rollups. We could not have asked for a better partner.\"\n\nEric Chen\n\nCEO, Co-Founder\n\n  * \"Caldera has contributed crucial components of the modular technology framework for Manta. Our close partnership has been instrumental in the flourishing of the entire Manta ecosystem.\"\n\nVictor Ji\n\nCEO, Co-Founder\n\n  * \"Partnering with Caldera was a no-brainer for us. Thanks to their expertise, we can focus on developing Kinto further and let the experts handle our blockchain infrastructure.\"\n\nRamon Recuero\n\nCEO, Co-Founder\n\n  * \"AGLD DAO is excited to serve its original purpose as the incentivization token for the Lootverse and to power Autonomous Worlds with the Lootchain, built with Caldera.\"\n\nMike\n\nContributor\n\n  * \"Caldera has been phenomenal in their support for Primodium and the entire on-chain gaming community. 10/10, would recommend to any team looking to grow their user base.\"\n\nEmerson Hsieh\n\nCEO, Co-Founder\n\n  * \"Working with the Caldera team has been instrumental to our progress. Their immense professionalism and expertise in this field come second to none.\"\n\n\"Xen\"\n\nCEO, Co-Founder\n\n  * \"Working with Caldera has been awesome. Responsive, fast, flexible. Their infra is solid and scalable.\"\n\nChris Cassano\n\nCTO, Co-Founder\n\n  * \"Collaborating with Caldera has allowed us to move and experiment faster while freeing up our engineering resources. We are thrilled to be working with their highly knowledgeable team.\"\n\nMadhur Kumar Sharma\n\nCo-Founder\n\nFAQ\n\n## Common Questions\n\nGet quick answers to your questions about Caldera.\n\n### How do I create a Caldera chain?\n\n### Do I need an engineering team to run a Caldera chain?\n\n### Who hosts the infrastructure for Caldera chains?\n\n### Can I transfer funds between my Caldera chain and other blockchains?\n\n### What assets can be bridged?\n\n### What tokens can be used for gas fees on my Caldera chain?\n\nMENU\n\nHome\n\nDocs\n\nCustomers\n\nIntegrations\n\nBlog\n\nCareers\n\nCONTACT US\n\nsupport@caldera.xyz\n\n© Copyright 2023. All rights Reserved.\n\n",
    "links": "[]"
}