{
    "summary": "Start Secure Automation Stack Builder Stories The Stackers Partners Support\nPortal\n\n#  Stackers  We are Architects,  \nEngineers,  \nNinjas,  \nArtists,  \nListeners.\n\n# We Start With Secure\n\nOperational excellence starts with policies and procedures that provide for\nstreamlined, efficient, and predictable development, deployment and management\nof both infrastructure and applications.\n\nSecurity requirements need to be inherent to infrastructure automation, system\nbuilds and ongoing operations — a prerequisite, not an afterthought.\n\nThe OpStack Way\n\n# Automation is Smart Business\n\nThere are just too many applications, containers, and servers in the world to\nadminister them one at a time. Whether you are deploying servers and\napplications in a data center, a private cloud, or a public cloud, automating\nyour operations function is now necessary for success. The OpStack team of\nexperienced practitioners has successfully automated operations for top 10\nbanks, big 4 accounting firms, billion dollar SaaS providers, and Fortune 100\ne-commerce sites.\n\nOpStack Automates\n\n# The Stack Builder\n\nThe OpStack team has worked with dozens of software languages, tools, and\npackages in automating operations as employees of a half-dozen different firms\nover the last 15 years. Some lessons can only be learned by hands on\nexperience and successful trial-and-error.\n\nThe OpStack Stack Builder builds on the best available open source languages\nand components to simplify the automation of processes across both our\ncustomers in-house and cloud infrastructure assets. By providing a framework\nand common set of tools, the orchestration of complex processes across\ndisciplines becomes straight-forward and manageable.\n\nThe Stack Builder\n\nNotification\n\nPagerduty\n\nTeams\n\nxMatters\n\nE-Mail\n\nSlack\n\nNOC\n\nEnterprise\n\nOffice 365\n\nTeams\n\nG-Suite\n\nServiceNow\n\nSlack\n\nAtlassian\n\nObservability\n\nSplunk\n\nNagios\n\nSCCM\n\nAppDynamics\n\nCloudWatch\n\nPrometheus\n\nSecurity\n\nCisco\n\nNessus\n\nTripwire\n\nQualys\n\nCarbon Black\n\nCrowdStrike\n\nOperating Systems\n\nWindows\n\nLinux (Suse)\n\nLinux (Red Hat)\n\nLinux (Debian)\n\nFreeBSD\n\nUnix\n\nCompute\n\nHPE\n\nCisco UCS\n\nDell\n\nIBM\n\nLenovo\n\nWhite Box\n\nStorage\n\nEMC\n\nPure\n\nHPE\n\n3PAR\n\nNetApp\n\nWhite Box\n\nDatabase\n\nOracle\n\nMS SQL\n\nPostgres\n\nMySQL\n\nMongoDB\n\nIBM DB2\n\nIdentify & Access\n\nActive Directory\n\nGemalto\n\nVault\n\nCyberark\n\nAWS IAM\n\nSiteMinder\n\nCloud\n\nAWS\n\nAzure\n\nGCP\n\nIBM\n\nDigital Ocean\n\nOn-Premise\n\nOrchestration\n\nAnsible\n\nTerraform\n\nSaltstack\n\nPuppet\n\nKubernetes\n\nEKS\n\nTesting\n\nLocust\n\nSelenium\n\nHP Loadrunner\n\nIBM Rational\n\nJMeter\n\nJUnit\n\nSource Control\n\nAzure DevOps\n\nGithub\n\nGitlab\n\nBitbucket\n\nSVN\n\nArtifactory\n\nScripting\n\nPython\n\nPowershell\n\nJava\n\nGo\n\nPerl\n\nRuby\n\n# Featured Stack Leveraging Cloud Technology  \nas Trading Infrastructure\n\nTrading systems have long exploited new technologies to give market\nparticipants advantages in understanding, strategy, and timing to improve\noutcomes. The increasing exploitation of latency reductions for market\nadvantage has made co-location with major venues critical — leading market\nparticipants to make increasing capital expenses for on-premise and co-lo\ninfrastructure.\n\nFor much of IT, the major trend in the second decade of the century is the\nmove to leverage major cloud service providers to provide flexibility,\ninnovation, and capital efficiency in providing services. Regulatory, control,\nand latency requirements for trading systems have made them one of the last\napplication areas to move to the cloud. OpStack believes that with thoughtful\narchitecture it can be remarkably effective to build and operate trading\nsystems using a hybrid cloud approach.\n\nIn consultation with the lead architect at a financial services firm, OpStack\ndeveloped this reference infrastructure to allow leveraging public cloud\nservices to substantially reduce the capital investment needed to enter a new\nmarket without sacrificing any competitive advantage to other participants\nfully co-located with the electronic trading venues. In this architecture, the\npresumption was to use cloud neutral technologies (Docker, Kubernetes, et al)\nwith the possibility of replacing some of the less latency sensitive elements\nwith PaaS elements — we envisioned the trade history databases leveraging a\ncloud DBaaS (Database as a Service) offering rather than building and\nmaintaining dedicated clusters from scratch on cloud IaaS (Infrastructure as a\nService).\n\nOpStack uses discussion documents, like this one, as a means of creating\nconversations with partners that lead to business-specific solutions. We\nspecified this candidate architecture in a fair amount of detail in order to\nillustrate its viability and cost-effectiveness, with the understanding that a\nfinal solution for any client and market will be at least adjusted if not\nredirected by that ongoing discussion.\n\nFull Story\n\n## More Stories\n\nCase Study Cloud Migration  Case Study Installation Automation  Case Study\nVulnerability Management  Case Study Container Innovation  Article Secure\nVirtual Desktop  Opinion Automation and Orchestration  Article Purpose Built\nfor Remote Working\n\n# The Stackers\n\nWe hate repetitive work — we want to minimize it in our lives and the lives of\nour customers. OpStack team members have successfully automated operations for\ntop 10 banks, big 4 accounting firms, billion dollar SaaS providers, and\nFortune 100 e-commerce sites.\n\nWe’ve evaluated the available technologies, defined the critical processes,\nand refined the OpStack approach across a wide range of technology\narchitectures and platforms. The fundamentals of operations automation are a\nsolved problem — this lets OpStack apply them to client-specific challenges\nand opportunities.\n\nEvan Bauer  Partner & Chief Stacker\n\nDavid Kennedy  Partner & The Midnight Coder\n\nRay Ramirez  Partner & The Problem Solver\n\nJered Sutton  Partner & The Source\n\nJared Trog  Partner & The Ninja\n\nAmauri Viguera  Partner & The Diplomat\n\nMark Casey  Stacker & The Containerist\n\nMichael Charo  Stacker & The Shadow\n\nJosh Kropf  Stacker & The Code Slinger\n\nHai Nguyen  Stacker & The Registry\n\nMatthew Slanker  Stacker & The Alchemist\n\nAdam Wenger  Stacker & The Sequel\n\nChuck Kelley  Advisor & The Data Guru\n\n# Our Partners\n\nOpStack was formed because we like and trust each other. Nothing is of more\nimportance to a successful business than working with the right people.\n\nWhen it comes to partnerships, that’s even more crucial. The teams and\ntechnologies you work with can make or break your customer, your business,\nyour prosperity, and by extension, your well-being.\n\n##  Open Source  \nCommunities\n\nWe formed OpStack to be different. We believe that having an open bond with\nothers builds valuable relationships. In addition to our partners above, we\nwork with and participate actively in the community.\n\nThese communities are important sources of technical innovation, helping many\nfirms develop successful market and profit strategies. We are strong\nsupporters, beneficiaries and contributors of open source and open source\nprojects.\n\n##  Local  \nCommunities\n\nWhether this is sharing our code in the Open Source community or donating back\nto our local communities gives us a deeper sense of belonging and makes us all\nstronger.\n\nOpStack partners formed the company with the knowledge that a workplace that\nencourages giving back is better for everyone—including those who’ll follow in\nour footsteps.\n\ninfo@opstack.com\n\n©Copyright 2021 OpStack Inc.  \nStart Secure Automation Stack Builder Stories The Stackers Partners Careers\n\nWe use cookies!\n\nHi, this website uses essential cookies to ensure its proper operation and\ntracking cookies to understand how you interact with it. The latter will be\nset only after consent. Let me choose\n\nAccept allReject all\n\nCookie Settings\n\nI use cookies to ensure the basic functionalities of the website and to\nenhance your online experience. You can choose for each category to opt-in/out\nwhenever you want. For more details relative to cookies and other sensitive\ndata, please read the full privacy policy.\n\nStrictly necessary cookiesStrictly necessary cookies\n\nThese cookies are essential for the proper functioning of my website. Without\nthese cookies, the website would not work properly\n\nPerformance and Analytics cookiesPerformance and Analytics cookies\n\nThese cookies allow the website to remember the choices you have made in the\npast\n\nAccept allReject allSave settings\n\n",
    "links": "[{\"link\": \"https://www.opstack.com/#start-secure\", \"text\": \"Start Secure\"}, {\"link\": \"https://www.opstack.com/#automation\", \"text\": \"Automation\"}, {\"link\": \"https://www.opstack.com/#stack-builder\", \"text\": \"Stack Builder\"}, {\"link\": \"https://www.opstack.com/#stories\", \"text\": \"Stories\"}, {\"link\": \"https://www.opstack.com/#stackers\", \"text\": \"The Stackers\"}, {\"link\": \"https://www.opstack.com/#partners\", \"text\": \"Partners\"}, {\"link\": \"https://www.opstack.com/careers\", \"text\": \"Careers\"}, {\"link\": \"https://www.opstack.com/privacy\", \"text\": \"privacy policy\"}]"
}