{
    "summary": "  * # About\n\n    * Who we are\n    * Who trusts us\n    * Brand\n    * Comprehensive protection\n\n  * # Services\n\n    * Security advisory-as-a-service\n    * Advanced penetration testing\n    * Smart contract audit\n    * DevOps + automation\n\n  * # Security Solution Center\n\n  * # Disclosures\n\n    * Halborn MetaMask “Demonic” Vulnerability Discovery\n    * Halborn Cadence (Flow) Vulnerability Discovery \n    * Halborn Discovers Zero-Day Vulnerability in CosmWasm Smart Contracts Across 20+ Blockchains\n    * Halborn “Rab13s” Vulnerability Discovery In Dogecoin and 280+ Networks\n    * Vulnerability Disclosure Policy\n\n  * # Reports\n\n    * Top 50 DeFi Hacks\n    * ChatGPT\n\n  * # Sans Training\n\n  * # Resources\n\n    * Audits\n    * Case Studies\n\n  * # Careers\n\n  * # Blog\n\n  * # BVSS\n\n  * # Contact\n\n  *   *   *   * \n\n* * *\n\n## // Blog\n\nBlockchain Security\n\n* * *\n\n# What Is Rollup-as-a-Service (RaaS) And What Are Its Advantages?\n\n* * *\n\nRob Behnke\n\nOctober 25th, 2023\n\n* * *\n\nSmart contract platforms like _Ethereum_ offer numerous benefits for\ndevelopers. For example, the decentralized nature of the blockchain provides\nadditional resiliency and censorship resistance to the applications built on\nit. Additionally, cryptocurrency offers a built-in payment system — making it\neasy to implement in-game purchases — and non-fungible tokens (NFTs) enable\ntracking of in-game assets.\n\nHowever, some of the main limitations of blockchain platforms are their\nthroughput and scalability. Since blockchains add data to the blockchain as\npart of blocks with a fixed maximum size, they commonly have limited\nthroughput and slow transaction speeds. This can be problematic if a Web3 game\nor other dApp requires frequent interaction or low latency.\n\nRollups and Rollup-as-a-Service (RaaS) platforms offer a solution to this\nproblem. By recording transactions off-chain and using the blockchain to\nsecure or verify these transactions, rollups provide the scalability and\ntransaction speeds that developers need.\n\nThis is a more modular approach to blockchain and the development of dApps on\nthe blockchain. Instead of cramming everything into Layer 1, Rollups enable\nspecialized applications to be built on higher layers that roll up to a\ntrusted blockchain.\n\n## The Path to Rollups-as-a-Service\n\nRaaS is a service offering designed to make it easier for developers to build\non top of Ethereum and other blockchains. To grasp the appeal of these\nservices, it’s helpful to understand some of their alternatives and\nprecursors.\n\n### Layer 1s and Sidechains\n\nThe major blockchain platforms like Ethereum have transaction speed and\nscalability challenges. One option for developers looking to build on the\nblockchain but avoid these issues is to create their own Layer 1.\n\nCreating a Layer 1 isn’t too difficult with many open-source blockchains to\nfork and platforms such as Polygon. However, it does have its downsides. While\nan app’s Layer 1 may use cross-chain bridges to enable transfers to other\nLayer 1, it might struggle to build the community needed for strong security.\nFor example, blockchains like Bitcoin and Ethereum have massive communities\nsupporting their consensus algorithms, making them much more resilient to\nattack than many alternatives.\n\n### Rollups\n\nRollups address the scalability problem by building up rather than in\nparallel. A Rollup is a Layer 2 protocol that sits on top of an existing\nblockchain and records summaries of transactions performed off-chain on a\ntrusted Layer 1. Rollups take batches of transactions and record minimal data\non-chain to reflect the state updates performed as a result of those\ntransactions.\n\nRollups come in two main flavors:  \n\n  *  **Optimistic Rollups:** An Optimistic Rollup assumes that rollup transactions are legitimate until proven otherwise. Optimistic Rollups have a challenge period during which someone can submit proof that a rollup transaction is invalid. If no challenge is submitted during the challenge period, the transactions are assumed to be valid and processed.\n\n  *  **ZK-Rollups:** A ZK-Rollup uses _zero-knowledge proofs_ to demonstrate the validity of its state updates. With these proofs, anyone can validate that a batch of transactions is correct without needing access to the full transaction data on-chain.\n\nSeveral Rollup platforms exist, such as zkSync and Starknet. Developers can\nbuild on these platforms to record transactions off-chain, enabling faster\nmore scalable transactions than building on a Layer 1 platform.\n\n### Rollup Frameworks\n\nWorking with an existing Rollup platform can be limiting for a developer. The\nplatform may have made certain decisions regarding transaction structure, rate\nof recording transactions on-chain, etc., that might not work with a\ndeveloper’s needs. Additionally, most Rollup platforms have limited\ncapacities, so a developer building on a popular Rollup platform may face the\nsame problems that they would on a Layer 1 blockchain.\n\nRollup Frameworks and SDKs — such as Rollkit, Arbitrum Orbit, and OP Stack —\nprovide developers with the tools that they need to create their own Rollups.\nRollups are implemented as smart contracts, so by modifying an existing Rollup\nframework, a developer can create and deploy a Rollup customized to their\nunique needs.\n\nRollup SDKs provide developers with the greatest level of control over the\ninfrastructure supporting their applications. However, creating and\ncustomizing a Rollup using an SDK requires deep technical knowledge and the\nability to modify, deploy, and operate a rollup contract.\n\n## What is a Rollup-as-a-Service?\n\nRollups-as-a-Service (RaaS) providers handle the challenge of creating and\ncustomizing a Rollup for a developer. These providers make it easier for the\ndeveloper to tailor features such as data availability, fee payments, and\nother aspects of a Rollup to their application.\n\n## Advantages of RaaS\n\nRollups-as-a-Service provides a few advantages when compared to the other\noptions that developers have, such as:\n\n  *  **Scalability:** RaaS allows an application to operate its own Rollup. This provides much greater scalability than using an existing Layer 1 or a shared Rollup where the application needs to compete for space with other applications and other transactions.\n\n  \n\n  *  **Transaction Speed:** If a RaaS provider offers ZK-Rollups, the application can have very quick resolution times for transactions. This is especially true since parameters such as the time between batches of transactions being written to the blockchain is under the control of the developer.\n\n  \n\n  *  **Customizability:** RaaS enables a developer to customize a Rollup to meet their application’s unique needs. This may offer improved scalability, transaction speeds, or fee structures when compared to working with an existing Layer 1 or Rollup platform.\n\n  \n\n  *  **Security:** While implementing a new Layer 1 offers high customizability, these standalone blockchains may not be as secure. Rollups rely on a host blockchain for security, granting them the same level of security as Ethereum or whatever blockchain they are hosted on.\n\n  \n\n  *  **Ease of Use:** Rollup Frameworks enable developers to create their own Rollups, but they can be difficult to use. RaaS enables a developer to rely on third-party expertise when creating Rollups.\n\n## Conclusion\n\nRollups-as-a-Service provide another option for scaling and speeding up\nblockchain technology. While Rollups offer similar features, they can suffer\nfrom congestion, lack of alignment to a developer’s needs, or limited ease of\nuse.\n\nWith RaaS, developers get the best of both worlds with a solution that not\nonly is customized to their needs but is easier to use due to the services of\na Rollup provider. Additionally Rollups – under a RaaS model or otherwise –\noffer greater security than a standalone blockchain since their security is\nbased on that of the blockchain platform that they write their data to.\n\nSHARE\n\n  *   *   *   *   * \n\n  *   *   *   *   * \n\n* * *\n\n## Let's Talk\n\nContact Us\n\n## Stay Updated\n\nSubmit\n\n## Let's Talk\n\nContact Us\n\n* * *\n\n## Stay Updated\n\nSubmit\n\n* * *\n\n* * *\n\n  *   *   *   * \n\n© Halborn 2023. All rights reserved.\n\nPrivacy Policy | Terms of Use\n\n",
    "links": "[{\"link\": \"https://www.halborn.com/about/who-we-are\", \"text\": \"Who we are\"}, {\"link\": \"https://www.halborn.com/about/who-trusts-us\", \"text\": \"Who trusts us\"}, {\"link\": \"https://www.halborn.com/about/brand\", \"text\": \"Brand\"}, {\"link\": \"https://www.halborn.com/about/comprehensive-protection\", \"text\": \"Comprehensive protection\"}, {\"link\": \"https://www.halborn.com/services/security-advisory-as-a-service\", \"text\": \"Security advisory-as-a-service\"}, {\"link\": \"https://www.halborn.com/services/advanced-penetration-testing\", \"text\": \"Advanced penetration testing\"}, {\"link\": \"https://www.halborn.com/services/smart-contract-audits\", \"text\": \"Smart contract audit\"}, {\"link\": \"https://www.halborn.com/services/devops-plus-automation\", \"text\": \"DevOps + automation\"}, {\"link\": \"https://www.halborn.com/disclosures/demonic-vulnerability\", \"text\": \"Halborn MetaMask “Demonic” Vulnerability Discovery\"}, {\"link\": \"https://www.halborn.com/disclosures/halborn-cadence-flow-vulnerability-discovery\", \"text\": \"Halborn Cadence (Flow) Vulnerability Discovery \"}, {\"link\": \"https://www.halborn.com/disclosures/halborn-discovers-zero-day-vulnerability-in-cosmwasm\", \"text\": \"Halborn Discovers Zero-Day Vulnerability in CosmWasm Smart Contracts Across 20+ Blockchains\"}, {\"link\": \"https://www.halborn.com/disclosures/rab13s-vulnerability-dogecoin\", \"text\": \"Halborn “Rab13s” Vulnerability Discovery In Dogecoin and 280+ Networks\"}, {\"link\": \"https://www.halborn.com/disclosures/disclosure-policy\", \"text\": \"Vulnerability Disclosure Policy\"}, {\"link\": \"https://www.halborn.com/reports/top-50-defi-hacks\", \"text\": \"Top 50 DeFi Hacks\"}, {\"link\": \"https://www.halborn.com/reports/chatgpt\", \"text\": \"ChatGPT\"}, {\"link\": \"https://www.halborn.com/resources\", \"text\": \"Audits\"}, {\"link\": \"https://www.halborn.com/case-studies\", \"text\": \"Case Studies\"}, {\"link\": \"https://www.halborn.com/contact\", \"text\": \"Contact Us\"}, {\"link\": \"https://www.halborn.com/contact\", \"text\": \"Contact Us\"}, {\"link\": \"https://www.halborn.com/\", \"text\": \"\"}, {\"link\": \"https://www.halborn.com/privacy\", \"text\": \"Privacy Policy\"}, {\"link\": \"https://www.halborn.com/terms\", \"text\": \"Terms of Use\"}, {\"link\": \"https://www.halborn.com/\", \"text\": \"\"}]"
}