{
    "summary": "  * Courses __\n  * Learn with us __\n  * Our graduates __\n  * Online Events\n  * Blog\n\nLogin\n\n## Courses\n\n✕\n\n##### Programs to change your career\n\n  * UX Design\n\n  * UI Design\n\n  * Full-Stack Web Development\n\n  * Data Analytics\n\n  * Digital Marketing\n\n  * Product Management\n\nnew\n\n  * Product Design\n\nnew\n\n##### Agentur für Arbeit programs\n\n  * UX Design\n\nAfA\n\n  * UI Design\n\nAfA\n\n  * Full-Stack Web Development\n\nAfA\n\n  * Data Analytics\n\nAfA\n\n  * Digital Marketing\n\nAfA new\n\n  * Product Management\n\nAfA new\n\n##### Introductory courses\n\n  * Intro to UX Design\n\n  * Intro to UI Design\n\n  * Intro to Frontend Development\n\n  * Intro to Data Analytics\n\n  * Intro to Digital Marketing\n\n  * Intro to Product Management\n\nnew\n\n##### Advanced courses\n\n  * Voice User Interface Design\n\n  * UI for UX Designers\n\n  * Frontend Development for Designers\n\n  * Animation for UI Designers\n\n  * Python for Web Developers\n\n  * Cloud Computing for Web Devs\n\nnew\n\n  * Machine Learning with Python\n\nnew\n\n  * Data Visualizations with Python\n\nnew\n\n__\n\n## Learn with CareerFoundry\n\n✕\n\n##### Learn online, not alone\n\nOur career-change programs are designed to take you from beginner to pro in\nyour tech career—with personalized support every step of the way.\n\nHow it works\n\n##### Individualized mentorship\n\nNurture your inner tech pro with personalized guidance from not one, but two\nindustry experts. They’ll provide feedback, support, and advice as you build\nyour new career.\n\nMeet our mentors\n\n##### Job Guarantee\n\nWe back our programs with a job guarantee: Follow our career advice, and\nyou’ll land a job within 6 months of graduation, or you’ll get your money\nback.\n\nGet the details\n\n##### Personal career coaching\n\nBuild a career you love with 1:1 help from a career specialist who knows the\njob market in your area! Identify your skills, refine your portfolio, and\nattract the right employers.\n\nExplore our career services\n\n__\n\n## Our graduates\n\n✕\n\n##### Graduate outcomes\n\nOur graduates come from all walks of life. Whether they’re starting from\nscratch or upskilling, they have one thing in common: They go on to forge\ncareers they love.\n\nMeet our grads\n\n##### Looking for tech talent?\n\nIf you want easy recruiting from a global pool of skilled candidates, we’re\nhere to help. Our graduates are highly skilled, motivated, and prepared for\nimpactful careers in tech.\n\nHire our grads\n\n__\n\n✕\n\n  * Courses __\n    * Programs to change your career __\n\n      * UX Design\n\n      * UI Design\n\n      * Full-Stack Web Development\n\n      * Data Analytics\n\n      * Digital Marketing\n\n      * Product Management new\n\n      * Product Design new\n\n    * Agentur für Arbeit programs __\n\n      * UX Design AfA\n\n      * UI Design AfA\n\n      * Full-Stack Web Development AfA\n\n      * Data Analytics AfA\n\n      * Digital Marketing AfA new\n\n      * Product Management AfA new\n\n    * Introductory courses __\n\n      * Intro to UX Design\n\n      * Intro to UI Design\n\n      * Intro to Frontend Development\n\n      * Intro to Data Analytics\n\n      * Intro to Digital Marketing\n\n      * Intro to Product Management new\n\n    * Advanced courses __\n\n      * Voice User Interface Design\n\n      * UI for UX Designers\n\n      * Frontend Development for Designers\n\n      * Animation for UI Designers\n\n      * Python for Web Developers\n\n      * Cloud Computing for Web Devs new\n\n      * Machine Learning with Python new\n\n      * Data Visualizations with Python new\n\n  * Learn with us __\n    * How it works\n\n    * Meet our mentors\n\n    * Job guarantee\n\n    * Career services\n\n  * Our graduates __\n    * Graduate outcomes\n\n    * Hire our grads\n\n  * Online Events\n\n  * Blog\n\n  * Login\n\nUX Design  UI Design  Web Development  Data Analytics  Digital Marketing\n\nMore Categories\n\nProduct Design  Product Management  Career Change\n\nUX Design  UI Design\n\nMore Categories\n\nWeb Development  Data Analytics  Digital Marketing  Product Design  Product\nManagement  Career Change\n\nSee our blog categories\n\nUX Design  UI Design  Web Development  Data Analytics  Digital Marketing\nProduct Design  Product Management  Career Change\n\nStart your free data analytics course\n\nStart your free data analytics course\n\n# Data Transformation: A Total Beginner’s Guide\n\nby Eric Kleppen, UPDATED ON MAY 11, 2023 13 mins read\n\nWhen starting your career in data analytics or data science, you’ll find a lot\nof companies rely on many sources of data. Sometimes the data sources are\nstored in different formats or technologies. For example, the company I work\nfor uses both SQL and NoSQL solutions making it difficult to join the raw data\ntogether.\n\nUsing data transformation techniques, it’s possible to bring the data out of\ntheir silos, reformat them and store them in a central location called a data\nwarehouse.\n\nIn this data transformation tutorial, we will simulate working with SQL and\nNoSQL data by walking through the steps of transforming JSON data into tabular\ndata in SQL Server. By the end of this article you’ll have learned the\nfollowing about data transformation:\n\n  1. **What is data transformation?**\n  2. **How does data transformation work?**\n  3. **How to perform a data transformation**\n  4. **The benefits of data transformation**\n  5. **The challenges of data transformation**\n  6. **Summary**\n\nFeel free to use the clickable menu to skip ahead to any section. With that\nsaid, let’s get started!\n\n## 1\\. What is data transformation?\n\nAt a high level, data transformation is the operations by which source data\nare formatted or reshaped to fit the constraints of downstream systems or\nprocesses. Data transformation is often considered a data engineering or data\ngovernance task, typically occurring in extract, transform, load or extract,\nload, transform (ETL/ELT) pipelines designed to process raw data.\n\nThese data transformation processes take extracted source data and add to it,\ndelete from it, or format it before storing it. In large scale systems, data\ntransformation is usually automated by software used for creating data\nwarehouses and data lakes. However, on smaller scales, data analysts and data\nscientists oftentimes will need to perform data transformations manually so\nthey can model the data to assist with data-driven decision making.\n\nAn explosion in the Internet of Things (IoT) or “smart” devices has resulted\nin an age of big data. The massive increase in data means it is more important\nthan ever to efficiently process and store data in ways that make it easy to\nanalyze. By creating pipelines and processes to transform their data,\norganizations ensure they’re able to extract insights.\n\nTo help illustrate data transformation in the ETL/ELT processes, we’re going\nto work through an example. Imagine you’re an analyst at a company that stores\nstructured data via rows and columns in one database and unstructured data via\nJSON in another database.\n\nIn order to perform an analysis, you need to format the unstructured data so\nit can be joined with the structured data. Whether your process is based\naround ETL or ELT concepts, the transformation needs to take place so the raw,\nunstructured data ends up being compatible with the structured data.\n\nNext, let’s look at how data transformation works.\n\n## 2\\. How does data transformation work?\n\nData transformation is a process that involves understanding the data, mapping\nthe data to a destination system, and running the processes to perform the\ntransformation. Before performing data transformation,  pre-processing the\ndata might be required. Preprocessing data includes tasks like de-duplicating\nrecords, managing outliers, and imputing missing values. Preprocessing\nfunctions can be included in a data transformation pipeline.\n\n### The data transformation process\n\nTo better understand how data transformation works, let’s review the data\ntransformation process by breaking it down into four steps:\n\n  1. **Discovering**\n  2. **Planning**\n  3. **Performing  **\n  4. **Reviewing  **\n\nWe’ll go over each step in more detail now.\n\n### 1\\. Discovering variables in the source data\n\nThrough data discovery, you need to identify variables of interest within the\nsource data and figure out what pre-processing actions need to be performed to\nfacilitate the data transformation.\n\n### 2\\. Planning the data transformation\n\nTo map the source data to its landing system, you need to determine the\nstructure it needs to be in. In our example, we’ll convert our JSON data to a\ntabular format of rows and columns. In addition to structure, in this step\nyou’ll decide whether fields need to be renamed, dropped, or aggregated.\n\n### 3\\. Performing the data transformation\n\nSeveral tools or programming languages can be used to perform the data\ntransformation. For example, Microsoft Excel remains one of the most popular\ntools in data analytics and has several functions and features that can\ntransform data within the spreadsheet. When working with big data, Python and\nSQL are popular programming languages for data transformation. In our example,\nwe’ll use SQL.\n\n **Related watching:** What are the key languages data analysts use?\n\n﻿﻿\n\n### 4\\. Reviewing the data transformation\n\nOnce the data transformation has occurred, evaluate it to make sure the\nresults are as expected. For example, use tools to count records or verify\nduplicates have been removed, or that data aggregations have been performed\ncorrectly.\n\nNow that you know all of the steps involved in data transformation, let’s get\non with a short tutorial!\n\n## 3\\. How to perform a data transformation: An example using SQL\n\nNow that we’ve reviewed how to transform data using the 4-step process, let’s\napply the steps using real data, transforming JSON data into tabular data\nusing SQL. Databases relying on SQL have remained some of the most important\ntools for data management over the last 40 years, so understanding SQL is very\nimportant in the field of data analytics.\n\nIn this example, I’ll be using Microsoft SQL Server and SQL Server Management\nStudio. Both can be downloaded for free. If you’re new to SQL, check out this\nbeginner tutorial .\n\n### Step 1: Create the source JSON data\n\nJavaScript Object Notation (JSON) is one of the most popular data interchange\nformats, so there is a good chance you’ll encounter it when working with data\nand APIs. The JSON format supports hierarchical data structures, making use of\nobjects and arrays. An object is a key/value pair contained within curly\nbrackets {}. For example:\n\n _{“key1” : “value1”, “key2”:”value2″}_\n\nAn array is a list of values contained within brackets []:\n\n _[“value1”, “value2”, “value3”]_\n\nTo keep things simple, we’ll save some JSON data within the same database as\nour destination table. In the real world, the JSON data could be in a\ndifferent database or streaming from a completely different system.\n\nCreate a database named **dataTransformation** using the following code:\n\n    \n    \n    create database dataTransformation\n\nCreate a new table that stores the source JSON data named **sourceJSONTable**.\n\n    \n    \n    use dataTransformation\n    create table sourceJSONTable (\n     [jsonID] [int] PRIMARY KEY CLUSTERED IDENTITY(1,1) NOT NULL,\n     [jsonData] nvarchar(MAX) NOT NULL,\n    ) ON [PRIMARY]\n\nThen, populate **sourceJSONTable** using the following INSERT script:\n\n    \n    \n    insert into sourceJSONTable(jsonData)\n    select '{\n    \t\t\"country\":\"United States\",\n    \t\t\"states\":[\"California\", \"Minnesota\", \"Washington\"],\n    \t\t\"cities\":[\n    \t\t\t{\"CA\":\"San Diego\"},\n    \t\t\t{\"MN\":\"Minneapolis\"},\n    \t\t\t{\"WA\":\"Seattle\"}\n    \t\t  ]\n    \t}'\n\nNext, you’ll verify the JSON data has been inserted into the sourceJSONTable.\n\n### Step 2. Create the destination table\n\nNow that we’ve got JSON data in sourceJSONTable, let’s create our destination\ntable. After creating the table, we’ll go through the four steps for how to\ntransform data (discovering, planning, performing, reviewing).\n\nCreate the destination table using the following INSERT script:\n\n    \n    \n    use dataTransformation\n    create table destinationTable  (\n    [tableID] [int] PRIMARY KEY CLUSTERED IDENTITY(1,1) NOT NULL,\n    [country] nvarchar(50),\n    [state] nvarchar(50),\n    [abbreviation] varchar(3),\n    [city] nvarchar(50)\n    )\n\n### Step 3. Discover data\n\nIn the first step of data transformation, we inspect our source data to\nidentify the variables of interest. Comparing the source data to the\ndestination table, we see our variables of interest are _country_ , _state_ ,\n_abbreviation_ , and _city_. Looking at the JSON data, we can see our\nvariables of interest are stored in key:value pairs, along with a nested JSON\narray.\n\n### Step 4. Plan data transformation\n\nIn the discovery step we identified our variables of interest, now let’s put\ntogether a plan to transform the data. We need to pull out each object in the\nJSON and insert it into a separate column in the destination table.\n\nThis is a data transformation technique called **flattening** since we’re\ntransforming the hierarchical JSON data into a non-hierarchical structure. SQL\nServer has a function called OPENJSON that can be used to flatten JSON. A real\ndata transformation plan might look something like this:\n\n **Requirement #**|  **Business Logic**  \n---|---  \n1| Insert data from sourceJSONTable into destinationTable  \n2| Select the following objects:\n\n  * Country\n  * State\n  * Abbreviation\n  * City\n\n  \n3| Flatten JSON using OPENJSON functionality  \n4| De-duplicate records leaving only distinct records  \n  \n### Step 5. Perform the data transformation\n\nWe can write a simple SQL script that utilizes the OPENJSON function in SQL\nServer to perform the data transformation. The OPENJSON function flattens each\nof the JSON hierarchies in our source data.\n\n    \n    \n    insert into destinationTable(country, [state], abbreviation, city)\n    select country,\n    t.value as [state],\n    c.[key] as abbreviation,\n    c.value as city\n    from sourceJSONTable st\n    cross apply OPENJSON(st.jsonData)\n    with (country varchar(20), states nvarchar(max) as JSON, cities nvarchar(max) as JSON) s\n    cross apply OPENJSON(s.states) t\n    cross apply OPENJSON(s.cities) a\n    cross apply openJSON(a.value) c\n    where (t.value = 'Minnesota' and c.[key] = 'MN')\n    or (t.value = 'California' and c.[key] = 'CA')\n    or (t.value = 'Washington' and c.[key] = 'WA')\n\nNotice the **WHERE** clause filters the data based on the state and\nabbreviation relationship. That’s because the cross apply causes the records\nto join all the other records in a many-to- many relationship, duplicating our\n**state** data. For example, without filtering in the WHERE clause, our data\nwould look like this:\n\n  \nWe would be inserting a bunch of incorrect data into the destination table if\nwe didn’t include filtering in our data transformation. Filtering, removing\nduplicates, joining data, or feature engineering can all be a part of\nperforming the data transformation before loading it into storage.\n\n### 6\\. Review the data transformation\n\nAfter executing the INSERT script, select data from the destination table to\nverify the records look correct.\n\n    \n    \n    select * from destinationTable\n\nAs expected, we see our three rows in the destination table. And there you\nhave it—that’s how to transform data using the 4-step process we outlined\nearlier: **discovering, planning, performing, reviewing**.\n\n## 4\\. Benefits of data transformation\n\nThe biggest benefit of transforming data is that it makes data easier to work\nwith by improving consistency and data quality. In general, data plays an\nimportant role in organizations, allowing them to understand their users,\naudit financials, revise internal processes, identify trends, and make\nforecasts and predictions.\n\nEven with all of their data, unless they utilize data transformations to join,\naggregate, consolidate, or enrich their data, gaining insight from it could be\nimpossible. Consider the following ways data transformation benefits\norganizations:\n\n### Improved data quality\n\nThe data transformation pipeline cleans up things like duplicates, null\nvalues, and outliers. We also make sure the structure of the data is\ntransformed to match the destination system so it can be queried and accessed\nthe same way. Beyond cleaning and restructuring, data transformation can also\ninclude aggregating and feature engineering. Ultimately, improving data\nquality through  data transformation makes modeling the data much easier.\n\n### Better data accessibility\n\nTransforming data so it can be stored in the same place overcomes one of the\nbiggest obstacles in data analytics: Breaking down data silos. Organizations\ntend to keep data in silos. For example, customer data could be in one\ndatabase while product event logs are in another, and sales data in yet\nanother. Data transformation makes it possible to store all the records in one\nplace, in the same format.\n\n### Simpler data governance\n\nSince data can be generated from many sources and stored in many silos,\nmanaging data can be very challenging. Data transformation can be used to\ngenerate metadata to help organizations keep track of which data are sensitive\nand need to be regulated. Good metadata makes data easier to manage.\n\n## 5\\. Challenges of data transformation\n\nThere are many challenges that come with trying to transform data. Working\nwith big data can be very resource intensive and expensive because it takes a\nlot of processing power and computation to transform billions of records. Data\ntransformation also requires both a lot of domain knowledge, and a lot of\nexpertise with the underlying technologies used in the ETL/ELT pipelines.\n\n### Compute-resource intensive\n\nBig data means powerful resources are required to transform it. If you don’t\nhave powerful hardware handling the data transformation pipeline, the systems\ncan run out of memory or be too inefficient to keep up with all of the data.\nFor example, I was running a data transformation on millions of records,\njoining data from one table with another.\n\nThe server I was using didn’t have enough RAM to complete the operation, so my\nprocess kept running into Out Of Memory errors. When these types of errors\nhappen, it takes a lot of time and effort to re-plan and retry the data\ntransformation.\n\n### Expensive\n\nData transformation can be an expensive endeavor since it can require a lot of\nstorage and a lot of expertise. ETL/ELT pipelines need to store the\ntransformed data so it can be used for analysis. That means an organization\nneeds a data warehouse in addition to the databases that store the raw data.\n\nBeyond the costs of additional storage, Data engineers, analysts, and data\nscientists are well-paying, in-demand jobs. Organizations might not be able to\nafford many of them, leaving a small team with the burden of managing big data\noperations.\n\n### Requires domain knowledge\n\nAs an experienced product analyst working in education technology for the past\n10 years, I’m all too familiar with the challenges of transforming education\ndata. For example, there are multiple calculations used to aggregate\nattendance data, or generate GPAs, or score standardized tests.\n\nWithout the domain knowledge, data transformation can result in errors and\ninconsistencies that lead to bad analysis and incorrect predictions. It can\ntake a lot of time and effort to develop the domain knowledge necessary for\neffective data transformation.\n\n## 6\\. Summary\n\nAs organizations capture bigger data from more and more sources, efficiently\ntransforming data as a part of an ETL/ELT pipeline becomes necessary for data-\ndriven decision making. Data transformation is the process by which raw data\nis made to work with downstream processes and is done in four steps:\ndiscovering, planning, performing, reviewing.\n\nThere are many benefits to transforming data, such as improving the data\nquality, enabling and empowering data analytics and data modeling processes,\nand improving data governance practices. Although data transformation improves\nan organization’s ability to make data-driven decisions, it can be very\nchallenging to transform big data. Working with big data requires powerful\ncomputer hardware, lots of storage space, and expert-level domain knowledge.\n\nRegardless of the challenges, data transformation remains an important aspect\nof data management, and it helps organizations get the most from their data.\nIf this guide and tutorial to data transformation has piqued your interest in\nthe field of data analytics, why not try out our **free, 5-day introductory\ndata analytics short course**?\n\nYou might also be interested in the following topics:\n\n  * The best SQL certifications for aspiring data analysts\n  * What is linear regression?\n  * A complete guide to time series analysis and forecasting\n\n### What You Should Do Now\n\n  1. Get a hands-on introduction to data analytics and carry out your first analysis with our free, self-paced Data Analytics Short Course.\n\n  2. Take part in one of our FREE live online data analytics events with industry experts, and read about Azadeh’s journey from school teacher to data analyst.\n\n  3. Become a qualified data analyst in just 4-8 months—complete with a job guarantee.\n\n  4. New year, new career! We’re offering **100 partial scholarships worth up to $** **1,500** **off our career-change programs** 🚀 **Book your application call** and secure your spot today! \n\nThis article is part of:\n\n#### Data Analytics\n\nAll articles __\n\nEric Kleppen\n\nWriter for The CareerFoundry Blog\n\nEric Kleppen is a product manager for Kipsu, with a background in technical\nwriting and data analysis. His passion is helping people, and my goal is to\nmake the world a better place by sharing information and building communities.\nHe's interested in both traditional and decentralized finance.\n\n__\n\n__\n\n## Related Data Analytics Articles\n\n  * Data Analytics \n\n## 6 Hot Data Trends and Predictions for 2024\n\nJanuary 7, 2024 \\- 10 minutes read\n\n  * Data Analytics \n\n## Becoming a Sustainability Analyst: How to Do it in 2024\n\nDecember 21, 2023 \\- 8 minutes read\n\n  * Data Analytics \n\n## How To Use AI To Empower Your Data Analytics Workflow\n\nDecember 20, 2023 \\- 8 minutes read\n\n#### What is CareerFoundry?\n\nCareerFoundry is an online school for people looking to switch to a rewarding\ncareer in tech. Select a program, get paired with an expert mentor and tutor,\nand become a job-ready designer, developer, or analyst from scratch, or your\nmoney back.\n\nLearn more about our programs __\n\nprograms to change your career UX Design UI Design Web Development Data\nAnalytics Digital Marketing Product Management Introductory Courses Intro to\nUX Design Intro to UI Design Intro to Frontend Development Intro to Data\nAnalytics Intro to Digital Marketing Intro to Product Management advanced\ncourses Voice User Interface Design UI for UX Designers Frontend Development\nfor Designers Animation for UI Designers Python for Web Developers Cloud\nComputing for Web Developers\n\ncompany About Us Job Guarantee For Businesses Media Jobs at CareerFoundry\nBecome a Mentor CareerHub Editorial Policy Hire our Grads Career Services\n\n## Got questions?\n\nAsk Olivia\n\n## Thank you for your message. We'll get back to you shortly.\n\nAsk Olivia\n\n  \n\nWe'd love to hear from you! Connect with a program advisor\n\nterms and conditions  |  privacy policy  |  cookie policy  |  imprint  |\nsecurity\n\n## Privacy Preference Center\n\n  * ### Your Privacy\n\n  * ### Strictly Necessary Cookies\n\n  * ### Functional Cookies\n\n  * ### Targeting Cookies\n\n  * ### Performance Cookies\n\n### Your Privacy\n\nWhen you visit any website, it may store or retrieve information on your\nbrowser, mostly in the form of cookies. This information might be about you,\nyour preferences or your device and is mostly used to make the site work as\nyou expect it to. The information does not usually directly identify you, but\nit can give you a more personalized web experience. Because we respect your\nright to privacy, you can choose not to allow some types of cookies. Click on\nthe different category headings to find out more and change our default\nsettings. However, blocking some types of cookies may impact your experience\nof the site and the services we are able to offer.\n\n### Strictly Necessary Cookies\n\nAlways Active\n\nThese cookies are necessary for the website to function and cannot be switched\noff in our systems. They are usually only set in response to actions made by\nyou which amount to a request for services, such as setting your privacy\npreferences, logging in or filling in forms.    You can set your browser to\nblock or alert you about these cookies, but some parts of the site will not\nthen work. These cookies do not store any personally identifiable information.\n\n### Functional Cookies\n\nFunctional Cookies\n\nThese cookies enable the website to provide enhanced functionality and\npersonalisation. They may be set by us or by third party providers whose\nservices we have added to our pages.    If you do not allow these cookies then\nsome or all of these services may not function properly.\n\n### Targeting Cookies\n\nTargeting Cookies\n\nThese cookies may be set through our site by our advertising partners. They\nmay be used by those companies to build a profile of your interests and show\nyou relevant adverts on other sites.    They do not store directly personal\ninformation, but are based on uniquely identifying your browser and internet\ndevice. If you do not allow these cookies, you will experience less targeted\nadvertising.\n\n### Performance Cookies\n\nPerformance Cookies\n\nThese cookies allow us to count visits and traffic sources so we can measure\nand improve the performance of our site. They help us to know which pages are\nthe most and least popular and see how visitors move around the site.    All\ninformation these cookies collect is aggregated and therefore anonymous. If\nyou do not allow these cookies we will not know when you have visited our\nsite, and will not be able to monitor its performance.\n\n### Back Button Back\n\nVendor Search\n\nFilter Button\n\nConsent Leg.Interest\n\ncheckbox label label\n\ncheckbox label label\n\ncheckbox label label\n\nClear\n\ncheckbox label label\n\nApply Cancel\n\nConfirm My Choices\n\nAllow All\n\n",
    "links": "[{\"link\": \"https://careerfoundry.com/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/events/\", \"text\": \"Online Events\"}, {\"link\": \"https://careerfoundry.com/en/blog/\", \"text\": \"Blog\"}, {\"link\": \"https://careerfoundry.com/en/login/\", \"text\": \"Login\"}, {\"link\": \"https://careerfoundry.com/en/courses/become-a-ux-designer/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/become-a-ui-designer/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/become-a-web-developer/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/become-a-data-analyst/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/become-a-digital-marketer/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/become-a-product-manager/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/become-a-product-designer/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/become-a-ux-designer-with-your-bildungsgutschein/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/become-a-ui-designer-with-your-bildungsgutschein/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/become-a-web-developer-with-your-bildungsgutschein/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/become-a-data-analyst-with-your-bildungsgutschein/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/become-a-digital-marketer-with-your-bildungsgutschein/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/become-a-product-manager-with-your-bildungsgutschein/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/ux-fundamentals/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/intro-to-ui-design/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/intro-to-frontend-development/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/intro-to-data-analytics/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/intro-to-digital-marketing/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/intro-to-product-management/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/voice-user-interface-design-with-amazon-alexa/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/ui-for-ux-designers/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/frontend-development-for-designers/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/animation-for-ui-designers/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/python-for-web-developers/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/cloud-computing-for-web-developers/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/machine-learning-with-python/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/data-visualizations-with-python/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/how-it-works/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/mentors/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/job-guarantee/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/career-services/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/graduate-outcomes/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/hire-our-grads/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/become-a-ux-designer/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/become-a-ui-designer/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/become-a-web-developer/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/become-a-data-analyst/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/become-a-digital-marketer/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/become-a-product-manager/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/become-a-product-designer/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/become-a-ux-designer-with-your-bildungsgutschein/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/become-a-ui-designer-with-your-bildungsgutschein/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/become-a-web-developer-with-your-bildungsgutschein/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/become-a-data-analyst-with-your-bildungsgutschein/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/become-a-digital-marketer-with-your-bildungsgutschein/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/become-a-product-manager-with-your-bildungsgutschein/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/ux-fundamentals/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/intro-to-ui-design/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/intro-to-frontend-development/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/intro-to-data-analytics/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/intro-to-digital-marketing/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/intro-to-product-management/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/voice-user-interface-design-with-amazon-alexa/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/ui-for-ux-designers/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/frontend-development-for-designers/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/animation-for-ui-designers/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/python-for-web-developers/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/cloud-computing-for-web-developers/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/machine-learning-with-python/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/data-visualizations-with-python/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/how-it-works/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/mentors/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/job-guarantee/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/career-services/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/graduate-outcomes/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/hire-our-grads/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/events/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/blog/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/login/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/blog/\", \"text\": \"\"}, {\"link\": \"https://careerfoundry.com/en/courses/become-a-ux-designer/\", \"text\": \"UX Design\"}, {\"link\": \"https://careerfoundry.com/en/courses/become-a-ui-designer/\", \"text\": \"UI Design\"}, {\"link\": \"https://careerfoundry.com/en/courses/become-a-web-developer/\", \"text\": \"Web Development\"}, {\"link\": \"https://careerfoundry.com/en/courses/become-a-data-analyst/\", \"text\": \"Data Analytics\"}, {\"link\": \"https://careerfoundry.com/en/courses/become-a-digital-marketer/\", \"text\": \"Digital Marketing\"}, {\"link\": \"https://careerfoundry.com/en/courses/become-a-product-manager/\", \"text\": \"Product Management\"}, {\"link\": \"https://careerfoundry.com/en/courses/ux-fundamentals/\", \"text\": \"Intro to UX Design\"}, {\"link\": \"https://careerfoundry.com/en/courses/intro-to-ui-design/\", \"text\": \"Intro to UI Design\"}, {\"link\": \"https://careerfoundry.com/en/courses/intro-to-frontend-development/\", \"text\": \"Intro to Frontend Development\"}, {\"link\": \"https://careerfoundry.com/en/courses/intro-to-data-analytics/\", \"text\": \"Intro to Data Analytics\"}, {\"link\": \"https://careerfoundry.com/en/courses/intro-to-digital-marketing/\", \"text\": \"Intro to Digital Marketing\"}, {\"link\": \"https://careerfoundry.com/en/courses/intro-to-product-management/\", \"text\": \"Intro to Product Management\"}, {\"link\": \"https://careerfoundry.com/en/courses/voice-user-interface-design-with-amazon-alexa/\", \"text\": \"Voice User Interface Design\"}, {\"link\": \"https://careerfoundry.com/en/courses/ui-for-ux-designers/\", \"text\": \"UI for UX Designers\"}, {\"link\": \"https://careerfoundry.com/en/courses/frontend-development-for-designers/\", \"text\": \"Frontend Development for Designers\"}, {\"link\": \"https://careerfoundry.com/en/courses/animation-for-ui-designers/\", \"text\": \"Animation for UI Designers\"}, {\"link\": \"https://careerfoundry.com/en/courses/python-for-web-developers/\", \"text\": \"Python for Web Developers\"}, {\"link\": \"https://careerfoundry.com/en/courses/cloud-computing-for-web-developers/\", \"text\": \"Cloud Computing for Web Developers\"}, {\"link\": \"https://careerfoundry.com/en/about/\", \"text\": \"About Us\"}, {\"link\": \"https://careerfoundry.com/en/job-guarantee/\", \"text\": \"Job Guarantee\"}, {\"link\": \"https://careerfoundry.com/en/business/\", \"text\": \"For Businesses\"}, {\"link\": \"https://careerfoundry.com/en/media/\", \"text\": \"Media\"}, {\"link\": \"https://careerfoundry.com/en/mentoring/\", \"text\": \"Become a Mentor\"}, {\"link\": \"https://careerfoundry.com/en/careerhub/\", \"text\": \"CareerHub\"}, {\"link\": \"https://careerfoundry.com/en/faqs/editorial-policy-page/\", \"text\": \"Editorial Policy\"}, {\"link\": \"https://careerfoundry.com/en/hire-our-grads/\", \"text\": \"Hire our Grads\"}, {\"link\": \"https://careerfoundry.com/en/career-services/\", \"text\": \"Career Services\"}, {\"link\": \"https://careerfoundry.com/en/connect/all-contact-advisor/\", \"text\": \"Connect with a program advisor\"}, {\"link\": \"https://careerfoundry.com/en/terms/\", \"text\": \"terms and conditions\"}, {\"link\": \"https://careerfoundry.com/en/privacy/\", \"text\": \"privacy policy\"}, {\"link\": \"https://careerfoundry.com/en/cookie-policy/\", \"text\": \"cookie policy\"}, {\"link\": \"https://careerfoundry.com/en/imprint/\", \"text\": \"imprint\"}, {\"link\": \"https://careerfoundry.com/en/security/\", \"text\": \"security\"}]"
}