{
    "summary": "Skip to Content\n\nsearch\n\nsafe.com blog community\n\n  * Products\n\n    * FME Platform  right-arrow\n\nEnterprise integration with no-code automation.\n\n* * *\n\n    * FME Form  right-arrow\n\nBuild integration workflows; no coding required.\n\n    * FME Flow  right-arrow\n\nAutomate integrations using event-based workflows.\n\n    * FME Flow Hosted  right-arrow\n\nSafe Software’s hosted version of FME Flow.\n\n    * Integrations Gallery  right-arrow\n\nSearch supported formats & applications.\n\n    * Transformers Gallery  right-arrow\n\nBrowse tools for transforming data.\n\n* * *\n\n    * New Features FME 2022.2\n    * Downloads\n    * Free Licenses\n    * Pricing\n\nClose  x\n\n  * Why FME\n\n    * Industry Solutions  right-arrow\n    * Airports & Aviation \n    * Architecture, Engineering, & Construction \n    * Energy \n    * Local Government \n    * Utilities \n    * View More Industries\n\n* * *\n\n    * Data Type Solutions  right-arrow\n    * BIM \n    * CAD \n    * GIS & Location Intelligence \n    * LiDAR & Point Clouds \n    * Raster & Aerial Imagery \n    * View More Data Types\n\n    * Customer Stories  right-arrow\n\nSee how our 10,000+ customers use FME.\n\n* * *\n\n    * FME Demos  right-arrow\n\nSee what you can do with FME.\n\n* * *\n\n    * Why FME  right-arrow\n    * What is Data Integration?\n    * What is Application Integration?\n    * What is Data Transformation?\n    * What is Data Conversion?\n    * What is Data Validation?\n    * What is Spatial Data?\n\n* * *\n\n    * View All Solutions\n\nClose  x\n\n  * Community\n\n    * FME Community  right-arrow\n\nConnect with Safe and thousands of active users.\n\n* * *\n\n    * Forums \n    * Knowledge Base \n    * Ideas \n    * FME Hub \n    * Blog \n    *       * FME User Conference 2022\n\nView Event Proceedings\n\n      * The Peak of Data Integration 2023\n\nRegistration is now open!\n\n* * *\n\n    *       * Past Presentations \n      * See All Events \n\nClose  x\n\n  * Partners\n\n    * Partners  right-arrow\n\nLocate FME expertise near you.\n\n* * *\n\n    * Partner & Services Locator \n    * Partner Programs \n    * Managed Service Provider \n\nClose  x\n\n  * Support\n\n    * Webinars  right-arrow\n    * Technical Support  right-arrow\n    * FME Accelerator  right-arrow\n\n* * *\n\n    * Training \n\n    * FME Academy \n    * Videos and Manuals \n    * Live Online Courses \n    * In-Person Courses \n    * Downloads\n    * Free Licenses\n    * Documentation\n    * Certification\n\nClose  x\n\n  * About\n\n    * About Us  right-arrow\n    * History & Leadership \n    * Community Initiatives \n    * Contact Us \n    * Careers \n\nClose  x\n\nsearch Pricing Free Trial\n\nsearch Search x\n\n  * Solutions\n  * Key Capabilities\n  * Current: Data Transformation\n\n#  What is Data Transformation?\n\n_noun • [day-ta trans-for-may-shun] • the process of altering the structure,\ncontent, or other characteristics of data to make it usable for your needs_\n\n## Overview\n\nVery rarely does a dataset meet 100% of the needs of those using the data.\nThere. We said it. But, just because this reality is inevitable doesn’t mean\nthere aren’t ways to work around it.\n\nData transformation is the process of applying few or many changes (you\ndecide!) to data to make it valuable to you. Some examples of the types of\nchanges that may take place during data transformation are merging,\naggregating, summarizing, filtering, enriching, splitting, joining, or\nremoving duplicated data.\n\nOften data transformation is a mandatory step needed for further data\nmanagement tasks like data conversion and data integration. Data\ntransformation is a key step in each of these processes because it can help\nshape, standardize, and overall create consistency between various datasets.\nWhether or not you need to convert data into a new file format in addition to\ntransforming it is dependent on what the needs of your organization are. In\nmany cases, transformation without conversion will suffice. Ultimately, data\ntransformation will help you move data into its target destination efficiently\nand effectively.\n\nMore and more businesses and organizations rely on data transformation to\nhandle the tremendous amounts of data being generated from emerging\ntechnologies and new applications. By being able to transform data,\norganizations not only maximize the value of their data but can manage their\ndata in simplistic ways and reduce the dreaded feeling of information\noverload.\n\n## Data Transformation Steps\n\nThere are five basic steps involved in data transformation that are important\nto know whether you are creating, implementing, or making use of the\ntransformation workflow. These steps are necessary to consider no matter how\nsimple or complex the data transformation will be. By following this rough\nguideline, you’ll be able to properly plan and process the data to achieve\nyour data goals.\n\n### 1\\. Data Discovery and Data Profiling\n\n  * Interpret and make sense of the exact data you are working with (so you can turn what you have into what you want).\n  * Note the detailed information contained within the data such as the attributes, structure, and what it is you need to transform _knowing the file extension is not enough!_ )\n  * Here are some example questions you may ask yourself: \n    * _On structure:_ Is my data tabular, a raster (pixelated), or three dimensional?\n    * _On attributes:_ Is there additional metadata? What are the column headers describing? Is there any data missing?\n    * _On transformation:_ What units are measurements recorded in, and do I want to change them? Is all the data recorded in a consistent way?\n  * Identify if the data requires any cleaning before transformation.\n\n### 2\\. Data Mapping\n\n  * Establish a well thought out plan that identifies what elements of the data will be transformed and how that will happen.\n  * If you are transforming data for compatibility reasons (so your chosen applications can access data), determine what parts of the data should be changed and what needs to be left as is.\n  * Ensure that your plan considers whether or not data will be lost during transformation and how to mitigate losses if needed.\n\n### 3\\. Create a Workflow\n\n  * Decide if you will transform data by writing a script or by using a data transformation tool. Consider some of these questions: \n    * What is the current expertise on the team and are there any gaps to fill to successfully complete our data transformation project?\n    * Will the structure of my data and transformation requirements change over time? Will I be able to easily update the workflow to meet these changing needs?\n    * Do I need to consider if others will be using the workflow I create? Do I need to make it easy for others to understand in case I’m not around?\n_FME is an example of an easy to use visual data transformation tool_\n\n  * Identify your input and output data file formats within your workflow. \n  * Identify the needs of the data transformation (compatibility, enriching, etc.) and ensure these requirements are met within your workflow.\n\n### 4\\. Run Your Workflow\n\n  * Connect the input data to your workflow and test what you’ve created. When you run your workflow, it will rebuild the data to match your target format. The workflow is essentially a data restructuring process.\n  * Running the workflow should result in your old data being presented in a new way. Whether or not the data is converted into a new file format is up to you. For example: \n    * A JSON file with new keys and values added to each object\n    * A CSV file with dates updated to be recorded in a consistent way\n    * A Shapefile’s attributes as a KML file with only key landmarks\n\n### 5\\. Review the Data\n\n  * Review the quality and accuracy of the output data.\n  * Create a list or audit of issues if necessary.\n  * Based on your findings, if needed, review the workflow you’ve created, make changes, and try again.\n\n## Data Transformation with FME\n\nOne of the simplest ways to transform data is via data integration software\nplatforms like FME that specialize in data transformation. FME takes away the\nneed for writing scripts so anyone, no matter their technical background, can\neasily create and perform their own data transformation workflows.\n\nTransformers are FME’s standard data transformation tools that are used to\nmodify data any way you’d like. You can think of transformers as packaged\nactions, functions, or pre-written code snippets. There is a variety of\ntransformers for you to choose from, and you can add them to your workflow in\nany logical order that you’d like so that data is transformed exactly for your\nneeds.\n\nIf you’re a developer, no need to worry, FME isn’t here to replace you. Just\nlike no single person can ever know everything, no single software will ever\nbe able to do everything. That’s why you can insert your own pieces of code,\nsuch as Python, R or JavaScript, directly into a workflow so together you and\nFME can build something great. Now, instead of writing an entire data\ntransformation script you can create workflows quickly and simply, giving you\nmore time to work on more important tasks.\n\nOverall, whether you’re a developer or not, FME’s capabilities and built-in\ntransformers give you the flexibility and choice to customize and extend your\nworkflow however you want.\n\n### Here’s How it Works\n\nTransformers are used directly in FME Form. It’s easy for you to add\ntransformers to your workflow to create your own custom data transformation\nprocess. Here’s how:\n\n  1. Add the transformer by typing its name anywhere within the workspace\n  2. Drag-and-drop your transformer where you want it\n  3. Connect transformers together using the input and output ports to link your workflow\n\nEach transformer has parameters that you have control over to give you the\nflexibility to transform data exactly how you want to. If you’re new to data\ntransformation, not to worry. There’s documentation to help you understand how\nthe parameters work. Before you know it, your new visual workflow will be\ncomplete!\n\nNow that you have a completed data transformation workflow, you can easily re-\nuse parts of or all of your workflow for additional data transformation tasks.\nTo make it easier for future you and others to understand your logic behind\nhow you created your original workflow, make use of the Annotations and\nBookmark features to add notes directly into your workspace.\n\nThat’s all there is to it! With your own creative skills and data expertise,\nworking with FME can get you where you need to go.\n\n_To learn more about the above data transformation, check out our tutorial\nonconverting CSV to Microsoft Excel._\n\n## What is FME?\n\nFME is recognized as the data integration platform with the best support for\nspatial data worldwide. However, it can handle much more than just spatial\ndata and is easily used by IT and business professionals. FME has a range of\nsupportive data transformation tools called transformers that make is easy to\nintegrate over 450 formats and applications. With FME you have the flexibility\nto transform and integrate exactly the way you want to.\n\nSafe Software, the makers of FME, are leaders in the technology world that\nstrive to stay one step ahead of data integration trends. FME is continuously\nupgraded to ensure it has been adapted to support new data formats, updated\nversions of existing data formats, and large amounts of data. Gone is the idea\nthat individual departments must work in their data silos, with IT structures\nlimiting the company’s potential to truly work as one. Data should be able to\nflow freely no matter where, when, or how it’s needed.\n\n**FME Form** **FME Flow** **FME Flow Hosted**\n\n## Related Resources\n\n**Getting Started With FME: Adding Transformers**\n\nright-arrow\n\n**How to Choose the Right Transformer**\n\nright-arrow\n\n**How to Develop for Data Transformation with FME Flow**\n\nright-arrow\n\n**What is Data Validation?**\n\nright-arrow\n\n**Why You Should Care About Spatial Data**\n\nright-arrow\n\n**What is Application Integration?**\n\nright-arrow\n\nProducts\n\n  * FME Platform\n  * Free Trial Downloads\n  * Customers\n  * Pricing\n  * Training\n  * Knowledge Base\n\nHelp\n\n  * Training\n  * Knowledge Base\n  * Forums\n  * Support\n\nCompany\n\n  * About\n  * Contact\n  * Careers\n  * Blog\n  * Forums\n  * Support\n\nSecondary Email\n\nPrimary Address\n\nSubscribe to our mailing list\n\nSend me updates from Safe Software (I can unsubscribe any time - privacy\npolicy)\n\nEmail Address*\n\nIndustry* Select an Industry AEC (Architecture Engineering and Construction)\nAirports & Aviation Commercial Defence/Aerospace Education/Non-Profit Energy\nGovernment (Federal) Government (Local) Government (State/Provincial)\nHealthcare/Health Tech Natural Resources Software/Technology\nTelecommunications Transportation Utilities Subscribe\n\nAn email is required.\n\nAn Industry is required.\n\n* * *\n\n© 2024 Safe Software Inc | Legal | Privacy Settings\n\n**Land Acknowledgement —** Safe Software respectfully acknowledges that we\nlive, learn and work on the traditional and unceded territories of the\nKwantlen, Katzie, and Semiahmoo First Nations.\n\nBy clicking “Accept All Cookies”, you agree to the storing of cookies on your\ndevice to enhance site navigation, analyze site usage, and assist in our\nmarketing efforts.\n\nCookies Settings Reject All Accept All Cookies\n\n## Privacy Preference Center\n\n  * ### Your Privacy\n\n  * ### Strictly Necessary Cookies\n\n  * ### Performance Cookies\n\n  * ### Targeting Cookies\n\n  * ### Social Media Cookies\n\n#### Your Privacy\n\nWhen you visit any website, it may store or retrieve information on your\nbrowser, mostly in the form of cookies. This information might be about you,\nyour preferences or your device and is mostly used to make the site work as\nyou expect it to. The information does not usually directly identify you, but\nit can give you a more personalized web experience. Because we respect your\nright to privacy, you can choose not to allow some types of cookies. Click on\nthe different category headings to find out more and change our default\nsettings. However, blocking some types of cookies may impact your experience\nof the site and the services we are able to offer.  \nFor more information and to see a list of cookies, please see our Privacy\nPolicy.\n\n#### Strictly Necessary Cookies\n\nAlways Active\n\nThese cookies are necessary for the website to function and cannot be switched\noff in our systems. They are usually only set in response to actions made by\nyou which amount to a request for services, such as setting your privacy\npreferences, logging in or filling in forms. You can set your browser to block\nor alert you about these cookies, but some parts of the site will not then\nwork. These cookies do not store any personally identifiable information.\n\n#### Performance Cookies\n\nPerformance Cookies\n\nThese cookies allow us to count visits and traffic sources so we can measure\nand improve the performance of our site. They help us to know which pages are\nthe most and least popular and see how visitors move around the site. All\ninformation these cookies collect is aggregated and therefore anonymous. If\nyou do not allow these cookies we will not know when you have visited our\nsite, and will not be able to monitor its performance.\n\n#### Targeting Cookies\n\nTargeting Cookies\n\nThese cookies may be set through our site by our advertising partners. They\nmay be used by those companies to build a profile of your interests and show\nyou relevant adverts on other sites. They do not store directly personal\ninformation, but are based on uniquely identifying your browser and internet\ndevice. If you do not allow these cookies, you will experience less targeted\nadvertising.\n\n#### Social Media Cookies\n\nSocial Media Cookies\n\nThese cookies are set by a range of social media services that we have added\nto the site to enable you to share our content with your friends and networks.\nThey are capable of tracking your browser across other sites and building up a\nprofile of your interests. This may impact the content and messages you see on\nother websites you visit. If you do not allow these cookies you may not be\nable to use or see these sharing tools.\n\nBack Button\n\n### Back\n\nFilter Button\n\nConsent Leg.Interest\n\ncheckbox label label\n\ncheckbox label label\n\ncheckbox label label\n\nClear\n\ncheckbox label label\n\nApply Cancel\n\nConfirm My Choices\n\nReject All Allow All\n\n",
    "links": "[{\"link\": \"https://engage.safe.com\", \"text\": \"\"}, {\"link\": \"https://engage.safe.com/search/\", \"text\": \"\"}, {\"link\": \"https://engage.safe.com/\", \"text\": \"safe.com\"}, {\"link\": \"https://engage.safe.com/blog/\", \"text\": \"blog\"}, {\"link\": \"https://engage.safe.com/fme/\", \"text\": \"\"}, {\"link\": \"https://engage.safe.com/fme/fme-desktop/\", \"text\": \"\"}, {\"link\": \"https://engage.safe.com/fme/fme-server/\", \"text\": \"\"}, {\"link\": \"https://engage.safe.com/fme/fme-cloud/\", \"text\": \"\"}, {\"link\": \"https://engage.safe.com/integrate/\", \"text\": \"\"}, {\"link\": \"https://engage.safe.com/transformers/\", \"text\": \"\"}, {\"link\": \"https://engage.safe.com/fme/new-features/2022/\", \"text\": \"\"}, {\"link\": \"https://engage.safe.com/support/downloads/\", \"text\": \"Downloads\"}, {\"link\": \"https://engage.safe.com/free-fme-licenses/\", \"text\": \"Free Licenses\"}, {\"link\": \"https://engage.safe.com/pricing/\", \"text\": \"Pricing\"}, {\"link\": \"https://engage.safe.com/solutions/#industries\", \"text\": \"\"}, {\"link\": \"https://engage.safe.com/industry/airports-and-aviation-solutions/\", \"text\": \"\\n                  Airports & Aviation\\n                \"}, {\"link\": \"https://engage.safe.com/industry/aec-solutions/\", \"text\": \"\\n                  Architecture, Engineering, & Construction\\n                \"}, {\"link\": \"https://engage.safe.com/industry/energy-solutions/\", \"text\": \"\\n                  Energy\\n                \"}, {\"link\": \"https://engage.safe.com/industry/local-government-solutions/\", \"text\": \"\\n                  Local Government\\n                \"}, {\"link\": \"https://engage.safe.com/industry/utilities-solutions/\", \"text\": \"\\n                  Utilities\\n                \"}, {\"link\": \"https://engage.safe.com/solutions/#industries\", \"text\": \"View More Industries\"}, {\"link\": \"https://engage.safe.com/solutions/#data-types\", \"text\": \"\"}, {\"link\": \"https://engage.safe.com/data-types/bim/\", \"text\": \"\\n                  BIM\\n                \"}, {\"link\": \"https://engage.safe.com/data-types/cad/\", \"text\": \"\\n                  CAD\\n                \"}, {\"link\": \"https://engage.safe.com/data-types/gis-location-intelligence/\", \"text\": \"\\n                  GIS & Location Intelligence\\n                \"}, {\"link\": \"https://engage.safe.com/data-types/lidar-point-cloud/\", \"text\": \"\\n                  LiDAR & Point Clouds\\n                \"}, {\"link\": \"https://engage.safe.com/data-types/raster-aerial-imagery/\", \"text\": \"\\n                  Raster & Aerial Imagery\\n                \"}, {\"link\": \"https://engage.safe.com/solutions/#data-types\", \"text\": \"View More Data Types\"}, {\"link\": \"https://engage.safe.com/customers/\", \"text\": \"\"}, {\"link\": \"https://engage.safe.com/demos/\", \"text\": \"\"}, {\"link\": \"https://engage.safe.com/solutions/#key-capabilities\", \"text\": \"\"}, {\"link\": \"https://engage.safe.com/what-is/data-integration/\", \"text\": \"What is Data Integration?\"}, {\"link\": \"https://engage.safe.com/what-is/application-integration/\", \"text\": \"What is Application Integration?\"}, {\"link\": \"https://engage.safe.com/what-is/data-transformation/\", \"text\": \"What is Data Transformation?\"}, {\"link\": \"https://engage.safe.com/what-is/data-conversion/\", \"text\": \"What is Data Conversion?\"}, {\"link\": \"https://engage.safe.com/what-is/data-validation/\", \"text\": \"What is Data Validation?\"}, {\"link\": \"https://engage.safe.com/what-is/spatial-data/\", \"text\": \"What is Spatial Data?\"}, {\"link\": \"https://engage.safe.com/solutions/\", \"text\": \"View All Solutions\"}, {\"link\": \"https://engage.safe.com/blog/\", \"text\": \"\\n                  Blog\\n                \"}, {\"link\": \"https://engage.safe.com/presentations/\", \"text\": \"\\n                      Past Presentations\\n                    \"}, {\"link\": \"https://engage.safe.com/learning/events/\", \"text\": \"\\n                      See All Events\\n                    \"}, {\"link\": \"https://engage.safe.com/partners/\", \"text\": \"\"}, {\"link\": \"https://engage.safe.com/partners/partner-locator/\", \"text\": \"\\n                  Partner & Services Locator\\n                \"}, {\"link\": \"https://engage.safe.com/partners/partner-programs/\", \"text\": \"\\n                  Partner Programs\\n                \"}, {\"link\": \"https://engage.safe.com/partners/partner-programs/managed-service-provider/\", \"text\": \"\\n                  Managed Service Provider\\n                \"}, {\"link\": \"https://engage.safe.com/webinars/\", \"text\": \"\"}, {\"link\": \"https://engage.safe.com/accelerator/\", \"text\": \"\"}, {\"link\": \"https://engage.safe.com/training/recorded/\", \"text\": \"\\n                  Videos and Manuals\\n                \"}, {\"link\": \"https://engage.safe.com/training/live-online/\", \"text\": \"\\n                  Live Online Courses\\n                \"}, {\"link\": \"https://engage.safe.com/training/in-person/\", \"text\": \"\\n                  In-Person Courses\\n                \"}, {\"link\": \"https://engage.safe.com/support/downloads/\", \"text\": \"Downloads\"}, {\"link\": \"https://engage.safe.com/free-fme-licenses/\", \"text\": \"Free Licenses\"}, {\"link\": \"https://engage.safe.com/partners/certification/\", \"text\": \"Certification\"}, {\"link\": \"https://engage.safe.com/about/\", \"text\": \"\"}, {\"link\": \"https://engage.safe.com/about/history-leadership/\", \"text\": \"\\n                  History & Leadership\\n                \"}, {\"link\": \"https://engage.safe.com/about/community-initiatives/\", \"text\": \"\\n                  Community Initiatives\\n                \"}, {\"link\": \"https://engage.safe.com/about/contact/\", \"text\": \"\\n                  Contact Us\\n                \"}, {\"link\": \"https://engage.safe.com/careers/\", \"text\": \"\\n                  Careers\\n                \"}, {\"link\": \"https://engage.safe.com/search/\", \"text\": \"\"}, {\"link\": \"https://engage.safe.com/pricing/\", \"text\": \"Pricing\"}, {\"link\": \"https://engage.safe.com/fme/trial/\", \"text\": \"Free Trial\"}, {\"link\": \"https://engage.safe.com/solutions/\", \"text\": \"Solutions\"}, {\"link\": \"https://engage.safe.com/solutions/#key-capabilities\", \"text\": \"Key Capabilities\"}, {\"link\": \"https://engage.safe.com/what-is/data-conversion/\", \"text\": \"data conversion\"}, {\"link\": \"https://engage.safe.com/what-is/data-integration/\", \"text\": \"data integration\"}, {\"link\": \"https://engage.safe.com/transformers/\", \"text\": \"transformers\"}, {\"link\": \"https://engage.safe.com/fme/fme-desktop/\", \"text\": \"FME Form\"}, {\"link\": \"https://engage.safe.com/what-is/spatial-data/\", \"text\": \"spatial data\"}, {\"link\": \"https://engage.safe.com/fme/fme-desktop/\", \"text\": \"\"}, {\"link\": \"https://engage.safe.com/fme/fme-server/\", \"text\": \"\"}, {\"link\": \"https://engage.safe.com/fme/fme-cloud/\", \"text\": \"\"}, {\"link\": \"https://engage.safe.com/what-is/data-validation/\", \"text\": \"\"}, {\"link\": \"https://engage.safe.com/why/spatial-data/\", \"text\": \"\"}, {\"link\": \"https://engage.safe.com/what-is/application-integration/\", \"text\": \"\"}, {\"link\": \"https://engage.safe.com/fme/\", \"text\": \"FME Platform\"}, {\"link\": \"https://engage.safe.com/fme/fme-desktop/trial-download/\", \"text\": \"Free Trial Downloads\"}, {\"link\": \"https://engage.safe.com/customers/\", \"text\": \"Customers\"}, {\"link\": \"https://engage.safe.com/pricing/\", \"text\": \"Pricing\"}, {\"link\": \"https://engage.safe.com/training/recorded/\", \"text\": \"Training\"}, {\"link\": \"https://engage.safe.com/training/recorded/\", \"text\": \"Training\"}, {\"link\": \"https://engage.safe.com/about/\", \"text\": \"About\"}, {\"link\": \"https://engage.safe.com/about/contact/\", \"text\": \"Contact\"}, {\"link\": \"https://engage.safe.com/careers/\", \"text\": \"Careers\"}, {\"link\": \"https://engage.safe.com/blog/\", \"text\": \"Blog\"}, {\"link\": \"https://engage.safe.com/support/\", \"text\": \"Support\"}, {\"link\": \"https://engage.safe.com/legal/\", \"text\": \"Legal\"}]",
    "priceAndPlans": "Skip to Content\n\nsearch\n\nsafe.com blog community\n\n  * Products\n\n    * FME Platform  right-arrow\n\nEnterprise integration with no-code automation.\n\n* * *\n\n    * FME Form  right-arrow\n\nBuild integration workflows; no coding required.\n\n    * FME Flow  right-arrow\n\nAutomate integrations using event-based workflows.\n\n    * FME Flow Hosted  right-arrow\n\nSafe Software’s hosted version of FME Flow.\n\n    * Integrations Gallery  right-arrow\n\nSearch supported formats & applications.\n\n    * Transformers Gallery  right-arrow\n\nBrowse tools for transforming data.\n\n* * *\n\n    * New Features FME 2022.2\n    * Downloads\n    * Free Licenses\n    * Pricing\n\nClose  x\n\n  * Why FME\n\n    * Industry Solutions  right-arrow\n    * Airports & Aviation \n    * Architecture, Engineering, & Construction \n    * Energy \n    * Local Government \n    * Utilities \n    * View More Industries\n\n* * *\n\n    * Data Type Solutions  right-arrow\n    * BIM \n    * CAD \n    * GIS & Location Intelligence \n    * LiDAR & Point Clouds \n    * Raster & Aerial Imagery \n    * View More Data Types\n\n    * Customer Stories  right-arrow\n\nSee how our 10,000+ customers use FME.\n\n* * *\n\n    * FME Demos  right-arrow\n\nSee what you can do with FME.\n\n* * *\n\n    * Why FME  right-arrow\n    * What is Data Integration?\n    * What is Application Integration?\n    * What is Data Transformation?\n    * What is Data Conversion?\n    * What is Data Validation?\n    * What is Spatial Data?\n\n* * *\n\n    * View All Solutions\n\nClose  x\n\n  * Community\n\n    * FME Community  right-arrow\n\nConnect with Safe and thousands of active users.\n\n* * *\n\n    * Forums \n    * Knowledge Base \n    * Ideas \n    * FME Hub \n    * Blog \n    *       * FME User Conference 2022\n\nView Event Proceedings\n\n      * The Peak of Data Integration 2023\n\nRegistration is now open!\n\n* * *\n\n    *       * Past Presentations \n      * See All Events \n\nClose  x\n\n  * Partners\n\n    * Partners  right-arrow\n\nLocate FME expertise near you.\n\n* * *\n\n    * Partner & Services Locator \n    * Partner Programs \n    * Managed Service Provider \n\nClose  x\n\n  * Support\n\n    * Webinars  right-arrow\n    * Technical Support  right-arrow\n    * FME Accelerator  right-arrow\n\n* * *\n\n    * Training \n\n    * FME Academy \n    * Videos and Manuals \n    * Live Online Courses \n    * In-Person Courses \n    * Downloads\n    * Free Licenses\n    * Documentation\n    * Certification\n\nClose  x\n\n  * About\n\n    * About Us  right-arrow\n    * History & Leadership \n    * Community Initiatives \n    * Contact Us \n    * Careers \n\nClose  x\n\nsearch Pricing Free Trial\n\nsearch Search x\n\n#  Enterprise Subscription Pricing\n\nView Pricing Calculator\n\n## What is an Enterprise Subscription?\n\nSpeed up your projects by subscribing your organization to an Enterprise\nSubscription instead of managing numerous one-off licenses. For a lower up-\nfront cost your team can deploy any combination of FME Form and FME Flow\nwithin your chosen price.\n\n* * *\n\n## Benefits of an Enterprise Subscription\n\n### Lower Acquisition Cost\n\nAdd new FME licenses for a lower up-front cost as compared to our traditional\nlicensing model.\n\n### Reduced Procurement Costs\n\nSave your finance team time by opting for a single subscription instead of\nhaving to process multiple one-off requests.\n\n### Eliminate Time Lag on Projects\n\nEasily add new licenses as needed, never again letting your projects get\ndelayed waiting on necessary licenses.\n\n### Predictable Budgeting\n\nPay once and you’re covered for 12 months. Renewal only occurs once per year,\nregardless of growth.\n\n### Support and Software Updates\n\nGet access to the latest features and software updates to FME as they become\navailable.\n\n### Flexibility to Scale\n\nAs your use of FME evolves and needs change, simply adjust your deployment of\nFME products, making growth easy.\n\n## Pricing Calculator\n\nAdjust the slider to see the value of FME licenses you can deploy at each\nannual price. If you need a custom amount or have questions (e.g. not enough\nroom in this year's budget), please contact us or your local partner.\n\nAnnual Price\n\n$15,000 USD / Year\n\nThis is the amount you pay each year.\n\nThreshold Value\n\n$42,000 USD\n\nDeploy up to this amount of FME Form and FME Flow while your subscription is\nactive.\n\nView Examples\n\nx\n\nExamples of What You Can Get\n\nHere are a few examples to help explain how an Enterprise Subscription works.\nAs part of your subscription you can adjust your license breakdown at any\ntime. Freely choose between fixed or floating licenses, different editions,\nand number of environments and or engines for FME Flow. Requirements change?\nReallocate your licenses as often as you need.\n\nExpand All\n\nplus-circle\n\nCollapse All\n\nminus-circle\n\n  * ### An annual price of $15,000 allows you to deploy up to $42,000.\n\n2 x FME Desktop Database Edition (1 Floating + 1 Incremental) $12,700\n\n3 x FME Server Engines For Production $27,000\n\n* * *\n\nTotal $39,700 USD\n\n  * ### An annual price of $40,000 allows you to deploy up to $112,000.\n\n14 x FME Desktop Database Editions (1 Floating + 13 Incremental) $51,100\n\n6 x FME Server Engines For Production $46,500\n\n1 x FME Server Engine For Staging $14,000\n\n* * *\n\nTotal $111,600 USD\n\n  * ### An annual price of $125,000 allows you to deploy up to $350,000.\n\n33 x FME Desktop Database Edition (1 Floating + 32 Incremental) $111,900\n\n16 x FME Server Engines For Production (License Included) $111,500\n\n16 x FME Server Engines For Staging (License Included) $111,500\n\n1 x FME Server Engine For Development (License Included) $14,000\n\n* * *\n\nTotal $348,900 USD\n\nAll values are displayed in USD and use the US Price Book. Values may change\ndepending on your region.\n\nClose\n\nI Want to Buy\n\nNote: Pricing above is for end use in United States. To obtain pricing for use\nin another country, please contact sales@safe.com or your local partner.\n\n##  Unlimited Subscriptions\n\nUse as many FME Form and FME Flow licenses you want for a fixed price.\nUnlimited subscriptions are available for select industries and allow your\ncitizens to benefit from the same technology as bigger cities or\norganizations. Pricing is based on the size of your population / number of\ncustomers.\n\n##### Local Government Subscription\n\n##### Utilities Subscription\n\n##### Education Subscription\n\n##### Airports Subscription\n\nAre you a technology-focused startup? We may have a subscription program for\nyou! Please get in touch with our team.\n\n##  FAQ's\n\nExpand All plus-circle Collapse All minus-circle\n\n  * ### I have existing FME licenses. What happens to them under an Enterprise Subscription?\n\nYou have two choices for existing FME licenses:\n\n(1) You continue paying maintenance on your licenses separately. Choosing this\noption will not count towards your threshold asset value.\n\n(2) Or, you can roll your licenses into the Enterprise Subscription and pay\nthe annual flat fee. This will ensure that maintenance for all your licenses\nare included in your new cost.\n\n  * ### I recently paid my Annual Maintenance. Can I get a credit towards the Enterprise Subscription?\n\nYes. We provide a prorated credit for the number of months remaining in your\nAMC total. This will go towards your Enterprise Subscription for the first\nyear.\n\n  * ### What prices are used to determine the price for the FME asset value?\n\nThe pricing displayed in the tiers are based on our list prices. Please refer\nto your regional price list for accurate pricing.\n\n  * ### Can you guarantee the pricing and threshold of the FME asset value for more than one year?\n\nYes. The Enterprise Subscription gives you the option for two additional one-\nyear renewals using the same Tier Level pricing grid.\n\n  * ### Can we go past the threshold of FME asset value for a given tier?\n\nYes. When you cross the tier threshold you will pay the new tier rate at your\nrenewal date.\n\n  * ### There are a limited number of tiers. What are the options when we reach the top tier?\n\nContact the Safe Software sales team or your existing partner and we would be\nhappy to discuss your Enterprise Subscription needs.\n\n  * ### I have a project that needs FME for a short period of time, can I use this for a project?\n\nYes. You can subscribe to an Enterprise Subscription subscription for one year\nand use it for your project.\n\n  * ### What is your support policy?\n\nWe recognize the importance of providing useful and timely support to our\nusers and believe it’s part of what sets Safe apart. Learn more about our\nsupport policy.\n\n  * ### What is the difference between FME licenses purchased individually and licenses used under the Enterprise Subscription?\n\nFME licenses that are purchased individually have a perpetual term. This\ngrants continuous use of your FME licenses, but in order to receive upgrades\nand support, you will have to purchase annual maintenance.\n\nFME licenses used under the Enterprise Subscription will timeout at the end of\nthe subscription period unless you renew. You will have full access to support\nand upgrades at no additional cost during the subscription period.\n\n##### Still have questions?\n\nLet us help. Contact sales@safe.com, or +1 604-501-9985 ext 287, or contact\nyour local partner.\n\n##  Pricing for Individual Products\n\n### FME Form Pricing\n\n### FME Flow Pricing\n\n### FME Flow Hosted Pricing\n\nProducts\n\n  * FME Platform\n  * Free Trial Downloads\n  * Customers\n  * Pricing\n  * Training\n  * Knowledge Base\n\nHelp\n\n  * Training\n  * Knowledge Base\n  * Forums\n  * Support\n\nCompany\n\n  * About\n  * Contact\n  * Careers\n  * Blog\n  * Forums\n  * Support\n\nSecondary Email\n\nPrimary Address\n\nSubscribe to our mailing list\n\nSend me updates from Safe Software (I can unsubscribe any time - privacy\npolicy)\n\nEmail Address*\n\nIndustry* Select an Industry AEC (Architecture Engineering and Construction)\nAirports & Aviation Commercial Defence/Aerospace Education/Non-Profit Energy\nGovernment (Federal) Government (Local) Government (State/Provincial)\nHealthcare/Health Tech Natural Resources Software/Technology\nTelecommunications Transportation Utilities Subscribe\n\nAn email is required.\n\nAn Industry is required.\n\n* * *\n\n© 2024 Safe Software Inc | Legal | Privacy Settings\n\n**Land Acknowledgement —** Safe Software respectfully acknowledges that we\nlive, learn and work on the traditional and unceded territories of the\nKwantlen, Katzie, and Semiahmoo First Nations.\n\n×\n\n## Purchase Enterprise Subscription\n\nPlease tell us what you're interested in, and a Safer or one of our partners\nwill contact you to provide more information.\n\nComments\n\nFirst Name*  Last Name*  Company*  Email*\n\nPhone Number\n\n* * *\n\nIndustry* Select an Industry AEC (Architecture Engineering and Construction)\nAirports & Aviation Commercial Defence/Aerospace Education/Non-Profit Energy\nGovernment (Federal) Government (Local) Government (State/Provincial)\nHealthcare/Health Tech Natural Resources Software/Technology\nTelecommunications Transportation Utilities Selected Tier*  \\-- Select a Tier\n-- Tier 1 - $50000 USD / Year  Tier 2 - $75000 USD / Year  Tier 3 - $100000\nUSD / Year  Tier 4 - $150000 USD / Year  Tier 5 - $200000 USD / Year  Tier 6 -\n$250000 USD / Year  Which country will FME be deployed in?*  \\-- Select a\nCountry -- Afghanistan Albania Algeria Andorra Angola Antigua and Barbuda\nArgentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain\nBangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bosnia\nand Herzegovina Botswana Brazil Brunei Bulgaria Burkina Faso Burma Burundi\nCambodia Cameroon Canada Cape Verde Cayman Islands Central African Republic\nChad Chile China Colombia Comoros Congo Costa Rica Croatia Cyprus Czechia Côte\nD'ivoire Democratic Republic of the Congo Denmark Djibouti Dominica Dominican\nRepublic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Ethiopia\nFYRO Macedonia Fiji Finland France French Polynesia Gabon Georgia Germany\nGhana Greece Greenland Grenada Guatemala Guinea Guinea-bissau Guyana Haiti\nHonduras Hong Kong Hungary Iceland India Indonesia Iraq Ireland Israel Italy\nJamaica Japan Jordan Kazakhstan Kenya Kiribati Korea, Republic of Kuwait\nKyrgyzstan Laos Latvia Lebanon Lesotho Liberia Liechtenstein Lithuania\nLuxembourg Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands\nMartinique Mauritania Mauritius Mexico Micronesia Moldova Monaco Mongolia\nMontenegro Morocco Mozambique Namibia Nauru Nepal Netherlands New Zealand\nNicaragua Niger Nigeria Norway Oman Pakistan Palau Panama Papua New Guinea\nParaguay Peru Philippines Poland Portugal Qatar Reunion Island Romania Rwanda\nSaint Lucia San Marino Saudi Arabia Senegal Serbia Seychelles Sierra Leone\nSingapore Slovakia Slovenia Solomon Islands Somalia South Africa Spain Sri\nLanka St Kitts and Nevis St Vincent and the Grenadines Sudan Suriname\nSwaziland Sweden Switzerland São Tomé and Príncipe Taiwan Tajikistan Tanzania\nThailand The Gambia Togo Tonga Trinidad and Tobago Tunisia Turkey Turkmenistan\nTuvalu Uganda Ukraine United Arab Emirates United Kingdom United States\nUruguay Uzbekistan Vanuatu Vatican City Venezuela Vietnam Western Samoa Yemen\nZambia Zimbabwe Will you be working with one of our partners? Yes No Which\npartner are you working with?  Comments? How can we help you? (Optional)  Send\nme updates from Safe Software (I can unsubscribe any time - privacy policy)  \n\nerror\n\nOh no! There are some errors in the form. Please check that you've filled out\nall the required fields.\n\nBy clicking “Accept All Cookies”, you agree to the storing of cookies on your\ndevice to enhance site navigation, analyze site usage, and assist in our\nmarketing efforts.\n\nCookies Settings Reject All Accept All Cookies\n\n## Privacy Preference Center\n\n  * ### Your Privacy\n\n  * ### Strictly Necessary Cookies\n\n  * ### Performance Cookies\n\n  * ### Targeting Cookies\n\n  * ### Social Media Cookies\n\n#### Your Privacy\n\nWhen you visit any website, it may store or retrieve information on your\nbrowser, mostly in the form of cookies. This information might be about you,\nyour preferences or your device and is mostly used to make the site work as\nyou expect it to. The information does not usually directly identify you, but\nit can give you a more personalized web experience. Because we respect your\nright to privacy, you can choose not to allow some types of cookies. Click on\nthe different category headings to find out more and change our default\nsettings. However, blocking some types of cookies may impact your experience\nof the site and the services we are able to offer.  \nFor more information and to see a list of cookies, please see our Privacy\nPolicy.\n\n#### Strictly Necessary Cookies\n\nAlways Active\n\nThese cookies are necessary for the website to function and cannot be switched\noff in our systems. They are usually only set in response to actions made by\nyou which amount to a request for services, such as setting your privacy\npreferences, logging in or filling in forms. You can set your browser to block\nor alert you about these cookies, but some parts of the site will not then\nwork. These cookies do not store any personally identifiable information.\n\n#### Performance Cookies\n\nPerformance Cookies\n\nThese cookies allow us to count visits and traffic sources so we can measure\nand improve the performance of our site. They help us to know which pages are\nthe most and least popular and see how visitors move around the site. All\ninformation these cookies collect is aggregated and therefore anonymous. If\nyou do not allow these cookies we will not know when you have visited our\nsite, and will not be able to monitor its performance.\n\n#### Targeting Cookies\n\nTargeting Cookies\n\nThese cookies may be set through our site by our advertising partners. They\nmay be used by those companies to build a profile of your interests and show\nyou relevant adverts on other sites. They do not store directly personal\ninformation, but are based on uniquely identifying your browser and internet\ndevice. If you do not allow these cookies, you will experience less targeted\nadvertising.\n\n#### Social Media Cookies\n\nSocial Media Cookies\n\nThese cookies are set by a range of social media services that we have added\nto the site to enable you to share our content with your friends and networks.\nThey are capable of tracking your browser across other sites and building up a\nprofile of your interests. This may impact the content and messages you see on\nother websites you visit. If you do not allow these cookies you may not be\nable to use or see these sharing tools.\n\nBack Button\n\n### Back\n\nFilter Button\n\nConsent Leg.Interest\n\ncheckbox label label\n\ncheckbox label label\n\ncheckbox label label\n\nClear\n\ncheckbox label label\n\nApply Cancel\n\nConfirm My Choices\n\nReject All Allow All\n\n"
}