{
    "summary": "Cookies on Funnel\n\nWe use necessary cookies to make our site work. We’d also like to use what we\ncall optional cookies, which are cookies we use to help us improve our the\nsite as well as for statistical analytic and advertising purposes. We won’t\nset optional cookies on your device if you do not consent to them. To learn\nmore, please view our cookie notice.\n\nIf you decline, your information won’t be tracked when you visit this website.\nA single cookie will be used in your browser to remember your preference not\nto be tracked.\n\nCustomise\n\nAccept  Decline\n\nGET IN TOUCH\n\nLOGIN\n\n  * Start for free \n  * Get a demo \n\n  * Platform\n\n    * Overview\n      * Platform overview \n\nLearn about Funnel’s features and benefits\n\n        *     * What can you do with Funnel?\n      * Connect \n\nGather data from any source\n\n        *       * Store \n\nSecurely store all your data\n\n        *       * Organize \n\nClean and harmonize data\n\n        *       * Share \n\nVisualize data where you want it\n\n        *     * Why Funnel?\n      * Case studies \n\n      * Data security \n\n      * Our customers \n\n  * Solution\n\n    * By role\n      * Digital marketing \n\n      * Data analyst / BI \n\n      * IT / Engineering \n\n    * By industry\n      * Agencies \n\n      * B2C \n\n      * B2B \n\n    * By use case\n      * Spend & performance monitoring \n\n      * Easy reliable reporting \n\n      * Data driven decision making \n\n  * Pricing\n  * Case studies\n  * Partners\n\n    *       * Solution partners \n\nWin more business and expand your service offering\n\n        *     *       * Technology partners \n\nSee the cloud, BI visualization, big data and analytics platforms we partner\nwith\n\n        *     *       * Partners directory \n\nFind the perfect Funnel partner to get the most out of your marketing data hub\n\n        *   * Resources\n\n    * Learn & get inspired\n      * Resources \n\nLearn about marketing, data & reporting\n\n        *       * Blog \n\nGain knowledge and insights\n\n        *     * Product\n      * Product updates \n\nGet alerted to the latest improvements\n\n        *       * Help center \n\nProduct walkthroughs & guides\n\n        *     * Most read\n      * Marketing Data State of Play 2024 \n\nCheck out insights on data-driven marketing & AI\n\n        *       * Guide to marketing reporting \n\n      * What is data transformation \n\nLogin\n\nGET IN TOUCH\n\nBook a demo\n\nBlog\n\n# What is data transformation?\n\nPublished Jul 22 2022  Last updated Jun 9 2023  6 minute read\n\n##### Contributors\n\nabout the contributors\n\n  * Written by Sean Dougherty \n\nA copywriter at Funnel, Sean has more than 15 years of experience working in\nbranding and advertising (both agency and client side). He's also a\nprofessional voice actor.\n\nThe question of “what is data transformation” can have a wide array of answers\nthat range from surface level overviews to heavy, deep explorations that\nrequire a cohesive understanding of programming languages and best practices.\n\nBut what about a nice happy medium in between those two polar extremes? Many\ndigital marketers don’t want to be bogged down in the minutiae of data\nwarehousing architectures, but they do want to understand this increasingly\nimportant concept.\n\nSo let’s explore the world of data transformation together. We’ll dive past\nthe surface explanations. But don’t worry — you won’t need a metaphorical\nsubmarine, maybe just your favorite imaginary SCUBA gear.\n\nHere we go!\n\n## **What is data transformation?**\n\nData transformation is the process of modifying data to fit a particular\npurpose or context. This can involve tasks such as cleaning, standardization,\nor aggregation, all aimed at enhancing the quality and usability of data for\nmore accurate analysis.\n\nTransformed data, then, is the result of this process. It's data that's been\nreshaped from its original form into a more structured and usable format. By\ntransforming raw data into a more analyzable form, it paves the way for data-\ndriven decision making in fields like business intelligence.\n\nLet’s explore that a bit further.\n\n### A first data transformation example\n\nThink of your ad performance data from social media platform “InstaTok.”\nPerhaps you’d like to visualize the key performance metrics from the last 6\nmonths. When quickly viewing the raw data, though, you notice that there are\nsome broken cells (or values) due to missing or incorrect data.\n\nIf you were to send this raw data values on to your visualization software,\nyour final dashboard would likely be broken in one or more places. In order to\navoid this, you need to apply some data transformations in order to remove\nthose broken values or to ensure that the data is accurately sent through.\n\nSimple enough, right?\n\nWe’re still at surface level in our data transformation exploration, though.\nTo continue our ocean metaphor, here, we are enjoying a nice relaxing snorkel\naround a reef. Time to plunge a bit deeper.\n\n## **Why data transformation is so valuable**\n\nSo, why all the fuss about this data transformation idea? Well, for starters,\nit’s a critical step in broader, more detailed data analysis and maintenance.\nHowever, it’s also common sense for modern digital marketers who are running\ncomprehensive campaigns across many different platforms.\n\nTo effectively carry out these transformations, a robust data transformation\ntool is often required. These tools can automate many of the tasks involved in\ncleaning and standardizing data, making the process more efficient and less\nprone to error.\n\nEven Facebook and Google, two of the most popular digital advertising\nplatforms, treat data differently. Whether it’s cross-device conversions,\nclicks, UTM parameters, attribution, and more, it can be extremely difficult\nto directly compare performance results between the two platforms using their\nraw, standard data sets.\n\nInstead, marketers need to integrate and transform this data so that the\nvarious parameters and metrics align. This is a process also known as data\nintegration or data mapping. Data integration allows you to make easy\ncomparisons between platforms as well as using the combined data to gain\nhigher-level insights from the broader campaign ecosystem.\n\nBeyond ensuring that all of your advertising sources are “speaking the same\ndata language,” it is often worth thinking about the types of data\ntransformations that are useful on a global scale, literally.\n\n\n\n### Data transformation makes global campaigns easier to analyze\n\nIf your campaign is running across international boundaries, or serves\ncustomers in different countries, you will almost certainly need to employ\nsome currency transformations.\n\nIt’s important to be strategic and careful here, though. This is one of those\npoints where you could stay nice and comfy by our metaphorical reef, or you\ncould drift off into the big dark ocean depths. What we mean is that, with\ncurrency, you need to factor in current versus historical conversion rates.\n\nAre you looking at real values? Are your historical values adjusted for\ninflation? The questions go on, but let’s swim back toward the safety of our\nreef for a second to talk about a simpler global transformation: time zones.\n\nImagine you drop a new sneaker or software product to your markets globally.\nYou may want to launch the products at the same moment, regardless of the time\nzone in each market. That could be noon in the UK, which would be 7 a.m. in\nNew York. When looking back on your performance numbers, it may be valuable to\nadjust time zone data to reflect the coordinated global launch.\n\n### **Sending transformed data to your target destination**\n\nLet’s also not forget one of the most common reasons we see data\ntransformation being implemented. As we covered previously, Looker Studio is\none of the most popular visualization services on the market. It’s robust,\nsolid, and free.\n\nOne of its main limitations, however, is that it can only pull data from a\nsingle source. Because of this, we see many of our clients start out their\ndata journey (before joining forces with Funnel) by pulling everything into a\nmassive Google Sheet where they apply a series of data transformations. After\nall, Looker Studio is great at making visualizations, but it's simply not\nbuilt for transforming and cleaning your data.\n\nFor larger organizations, a cloud data warehouse can be a more scalable\nsolution for storing and transforming data. These platforms offer the\nadvantage of high capacity storage, computing power, and distributed\nprocessing capabilities. This makes it possible to perform data\ntransformations on large datasets in real-time, ensuring that your transformed\ndata is always up-to-date and ready for analysis.\n\n## **Is data transformation difficult?**\n\nThere is a reason we picked a deep sea diving metaphor to speak about data\ntransformation. If you are experienced (or have an expert guide) and you are\nready to dive deep, there is plenty of room to explore the topic of data\ntransformation.\n\nFor beginners, it’s best to start with simple transformations, and build from\nthere. Feel free to dip your toe in the shallow end, then begin a short\n“snorkeling adventure.” As your skills and knowledge improve, you can feel\nconfident in exploring transformation further and deeper while creating a\nrefined data transformation process.\n\nHowever, one of the biggest challenges with data transformation is that, at\nthe more complex level, it often requires custom code and even BI teams.\nEspecially when converting and integrating custom data fields, specialized\nprogramming languages and logic need to be employed to ensure that every\ninconsistency is picked up and addressed.\n\nA common way to achieve this is through regular expressions, or Regex. Think\nof it as a sort of “find and replace” for your mismatched data. In fact, Alex\naddressed the topic in one of his Funnel Tips episodes.\n\n## **Types of data transformation**\n\nIn addition to some of the types we listed above, here are a few common data\ntransformation techniques and methods:\n\nTranslation and data mapping  \nSplitting  \nGeneralization  \nIntegration  \nDiscretization  \nManipulation\n\n\n\n### Translation and data mapping\n\nWith this specific data transformation, you are simply matching fields from\none database to another. One database may use abbreviated country code like\nUSA, MEX, and GRE while another may spell out country names. The data mapping\nprocess ensures that those fields match.\n\n\n\n### Splitting\n\nThink of your data represented in a spreadsheet. Splitting is the process of\nconverting a single column into multiple columns of data points. For instance,\nif a column consists of full URLs, you may want to split them so that the\ndomain names and slugs are separate.\n\n\n\n### Generalization\n\nIt’s typically bad to generalize in polite conversation, but it can be useful\nin data transformation. It can help to simplify low-level data sets into\nhigher-level categories that are easier to understand. One example may be\nsimplifying the timing of customer activities throughout the day into two\ncategories: morning and afternoon.\n\n\n\n### Integration\n\nSometimes called aggregation, integration is the process of combining data\nfrom different sources to one united view. For instance, you may wish to\nintegrate sales metrics from your brick-and-mortar store with your e-commerce\nplatform.\n\n\n\n### Discretization\n\nWhile it may be a bit of a tongue twister, it’s simply the act of combining\nvalues into sets of value ranges. This can help to make large numerical data\nsets a bit more easy to understand and to work with.\n\n\n\n### Manipulation\n\nThis one is pretty straightforward. Manipulation is the act of changing data\nto make it more legible and better organized. It can even be as simple as\nchanging the length of decimal values.\n\nFor more data transformation examples, see the dedicated article.\n\n## **Looking for more?**\n\nData transformation is a big part of why Funnel exists. We are pretty obsessed\nwith it. Well… maybe not obsessed, but we’re _really_ into it. Check out some\nof the videos and links below to explore the topic further.\n\n\n\nThe basics of REGEX:\n\n\n\nData aggregation in 2 minutes:\n\n\n\nEvents in Google Analytics 4, explained:\n\nAre you trying to figure out how to apply data transformations within Funnel?\nGreat! We have plenty of resources available. Click one of the explainers\nbelow, or head to our Knowledge Base for the full listing.\n\n  * How to rename fields\n  * How does currency conversion work in Funnel?\n  * Custom dimensions explained\n  * How to use text splitting\n  * How to use regex matches\n  * Why can’t I calculate CPC in a rule?\n\n\n\n## **Frequently Asked Questions**\n\n### What are data transformation tools?\n\nData transformation tools allow you to process and change data to ensure it is\nready for visualization or analysis. These tools can play an important role in\nthe data transformation process. While there are a lot of data transformation\ntools on the market, we recommend products that are closer to a data hub,\nwhich can transform your data, collect it, store it, and send it anywhere it\nneeds to go.\n\n### An example of data transformation\n\nAs we mentioned above, some examples of data transformation include mapping,\nintegration, discretization, and more. Read more here: Data transformation\nexamples.\n\n### Why is data transformation important?\n\nData transformation ensures that all of your metrics are uniform, which allows\nfor better analysis and stronger insights. Data transformation tools have thus\nbecome very important in BI, but are also increasingly important in other\nareas, such as marketing, sales, and even HR.\n\n  \n  \n\n##### Contributors\n\nabout the contributors\n\n  * Written by Sean Dougherty \n\nA copywriter at Funnel, Sean has more than 15 years of experience working in\nbranding and advertising (both agency and client side). He's also a\nprofessional voice actor.\n\n##### Want to work smarter with your marketing data?\n\nDiscover Funnel\n\nWhat is data transformation?\n\nWhy data transformation is so valuable\n\nIs data transformation difficult?\n\nTypes of data transformation\n\nLooking for more?\n\nFrequently Asked Questions\n\nTable of Contents\n\nRelated Posts\n\nThe art of ad buying (for agencies)\n\nJanuary 11, 2024\n\nWhat’s in and what’s out in 2024?\n\nJanuary 10, 2024\n\nWhat is ad fatigue and how to prevent it\n\nJanuary 9, 2024\n\n  * PLATFORM \n\n    * Overview\n    * Connect\n    * Store\n    * Organize\n    * Share\n    * Pricing\n    * Privacy & Security\n  * SOLUTIONS \n\n    * Digital Marketing\n    * Data Analysts / BI\n    * IT / Engineering\n    * Agencies\n    * Connections\n    * Partner Program\n    * Find a Partner\n  * COMPANY \n\n    * About us\n    * Contact Us\n    * Media Kit\n    * Careers\n    * Corporate\n  * RESOURCES \n\n    * Resources Library\n    * Blog\n    * Knowledge Base\n    * Case Studies\n    * Customers\n    * Product Updates\n\n© Funnel.io\n\nFollow us on Facebook Follow us on LinkedIn Follow us on Twitter\n\n  * Privacy and Cookie Notice\n  * Video Surveillance Notice\n  * General Terms and Conditions\n  * Information Security Overview\n\n",
    "links": "[{\"link\": \"https://funnel.io/blog/what-is-data-transformation\", \"text\": \"\"}, {\"link\": \"https://funnel.io/blog/your-guide-to-data-mapping\", \"text\": \"data mapping\"}, {\"link\": \"https://funnel.io/blog/the-top-visualization-tools-according-to-funnel\", \"text\": \"As we covered previously\"}, {\"link\": \"https://funnel.io/blog/your-guide-to-data-mapping\", \"text\": \"data mapping\"}, {\"link\": \"https://funnel.io/blog/data-transformation-examples\", \"text\": \"data transformation examples\"}, {\"link\": \"https://funnel.io/blog/which-data-transformation-tool-is-best-for-digital-marketers\", \"text\": \"data transformation tools\"}, {\"link\": \"https://funnel.io/blog/data-transformation-examples\", \"text\": \"Data transformation examples\"}]"
}