{
    "summary": "Skip to content\n\n  * Solutions\n    * Astera Data Stack\n      * Data Integration\n      * Unstructured Data Management\n      * EDI Management\n      * Data Warehousing\n      * API Management\n    * ##### Data Solutions 2.0: Embracing the AI-driven Automation Era\n\nLearn More About the Transformative Impact of AI and Automation on Data\nManagement\n\nWatch Webinar __\n\n###### WHAT’S NEW\n\n##### Introducing Astera 10.5\n\nFeaturing Data Governance and more!\n\n##### Astera and Carahsoft Join Forces\n\nProviding Data Management Solutions to Federal Government Agencies\n\n  * By Industry\n    * Financial Services\n      * Healthcare\n      * Education\n      * Government\n    * Insurance\n      * Media and Communications\n      * Retail\n    * ##### DXC Technology\n\nFrom 6 Months to 1 Week: How Astera Transformed DXC's Insurance Client\nMigration\n\n##### GaP Solutions\n\nThe Retail Solutions Provider Uses Astera to Process Invoices within 3 Minutes\n\n  * Services\n    * Professional Services\n      * Support Login\n      * Turnkey Data Warehouse Solution\n    * ##### Astera Data Academy\n\n**New Courses**\n\nExtracting Unstructured Data\n\nAPI Management\n\nJoin Data Academy __\n\n  * Resources\n    * Blogs\n      * eBooks\n      * Knowledge Center\n      * Infographics\n      * Product Documentation\n    * Videos\n      * Webinars\n      * Whitepapers\n      * Case Studies\n    * ###### Start Here\n\n##### Charting Business Value Through Data Driven Decisions\n\nLearn How to Make Data Analysis-Ready to Evaluate Performance and ROI.\n\n##### Data-driven Finance with Astera Data Stack\n\nLearn How our Solutions Facilitate Seamless Finance Data Management\n\n  * Company\n    * About Us\n    * Careers\n    * News\n    * Events\n    * Awards\n    * Support\n  * Customers\n    * User Reviews\n    * Referral Program\n    * ReportMiner Referral Program\n  * Partners\n  * Contact\n  * FREE TRIAL\n  *     *     *     *     *     *     *   * Search\n\n  * Search\n  * Solutions __\n    * Astera Data Stack __\n    * Data Integration __\n    * Unstructured Data Management __\n    * EDI Management __\n    * Data Warehousing __\n    * API Management __\n  * By Industry __\n    * Financial Services __\n    * Healthcare __\n    * Education __\n    * Government __\n    * Insurance __\n    * Media and Communications __\n    * Retail __\n  * Services __\n    * Professional Services __\n    * Support Login __\n    * Turnkey Data Warehouse Solution __\n  * Resources __\n    * Blogs __\n    * eBooks __\n    * Knowledge Center __\n    * Infographics __\n    * Product Documentation __\n    * Videos __\n    * Webinars __\n    * Whitepapers __\n    * Case Studies __\n  * Company __\n    * About Us __\n    * Careers __\n    * News __\n    * Events __\n    * Awards __\n    * Support __\n  * Customers __\n    * User Reviews __\n    * Referral Program __\n    * ReportMiner Referral Program __\n  * Partners __\n  * Contact __\n  * FREE TRIAL __\n\n##### Blogs\n\nHome / Blogs / What is Data Transformation & How Does it Work?\n\nTable of Content\n\n##### The Automated, No-Code Data Stack\n\nLearn how Astera Data Stack can simplify and streamline your enterprise’s data\nmanagement.\n\nStart Your Free Trial!\n\n# What is Data Transformation & How Does it Work?\n\nFasih Khan\n\n__January 8th, 2024\n\nData is a valuable resource that helps your business make better decisions and\ngain a competitive edge. But how can you make customers, rivals, and business\ninformation easily accessible to everyone in your organization? The solution\nis data transformation.\n\n## What is Data Transformation?\n\nData transformation is the process of converting, structuring, and cleansing\nraw data from one format to another to make it ready for analytics and\nconsumption. It is a critical part of the data integration process and\nconsists of multiple steps, such as filtering your data based on specific\nrules and joining different fields to get a consolidated view of all your\ndata.\n\nThe ETL (Extract, Transform, Load) process extracts raw data from a source,\nconverts it into a usable format, and sends it to a target system. Raw data is\nunusable in its original form, so you must transform it to use it.\n\nMost ETL tools also provide predefined functions that you can use to change\nyour data quickly and efficiently. Here are some of the steps that are\ninvolved in this process:\n\n  * Identify the structure of the source files and extract data from them.\n  * Next, map the data from the source file to the transformation tool.\n  * Apply the transformation (i.e., filter, sort, cleanse, or aggregate data).\n  * Finally, send the transformed file to the destination.\n\n## Benefits of Data Transformation\n\nData serves various purposes for organizations and businesses, from analyzing\nsupply chains, customer behaviors, and internal processes to creating\nautomated data-driven workflows. However, for these purposes, it must be in a\nusable format, and data transformation ensures that data achieves this\nusability, resulting in the following benefits:\n\n  * **Gaining maximum value from data** : Most organizations are unable to gain maximum value from data due to factors such as volume, complexity, quality, and lack of tools and skills. Forrester reports that organizations never analyze up to 73% of all data. Data transformation is a process that can help them overcome these challenges by changing the structure and format of raw data to make it more suitable for analysis. This improves data quality and facilitates analysis, enabling them to leverage more effectively in decision making.\n  * **Standardizing data** : Data coming from multiple sources may be inconsistent, making it difficult to use in analytics. Data transformation helps you standardize data.\n  * **Improved accuracy and compliance:** Transformed data undergoes cleansing, validation, and enrichment, improving its consistency and reliability. The improved data quality makes it easier to ensure regulatory compliance.\n  * **Performing faster queries** : Transforming data allows you to store it in a standardized format. Standard formats enable faster queries, making it easier to retrieve data quickly.\n  * **Enhancing data quality** : Transforming data can help you eliminate data quality issues such as missing, inconsistent, duplicate, or invalid values. As a result, you can avoid costs and risk associated with poor data quality.\n\n## How Data Transformation Works\n\nThe goal of data transformation is straightforward – extract data from the\nsource, change it to a usable format and load it to a destination. It is an\nessential part of ETL pipelines.\n\nData transformation allows you to clean, reshape, and compute new data\ndimensions and metrics based on your needs. Traditionally, it takes anywhere\nfrom hundreds to thousands of lines of code to build ETL or ELT pipelines.\nHowever, with a no-code ETL tool, you can easily build these pipelines on a\nvisual canvas, known as a dataflow.\n\n  1. **Identify sources:** First, you must identify data sources you must transform. Those sources can be databases, Excel, delimited files, legacy sources, or even cloud connectors. Some data extraction tools also allow you to extract data from unstructured files such as PDFs.\n  2. **Data mapping** **:** In this phase, the actual transformation is planned. You must decide where the data is sourced and where it will be saved. The goal is to change the source data to a format suitable to the destination. For instance, data from source files in XML or Excel format needs to be transformed into SQL format. To make the format suitable for analytics, you may have to perform several operations, such as adding, deleting, copying, and replicating fields and records.\n  3. **Choose Transformation:** Here, you choose the relevant transformation that fits with your planned data mapping and put the data transformation process into motion, converting the data into the desired output. Here are a few transformations you can leverage: \n    * **Filtering** is the process of selecting a subset of data that meets certain criteria or conditions. For example, only loading records from a certain period, such as after January 1st, 2010, is a filtering operation that excludes data from before that date.\n    * **Enriching** is the process of adding new information or value to existing data. For example, creating a new column titled Body Mass Index (BMI) by calculating values from the age, height, and weight columns is an enriching operation that adds a new measure of health to the data.\n    * **Splitting** is the process of breaking down a complex or composite data element into simpler or more atomic parts. For example, dividing the Full Name column into separate columns for First Name, Middle Name, and Last Name is a splitting operation that separates the name components.\n    * **Joining** is the process of combining data from different sources or tables based on a common attribute or key. For example, combining data from HR and Finance to generate employee payroll reports is a joining operation that merges data from two departments using the employee ID as the key.\n    * **Removing** duplicate data is the process of eliminating redundant or repeated data elements from a data set. For example, removing duplicate records of the same order from the Orders table is a data operation that ensures data quality and accuracy.\n    * **Review:** Once the transformations are applied, you must check the transformed data to ensure it has been formatted correctly.\n\nBesides these steps, you may need to perform other customized operations to\ntailor the data to your desired format. Once the data has been transformed,\nyou can load it into the target destination to put it to work. Remember that\nnot all data require transformation—sometimes, the source data is suitable for\nimmediate use.\n\n## Data Transformation Types\n\nThe data transformation capability is available in various data integration\ntools. A good thing about this process is that you can do it in several ways.\nEach approach comes with its unique benefits and limitations. Let’s look at\nsome of the standard transformation techniques.\n\n### On-Premises Data Transformation\n\nOn-premises data transformation is the process of using a data management tool\nor application installed and hosted on the organization’s servers or\ninfrastructure to perform data transformation tasks. It helps with increased\nregulatory compliance and better security management. Most tools come with\ndrag-and-drop functionality, which means that non-technical employees can\ntransform data and convert it into a usable format.\n\n### Cloud-Based Data Transformation\n\nCloud data transformation is the process of using a software tool or service\nthat is hosted and accessed on the internet or a cloud platform to perform\ndata transformation tasks. The pay-as-you-go feature of most cloud-based tools\nallows businesses to scale up and down as and when necessary, which is one of\nthe reasons why cloud-based tools are popular.\n\nWhile saving crucial enterprise data on a third-party cloud-based server has\nits share of security concerns, one benefit of transforming data on the cloud\nis short installation and configuration times. This means businesses can make\nchanges to their data without experiencing significant delays.\n\n### Manual Data Transformation\n\nManual data transformation is the process of manually writing code or scripts\nto manipulate and transform data from one format or structure to another. This\nprocess requires a high level of technical expertise and can be time-\nconsuming, error-prone, and costly, especially when dealing with multiple file\nformats.\n\nThis requires a professional on the team dedicated to this task, increasing\nthe risk of human error and inaccuracy.\n\n**Easily Convert Data With Our Drag-And-Drop Solution**\n\n**SEE HOW IT’S DONE  **\n\n## Data Transformation Techniques\n\nTransformation techniques are different from data transformation types. There\nare multiple ways to transform your data, but techniques vary according to\nyour goals and needs. The following are some of the most used data\ntransformation techniques:\n\n### 1) Data Smoothing\n\nData smoothing is used to remove meaningless or distorted data **(also called\nnoise)** from a dataset. Smoothing algorithms help you highlight random\nfluctuations and outliers, making it easier to remove unnecessary information.\n\nFor instance, data smoothing is crucial in helping traders and investors\nidentify patterns and trends in stock prices. It helps remove noise and helps\nthem plan better to accommodate  seasonality and volatility of stock prices.\nTraders leverage data smoothing techniques like the moving average to\ncalculate the average price of a stock over a specific duration.\n\nLearn how to perform data smoothing in time series analysis.\n\n### 2) Data Aggregation\n\nData aggregation is one of the most crucial data transformation techniques.\nIt’s the process of standardizing data gathered from multiple sources by\nstoring it in a desired format. It makes data easy to retrieve and present.\n\nAggregated data can help you in several ways. For instance, you can aggregate\ndata from your website, email campaigns, CRM system, surveys, and social media\nto more accurately analyze customer demographics, behavior metrics, and\npreferences.\n\n### 3) Discretization\n\nDiscretization **(also called binning)** is another useful technique for data\ntransformation. It helps transform continuous data into a series of data\nintervals and replaces continuous attribute values with interval labels,\nmaking data easier to analyze.\n\nFor instance, patient age in healthcare datasets is stored numerically, but\ntransforming these numerical values into intervals (e.g., patients aged 18 to\n25) makes it easier to study patient dynamics.\n\n### 4) Generalization\n\nGeneralization is a data transformation technique that allows you to convert\nlower-level data into higher-level data based on a predefined taxonomy or\nhierarchy. For instance, you can use this technique to replace cities in a\ndataset with their country or continent. Likewise, timestamp values such as\n2023-08-17 15:26:43 can be replaced with August 2023, 2023, or 2020s.\n\n### 5) Construction of Attributes\n\nThis technique can help you generate new attributes based on existing\nattributes. For instance, if you have a dataset logging the date and time of\ntransactions, it can help you create new attributes such as day of week,\nmonth, season, hour, etc. These new attributes can then help identify trends\nor patterns, such as seasonal effects, peak hours, and more.\n\n### 6) Scaling\n\nScaling in data transformation is a technique that transforms the values of a\ndataset into a common scale. One example of scaling is **min-max** , which\nscales the data to a range between **0 and 1**. Scaling helps preserve the\nrelative order and distance of the original values. There are other types of\nscaling techniques, such as z-score, log, and clipping.\n\n### 7) Normalization\n\n**Normalization (pivot)** and **denormalization (unpivot)** are two techniques\nthat transform the data from rows to columns or vice versa. They help you\noptimize, enhance, and protect your data for different purposes. Normalization\n(pivot) reduces the data size and complexity by grouping it into categories or\ndimensions. Denormalization (unpivot) increases the data speed and richness by\nsplitting it by attributes or values.\n\n### Turn Disparate Data  \nInto Powerful Insights\n\nTransform raw data into accurate insights in minutes.  \nEasily establish connectivity with a wide range of sources.\n\nGet Your Free Trial!\n\n## Astera: The Easy Way to Transform Data\n\nAstera is a complete data integration platform that allows users to extract,\nmap, transform, and load their data in a code-free environment. In addition,\nit also includes functionality for other types of transformations, such as\ndata profiling capabilities, allowing users to get a holistic view of their\ndata. You can also profile data to compare its pre- and post-transformed\nstatistical overview.\n\nStart your data transformation journey with Astera – get a 14-day trial now!\n\n##### You MAY ALSO LIKE\n\n###### Data Vault vs. Data Mesh: Choosing the Right Data Architecture\n\nData volume continues to soar, growing at an annual rate of 19.2%. This means\norganizations must look for ways to...\n\nRead __\n\n###### A Beginner’s Guide to Data-Driven Marketing\n\nAccording to Google, nearly 7 in 10 leading marketers say their companies use\ndata to support decision-making at all levels....\n\nRead __\n\n###### Data Centralization – A Guide to Modernizing Financial Analytics\n\nFinancial institutions have traditionally relied on fragmented data sources\nand siloed analytics systems. However, in today's fast-paced and data-driven\nenvironment,...\n\nRead __\n\n###### Considering Astera For Your Data Management Needs?\n\nEstablish code-free connectivity with your enterprise applications, databases,\nand cloud applications to integrate all your data.\n\nLet’s Connect Now!\n\n#### SUPPORT\n\n  * Resources\n  * Forum\n  * Product Documentation\n\n#### COMPANY\n\n  * About Astera\n  * Careers\n  * Contact\n\n#### PARTNERS\n\n  * Partner Program\n  * Technology Partners\n  * Resellers\n\n#### CUSTOMERS\n\n  * Case Studies\n  * User Reviews\n  * Referral Program\n\n#### PRICING\n\n  * Request a Quote\n\n  * __\n  * __\n  * __\n  * __\n\n  * Privacy Policy\n  * Terms of Use\n  * Site Map\n\nCopyright (c) 2023 Astera Software. All rights reserved.\n\n  * Privacy Policy\n  * Terms of Use\n  * Site Map\n\n  * __\n  * __\n  * __\n  * __\n\n",
    "links": "[{\"link\": \"https://www.astera.com/news\", \"text\": \"News\"}, {\"link\": \"https://www.astera.com/resources/\", \"text\": \"\"}, {\"link\": \"https://www.astera.com/partners/\", \"text\": \"\"}, {\"link\": \"https://www.astera.com/pricing/\", \"text\": \"\"}, {\"link\": \"https://www.astera.com/privacy-policy/\", \"text\": \"Privacy Policy\"}, {\"link\": \"https://www.astera.com/terms-and-conditions/\", \"text\": \"Terms of Use\"}, {\"link\": \"https://www.astera.com/privacy-policy/\", \"text\": \"Privacy Policy\"}, {\"link\": \"https://www.astera.com/terms-and-conditions/\", \"text\": \"Terms of Use\"}, {\"link\": \"https://www.astera.com/site-map\", \"text\": \"Site Map\"}]",
    "priceAndPlans": "Skip to content\n\n  * Solutions\n    * Astera Data Stack\n      * Data Integration\n      * Unstructured Data Management\n      * EDI Management\n      * Data Warehousing\n      * API Management\n    * ##### Data Solutions 2.0: Embracing the AI-driven Automation Era\n\nLearn More About the Transformative Impact of AI and Automation on Data\nManagement\n\nWatch Webinar __\n\n###### WHAT’S NEW\n\n##### Introducing Astera 10.5\n\nFeaturing Data Governance and more!\n\n##### Astera and Carahsoft Join Forces\n\nProviding Data Management Solutions to Federal Government Agencies\n\n  * By Industry\n    * Financial Services\n      * Healthcare\n      * Education\n      * Government\n    * Insurance\n      * Media and Communications\n      * Retail\n    * ##### DXC Technology\n\nFrom 6 Months to 1 Week: How Astera Transformed DXC's Insurance Client\nMigration\n\n##### GaP Solutions\n\nThe Retail Solutions Provider Uses Astera to Process Invoices within 3 Minutes\n\n  * Services\n    * Professional Services\n      * Support Login\n      * Turnkey Data Warehouse Solution\n    * ##### Astera Data Academy\n\n**New Courses**\n\nExtracting Unstructured Data\n\nAPI Management\n\nJoin Data Academy __\n\n  * Resources\n    * Blogs\n      * eBooks\n      * Knowledge Center\n      * Infographics\n      * Product Documentation\n    * Videos\n      * Webinars\n      * Whitepapers\n      * Case Studies\n    * ###### Start Here\n\n##### Charting Business Value Through Data Driven Decisions\n\nLearn How to Make Data Analysis-Ready to Evaluate Performance and ROI.\n\n##### Data-driven Finance with Astera Data Stack\n\nLearn How our Solutions Facilitate Seamless Finance Data Management\n\n  * Company\n    * About Us\n    * Careers\n    * News\n    * Events\n    * Awards\n    * Support\n  * Customers\n    * User Reviews\n    * Referral Program\n    * ReportMiner Referral Program\n  * Partners\n  * Contact\n  * FREE TRIAL\n  *     *     *     *     *     *     *   * Search\n\n  * Search\n  * Solutions __\n    * Astera Data Stack __\n    * Data Integration __\n    * Unstructured Data Management __\n    * EDI Management __\n    * Data Warehousing __\n    * API Management __\n  * By Industry __\n    * Financial Services __\n    * Healthcare __\n    * Education __\n    * Government __\n    * Insurance __\n    * Media and Communications __\n    * Retail __\n  * Services __\n    * Professional Services __\n    * Support Login __\n    * Turnkey Data Warehouse Solution __\n  * Resources __\n    * Blogs __\n    * eBooks __\n    * Knowledge Center __\n    * Infographics __\n    * Product Documentation __\n    * Videos __\n    * Webinars __\n    * Whitepapers __\n    * Case Studies __\n  * Company __\n    * About Us __\n    * Careers __\n    * News __\n    * Events __\n    * Awards __\n    * Support __\n  * Customers __\n    * User Reviews __\n    * Referral Program __\n    * ReportMiner Referral Program __\n  * Partners __\n  * Contact __\n  * FREE TRIAL __\n\npricingAhmed Raza2023-11-30T06:49:00+00:00\n\n## Explore Astera’s Packages\n\nSimplify the way you build and execute your data pipelines to accelerate from\ndata to insights.\n\n### Data **Integration**\n\n  * **Code-free, Visual UI:** Design data processes using a drag-and-drop interface\n  * **Built-in- Connectors:** Access data from versatile on-premises and cloud sources and map onto the destination of choice using native connectors\n  * **Pre-Built Transformations:** Get analysis-ready data using an extensive library of transformations\n  * **Data Quality:** Get reliable data with data profiling and quality features\n  * **Instant Data Preview:** Debug errors in design-time through data preview\n  * **Powerful ETL Engine:** Scale for large data volumes with Astera’s powerful ETL engine\n  * **Automation:** Eliminate manual repetitive work by automating processes\n  * **Process Orchestration:** Sequence and orchestrate several steps of your data management pipeline in a series using workflows\n\nContact Sales\n\nPersonalized Demo\n\n### DATA **EXTRACTION**\n\n  * **Data Extraction:** Extract data from recurring business docs using a pattern-matching approach\n  * **Code-free, Visual UI** Extract data with an easy-to-use point and click interface\n  * **AI-Powered:** Create hundreds of templates within seconds using AI Capture\n  * **Built-In Connectors:** Access unstructured data from cloud and remote sources using pre-built connectors\n  * **Data Quality:** Ensure the validity of your data using custom data quality checks\n  * **Automation:** Cut down manual effort and execute repeatable processes through automation and scheduling\n  * **Deployment Ease:** Deploy your data extraction solution in the cloud or on-premises\n\nContact Sales\n\nPersonalized Demo\n\n### Data **Warehousing**\n\n  * **Code-free, Visual UI:** Execute data warehousing process in a visual UI\n  * **Unified Solution:** End-to-end, metadata-driven data warehousing in a unified platform Built-in-Connectors: Connect your data warehouse to leading on-prem and cloud databases\n  * **Automation:** Use a code-free environment, job scheduling, and workflow orchestration to automate data pipelines.\n  * **Versatile Data Modeler:** Automatically create and deploy desired data models—including dimension models 3NF, and data vaults\n  * **Deployment Feasibility:** Deploy data warehouse on the cloud or on-premises\n  * **Powerful ETL Engine:** Scale for large data volumes with Astera’s powerful ETL engine\n  * **OData Connectivity:** Connect data warehouse to BI reporting tools through OData\n\nContact Sales\n\nPersonalized Demo\n\n### Data **Services**\n\n  * **API Consumption:** Consume data through APIs and integrate with other systems\n  * **Code-Free Development:** Design and develop APIs and integrations in a drag-and-drop interface\n  * **Ease of Testing:** Debug APIs by testing in design-time and post-deployment\n  * **Deployment Flexibility:** Deploy APIs on-premises, in the cloud or in hybrid environment\n  * **Easy API Management:** Manage APIs in a centralized point-and-click wizard\n  * **Data Sharing:** Share data with partners and stakeholders by publishing flows as APIs\n  * **Built-In Monitoring:** Monitor API performance in a built-in dashboard\n\nContact Sales\n\nPersonalized Demo\n\n## Reviews\n\n## VanderBilt University\n\nCenterprise is amazingly intuitive and seems familiar. With assistance from\nthe excellent Astera support team, we are able to develop fairly complex\ndataflows within hours.\n\n-Bola Olusanya, Managing Director of Investment Risk Management\n\nRead Story\n\n## IT Contractor Pricing Review\n\nI can easily say that we are saving 1000 hours of manual data entry work a\nyear with ReportMiner. That’s just for the personnel data system. In other\nwords, it takes just 10 minutes to process a file instead of 3 hours.\n\nData Architect at the IT Contractor Company\n\nRead Story\n\n## Ciena Pricing Review\n\nAbility to easily convert PDF into text, especially in those situations where\nPDF documents have complicated format. So far, we have been able to address\nevery scenario. We have tried other service such as PDF Focus and Azure Form\nRecognizer but only ReportMiner was able to handle all scenarios. Best of all\nwas support provided by ReportMiner team.\n\nHayder Mir, Sr. Manager, Custom Applications\n\nRead Story\n\n## Cherry Health Pricing Review\n\nThere are a number of products on the market which can do this, but we went\nwith Astera because it’s interface is very user friendly. You can drag and\ndrop components to pull data from any source and then manipulate either all of\nthe data or individual fields the same way … I love that I don’t have to have\nsomeone fully trained in SQL code and SSIS in order to develop high quality\nsolutions.\n\nAndre Beaumont, Senior Database Manager at Cherry Health\n\nRead Story\n\n## Featured Resources\n\n## Automated Data Extraction\n\nLearn More\n\nWhitepaper\n\n## Build vs. Buy – How it applies to Enterprise Data Integration Software\n\nLearn More\n\nWhitepaper\n\n## Data Model-Centric Approach to Data Warehousing\n\nLearn More\n\nWhitepaper\n\n#### SUPPORT\n\n  * Resources\n  * Forum\n  * Product Documentation\n\n#### COMPANY\n\n  * About Astera\n  * Careers\n  * Contact\n\n#### PARTNERS\n\n  * Partner Program\n  * Technology Partners\n  * Resellers\n\n#### CUSTOMERS\n\n  * Case Studies\n  * User Reviews\n  * Referral Program\n\n#### PRICING\n\n  * Request a Quote\n\n  * __\n  * __\n  * __\n  * __\n\n  * Privacy Policy\n  * Terms of Use\n  * Site Map\n\nCopyright (c) 2023 Astera Software. All rights reserved.\n\n  * Privacy Policy\n  * Terms of Use\n  * Site Map\n\n  * __\n  * __\n  * __\n  * __\n\n"
}