{
    "summary": "__\n\nLearn with us at our weekly demos and see dbt Cloud in action!\n\nAchieve a 194% ROI with dbt Cloud | Read the study now!\n\nJoin us for a live event: How to get value from the dbt Semantic Layer\n\n__\n\n  * Login \n\n__\n\nSearch...\n\n  * Product \n\n#### Product\n\n    * __ What is dbt? \n\nLearn the essentials of how dbt supports data practitioners\n\n    * __ dbt Cloud \n\nExplore dbt Cloud, a turnkey platform that’s built for scale\n\n#### Implementation\n\n    * Semantic Layer \n    * dbt Explorer \n    * Security \n    * Integrations \n\n#### Data Platforms\n\n    * Snowflake \n    * Databricks \n    * Redshift \n    * Starburst \n\n  * Solutions \n\n    * __ Data Modernization \n\nUpgrade your strategy with the best modern practices for data\n\n    * __ Governance \n\nSupport growing complexity while maintaining data quality\n\n    * __ Data Vault \n\nUse Data Vault with dbt Cloud to manage large-scale systems\n\n    * __ dbt Mesh \n\nImplement data mesh best practices with the dbt Mesh feature set\n\n    * __ Cost Optimization \n\nReduce data platform costs with smarter data processing\n\n  * Customers \n\n#### Featured\n\n    * McDonald's Nordics \n\nEstablishes a standardized Data Vault structure with dbt Cloud.\n\n    * Nasdaq \n\nCreates new business opportunities through collaborative analytics.\n\n    * Condé Nast \n\nServes up multimedia content on a global scale with dbt Cloud.\n\n#### Case Studies\n\n    * Financial Services \n    * Healthcare \n    * IT & Software \n    * Oil & Gas \n    * Transportation \nView All __\n\n  * Learn \n\n#### Featured\n\n    * __ Weekly Demos \n\nWatch a weekly presentation on dbt and ask your questions live\n\n    * __ Expert Series \n\nLearn how dbt experts are solving challenging problems\n\n    * __ Zero to dbt Workshop \n\nLearn what dbt is and why it matters during this live, expert-led session\n\n#### Learn\n\n    * Blog \n    * Resource Hub \n    * Training \n    * Certification \n\n#### Docs\n\n    * Documentation \n    * Dev Blog \n    * Core Concepts \n    * Getting Started \n\n#### Connect\n\n    * Community \n    * Webinars \n    * Events & Meetups \n    * Coalesce Conference \n\n  * Company \n\n#### About\n\n    * __ Who We Are \n\nMeet dbt Labs leadership team and read the latest news about dbt\n\n    * __ Our Values \n\nLearn about the values that fuel dbt and shape our direction\n\n    * __ Careers \n\nExplore open roles and learn what it's like to work at dbt Labs\n\n#### Services\n\n    * Professional Services \n    * Become a Partner \n    * Find a Partner \n\n  * Pricing \n  * Book a demo \n  * Create a free account \n\n  * Book a demo \n  * Create a free account \n  * Login \n\nBlog __ Data transformation process: 6 steps in an ELT workflow\n\n# Data transformation process: 6 steps in an ELT workflow\n\nKira Furuichi  March 27, 2023 March 27, 2023\n\nKira Furuichi\n\nThe data transformation process can be broken down into six steps: extraction\nand loading, exploration, transformation, testing, documentation, and\ndeployment. Read now\n\nData transformation is the process of taking raw data and making meaning out\nof it; it forms the foundation of all analytics work and represents how data\npractitioners create tangible value from their companies.\n\nThe data transformation process can typically be broken down into six\ngenerally-defined steps: extraction and loading, exploration, transformation,\ntesting, documentation, and deployment. After these steps are taken, raw data\ntakes a new form of meaningful tables that power your company’s business\nintelligence efforts.\n\nWe’ll use this page to describe what the data transformation process looks\nlike for a typical ELT workflow.\n\n## Step 1: Extract and load\n\nIf your team is following an ELT workflow, where raw data sources are\nextracted and loaded into the data warehouse before data is transformed,\nyou’ll need to actually accomplish those extraction and loading steps before\nbeginning your transformation work!\n\n### Extraction\n\nIn the extraction process, data is extracted from multiple data sources\nrelated to your business. The data extracted is, for the most part, data that\nteams eventually want to use for analytics work. Some examples of data sources\ncan include: backend application databases, marketing platforms, email and\nsales CRMs, and more.\n\nThis data is typically extracted from their systems by interacting with an\nApplication Programming Interface (API) via custom scripts, or relying on the\nuse of an open-source or Software as a Service (SaaS) ETL tool to remove some\nof the technical lift.\n\n### **Loading**\n\nDuring the loading stage, data that was extracted is loaded into the target\ndata warehouse. Some examples of modern data warehouses include Snowflake,\nAmazon Redshift, and Google BigQuery. Examples of other data storage platforms\ninclude data lakes such as Databricks’s Data Lakes. Most of the SaaS\napplications that extract data from your data sources will also load it into\nyour target data warehouse. Custom or in-house extraction and load processes\nusually require strong data engineering and technical skills.\n\n## **Step 2: Data exploration**\n\nOnce raw data is in your data warehouse, it’s time to get an understanding of\nwhat this data looks like. During this stage, you’ll find yourself:\n\n  * Looking at available ERDs (entity relationship diagrams) and join keys to understand how data joins itself together\n  * Identifying which columns are potentially missing values or have misleading column names\n  * Writing ad hoc queries to perform some light analysis or summary statistics on the data—how many rows are there? Are primary keys unique? _Is there a primary key?_\n  * Understanding how currency, timezone, and data types differ across data sources\n\nThere is no perfect recipe for how to explore your raw data; do what feels\nnecessary for your data sources. If you have high confidence in the accuracy\nand completeness of your raw data, this step may feel less laborious than if\nyou question the integrity of your data (which, if you’re a data practitioner,\nis probably your natural inclination 😉).\n\n## Step 3: Data transformation\n\nIn the actual transformation step, the raw data that has been loaded into your\ndata warehouse, you’re familiar with how that data is structured, and you have\na general plan on how to approach it—it’s finally ready for your modeling\nprocess to begin! When you first looked at this data during the data\nexploration stage, you may have noticed a few things about it…\n\n  * Column names may or may not be clear\n  * Tables are not joined to other tables\n  * Timestamps may be in the incorrect timezone for your reporting\n  * JSON is abundant and may need unnesting\n  * Tables may be missing primary keys\n\n…hence the need for transformation! During the actual transformation process,\ndata from your data sources is usually:\n\n  * Lightly transformed: Fields are cast correctly, timestamp fields’ timezones are made uniform, tables and fields are renamed appropriately, and more. In dbt, this usually happens in staging models used to create clean, uniform slates for your data.\n  * Heavily transformed: Business logic is added, appropriate materializations are established, data is joined together, aggregates and metrics are created, etc. In dbt, this usually happens in intermediate and mart models, creating the tables that are ultimately exposed to end business users and business intelligence (BI) tools.\n\nCommon ways to transform your data include leveraging modern technologies such\nas dbt to write modular and version-controlled transformations using SQL and\nPython. Other solutions include writing custom SQL and Python scripts that are\nautomated by some type of scheduler or utilizing stored procedures.\n\n## Step 4: Data testing\n\nYour data is modeled now and _feels generally_ right, but how are you\nconfirming the quality of the data that is transformed? How are you ensuring\nthat the key metrics and data you’re exposing to downstream users are\ntrustworthy and reliable?\n\nAt this stage, data testing that meets your organization’s standards should be\nconducted. This may look like:\n\n  * Testing primary key for uniqueness and non-nullness \n  * Ensuring column values fall in an expected range\n  * Checking that model relations line-up\n  * And more.\n\nUsing a product like dbt, where you can define code-based tests to run against\nyour data transformations, you can create a system where transformations are\neasily and regularly tested against the standards you establish.\n\n## Step 5: Data documentation\n\nYour data is transformed into meaningful business entities, tested to your\nstandards, and is exposed to end users. How do you expect folks who were not\ndirectly involved in the transformation process to navigate through them? What\ndocumentation are you creating to clarify business logic in transformations\nand describe core metrics and columns?\n\nAt this stage, transformation is done, but in a way, the work is just getting\nstarted. To make your data transformations meaningful and impactful to end\nusers, it’s important to create and maintain robust documentation.\n\nWe recommend you start by documenting the following during your transformation\nprocess:\n\n  * The primary purpose of a transformation or data model—what is the main reason this transformation was created? What important reports is it powering in your BI tool?\n  * Key columns that have business logic implemented in them or ambiguous column names\n  * Aggregates and metrics\n\nDocumentation for data transformation processes should often be written in a\nway that is understandable to the people who were not involved in the original\nprocess, instead of focusing on the _how_ of a transformation for more\ntechnical users. Well-written transformation documentation welcomes business\nusers into the fold of analytics work, and is a foundational way to ensure\nyour end users feels comfortable and empowered to use the data your team works\nso hard to build.\n\n## Step 6: Schedule and automate\n\nYour data transformations are created, tested, and documented—now it’s time to\nget them out into the world. At this stage, data engineers, data analysts, or\nanalytics engineers will push these transformations to production—the process\nof running them in a production environment in the data warehouse. These\nproduction-ready tables are what analysts will query against for analysis and\nwhat a BI tool will read off of.\n\nThese data transformations will need to be refreshed, or updated, on a cadence\nthat meets your business needs using some type of scheduler or orchestrator.\nUsing a product like dbt Cloud, you can create your data transformations and\ntests within a collaborative integrated development environment (IDE) and then\nrun them on a regular cadence using the dbt Cloud job scheduler. Other\nsolutions that often require more technical lift include relying on custom\ncron schedulers or external orchestrators.\n\n## Rise and repeat!\n\nAfter you build your foundational data transformations, your focus will likely\nshift to optimizing, governing, and democratizing the work; for each new data\nsource, business problem, or entity needed, there will always be more data\ntransformation work to get done. As a result, a good data transformation\nprocess is one that is simultaneously rigid and flexible—the process allows\nfor enough guardrails to make analytics work worthwhile and organized, with\nenough room to be interesting, challenging, and customized to your business.\n\nLast modified on: Mar 27, 2023\n\n  * Accelerate speed to insight \n  * Democratize data responsibly \n  * Build trust in data across business \n\nCreate a free account Book a demo __\n\nAchieve a 194% ROI with dbt Cloud. Access the Total Economic Impact™️ study to\nlearn how. Download now ›\n\n## Recent articles\n\nProduct News\n\n###  Optimize Costs with dbt Cloud's Defer to Production Feature\n\nSteve Dowling  on January 11, 2024 January 11, 2024\n\nSteve Dowling\n\nHow to develop your data pipelines faster and save on storage and compute\ncosts using dbt’s Defer to Production feature.\n\nProduct News\n\n###  Build, centralize, and deliver consistent metrics with the dbt Semantic\nLayer\n\nRoxi Pourzand  on January 9, 2024 January 9, 2024\n\nRoxi Pourzand\n\nLearn more about the top 5 benefits and use cases for the new and improved dbt\nSemantic Layer\n\nOpinion\n\n###  How to become a revenue-driven marketer with dbt Cloud\n\nJakki Jakaj  on January 3, 2024 January 3, 2024\n\nJakki Jakaj\n\nIt’s important to show how your marketing campaigns impact the bottom line.\nFor that, you need good data. Here’s how we use dbt Cloud to...\n\nWe don't have any results for that search! Try again with new terms.\n\n## DAG! That wasn't supposed to happen...\n\n### Product\n\n  * What is dbt?\n  * Case Studies\n  * Integrations\n  * Pricing\n\n### For Developers\n\n  * Documentation\n  * Getting Started Guide\n  * Supported Data Platforms\n  * Developer Blog\n\n### Company\n\n  * About Us\n  * Diversity, Equity & Inclusion\n  * CareersWe're Hiring!\n  * Press\n\n### Resources\n\n  * Resource Hub\n  * dbt Learn\n  * Certification\n  * Blog\n\n### Community\n\n  * Join the Community\n  * Become a Contributor\n  * Open Source dbt Packages\n  * Community Forum\n\n### Support\n\n  * Contact Support\n  * Professional Services\n  * Find a Partner\n  * System Status\n\n### Read the Roundup\n\nThe internet's most useful articles on analytics engineering and its adjacent\necosystem.\n\nRead Now\n\n### Connect with Us\n\n__ GitHub __ LinkedIn __ Twitter __ YouTube\n\n  * © 2024 dbt Labs, Inc. All Rights Reserved. \n  * Terms of Use\n  * Privacy Policy\n  * Security\n  * Report a Problem\n  * Cookie Settings\n\n__\n\nHow to get value from the dbt Semantic Layer: Join our live webinar to learn\nhow your team can move faster with consistent, trusted data.\n\nGlobal-friendly sessions 🌎\n\nRSVP\n\n",
    "links": "[{\"link\": \"https://www.getdbt.com/\", \"text\": \"\"}, {\"link\": \"https://www.getdbt.com/product/what-is-dbt/\", \"text\": \"\"}, {\"link\": \"https://www.getdbt.com/product/what-is-dbt/\", \"text\": \"\\n                                What is dbt?\\n                              \"}, {\"link\": \"https://www.getdbt.com/product/what-is-dbt/\", \"text\": \"\\n                                    Learn the essentials of how dbt supports data practitioners\\n                                  \"}, {\"link\": \"https://www.getdbt.com/product/dbt-cloud/\", \"text\": \"\"}, {\"link\": \"https://www.getdbt.com/product/dbt-cloud/\", \"text\": \"\\n                                dbt Cloud\\n                              \"}, {\"link\": \"https://www.getdbt.com/product/dbt-cloud/\", \"text\": \"\\n                                    Explore dbt Cloud, a turnkey platform that’s built for scale\\n                                  \"}, {\"link\": \"https://www.getdbt.com/product/semantic-layer/\", \"text\": \"\\n                                Semantic Layer\\n                              \"}, {\"link\": \"https://www.getdbt.com/product/dbt-explorer/\", \"text\": \"\\n                                dbt Explorer\\n                              \"}, {\"link\": \"https://www.getdbt.com/security/\", \"text\": \"\\n                                Security\\n                              \"}, {\"link\": \"https://www.getdbt.com/product/integrations/\", \"text\": \"\\n                                Integrations\\n                              \"}, {\"link\": \"https://www.getdbt.com/partners/snowflake/\", \"text\": \"\\n                                Snowflake\\n                              \"}, {\"link\": \"https://www.getdbt.com/partners/databricks/\", \"text\": \"\\n                                Databricks\\n                              \"}, {\"link\": \"https://www.getdbt.com/partners/redshift/\", \"text\": \"\\n                                Redshift\\n                              \"}, {\"link\": \"https://www.getdbt.com/partners/starburst/\", \"text\": \"\\n                                Starburst\\n                              \"}, {\"link\": \"https://www.getdbt.com/product/data-modernization\", \"text\": \"\"}, {\"link\": \"https://www.getdbt.com/product/data-modernization\", \"text\": \"\\n                                Data Modernization\\n                              \"}, {\"link\": \"https://www.getdbt.com/product/data-modernization\", \"text\": \"\\n                                    Upgrade your strategy with the best modern practices for data\\n                                  \"}, {\"link\": \"https://www.getdbt.com/product/governance\", \"text\": \"\"}, {\"link\": \"https://www.getdbt.com/product/governance\", \"text\": \"\\n                                Governance\\n                              \"}, {\"link\": \"https://www.getdbt.com/product/governance\", \"text\": \"\\n                                    Support growing complexity while maintaining data quality\\n                                  \"}, {\"link\": \"https://www.getdbt.com/product/data-vault\", \"text\": \"\"}, {\"link\": \"https://www.getdbt.com/product/data-vault\", \"text\": \"\\n                                Data Vault\\n                              \"}, {\"link\": \"https://www.getdbt.com/product/data-vault\", \"text\": \"\\n                                    Use Data Vault with dbt Cloud to manage large-scale systems\\n                                  \"}, {\"link\": \"https://www.getdbt.com/product/dbt-mesh\", \"text\": \"\"}, {\"link\": \"https://www.getdbt.com/product/dbt-mesh\", \"text\": \"\\n                                dbt Mesh\\n                              \"}, {\"link\": \"https://www.getdbt.com/product/dbt-mesh\", \"text\": \"\\n                                    Implement data mesh best practices with the dbt Mesh feature set\\n                                  \"}, {\"link\": \"https://www.getdbt.com/product/cost-optimization\", \"text\": \"\"}, {\"link\": \"https://www.getdbt.com/product/cost-optimization\", \"text\": \"\\n                                Cost Optimization\\n                              \"}, {\"link\": \"https://www.getdbt.com/product/cost-optimization\", \"text\": \"\\n                                    Reduce data platform costs with smarter data processing\\n                                  \"}, {\"link\": \"https://www.getdbt.com/success-stories/mcdonald%E2%80%99s-nordics\", \"text\": \"\\n                                McDonald's Nordics\\n                              \"}, {\"link\": \"https://www.getdbt.com/success-stories/mcdonald%E2%80%99s-nordics\", \"text\": \"\\n                                    Establishes a standardized Data Vault structure with dbt Cloud.\\n                                  \"}, {\"link\": \"https://www.getdbt.com/success-stories/nasdaq/\", \"text\": \"\\n                                Nasdaq\\n                              \"}, {\"link\": \"https://www.getdbt.com/success-stories/nasdaq/\", \"text\": \"\\n                                    Creates new business opportunities through collaborative analytics.\\n                                  \"}, {\"link\": \"https://www.getdbt.com/success-stories/cond%C3%A9-nast/\", \"text\": \"\\n                                Condé Nast\\n                              \"}, {\"link\": \"https://www.getdbt.com/success-stories/cond%C3%A9-nast/\", \"text\": \"\\n                                    Serves up multimedia content on a global scale with dbt Cloud.\\n                                  \"}, {\"link\": \"https://www.getdbt.com/success-stories?filter=banking-%26-financial-services\", \"text\": \"\\n                                Financial Services\\n                              \"}, {\"link\": \"https://www.getdbt.com/success-stories?filter=healthcare\", \"text\": \"\\n                                Healthcare\\n                              \"}, {\"link\": \"https://www.getdbt.com/success-stories?filter=it-%26-software\", \"text\": \"\\n                                IT & Software\\n                              \"}, {\"link\": \"https://www.getdbt.com/success-stories?filter=oil-%26-gas\", \"text\": \"\\n                                Oil & Gas\\n                              \"}, {\"link\": \"https://www.getdbt.com/success-stories?filter=transportation-%26-logistics\", \"text\": \"\\n                                Transportation\\n                              \"}, {\"link\": \"https://www.getdbt.com/success-stories\", \"text\": \"\"}, {\"link\": \"https://www.getdbt.com/resources/dbt-cloud-demos-with-experts/\", \"text\": \"\"}, {\"link\": \"https://www.getdbt.com/resources/dbt-cloud-demos-with-experts/\", \"text\": \"\\n                                Weekly Demos\\n                              \"}, {\"link\": \"https://www.getdbt.com/resources/dbt-cloud-demos-with-experts/\", \"text\": \"\\n                                    Watch a weekly presentation on dbt and ask your questions live\\n                                  \"}, {\"link\": \"https://www.getdbt.com/resources/dbt-live-expert-series-july-na/\", \"text\": \"\"}, {\"link\": \"https://www.getdbt.com/resources/dbt-live-expert-series-july-na/\", \"text\": \"\\n                                Expert Series\\n                              \"}, {\"link\": \"https://www.getdbt.com/resources/dbt-live-expert-series-july-na/\", \"text\": \"\\n                                    Learn how dbt experts are solving challenging problems\\n                                  \"}, {\"link\": \"https://www.getdbt.com/resources/zero-to-dbt-workshop/\", \"text\": \"\"}, {\"link\": \"https://www.getdbt.com/resources/zero-to-dbt-workshop/\", \"text\": \"\\n                                Zero to dbt Workshop\\n                              \"}, {\"link\": \"https://www.getdbt.com/resources/zero-to-dbt-workshop/\", \"text\": \"\\n                                    Learn what dbt is and why it matters during this live, expert-led session\\n                                  \"}, {\"link\": \"https://www.getdbt.com/blog\", \"text\": \"\\n                                Blog\\n                              \"}, {\"link\": \"https://www.getdbt.com/resources\", \"text\": \"\\n                                Resource Hub\\n                              \"}, {\"link\": \"https://www.getdbt.com/dbt-learn\", \"text\": \"\\n                                Training\\n                              \"}, {\"link\": \"https://www.getdbt.com/dbt-certification\", \"text\": \"\\n                                Certification\\n                              \"}, {\"link\": \"https://www.getdbt.com/community\", \"text\": \"\\n                                Community\\n                              \"}, {\"link\": \"https://www.getdbt.com/webinars\", \"text\": \"\\n                                Webinars\\n                              \"}, {\"link\": \"https://www.getdbt.com/events\", \"text\": \"\\n                                Events & Meetups\\n                              \"}, {\"link\": \"https://www.getdbt.com/dbt-labs/about-us/\", \"text\": \"\"}, {\"link\": \"https://www.getdbt.com/dbt-labs/about-us/\", \"text\": \"\\n                                Who We Are\\n                              \"}, {\"link\": \"https://www.getdbt.com/dbt-labs/about-us/\", \"text\": \"\\n                                    Meet dbt Labs leadership team and read the latest news about dbt\\n                                  \"}, {\"link\": \"https://www.getdbt.com/dbt-labs/values/\", \"text\": \"\"}, {\"link\": \"https://www.getdbt.com/dbt-labs/values/\", \"text\": \"\\n                                Our Values\\n                              \"}, {\"link\": \"https://www.getdbt.com/dbt-labs/values/\", \"text\": \"\\n                                    Learn about the values that fuel dbt and shape our direction\\n                                  \"}, {\"link\": \"https://www.getdbt.com/dbt-labs/open-roles/\", \"text\": \"\"}, {\"link\": \"https://www.getdbt.com/dbt-labs/open-roles/\", \"text\": \"\\n                                Careers\\n                              \"}, {\"link\": \"https://www.getdbt.com/dbt-labs/open-roles/\", \"text\": \"\\n                                    Explore open roles and learn what it's like to work at dbt Labs\\n                                  \"}, {\"link\": \"https://www.getdbt.com/dbt-labs/services/\", \"text\": \"\\n                                Professional Services\\n                              \"}, {\"link\": \"https://www.getdbt.com/partners/\", \"text\": \"\\n                                Become a Partner\\n                              \"}, {\"link\": \"https://www.getdbt.com/pricing/\", \"text\": \"\\n            Pricing \\n          \"}, {\"link\": \"https://www.getdbt.com/contact/\", \"text\": \"\\n              Book a demo \\n            \"}, {\"link\": \"https://www.getdbt.com/signup/\", \"text\": \"\\n              Create a free account \\n            \"}, {\"link\": \"https://www.getdbt.com/contact/\", \"text\": \"\\n              Book a demo \\n            \"}, {\"link\": \"https://www.getdbt.com/signup/\", \"text\": \"\\n              Create a free account \\n            \"}, {\"link\": \"https://www.getdbt.com/blog/\", \"text\": \"Blog\"}, {\"link\": \"https://www.getdbt.com/author/kira-furuichi/\", \"text\": \"\"}, {\"link\": \"https://www.getdbt.com/author/kira-furuichi/\", \"text\": \"\\n          Kira Furuichi\\n        \"}, {\"link\": \"https://www.getdbt.com/signup\", \"text\": \"Create a free account\"}, {\"link\": \"https://www.getdbt.com/contact\", \"text\": \"\"}, {\"link\": \"https://www.getdbt.com/resources/study-forrester-tei/\", \"text\": \"Download now ›\"}, {\"link\": \"https://www.getdbt.com/blog/optimize-costs-with-dbt-cloud-defer-to-production-feature/\", \"text\": \"\"}, {\"link\": \"https://www.getdbt.com/category/product-news/\", \"text\": \"Product News\"}, {\"link\": \"https://www.getdbt.com/blog/optimize-costs-with-dbt-cloud-defer-to-production-feature/\", \"text\": \"\"}, {\"link\": \"https://www.getdbt.com/author/steve-dowling/\", \"text\": \"\\n          Steve Dowling\\n        \"}, {\"link\": \"https://www.getdbt.com/blog/optimize-costs-with-dbt-cloud-defer-to-production-feature/\", \"text\": \"\"}, {\"link\": \"https://www.getdbt.com/blog/build-centralize-and-deliver-consistent-metrics-with-the-dbt-semantic-layer/\", \"text\": \"\"}, {\"link\": \"https://www.getdbt.com/category/product-news/\", \"text\": \"Product News\"}, {\"link\": \"https://www.getdbt.com/blog/build-centralize-and-deliver-consistent-metrics-with-the-dbt-semantic-layer/\", \"text\": \"\"}, {\"link\": \"https://www.getdbt.com/author/roxi-pourzand/\", \"text\": \"\\n          Roxi Pourzand\\n        \"}, {\"link\": \"https://www.getdbt.com/blog/build-centralize-and-deliver-consistent-metrics-with-the-dbt-semantic-layer/\", \"text\": \"\"}, {\"link\": \"https://www.getdbt.com/blog/how-to-become-a-revenue-driven-marketer-with-dbt-cloud/\", \"text\": \"\"}, {\"link\": \"https://www.getdbt.com/category/opinion/\", \"text\": \"Opinion\"}, {\"link\": \"https://www.getdbt.com/blog/how-to-become-a-revenue-driven-marketer-with-dbt-cloud/\", \"text\": \"\"}, {\"link\": \"https://www.getdbt.com/author/jakki-jakaj/\", \"text\": \"\\n          Jakki Jakaj\\n        \"}, {\"link\": \"https://www.getdbt.com/blog/how-to-become-a-revenue-driven-marketer-with-dbt-cloud/\", \"text\": \"\"}, {\"link\": \"https://www.getdbt.com/product/what-is-dbt/\", \"text\": \"What is dbt?\"}, {\"link\": \"https://www.getdbt.com/success-stories/\", \"text\": \"Case Studies\"}, {\"link\": \"https://www.getdbt.com/product/integrations/\", \"text\": \"Integrations\"}, {\"link\": \"https://www.getdbt.com/pricing/\", \"text\": \"Pricing\"}, {\"link\": \"https://www.getdbt.com/dbt-labs/about-us/\", \"text\": \"About Us\"}, {\"link\": \"https://www.getdbt.com/dbt-labs/dei\", \"text\": \"Diversity, Equity & Inclusion\"}, {\"link\": \"https://www.getdbt.com/dbt-labs/open-roles/\", \"text\": \"Careers\"}, {\"link\": \"https://www.getdbt.com/press/\", \"text\": \"Press\"}, {\"link\": \"https://www.getdbt.com/resources/\", \"text\": \"Resource Hub\"}, {\"link\": \"https://www.getdbt.com/dbt-learn/\", \"text\": \"dbt Learn\"}, {\"link\": \"https://www.getdbt.com/dbt-certification/\", \"text\": \"Certification\"}, {\"link\": \"https://www.getdbt.com/blog/\", \"text\": \"Blog\"}, {\"link\": \"https://www.getdbt.com/community/join-the-community\", \"text\": \"Join the Community\"}, {\"link\": \"https://www.getdbt.com/dbt-labs/services/\", \"text\": \"Professional Services\"}, {\"link\": \"https://www.getdbt.com/cloud/terms/\", \"text\": \"Terms of Use\"}, {\"link\": \"https://www.getdbt.com/cloud/privacy-policy/\", \"text\": \"Privacy Policy\"}, {\"link\": \"https://www.getdbt.com/security/\", \"text\": \"Security\"}, {\"link\": \"https://www.getdbt.com/report-a-problem/\", \"text\": \"Report a Problem\"}]"
}