{
    "summary": "Informatica uses cookies to enhance your user experience, improve the quality\nof our website, and deliver advertising and other content tailored to your\ninterests. Some jurisdictions’ privacy laws offer their residents specific\nprivacy rights, which we respect as described in our privacy policy. To\nexercise rights that you may have related to cookies, including opt-out of\nsharing information with third parties for advertising purposes, select \"More\nInfo\" or see this \"Do Not Sell or Share My Personal Information\" link.\n\nAccept Decline All More Info\n\nSkip to main content\n\nFast-track your cloud transformation: Crawl today, run tomorrow for enhanced\nCX\n\nRegister now\n\nSearch\n\n  * Platform\n    * ####  Intelligent Data  \nManagement Cloud\n\n      * CLAIRE AI Engine – Intelligent Automation \n\n      * PowerCenter Cloud Modernization \n\n      * Platform Trust \n\n      * Modern Data Architecture Center \n\n      * Cloud Connectivity \n\n      * Pricing \n\n    * ####  Cloud Services\n\n      * Data Catalog \n\n      * Data Integration & Engineering \n\n      * API & App Integration \n\n      * Data Quality and Observability \n\n      * MDM & 360 Applications \n\n      * Governance & Privacy \n\n      * Data Marketplace \n\n    * Get fast, free, frictionless data integration\n\nTransform your data with Cloud Data Integration-Free.\n\nStart now __\n\n  * Solutions\n    * ####  By Department \n\n      * Office of the CDO \n\n      * IT \n\n      * Sales, Marketing & Digital Commerce \n\n      * ESG & Sustainability \n\n      * SAP Modernization \n\n    * ####  By Industry \n\n      * Higher Education \n\n      * Financial Services \n\n      * Energy and Utilities \n\n      * Government \n\n      * Healthcare \n\n      * Life Sciences \n\n      * Manufacturing \n\n      * Retail \n\n      * Telecommunications \n\n    * Customer Data Strategies for Dummies\n\nStep up your customer experience (CX) game with strategic customer data\nmanagement.\n\nGET Guide __\n\n  * Customers\n    * Customer Success Stories \n    * Customer Advocacy Program \n\nYamaha Revs Business in  \nthe Cloud\n\nLearn how __\n\n  * Partners\n    * Technology Partners \n    * Global Partners \n    * Regional Partners \n    * Become a Partner \n    * Partner Portal \n\n4 Steps to Cloud Modernization Success\n\nAchieve better business results with Microsoft and Informatica by your side.\n\nGET EBOOK __\n\n  * Learn\n    * Events \n    * Webinars \n    * Blogs \n    * Community \n    * Informatica Experience Lounge \n    * Resources \n    * Reference Articles \n\nDiscover MDM & Data Governance\n\nJoin us to explore the power of generative AI and trusted data at the MDM &\nData Governance Summit.\n\nREGISTER NOW __\n\n  * About Us\n\n    * About Us\n    * News\n    * Investor Relations\n    * Leadership\n    * Awards & Recognition\n    * Careers\n    * Diversity and Inclusion\n    * Sustainability\n\n  * Contact Sales\n\n    * Pricing\n    * Contact and Locations\n\n  * Support\n\n    * Certification & Training\n    * Customer Support\n    * Documentation\n    * Community\n    * Professional Services\n    * Success Offerings\n\n  * USA\n\n    * Argentina\n    * Australia\n    * Brazil\n    * Canada\n    * Chile\n    * China\n    * Columbia\n    * Costa Rica\n    * Ecuador\n    * France\n    * Germany\n\n    * Hong Kong\n    * India\n    * Italy\n    * Japan\n    * Korea\n    * Mexico\n    * Netherlands\n    * New Zealand\n    * Peru\n    * Portugal\n\n    * Southeast Asia\n    * Spain\n    * Sweden\n    * Switzerland (French)\n    * Switzerland (German)\n    * Taiwan\n    * United Kingdom\n    * United Arab Emirates\n    * United States\n    * More\n\n  * |  Log Out\n  * Login\n\n    * Informatica Cloud\n    * Informatica Community\n    * Partner Portal\n\n    * your informatica account\n    * Login __\n    * Sign Up __\n\n  * x\n\nstart for free\n\n# Data Transformation: Understanding the Basics\n\n×\n\n## What is Data Transformation?\n\nData transformation is the process of taking data that exists in one format or\nstate and converting it into a different format or state. Transformation is\nthe middle step in the extract, transform, and load (ETL) process — and the\nfinal step in the extract, load, transform (ELT) process.\n\n## Why Transform Your Data?\n\nData can serve many purposes. Data is transformed to suit your needs. When you\nconvert raw data from its source — from locations like customer transactions,\nfiles or databases — you make that data more usable. Once you’ve transformed\ndata, you can do other things with it. For example, you can use transformed\ndata in analytics to gain trustworthy and actionable business intelligence,\nverify data quality by enforcing specific date ranges or to simply run\nbusiness functions. You can even apply mathematical functions within data\ntransformation for machine learning or data science purposes.\n\n### Data Transformation helps application systems communicate in a common\nlanguage\n\nTo achieve the greatest value from your data, you need to normalize or\nstandardize it to be fit for your needs. Transformations can be **active** (it\nwill modify the number of rows) or **passive** (the number of rows is not\nchanged, data is only modified at the row level), and can include cleansing,\nconsolidation, code lookups and general calculations. Some common types of\ndata transformation include:\n\n### Aggregator\n\nThe Aggregator transformation performs aggregate calculations, such as\naverages and sums. The integration service performs aggregate calculations as\nit reads and stores data group and row data in an aggregate cache. The\naggregator transformation is an active transformation.\n\n### Data Masking\n\nYou use a Data Masking transformation to change sensitive production data to\nrealistic test data for non-production environments. The Data Masking\ntransformation modifies source data based on masking rules that you configure\nfor each column. This type of transformation lets you create masked data for\nsoftware development, analytics, testing, training and data mining. You can\nmaintain data relationships in the masked data and maintain referential\nintegrity between database tables. The Data Masking transformation is a\npassive transformation.\n\n### Expression\n\nUse the Expression transformation to calculate values in a single row. For\nexample, you might need to adjust employee salaries, concatenate first and\nlast names or convert strings to numbers. You can also use the Expression\ntransformation to test conditional statements before you pass the results to a\ntarget or other transformations. The Expression transformation is a passive\ntransformation.\n\n### Joiner\n\nUse the Joiner transformation to join source data from two related\nheterogeneous sources residing in different locations or file systems. You can\nalso join data from the same source. The Joiner transformation joins sources\nwith at least one matching column and uses a condition that matches one or\nmore pairs of columns between the two sources. The Joiner transformation is an\nactive transformation.\n\n### Filter\n\nUse the Filter transformation to filter out rows in a mapping. As an active\ntransformation, the Filter transformation may change the number of rows passed\nthrough it. The Filter transformation allows rows that meet the specified\nfilter condition to pass through. It drops rows that do not meet the\ncondition. You can filter data based on one or more conditions. The Filter\ntransformation is an active transformation.\n\nA filter condition returns TRUE or FALSE for each row that the Integration\nService evaluates, depending on whether a row meets the specified condition.\nFor each row that returns TRUE, the Integration Services passes through the\ntransformation. For each row that returns FALSE, the Integration Service drops\nand writes a message to the session log.\n\nThe following mapping passes the rows from a human resources table that\ncontains employee data through a Filter transformation. The filter allows rows\nthrough for employees that make salaries of $30,000 or higher.\n\n### Lookup\n\nUse a Lookup transformation in a mapping to look up data in a flat file,\nrelational table, view or synonym. You can import a lookup definition from any\nflat file or relational database. You can also create a lookup definition from\na source qualifier. You can use multiple Lookup transformations in a mapping.\nAlthough the Lookup transformation can be an active or passive transformation,\nit is mostly a passive transformation.\n\n### Rank\n\nYou can select only the top or bottom rank of data with a Rank transformation.\nThe Rank transformation is an active transformation. Use a Rank transformation\nto return the largest or smallest numeric value in a port or group. You can\nalso use a Rank transformation to return the strings at the top or the bottom\nof a session sort order. During the session, the Integration Service caches\ninput data until it can perform the rank calculations.\n\nThe Rank transformation differs from the transformation functions MAX and MIN,\nin that it lets you select a group of top or bottom values, not just one\nvalue. For example, use Rank to select the top 10 salespeople in a given\nterritory. Or, to generate a financial report, you might also use a Rank\ntransformation to identify the three departments with the lowest expenses in\nsalaries and overhead. While the SQL language provides many functions designed\nto handle groups of data, identifying top or bottom strata within a set of\nrows is not possible using standard SQL functions.\n\nYou connect all ports representing the same row set to the transformation.\nOnly the rows that fall within your configured rank measures pass through the\nRank transformation. You can also write expressions to transform data or\nperform calculations.\n\nThe following figure shows a mapping that passes employee data from a human\nresources table through a Rank transformation. The Rank transformation only\npasses the rows for the top 10 highest-paid employees to the next\ntransformation.\n\nAs an active transformation, the Rank transformation might change the number\nof rows passed through it. You might pass 100 rows of data to the Rank\ntransformation but choose to rank only the top 10 rows and pass them from the\nRank transformation to another transformation.\n\n### Router\n\nA Router transformation is similar to a Filter transformation because both\ntransformations allow you to use a condition to test data. A Filter\ntransformation tests data for one condition and drops the rows of data that do\nnot meet the condition. However, a Router transformation tests data for one or\nmore conditions and gives you the option to route rows of data that do not\nmeet any of the conditions to a default output group. The Router\ntransformation is an active transformation.\n\n### Union\n\nThe Union transformation is a multiple input group transformation that you use\nto merge data from multiple pipelines or pipeline branches into one pipeline\nbranch. It merges data from multiple sources like the UNION ALL SQL statement\nto combine the results from two or more SQL statements. Similar to the UNION\nALL statement, the Union transformation does not remove duplicate rows. The\nUnion transformation is an active transformation.\n\n### XML\n\nYou can add an XML Source Qualifier transformation to a mapping by dragging an\nXML source definition to the Cloud Mapping Designer workspace or by manually\ncreating one. When you add an XML source definition to a mapping, you need to\nconnect it to an XML Source Qualifier transformation. The XML Source Qualifier\ntransformation defines the data elements that the integration service reads\nwhen it executes a session. The XML Source Qualifier transformation is an\nactive transformation. You can also apply XML parser and XML generator\ntransformations.\n\n### Normalizer\n\nThe Normalizer transformation receives a row that contains multiple-occurring\ncolumns and returns a row for each instance of the multiple-occurring data.\nThe transformation processes multiple-occurring columns or multiple-occurring\ngroups of columns in each source row. The Normalizer transformation is an\nactive transformation.\n\n### H2R and R2H Transformation\n\nTo convert hierarchical data models to relational database you can use H2R\ntransformations and change relational data to hierarchical data apply R2H\ntransformation. H2R transformation is predominantly used to convert the XML\nJSON hierarchical input to relational outputs.\n\n## Where Do You Transform Your Data?\n\nThe answer depends on your priorities and resources. A dedicated cloud data\nintegration environment offers versatility, scalability and high availability.\nBut if your data is already in the database, your cloud data warehouse may be\nthe better option because then you can limit data movement.\n\nELT allows you to do the transformations using the compute resources of the\ncloud data warehouse – without having to move the data out of it.\n\nTransforming data after uploading it to modern cloud ecosystems is most\neffective for:\n\n  * Large enterprises with vast data volumes\n  * Companies that require real-time or frequent access to data\n  * Data scientists who rely on a single data warehouse, lake or lakehouse for business intelligence\n  * IT departments and data stewards interested in a low-maintenance solution\n\nThe ELT process improves data conversion and manipulation capabilities due to\nparallel load and data transformation functionality. This schema allows data\nto be accessed and queried in near real time.\n\nHowever, you might want to stick with ETL if your business collects data from\nmultiple source systems, or the data is in dissimilar formats or you have\ndirty data: duplicate, incomplete or inaccurate data will require data\nengineers to clean and format prior to data loading.\n\n## How Data Transformation Drives Digital Transformation\n\nMost people understand that better data will result in better business\noutcomes. The reverse is also true. A recent survey by Experian found that 95%\nof organizations believed poor data quality hurts their business.\n\nDigital transformation has put data at the center of every organization.\n\nThere’s been an explosion in data over the past few decades. Costs for storage\nand processing have gone down dramatically. On top of that, the regulatory\nfocus on data quality, policy and governance is higher than ever. For these\nreasons and more, enterprises have reshaped their business models to harness\nthe great potential of a core business asset: their data.\n\nSuccessful data transformation lets businesses extract all kinds of data, from\neverywhere. They can take data — from the cloud, mobile, streaming, IoT,\nsocial data, or others — and use it for the good of their business. Feed high-\nquality, transformed data into different applications to drive better decision\nmaking. Streamline operations with machine-to-machine communication free of\nbugs due to dirty data. In fact, the total reimagining of business in the\ndigital age revolves around data transformation. And what is that but digital\ntransformation?\n\nBy transforming your data, you can improve business processes across the\nentire enterprise. This allows you to:\n\n  * Deliver better customer experiences\n  * Make decisions that are better, faster and more accurate\n  * Streamline operational processes to drive cost savings\n  * Seize new revenue opportunities\n\n## 5 Key Benefits of Data Transformation\n\nThe scale, automation and trust required by today’s modern enterprise can only\nbe achieved with AI/ML capabilities. AI/ML requires that you normalize or\ntransform your data for one source of truth. Five key reasons organizations\ntransform their data:\n\n  1. Ensure the data that enters your enterprise is usable and manageable\n  2. Facilitate cost-efficient storage — no need to pay to store multiple versions of the same information\n  3. Improve ease of analysis for greater business intelligence and operational efficiency\n  4. Prioritize resources, especially critical in ERP and finance use cases\n  5. Limit compliance risk, ensuring data is managed according to your data governance rules\n\n## Data Transformation Success Stories\n\nMany organizations have achieved dramatic business success with their data\ntransformation efforts. Here are a few examples:\n\n  * Avis Budget Group optimized real-time data from a connected fleet of 650,000 vehicles. Using this vehicle data, they were able to enhance efficiency, reduce costs and drive more revenue.\n  * Equinix, a cloud-based IT services provider, had data duplicated and siloed throughout many data warehouses. After they cleaned and transformed that data, Equinix was able to expedite the rollout of new solutions for their customers. They were also able to prepare their data to deploy new AI and machine learning initiatives.\n  * Lagardère Travel Retail replaced a manual, hand-coded process with a new automated data transformation platform. As a result, this global leader in the travel retail industry can now quickly share data from many diverse systems.\n\n## Learn More About Data Transformation\n\nBusinesses, markets and technologies evolve and change over time. Your one\nconstant for a sustainable competitive advantage is data. That's why we help\nyou transform it from simply binary information to extraordinary innovation.\n\nWhether you’re driving next-gen analytics, delivering perfectly timed customer\nexperiences or ensuring governance and privacy, you can always know your data\nis accurate, your insights are actionable and your possibilities are\nlimitless.\n\nWant more information on data transformation and how Informatica can help?\nStart with these resources:\n\n  * eBook: Modernizing Data Management with Next-Gen iPaaS\n  * Data 4.0: The Soul of Digital Transformation\n  * Blog: Real-Time Data Drives Strategic Decisions\n  * Enterprise Management Associates Report: AI/ML-Powered Data Management Enables Digital Transformation\n  * Free Data Integration\n\nUnited States\n\n  * Argentina\n  * Australia\n  * Brazil\n  * Canada\n  * Chile\n  * China\n  * Columbia\n  * Costa Rica\n  * Ecuador\n  * France\n  * Germany\n  * Hong Kong\n  * India\n  * Italy\n  * Japan\n  * Korea\n  * Mexico\n  * Netherlands\n  * New Zealand\n  * Peru\n  * Portugal\n  * Southeast Asia\n  * Spain\n  * Sweden\n  * Switzerland (French)\n  * Switzerland (German)\n  * Taiwan\n  * United Kingdom\n  * United Arab Emirates\n  * United States\n\nCloud Platform\n\nIntelligent Data Management Cloud Data Integration & Engineering API & App\nIntegration Customer 360 Data Catalog  Governance & Privacy Data Quality and\nObservability MDM & 360 Applications CLAIRE AI Engine – Intelligent Automation\nPricing\n\nGet Started\n\nFree Cloud Data Integration Free Data Loader Live Demos Request Personal Demo\nContact Sales Data Warehouse Trial API Lifecycle Management\n\nResources\n\nEvents Blog Customer Success Stories Community Documentation Certification &\nTraining Cloud Data Glossary\n\nLearn Data Integration\n\nETL Cloud Data Integration What is iPaaS? Data Warehouse Data Governance\nFramework What is Data Quality? Customer 360 Application Integration\n\nCompany\n\nAbout Us  Careers  News  Investor Relations  Awards & Recognition  Contact\nSales  Customer Support\n\nSearch\n\nUnited States\n\n  * Argentina\n  * Australia\n  * Brazil\n  * Canada\n  * Chile\n  * China\n  * Columbia\n  * Costa Rica\n  * Ecuador\n  * France\n  * Germany\n  * Hong Kong\n  * India\n  * Italy\n  * Japan\n  * Korea\n  * Mexico\n  * Netherlands\n  * New Zealand\n  * Peru\n  * Portugal\n  * Southeast Asia\n  * Spain\n  * Sweden\n  * Switzerland (French)\n  * Switzerland (German)\n  * Taiwan\n  * United Kingdom\n  * United Arab Emirates\n  * United States\n\n© 2024 Informatica Inc.\n\nLegal  Privacy Policy  COVID-19 Statement  Do not sell or share my personal\ninformation\n\n© 2024 Informatica Inc.\n\n",
    "links": "[{\"link\": \"https://www.informatica.com/lp/ema-ai-powered-data-management-enables-digital-transformation_3559.html\", \"text\": \"AI/ML-Powered Data Management Enables Digital Transformation\"}]",
    "priceAndPlans": "Informatica uses cookies to enhance your user experience, improve the quality\nof our website, and deliver advertising and other content tailored to your\ninterests. Some jurisdictions’ privacy laws offer their residents specific\nprivacy rights, which we respect as described in our privacy policy. To\nexercise rights that you may have related to cookies, including opt-out of\nsharing information with third parties for advertising purposes, select \"More\nInfo\" or see this \"Do Not Sell or Share My Personal Information\" link.\n\nAccept Decline All More Info\n\nSkip to main content\n\nFast-track your cloud transformation: Crawl today, run tomorrow for enhanced\nCX\n\nRegister now\n\nSearch\n\n  * Platform\n    * ####  Intelligent Data  \nManagement Cloud\n\n      * CLAIRE AI Engine – Intelligent Automation \n\n      * PowerCenter Cloud Modernization \n\n      * Platform Trust \n\n      * Modern Data Architecture Center \n\n      * Cloud Connectivity \n\n      * Pricing \n\n    * ####  Cloud Services\n\n      * Data Catalog \n\n      * Data Integration & Engineering \n\n      * API & App Integration \n\n      * Data Quality and Observability \n\n      * MDM & 360 Applications \n\n      * Governance & Privacy \n\n      * Data Marketplace \n\n    * Get fast, free, frictionless data integration\n\nTransform your data with Cloud Data Integration-Free.\n\nStart now __\n\n  * Solutions\n    * ####  By Department \n\n      * Office of the CDO \n\n      * IT \n\n      * Sales, Marketing & Digital Commerce \n\n      * ESG & Sustainability \n\n      * SAP Modernization \n\n    * ####  By Industry \n\n      * Higher Education \n\n      * Financial Services \n\n      * Energy and Utilities \n\n      * Government \n\n      * Healthcare \n\n      * Life Sciences \n\n      * Manufacturing \n\n      * Retail \n\n      * Telecommunications \n\n    * Customer Data Strategies for Dummies\n\nStep up your customer experience (CX) game with strategic customer data\nmanagement.\n\nGET Guide __\n\n  * Customers\n    * Customer Success Stories \n    * Customer Advocacy Program \n\nYamaha Revs Business in  \nthe Cloud\n\nLearn how __\n\n  * Partners\n    * Technology Partners \n    * Global Partners \n    * Regional Partners \n    * Become a Partner \n    * Partner Portal \n\n4 Steps to Cloud Modernization Success\n\nAchieve better business results with Microsoft and Informatica by your side.\n\nGET EBOOK __\n\n  * Learn\n    * Events \n    * Webinars \n    * Blogs \n    * Community \n    * Informatica Experience Lounge \n    * Resources \n    * Reference Articles \n\nDiscover MDM & Data Governance\n\nJoin us to explore the power of generative AI and trusted data at the MDM &\nData Governance Summit.\n\nREGISTER NOW __\n\n  * About Us\n\n    * About Us\n    * News\n    * Investor Relations\n    * Leadership\n    * Awards & Recognition\n    * Careers\n    * Diversity and Inclusion\n    * Sustainability\n\n  * Contact Sales\n\n    * Pricing\n    * Contact and Locations\n\n  * Support\n\n    * Certification & Training\n    * Customer Support\n    * Documentation\n    * Community\n    * Professional Services\n    * Success Offerings\n\n  * USA\n\n    * Argentina\n    * Australia\n    * Brazil\n    * Canada\n    * Chile\n    * China\n    * Columbia\n    * Costa Rica\n    * Ecuador\n    * France\n    * Germany\n\n    * Hong Kong\n    * India\n    * Italy\n    * Japan\n    * Korea\n    * Mexico\n    * Netherlands\n    * New Zealand\n    * Peru\n    * Portugal\n\n    * Southeast Asia\n    * Spain\n    * Sweden\n    * Switzerland (French)\n    * Switzerland (German)\n    * Taiwan\n    * United Kingdom\n    * United Arab Emirates\n    * United States\n    * More\n\n  * |  Log Out\n  * Login\n\n    * Informatica Cloud\n    * Informatica Community\n    * Partner Portal\n\n    * your informatica account\n    * Login __\n    * Sign Up __\n\n  * x\n\nstart for free\n\nHome → Intelligent Data Management Cloud → Pricing\n\n# Intelligent Data Management Cloud consumption-based pricing\n\nAccelerate cloud data management with simple, flexible Informatica Processing\nUnit (IPU) pricing.\n\nget a quote\n\n## Simpler pricing, so you can focus on your business\n\nWith IPU pricing, you buy capacity on an IPU and/or Flex IPU consumption model\nto use across a range of our industry-leading cloud services. You’re free to\ninnovate and rapidly onboard new capabilities—without worrying about\nconnectivity or cost.\n\n#### **Get access to all Intelligent Cloud Services and dynamically scale\nusage up or down to fit your needs.**\n\n## How IPU pricing helps your cloud modernization\n\nOptimize your cloud costs more easily\n\nManage costs with simple pricing and transparent usage tracking. Create a\nFinOps culture with cost insights and departmental chargebacks.\n\nMeet any cloud data management demand\n\nUse any capability you need across a range of cloud services with\ninterchangeable IPUs—from mass ingestion to data quality to application\nintegration—and more.\n\nGain the agility to grow and innovate\n\nStart small and grow as your data management needs change. Try out new\nservices to quickly adapt to changes while saving on costs as your consumption\nincreases.\n\nNote: IPU pricing excludes master data management (MDM) capabilities; volume-\ntier progressive pricing is available for MDM\n\n## Your essential pricing resources\n\nBrochure\n\nControl Cloud Spending With Consumption-Based Pricing\n\nDownload now\n\nAnalyst Report\n\nThe Data Strategy Report: What CDOs Need to Know\n\nRead now\n\neBook\n\nHow IT and Data Leaders Can Deliver Accurate Insights\n\nDownload now\n\nAnalyst Report\n\nThe Current State of Modern Data Management\n\nlearn more\n\nHow does IPU pricing work?\n\nPre-paid subscription\n\nAn IPU is a unit of capacity. You buy capacity in advance using an IPU and/or\nFlex IPU consumption model and subscribe to receive that capacity.\n\nVolume-based discounts\n\nYou can achieve significant cost savings as your consumption increases.\n\nAccess to a range of cloud services\n\nYou’re free to choose whatever integration and quality services you need.\nScale usage of any service up or down as long as you stay within your\nsubscription capacity.\n\nHow do I know how much I need?\n\nYou can leverage the usage dashboard to track your usage and plan ahead, or\nreach out to us to estimate your initial needs.\n\n## Get started with IPU pricing\n\nTalk to an expert today.\n\nchat now\n\nUnited States\n\n  * Argentina\n  * Australia\n  * Brazil\n  * Canada\n  * Chile\n  * China\n  * Columbia\n  * Costa Rica\n  * Ecuador\n  * France\n  * Germany\n  * Hong Kong\n  * India\n  * Italy\n  * Japan\n  * Korea\n  * Mexico\n  * Netherlands\n  * New Zealand\n  * Peru\n  * Portugal\n  * Southeast Asia\n  * Spain\n  * Sweden\n  * Switzerland (French)\n  * Switzerland (German)\n  * Taiwan\n  * United Kingdom\n  * United Arab Emirates\n  * United States\n\nCloud Platform\n\nIntelligent Data Management Cloud Data Integration & Engineering API & App\nIntegration Customer 360 Data Catalog  Governance & Privacy Data Quality and\nObservability MDM & 360 Applications CLAIRE AI Engine – Intelligent Automation\nPricing\n\nGet Started\n\nFree Cloud Data Integration Free Data Loader Live Demos Request Personal Demo\nContact Sales Data Warehouse Trial API Lifecycle Management\n\nResources\n\nEvents Blog Customer Success Stories Community Documentation Certification &\nTraining Cloud Data Glossary\n\nLearn Data Integration\n\nETL Cloud Data Integration What is iPaaS? Data Warehouse Data Governance\nFramework What is Data Quality? Customer 360 Application Integration\n\nCompany\n\nAbout Us  Careers  News  Investor Relations  Awards & Recognition  Contact\nSales  Customer Support\n\nSearch\n\nUnited States\n\n  * Argentina\n  * Australia\n  * Brazil\n  * Canada\n  * Chile\n  * China\n  * Columbia\n  * Costa Rica\n  * Ecuador\n  * France\n  * Germany\n  * Hong Kong\n  * India\n  * Italy\n  * Japan\n  * Korea\n  * Mexico\n  * Netherlands\n  * New Zealand\n  * Peru\n  * Portugal\n  * Southeast Asia\n  * Spain\n  * Sweden\n  * Switzerland (French)\n  * Switzerland (German)\n  * Taiwan\n  * United Kingdom\n  * United Arab Emirates\n  * United States\n\n© 2024 Informatica Inc.\n\nLegal  Privacy Policy  COVID-19 Statement  Do not sell or share my personal\ninformation\n\n© 2024 Informatica Inc.\n\n"
}