{
    "summary": "MENU\n\n#\n\n# Cellular Agriculture for Production of Cell-Based Seafood\n\nRazieh Farzad\n\n*This article intends to give basic information about the cell-based seafood production system to consumers and seafood producers.\n\n## Introduction\n\nSeafood, including fish, crustaceans, and mollusks, supports 17% of the global\ndemand for animal protein (Costello et al. 2020). Fish demand is projected to\nincrease to 140 metric tons by 2050 due to the anticipated increase in the\nhuman population and income (Costello et al. 2020). With the current state of\naquaculture and wild-capture fisheries’ seafood productions, there is going to\nbe a substantial gap between the supply and demand of seafood in the near\nfuture (World Bank 2014). Additionally, the COVID-19 pandemic highlighted the\nthreats to the United States’ and global food system security and the\nimportance of sustainable and resilient animal-protein production systems\n(Éliás et al. 2021; Mardones et al. 2020). This shows an urgent need for a\nwhole new method for seafood production to build a resilient, productive, and\nflexible enterprise in the face of current and future challenges. While\naquaculture and wild-capture fisheries continue to support sustainable seafood\nproduction, producing seafood from fish cell and tissue cultures, referred to\nas cellular agriculture (USDA 2020), is an emerging approach that can help\nensure food security in the context of the rising global population, climate\nchange, and competition for natural resources.\n\n## Cell-Based Seafood Production Method\n\nA cell-based seafood production system consists of (1) an appropriate cell\ntype from the tissue of interest; (2) cell culture media to provide nutrients\nfor the growth of the cells; (3) a bioreactor to provide the closed\nenvironment to support the development of the cells at a large scale; and (4)\na three-dimensional edible tissue scaffold designed to provide structure for\ncell growth and maturation consistent with the shape of a seafood product that\nis indistinguishable from its conventional counterpart (Robio et al. 2019).\nThe first step of cell-based seafood production is collecting the cell samples\nfrom animal tissue, typically done using biopsy without killing or harming the\nanimal. The harvested cells will then be used to prepare cell banks that can\nbe used later for food production. The next step is taking a small number of\ncells from the cell bank and placing them in bioreactors, which support growth\nand cellular multiplication by supplying appropriate nutrients and other\nfactors provided by the cell culture media. After the cells have multiplied\nmany times over into billions or trillions of cells, additional elements such\nas tissue scaffolds will be added to the bioreactor to provide surfaces for\ncell attachment, as well as to enable the cells to differentiate into various\ncell types and assume characteristics of muscle, fat, or connective tissue\ncells. Then, the cellular material can be harvested from the controlled\nenvironment and prepared using conventional food processing and packaging\nmethods (FDA 2020b). Other than a muscle-protein production system for\ngoldfish developed in 2002 with NASA funding (Benjaminson et al. 2002), no\nexamples of cell-based seafood products have been published. Most of the\nresearch and development is currently happening in the private sector, which\nis unwilling to share the information with the public.\n\n## Challenges and Opportunities for the Cell-Based Seafood Industry\n\nThe current method for cell-based meat production is based on medical tissue\nengineering using advances in bioengineering and cell biology techniques (Ben-\nArye et al. 2019) that have been primarilyconducted within mammalian systems.\nFish tissues in vitro have not yet been adequately investigated (Robio et al.\n2019). Lack of a proper cell source and a cell culture media that has all the\nrequired nutrients and ingredients (i.e., growth factors) for the growth of\nthe cells are the main challenges for cell-based seafood production (Zhang et\nal. 2020). Muscle contains a mixture of cell types with different\nproliferative and differentiative capacities. Therefore, identifying which\ncells to use for culture, proportions of cell types for co-culture, and\nreprogramming of cells so that they can proliferate and differentiate into the\ndesired cell types are the primary technical challenges (Reiss et al. 2021).\nCell culture has been traditionally dependent on Fetal Bovine Serum (FBS), a\ncostly, unsustainable, and inconsistent component in media. The production of\ncheap, serum-free media remains one of the most pressing limitations for the\nfield (Specht 2020). Also, using additives such as antibiotics in cell culture\ncould cause regulatory and human-health-related concerns. Scale production of\ncultivated seafood without the need for antibiotics could be challenging and\nrequires a very specialized workforce.\n\nAdditionally, the production rates using existing biomanufacturing tools are\ntoo slow, expensive, and insufficient for large-scale manufacturing to produce\nhundreds of millions of meat products (Post et al. 2020; Zhang et al. 2020).\nThe meat harvest process affects the characteristics of muscle from animals,\nimpacting sensory perceptions of the meat products, such as texture and\nflavor. Therefore, engineering seafood product constructs that mimic sensory\nperceptions beyond ground products while simultaneously providing better\nnutrition are critical technical challenges and knowledge gaps (Post et al.\n2020). There are no data on the production cost of cell-based seafood, but the\ncurrent price of cell-based ground beef is $180–$220 per kilogram ($81–$100\nper pound) compared to its traditional counterpart averaging less than $9 per\nkilogram ($4 per pound). Culture media comprises 55%–95% of the production\ncost (Specht 2020; Post et al. 2020). The construction of more complex tissue\nis expected to cost 5–10 times more than cell-cultured ground products per\nkilogram (Specht 2020).\n\nIn addition to the technical challenges, integrating social sciences to\nunderstand stakeholder perception is particularly important for a successful\nfood production system that appeals to consumers. One of the main challenges\nfor the industry is deciphering accurate information that can affect consumer\nand producer acceptance. Shifting cultural and societal ethics toward animal\nwelfare when an equivalent alternative exists will undoubtedly impact all\nsectors of traditional animal agriculture. Additionally, redesigning education\nand training from high school through undergraduate, graduate, and current\nworkers is essential for workforce development in a cellular agriculture\nindustry that currently does not exist.\n\nDespite these challenges, cell-based seafood products have the most prominent\npotential to reach the market at a reasonable price. Modern aquaculture\ntechniques such as genetic modification for seafood production in closed\naquaculture systems and studies focused on fish muscle physiology with\nimplications for aquaculture lay the essential groundwork for cell-based\nseafood production research and development (Robio et al. 2019). Fish cell and\ntissue culture physiological properties, including hypoxia (low oxygen)\ntolerance, high buffering capacity (being less sensitive to pH fluctuations),\nand low-temperature growth conditions, make marine cell culture an attractive\nopportunity for scale production of cell-based seafood (Robio et al. 2019). In\nmammals and birds, the number of muscle cells (fibers) is set at birth; after\nthat, muscle growth is dependent on increases in cell size (length and\ndiameter) (Rossi et al. 2014). On the other hand, muscle growth in fish after\nhatching is due to the combined effects of an increase in muscle fiber\nformation and increase in the size of existing fibers. Therefore, it continues\nthroughout the fish life (Kiessling et al. 2006). A similar observation has\nbeen found in fish muscle cells grown in culture media, which shows the\nengineering advantage of the fish cells over mammalian and avian cell-based\nmeat production (Potter et al. 2020). Additionally, seafood is considered an\nexpensive, high-value food commodity, and there are some species of fish, such\nas tuna, that cannot be produced in a land-based aquaculture facility for\ntheir whole life cycle. This makes seafood a great candidate with a high\npotential for cellular agriculture techniques leading to novel food products\non the market at a competitive price.\n\n## Cell-Based Seafood Products Regulations and Labeling\n\nThe Food and Drug Administration (FDA) and the United States Department of\nAgriculture’s Food Safety and Inspection Services (USDA-FSIS) agreed in 2019\nto establish a joint regulatory framework for cell-based meat. The FDA would\noversee cell collection, cell banks, and cell growth and differentiation,\nwhile the USDA would oversee production and labeling of meat developed from\ncells of livestock and poultry. The FDA, however, has the sole oversight of\ncell-based seafood (except catfish species) and has called for public comment\non how to label it (FDA 2020a). Based on the agreement, FDA regulatory\noversight includes a premarket consultation process and inspection of the\nrecords and facilities to ensure that the cover entities comply with\nrequirements such as facility registration and the FDA’s Current Good\nManufacturing Practices, Hazard Analysis Critical Control Point, and\nPreventive Controls requirements. Imports of foods comprising or containing\ncell-based fish or seafood cells must meet the same legal requirements as\ndomestically produced foods (FDA 2019).\n\n## Conclusion\n\nThe nascent cellular agriculture technology has been proposed as a solution to\ncomplement sustainable seafood production through aquaculture and capture\nfisheries and to supply enough seafood for the growing demand in the future.\nHowever, there are still many technical and societal challenges that the\ncellular agriculture industry needs to overcome before cell-based seafood\nproducts enter the US marketplace.\n\n## References\n\nBen-Arye, T., and S. Levenberg. 2019. “Tissue Engineering for Clean Meat\nProduction.”  _Frontiers in Sustainable Food Systems_  3:46.\nhttps://doi.org/10.3389/fsufs.2019.00046\n\nBenjaminson, M. A., J. A. Gilchriest, and M.Lorenz. 2002. “In Vitro Edible\nMuscle Protein Production System (MPPS): Stage 1, Fish.”  _Acta Astronautica_\n51 (12): 879–889. https://doi.org/10.1016/S0094-5765(02)00033-4\n\nChoi, K.-H., J. W. Yoon, M. Kim, H. J. Lee, J. Jeong, M. Ryu, C. Jo, and C.-K.\nLee. 2021. “Muscle Stem Cell Isolation and In Vitro Culture for Meat\nProduction: A Methodological Review.”  _Comprehensive Reviews in Food Science\nand Food Safety_  20 (1): 429–457. https://doi.org/10.1111/1541-4337.12661\n\nCostello, C., L. Cao, S. Gelcich, M. Á. Cisneros-Mata, C. M. Free, H. E.\nFroehlich, C. D. Golden, et al. 2020. “The Future of Food from the Sea.”\n_Nature_  588 (7836): 95–100. https://doi.org/10.1038/s41586-020-2616-y\n\nÉliás, B. A., and A. Jámbor. 2021. “Food Security and COVID-19: A Systematic\nReview of the First-Year Experience.”  _Sustainability_  13 (9): 5294.\nhttps://doi.org/10.3390/su13095294\n\nFDA. 2019. “Formal Agreement between FDA and USDA Regarding Oversight of Human\nFood Produced Using Animal Cell Technology Derived from Cell Lines of USDA-\namenable Species.” Retrieved July 9, 2021. https://www.fda.gov/food/domestic-\ninteragency-agreements-food/formal-agreement-between-fda-and-usda-regarding-\noversight-human-food-produced-using-animal-cell\n\nFDA. 2020a. “FDA Seeks Input on Labeling of Food Made with Cultured Seafood\nCells.” Retrieved July 9, 2021. https://www.fda.gov/food/cfsan-constituent-\nupdates/fda-seeks-input-labeling-food-made-cultured-seafood-cells\n\nFDA. 2020b. “Food Made with Cultured Animal Cells.” Retrieved July 9, 2021.\nhttps://www.fda.gov/food/food-ingredients-packaging/food-made-cultured-animal-\ncells\n\nKiessling, A., K. Ruohonen, and M. Bjørnevik. 2006. “Muscle Fiber Growth and\nQuality in Fish.” _Archives of Animal Breeding_ 49 (Special Issue): 137–146.\nhttp://hdl.handle.net/11250/297126\n\nMardones, F. O., K. M. Rich, L. A. Boden, A. I. Moreno-Switt, M. L. Caipo, N.\nZimin-Veselkoff, A. M. Alateeqi, and I. Baltenweck. 2020. “The COVID-19\nPandemic and Global Food Security.”  _Frontiers in Veterinary Science_\n7:578508. https://doi.org/10.3389/fvets.2020.578508\n\nPost, M. J., S. Levenberg, D. L. Kaplan, N. Genovese, J. Fu, C. J. Bryant, N.\nNegowetti, K. Verzijden, and P. Moutsatsou. 2020. “Scientific, Sustainability\nand Regulatory Challenges of Cultured Meat.”  _Nature Food_  1 (7): 403–415.\nhttps://doi.org/10.1038/s43016-020-0112-z\n\nPotter, G., A. S. T. Smith, N. T. K. Vo, J. Muster, W. Weston, A. Bertero, L.\nMaves, D. L. Mack, and A. Rostain. 2020. “A More Open Approach Is Needed to\nDevelop Cell-Based Fish Technology: It Starts with Zebrafish.”  _One Earth_  3\n(1): 54–64. https://doi.org/10.1016/j.oneear.2020.06.005\n\nReiss, J., S. Robertson, and M. Suzuki. 2021. “Cell Sources for Cultivated\nMeat: Applications and Considerations throughout the Production Workflow.”\n_International Journal of Molecular Sciences_  22 (14): 7513.\nhttps://doi.org/10.3390/ijms22147513\n\nRossi, G., and G. Messina. 2014. “Comparative Myogenesis in Teleosts and\nMammals.”  _Cellular and Molecular Life Sciences_  71 (16): 3081–3099.\nhttps://doi.org/10.1007/s00018-014-1604-5\n\nRubio, N., I. Datar, D. Stachura, D. Kaplan, and K. Krueger. 2019. “Cell-Based\nFish: A Novel Approach to Seafood Production and an Opportunity for Cellular\nAgriculture.”  _Frontiers in Sustainable Food Systems_  3:43.\nhttps://doi.org/10.3389/fsufs.2019.00043\n\nSpecht, L. 2020. _An Analysis of Culture Medium Costs and Production Volumes\nfor Cultivated Meat_. The Good Food Institute. https://gfi.org/wp-\ncontent/uploads/2021/01/clean-meat-production-volume-and-medium-cost.pdf\n\nThe World Bank. 2014. “Raising More Fish to Meet Rising Demand.” Retrieved\nJuly 8, 2021. https://www.worldbank.org/en/news/feature/2014/02/05/raising-\nmore-fish-to-meet-rising-demand\n\nZhang, G., X. Zhao, X. Li, G. Du, J. Zhou, and J. Chen. 2020. “Challenges and\nPossibilities for Bio-manufacturing Cultured Meat.”  _Trends in Food Science &\nTechnology_ 97:443–450. https://doi.org/10.1016/j.tifs.2020.01.026\n\nDOWNLOAD\n\n### Publication #FSHN21-2\n\nRelease Date:September 30th, 2021\n\n#### Related Experts\n\n#### Farzad, Razieh\n\nSpecialist/SSA/RSA\n\nUniversity of Florida\n\n#### Related Units\n\n#### Food Science and Human Nutrition\n\n#### Related Topics\n\n#### Cellular Agriculture\n\n#### Aquaculture\n\n#### Seafood Industry\n\n  * DOI: doi.org/10.32473/edis-fs432-2021\n  * Critical Issue: Agricultural and Food Systems\n\n### About this Publication\n\nThis publication is FSHN21-2, one of a series of the Food Science and Human\nNutrition Department, UF/IFAS Extension. Original publication date September\n2021. Visit the EDIS website at https://edis.ifas.ufl.edu/ for the currently\nsupported version of this publication.\n\n### About the Authors\n\nRazieh Farzad, assistant professor and seafood safety Extension specialist,\nFood Science and Human Nutrition Department and Florida Sea Grant, UF/IFAS\nExtension, Gainesville, FL 32611.\n\n### Contacts\n\n  * Razieh Farzad\n\n## Find publications by topic area\n\nAgriculture\n\nNatural Resources\n\n4-H & Youth Development\n\nLawn & Garden\n\nFamily Resources\n\nIndexes & Collections\n\n#### INFORMATION\n\n  * EDIS Blog\n  * Bookstore\n  * Accessibility\n  * Copyright\n\n#### LAND GRANT MISSION\n\n  * UF/IFAS Locations\n  * UF/IFAS\n  * UF/IFAS CALS\n  * Research\n  * Extension\n\n#### FOR AUTHORS\n\n  * Information for Authors\n  * EDIS Submissions\n  * ICS Editorial Services\n  * About EDIS Extension Publications\n\n‌\n\n  * Site Feedback|\n  * © 2023 |\n  * UF/IFAS Electronic Data Information System|\n  * Sitemap|\n  * University of Florida, Institute of Food and Agricultural Sciences  \n\n  * P.O. Box 110810 Gainesville, FL 32611|\n  * (352) 392-1761|\n  * Analytics (Google Privacy Policy)|\n  * Policies: Disability Services|UF Privacy\n  *   \nLast Modified: 8/19/2021\n\n",
    "links": "[{\"link\": \"https://edis.ifas.ufl.edu/\", \"text\": \"\"}, {\"link\": \"https://edis.ifas.ufl.edu/experts/rfarzad\", \"text\": \"Farzad, Razieh\"}, {\"link\": \"https://edis.ifas.ufl.edu/units/food_science_and_human_nutrition\", \"text\": \"Food Science and Human Nutrition\"}, {\"link\": \"https://edis.ifas.ufl.edu/topics/cellular-agriculture?audience=academic,commercial\", \"text\": \"Cellular Agriculture\"}, {\"link\": \"https://edis.ifas.ufl.edu/topics/aquaculture?audience=academic,commercial\", \"text\": \"Aquaculture\"}, {\"link\": \"https://edis.ifas.ufl.edu/topics/restaurant_industry?association=Seafood%20Industry&audience=academic,commercial#SEAFOOD_INDUSTRY\", \"text\": \"Seafood Industry\"}, {\"link\": \"https://edis.ifas.ufl.edu/topics/agriculture\", \"text\": \"Agriculture\"}, {\"link\": \"https://edis.ifas.ufl.edu/topics/environment\", \"text\": \"Natural Resources\"}, {\"link\": \"https://edis.ifas.ufl.edu/topics/4h_and_youth\", \"text\": \"4-H & Youth Development\"}, {\"link\": \"https://edis.ifas.ufl.edu/topics/care\", \"text\": \"Lawn & Garden\"}, {\"link\": \"https://edis.ifas.ufl.edu/topics/consumers\", \"text\": \"Family Resources\"}, {\"link\": \"https://edis.ifas.ufl.edu/indexes\", \"text\": \"Indexes & Collections\"}, {\"link\": \"https://edis.ifas.ufl.edu/accessibility\", \"text\": \"Accessibility\"}, {\"link\": \"https://edis.ifas.ufl.edu/copyright\", \"text\": \"Copyright\"}, {\"link\": \"https://edis.ifas.ufl.edu/sitemap\", \"text\": \"Sitemap\"}]"
}