{
    "summary": "Loading [MathJax]/jax/output/HTML-CSS/config.js\n\n## Your privacy, your choice\n\nWe use essential cookies to make sure the site can function. We also use\noptional cookies for advertising, personalisation of content, usage analysis,\nand social media.\n\nBy accepting optional cookies, you consent to the processing of your personal\ndata - including transfers to third parties. Some third parties are outside of\nthe European Economic Area, with varying standards of data protection.\n\nSee our privacy policy for more information on the use of your personal data.\n\nManage preferences for further information and to change your choices.\n\nAccept all cookies\n\nSkip to main content\n\nLog in\n\nMenu\n\nFind a journal Publish with us Track your research\n\nSearch\n\nCart\n\n## search\n\nSearch by keyword or author\n\nSearch\n\n## Navigation\n\n  * Find a journal\n  * Publish with us\n  * Track your research\n\n  1. Home\n  2. In Vitro Cellular & Developmental Biology - Animal\n  3. Article\n\n# A continuous myofibroblast precursor cell line from the tail muscle of\nAustralasian snapper ( _Chrysophrys auratus_ ) that responds to transforming\ngrowth factor beta and fibroblast growth factor\n\n  * Open access\n  * Published: 15 November 2022\n\n  * Volume 58, pages 922–935, (2022) \n  * Cite this article\n\nDownload PDF\n\nYou have full access to this open access article\n\nIn Vitro Cellular & Developmental Biology - Animal Aims and scope  Submit\nmanuscript\n\nA continuous myofibroblast precursor cell line from the tail muscle of\nAustralasian snapper ( _Chrysophrys auratus_ ) that responds to transforming\ngrowth factor beta and fibroblast growth factor\n\nDownload PDF\n\n  * Gavril L. W. Chong  ORCID: orcid.org/0000-0002-8974-07041, \n  * Björn Böhmert1, \n  * Lucy E. J. Lee  ORCID: orcid.org/0000-0003-1796-05882, \n  * Niels C. Bols  ORCID: orcid.org/0000-0002-9762-40333 &\n  * …\n  * Georgina C. Dowd  ORCID: orcid.org/0000-0003-1063-08341 \n\nShow authors\n\n  * 2482 Accesses\n\n  * 1 Citation\n\n  * Explore all metrics \n\n## Abstract\n\n_Chrysophrys auratus_ (Australasian snapper) is one of the largest and most\nvaluable finfish from capture fisheries in New Zealand, yet no cell lines from\nthis species are reported in the scientific literature. Here, we describe a\nmuscle-derived cell line initiated from the tail of a juvenile snapper which\nhas been designated CAtmus1PFR ( _Chrysophrys auratus,_ tail muscle, Plant &\nFood Research) _._ The cell line has been passaged over 100 times in 3 years\nand is considered immortal. Cells are reliant on serum supplementation for\nproliferation and exhibit a broad thermal profile comparable to the\neurythermic nature of _C. auratus_ in vivo. The impact of exogenous growth\nfactors, including insulin-like growth factors I and II (IGF-I and IGF-II),\nbasic fibroblast growth factor (bFGF), and transforming growth factor beta\n(TGFβ), on cell morphology and proliferation was investigated. Insulin-like\ngrowth factors acted as mitogens and had minimal effect on cell morphology.\nTGFβ exposure resulted in CAtmus1PFR exhibiting a myofibroblast morphology\nbecoming enlarged with actin bundling. This differentiation was confirmed\nthrough the expression of smooth muscle actin ( _sma_ ), an increase in type 1\ncollagen ( _col1a_ ) expression, and a loss of motility. Expression of _col1a_\nand _sma_ was decreased when cells were exposed to bFGF, and no actin bundling\nwas observed. These data indicate that CAtmus1PFR may be myofibroblastic\nprecursor cells descending from mesenchymal progenitor cells present in the\ntail muscle myosepta.\n\n### Similar content being viewed by others\n\n###  Development of a cell line from skeletal trunk muscle of the fish Labeo\nrohita\n\nArticle 01 June 2023\n\nMukunda Goswami, Nevil Pinto, … Reza Ovissipour\n\n###  Continuous fish muscle cell line with capacity for myogenic and\nadipogenic-like phenotypes\n\nArticle Open access 29 March 2023\n\nMichael K. Saad, John S. K. Yuen Jr, … David L. Kaplan\n\n###  Establishment and characterization of a skeletal myoblast cell line of\ngrass carp (Ctenopharyngodon idellus)\n\nArticle 02 October 2023\n\nXianmei Long, Wangwang Chen, … Qingsong Tan\n\nUse our pre-submission checklist\n\nAvoid common mistakes on your manuscript.\n\n## Introduction\n\nThe Australasian snapper ( _Chrysophrys auratus_ , formerly known as _Pagrus\nauratus_ ) is a marine teleost which is found in the coastal waters of\nAustralia and New Zealand (Parsons _et al._ 2014). The species has economic\nsignificance in New Zealand, representing one of the largest capture fisheries\nin the country. In addition, snapper, or tāmure, have cultural significance to\nthe indigenous people of New Zealand (Māori) as well as being a popular\nrecreational fishery (Parsons _et al._ 2014). These factors have made snapper\na prime candidate for aquaculture. A selective breeding programme to produce\nsnapper strains that are adapted to domestication is ongoing in New Zealand\n(Ashton _et al._ 2019; Wellenreuther _et al._ 2019). Despite the significance\nof this species, there are no cell lines derived from _C. auratus_ tissue,\nincluding muscle. As fish strains that exhibit more rapid muscle growth are\ndesirable for commercial purposes (Olesen _et al._ 2003; Sandoval-Castillo _et\nal._ 2022), availability of muscle-derived cell lines could assist aquaculture\nof snapper through fundamental understanding of muscle growth, development,\nand repair in vitro, but would also provide a platform for controlled analysis\nof single or multiple parameters at a time, e.g. temperature, salinity, and\nnutrients. These types of analyses can be challenging when dealing with live\norganisms in complex aquatic environments. A well-characterised cell line from\none species has the potential to act as a model system for other related\nspecies. There are also possible applications of cell lines beyond traditional\naquaculture in the field of cellular agriculture (Rubio _et al._ 2019).\n\nFish skeletal muscle is composed mainly of muscle fibres which form through\nrecruitment of new fibres (hyperplasia) or growth of existing fibres\n(hypertrophy) (Zimmerman and Lowery 1999; Ruparelia _et al._ 2020). The\ndimensions and distribution of fish muscle fibres, coupled with the extent of\nintramuscular fat, and the composition of intramuscular connective tissue are\nimportant factors which affect the final texture and quality of the fish flesh\n(Kiessling _et al._ 2006; Listrat _et al._ 2016). Despite this, description of\nspecific cell types beyond fibre-forming stem/satellite cells isolated from\nfish embryos or skeletal muscle (Gignac _et al._ 2014; Peng _et al._ 2016;\nSultan _et al._ 2021) is limited, particularly in comparison to mammalian\nsystems where vasculature-associated stem cells including mesoangioblasts and\npericytes have been described, in addition to interstitial cells such as\nfibro-adipogenic progenitor (FAP) cells and PW1-positive interstitial cells\n(PICs) (Cottle _et al._ 2017; Nassari _et al._ 2017; Rubenstein _et al._\n2020). The role of these and other progenitor cells of the myoseptum is\nessentially unexplored in fish muscle (Charvet _et al._ 2011; Bricard _et al._\n2014; Ruparelia _et al._ 2020).\n\nThe fish skeletal muscle invitrome (i.e. a grouping of cell lines around a\ntheme or category (Bols _et al._ 2017)) is extremely limited. Currently,\napproximately 26 skeletal muscle cell lines from 20 fish species have been\ndescribed in the scientific literature (Cellosaurus 2022). This number of\nspecies represents less than 0.04% of all known fish species (> 34,000)\n(www.fishbase.org). Of these cell lines, the majority are classified by cell\nmorphology, mainly as fibroblastic or epithelial, with few progressing\ncharacterisation to describe a specific cell type (Fernandez _et al._ 1993;\nZhao _et al._ 2003; Zhao and Lu 2006; Rougee _et al._ 2007; Lai _et al._\n2008). A key challenge in establishing well-characterised muscle (or any other\ntissue)-derived fish cell lines is the lack of resources such as validated,\nspecies-specific antibodies, detailed knowledge of cell lineages that exist in\nfish muscle, a lack of fundamental knowledge on the application of cell\nsorting technologies specifically for fish cells, and the huge breadth of\nspecies making transfer of technology and knowledge challenging (Rubio _et\nal._ 2019; Potter _et al._ 2020). In the absence of these resources, one way\nof determining a specific cell type is to investigate the genetic, physical,\nand biochemical responses of cells to various growth factors or cytokines, as\ntheir impacts on skeletal muscle development, homeostasis, and repair are\nreasonably well understood across species (Syverud _et al._ 2016, Vélez _et\nal._ 2017; Duran _et al._ 2022) . Fibroblast growth factor (FGF), transforming\ngrowth factor β (TGFβ), and insulin-like growth factors (IGFs) are some of the\nmost influential cytokines involved in these processes (Dayton and Hathaway\n1991; Syverud _et al._ 2016).\n\nFGFs have been shown to promote proliferation of activated myogenic stem\ncells, suppressing their terminal differentiation (Dayton and Hathaway 1991;\nFox and Swain 1993). In addition, FGFs have been shown to enhance the\nproliferation of fibroblasts and promote the formation of new blood vessels\n(Floss _et al._ 1997; Kastner _et al._ 2000). Myogenic stem cell\ndifferentiation is inhibited by TGFβ through the inhibition of myogenic\nregulators MyoD and myogenin (Liu _et al._ 2001). TGFβ regulates the phenotype\nand function of fibroblasts and plays a role in myofibroblast\ntransdifferentiation (Krummel _et al._ 1988). This process promotes expression\nof extracellular matrix and profibrotic genes such as type 1 collagen (\n_col1a_ ) (Ignotz and Massagué 1986; Grande _et al._ 1997) and connective\ntissue growth factor ( _ctgf_ ) (Leask _et al._ 2009; Tsai _et al._ 2018). In\nsome situations, excessive TGFβ-induced deposition of extracellular matrix\ncomponents can lead to fibrosis, a condition which severely impairs muscle\nfunction via reduced mobility and contractile function (Mann _et al._ 2011).\nFibrosis in fish heart, liver, and muscle has been reported in vivo (Arana _et\nal._ 2014; Keen _et al._ 2015; Lin _et al._ 2022). IGFs stimulate nutrient\nuptake, enhance myoblast proliferation, and increase protein synthesis across\na number of species (Negatu and Meier 1995; Rius-Francino _et al._ 2011;\nCastillo _et al._ 2004; Codina _et al._ 2008; Díaz _et al._ 2009; Gabillard\n_et al._ 2010; Montserrat _et al._ 2012). There is also evidence that\nexogenous addition of IGF-I to primary myocytes derived from gilthead\nseabream, a closely related species to the Australasian snapper, resulted in\nincreased expression of myogenin, a transcriptional factor involved in\nmyogenesis, indicating that IGF may also play a role in the differentiation\nprocess (Vélez _et al._ 2014).\n\nHere we report on the first _Chrysophrys auratus–_ derived cell line, among\nseveral others currently in development at Plant & Food Research (Nelson, New\nZealand). This cell line will be identified as _CAtmus1PFR_ ( ** _C_**\n_hrysophrys_ **_a_** _uratus_ **t** ail **mus** cle **1** **P** lant & **F**\nood **R** esearch—species; tissue; institute affiliation). Our findings\nindicate that this cell line is a myofibroblastic progenitor cell derived from\nthe non-myogenic line of mesodermal progenitor cells.\n\n## Materials and methods\n\n### Cell isolation and primary culture\n\nA single healthy juvenile snapper ( _Chrysophrys auratus_ ) bred at The New\nZealand Institute for Plant and Food Research Limited was euthanised with an\noverdose of anaesthetic (60 ppm AQUI-S, Lower Hut, New Zealand). The fish\nweighed 1.45 g and was 4.5 cm in length from nose to peduncle (Fig. 1 _A_).\nThe specimen was kept on ice for 30 min before processing for cell culture.\nThe fish was surface sterilised with 70% ethanol and approximately 1 cm3 of\nde-skinned muscle tissue was excised from the tail peduncle. The muscle\nsegment was washed extensively in Hanks’ balanced salt solution (HBSS, Sigma\nAldrich, St Louis, MO) supplemented with 100 units mL−1 penicillin and 100 µg\nmL−1 streptomycin (1 × P/S) (Sigma-Aldrich). Using sterile scalpel blades, the\ntissue was minced into small fragments which were further dissociated\nenzymatically by incubation with 1 mg mL−1 collagenase in HBSS at 18 °C for 4\nh. The dissociated tissue fragment was centrifuged at 95 × _g_ for 5 min at\nroom temperature (Hettich 320R), after which the supernatant was removed and\nthe remaining cell pellet resuspended in 2 mL Leibovitz’s L-15 (L-15, Gibco,\nGrand Island, NY) medium supplemented with 25% FBS (Gibco) and 1 × P/S. The\nresuspended cells were added to a 25-cm2 flask (Falcon, Corning, NY) which was\nincubated in the dark, in ambient air and temperature (approximately 18 °C).\nTwenty-four hours later, media containing unattached cells and debris was\nremoved and fresh media added (L-15, 25% FBS, 1 × P/S). After about 6 weeks in\nculture, the original T25 flask reached confluency, and was passaged to a\nfresh flask as indicated below, and the serum concentration was reduced to\n20%. Once the cells had been passaged four times, the serum concentration was\nreduced to 10%. Cells were monitored routinely using an inverted microscope\n(CKX53, Olympus, Tokyo, Japan).\n\n **Figure 1.**\n\nEstablishment of CAtmus1PFR muscle-derived cell line from _Chrysophrys\nauratus._ ( _A_ ) Snapper from where CAtmus1PFR was derived. ( _B_ ) Cells 9 d\nafter isolation. ( _C_ ) Early cell death. ( _D_ ) Additional cell types (\n_E–F_ ) Cells with various morphologies after 1 month in culture. ( _G_ )\nFibrous morphology of CAtmus1PFR when sub confluent. ( _H_ ) Confluent\nmorphology and ( _I_ ) Confluent cells with sub-population of large rounded\ncells. * indicates same position on micrographs ( _B_ ) and ( _C_ ). All\n_scale bars_ are 100 µm.\n\nFull size image\n\n### Cell line maintenance\n\nCells were routinely cultured in standard non-vented tissue culture flasks\n(Nunc EasYFlask, Thermo Fisher Scientific, Waltham, MA) at 18 °C, in the dark,\nin ambient air. L-15 medium supplemented with 10% FBS and 1 × P/S was used for\nroutine culture. On reaching confluency, cells were detached from culture\nvessels by exposure to 1 × TrypLE Express (Gibco) for 5–6 min followed by\ncentrifugation at 95 × _g_ for 5 min. Spent medium was removed, and the cells\nwere reseeded in fresh media at 0.133 mL media cm2- (i.e. 10 mL for a 75-cm2\nflask). For cryopreservation, cells were pelleted (95 × _g_ for 5 min) and\nresuspended in 0.5 mL L-15 media (10% FBS). An equal volume of freezing media\n(L-15 with 20% dimethyl sulfoxide (DMSO)) was added for a final cell\nconcentration of 1 × 106 cells mL−1 and a final DMSO concentration of 10%.\nCells were stored at − 80 °C for a minimum of 48 h before long-term storage in\nthe vapour phase of liquid nitrogen.\n\n### Mycoplasma detection\n\nCells at passage 20, 28, and 48 h were cultured to confluency in the absence\nof antibiotics for 2 weeks. The presence of contaminating mycoplasma species\nwas monitored using the Lookout® Mycoplasma PCR Detection Kit according to the\nmanufacturer’s instructions (Sigma-Aldrich).\n\n### DNA barcoding\n\nCell culture provenance was verified by DNA barcoding using universal non-\nspecific primers targeting conserved sequences of cytochrome c oxidase subunit\nI ( _COI_ ) and 16 s rRNA, and comparison to amplicons of the same genes of\ngDNA extracted from whole fish. DNA was isolated from CAtmus1PFR using a\nPurelink™ Genomic DNA Extraction Kit (Invitrogen, Carlsbad, CA) according to\nthe manufacturer’s recommendations. gDNA from a fin clip of _C. auratus_ was\nextracted using the method described previously by Ashton _et al._ (2019).\nBriefly, a fresh fin clip was placed into chilled 96% ethanol followed by\nheating to 80 °C for 5 min. The sample was stored at − 20 °C until additional\nprocessing occurred. Approximately 20 mg of the fin clip was digested by\nincubation in extraction buffer (0.4 M NaCl, 10 mM Tris–HCl pH 8.0, 2 mM EDTA\npH 8.0) with 2% SDS (final concentration) at 80 °C for 5 min followed by rapid\ncooling on ice. The sample was digested with proteinase K (400 µg mL−1 final\nconcentration) for 1.5 h at 56 °C, after which the sample was centrifuged at\n13,680 × _g_ for 15 min. Following treatment with 5 M NaCl and centrifugation,\nRNAse A (100 µg mL−1) was added to remove contaminating RNA. DNA was\nprecipitated with isopropanol overnight at − 20 °C. Subsequent ethanol washes\nfollowed by air-drying yielded purified gDNA.\n\n_16  s rRNA_ and _COI_ amplifications from gDNA extracted from the fin clip\nand cell line were performed using BIOTAQ™ DNA Polymerase (Meridian\nBioscience, Cincinnati, OH) according to the manufacturer’s instructions.\nForward and reverse primers (Table 1) were used to amplify approximately 750\nbp of _COI_ as follows: 94 °C for 4 min, followed by 30 cycles of 94 °C (50\ns), 59 °C (50 s), and 72 °C (90 s), followed by 72 °C for 7 min. Approximately\n1500 bp of the 16 s rRNA gene (~ 1500 bp) was amplified in a similar fashion\nbut with a 54 °C annealing temperature. PCR products run on a 1% agarose gel\nwere extracted using a Nucleospin Gel and PCR Clean-up kit (Machery Nagel,\nDuren, Germany) (Fig. S2). Sanger sequencing of gel-extracted amplicons was\ncarried out by Genetic Analysis Services (University of Otago, New Zealand).\nSequence reads from amplified COI and 16 s rRNA genes from CAtmus1PFR gDNA and\ngDNA extracted from the whole fish were aligned using BioEdit. Where errors\nbecame frequent, sequences were truncated. Chromatograms were scanned for\nmiscalls and corrected where deemed appropriate. Using the forward and reverse\namplification primers as previously, a consensus sequence of 622 bp resulted\nfor _COI_. For 16 s rRNA, a sequencing primer coupled with the previously used\nforward primer was used to generate a 694 bp consensus sequence.\n\n **Table 1. Primer sequences used for DNA barcoding**\n\nFull size table\n\n### Effects of FBS, basal media, and temperature on CAtmus1PFR cell growth\n\nCells (1 × 104) were cultured in 24-well plates containing 1 mL of standard\nculture media (L-15, 1 × P/S, 10% FBS) and incubated at 18 °C for 24 h to\nallow cell attachment to occur. Following this period, cells were challenged\nwith varying FBS concentrations (0%, 5%, 10%, 15%, 20%, or 25%) or different\nbasal media formulations (L-15, CO2 Independent Medium (CIM, Gibco), Medium\n199, Hanks’ Balanced Salts (M199-HBSS, Gibco), MEM, Hanks’ Balanced Salts\n(MEM-HBSS, Gibco) supplemented with 10% FBS and 1 × P/S. At 2, 7, 10, and 14\ndays post inoculation, cells were detached in 1 × TrypLE Express and counted\nusing a haemocytometer. The impact of temperature on CAtmus1PFR cells was\nexamined by seeding each well of 24-well plates with 1 × 104 cells and\nincubating immediately at various temperatures (4 °C, 12 °C, 18 °C, 24 °C, 30\n°C, 32 °C). Cell number was determined as above. Data shown in Fig. 2\nrepresent data from three biological replicates carried out on different days.\nEach biological replicate had three technical replicates.\n\n **Figure 2.**\n\nProliferation of CAtmus1PFR under different parameters. The impact of ( _A_ )\ntemperature ( _B_ ) FBS and ( _C_ ) basal media on CAtmus1PFR was monitored\nvia direct cell counts over a 14-d period ( _n_ = 3 for all experiments).\n_Error bars_ = means ± standard deviation.\n\nFull size image\n\n### Impact of growth factors on cell growth\n\nPilot experiments confirmed the correlation between cell number and measured\ncell metabolic activity through use of an MTT assay\n(3-(4,5-dimethylthiazol-2-yl)-2,5-diphenyltetrazolium Bromide, Invitrogen;\ndata not shown), and so, this method was employed to monitor the impact of\nbasic fibroblast growth factor (bFGF, human recombinant, Catalogue No.\nPHG0266, Thermo Fisher), transforming growth factor beta 1 (TGFβ1, human\nrecombinant, Catalogue No. PHG9204, Thermo Fisher), insulin-like growth\nfactor-1 (IGF-I, human recombinant, Catalogue No. PHG0071, Thermo Fisher), and\ninsulin-like growth factor-2 (IGF-II, human recombinant, Catalogue No.\nPHG0084, Thermo Fisher) on cell proliferation.\n\nTwenty-four-well plates were seeded at 1 × 104 cells mL−1 in standard culture\nmedia (L-15, 10% FBS, 1 × P/S) supplemented with 1 or 100 ng mL−1 of a single\ngrowth factor. All plates were incubated in the dark at 18 °C in ambient air.\nAt 1, 4, 7, and 10 days, an MTT assay was carried out as described previously.\nBriefly, wells were washed twice with 1 mL phosphate-buffered saline (PBS,\nThermo Fisher), followed by addition of 0.4 mL serum-free media supplemented\nwith 0.1 mL MTT (5 mg mL−1). Cells were incubated for 70 min at room\ntemperature, after which 0.5 mL DMSO was added to each well. Cells were\nincubated with agitation for 10 min followed by gentle trituration. A 0.9 mL\nsample from each well was transferred to a cuvette where the absorbance was\nmeasured at 600 nm (Evolution 220 UV–Visible Spectrophotometer, Thermo\nFisher). The spectrophotometer was blanked using serum-free L-15, MTT, and\nDMSO.\n\n### RNA extraction and qPCR\n\nCells were seeded at 1 × 104 cells mL−1 in media (L-15, 10% FBS, 1 × P/S)\nsupplemented with 1 or 100 ng mL−1 growth factors (bFGF, IGF-I, IGF-II, or\nTGFβ1). After 4 days in culture, cells were washed twice in 1 mL dPBS and RNA\nwas extracted and combined from four wells for each condition using a GENEzol\nTriRNA Pure Kit (Geneaid, New Taipei City, Taiwan) as per the manufacturer’s\nrecommendations. An on-column DNase treatment was carried out to remove\ngenomic DNA. Complementary DNA (cDNA) was synthesised from 500 ng of RNA using\nSuperscript VILO (Invitrogen) in a 20 µL reaction volume. qPCR primers were\ndesigned based on the gilthead seabream ( _Sparus aurata_ ) which is closely\nrelated to _C. auratus._ Database accession numbers of each target and\nreference genes are identified in Table 2. All primers were designed to span\nan exon-exon junction and should, therefore, not detect genomic DNA, sequences\nof which are shown in Table 2. Primer efficiencies were calculated to be\nbetween 91 and 98% (Table 2). Real-time PCR was performed using a Quant Studio\n6 Flex instrument (Thermo Fisher). Reactions consisted of 0.5 µL forward and\nreverse primers (10 µM), 8 µL TB Green® (Takara Bio, Shiga, Japan), 6 µL UP\nH2O, and 1 µL cDNA for a total reaction volume of 16 µL.\n\n **Table 2. Database accession numbers  and primer sequences of each target\nand reference genes**\n\nFull size table\n\nElongation factor 1a ( _elfa_ ) was used as reference gene and the threshold\ncycle (CT) values were between 13 and 14. CT values for _col1A_ , _dcn_ ,\n_sma_ , and _vim_ were ~ 16, ~ 23, ~ 16, and ~ 23 in the control conditions\nrespectively. The relative fold change in gene expression was calculated using\nthe delta delta CT method (2−ΔΔCT) as described by Livak and Schmittgen\n(2001).\n\n### F-actin labelling\n\nCells were seeded at a density of 1 × 104 cells/well in a 24-well plate in the\npresence or absence of 100 ng mL−1 bFGF or TGFβ. After 4 days in culture under\nstandard conditions, wells were washed in dPBS and cells fixed in 4%\nparaformaldehyde for 30 min at room temperature. Cells were permeabilised in\n0.4% Triton-X-100 in dPBS for 20 min followed by treatment with Rhodamine\nphalloidin (Invitrogen) in 0.1% BSA in dPBS for 1 h. Cells were washed and\nimaged using fluorescence microscopy (CKX53, Olympus ).\n\n### Migration assay\n\nCells (1.2 × 103 mL−1) suspended in L-15 growth medium were seeded in 0.07 mL\nvolume in each side of a two-well migration chamber (IBIDI, Bavaria, Germany).\nGrowth factors (bFGF or TGFβ) were added to a final concentration of 1 or 100\nng mL−1. Chambers were incubated in ambient air and temperature, and the media\nrefreshed on day 4. On day 7, the migration chamber was removed, leaving a\n0.5-cm cell-free gap between cell populations. Debris was removed by washing\nin 1 mL dPBS. Fresh growth factor containing growth media was added, and the\nplates were imaged immediately using an inverted microscope. Subsequent images\nof the cell-free gap were recorded at 6 and 24 h post removal from the\nmigration chamber. The gap in a 1500 × 450 pixel (equivalent to ~ 3.5 mm × ~ 1\nmm) section from each condition was measured using ImageJ software. Each\nmigration assay, of which there were two biological replicates, had triplicate\ntechnical replicates.\n\n### Animal handling\n\nAll research carried out in this study was reviewed and approved by the Animal\nEthics Committee of Nelson Marlborough Institute of Technology in New Zealand\n(Application number AEC2019-PFR-01).\n\n## Results\n\n### CAtmus1PFR is a continuous cell line derived from _C. auratus_ tail\nskeletal muscle\n\nCollagenase treatment of a muscle segment derived from a juvenile _C. auratus_\n(Fig. 1 _A_) resulted in a preparation with a significant amount of debris.\nThis was not consistent with microbial contamination, but rather appeared to\nbe fragments of degraded muscle fibres (Fig. 1 _B_, _C_). By day 9, small\ncolonies of replicating cells with fibroblastic or spindle morphologies were\nobserved (Fig. 1 _B_). Many of these early cell types died off and were\nreplaced with other proliferative cells with varying morphologies (Fig. 1 _C_,\n_D_). After 1 month in culture, as the primary culture neared confluency, a\nheterogenous population of cells was evident with a number of different cell\nmorphologies (Fig. 1 _E_, _F_). Following continuous passage, a single cell\ntype emerged which had long spindle-like processes when culturing (Fig. 1\n_G_). However, on reaching confluency, a subpopulation of cells with a larger,\nmore rounded morphology developed. Cells were successfully cryopreserved and\nresuscitated in L-15 with 10% FBS and yielded approximately 80–90% cell\nviability. No morphological changes were observed following resuscitation. At\nthe time of publication, the cell line has been passaged 100 times over a 3-yr\nperiod. The line is assumed continuous through spontaneous immortalisation, as\nis common for finfish cell lines, and has been designated CAtmus1PFR (\n_Chrysophrys auratus_ , tail muscle, Plant and Food Research). The absence of\n_Mycoplasma_ species was confirmed through PCR (Fig. S1). The species origin\nwas verified as _Chrysophrys auratus_ by 100% homology between 16s rRNA and\nCOI gene sequence from CAtmus1PFR genomic DNA to gDNA extracted from a _C.\nauratus_ fin clip.\n\n### Temperature, serum concentration, and basal media formulation impact\nproliferation of CAtmus1PFR\n\nThe thermal tolerance of CAtmus1PFR to temperatures ranging from 4 to 32 °C\nwas investigated (Fig. 2 _A_). At hypothermic conditions (4 °C), the cells\ncompletely detached from the culture vessel after 2 d in culture. At 12 °C,\nthe cells proliferated slowly, and, by day 14, the final numbers were\napproximately half that of normothermic conditions (18 °C). At 32 °C\n(hyperthermic), the cells were unable to replicate, but remained attached to\nthe tissue culture vessel. Remaining cells were enlarged in size compared with\ncells cultured at normothermic conditions (18 °C). Temperatures ranging from\n18 to 30 °C provided conditions for comparable growth of CAtmus1PFR cells with\nno variation in cell morphology (Fig. 2 _A_).\n\nIn the absence of serum, the number of viable cells decreased over time; by\nday 14, a small number of cells remained with an elongated morphology (Fig. 2\n_B_ and S3). Decreasing FBS concentration from the standard 10 to 5% resulted\nin a lower proliferative rate. Conversely, increasing the serum concentration\nresulted in a dose-dependent increase in cell number over a 14-d period (Fig.\n2 _B_). In media supplemented with 25% FBS, the cell number after 2 wk in\nculture was more than double that observed with 10% FBS (Fig. 2 _B_). There\nwas no impact on cell morphology with FBS concentrations between 5 and 25%.\n\nCAtmus1PFR is routinely cultured in L-15 media which allows the cells to be\ncultured without the need for additional CO2. Alternative buffered media were\ninvestigated for their impact on proliferation of CAtmus1PFR cells (Fig. 2\n_C_). After 7 days in culture, proliferation of CAtmus1PFR in M199 was\nsignificantly greater than that observed in three other basal media\npreparations (L-15, CO2-independent medium [CIM], and MEM HBSS). By day 10,\nthe maximum cell number had been reached in M199 (~ 1.1 × 105), and this was\nmatched by CIM. Interestingly, cells culturing in L-15 and MEM reached maximal\nnumber at 7 d (~ 6 × 104), and did not show further growth even with fresh\nmedia replacements. Final cell numbers in MEM and L-15 were significantly\nlower than in CIM and M199.\n\n### Growth factors affect proliferation and morphology of CAtmus1PFR\n\nAt 1 ng mL−1, insulin-like growth factors I and II (IGF-I, IGF-II) had no\nimpact on cell number as measured by MTT assay; however, at 100 ng mL−1, both\nIGF-I and IGF-II resulted in increased cell numbers (Fig. 3 _B_, _D_).\n\n **Figure 3.**\n\nImpact of growth factors on morphology and replication of CAtmus1PFR. ( _A_ )\nMicrographs showing pleiomorphic phenotype in control condition (L-15 media\nsupplemented with 10% FBS and 1 × penicillin streptomycin) when confluent.\nImpact of IGF-I ( _B_ , _C_ ), IGF-II ( _D_ , _E_ ), TGFβ1 ( _E_ , _F_ ), and\nbFGF ( _G_ , _H_ ) on CAtmus1PFR proliferation and morphology at 1 and 100 ng\nmL−1 ( _n_ = 3). _Error bars_ = means ± standard deviation. All _scale bars_\nare 100 µm.\n\nFull size image\n\nTGFβ1 had no impact on cell numbers, but had a significant impact on the cell\nmorphology (Fig. 3 _F_, _G_). The cell size increased and appeared to be\nsimilar to the subpopulation of cells observed under standard culture\nconditions (Fig. 3 _A_). bFGF had minimal impact on proliferation of\nCAtmus1PFR but maintained all the cells in a single morphology (Fig. 3 _H_,\n_I_) similar to those observed in the control condition. The large rounded\ncells, which formed in the control condition (Fig. 3 _A_), did not form in the\npresence of bFGF (Fig. 3 _I_).\n\n### CAtmus1PFR treated with TGFβ have myofibroblast properties\n\nThe change in morphology of CAtmus1PFR following treatment with TGFβ1 and bFGF\nsuggested differentiation of the cell. Previous data have demonstrated that\nTGFβ1 can result in the differentiation of precursor cells to myofibroblasts.\nThese differentiated cells exhibit changes in cell shape, modified\ncytoskeletal features including the formation of actin bundles, and increased\ndeposition of extracellular matrix components such as collagen. bFGF has been\nshown to have an opposing effect, causing downregulation of myofibroblastic\nfeatures and encouraging a more fibroblastic phenotype. We therefore sought to\ndetermine if CAtmus1PFR was a myofibroblast progenitor cell, and gave rise to\nmyofibroblasts following TGFβ treatment, and whether bFGF had an opposing\neffect on this process.\n\nMyofibroblasts are associated in vivo with enhanced deposition of collagen. In\nTGFβ1-treated cells, a 2.5- to threefold increase in expression of _col1a_\nmRNA at 1 and 100 ng mL−1, respectively, was observed (Fig. 4 _A_).\nConversely, exposing cells to 1 or 100 ng mL−1 bFGF resulted in a significant\ndecrease in expression. The expression of _decorin_ mRNA, from a gene encoding\na proteoglycan extracellular matrix (ECM) component, was also increased in the\npresence of TGFβ1 and decreased where the cells were cultured with bFGF (Fig.\n4 _B_).\n\n **Figure 4.**\n\nImpact of growth factors on expression of genes associated with extracellular\nmatrix components. Change in expression of ( _A_ ) type 1 collagen 1 (\n_col1A)_ and ( _B_ ) decorin ( _dcn)_ following 4 d of treatment with IGF-I,\nIGF-II, TGFβ1, or bFGF at 1 and 100 ng mL−1 relative to control condition\n(L-15, 10% FBS, 1 × P/S) ( _n_ = 3). _Error bars_ = means ± standard\ndeviation. * _P_ < 0.05 by one-way ANOVA followed by Tukey’s least Significant\nDifference (α = 0.05).\n\nFull size image\n\nMyofibroblasts have been shown to exhibit actin bundling, which can be\nvisualised with the fluorescent probe phalloidin, which binds to filamentous\nactin (F-actin). Under standard culture conditions (no growth factors), large\ncells with actin bundling and smaller cells without bundling were evident\nafter 7 d in culture (Fig. 5 _B_). In the presence of bFGF, no actin bundling\nwas observed in any of the cells and the size and morphology remained\nunchanged (Fig. 5 _C_, _D_). In the presence of TGFβ, cells exhibited\nsignificant actin bundling and large cell size by 4 d in culture (Fig. 5 _E_).\nBy day 7, the cells formed a mesh of cells with significant actin bundling\n(Fig. 5 _F_). An additional cytoskeletal marker, the intermediate filament\nprotein, vimentin, which is known to be expressed by myofibroblasts, was also\nupregulated following TGFβ1 treatment of CAtmus1PFR cells and downregulated in\nthe presence of bFGF, although the changes were not statistically significant\n(Fig. 5 _G_).\n\n **Figure 5.**\n\nEffects of growth factors on the cytoskeletal structure of CAtmus1PFR cells.\nCells 4 and 7 d in culture under standard conditions ( _A_ , _B_ ), or in the\npresence of 100 ng mL−1 bFGF ( _C_ , _D_ ) or TGFβ1 ( _E_ , _F_ ). ( _G_ )\nExpression of vimentin after 4 d exposure to TGFβ1 and bFGF at 1 and 100 ng\nmL−1 in comparison to control unexposed cells. _Error bars_ = means ± standard\ndeviation. All _scale bars_ are 100 µm.\n\nFull size image\n\nExpression of smooth muscle actin (SMA) is generally indicative of\nmyofibroblast differentiation, and, when exposed to TGFβ1, expression of this\ngene increases in CAtmus1PFR (Fig. 6 _A_). A large variation in this increased\nexpression was observed across biological replicates (changes between 2- and\neightfold). It is plausible that the status of the seeding culture plays an\nimportant role in the expression profile of _sma_ , as cultures which have a\nproportion of cells already differentiated to myofibroblasts may result in an\nincreased expression of sma in the cell population. Conversely, bFGF-treated\ncells decrease expression of _sma_ mRNA (Fig. 6 _A_). SMA protein has\npreviously been shown to be involved with reducing the migratory capabilities\nof cells. To further investigate the migratory capabilities of growth\nfactor–treated cells, a wound-migration assay was carried out. Mobility of\ncells treated with TGFβ1 was almost completely abolished at 100 ng mL−1, and\nwas somewhat retarded at 1 ng mL−1 (Fig. 6 _C_, _D_). Untreated and cells\ntreated with bFGF migrated into and closed the gap within 24–36 h (Fig. 6 _C_,\n_D_).\n\n **Figure 6.**\n\nEffects of growth factors on expression of smooth muscle actin ( _sma_ ) and\non cell migration. ( _A_ ) Expression of _sma_ after 4 d exposure to TGFβ and\nbFGF at 1 and 100 ng mL−1 in comparison to control unexposed cells. Symbols\nrepresent fold change from 4 independent biological replicates for each\ncondition. _Bars_ represent the mean value for each condition. ( _B_ )\nMeasurement of gap size at initial ‘wounding’ and 24 h later for cells\ncultured in standard culture media (L-15, 10% FBS, 1 × P/S), or media\nsupplemented with bFGF or TGFβ at 1 and 100 ng mL−1. Values represent means\nand standard deviations of triplicate biological replicates, each with two or\nthree technical replicates. ( _D_ ) Micrographs demonstrating migration of\nCAtmus1PFR cultured in control and growth factor-supplemented media over 24 h.\n_Scale bars_ are 100 µm.\n\nFull size image\n\n## Discussion\n\nHere we describe the growth characteristics and differentiation capacity of a\nmuscle-derived myofibroblastic precursor cell line from the tail peduncle\nmuscle of Australasian snapper. This is the first reported cell line for _C.\nauratus_ , and it joins 26 other cell lines derived from fish skeletal muscle\nreported in the scientific literature. Of the previously reported lines, the\nmajority are described as being fibroblastic according to their morphology. In\nmany cases, these have been developed as in vitro systems for monitoring and\ncontrol of infectious disease in aquaculture (Middlebrooks _et al._ 1981; Zhao\n_et al._ 2003; Zhao and Lu 2006; Lai _et al._ 2008; Wang _et al._ 2020).\nDespite the emphasis on fibroblasts, skeletal muscle is a complex environment\nwith many cell types, each playing an important role in the development,\nrepair, and homeostasis of muscle tissue (Joe _et al._ 2010; Uezumi _et al._\n2011; Heredia _et al._ 2013; Giordani _et al._ 2019). Additionally, the ECM\nsupporting these cells provides both the physical and biochemical environments\nin which these cells reside (Csapo _et al._ 2020). Satellite cells, long\nconsidered muscle progenitor cells, are abundant in fish (Johnston 2006;\nRuparelia _et al._ 2020), and have been shown to undergo dichotomic\ndifferentiation into myoblastic and non-myoblastic lineages (Shefer _et al._\n2004). The myoblastic lineage leads to myogenic development, whereas the\nalternative leads to a mesenchymal pathway giving rise to cells which reside\nin the connective tissue of muscle. Additionally, mesenchymal stem cells\ndistinct from satellite cells have also been described to occur in skeletal\nmuscle tissues. Work is ongoing to determine the specific stem cell origins\nthat has given rise to CAtmus1PFR.\n\nFish cell lines have been described as having a proliferation zone with an\noptimum temperature where cells replicate more rapidly (Bols _et al._ 1992).\nIn the case of CAtmus1PFR, there was a broad optimal temperature where the\ncells had a similar proliferation capacity (between 18 and 30 °C). This is in\ncomparison to a number of other cell lines where a single temperature is\nidentified as being optimal. A number of rainbow trout cell lines (RTE, RTE-2,\nRTG-2, RTH-149, and RTT) share an optimal temperature of 20 °C, with decreased\nproliferation at 5 °C above or below this temperature (Bols _et al._ 1992).\nThe broad temperature tolerance of CAtmus1PFR may be due to the eurythermal\nnature of snapper (Parsons _et al._ 2014), suggesting cell lines from this\nspecies represent the in vivo nature of the fish. It would be of interest to\ndetermine if the effect of temperature on the gene expression profile of\nCAtmus1PFR mirrors that observed in snapper in vivo, where pathways associated\nwith metabolism, cell regulation, and cell signalling were implicated\n(Wellenreuther _et al._ 2019).\n\nThe specific nutritional requirements of skeletal muscle-derived fish cell\nlines are undefined. Basal media formulations developed for mammalian cells\nsupplemented with mammalian serum as a source of growth factors, lipids, and\nadditional nutrients are routinely used (Bols and Lee 1994). Proliferation of\nmany muscle-derived fish cell lines is positively affected by increasing serum\nconcentrations (Zhao _et al._ 2003; Zhao and Lu 2006; Rougee _et al._ 2007;\nWang _et al._ 2020), and this is similar to that observed with CAtmus1PFR.\nInterestingly, different fish species have different tolerances to basal media\nformulations (Fernandez _et al._ 1993; Wang _et al._ 2003; Zhao and Lu 2006).\nHere we have demonstrated CAtmus1PFR is capable of enhanced replication in\nM199 and CIM media formulations; however, as the impact(s) these media had on\nthe biochemical and physical responses of cells was not determined, we\ncontinued to culture the cell line in the medium in which it was established\n(L-15). It is unclear at this stage whether media preferences are determined\nby the donor fish species, the donor tissue, or a specific cell type. A\ncomparison of requirements between these variables may provide additional\ninformation when it comes to understanding the development and growth of fish\nmuscle for applications in both traditional and cellular aquaculture (Rubio\n_et al._ 2019).\n\nIn fish skeletal muscle, mesenchymal progenitor cells are believed to give\nrise to myogenic and non-myogenic lineages. The myogenic lineage leads to the\nformation of skeletal muscle per se, while the non-myogenic lineage leads to\nmyofibroblast generation and is also proposed to form the resident\nfibroblasts, fibro/adipogenic progenitor cells, pericytes, and stem cells\n(Paylor _et al._ 2011). The impacts of various growth factors on fish myogenic\ncells have been reasonably understood, but their effects on the non-myogenic\nlineage less so. Here we provide evidence that CAtmus1PFR is a non-myogenic\nmesenchymal progenitor cell that is capable of differentiation to a\nmyofibroblast.\n\nUnder normal physiological conditions, many components of the ECM, including\ntype 1 collagen, are produced by muscle-resident fibroblasts. In situations\nwhen muscle tissue becomes damaged, myofibroblasts are recruited. These\nspecialised cells increase deposition of collagen, which aids in the repair of\nmuscle tissue, but where the action of these cells is not resolved, a\nthickening or scarring of the tissue can occur (fibrosis). Decorin, another\ncomponent of the ECM, prevents the formation of fibrosis by binding to TGFβ,\nyet there is evidence that myofibroblasts express full-length biologically\nactive decorin, which essentially contradicts the role myofibroblasts play in\nthe formation of fibrosis in vivo (Honda and Munakata 2004). The exact reason\nfor this is not clear but it has been proposed that decorin may play different\nroles as fibrosis progresses (Klingberg _et al._ 2013). It would be\ninteresting to monitor decorin expression over time in CAtmus1PFR and\ndetermine if expression of decorin changes.\n\nTGFβ is a known stimulant of myofibroblast differentiation and fibrosis\n(reviewed in Frangogiannis 2020). The differentiation process increases\nexpression of type 1 collagen ( _col1a_ ), and induces the expression of\nalpha-smooth muscle actin ( _sma_ ) expression in myofibroblasts (Desmoulière\n_et al._ 1993), which may participate in the formation of stress fibres, cell\ncontractility, and cell spreading characterising the myofibroblasts phenotype.\nTGFβ1 also contributes to the upregulation of vimentin expression while\nblocking myogenesis (Wu _et al._ 2007) and reducing migration. CAtmus1PFR\nresponded similarly to TGFβ1, and these cells are thus prime for studying in\nvitro fibrosis events.\n\nIn vivo, increased deposition of collagen by cardiac myofibroblasts has been\nshown to play a role in the remodelling of the ECM of the heart in rainbow\ntrout in response to cold acclimation (Johnston and Gillis 2018). This\nreactive fibrosis leads to a stiffening of the heart, which provides support\nfor the increasing muscle mass of the fish. This has implications in\naquaculture, where fish strains are specifically bred for their ability to\nincrease muscle mass rapidly (Olesen _et al._ 2003). Indeed, perivertebral\nfibrosis, presumably due to the action of myofibroblasts, has been reported in\nfarmed Chinook salmon which has led to spinal deformities, thus reducing the\nvalue of this commercially important species. The exact cause of these\ndeformities is as yet unknown, but a number of factors have been proposed,\nincluding temperature, toxicities, trauma, and vitamin deficiencies (Munday\n_et al._ 2016). Indeed, the mycotoxin, aflatoxin B1, has been shown to cause\nliver fibrosis in trout (Arana _et al._ 2014), so it would be of interest to\ndetermine if this, and other toxins, in addition to compounding effects such\nas temperature stress, affected fibrosis in an in vitro model. Having a model\nof fibrosis is a useful tool, not only for understanding possible causes of\nfibrosis, but also for the development of prevention and rescue strategies,\nassuming the process is dynamic and, therefore, reversible. While\nmyofibroblast precursor cells have previously been isolated and cultured from\nheart tissue of rainbow trout (Johnston and Gillis 2018), this is the first\ntime a precursor cell capable of in vitro differentiation has been isolated\nfrom fish muscle. Beyond applications in traditional aquaculture, availability\nof this non-myogenic lineage from snapper tail muscle could also be relevant\nto the blossoming cellular aquaculture industry where the main focus has been\nin culturing myogenic cells, but as fish meat texture and structure are\nheavily influenced by the myoseptum and ECM, myofibroblasts and their\nprecursors may also prove essential for this technology.\n\n## References\n\n  * Arana S, Alves VAF, Sabino M, Tabata YA, Nonogaki S, Zaidan-Dagli ML, Hernandez-Blazquez FJ (2014) Immunohistochemical evidence for myofibroblast-like cells associated with liver injury induced by Aflatoxin B1 in rainbow trout (Oncorhynchus mykiss). J Comp Pathol 150:258–265. https://doi.org/10.1016/j.jcpa.2013.07.003\n\nArticle  CAS  Google Scholar\n\n  * Ashton DT, Hilario E, Jaksons P, Ritchie PA, Wellenreuther M (2019) Genetic diversity and heritability of economically important traits in captive Australasian snapper ( _Chrysophrys auratus_ ). Aquaculture 505:190–198. https://doi.org/10.1016/j.aquaculture.2019.02.034\n\nArticle  Google Scholar\n\n  * Bols NC, Lee LEJ (1994) Cell lines: availability, propagation and isolation. In: Hochachka PW, Mommsen TP (eds) Biochemistry and molecular biology of fishes. Elsevier Science Publishers, pp 145–159. https://doi.org/10.1016/B978-0-444-82033-4.50019-2\n\n  * Bols NC, Mosser DD, Steels GB (1992) Temperature studies and recent advances with fish cells in vitro. Comp Biochem Phys A 103:1–14. https://doi.org/10.1016/0300-9629(92)90235-I\n\nArticle  Google Scholar\n\n  * Bols NC, Pham PH, Dayeh VR, Lee LEJ (2017) Invitromatics, invitrome, and invitroomics: introduction of three new terms for in vitro biology and illustration of their use with the cell lines from rainbow trout. In Vitro Cell Dev Biol Anim 53:383–405. https://doi.org/10.1007/s11626-017-0142-5\n\nArticle  CAS  Google Scholar\n\n  * Bricard Y, Ralliere C, Lebret V, Lefevre F, Rescan PY (2014) Early fish myoseptal cells: insights from the trout and relationships with amniote axial tenocytes. Plos One 9(3):e91876\n\n  * Castillo J, Codina M, Martinez ML, Navarro I, Gutierrez J (2004) Metabolic and mitogenic effects of IGF-I and insulin on muscle cells of rainbow trout. Am J Physiol Regul Integr Comp Physiol 286:R935–941. https://doi.org/10.1152/ajpregu.00459.2003\n\nArticle  CAS  Google Scholar\n\n  * Cellosaurus (2022) A knowledge resource on cell lines. Available via https://web.expasy.org/cellosaurus/. Accessed 01 Sept 2022\n\n  * Charvet B, Malbouyres M, Pagnon-Minot A, Ruggiero F, Le Guellec D (2011) Development of the zebrafish myoseptum with emphasis on the myotendinous junction. Cell Tissue Res 346:439–449. https://doi.org/10.1007/s00441-011-1266-7\n\nArticle  CAS  Google Scholar\n\n  * Codina M, Garcia de la serrana D, Sanchez-Gurmaches J, Montserrat N, Chistyakova O, Navarro I, Gutierrez J (2008) Metabolic and mitogenic effects of IGF-II in rainbow trout ( _Oncorhynchus mykiss_ ) myocytes in culture and the role of IGF-II in the PI3K/Akt and MAPK signalling pathways. Gen Comp Endocrinol 157:116–124. https://doi.org/10.1016/j.ygcen.2008.04.009\n\nArticle  CAS  Google Scholar\n\n  * Cottle BJ, Lewis FC, Shone V, Ellison-Hughes GM (2017) Skeletal muscle-derived interstitial progenitor cells (PICs) display stem cell properties, being clonogenic, self-renewing, and multi-potent in vitro and in vivo. Stem Cell Res Ther 8(158). https://doi.org/10.1186/s13287-017-0612-4\n\n  * Csapo R, Gumpenberger M, Wessner B (2020) Skeletal muscle extracellular matrix - what do we know about its composition, regulation, and physiological roles? A Narrative Review Front Physiol 11:253. https://doi.org/10.3389/fphys.2020.00253\n\nArticle  Google Scholar\n\n  * Dayton WR, Hathaway MR (1991) Myogenic cell-proliferation and differentiation. Poult Sci 70:1815–1822. https://doi.org/10.3382/ps.0701815\n\nArticle  CAS  Google Scholar\n\n  * Desmoulière A, Geinoz A, Gabbiani F, Gabbiani G (1993) Transforming growth factor-beta 1 induces alpha-smooth muscle actin expression in granulation tissue myofibroblasts and in quiescent and growing cultured fibroblasts. J Cell Biol 122:103–111. https://doi.org/10.1083/jcb.122.1.103\n\nArticle  Google Scholar\n\n  * Díaz M, Vraskou Y, Gutiérrez J, Planas JV (2009) Expression of rainbow trout glucose transporters GLUT1 and GLUT4 during in vitro muscle cell differentiation and regulation by insulin and IGF-I. Am J Physiol Regul Integr Comp Physiol 296:R794–R800. https://doi.org/10.1152/ajpregu.90673.2008\n\nArticle  CAS  Google Scholar\n\n  * Duran BOS, Zanella BTT, Perez ES, Mareco EA, Blasco J, Dal-Pai-Silva M, de la Serrana DG (2022) Amino acids and IGF1 regulation of fish muscle growth revealed by transcriptome and micrornaome integrative analyses of Pacu (Piaractus mesopotamicus) Myotubes. Int J Mol Sci 23(3):1180. https://doi.org/10.3390/ijms23031180\n\n  * Fernandez RD, Yoshimizu M, Ezura Y, Kimura T, Fernandez RD, Mamoru Y, Yoshio E, Takahisa K, Fenandez RD (1993) Comparative growth response of fish cell lines in different media, temperatures, and sodium chloride concentrations. Gyobyo Kenkyu 28:27–34. https://doi.org/10.3147/jsfp.28.27\n\nArticle  Google Scholar\n\n  * FishBase (2022) http://www.fishbase.org. Cited 01 September 2022\n\n  * Floss T, Arnold HH, Braun T (1997) A role for FGF-6 in skeletal muscle regeneration. Genes Dev 11:2040–2051. https://doi.org/10.1101/gad.11.16.2040\n\nArticle  CAS  Google Scholar\n\n  * Fox JC, Swain JL (1993) Auto and transactivation of Fgf expression - potential mechanism for regulation of myogenic differentiation. In Vitro Cell Dev-An 29a:228–230. https://doi.org/10.1007/BF02634188\n\nArticle  CAS  Google Scholar\n\n  * Frangogiannis N (2020) Transforming growth factor-β in tissue fibrosis. J Exp Med 217:e20190103. https://doi.org/10.1084/jem.20190103\n\nArticle  Google Scholar\n\n  * Gabillard JC, Sabin N, Paboeuf G (2010) In vitro characterization of proliferation and differentiation of trout satellite cells. Cell Tissue Res 342:471–477. https://doi.org/10.1007/s00441-010-1071-8\n\nArticle  Google Scholar\n\n  * Gignac SJ, Vo NTK, Mikhaeil MS, Alexander JAN, MacLatchy DL, Schulte PM, Lee LEJ (2014) Derivation of a continuous myogenic cell culture from an embryo of common killifish, _Fundulus heteroclitus_. Comp Biochem Physiol A Mol Integr Physiol 175:15–27. https://doi.org/10.1016/j.cbpa.2014.05.002\n\nArticle  CAS  Google Scholar\n\n  * Giordani L, He GJ, Negroni E, Sakai H, Law JYC, Siu MM, Wan R, Corneau A, Tajbakhsh S, Cheung TH, Le Grand F (2019) High-dimensional single-cell cartography reveals novel skeletal muscle-resident cell populations. Mol Cell 74:609-621.e606. https://doi.org/10.1016/j.molcel.2019.02.026\n\nArticle  CAS  Google Scholar\n\n  * Grande JP, Melder DC, Zinsmeister AR (1997) Modulation of collagen gene expression by cytokines: stimulatory effect of transforming growth factor-beta1, with divergent effects of epidermal growth factor and tumor necrosis factor-alpha on collagen type I and collagen type IV. J Lab Clin Med 130:476–486. https://doi.org/10.1016/s0022-2143(97)90124-4\n\nArticle  CAS  Google Scholar\n\n  * Heredia JE, Mukundan L, Chen FM, Mueller AA, Deo RC, Locksley RM, Rando TA, Chawla A (2013) Type 2 innate signals stimulate fibro/adipogenic progenitors to facilitate muscle regeneration. Cell 153:376–388. https://doi.org/10.1016/j.cell.2013.02.053\n\nArticle  CAS  Google Scholar\n\n  * Honda E, Munakata H (2004) Purification and characterization of decorin from the culture media of MRC-5 cells. Int J Biochem Cell Biol 36:1635–1644. https://doi.org/10.1016/j.biocel.2004.01.023\n\nArticle  CAS  Google Scholar\n\n  * Ignotz RA, Massagué J (1986) Transforming growth factor-beta stimulates the expression of fibronectin and collagen and their incorporation into the extracellular matrix. J Biol Chem 261:4337–4345. https://doi.org/10.1016/S0021-9258(17)35666-1\n\nArticle  CAS  Google Scholar\n\n  * Joe AWB, Yi L, Natarajan A, Le Grand F, So L, Wang J, Rudnicki MA, Rossi FMV (2010) Muscle injury activates resident fibro/adipogenic progenitors that facilitate myogenesis. Nat Cell Biol 12:153–163. https://doi.org/10.1038/ncb2015\n\nArticle  CAS  Google Scholar\n\n  * Johnston EF, Gillis TE (2018) Transforming growth factor-beta1 induces differentiation of rainbow trout (Oncorhynchus mykiss) cardiac fibroblasts into myofibroblasts. J Exp Biol 221(24):jeb189167. https://doi.org/10.1242/jeb.189167\n\n  * Johnston IA (2006) Environment and plasticity of myogenesis in teleost fish. J Exp Biol 209:2249–2264. https://doi.org/10.1242/jeb.02153\n\nArticle  CAS  Google Scholar\n\n  * Kastner S, Elias MC, Rivera AJ, Yablonka-Reuveni Z (2000) Gene expression patterns of the fibroblast growth factors and their receptors during myogenesis of rat satellite cells. J Histochem Cytochem 48:1079–1096. https://doi.org/10.1177/002215540004800805\n\nArticle  CAS  Google Scholar\n\n  * Keen AN, Fenna AJ, McConnell JC, Sherratt MJ, Gardner P, Shiels HA (2015) The dynamic nature of hypertrophic and fibrotic remodeling of the fish ventricle. Front Physiol 6:427. https://doi.org/10.3389/fphys.2015.00427\n\nArticle  Google Scholar\n\n  * Kiessling A, Ruohonen K, Bjørnevik M (2006) Muscle fibre growth and quality in fish. Archives of Animal Breeding 49:137–146\n\nGoogle Scholar\n\n  * Klingberg F, Hinz B, White ES (2013) The myofibroblast matrix: implications for tissue repair and fibrosis. J Pathol 229:298–309. https://doi.org/10.1002/path.4104\n\nArticle  CAS  Google Scholar\n\n  * Kochzius M, Nolte M, Weber H, Silkenbeumer N, Hjorleifsdottir S, Hreggvidsson GO, Marteinsson V, Kappel K, Planes S, Tinti F, Magoulas A, Vazquez EG, Turan C, Hervet C, Falgueras DC, Antoniou A, Landi M, Blohm D (2008) DNA microarrays for identifying fishes. Mar Biotechnol 10:207–217. https://doi.org/10.1007/s10126-007-9068-3\n\nArticle  CAS  Google Scholar\n\n  * Kochzius M, Seidel C, Antoniou A, Botla SK, Campo D, Cariani A, Vazquez EG, Hauschild J, Hervet C, Hjorleifsdottir S, Hreggvidsson G, Kappel K, Landi M, Magoulas A, Marteinsson V, Nolte M, Planes S, Tinti F, Turan C, Venugopal MN, Weber H, Blohm D (2010) Identifying fishes through DNA barcodes and microarrays. Plos One 5(9):e12620. https://doi.org/10.1371/journal.pone.0012620\n\n  * Krummel TM, Michna BA, Thomas BL, Sporn MB, Nelson JM, Salzberg AM, Cohen IK, Diegelmann RF (1988) Transforming growth factor-beta (Tgf-Beta) induces fibrosis in a fetal wound model. J Pediatr Surg 23:647–652. https://doi.org/10.1016/S0022-3468(88)80638-9\n\nArticle  CAS  Google Scholar\n\n  * Lai YS, Chiou PP, Chen WJ, Chen YC, Chen CW, Chiu IS, Chen SD, Cheng YH, Chang CY (2008) Characterization of apoptosis induced by grouper iridovirus in two newly established cell lines from barramundi, _Lates calcarifer_ (Bloch). J Fish Dis 31:825–834. https://doi.org/10.1111/j.1365-2761.2008.00957.x\n\nArticle  CAS  Google Scholar\n\n  * Leask A, Parapuram SK, Shi-Wen X, Abraham DJ (2009) Connective tissue growth factor (CTGF, CCN2) gene regulation: a potent clinical bio-marker of fibroproliferative disease? J Cell Commun Signal 3:89–94. https://doi.org/10.1007/s12079-009-0037-7\n\nArticle  Google Scholar\n\n  * Lin F, Lin JL, Liu X, Yuan YY, Liu GQ, Ye XK (2022) Effects of temperature on muscle growth and collagen deposition in zebrafish (Danio rerio). Aquacult Rep 22:100952 https://doi.org/10.1016/j.aqrep.2021.100952\n\n  * Listrat A, Lebret B, Louveau I, Astruc T, Bonnet M, Lefaucheur L, Picard B, Bugeon J (2016) How muscle structure and composition influence meat and flesh quality. Sci World J 2016:ID3182746. https://doi.org/10.1155/2016/3182746\n\n  * Liu D, Black BL, Derynck R (2001) TGF-beta inhibits muscle differentiation through functional repression of myogenic transcription factors by Smad3. Genes Dev 15:2950–2966. https://doi.org/10.1101/gad.925901\n\nArticle  CAS  Google Scholar\n\n  * Livak KJ, Schmittgen TD (2001) Analysis of relative gene expression data using real-time quantitative PCR and the 2(-Delta Delta C(T)) Method. Methods 25:402–408. https://doi.org/10.1006/meth.2001.1262\n\nArticle  CAS  Google Scholar\n\n  * Mann CJ, Perdiguero E, Kharraz Y, Aguilar S, Pessina P, Serrano AL, Muñoz-Cánoves P (2011) Aberrant repair and fibrosis development in skeletal muscle. Skeletal Muscle 1:21. https://doi.org/10.1186/2044-5040-1-21\n\nArticle  Google Scholar\n\n  * Middlebrooks BL, Stout DL, Ellender RD, Safford S (1981) Fish cell lines: two new cell lines derived from explants of trunk musculature of _Cynoscion arenarius_. In Vitro 17:427–430. https://doi.org/10.1007/BF02626743\n\nArticle  Google Scholar\n\n  * Montserrat N, Capilla E, Navarro I, Gutiérrez J (2012) Metabolic effects of insulin and IGFs on gilthead sea bream ( _Sparus aurata_ ) muscle cells. Front Endocrinol 3:55. https://doi.org/10.3389/fendo.2012.00055\n\nArticle  Google Scholar\n\n  * Munday JS, Perrott MR, Symonds JE, Walker SP, Lovett B, Preece MA, Davie PS (2016) Unilateral perivertebral fibrosis associated with lordosis, kyphosis and scoliosis (LKS) in farmed Chinook salmon in New Zealand. Dis Aquat Organ 121:211–221. https://doi.org/10.3354/dao03056\n\nArticle  Google Scholar\n\n  * Nassari S, Duprez D, Fournier-Thibault C (2017) Non-myogenic contribution to muscle development and homeostasis: the role of connective tissues. Front Cell Dev Biol 5. Article 22.https://doi.org/10.3389/fcell.2017.00022\n\n  * Negatu Z, Meier AH (1995) In vitro incorporation of [14C] glycine into muscle protein of gulf killifish ( _Fundulus grandis_ ) in response to insulin-like growth factor-I. Gen Comp Endocrinol 98:193–201. https://doi.org/10.1006/gcen.1995.1060\n\nArticle  CAS  Google Scholar\n\n  * Olesen I, Gjedrem T, Bentsen HB, Gjerde B, Rye M (2003) Breeding programs for sustainable aquaculture. J Appl Aquacult 13:179–204. https://doi.org/10.1300/J028v13n03_01\n\nArticle  Google Scholar\n\n  * Parsons DM, Sim-Smith CJ, Cryer M, Francis MP, Hartill B, Jones EG, Le Port A, Lowe M, McKenzie J, Morrison M, Paul LJ, Radford C, Ross PM, Spong KT, Trnski T, Usmar N, Walsh C, Zeldis J (2014) Snapper ( _Chrysophrys auratus_ ): a review of life history and key vulnerabilities in New Zealand. N Z J Mar Freshwat Res 48:256–283. https://doi.org/10.1080/00288330.2014.892013\n\nArticle  Google Scholar\n\n  * Paylor B, Natarajan A, Zhang R-H, Rossi F (2011) Chapter six - nonmyogenic cells in skeletal muscle regeneration. In Pavlath GK (ed) Current topics in developmental biology. Academic Press, pp 139–165. https://doi.org/10.1016/B978-0-12-385940-2.00006-1\n\n  * Peng LM, Zheng Y, You F, Wu ZH, Tan X, Jiao S, Zhang PJ (2016) Comparison of growth characteristics between skeletal muscle satellite cell lines from diploid and triploid olive flounder _Paralichthys olivaceus_. PeerJ 4:e1519. https://doi.org/10.7717/peerj.1519\n\nArticle  CAS  Google Scholar\n\n  * Potter G, Smith AST, Vo NTK, Muster J, Weston W, Bertero A, Maves L, Mack DL, Rostain A (2020) A more open approach is needed to develop cell-based fish technology: it starts with zebrafish. One Earth 3:54–64. https://doi.org/10.1016/j.oneear.2020.06.005\n\nArticle  Google Scholar\n\n  * Rius-Francino M, Acerete L, Jiménez-Amilburu V, Capilla E, Navarro I, Gutiérrez J (2011) Differential effects on proliferation of GH and IGFs in sea bream ( _Sparus aurata_ ) cultured myocytes. Gen Comp Endocrinol 172:44–49. https://doi.org/10.1016/j.ygcen.2011.03.024\n\nArticle  CAS  Google Scholar\n\n  * Rougee L, Ostrander GK, Richmond RH, Lu Y (2007) Establishment, characterization, and viral susceptibility of two cell lines derived from goldfish _Carassius auratus_ muscle and swim bladder. Dis Aquat Organ 77:127–135. https://doi.org/10.3354/dao01802\n\nArticle  Google Scholar\n\n  * Rubenstein AB, Smith GR, Raue U, Begue G, Minchev K, Ruf-Zamojski F, Nair VD, Wang X, Zhou L, Zaslavsky E, Trappe TA, Trappe S, Sealfon SC (2020) Single-cell transcriptional profiles in human skeletal muscle. Sci Reps 10:229. https://doi.org/10.1038/s41598-019-57110-6\n\nArticle  CAS  Google Scholar\n\n  * Rubio N, Datar I, Stachura D, Kaplan D, Krueger K (2019) Cell-based fish: a novel approach to seafood production and an opportunity for cellular agriculture. Front Sustain Food Sys 3:43. https://doi.org/10.3389/fsufs.2019.00043\n\n  * Ruparelia AA, Ratnayake D, Currie PD (2020) Stem cells in skeletal muscle growth and regeneration in amniotes and teleosts: Emerging themes. WIREs Dev Biol 9:e365. https://doi.org/10.1002/wdev.365\n\n  * Sandoval-Castillo J, Beheregaray LB, Wellenreuther M (2022) Genomic prediction of growth in a commercially, recreationally, and culturally important marine resource, the Australian snapper ( _Chrysophrys auratus_ ). G3 (Bethesda) 12(3). https://doi.org/10.1093/g3journal/jkac015\n\n  * Shefer G, Wleklinski-Lee M, Yablonka-Reuveni Z (2004) Skeletal muscle satellite cells can spontaneously enter, an alternative mesenchymal pathway. J Cell Sci 117:5393–5404. https://doi.org/10.1242/jcs.01419\n\nArticle  CAS  Google Scholar\n\n  * Sultan SHA, Dyer C, Knight RD (2021) Notch signaling regulates muscle stem cell homeostasis and regeneration in a teleost fish. Front Cell Dev Biol 9:726281 https://doi.org/10.3389/fcell.2021.726281\n\n  * Syverud BC, VanDusen KW, Larkin LM (2016) Growth factors for skeletal muscle tissue engineering. Cells Tissues Organs 202:169–179. https://doi.org/10.1159/000444671\n\nArticle  CAS  Google Scholar\n\n  * Tsai C-C, Wu S-B, Kau H-C, Wei Y-H (2018) Essential role of connective tissue growth factor (CTGF) in transforming growth factor-β1 (TGF-β1)-induced myofibroblast transdifferentiation from Graves’ orbital fibroblasts. Sci Reps 8:7276. https://doi.org/10.1038/s41598-018-25370-3\n\nArticle  CAS  Google Scholar\n\n  * Uezumi A, Ito T, Morikawa D, Shimizu N, Yoneda T, Segawa M, Yamaguchi M, Ogawa R, Matev MM, Miyagoe-Suzuki Y (2011) Fibrosis and adipogenesis originate from a common mesenchymal progenitor in skeletal muscle. J Cell Sci 124:3654–3664. https://doi.org/10.1242/jcs.086629\n\nArticle  CAS  Google Scholar\n\n  * Velez EJ, Lutfi E, Azizi S, Perello M, Salmeron C, Riera-Codina M, Ibarz A, Fernandez-Borras J, Blasco J, Capilla E, Navarro I, Gutierrez J (2017) Understanding fish muscle growth regulation to optimize aquaculture production. Aquaculture 467:28–40. https://doi.org/10.1016/j.aquaculture.2016.07.004\n\nArticle  Google Scholar\n\n  * Vélez EJ, Lutfi E, Jiménez-Amilburu V, Riera-Codina M, Capilla E, Navarro I, Gutiérrez J (2014) IGF-I and amino acids effects through TOR signaling on proliferation and differentiation of gilthead sea bream cultured myocytes. Gen Comp Endocrinol 205:296–304. https://doi.org/10.1016/j.ygcen.2014.05.024\n\nArticle  CAS  Google Scholar\n\n  * Wang G, LaPatra S, Zeng L, Zhao Z, Lu Y (2003) Establishment, growth, cryopreservation and species of origin identification of three cell lines from white sturgeon, _Acipenser transmontanus_. Methods Cell Sci 25:211–220. https://doi.org/10.1007/s11022-004-9120-x\n\nArticle  Google Scholar\n\n  * Wang L, Cao Z, Liu Y, Xiang Y, Sun Y, Zhou Y, Wang S, Guo W (2020) Establishment and characterization of a new cell line from the muscle of humpback grouper ( _Cromileptes altivelis_ ). Fish Physiol Biochem 46:1897–1907. https://doi.org/10.1007/s10695-020-00841-5\n\nArticle  CAS  Google Scholar\n\n  * Wellenreuther M, Le Luyer J, Cook D, Ritchie PA, Bernatchez L (2019) Domestication and temperature modulate gene expression signatures and growth in the Australasian Snapper _Chrysophrys auratus_. G3 (Bethesda) 9:105–116. https://doi.org/10.1534/g3.118.200647\n\nArticle  CAS  Google Scholar\n\n  * Wu Y, Zhang X, Salmon M, Lin X, Zehner ZE (2007) TGFbeta1 regulation of vimentin gene expression during differentiation of the C2C12 skeletal myogenic cell line requires Smads, AP-1 and Sp1 family members. Biochim Biophys Acta 1773:427–439. https://doi.org/10.1016/j.bbamcr.2006.11.017\n\nArticle  CAS  Google Scholar\n\n  * Zhao Z, Lu Y (2006) Establishment and characterization of two cell lines from bluefin trevally _Caranx melampygus_. Dis Aquat Organ 68:91–100. https://doi.org/10.3354/dao068091\n\nArticle  CAS  Google Scholar\n\n  * Zhao Z, Montgomery-Brock D, Lee CS, Lu Y (2003) Establishment, characterization and viral susceptibility of 3 new cell lines from snakehead, _Channa striatus_ (Blooch). Methods Cell Sci 25:155–166. https://doi.org/10.1007/s11022-004-3804-0\n\nArticle  Google Scholar\n\n  * Zimmerman AM, Lowery MS (1999) Hyperplastic development and hypertrophic growth of muscle fibers in the white seabass ( _Atractoscion nobilis_ ). J Exp Zool 284:299–308. https://doi.org/10.1002/(sici)1097-010x(19990801)284:3%3c299::aid-jez7%3e3.0.co;2-6\n\nArticle  CAS  Google Scholar\n\nDownload references\n\n## Acknowledgements\n\nWe would like to acknowledge all the staff at PFR’s finfish facility who have\nassisted us during this research. We would also like to acknowledge Dr Michael\nAlgie for constructive comments on the manuscript.\n\n## Funding\n\nOpen Access funding enabled and organized by CAUL and its Member Institutions.\nThis work was supported by a Royal Society of New Zealand Catalyst Seeding\nFund and a Ministry of Business, Innovation and Employment Smart Idea\n(C11X1906) fund awarded to GD.\n\n## Author information\n\n### Authors and Affiliations\n\n  1. The New Zealand Institute for Plant and Food Research Ltd, Nelson Research Centre, 293 Akersten Street, Nelson, 7010, New Zealand\n\nGavril L. W. Chong, Björn Böhmert & Georgina C. Dowd\n\n  2. Faculty of Science, University of the Fraser Valley, Abbotsford, BC, V2S 7M8, Canada\n\nLucy E. J. Lee\n\n  3. Department of Biology, University of Waterloo, Waterloo, ON, N2L 3G1, Canada\n\nNiels C. Bols\n\nAuthors\n\n  1. Gavril L. W. Chong\n\nView author publications\n\nYou can also search for this author in PubMed Google Scholar\n\n  2. Björn Böhmert\n\nView author publications\n\nYou can also search for this author in PubMed Google Scholar\n\n  3. Lucy E. J. Lee\n\nView author publications\n\nYou can also search for this author in PubMed Google Scholar\n\n  4. Niels C. Bols\n\nView author publications\n\nYou can also search for this author in PubMed Google Scholar\n\n  5. Georgina C. Dowd\n\nView author publications\n\nYou can also search for this author in PubMed Google Scholar\n\n### Corresponding author\n\nCorrespondence to Georgina C. Dowd.\n\n## Ethics declarations\n\n### Conflict of interest\n\nThe authors declare no competing interests.\n\n## Additional information\n\nEditor: J Denry Sato\n\n## Supplementary Information\n\nBelow is the link to the electronic supplementary material.\n\n### Supplementary file1 (JPG 327 KB)\n\n### Supplementary file2 (JPG 439 KB)\n\n### Supplementary file3 (JPG 765 KB)\n\n## Rights and permissions\n\n**Open Access** This article is licensed under a Creative Commons Attribution\n4.0 International License, which permits use, sharing, adaptation,\ndistribution and reproduction in any medium or format, as long as you give\nappropriate credit to the original author(s) and the source, provide a link to\nthe Creative Commons licence, and indicate if changes were made. The images or\nother third party material in this article are included in the article's\nCreative Commons licence, unless indicated otherwise in a credit line to the\nmaterial. If material is not included in the article's Creative Commons\nlicence and your intended use is not permitted by statutory regulation or\nexceeds the permitted use, you will need to obtain permission directly from\nthe copyright holder. To view a copy of this licence, visit\nhttp://creativecommons.org/licenses/by/4.0/.\n\nReprints and permissions\n\n## About this article\n\n### Cite this article\n\nChong, G.L.W., Böhmert, B., Lee, L.E.J. _et al._ A continuous myofibroblast\nprecursor cell line from the tail muscle of Australasian snapper (\n_Chrysophrys auratus_ ) that responds to transforming growth factor beta and\nfibroblast growth factor. _In Vitro Cell.Dev.Biol.-Animal_ **58** , 922–935\n(2022). https://doi.org/10.1007/s11626-022-00734-2\n\nDownload citation\n\n  * Received: 20 September 2022\n\n  * Accepted: 27 October 2022\n\n  * Published: 15 November 2022\n\n  * Issue Date: December 2022\n\n  * DOI: https://doi.org/10.1007/s11626-022-00734-2\n\n### Share this article\n\nAnyone you share the following link with will be able to read this content:\n\nGet shareable link\n\nSorry, a shareable link is not currently available for this article.\n\nCopy to clipboard\n\nProvided by the Springer Nature SharedIt content-sharing initiative\n\n### Keywords\n\n  * Australasian snapper\n  * _Chrysophrys auratus_\n  * _Pagrus auratus_\n  * Cell line\n  * Growth factors\n  * Myofibroblast\n  * Actin bundling\n  * Collagen\n  * Extracellular matrix\n  * Mesenchymal stem cells\n\nUse our pre-submission checklist\n\nAvoid common mistakes on your manuscript.\n\n  * Sections\n  * Figures\n  * References\n\n  * Abstract \n  * Introduction\n  * Materials and methods\n  * Results\n  * Discussion\n  * References \n  * Acknowledgements\n  * Funding\n  * Author information\n  * Ethics declarations\n  * Additional information\n  * Supplementary Information\n  * Rights and permissions\n  * About this article\n\nAdvertisement\n\n  * **Figure 1.**\n\nView in articleFull size image\n\n  *  **Figure 2.**\n\nView in articleFull size image\n\n  *  **Figure 3.**\n\nView in articleFull size image\n\n  *  **Figure 4.**\n\nView in articleFull size image\n\n  *  **Figure 5.**\n\nView in articleFull size image\n\n  *  **Figure 6.**\n\nView in articleFull size image\n\n  1. Arana S, Alves VAF, Sabino M, Tabata YA, Nonogaki S, Zaidan-Dagli ML, Hernandez-Blazquez FJ (2014) Immunohistochemical evidence for myofibroblast-like cells associated with liver injury induced by Aflatoxin B1 in rainbow trout (Oncorhynchus mykiss). J Comp Pathol 150:258–265. https://doi.org/10.1016/j.jcpa.2013.07.003\n\nArticle CAS  Google Scholar\n\n  2. Ashton DT, Hilario E, Jaksons P, Ritchie PA, Wellenreuther M (2019) Genetic diversity and heritability of economically important traits in captive Australasian snapper ( _Chrysophrys auratus_ ). Aquaculture 505:190–198. https://doi.org/10.1016/j.aquaculture.2019.02.034\n\nArticle  Google Scholar\n\n  3. Bols NC, Lee LEJ (1994) Cell lines: availability, propagation and isolation. In: Hochachka PW, Mommsen TP (eds) Biochemistry and molecular biology of fishes. Elsevier Science Publishers, pp 145–159. https://doi.org/10.1016/B978-0-444-82033-4.50019-2\n\n  4. Bols NC, Mosser DD, Steels GB (1992) Temperature studies and recent advances with fish cells in vitro. Comp Biochem Phys A 103:1–14. https://doi.org/10.1016/0300-9629(92)90235-I\n\nArticle  Google Scholar\n\n  5. Bols NC, Pham PH, Dayeh VR, Lee LEJ (2017) Invitromatics, invitrome, and invitroomics: introduction of three new terms for in vitro biology and illustration of their use with the cell lines from rainbow trout. In Vitro Cell Dev Biol Anim 53:383–405. https://doi.org/10.1007/s11626-017-0142-5\n\nArticle CAS  Google Scholar\n\n  6. Bricard Y, Ralliere C, Lebret V, Lefevre F, Rescan PY (2014) Early fish myoseptal cells: insights from the trout and relationships with amniote axial tenocytes. Plos One 9(3):e91876\n\n  7. Castillo J, Codina M, Martinez ML, Navarro I, Gutierrez J (2004) Metabolic and mitogenic effects of IGF-I and insulin on muscle cells of rainbow trout. Am J Physiol Regul Integr Comp Physiol 286:R935–941. https://doi.org/10.1152/ajpregu.00459.2003\n\nArticle CAS  Google Scholar\n\n  8. Cellosaurus (2022) A knowledge resource on cell lines. Available via https://web.expasy.org/cellosaurus/. Accessed 01 Sept 2022\n\n  9. Charvet B, Malbouyres M, Pagnon-Minot A, Ruggiero F, Le Guellec D (2011) Development of the zebrafish myoseptum with emphasis on the myotendinous junction. Cell Tissue Res 346:439–449. https://doi.org/10.1007/s00441-011-1266-7\n\nArticle CAS  Google Scholar\n\n  10. Codina M, Garcia de la serrana D, Sanchez-Gurmaches J, Montserrat N, Chistyakova O, Navarro I, Gutierrez J (2008) Metabolic and mitogenic effects of IGF-II in rainbow trout ( _Oncorhynchus mykiss_ ) myocytes in culture and the role of IGF-II in the PI3K/Akt and MAPK signalling pathways. Gen Comp Endocrinol 157:116–124. https://doi.org/10.1016/j.ygcen.2008.04.009\n\nArticle CAS  Google Scholar\n\n  11. Cottle BJ, Lewis FC, Shone V, Ellison-Hughes GM (2017) Skeletal muscle-derived interstitial progenitor cells (PICs) display stem cell properties, being clonogenic, self-renewing, and multi-potent in vitro and in vivo. Stem Cell Res Ther 8(158). https://doi.org/10.1186/s13287-017-0612-4\n\n  12. Csapo R, Gumpenberger M, Wessner B (2020) Skeletal muscle extracellular matrix - what do we know about its composition, regulation, and physiological roles? A Narrative Review Front Physiol 11:253. https://doi.org/10.3389/fphys.2020.00253\n\nArticle  Google Scholar\n\n  13. Dayton WR, Hathaway MR (1991) Myogenic cell-proliferation and differentiation. Poult Sci 70:1815–1822. https://doi.org/10.3382/ps.0701815\n\nArticle CAS  Google Scholar\n\n  14. Desmoulière A, Geinoz A, Gabbiani F, Gabbiani G (1993) Transforming growth factor-beta 1 induces alpha-smooth muscle actin expression in granulation tissue myofibroblasts and in quiescent and growing cultured fibroblasts. J Cell Biol 122:103–111. https://doi.org/10.1083/jcb.122.1.103\n\nArticle  Google Scholar\n\n  15. Díaz M, Vraskou Y, Gutiérrez J, Planas JV (2009) Expression of rainbow trout glucose transporters GLUT1 and GLUT4 during in vitro muscle cell differentiation and regulation by insulin and IGF-I. Am J Physiol Regul Integr Comp Physiol 296:R794–R800. https://doi.org/10.1152/ajpregu.90673.2008\n\nArticle CAS  Google Scholar\n\n  16. Duran BOS, Zanella BTT, Perez ES, Mareco EA, Blasco J, Dal-Pai-Silva M, de la Serrana DG (2022) Amino acids and IGF1 regulation of fish muscle growth revealed by transcriptome and micrornaome integrative analyses of Pacu (Piaractus mesopotamicus) Myotubes. Int J Mol Sci 23(3):1180. https://doi.org/10.3390/ijms23031180\n\n  17. Fernandez RD, Yoshimizu M, Ezura Y, Kimura T, Fernandez RD, Mamoru Y, Yoshio E, Takahisa K, Fenandez RD (1993) Comparative growth response of fish cell lines in different media, temperatures, and sodium chloride concentrations. Gyobyo Kenkyu 28:27–34. https://doi.org/10.3147/jsfp.28.27\n\nArticle  Google Scholar\n\n  18. FishBase (2022) http://www.fishbase.org. Cited 01 September 2022\n\n  19. Floss T, Arnold HH, Braun T (1997) A role for FGF-6 in skeletal muscle regeneration. Genes Dev 11:2040–2051. https://doi.org/10.1101/gad.11.16.2040\n\nArticle CAS  Google Scholar\n\n  20. Fox JC, Swain JL (1993) Auto and transactivation of Fgf expression - potential mechanism for regulation of myogenic differentiation. In Vitro Cell Dev-An 29a:228–230. https://doi.org/10.1007/BF02634188\n\nArticle CAS  Google Scholar\n\n  21. Frangogiannis N (2020) Transforming growth factor-β in tissue fibrosis. J Exp Med 217:e20190103. https://doi.org/10.1084/jem.20190103\n\nArticle  Google Scholar\n\n  22. Gabillard JC, Sabin N, Paboeuf G (2010) In vitro characterization of proliferation and differentiation of trout satellite cells. Cell Tissue Res 342:471–477. https://doi.org/10.1007/s00441-010-1071-8\n\nArticle  Google Scholar\n\n  23. Gignac SJ, Vo NTK, Mikhaeil MS, Alexander JAN, MacLatchy DL, Schulte PM, Lee LEJ (2014) Derivation of a continuous myogenic cell culture from an embryo of common killifish, _Fundulus heteroclitus_. Comp Biochem Physiol A Mol Integr Physiol 175:15–27. https://doi.org/10.1016/j.cbpa.2014.05.002\n\nArticle CAS  Google Scholar\n\n  24. Giordani L, He GJ, Negroni E, Sakai H, Law JYC, Siu MM, Wan R, Corneau A, Tajbakhsh S, Cheung TH, Le Grand F (2019) High-dimensional single-cell cartography reveals novel skeletal muscle-resident cell populations. Mol Cell 74:609-621.e606. https://doi.org/10.1016/j.molcel.2019.02.026\n\nArticle CAS  Google Scholar\n\n  25. Grande JP, Melder DC, Zinsmeister AR (1997) Modulation of collagen gene expression by cytokines: stimulatory effect of transforming growth factor-beta1, with divergent effects of epidermal growth factor and tumor necrosis factor-alpha on collagen type I and collagen type IV. J Lab Clin Med 130:476–486. https://doi.org/10.1016/s0022-2143(97)90124-4\n\nArticle CAS  Google Scholar\n\n  26. Heredia JE, Mukundan L, Chen FM, Mueller AA, Deo RC, Locksley RM, Rando TA, Chawla A (2013) Type 2 innate signals stimulate fibro/adipogenic progenitors to facilitate muscle regeneration. Cell 153:376–388. https://doi.org/10.1016/j.cell.2013.02.053\n\nArticle CAS  Google Scholar\n\n  27. Honda E, Munakata H (2004) Purification and characterization of decorin from the culture media of MRC-5 cells. Int J Biochem Cell Biol 36:1635–1644. https://doi.org/10.1016/j.biocel.2004.01.023\n\nArticle CAS  Google Scholar\n\n  28. Ignotz RA, Massagué J (1986) Transforming growth factor-beta stimulates the expression of fibronectin and collagen and their incorporation into the extracellular matrix. J Biol Chem 261:4337–4345. https://doi.org/10.1016/S0021-9258(17)35666-1\n\nArticle CAS  Google Scholar\n\n  29. Joe AWB, Yi L, Natarajan A, Le Grand F, So L, Wang J, Rudnicki MA, Rossi FMV (2010) Muscle injury activates resident fibro/adipogenic progenitors that facilitate myogenesis. Nat Cell Biol 12:153–163. https://doi.org/10.1038/ncb2015\n\nArticle CAS  Google Scholar\n\n  30. Johnston EF, Gillis TE (2018) Transforming growth factor-beta1 induces differentiation of rainbow trout (Oncorhynchus mykiss) cardiac fibroblasts into myofibroblasts. J Exp Biol 221(24):jeb189167. https://doi.org/10.1242/jeb.189167\n\n  31. Johnston IA (2006) Environment and plasticity of myogenesis in teleost fish. J Exp Biol 209:2249–2264. https://doi.org/10.1242/jeb.02153\n\nArticle CAS  Google Scholar\n\n  32. Kastner S, Elias MC, Rivera AJ, Yablonka-Reuveni Z (2000) Gene expression patterns of the fibroblast growth factors and their receptors during myogenesis of rat satellite cells. J Histochem Cytochem 48:1079–1096. https://doi.org/10.1177/002215540004800805\n\nArticle CAS  Google Scholar\n\n  33. Keen AN, Fenna AJ, McConnell JC, Sherratt MJ, Gardner P, Shiels HA (2015) The dynamic nature of hypertrophic and fibrotic remodeling of the fish ventricle. Front Physiol 6:427. https://doi.org/10.3389/fphys.2015.00427\n\nArticle  Google Scholar\n\n  34. Kiessling A, Ruohonen K, Bjørnevik M (2006) Muscle fibre growth and quality in fish. Archives of Animal Breeding 49:137–146\n\nGoogle Scholar\n\n  35. Klingberg F, Hinz B, White ES (2013) The myofibroblast matrix: implications for tissue repair and fibrosis. J Pathol 229:298–309. https://doi.org/10.1002/path.4104\n\nArticle CAS  Google Scholar\n\n  36. Kochzius M, Nolte M, Weber H, Silkenbeumer N, Hjorleifsdottir S, Hreggvidsson GO, Marteinsson V, Kappel K, Planes S, Tinti F, Magoulas A, Vazquez EG, Turan C, Hervet C, Falgueras DC, Antoniou A, Landi M, Blohm D (2008) DNA microarrays for identifying fishes. Mar Biotechnol 10:207–217. https://doi.org/10.1007/s10126-007-9068-3\n\nArticle CAS  Google Scholar\n\n  37. Kochzius M, Seidel C, Antoniou A, Botla SK, Campo D, Cariani A, Vazquez EG, Hauschild J, Hervet C, Hjorleifsdottir S, Hreggvidsson G, Kappel K, Landi M, Magoulas A, Marteinsson V, Nolte M, Planes S, Tinti F, Turan C, Venugopal MN, Weber H, Blohm D (2010) Identifying fishes through DNA barcodes and microarrays. Plos One 5(9):e12620. https://doi.org/10.1371/journal.pone.0012620\n\n  38. Krummel TM, Michna BA, Thomas BL, Sporn MB, Nelson JM, Salzberg AM, Cohen IK, Diegelmann RF (1988) Transforming growth factor-beta (Tgf-Beta) induces fibrosis in a fetal wound model. J Pediatr Surg 23:647–652. https://doi.org/10.1016/S0022-3468(88)80638-9\n\nArticle CAS  Google Scholar\n\n  39. Lai YS, Chiou PP, Chen WJ, Chen YC, Chen CW, Chiu IS, Chen SD, Cheng YH, Chang CY (2008) Characterization of apoptosis induced by grouper iridovirus in two newly established cell lines from barramundi, _Lates calcarifer_ (Bloch). J Fish Dis 31:825–834. https://doi.org/10.1111/j.1365-2761.2008.00957.x\n\nArticle CAS  Google Scholar\n\n  40. Leask A, Parapuram SK, Shi-Wen X, Abraham DJ (2009) Connective tissue growth factor (CTGF, CCN2) gene regulation: a potent clinical bio-marker of fibroproliferative disease? J Cell Commun Signal 3:89–94. https://doi.org/10.1007/s12079-009-0037-7\n\nArticle  Google Scholar\n\n  41. Lin F, Lin JL, Liu X, Yuan YY, Liu GQ, Ye XK (2022) Effects of temperature on muscle growth and collagen deposition in zebrafish (Danio rerio). Aquacult Rep 22:100952 https://doi.org/10.1016/j.aqrep.2021.100952\n\n  42. Listrat A, Lebret B, Louveau I, Astruc T, Bonnet M, Lefaucheur L, Picard B, Bugeon J (2016) How muscle structure and composition influence meat and flesh quality. Sci World J 2016:ID3182746. https://doi.org/10.1155/2016/3182746\n\n  43. Liu D, Black BL, Derynck R (2001) TGF-beta inhibits muscle differentiation through functional repression of myogenic transcription factors by Smad3. Genes Dev 15:2950–2966. https://doi.org/10.1101/gad.925901\n\nArticle CAS  Google Scholar\n\n  44. Livak KJ, Schmittgen TD (2001) Analysis of relative gene expression data using real-time quantitative PCR and the 2(-Delta Delta C(T)) Method. Methods 25:402–408. https://doi.org/10.1006/meth.2001.1262\n\nArticle CAS  Google Scholar\n\n  45. Mann CJ, Perdiguero E, Kharraz Y, Aguilar S, Pessina P, Serrano AL, Muñoz-Cánoves P (2011) Aberrant repair and fibrosis development in skeletal muscle. Skeletal Muscle 1:21. https://doi.org/10.1186/2044-5040-1-21\n\nArticle  Google Scholar\n\n  46. Middlebrooks BL, Stout DL, Ellender RD, Safford S (1981) Fish cell lines: two new cell lines derived from explants of trunk musculature of _Cynoscion arenarius_. In Vitro 17:427–430. https://doi.org/10.1007/BF02626743\n\nArticle  Google Scholar\n\n  47. Montserrat N, Capilla E, Navarro I, Gutiérrez J (2012) Metabolic effects of insulin and IGFs on gilthead sea bream ( _Sparus aurata_ ) muscle cells. Front Endocrinol 3:55. https://doi.org/10.3389/fendo.2012.00055\n\nArticle  Google Scholar\n\n  48. Munday JS, Perrott MR, Symonds JE, Walker SP, Lovett B, Preece MA, Davie PS (2016) Unilateral perivertebral fibrosis associated with lordosis, kyphosis and scoliosis (LKS) in farmed Chinook salmon in New Zealand. Dis Aquat Organ 121:211–221. https://doi.org/10.3354/dao03056\n\nArticle  Google Scholar\n\n  49. Nassari S, Duprez D, Fournier-Thibault C (2017) Non-myogenic contribution to muscle development and homeostasis: the role of connective tissues. Front Cell Dev Biol 5. Article 22.https://doi.org/10.3389/fcell.2017.00022\n\n  50. Negatu Z, Meier AH (1995) In vitro incorporation of [14C] glycine into muscle protein of gulf killifish ( _Fundulus grandis_ ) in response to insulin-like growth factor-I. Gen Comp Endocrinol 98:193–201. https://doi.org/10.1006/gcen.1995.1060\n\nArticle CAS  Google Scholar\n\n  51. Olesen I, Gjedrem T, Bentsen HB, Gjerde B, Rye M (2003) Breeding programs for sustainable aquaculture. J Appl Aquacult 13:179–204. https://doi.org/10.1300/J028v13n03_01\n\nArticle  Google Scholar\n\n  52. Parsons DM, Sim-Smith CJ, Cryer M, Francis MP, Hartill B, Jones EG, Le Port A, Lowe M, McKenzie J, Morrison M, Paul LJ, Radford C, Ross PM, Spong KT, Trnski T, Usmar N, Walsh C, Zeldis J (2014) Snapper ( _Chrysophrys auratus_ ): a review of life history and key vulnerabilities in New Zealand. N Z J Mar Freshwat Res 48:256–283. https://doi.org/10.1080/00288330.2014.892013\n\nArticle  Google Scholar\n\n  53. Paylor B, Natarajan A, Zhang R-H, Rossi F (2011) Chapter six - nonmyogenic cells in skeletal muscle regeneration. In Pavlath GK (ed) Current topics in developmental biology. Academic Press, pp 139–165. https://doi.org/10.1016/B978-0-12-385940-2.00006-1\n\n  54. Peng LM, Zheng Y, You F, Wu ZH, Tan X, Jiao S, Zhang PJ (2016) Comparison of growth characteristics between skeletal muscle satellite cell lines from diploid and triploid olive flounder _Paralichthys olivaceus_. PeerJ 4:e1519. https://doi.org/10.7717/peerj.1519\n\nArticle CAS  Google Scholar\n\n  55. Potter G, Smith AST, Vo NTK, Muster J, Weston W, Bertero A, Maves L, Mack DL, Rostain A (2020) A more open approach is needed to develop cell-based fish technology: it starts with zebrafish. One Earth 3:54–64. https://doi.org/10.1016/j.oneear.2020.06.005\n\nArticle  Google Scholar\n\n  56. Rius-Francino M, Acerete L, Jiménez-Amilburu V, Capilla E, Navarro I, Gutiérrez J (2011) Differential effects on proliferation of GH and IGFs in sea bream ( _Sparus aurata_ ) cultured myocytes. Gen Comp Endocrinol 172:44–49. https://doi.org/10.1016/j.ygcen.2011.03.024\n\nArticle CAS  Google Scholar\n\n  57. Rougee L, Ostrander GK, Richmond RH, Lu Y (2007) Establishment, characterization, and viral susceptibility of two cell lines derived from goldfish _Carassius auratus_ muscle and swim bladder. Dis Aquat Organ 77:127–135. https://doi.org/10.3354/dao01802\n\nArticle  Google Scholar\n\n  58. Rubenstein AB, Smith GR, Raue U, Begue G, Minchev K, Ruf-Zamojski F, Nair VD, Wang X, Zhou L, Zaslavsky E, Trappe TA, Trappe S, Sealfon SC (2020) Single-cell transcriptional profiles in human skeletal muscle. Sci Reps 10:229. https://doi.org/10.1038/s41598-019-57110-6\n\nArticle CAS  Google Scholar\n\n  59. Rubio N, Datar I, Stachura D, Kaplan D, Krueger K (2019) Cell-based fish: a novel approach to seafood production and an opportunity for cellular agriculture. Front Sustain Food Sys 3:43. https://doi.org/10.3389/fsufs.2019.00043\n\n  60. Ruparelia AA, Ratnayake D, Currie PD (2020) Stem cells in skeletal muscle growth and regeneration in amniotes and teleosts: Emerging themes. WIREs Dev Biol 9:e365. https://doi.org/10.1002/wdev.365\n\n  61. Sandoval-Castillo J, Beheregaray LB, Wellenreuther M (2022) Genomic prediction of growth in a commercially, recreationally, and culturally important marine resource, the Australian snapper ( _Chrysophrys auratus_ ). G3 (Bethesda) 12(3). https://doi.org/10.1093/g3journal/jkac015\n\n  62. Shefer G, Wleklinski-Lee M, Yablonka-Reuveni Z (2004) Skeletal muscle satellite cells can spontaneously enter, an alternative mesenchymal pathway. J Cell Sci 117:5393–5404. https://doi.org/10.1242/jcs.01419\n\nArticle CAS  Google Scholar\n\n  63. Sultan SHA, Dyer C, Knight RD (2021) Notch signaling regulates muscle stem cell homeostasis and regeneration in a teleost fish. Front Cell Dev Biol 9:726281 https://doi.org/10.3389/fcell.2021.726281\n\n  64. Syverud BC, VanDusen KW, Larkin LM (2016) Growth factors for skeletal muscle tissue engineering. Cells Tissues Organs 202:169–179. https://doi.org/10.1159/000444671\n\nArticle CAS  Google Scholar\n\n  65. Tsai C-C, Wu S-B, Kau H-C, Wei Y-H (2018) Essential role of connective tissue growth factor (CTGF) in transforming growth factor-β1 (TGF-β1)-induced myofibroblast transdifferentiation from Graves’ orbital fibroblasts. Sci Reps 8:7276. https://doi.org/10.1038/s41598-018-25370-3\n\nArticle CAS  Google Scholar\n\n  66. Uezumi A, Ito T, Morikawa D, Shimizu N, Yoneda T, Segawa M, Yamaguchi M, Ogawa R, Matev MM, Miyagoe-Suzuki Y (2011) Fibrosis and adipogenesis originate from a common mesenchymal progenitor in skeletal muscle. J Cell Sci 124:3654–3664. https://doi.org/10.1242/jcs.086629\n\nArticle CAS  Google Scholar\n\n  67. Velez EJ, Lutfi E, Azizi S, Perello M, Salmeron C, Riera-Codina M, Ibarz A, Fernandez-Borras J, Blasco J, Capilla E, Navarro I, Gutierrez J (2017) Understanding fish muscle growth regulation to optimize aquaculture production. Aquaculture 467:28–40. https://doi.org/10.1016/j.aquaculture.2016.07.004\n\nArticle  Google Scholar\n\n  68. Vélez EJ, Lutfi E, Jiménez-Amilburu V, Riera-Codina M, Capilla E, Navarro I, Gutiérrez J (2014) IGF-I and amino acids effects through TOR signaling on proliferation and differentiation of gilthead sea bream cultured myocytes. Gen Comp Endocrinol 205:296–304. https://doi.org/10.1016/j.ygcen.2014.05.024\n\nArticle CAS  Google Scholar\n\n  69. Wang G, LaPatra S, Zeng L, Zhao Z, Lu Y (2003) Establishment, growth, cryopreservation and species of origin identification of three cell lines from white sturgeon, _Acipenser transmontanus_. Methods Cell Sci 25:211–220. https://doi.org/10.1007/s11022-004-9120-x\n\nArticle  Google Scholar\n\n  70. Wang L, Cao Z, Liu Y, Xiang Y, Sun Y, Zhou Y, Wang S, Guo W (2020) Establishment and characterization of a new cell line from the muscle of humpback grouper ( _Cromileptes altivelis_ ). Fish Physiol Biochem 46:1897–1907. https://doi.org/10.1007/s10695-020-00841-5\n\nArticle CAS  Google Scholar\n\n  71. Wellenreuther M, Le Luyer J, Cook D, Ritchie PA, Bernatchez L (2019) Domestication and temperature modulate gene expression signatures and growth in the Australasian Snapper _Chrysophrys auratus_. G3 (Bethesda) 9:105–116. https://doi.org/10.1534/g3.118.200647\n\nArticle CAS  Google Scholar\n\n  72. Wu Y, Zhang X, Salmon M, Lin X, Zehner ZE (2007) TGFbeta1 regulation of vimentin gene expression during differentiation of the C2C12 skeletal myogenic cell line requires Smads, AP-1 and Sp1 family members. Biochim Biophys Acta 1773:427–439. https://doi.org/10.1016/j.bbamcr.2006.11.017\n\nArticle CAS  Google Scholar\n\n  73. Zhao Z, Lu Y (2006) Establishment and characterization of two cell lines from bluefin trevally _Caranx melampygus_. Dis Aquat Organ 68:91–100. https://doi.org/10.3354/dao068091\n\nArticle CAS  Google Scholar\n\n  74. Zhao Z, Montgomery-Brock D, Lee CS, Lu Y (2003) Establishment, characterization and viral susceptibility of 3 new cell lines from snakehead, _Channa striatus_ (Blooch). Methods Cell Sci 25:155–166. https://doi.org/10.1007/s11022-004-3804-0\n\nArticle  Google Scholar\n\n  75. Zimmerman AM, Lowery MS (1999) Hyperplastic development and hypertrophic growth of muscle fibers in the white seabass ( _Atractoscion nobilis_ ). J Exp Zool 284:299–308. https://doi.org/10.1002/(sici)1097-010x(19990801)284:3%3c299::aid-jez7%3e3.0.co;2-6\n\nArticle CAS  Google Scholar\n\n### Discover content\n\n  * Journals A-Z\n  * Books A-Z\n\n### Publish with us\n\n  * Publish your research\n  * Open access publishing\n\n### Products and services\n\n  * Our products\n  * Librarians\n  * Societies\n  * Partners and advertisers\n\n### Our imprints\n\n  * Springer\n  * Nature Portfolio\n  * BMC\n  * Palgrave Macmillan\n  * Apress\n\n  * Your privacy choices/Manage cookies\n  * Your US state privacy rights\n  * Accessibility statement\n  * Terms and conditions\n  * Privacy policy\n  * Help and support\n\n20.109.39.246\n\nNot affiliated\n\n© 2024 Springer Nature\n\n  *[DOI]: Digital Object Identifier\n\n",
    "links": "[{\"link\": \"https://idp.springer.com/auth/personal/springernature?redirect_uri=https://link.springer.com/article/10.1007/s11626-022-00734-2\", \"text\": \"Log in\"}, {\"link\": \"https://link.springer.com/\", \"text\": \"Home\"}, {\"link\": \"https://link.springer.com/journal/11626\", \"text\": \"In Vitro Cellular & Developmental Biology - Animal\"}, {\"link\": \"https://link.springer.com/content/pdf/10.1007/s11626-022-00734-2.pdf\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/journal/11626\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/content/pdf/10.1007/s11626-022-00734-2.pdf\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2/metrics\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR52\", \"text\": \"2014\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR52\", \"text\": \"2014\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR2\", \"text\": \"2019\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR71\", \"text\": \"2019\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR51\", \"text\": \"2003\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR61\", \"text\": \"2022\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR59\", \"text\": \"2019\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR75\", \"text\": \"1999\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR60\", \"text\": \"2020\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR34\", \"text\": \"2006\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR42\", \"text\": \"2016\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR23\", \"text\": \"2014\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR54\", \"text\": \"2016\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR63\", \"text\": \"2021\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR11\", \"text\": \"2017\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR49\", \"text\": \"2017\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR58\", \"text\": \"2020\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR9\", \"text\": \"2011\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR6\", \"text\": \"2014\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR60\", \"text\": \"2020\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR5\", \"text\": \"2017\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR8\", \"text\": \"2022\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR17\", \"text\": \"1993\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR74\", \"text\": \"2003\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR73\", \"text\": \"2006\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR57\", \"text\": \"2007\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR39\", \"text\": \"2008\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR59\", \"text\": \"2019\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR55\", \"text\": \"2020\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR64\", \"text\": \"2016\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR67\", \"text\": \"2017\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR16\", \"text\": \"2022\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR13\", \"text\": \"1991\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR64\", \"text\": \"2016\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR13\", \"text\": \"1991\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR20\", \"text\": \"1993\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR19\", \"text\": \"1997\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR32\", \"text\": \"2000\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR43\", \"text\": \"2001\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR38\", \"text\": \"1988\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR28\", \"text\": \"1986\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR25\", \"text\": \"1997\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR40\", \"text\": \"2009\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR65\", \"text\": \"2018\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR45\", \"text\": \"2011\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR1\", \"text\": \"2014\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR33\", \"text\": \"2015\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR41\", \"text\": \"2022\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR50\", \"text\": \"1995\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR56\", \"text\": \"2011\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR7\", \"text\": \"2004\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR10\", \"text\": \"2008\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR15\", \"text\": \"2009\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR22\", \"text\": \"2010\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR47\", \"text\": \"2012\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR68\", \"text\": \"2014\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#Fig1\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2/figures/1\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2/figures/1\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR2\", \"text\": \"2019\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#Tab1\", \"text\": \"1\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#MOESM2\", \"text\": \"S2\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2/tables/1\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#Fig2\", \"text\": \"2\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2/figures/2\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2/figures/2\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#Tab2\", \"text\": \"2\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#Tab2\", \"text\": \"2\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#Tab2\", \"text\": \"2\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2/tables/2\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR44\", \"text\": \"2001\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#Fig1\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#Fig1\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#Fig1\", \"text\": \"C\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#Fig1\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#Fig1\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#Fig1\", \"text\": \"D\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#Fig1\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#Fig1\", \"text\": \"F\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#Fig1\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#MOESM1\", \"text\": \"S1\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#Fig2\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#Fig2\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#Fig2\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#MOESM3\", \"text\": \"S3\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#Fig2\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#Fig2\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#Fig2\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#Fig3\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#Fig3\", \"text\": \"D\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2/figures/3\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2/figures/3\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#Fig3\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#Fig3\", \"text\": \"G\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#Fig3\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#Fig3\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#Fig3\", \"text\": \"I\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#Fig3\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#Fig3\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#Fig4\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#Fig4\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2/figures/4\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2/figures/4\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#Fig5\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#Fig5\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#Fig5\", \"text\": \"D\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#Fig5\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#Fig5\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#Fig5\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2/figures/5\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2/figures/5\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#Fig6\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#Fig6\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#Fig6\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#Fig6\", \"text\": \"D\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#Fig6\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#Fig6\", \"text\": \"D\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2/figures/6\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2/figures/6\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR46\", \"text\": \"1981\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR74\", \"text\": \"2003\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR73\", \"text\": \"2006\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR39\", \"text\": \"2008\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR70\", \"text\": \"2020\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR29\", \"text\": \"2010\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR66\", \"text\": \"2011\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR26\", \"text\": \"2013\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR24\", \"text\": \"2019\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR12\", \"text\": \"2020\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR31\", \"text\": \"2006\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR60\", \"text\": \"2020\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR62\", \"text\": \"2004\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR4\", \"text\": \"1992\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR4\", \"text\": \"1992\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR52\", \"text\": \"2014\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR71\", \"text\": \"2019\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR3\", \"text\": \"1994\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR74\", \"text\": \"2003\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR73\", \"text\": \"2006\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR57\", \"text\": \"2007\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR70\", \"text\": \"2020\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR17\", \"text\": \"1993\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR69\", \"text\": \"2003\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR73\", \"text\": \"2006\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR59\", \"text\": \"2019\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR53\", \"text\": \"2011\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR27\", \"text\": \"2004\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR35\", \"text\": \"2013\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR21\", \"text\": \"2020\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR14\", \"text\": \"1993\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR72\", \"text\": \"2007\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR30\", \"text\": \"2018\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR51\", \"text\": \"2003\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR48\", \"text\": \"2016\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR1\", \"text\": \"2014\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2#ref-CR30\", \"text\": \"2018\"}, {\"link\": \"https://link.springer.com/articles/cas-redirect/1:CAS:528:DC%2BC3sXhsVKksr7E\", \"text\": \"CAS\"}, {\"link\": \"https://link.springer.com/articles/cas-redirect/1:CAS:528:DC%2BC2sXlsFOisrk%3D\", \"text\": \"CAS\"}, {\"link\": \"https://link.springer.com/articles/cas-redirect/1:CAS:528:DC%2BD2cXkt1enu7k%3D\", \"text\": \"CAS\"}, {\"link\": \"https://link.springer.com/articles/cas-redirect/1:CAS:528:DC%2BC3MXhs1OqsL3O\", \"text\": \"CAS\"}, {\"link\": \"https://link.springer.com/articles/cas-redirect/1:CAS:528:DC%2BD1cXntlWgsbk%3D\", \"text\": \"CAS\"}, {\"link\": \"https://link.springer.com/articles/cas-redirect/1:STN:280:DyaK38%2FitVGrsA%3D%3D\", \"text\": \"CAS\"}, {\"link\": \"https://link.springer.com/articles/cas-redirect/1:CAS:528:DC%2BD1MXjtFGkur0%3D\", \"text\": \"CAS\"}, {\"link\": \"https://link.springer.com/articles/cas-redirect/1:CAS:528:DyaK2sXls1Grtrg%3D\", \"text\": \"CAS\"}, {\"link\": \"https://link.springer.com/articles/cas-redirect/1:CAS:528:DyaK3sXkt1Giurk%3D\", \"text\": \"CAS\"}, {\"link\": \"https://link.springer.com/articles/cas-redirect/1:CAS:528:DC%2BC2cXhtFWgtL7P\", \"text\": \"CAS\"}, {\"link\": \"https://link.springer.com/articles/cas-redirect/1:CAS:528:DC%2BC1MXlvV2qu7o%3D\", \"text\": \"CAS\"}, {\"link\": \"https://link.springer.com/articles/cas-redirect/1:CAS:528:DyaK2sXotVSntbw%3D\", \"text\": \"CAS\"}, {\"link\": \"https://link.springer.com/articles/cas-redirect/1:CAS:528:DC%2BC3sXlvVCnsbY%3D\", \"text\": \"CAS\"}, {\"link\": \"https://link.springer.com/articles/cas-redirect/1:CAS:528:DC%2BD2cXktVeltrg%3D\", \"text\": \"CAS\"}, {\"link\": \"https://link.springer.com/articles/cas-redirect/1:CAS:528:DyaL28Xhs1amur4%3D\", \"text\": \"CAS\"}, {\"link\": \"https://link.springer.com/articles/cas-redirect/1:CAS:528:DC%2BC3cXhtlCqtb4%3D\", \"text\": \"CAS\"}, {\"link\": \"https://link.springer.com/articles/cas-redirect/1:CAS:528:DC%2BD28XnvF2gsrY%3D\", \"text\": \"CAS\"}, {\"link\": \"https://link.springer.com/articles/cas-redirect/1:CAS:528:DC%2BD3cXlsFOlsbk%3D\", \"text\": \"CAS\"}, {\"link\": \"https://link.springer.com/articles/cas-redirect/1:CAS:528:DC%2BC38XhvVClt7nE\", \"text\": \"CAS\"}, {\"link\": \"https://link.springer.com/articles/cas-redirect/1:CAS:528:DC%2BD1cXivFWnsb0%3D\", \"text\": \"CAS\"}, {\"link\": \"https://link.springer.com/articles/cas-redirect/1:STN:280:DyaL1M%2FotV2mtA%3D%3D\", \"text\": \"CAS\"}, {\"link\": \"https://link.springer.com/articles/cas-redirect/1:CAS:528:DC%2BD1cXhtlKrtb7M\", \"text\": \"CAS\"}, {\"link\": \"https://link.springer.com/articles/cas-redirect/1:CAS:528:DC%2BD3MXovVOrtbc%3D\", \"text\": \"CAS\"}, {\"link\": \"https://link.springer.com/articles/cas-redirect/1:CAS:528:DC%2BD38XhtFelt7s%3D\", \"text\": \"CAS\"}, {\"link\": \"https://link.springer.com/articles/cas-redirect/1:STN:280:DyaK2Mzmt1SjtA%3D%3D\", \"text\": \"CAS\"}, {\"link\": \"https://link.springer.com/articles/cas-redirect/1:CAS:528:DC%2BC1cXlvF2itLc%3D\", \"text\": \"CAS\"}, {\"link\": \"https://link.springer.com/articles/cas-redirect/1:CAS:528:DC%2BC3MXmtFGgu7k%3D\", \"text\": \"CAS\"}, {\"link\": \"https://link.springer.com/articles/cas-redirect/1:CAS:528:DC%2BB3cXivFOnsbw%3D\", \"text\": \"CAS\"}, {\"link\": \"https://link.springer.com/articles/cas-redirect/1:CAS:528:DC%2BD2cXhtVCjsrrI\", \"text\": \"CAS\"}, {\"link\": \"https://link.springer.com/articles/cas-redirect/1:CAS:528:DC%2BC28XhvVemtLrF\", \"text\": \"CAS\"}, {\"link\": \"https://link.springer.com/articles/cas-redirect/1:CAS:528:DC%2BC1cXhslKhtL3I\", \"text\": \"CAS\"}, {\"link\": \"https://link.springer.com/articles/cas-redirect/1:CAS:528:DC%2BC3MXhs1OrtrvL\", \"text\": \"CAS\"}, {\"link\": \"https://link.springer.com/articles/cas-redirect/1:CAS:528:DC%2BC2cXpvFWgu7w%3D\", \"text\": \"CAS\"}, {\"link\": \"https://link.springer.com/articles/cas-redirect/1:CAS:528:DC%2BB3cXht1GjtbzF\", \"text\": \"CAS\"}, {\"link\": \"https://link.springer.com/articles/cas-redirect/1:CAS:528:DC%2BC1MXitFyhsLrL\", \"text\": \"CAS\"}, {\"link\": \"https://link.springer.com/articles/cas-redirect/1:CAS:528:DC%2BD2sXitFOhsL8%3D\", \"text\": \"CAS\"}, {\"link\": \"https://link.springer.com/articles/cas-redirect/1:CAS:528:DC%2BD28XisFWlu7k%3D\", \"text\": \"CAS\"}, {\"link\": \"https://link.springer.com/articles/cas-redirect/1:STN:280:DC%2BC2sbgs12qsw%3D%3D\", \"text\": \"CAS\"}, {\"link\": \"https://link.springer.com/search?dc.creator=Gavril%20L.%20W.%20Chong\", \"text\": \"View author publications\"}, {\"link\": \"https://link.springer.com/search?dc.creator=Bj%C3%B6rn%20B%C3%B6hmert\", \"text\": \"View author publications\"}, {\"link\": \"https://link.springer.com/search?dc.creator=Lucy%20E.%20J.%20Lee\", \"text\": \"View author publications\"}, {\"link\": \"https://link.springer.com/search?dc.creator=Niels%20C.%20Bols\", \"text\": \"View author publications\"}, {\"link\": \"https://link.springer.com/search?dc.creator=Georgina%20C.%20Dowd\", \"text\": \"View author publications\"}, {\"link\": \"https://link.springer.com/search?query=Australasian%20snapper&facet-discipline=\\\"Life%20Sciences\\\"\", \"text\": \"Australasian snapper\"}, {\"link\": \"https://link.springer.com/search?query=%0A%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%0A%20%20%20%20%20%20%20%20%20%20%20%20%20%20&facet-discipline=\\\"Life%20Sciences\\\"\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/search?query=%0A%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%0A%20%20%20%20%20%20%20%20%20%20%20%20%20%20&facet-discipline=\\\"Life%20Sciences\\\"\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/search?query=Cell%20line&facet-discipline=\\\"Life%20Sciences\\\"\", \"text\": \"Cell line\"}, {\"link\": \"https://link.springer.com/search?query=Growth%20factors&facet-discipline=\\\"Life%20Sciences\\\"\", \"text\": \"Growth factors\"}, {\"link\": \"https://link.springer.com/search?query=Myofibroblast&facet-discipline=\\\"Life%20Sciences\\\"\", \"text\": \"Myofibroblast\"}, {\"link\": \"https://link.springer.com/search?query=Actin%20bundling&facet-discipline=\\\"Life%20Sciences\\\"\", \"text\": \"Actin bundling\"}, {\"link\": \"https://link.springer.com/search?query=Collagen&facet-discipline=\\\"Life%20Sciences\\\"\", \"text\": \"Collagen\"}, {\"link\": \"https://link.springer.com/search?query=Extracellular%20matrix&facet-discipline=\\\"Life%20Sciences\\\"\", \"text\": \"Extracellular matrix\"}, {\"link\": \"https://link.springer.com/search?query=Mesenchymal%20stem%20cells&facet-discipline=\\\"Life%20Sciences\\\"\", \"text\": \"Mesenchymal stem cells\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2/figures/1\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2/figures/2\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2/figures/3\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2/figures/4\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2/figures/5\", \"text\": \"\"}, {\"link\": \"https://link.springer.com/article/10.1007/s11626-022-00734-2/figures/6\", \"text\": \"\"}]"
}