{
    "summary": "Back to Top  Skip to main content\n\nAn official website of the United States government\n\nHere's how you know\n\n**The .gov means it’s official.**  \nFederal government websites often end in .gov or .mil. Before sharing\nsensitive information, make sure you’re on a federal government site.\n\n**The site is secure.**  \nThe **https://** ensures that you are connecting to the official website and\nthat any information you provide is encrypted and transmitted securely.\n\nLog in Show account info\n\nClose\n\n#### Account\n\nLogged in as:  \n**username**\n\n  * Dashboard\n  * Publications\n  * Account settings\n  * Log out\n\nAccess keys NCBI Homepage MyNCBI Homepage Main Content Main Navigation\n\n__\n\n____\n\nSearch PMC Full-Text Archive\n\n__ Search in PMC\n\n  * Advanced Search \n  * User Guide \n\n__\n\n  * Journal List\n  * Springer Nature - PMC COVID-19 Collection\n  * PMC8747882 \n\n###### Other Formats\n\n  * PDF (1.0M)\n\n###### Actions\n\n  * Cite\n  * Collections\n\nAdd to Collections\n\n    * Create a new collection\n    * Add to an existing collection\n\nName your collection:\n\nName must be less than characters\n\nChoose a collection:\n\nUnable to load your collection due to an error  \nPlease try again\n\nAdd  Cancel\n\n###### Share\n\n  * _ _\n  * _ _\n  * __ _ _\n\nPermalink\n\nCopy\n\n###### RESOURCES\n\n  * Similar articles \n\n  * Cited by other articles \n\n  * Links to NCBI Databases \n\n  * Journal List\n  * Springer Nature - PMC COVID-19 Collection\n  * PMC8747882 \n\nAs a library, NLM provides access to scientific literature. Inclusion in an\nNLM database does not imply endorsement of, or agreement with, the contents by\nNLM or the National Institutes of Health.  \nLearn more: PMC Disclaimer |  PMC Copyright Notice\n\nMol Biol Rep. 2022; 49(3): 2393–2411.\n\nPublished online 2022 Jan 11.  doi: 10.1007/s11033-021-06997-4\n\nPMCID: PMC8747882\n\nPMID: 35013860\n\n# Role and relevance of fish cell lines in advanced in vitro research\n\nM. Goswami,1 B. S. Yashwanth,1 Vance Trudeau,2 and W. S. Lakra3\n\n### M. Goswami\n\n1ICAR – Central Institute of Fisheries Education, Mumbai, 400061 India\n\nFind articles by M. Goswami\n\n### B. S. Yashwanth\n\n1ICAR – Central Institute of Fisheries Education, Mumbai, 400061 India\n\nFind articles by B. S. Yashwanth\n\n### Vance Trudeau\n\n2Centre for Advanced Research in Environmental Genomics, Department of\nBiology, University of Ottawa, Ottawa, Canada\n\nFind articles by Vance Trudeau\n\n### W. S. Lakra\n\n3NABARD Chair Unit, ICAR-Central Marine Fisheries Research Institute, Mumbai\nResearch Centre, Versova, Mumbai India\n\nFind articles by W. S. Lakra\n\nAuthor information Article notes Copyright and License information PMC\nDisclaimer\n\n1ICAR – Central Institute of Fisheries Education, Mumbai, 400061 India\n\n2Centre for Advanced Research in Environmental Genomics, Department of\nBiology, University of Ottawa, Ottawa, Canada\n\n3NABARD Chair Unit, ICAR-Central Marine Fisheries Research Institute, Mumbai\nResearch Centre, Versova, Mumbai India\n\nM. Goswami, Email: moc.liamg@imawsogukum.\n\nCorresponding author.\n\nReceived 2021 Jul 27; Accepted 2021 Nov 19.\n\nCopyright © The Author(s), under exclusive licence to Springer Nature B.V.\n2021\n\nThis article is made available via the PMC Open Access Subset for unrestricted\nresearch re-use and secondary analysis in any form or by any means with\nacknowledgement of the original source. These permissions are granted for the\nduration of the World Health Organization (WHO) declaration of COVID-19 as a\nglobal pandemic.\n\nGo to:\n\n## Abstract\n\n### Introduction\n\nCell line derived from fish has been established as a promising tool for\nstudying many key issues of aquaculture covering fish growth, disease,\nreproduction, genetics, and biotechnology. In addition, fish cell lines are\nvery useful in vitro models for toxicological, pathological, and immunological\nstudies. The easier maintenance of fish cell lines in flexible temperature\nregimes and hypoxic conditions make them preferable in vitro tools over\nmammalian cell lines. Great excitement has been observed in establishing and\ncharacterizing new fish cell lines representing diverse fish species and\ntissue types. The well-characterized and authenticated cell lines are of\nutmost essential as these represent cellular functions very similar to in vivo\nstate of an organism otherwise it would affect the reproducibility of\nscientific research.\n\n### Conclusion\n\nThe fish cell lines have exhibited encouraging results in several key aspects\nof in vitro research in aquaculture including virology, nutrition and\nmetabolism, production of vaccines, and transgenic fish production. The review\npaper reports the cell lines developed from fish, their characterization, and\nbiobanking along with their potential applications and challenges in in vitro\nresearch.\n\n **Keywords:** Applications, Bio-banking, Fish cell line, Cell-based\naquaculture, In vitro research\n\nGo to:\n\n## Introduction\n\nThe Development of chemically defined cell culture medium like Leibovitz -15\n(L-15) and the development of antibiotics with gradual improvisation of cell\nculture techniques eventually made the generation of cultured cells for\nderiving continuous cell lines. In addition to being an important biomedical\ntool like any other cell line, cell cultures prepared from fish, shellfish and\nseaweeds can provide a significant contribution to the growth of aquaculture.\nThe scientific knowledge gained through the cell culture system can be\nutilized for manipulating the whole organism to enhance its usefulness for\naquaculture. Their cell line could be useful for providing basic insights into\ngrowth, reproduction, and health, creating opportunities for manipulation and\nthus the cell lines could be used as sources of biochemical products in place\nof the whole organism [1]. Cell-based aquaculture systems using cell cultures\ncould be a game-changing practice to produce seafood and other aqua food\nacross multiple species for meeting the demand of the burgeoning world\npopulation [2]. A cell-based aqua food production system utilizing cells in\nplace of whole fish could also lead to greater preservation of the aquatic\nenvironments. This practice has to meet the regulatory framework/guidelines\ndeveloped by the FDA [3] for the safety of food produced using such animal\ncell culture technology.\n\nFish cell culture offers several advantages over mammalian cell culture in\nterms of adaptation to a broad range of temperature, higher tolerance to\nhypoxia, easier maintenance of cell culture for longer periods. Cell lines\nfrom fish have been increasingly established from different aquaculture\nspecies and they are being used in in vitro research related to aquaculture\nand other interdisciplinary areas. However, there are emerging issues\nregarding standardization of cell line nomenclature, characterization of cell\nlines following SOP/recommended guidelines, and conservation of cell lines in\nseparate biobanks across the world-which we review below is of utmost\nessential to maintain scientific reproducibility in cell-based biological\nresearch using fish cell lines. The key areas of aquaculture like fish health,\ndisease diagnosis, safety, and nutritional aspects challenging aquaculture\nproduction can be studied using fish cell lines without scarifying whole live\nfish (Fig. 1). The scientific knowledge generated using fish cell lines would\nbe immensely useful for quality fish production in a sustainable manner. Cell\nlines would facilitate in vitro research for developing climate-resilient and\nsustainable aquaculture systems to minimize the key challenges and provide\nnutritional security to the burgeoning world population.\n\nOpen in a separate window\n\nFig. 1\n\nImplications of fish cell line in aquaculture\n\nGo to:\n\n## Global status of fish cell lines\n\nAn increasing trend has been observed for the development of fish cell lines\nfrom a wider range of tissues covering both tropical and temperate water since\nthe first establishment of the RTG-2 cell line in 1962 [4]. Bairoch enlisted\n883 fish cell lines out of 104,421 cell lines from > 590 species in\nCellulosaurus; a knowledge resource on cell lines [5]. In general, cell lines\nhave been developed globally using different types of fish tissue samples\nincluding gill, caudal fin, eye, liver, and kidney. Fish cell lines have also\nbeen established using tissue samples like intestine [66], brain [95],\nvertebra [105], and snout [121]. Spontaneous differentiation is one of the\nmost challenging for the development of embryonic stem cell culture from fish\nand this is the main cause behind a very limited number of stem cell lines.\nFew embryonic fish stem cell lines were developed from sea bream _Sparus\naurata_ [6], sea perch _Lateolabrax_ [7], sea bass; _Lates calcarifer_ [8],\n_Catla catla_ [9], _Labeo rohita_ [10]. A feeder-free cell culture system used\nfor the development of Embryonic Stem (ES) cell lines from medaka and\nzebrafish has boosted fish stem cell research by replacing the use of feeder\nlayers to inhibit spontaneous differentiation in fish stem cell culture [11].\n\nGo to:\n\n## Cell line characterization\n\nThe numbers of cell lines developed from fish have been increasing rapidly\nwhich raises the concern for accurate authentication and characterization of\nfish cell lines to provide reproducible scientific data. The comprehensive\nguidelines for using cell lines highlight various aspects of cell culture,\nissues of misidentification, contamination with microbes along with\nrecommendations to overcome these problems [12]. Although these guidelines are\nmeant for scientists in the UK, the basic principles remain the same for\ninternational implications. Research and development using cell lines need\ndetailed knowledge on the purity and originality of the cell line [13]. The\ncharacterized cell lines are indispensable as they facilitate the researchers\nto perform in vitro research and standard guidelines are available for their\ncharacterization. However, many fish cell lines don’t meet uniform\ninternational standards. The Food and Drug Administration has described the\nsteps to be considered while characterizing a cell line used to produce\nbiological products [14]. Such standard protocol for the characterization and\nauthentication of fish cell lines should be practiced throughout the world.\nStandard protocols for authentication of cell line have been reported [15]\nwherein standard methods like cytochrome c oxidase subunit1 (CO1) barcode,\nShort Tandem Repeat (STR) profiling, karyotyping, Single Nucleotide\nPolymorphisms (SNP) profiling, use of species-specific primers, whole-genome\nsequencing (WGS), etc. are described as ideal approaches for authentication\nand maintenance of quality cell lines. Several STR databases of cell lines are\nmaintained by ATCC, DSMZ across the world. CLASTR: The Cellosaurus STR\nsimilarity search tool is now in the public domain for comparing STR profiles\nof the cell lines [16]. Cross-contamination also causes a disastrous feature\nof the cell line as the cell line losses its originality and hence cross-\ncontamination needs to be avoided by following standard operating procedure\n(SOP). Development of a framework for cell line annotation linked to STR and\nSNP profiles in the form of a catalog of synonymous cell lines to avoid or\ndetect cross-contamination [17].\n\nMisidentification of cell lines leads to irreproducible data and hence proper\nauthentication of cell lines using molecular markers is essential. It was\nobligatory to provide DNA-based certification of the cell line developed [18].\nMitochondrial DNA genes like 16S rRNA and CO1 are used for the authentication\nof cell lines. Cox I gene has been used as a molecular identification system\nfor animal species which is popularly referred to as ‘‘DNA barcoding’’ [19].\nThe cox I gene was used as DNA barcodes for the authentication of 67 cell\nlines [20]. Similarly, many fish cell lines have been DNA barcoded using cox I\n[21–23]. Cell line repositories like DSMZ, ATCC use DNA barcoding as a\nstandard method for cell line identification. Protein expression signature has\nalso been used for the identification of cell lines derived from fish [24,\n25].\n\nCell lines developed from fish are mostly applied in basic, biomedical and\ntoxicological research in addition to their potential applications in\naquaculture. Several key issues in aquaculture can be addressed by cell\nculture technology and they are reviewed below.\n\nGo to:\n\n## Fish health management\n\nThe fish disease has been considered as one of the most critical challenges\nfor sustainable aquaculture production due to the economic loss and widespread\nuse of antibiotics and other compounds causing great risk to the aquatic\nenvironment. Fish cell culture has great potential to provide tools and\nstrategies for disease control in aquaculture. In vitro models that use cell\nculture methods and experimental systems facilitate a deeper understanding of\nthe complex interactions underlying disease outbreaks and its advancement in\nwhich the interactions between aggressors and the host can be dissected [26].\nFish cell lines have potential applications in understanding disease\nmechanisms, developing assays for disease diagnosis, developing drugs and\nvaccines for the control of the fish disease. The export trade of seafood\ndepends upon the quality and health status of the seafood. The fish cell line\nmodel has been considered useful for detecting viral pathogens and strategies\nneed to be implemented accordingly for the health protection of major\naquaculture species. Zoonotic disease associated with fish is another concern\nwhere consumption of unhealthy fish might be a risk to a human being.\nAssociated in vitro assays would be useful in detecting such harmful pathogens\nand allergens so that the quality of seafood can be augmented. In vitro\nmethods using cell cultures for addressing health issues in molluscs and\ncrustaceans are equally important. Department of Biotechnology, Govt. of India\nhas funded a national programme on the isolation and characterization of\nfinfish and shellfish viruses using cell lines in India. In vitro approach\nusing permanent cell lines needs to be validated for fish and shellfish\ndisease surveillance and health certification. Transboundary movements of live\naquatic animals have greatly increased concern for spreading disease in the\naquaculture system.\n\nThe viral disease used to cause devastating loss to the aquaculture industry.\nThe entire world has witnessed the deadliest effect of the spread of the virus\nCovid-19. The isolation of the novel Covid-19 using the animal model has begun\nand the successful isolation would be useful in understanding the biology and\nevolution of the Covid-19 in developing drugs, vaccines, and rapid diagnosis\nkits. Isolation of viruses using fish cell lines is one of the most sensitive\ntechniques for the discernment of the important pathogens causing viral\ndisease in many fish and other species. Hence, the development of control\nmeasures to halt the spread of the viral disease depends on the unitisation of\nfish cell lines for such purposes. A comprehensive list of fish cell lines\nused in virus susceptibility studies is given in Table ​Table1.1. Research on\nthe avoidance of infectious fish disease in aquaculture necessitates a cell\nculture- based approach for understanding the underlying disease mechanism.\nFish cell culture-based isolation and propagation of virus has provided\nmomentum to virological studies and facilitated research on viral diseases in\nimportant aquaculture species. Propagation of viruses in a cell culture system\nis one of the bases of a virus surveillance system using cell culture. Ariel\net al. developed standard methods to reduce false negatives in cell culture-\nbased surveillance systems in testing fish cell line susceptibility for the\nviruses [27].\n\n### Table 1\n\nList of some fish cell lines susceptible to the virus\n\nFish cell line & tissue/species of origin| Susceptible to virus| Reference  \n---|---|---  \nFish cell line| Tissue/species of origin  \nBluegill fry (BF-2)| | Lymphocystis virus| Wolf et al., 1966  \nHaemorrhagic Septicaemia Virus (VHSV)| Skall et al., 2005, Ito et al., 2016  \nRanavirus isolates and of Epizootic haematopoietic necrosis virus (EHNV)|\nAriel et al., 2009b  \nRainbow trout gonad (RTG-2)| | Haemorrhagic Septicaemia Virus (VHSV)| Wolf and\nQuimby, 1962, Ito et al., 2016  \nRanavirus isolates and of Epizootic haematopoietic necrosis virus (EHNV)|\nAriel et al., 2009b  \nFathead minnow (FHM)| | Haemorrhagic Septicaemia Virus (VHSV)| Gravell and\nMalsberger, 1965, Ito et al., 2016  \nRanavirus isolates and of Epizootic haematopoietic necrosis virus (EHNV)|\nAriel et al., 2009b  \n  \nEpithelioma papillosum\n\ncyprini (EPC)\n\n| | Haemorrhagic Septicaemia Virus (VHSV)| Fijan et al., 1983  \nRanavirus isolates and of Epizootic haematopoietic necrosis virus (EHNV)|\nAriel et al., 2009b  \n  \nChinook\n\nsalmon embryo CHSE-214\n\n| |\n\nInfectious\n\npancreatic necrosis virus (IPNV) and salmonid alphavirus\n\n| Fryer et al., 1965  \nSalmon pancreas disease virus| Lopez et al. 2001  \nMEF| Mandarin fish| Megalocytiviruses| Dong et al., 2013  \n| | koi her-pesvirus (KHV), salmonid rhabdoviruses like spring viraemia of\ncarp virus, (SVCV), Chum salmon reovirus and some infectious pancreatic necro-\nsis (IPN) viruses| Neukirch and Haenen, 2004  \n| | Clonal-cell lines developed from Siberian sturgeon _Acipensar baerii_ head\nkidney showed susceptibility to VHSV| Ryu et al., 2018  \nbmGH| Heart from brown-marbled grouper, Epinephelus fuscoguttatus| Turbot\nreddish body iridovirus (TRBIV) and Lymphocystis disease virus (LCDV)| Wei et\nal. 2010  \nTK| Kidney of _Scophthalmus maximus_|  Turbot reddish body iridovirus (TRBIV)|\nWang et al. 2010b  \nSFK| kidney-derived cell line from southern flounder, Paralichthys\nlethostigma| Lymphocystis disease virus (LCDV),| Wang et al. 2011  \nFlounder fin (FFN) cells from fin tissue and flounder spleen (FSP) cells from\nspleen tissue| Paralichthys olivaceus| Pancreatic necrosis virus, marine\nbirnavirus, chum salmon virus, infectious haematopoietic necrosis virus,\nspring viraemia of carp virus and hirame rhabdovirus| Kang et al. 2003  \nSHK from spotted halibut head kidney| Head kidney of spotted halibut Verasper\nvariegates| Lymphosystis disease virus (LCDV)| Wang et al. 2010a  \nCRF-1| from red sea bream fin, Pagrus major| Red sea bream iridovirus (RSIV)|\nImajoh et al. 2007  \nRSBF-2| from red sea bream fin, Pagrus major| RSIV| Ku et al. 2010  \nSPB – a fishneural progenitor cell line| Brain of snubnosepompano,Trachinotus\nblochii| Giant sea-perch iridovirus (GSIV-K1), red sea breamiridovirus (RSIV-\nKu), grouper nervous necrosisvirus (GNNV-K1), chum salmon reovirus (CSV) and\neel herpesvirus (HVA)| Wen et al. 2013  \nMFF-1| from mandarin fish fry, _Synchiropus splendidus_|  Infectious spleen\nand kidney necrosis virus (ISKNV)| Dong et al. 2008  \nBM| muscle from barramundi, _Lates calcarifer_|  Grouper iridovirus (GIV)| Lai\net al. 2008  \nBSB| swim bladder from barramundi, _Lates calcarifer_|  Grouper iridovirus\n(GIV| Lai et al. 2008  \nCB from cobia brain| Brain of Cobia (Rachycentron canadum)| Grouper iridovirus\n(GIV)| Cheng et al. 2010  \nCF| Fin of Cobia| Grouper iridovirus (GIV)| Cheng et al. 2010  \nGBC1| Clonal cell line from brain of orange-spotted grouper, Epinephelus\ncoioides| Grouper nerve necrosis virus (GNNV)| Wen et al. 2008  \nGBC4| Clonal cell line from brain of orange-spotted grouper, Epinephelus\ncoioides| Giant seaperch iridovirus (GSIV)| Wen et al. 2008  \nFEC|\n\nEmbryo of\n\nJapanese flounder Paralichthys olivaceus\n\n| Lymphocryptovirus (LCV) and Turbot reddish body virus (TRBV)| Chen et al.\n2004  \nEAGL| Liver of red-spotted grouper, Epinephelus akaara| Singapore grouper\niridovirus (SGIV)| Ou-Yang et al. 2010  \nGS-1| Spleen of the orange-spotted grouper, _Epinephelus coioides_|  Fish\nranavirus: Singapore grouper iridovirus (SGIV) and megalocytivirus: spleen and\nkidney necrosis virus (ISKNV)| Huang et al., 2018  \nGS| Spleen of orange spotted grouper, Epinephelus coioides| Singapore grouper\niridovirus (SGIV) and Epinephelus tauvina nervous necrosis virus (ETNNV)| Qin\net al., 2006  \nGH (Heart), GE (from eye), GSB (swimbladder), GL (liver)| Tropical Grouper,\nEpinephelus awoara| Grouper iridovirus (GIV)| Lai et al. 2003  \nGB from Brain, GF from fin and GL from liver cell lines from| Tropical\nGrouper, Epinephelus awoara| Yellow grouper nervous necrosis virus (a\nnodavirus) (YGNNV)| Lai et al. 2003  \nSISK| kidney of _Lates calcarifer_|  Nodavirus| Babu et al. 2013  \nSISS| spleen of _L. calcarifer_|  Nodavirus  \nSIGE| eye of _Epinephelus coioides_|  Nodavirus  \nCSK| kidney _of Channa striatus_|  Marine fish nodavirus| Abdul Mazeed et al.,\n2013  \nSIGE| Eye of grouper ( _Epinephelus coioides_ )| Nodavirus, MABV NC-1 and Y6|\nParameswaran et al., 2007  \nSSN-1| Striped snakehead ( _Ophicephalus striatus_ )| Nodavirus| Frerichs et\nal. 1996  \nSimian COS-1 cells| | Nodavirus| Delsert et al., 1997  \nGF-1| | Nodavirus| Chi et al., 1999  \nSF| Asian sea bass ( _Lates calcarifer_ )| Nodavirus| Chang et al., 2001  \nTF|  _Scophthalmus maximus_|  Nodavirus| Aranguren et al., 2002  \nSAF-1| Fins of gilt-head seabream| Lymphocystis disease virus (LDV) and to\nseveral salmonid fish viruses, such as infectious haematopoietic necrosis\nvirus (IHNV), viral haemorrhagic septicemia virus (VHSV) and several strains\nof infectious pancreatic necrosis virus (IPNV)| Perez-Prieto et al., 1999  \nTF| Fin _of Scophthalmusmaximus,_|  Turbot reddish body iridovirus (TRBIV)|\nFan et al., 2010  \nSKF-9| Potted knifejaw ( _Oplegnathus punctatus_ )| RSIV (Red sea bream\niridovirus (RSIV)| Kawato et al. 2017  \nFat head minnow (FHM)| | RSIV (Red sea bream iridovirus (RSIV)| Clem et al.,\n1961  \nStriped snakehead (SSN-1)| | RSIV (Red sea bream iridovirus (RSIV)  \nGF cells grunt fin (GF)| Fin of blue striped grunt ( _Haemulon sciurus_ )|\nRSIV (Red sea bream iridovirus (RSIV)  \nCFF|  _Pristolepis fasciatus_|  Tilapia Lake Virus (TiLV)|  _Behera_ et al _.,\n2018_  \nSPB| Brain of snubnose pompano, _Trachinotus blochiito_|  Giant seaperch\niridovirus (GSIV-K1), red sea bream iridovirus (RSIV-Ku) and chum salmon\nreovirus (CSV) (HVA)| Wen et al., 2013  \nOCF| Caudal fin of _Amphiprion ocellaris_|  Nervous necrosis virus| Yashwanth\net al., 2020  \n  \nOpen in a separate window\n\nHighly specific cell lines are used for investigating unique virus which\notherwise doesn’t propagate in any normal cell line. The susceptibility of the\nfish cell lines to the virus varies with species as well as tissue from where\nthe cell line is developed _._ This raises the importance of the development\nof species-specific and tissue-specific cell lines from various important\naquaculture species. Some fish cell lines like bluegill fry (BF-2), chinook\nsalmon embryo (CHSE-214), epithelioma papulosum cyprinid (EPC), fathead minnow\n(FHM), rainbow trout gonad (RTG-2), and SAF-1 have shown susceptibility to\nsome of the most commonly available viruses like Infectious pancreatic\nnecrosis (IPN), VHSV, IHNV, IPNV, SVC, koi herpesvirus (KHV) and Channel\ncatfish virus (CCV) that have severely affected several aquaculture species\n[28, 29]. MEF-8C1 cloned cells obtained from the MEF cell line from mandarin\nfish suitably propagated megalocytiviruses that cause major problems in\nfinfish aquaculture in China [30]. A transgenic fish cell line RTG-P1 was\napplied to estimate viremia of Salmonid alphavirus (SAV) which causes a\nserious viral disease i.e. Salmon Pancreas Disease (SPD) in Atlantic salmon\nfarming [31]. SISK and SISS cell lines developed from the kidney and spleen of\n_Lates calcarifer_ respectively and SIGE cell line developed from the eye of\n_Epinephelus coioides_ showed their ability to propagate a nodavirus strain\n[32]. Yashwanth et al. reported the susceptibility of the OCF cell line to NNV\n[23]. SSN-1 cell line supported the replication of snakehead fish\nvesiculovirus (SHVV) which causes great economic loss in fish culture in East\nAsian countries [33]. Understanding the transmission of viral infection\nbetween the two most important aquaculture species mandarin fish and snakehead\nfish, it would be useful to develop control measures to prevent the spreading\nof such viral diseases. Fish cell cultures or cell lines could be used for\ninvestigating viral pathogenesis and host–pathogen interactions.\n\nIn the past, such in vitro methods were used for some bacterial pathogens like\nmycobacterial host–pathogen interactions using the carp monocytic cell line\nCLC (carp leukocyte culture) [34]. Recently, Cardiac Primary Cultures (SCPCs)\nfrom Atlantic salmon pre-hatch embryos were used to investigate viral\nhost–pathogen interactions and pathogenesis [35]. A blend of cell culture and\nmolecular biology methods will provide deeper insights into host–pathogen\ninteractions. Although advanced antibody-based techniques are being developed\nin disease control in aquaculture, fish cell culture continues to be an\nindispensable technique for isolation and characterization of the pathogenic\nvirus and intracellular bacteria and studying their pathogenicity [26]. These\nfish cell lines are going to play a crucial role in virus isolation and\nunderstanding viral pathogenicity and thereby controlling these viral diseases\nto enhance sustainable aquaculture production.\n\nGo to:\n\n## Pathological & immunological studies\n\nSeveral fish health-related issues can be studied in vitro using fish cell\nlines. The most prominent is the application of fish cell lines in disease\ndiagnostics and immunological studies. Some intracellular bacterial fish\npathogens like Rickettsiae spp and _Renibacterium salmoninarum_ have been\ndetected in fish using cell cultures [36, 37]. The in vitro investigation\nusing fish cell line (CHSE-214) has improved the knowledge of the infection\nprocess by  _Yersinia ruckeri_  in salmonid fish as well as the interaction\nbetween the pathogen and host cells [38].\n\nCell cultures are promising in vitro tools in studying the host defense\nmechanism and thereby help in exploiting the immunological information for the\nhealth protection of fish and shellfish used in aquaculture. Fish leukocyte\ncell lines and macrophages developed from many aquaculture species like carp,\ncatfish have been used for immunological studies. Several monocyte-like cell\nlines have also been developed using peripheral blood leukocytes of channel\ncatfish [39]. Cell lines developed from gut, skin, and gill are promising in\nvitro tools for studying the defense mechanism in fish. The immunological\npotentials of DNA vaccines, synthetic peptides and immunostimulants, and other\nproducts can be tested using these fish cell lines. A continuous blood cell\nline developed from peripheral blood mononuclear cells of _Cyprinus carpio_\nwas useful in understanding the fundamental aspects of fish immunology [40].\nFish macrophage cell lines are found to be very useful in numerous research\napplications including immunological studies. Two macrophage cell lines i.e.,\nCTM and CCM [41] developed from _Catla catla_ could be useful in investigating\nthe importance of these cell lines in the differentiation and maturation of\nthymocytes and other fish immunological studies. SHK-1 macrophage-like cell\nline developed from Atlantic salmon showed the reaction to monoclonal\nantibodies against Atlantic salmon peripheral blood leukocytes and the cell\nline was able to phagocytose bacteria [42]. Macrophage-like cell line RTS11\ndeveloped from rainbow trout was used as a promising tool for investigating\nimmune cell-specific responses in vitro [43, 44].\n\nSaprolegniales are considered the most important fungi causing disease in\nfreshwater fish. The cytological response of their piscine hosts is not\nprecisely understood. RTS11 cell line developed from rainbow trout was used to\ncheck the response of macrophage to water molds _Achlya_ and _Saprolegni_\n[45]. Fish cell lines are a very useful aid in understanding pathogenicity\narising due to nutritional issues. Such studies were carried out using fish\ncell lines to investigate the proinflammatory mechanism underlying the\nrelationship between dietary PUFA and cardiac lesions using a cell line\ndeveloped from chum salmon [46].\n\nGo to:\n\n## gene-editing and genetic engineering\n\nGenetically edited fish cell lines have enormous biotechnological and clinical\napplications. CRISPR (Clustered Regularly Interspaced palindromic repeats-Cas9\n(CRISPR associated) has revolutionized gene editing. Generation of improved\nfish cell lines using CRISPR-Cas9 technology would facilitate aquaculture\nbiotechnological research including fish disease studies. Genetically edited\ncell lines using genome editing technology would be useful to enhance the\ntransfection efficiency of fish cell lines and utilize those cell lines for\nthe efficient production of viruses for vaccine development. This technique\nhas been mostly used for gene editing in mammalian cell lines whereas the use\nof gene editing for fish cell lines is in the infancy stage. The use of\nCRISPR-Cas9 based gene editing method has been reported earlier in fish but an\nefficient method for gene editing was developed in a fish cell line CHSE\ndeveloped from Chinook salmon _Oncorhynchus tshawytscha_ for the first time\n[47]. The cell line was genetically engineered to overexpress different forms\nof CHSE cell line. Although various attempts have been made, a convincing fish\nknock-out in vitro model has not yet been developed.\n\nA stable trout head kidney cell line was transfected with a variety of\nplasmids expressing cytokines Interleukin-6 macrophage colony-stimulating\nfactor (MSCF). Rainbow trout head kidney cell line and RTG-2 stable cell lines\nwere engineered in developed conditioned media to express interleukin (IL-2),\nIL-6, and macrophage colony-stimulating factor (MCSF) [48]. Greasy grouper\n_Epinephelus tauvina_ liver cell line GL-av was genetically modified to assess\nthe effectiveness of the anti-apoptotic protein Bcl-xL [49]. Fish cell lines\nhave also important applications in in vitro ploidy manipulation.\nPolyploidization was successfully obtained in a crucian carp induced by a\nchemical compound and developed an autotetraploid cell line [50].\n\nGenetically engineered fish cell lines have enormous potentials to be used in\nfish health, genetics, and biotechnological research. The establishment of a\nstable cell line is the need of the hour for functional genomics studies for\nfish genetics and health. With the progress of gene delivery methods, the\nnumber of stable genetically modified fish cell lines has increased. Not much\neffort has been made for the functional characterization of immortal fish cell\nlines towards developing genetically engineered methodologies [51]. Genetical\nmodification of goldfish cell line, Chinook salmon Oncorhynchus tshawytscha\nembryo CHSE cell line, rainbow trout _Oncorhynchus mykiss_ hepatoma RTH cell\nline have provided interesting information for fish disease and immunological\nresearch [52, 53]. A transformed EPC (Epithelioma Papulosum Cyprini) cell line\nunder the control of the tilapia HSP70 promoter expressed a green fluorescent\nprotein (GFP)-luciferase fusion gene in response to cellular stress [54]. The\nfish cell lines can be used for studying stressors concerning infectious fish\ndisease in addition to their usage in investigating environmental stressors\nconcerning climate change. A novel in vitro system was developed using\ngenetically modified Chinook salmon embryonic (CHSE)-TOF cell line to measure\nthe sensitivity of some important virus-like Infectious Haematopoietic\nNecrosis Virus (IHNV), Infectious Pancreatic Necrosis Virus (IPNV), Salmon\nAlphavirus (SAV), and Epizootic Haematopoietic Necrosis Virus (EHNV) [55].\n\nGo to:\n\n## Transgenic studies and reproductive biotechnology\n\nGene targeting and transfer of the genes for transgenic fish production become\neasier with the advancement of cell culture techniques. Transgenic zebrafish\nproduced applying primary cultures of genetically modified zebrafish male germ\ncells has paved the way for the development of transgenic lines in model\norganisms or other animal systems [56]. Genetically modified myogenic cell\nculture was developed from a transgenic trout ( _Oncorhynchus mykiss_ ) having\na construct containing the GFP reporter gene driven by a fast myosin light\nchain 2 (MlC2f) promoter [57]. The transgenic line can be produced by\nutilizing the primordial germ cell (PGC) cultures. Vasa marker facilitates\nisolation and characterization of targeted PGCs for germline-specific\nexpression in fish. Tanaka et al. developed a transgenic line of medaka using\nGFP expressed germ cells [58]. Successful transplantation of germ cells in\nfish demonstrated the possibility of surrogate broodstock production in the\naquaculture system. Intraperitoneal transplantation of PGCs was used to\nproduce seedlings in rainbow trout for the first time [59]. The progress in\nstem cell culture and their subsequent applications in vitro basic research,\nas well as aquaculture biotechnology, will transform the fisheries sector for\nachieving the blue revolution. Spermatogonial stem cells transplantation\noffers many scopes for a successful captive breeding programme for aquaculture\nspecies. A spermatogonial cell line (SG3) developed from the mature testis of\nmedaka was capable of producing sperm [60]. The production of fertile medaka\nfish using ES cells proved the possibility of generating nuclear transplants\nusing fish embryonic cells [61]. More research needs to be carried out in\naquaculture species utilising these ES cells. Gene transfer through embryonic\nstem (ES) cell is a promising tool for the production of transgenic animals\n[62]. Yoshizaki et al. successfully developed a stem cell-mediated gene\ntransfer method to produce transgenic rainbow trout [63]. ES cells along with\nPGCs and nuclear transfer strategy make the transformation efficient for\ntransgenic fish production.\n\nGo to:\n\n## Fish cell lines as in vitro models\n\nFish cell lines have enormous potentials to be used model systems for studying\nfish disease, immunology, biotechnology, nutrition, and toxicity testing of\nchemicals and therapeutic agents used in aquaculture as they are ideal\nsubstitutes for the whole organism which involves increasing questionable\nethical issues. In vitro model has been used for investigating the viral\nreplication and genetics and the production of experimental vaccines to be\nused in aquaculture. Organ culture developed from tilapia, eel, and trout\npituitary glands was used as in vitro model for the production of the growth\nhormone prolactin [64]. Fish cell lines were found to complement in vivo\ndevelopment studies and recognize the involvement of signaling pathways in the\ndevelopmental processes [65].\n\nCell cultures developed from fish can be effectively used as model systems to\ninvestigate nutrient assimilation and metabolism in fish but rarely such a\nculture system has been used to study that aspect of fish nutrition. This also\nraises the need for the development and characterization of the intestinal\ncell culture systems to support such studies. Cell line developed from the\nfish intestine is useful in understanding the effect of functional feed\ningredients like probiotics and dietary exposure to chemicals in the aquatic\nsystem. Kawano et al. reported the use of the intestinal rainbow trout\nepithelial cell line (RTgutGC) to elucidate the metabolism of environmentally\nrelevant contaminants in the intestinal tract of fish [66]. Recently, RTgutGC\nwas used as an in vitro model for understanding the functional immunity system\nof the fish gut as well as the effects of functional feed ingredients in the\ngut cells [67].\n\nLangan et al. investigated the function of spheroid size in the metabolism of\npropranolol using an RTgutGC cell line as a 3D fish intestinal model [68]. The\ncell line of the intestinal epithelial region rainbow trout acts as a barrier\nto study cellular mechanism of immune function, physiological and pathological\nresponse, nutrient uptake, and toxicants [118]. The above RTgutGC cells were\ncompared with new cell lines from the proximal and distal intestine of rainbow\ntrout such as RTpi-MI & RTdi-MI and these cells formed a polarized barrier,\nwhich was not permeable to larger molecules and absorbed glucose and proline\n[119]. The RTgill-W1 cells were used as in vitro model for accessing acute\ntoxicity of select chemicals associated with Whole Effluent Toxicity (WET)\ntesting in both marine and freshwater conditions [120]. A physiologically\nrealistic model system- fish-gut-on-chip was developed by combining intestinal\ncell culture from rainbow trout ( _Oncorhynchus mykiss_ ) with microchip\ntechnology and microfluidic engineering to study its barrier function towards\nthe environment i.e. food & water and to monitor the function in real-time\n[69]. In vitro models are extremely important to study collagen synthesis and\nsecretion in humans and other higher vertebrates. Very few models have been\nestablished to investigate collagen synthesis and secretion in fish. Lee and\nBols reviewed the potential applications of fish cell lines to study collagen\nas in vitro model for evaluation of physic-chemical factors controlling\nsynthesis, secretion, and deposition of collagen [70].\n\nGo to:\n\n## Cell-based aquaculture\n\nAquaculture has been growing very fast and facing several challenges to meet\nthe rising demand ensuring the safety and quality of fishery products. The\nconcept of producing cell-based seafood has been emerging as a new approach to\nproducing alternate animal protein. This alternative approach of animal\nprotein production from fish would address several key challenges faced by the\nconventional aquaculture systems and declining marine capture fisheries. This\nalternative fish production system will reduce pressure on natural resources\nand the environment. Accordingly, the entire world is moving towards climate-\nresilient production systems and in vitro meat production has emerged as an\narea of cutting edge and priority research. The successful launch of the in\nvitro hamburger in 2013 has accelerated the research focus on cell-based meats\n[71]. The ease of growing fish cells at a lower temperature compared to\nmammalian cells may give cost benefits to the production of cellular fish meat\nas compared to cellular animal meat. Tissue engineering blend with modern\naquaculture techniques can be explored to utilize marine cell culture as an\nattractive opportunity for the production of in vitro fish meat. Fish muscle\ncell culture can be used for in vitro fish meat production by exploiting their\nsalient physiological properties like tolerance to a hypoxic-conditions, high\nbuffering capacity, and lower temperature [2]. Fish muscle cell cultures are\nmore adaptable to in vitro conditions than mammalian ones and hence in vitro\nmeat production will be more feasible with fish muscle cell cultures. More\nconcerted efforts and investigations are required to generate information on\nfish and shellfish muscle cell culture systems to suit in vitro fish meat\nproduction systems. The fastest possible path to produce cellular fish meat\nshould start with zebrafish for research and development purposes [72].\n\nThe importance of genetic modification and closed aquaculture system paves the\nway for the innovative concept of cell-based fish production i.e. cellular\naquaculture [73]. American space organization NASA had supported the first\nresearch program on in vitro edible muscle protein production from goldfish\nfor space travelers during long-term manned space exploration [74]. A better\nunderstanding of the myogenesis involved in the muscle cell and tissue culture\nwould be essential to trap the benefits of muscle cell culture in promoting\ncellular aquaculture. In vitro models like C2C12 cell lines have been utilized\nin understanding molecular mechanisms underlying muscle growth and\ndifferentiation in mammals [2]. Such studies are in the infancy stage in\nteleost due to the unavailability of equivalent permanent muscle cell lines\nexcept for a few fish muscle cell lines [75–77, 77]. Most of them are not from\naquaculture species except muscle cell lines developed from _Wallago attu_\n[21], olive flounder  _Paralichthys olivaceus_ [78] and some myosatellite\ncells developed from the primary culture of muscle-derived from carp [79] and\nrainbow trout [80]. Prospects of cell-based aquacultures will rely on the\ndevelopment of appropriate cell lines, optimization of growth media, and other\nfactors, mass production of cells. Some institutes like Good Food Institute;\nNew York, USA have taken initiatives to develop cell-based seafood.\n\nThe cell-based molecular mechanism studies will provide basic research data\nfor cell-based fish production. Some investigations on harvested native muscle\ntissues from fresh water and marine fish provide interesting insights into the\npotentials of developing a muscle cell culture system [81, 82]. The genome\nediting by CRISPR/Cas9 system is a promising tool that attains targeted gene\nediting with high efficiency, without the requirement of integrating an\nexogenous gene. Its potential is yet to be exploited much in aquaculture using\nfish cell lines. CRISPR/Cas9 system has been used to get higher skeletal\nmuscle/ muscular growth in aquaculture species like red sea bream; _Pagrus\nmajor_ [83] and channel catfish; _Ictalurus punctatus_ [84]. Clean meat farm\nis a million-dollar industry but academic research lags to propagate clean\nmeat production [85]. Academic research focusing on the development of muscle\ncell culture systems, standardization media, and bioreactor facilities for\nlarge-scale cell production would be required to accelerate in vitro fish meat\nproduction and bring it to market.\n\nGo to:\n\n## Vaccine and other products developed from fish cell culture\n\nGlobal aquaculture particularly shrimp farming used to suffer a major economic\nloss every year due to the occurrence of viral diseases. The development of\nvaccines has great relevance to the aquaculture industry to mitigate viral\ndiseases. Purified viruses are likely to be the first health product for use\nas vaccines obtained from piscine cell cultures [1]. Several viral vaccines\nhave been produced with improved techniques for their delivery at affordable\nprices [86]. Several fish cell lines have been tested for virus replication\ntowards vaccine development. There is a need for scaling up the efforts\ntowards the development of effective vaccines.\n\nCell-culture-based technology can be used as a robust and reliable alternative\nfor the production of vaccines. The development of the vaccine and its potency\ntesting requires a large number of live fish. Fish cell culture can be used as\nan alternative to whole live fish for the production and testing efficacy of\nfish vaccines. Cell lines like Vero, Madin Darby canine kidney (MDCK), chicken\nembryo fibroblasts (CEFs) have been mainly used for viral vaccine production\n[87]. Cell lines developed from humans, monkeys, hamsters, dogs, and chickens\nhave so far been used for the development of vaccines. The studies for the\ndevelopment of viral vaccines using fish cell lines are very much limited. Oh\net al. reported that the formalin-inactivated RSIV vaccine was developed from\nthe viruses propagated in Grunt Fin (GF) cells [88]. Several inactivated or\nattenuated fish viral vaccines have been developed for iridovirus and NNV\nprotection [89, 90], and some of them have been commercialized [91]. However,\nfew cell lines are available to replicate megalocytivirus, betanodavirus,\nherpesvirus, and aquareovirus for vaccine production, and hence more efforts\nare warranted to develop specific cell lines for the proliferation of these\nviruses. Fish cell cultures have great applications in modern vaccine\ntechnology including recombinant, DNA/RNA particle vaccines. Only a few fish\ncell lines have been used in viral propagation leading to vaccine development\nand diagnostics, and many are under trial for vaccine production. Rainbow\ntrout pronephros cells as in vitro model could be used to screen fish DNA\nvaccine [92]. The anti-VP5 polyclonal antibody was able to neutralize Grass\ncarp reovirus (GCRV) through in vitro micro neutralizing assay in a grass carp\ncell line CIK [93]. This would be important towards the development of a\nvaccine to prevent the infection of GCRV in grass carp which causes great\ndamage to grass carp production in China.\n\nThe deficiency of treatment options and limited availability of vaccine poses\na challenge for control of viral disease control in aquaculture. In this\nregard, JL122, a broad-spectrum antiviral agent oxazolidine compounds, was\nproven to inhibit transmission of IHNV, VHSV, and SVCV in the EPC cell line\n[94]. Another small molecule LJ001, lipophilic thiazolidine derivative also\nshowed broad-spectrum antiviral properties for inhibition of IHNV infection in\nthe EPC cell line. These hold promise as an immersion treatment option for the\noutbreak of aquatic rhabdoviral infection. The complex interaction between\nInfectious kidney and spleen necrosis (ISKNV) and its host Chinese Perch Brain\n(CPB) cells generated new information for understanding viral pathogenesis and\ndeveloping antiviral treatment strategies [95].\n\nFish cell lines exhibit less transfection efficiency, unlike mammalian cell\nlines. Low transfected cell lines are not useful for the production of\nrecombinant protein and other products. In the case of mammalian cell lines, a\nhigher range of transfection efficiency of mammalian cell lines with the aid\nof the right combination of cell type and method was achieved up to 100% [96].\nHowever, the same methods applied to fish cell-cultured at lower temperatures\n(5–15 °C) provided the low transfection efficiency which is often below 10%\n[97] whereas the transfection efficiency of the head kidney cell line was\nimproved from 11.6% to 90.8% using Amaxa's cell line nucleofector solution T\nand program T-20 [98]. Hence, alternative reagents or methods should be\nexplored to enhance transfection efficiency in fish cell lines. In addition to\nvaccine production, fish cell lines should also be explored for the production\nof human pharmaceutical proteins. The ability of the fish cells to grow at as\nlows as 4 0C could be exploited in this regard. Transformed fish cell line\nEpithelioma papulosum cyrpini cells (EPC) were used to stably express and\nsecret recombinant pleurocidin (Ple), a linear cationic peptide of 25 amino\nacids uninterruptedly for more than 2 years [99]. Fibroblast cell plays an\nimportant role in increasing collagen synthesis, collagen secretion under the\nstimulatory influence of ascorbic acid. Some cell lines developed from fish\nhave been reported to be an ideal in vitro source for the synthesis of\ncollagen [100]. Cytokines such as interferon could be considered for their\npotential therapeutic potential to fill the gap of shortage of fish\ntherapeutics [1]. Fish interferon was partially purified in small quantity\nfrom the rainbow trout gonadal cell line, RTG-2. Transfected RTG-2 cell line\nexpressed Interleukin Cytokines (Interleukin (IL)-2, IL-6, and Macrophage\nColony Stimulating Factor (MCSF) and the transfected cell line was used to\nproduce conditioned media-rich in these cytokines [48].\n\nGo to:\n\n## Toxicological and environmental monitoring studies\n\nDifferent inorganic and organic aquatic pollutants influence the quality and\nhealth status of farmed fish and shellfish. Proper investigation to know the\nill effects of the aquatic pollutants on farmed fish and shellfish is the need\nof the hour to improve the marketing of quality seafood. The cell lines have\nbeen used as alternative tools to replace the use of whole live fish due to a\nsignificant correlations observed between in vitro and in vivo data. Cell\nlines have been applied as a rapid and economic in vitro tool for screening\ntoxicity of chemicals and environmental samples [1, 93]. Fish cell lines have\nimportant applications in studying the effects of different aquatic pollutants\non the metabolism of aquatic biological systems and hence there is a potential\napplication of fish cell lines in environmental monitoring. Fish cell lines\nhave been adopted as an in vitro tool for ecotoxicological evaluation of\nchemicals by many international regulatory bodies like Registration,\nEvaluation, Authorisation, and Restriction of Chemicals (REACH) in Europe,\nFood, and Drug Administration (FDA) in the USA. Fish cell cultures facilitated\nin vitro investigation to find toxic effects of polycyclic aromatic\nhydrocarbons and aflatoxins in farmed fish [101]. Primary cultures have been\nused in the case of toxicological investigation in invertebrates as permanent\ninvertebrate cell lines are not available. Considerable progress has to be\nmade for the development of invertebrate cell lines to facilitate in vitro\ninvestigations in farmed shelf fish and mollusc. In addition to the aquatic\npollutants, toxic and residual effects of antimicrobial drugs used in\naquaculture need to be investigated where fish cell culture can be utilized to\nreplace the whole live fish model. In vitro studies established a correlation\nbetween in vitro immunosuppression and the interference of various\nantimicrobial drugs [102]. In this regard, in vitro investigation will provide\nmore insights to increase the awareness of global antimicrobial resistance\n(AMR) initiated World Health Organization.\n\nGo to:\n\n## Fish nutrition and metabolism\n\nFish cell lines have the potentials to be used in fish feed formation using\nalternative ingredients as they provide an excellent in vitro model to study\nnutrient absorption and assimilation. To facilitate such studies, more\nintestinal fish culture systems need to be developed. Due to the lack of\ntargeted research tools, the current understanding of the underlying effects\nof feed ingredients on fish nutrition is limited. The application of\nappropriate fish cell lines would facilitate further research on the basic\nfunctions of the digestive tract and the effects of functional feed\ningredients on various aspects of fish nutrition [67]. The vital role of cell\nlines in biological experimentations is to reduce animals, with major three R\nrules such as reduction, replacement, and refinement [103]. That enhances the\ninterest of researchers to utilize the in vitro model to study cellular\nenvironmental conditions of living biological components. The primary cultures\nof adipocytes or hepatocytes and myoblasts were significantly used to study\nmolecular mechanisms related to fish nutrition [104–108]. This approach\nprovides significant progress to a limited extent because the primary cultures\nfailed to allow the functional genomic analysis to study the specific gene\nfunctions.\n\nMorin et al., 2020 studied the role of RTH-149, RT hepatoma-derived cell line\nto address nutrition-related queries based on major pathways such as\nmacroautophagy (autophagy), general control nonderepressible 2 (GCN2), and\nmechanistic Target of Rapamycin (mTOR) pathway that regulate cell homeostasis\nthrough amino acids to study the nutrient-sensing signalling. These pathways\nhad attention concerning rainbow trout nutrition, which strongly relies on the\nsupply of amino acid and assessing (1) their capacity to be repressed or\ninduced by starvation, (2) their specific regulation by amino acid\navailabilities, and (3) their related kinetics. They demonstrate that the\nstarvation can be sensed by RTH-149 cells, which then induce the activation of\nGCN2 and drive the expression of ISR-related genes in an amino acid-dependent\nmanner. The high concentration of HF (1000 nM) upregulates chop but represses\nthe induction of other ISR-related genes. This result corroborates previous\nfindings from different species demonstrating that Chop overexpression\ncontributes to a negative feedback loop responsible for attenuating the\nstarvation-induced GCN2 response. They also demonstrated RT specificities for\namino acid dependencies, time response, and the activation levels of their\ndownstream targets [109]. They concluded that RT cell lines could be an\nalternative in vivo to analyze nutrition-related queries in Rainbow trout and\nother carnivorous fish using dietary proteins that provide most of energetic\nmetabolism.\n\nThe regulations of atg4, lc3b, and sqstm1 observed in RTH-149 cells were\npreviously described in a mouse cell line to be induced following starvation\nin a GCN2/ATF4-dependent manner [110]. The starvation-induced autophagy\nkinetics measured in RTH-149 cells matches with the cells of starved mouse\nembryonic fibroblast (MEF) [111]. That indicates the amino acid sensing and\nmTOR activation in RTH-149 cells follow the mechanisms shared between trout,\nhuman, and mice cell lines [112, 113] and that has been conserved throughout\nevolution.\n\nSeveral fish cell lines have been used as in vitro models to study elongation\nand desaturation of different PUFA. These in vitro models were also useful for\nunveiling the pro- inflammatory mechanisms underlying the relationship between\ndietary PUFA and cardiac lesions in salmon [46], the effect of fatty acid diet\non fish inflammatory responses [122, 123]. To study fish nutrition and\nmetabolism, cell lines provide a great interest near future, especially\nadvanced methods, such as CRISPR/cas9 and that may certainly work with new\nfeed formulations for the development of sustainable aquaculture.\n\nGo to:\n\n## Biobanking\n\nWith global biodiversity rapidly declining, the need to preserve and conserve\nbiological specimens becomes crucial. Cryopreservation techniques have long\nbeen used in agriculture for conservation. Proper freezing of cells can\ngenerate a bank of genetic material that can remain viable for hundreds or\neven thousands of years in the future, with the potential not just to act as\nreference specimens, but the capacity to regenerate live individuals of a\nspecies. While classic cryopreservation methods result in frozen sperm, which\nwould need a fresh egg or frozen embryos–which poses challenges for proper\nfreezing–new technology allows for the production of viable offspring from\nspermatogonial stem cells of fish.\n\nThe rapidly increasing number of fish cell lines raises the need for their\nlong-term storage and conservation in different locations. Fish cell lines are\nnot only the source material for in vitro research but also critical for the\nconservation of fish germplasm. Integrated efforts protect animal populations\nwithin their natural habitat (in situ conservation) and outside their natural\nenvironments ( _ex-situ_ conservation). Similarly, ancillary conservation\nfacilities like repositories of serum, DNA, and cell lines have been\nsupporting basic and applied research [114]. Bio-banking is emerging as one of\nthe most efficient approaches to provide security at the highest level against\nthe loss of diversity of species [115]. Caulfield and Murdoch have critically\nreviewed various social and technical issues of biobank globally including\npublic perception, biorights, privacy, technology, and commercialization\n[116]. The standard operating procedure should be followed for the long-term\nconservation of fish cell lines. The stability of the cell lines and recovery\nrate of the fish cell lines should be assessed using different replicates in\nthe freezing medium at different passages to minimize the loss of cells.\nWorking and master stocks of the fish cell lines also need to be maintained\nseparately in the cell line repository. An automated controlled-rate\nprogrammable freezer would be ideal to provide reproducible cryopreservation\nwith an optimized freezing program as per the cell’s requirement [117]. A\nsimpler device like cryocan filled with liquid nitrogen may also be used for\nthe storage of cell lines. Researchers can access fully characterized and\nquality-controlled cell lines from a repository without spending time to\ndevelop as per their requirement and at a minimal cost. The repository acts as\nan “insurance” to secure the loss of cell lines developed by a single\nlaboratory. There should be many standby repositories at different places to\navoid loss of the cell lines in case of any catastrophic event. Hence, the\ncell line repository facilitates promote the propagation of in vitro research\nas well as the conservation of fish germplasm.\n\nThe leading cell line repositories in the world like American Type Culture\nCollection (ATCC), European Collections of Cell Cultures (ECACC), German\nCollection of Microorganisms and Cell Cultures (DSMZ) have been providing\ncharacterized and authenticated cell line to researchers across the world.\nDetails of cell lines maintained in the repositories worldwide are given in\nTable ​Table2.2. Some of the cell lines in the repository suffer from\nmisidentification and contamination due to multiple transfers between\nlaboratories. A certificate citing STR profile for each line is essential to\nguarantee authentic and contamination-free cell lines [12]. A very encouraging\nprogress in the development of cell lines from different fish species\nincluding aquaculture species has been observed in India during the last\ndecade. DBT, Govt. of India New Delhi, India has been instrumental in funding\nvarious projects in the development and characterization of fish cell lines in\nIndia which resulted in a rapid increase in the number of fish cell lines.\nThis raises the need of establishing fish cell line repositories at a national\nlevel for the conservation of fish cell lines in secured places. The authors\n(M Goswami and W S Lakra) have developed a state-of-the-art facility for the\ndevelopment and storage of cell lines at ICAR-National Bureau of Fish Genetic\nResources (NBFGR), Lucknow, India. Recognizing the expertise and research\ncontributions of the authors and other colleagues in the country in the fish\ncell culture area, DBT funded a megaproject to establish a National Repository\nof Fish Cell lines (NRFC) at NBFGR, Lucknow. This National Repository of Fish\nCell Lines (NRFC) has been in operation at NBFGR, Lucknow, since 2010 which is\nserving as a National Referral Centre of fish cell lines for research use in\nthe country and abroad. More than 50 fish cell lines from 24 different fish\nspecies are being maintained and cryopreserved in the NRFC (Table\n​(Table3).3). The facility provides services for deposition, characterization,\ncryopreservation, and distribution of fish cell lines to the scientific\ncommunity in India. Many cell lines have been supplied to domestic researchers\nfor their research experiments. This cell line repository would play a\ncritical in contributing to the global biobank as many international\nscientific communities have expressed interest in sharing fish cell lines from\nIndia for collaborative in vitro research.\n\n### Table 2\n\nStatus of cell line repository in different parts of the world with reference\nto fish cell line\n\nName of the repository| Total cell line deposited| Total fish cell line\ndeposited  \n---|---|---  \nAmerican Type Culture Collection (ATCC), USA; http://www.atcc.org| 4000| 19  \n  \nCell Bank Australia, Australia\n\ninfo@cellbankaustralia.com; www.cellbankaustralia.com\n\n| 1500| 16  \n  \nHealth Protection Agency Culture Collection (HPACC)\n\nFormerly known as: European Collection of Cell Cultures (ECACC)\nhttp://www.hpacultures.org.uk\n\n| 1100| 25  \n  \nGerman Collection of Microorganisms and Cell Cultures (DSMZ), Germany\n\ncontact@dsmz.de; http://www.dsmz.de\n\n| 789| 17  \nNational Repository of Fish Cell Line (NRFC), Lucknow, India| 50| 50  \n  \nOpen in a separate window\n\n### Table 3\n\nDetails of fish cell lines at national repository of fish cell line (NRFC),\nIndia\n\nName of cell line| Fish species| Organ| Cell type| Passage number| NRFC code|\nDepositor/Reference  \n---|---|---|---|---|---|---  \nPCF|  _Puntius chelynoides_|  Fin| Fibroblast| 54| NRFC001| Goswami et al.\n2014a  \nSRF|  _Schizothorax richardsonii_|  Fin| Fibroblast| 49| NRFC002| Goswami et\nal. 2013  \nTTCF|  _Tor tor_|  Fin| Fibroblast| 72| NRFC003| Yadav et al. 2012  \nCCF|  _Cyprinus carpio_|  Fin| Epithelial| 71| NRFC004| Lakra et al. 2010c  \nWAF|  _Wallago attu_|  Fin| Fibroblast| 69| NRFC005| Dubey et al., 2014  \nRF|  _Labeo rohita_|  Fin| Fibroblast| 100| NRFC006| Lakra et al. 2010a  \nWAM|  _Wallago attu_|  Muscle| Fibroblast| 38| NRFC047| Dubey et al., 2015a  \nWAG|  _Wallago attu_|  Gill| Epithelial| 67| NRFC048| Dubey et al., 2015b  \nCPG|  _Channa punctatus_|  Gill| Epithelial| 52| NRFC049| M Goswami  \nDRM|  _Danio rerio_|  Muscle| Fibroblast| 40| NRFC050| Kumar et al., 2016  \nCTM|  _Catla catla_|  Thymus (macrophage)| Fibroblast| 49| NRFC028| Chaudhary\net al., 2014  \nCTE|  _Catla catla_|  Thymus (epithelial)| Epithelial| 53| NRFC029| Chaudhary\net al., 2013  \nCCM|  _Catla catla_|  Blood (lymphocytes)| Epithelial| NA*| NRFC034| Chaudhary\net al., 2012  \nKCF|  _Koi carp_|  Fin| Epithelial| 54| NRFC007| Swaminathan et al., 2015  \nHBF|  _Horabragus brachysoma_|  Fin| Epithelial| 50| NRFC008| Swaminathan et\nal., 2016  \nPDF|  _Puntius denisonii_|  Fin| Epithelial| NA| NRFC009| Swaminathan et al.,\n2012  \nCFF|  _Pristolepis fasciata_|  Fin| Fibroblast| 51| NRFC039| Swaminathan et\nal., 2013  \nCFFN2|  _Amphiprion sebae_|  Fin| Epithelial| 194| NRFC010| K. Riji John,\nFisheries College and Research Institute (FCRI), Tamilnadu Veterinary & Animal\nSciences University, Tuticorin, Tamil Nadu  \nCFBR| Brain| Epithelial| 161| NRFC011  \nCFSP| Spleen| Epithelial| 241| NRFC012  \nCFCP1| Caudal peduncle| Epithelial| 200| NRFC013  \nSISK|  _Lates calcarifer_|  Kidney| Epithelial| 78| NRFC014| Hameed et al.,\n2006  \nSISS| Spleen| Epithelial| 92| NRFC015| Parameswaran et al. 2006b  \nSIGE|  _Epinephelus coioides_|  Eye muscle| Epithelial| 89| NRFC016|\nParameswaran et al. 2007  \nIGK| Kidney| Epithelial| 93| NRFC017| A. S. Sahul Hameed  \nSICE|  _Catla catla_|  Eye muscle| Epithelial| 84| NRFC018| Ahmed et al., 2008  \nSICH| Heart| Epithelial| 83| NRFC019| Ahmed et al., 2009b  \nCB| Brain| Epithelial| 72| NRFC020| Ahmed et al., 2009a  \nICG| Gill tissue| Epithelial| 84| NRFC021| Taju et al., 2013  \nICF|  _Clarius batrachus_|  Fin| Epithelial| 84| NRFC022| Babu et al., 2011  \nLRG|  _Labeo rohita_|  Gill| Epithelial| 94| NRFC023| Abdul et al., 2013a  \nIEE|  _Etroplus suratensis_|  Eye| Epithelial| 90| NRFC040| Babu et al., 2012  \nIEK| Kidney| Epithelial| 96| NRFC041  \nIEG| Gill| Epithelial| 80| NRFC042  \nIEB| Brain| Fibroblast| 74| NRFC043  \nRE|  _Labeo rohita_|  Eye| Epithelial| 76| NRFC044| Ahmed et al., 2009a  \nCSK|  _Channa straiatus_|  Kidney| Fibroblast| 96| NRFC045| Abdul et al.,\n2013b  \nCSG| Gill| Epithelial| 79| NRFC046| Abdul et al., 2014  \nDT1CPEx|  _Dascyllus trimaculatus_|  Caudal peduncle| Fibroblast| 78| NRFC024|\nK S Sobhana, Central Marine Fisheries Research Institute, Kochi  \nDT1F4Ex| Fin| Fibroblast| 72| NRFC025  \nDT1CPTr| Caudal peduncle| Fibroblast| 60| NRFC026  \nRC4H1Tr|  _Rachycentron canadum_|  Heart| Fibroblast| 52| NRFC027  \nEM2HTr|  _Epinephelus malabaricus_|  Heart| Fibroblast| 73| NRFC030|  \nEM2GEx| Gill| Fibroblast| 84| NRFC031| Sobhana et al., 2009  \nEM3GEx| Gill| Epithelial| 74| NRFC032  \nEM4SPEx| Spleen| Epithelial| 92| NRFC033| K S Sobhana  \nPC1CpTr|  _Pomacentrus caeruleus_|  Caudal peduncle| Fibroblast| 74| NRFC035  \nPC1F1Ex| Fin| Fibroblast| 61| NRFC036  \nPC1L1Tr| Liver| Fibroblast| 50| NRFC037  \nHC2SpEx|  _Epinephelus merra_|  Spleen| Epithelial| 71| NRFC038  \n  \nOpen in a separate window\n\n* _NA_ Not Available\n\nGo to:\n\n## Conclusion\n\nThe growing interests in conducting in vitro research using fish cell lines\nhave necessitated intensification of efforts to maintain constant quality and\nauthenticate cell lines using standard protocol throughout their in vitro\nlife. Fish cell culture has been increasingly used in modern biological\nresearch. However, fish cell culture research confronts many challenges like\nmisidentification and contamination. As aquaculture continues to grow\nworldwide, the application of the fish cell lines in addressing fish disease,\ngenetics, and biotechnological interventions will also increase many folds.\nAlthough the total number of fish cell lines has been increasing development\nand characterization of cell lines from crustaceans and other important marine\nand aquaculture species are still elusive. Preliminary efforts have been made\nfor the development of stem cell cultures from fish but this area needs more\nfocus to explore their use in modern aquaculture and biotechnology. The\npotentials of fish cell lines in developing vaccines for aquaculture and other\nderivable products from cells have yet not been explored fully. Hence, scaling\nup the fish cell culture systems is essential to grab the opportunities of\nusing fish cell cultures in cell-based aquaculture.\n\nThere is a need for global networking and collaborations towards applications\nof fish cell lines for carrying out advanced in vitro research in fisheries\nand aqua, blue economy, human health, and environmental management. With\ntechnological interventions, fish cell lines could be explored to produce\nseveral new products. The information provided by the authors in this paper\nwill add new knowledge to the global database of the fish cell lines besides\ntheir potential application in the advancement of aquaculture biotechnology\nand fisheries science research.\n\nGo to:\n\n## Acknowledgements\n\nDirector, ICAR-National Bureau of Fish Genetic Resources, Lucknow; Director,\nICAR-Central Institute of Fisheries Education, Mumbai are thankfully\nacknowledged for providing the facilities. The authors gratefully acknowledge\nthe Department of Biotechnology, Govt. of India, New Delhi for financial\nsupport.\n\nGo to:\n\n## Author's Contribution\n\nAll the authors contributed to the preparation of this manuscript. MG, and YBS\nwere responsible for the literature search and the first draft of this\narticle. VT and WSL were responsible for language polishing and further\nediting the manuscript. All authors read and approved the final manuscript.\nDr. MG Covered a major aspects of fish cell line for in vitro research like,\nthe current status of fish cell line, novel characterization methods for fish\ncell line, biobanking, role of cell line in fish health management including\nthe pathological and immunological studies, gene editing of fish cell line and\nthe major contributor of the establishment of NRCF, India. YBS Contributed in\nthe studies on vaccine and other products developed from fish cell culture and\nthe studies on cell-based aquaculture. VT Contributed in the studies of fish\ncell line in transgenic studies and reproductive biology. WSL Contributed in\nthe studies of fish cell line in toxicological research and environmental\nmonitoring.\n\nGo to:\n\n## Funding\n\nNo funding was received to assist with the preparation of this manuscript.\n\nGo to:\n\n## Declarations\n\nConflict of interest\n\nThe authors declare that they have no conflict of interest.\n\nEthical approval\n\nThis article does not contain any studies with animals performed by any of the\nauthors.\n\nConsent to participate\n\nNot Applicable.\n\nConsent to publish\n\nNot Applicable.\n\nGo to:\n\n## Footnotes\n\n **Publisher's Note**\n\nSpringer Nature remains neutral with regard to jurisdictional claims in\npublished maps and institutional affiliations.\n\nGo to:\n\n## References\n\n1\\. Bols NC. Biotechnology and aquaculture: the role of cell cultures.\nBiotechnol Adv. 1991;9(1):31–49. doi: 10.1016/0734-9750(91)90403-I. [PubMed]\n[CrossRef] [Google Scholar]\n\n2\\. Rubio N, Datar I, Stachura D, Krueger K. Cell-based fish: a novel approach\nto seafood production and an opportunity for cellular agriculture. 2019 doi:\n10.20944/preprints201811.0326.v2. [CrossRef] [Google Scholar]\n\n3\\. FDA (2018) Re: Foods Produced Using Animal Cell Culture Technology;\nRequest for Comments; Docket No. FDA-2018-N-2155.\n\n4\\. Wolf K, Quimby MC. Established eurythermic line of fish cells in vitro.\nScience. 1962;135(3508):1065–1066. doi: 10.1126/science.135.3508.1065.\n[PubMed] [CrossRef] [Google Scholar]\n\n5\\. Bairoch A. The Cellosaurus: a cell line knowledge resource. J Biomol Tech.\n2019;18:2902–3002. doi: 10.7171/jbt.18-2902-002. [PMC free article] [PubMed]\n[CrossRef] [Google Scholar]\n\n6\\. Bejar J, Hong Y, Alvarez MC. An ES-like cell line from the marine fish\n_Sparus aurata_ : characterization and chimaera production. Transgenic Res.\n2002;11(3):279–289. doi: 10.1023/A:1015678416921. [PubMed] [CrossRef] [Google\nScholar]\n\n7\\. Chen SL, Sha ZX, Ye HQ. Establishment of a pluripotent embryonic cell line\nfrom sea perch ( _Lateolabrax japonicus_ ) embryos. Aquaculture.\n2003;218(1–4):141–151. doi: 10.1016/S0044-8486(02)00570-7. [CrossRef] [Google\nScholar]\n\n8\\. Parameswaran V, Shukla R, Bhonde R, Hameed AS. Establishment of embryonic\ncell line from sea bass ( _Lates calcarifer_ ) for virus isolation. J Virol\nMethods. 2006;137(2):309–316. doi: 10.1016/j.jviromet.2006.07.006. [PubMed]\n[CrossRef] [Google Scholar]\n\n9\\. Dash C, Routray P, Tripathy S, Verma DK, Guru BC, Meher PK, Nandi S,\nEknath AE. Derivation and characterization of embryonic stem-like cells of\nIndian major carp _Catla catla_. J Fish Biol. 2010;77(5):1096–1113. doi:\n10.1111/j.1095-8649.2010.02755.x. [PubMed] [CrossRef] [Google Scholar]\n\n10\\. Goswami M, Lakra WS, Yadav K, Jena JK. Development of an ES-like cell\nculture system (RESC) from rohu, Labeo rohita (Ham.) Fish Physiol Biochem.\n2012;38(6):1775–1783. doi: 10.1007/s10695-012-9674-5. [PubMed] [CrossRef]\n[Google Scholar]\n\n11\\. Hong N, Schartl M, Hong Y. Derivation of stable zebrafish ES-like cells\nin feeder-free culture. Cell Tissue Res. 2014;357(3):623–632. doi:\n10.1007/s00441-014-1882-0. [PubMed] [CrossRef] [Google Scholar]\n\n12\\. Geraghty RJ, Capes-Davis A, Davis JM, Downward J, Freshney RI, Knezevic\nI, Lovell-Badge R, Masters JR, Meredith J, Stacey GN, Thraves P, Vias M.\nGuidelines for the use of cell lines in biomedical research. Br J Cancer.\n2014;111(6):1021–1046. doi: 10.1038/bjc.2014.166. [PMC free article] [PubMed]\n[CrossRef] [Google Scholar]\n\n13\\. Kaplan J, Hukku B. Cell line characterization and authentication. In\nMethods in cell biology. Academic Press. 1998;57:203–216. doi:\n10.1016/S0091-679X(08)61579-4. [PubMed] [CrossRef] [Google Scholar]\n\n14\\. Food and Drug Administration (1993) Points to consider in the\ncharacterization of cell lines used to produce biologicals.\nhttps://www.fda.gov/downloads/BiologicsBloodVaccines/SafetyAvailability/UCM162863.pdf.\n\n15\\. Almeida JL, Cole KD, Plant AL. Standards for cell line authentication and\nbeyond. PLoS Biol. 2016;14(6):e1002476. doi: 10.1371/journal.pbio.1002476.\n[PMC free article] [PubMed] [CrossRef] [Google Scholar]\n\n16\\. Robin (2019) The Cellosaurus: a cell line knowledge resource.\nhttp://web.expasy.org/cellosaurus/. [PMC free article] [PubMed]\n\n17\\. Yu M, Selvaraj SK, Liang-Chu MM, Aghajani S, Busse M, Yuan J, Lee G,\nPeale F, Klijn C, Bourgon R, Kaminker JS. A resource for cell line\nauthentication, annotation and quality control. Nature.\n2015;520(7547):307–311. doi: 10.1038/nature14397. [PubMed] [CrossRef] [Google\nScholar]\n\n18\\. Fusenig NE, Capes-Davis A, Bianchini F, Sundell S, Lichter P. The need\nfor a worldwide consensus for cell line authentication: experience\nimplementing a mandatory requirement at the International Journal of Cancer.\nPLoS Biol. 2017 doi: 10.1371/journal.pbio.2001438. [PMC free article] [PubMed]\n[CrossRef] [Google Scholar]\n\n19\\. Hebert PD, Ratnasingham S, De Waard JR. Barcoding animal life: cytochrome\nc oxidase subunit 1 divergences among closely related species. Proc R Soc Lond\nB. 2003 doi: 10.1098/rsbl.2003.0025. [PMC free article] [PubMed] [CrossRef]\n[Google Scholar]\n\n20\\. Cooper JK, Sykes G, King S, Cottrill K, Ivanova NV, Hanner R, Ikonomi P.\nSpecies identification in cell culture: a two-pronged molecular approach. In\nVitro Cell Develop Biol-Animal. 2007;43(10):344–351. doi:\n10.1007/s11626-007-9060-2. [PubMed] [CrossRef] [Google Scholar]\n\n21\\. Dubey A, Goswami M, Yadav K, Sharma BS. Development and characterization\nof a cell line WAF from freshwater shark _Wallago attu_. Mol Biol Rep.\n2014;41(2):915–924. doi: 10.1007/s11033-013-2936-1. [PubMed] [CrossRef]\n[Google Scholar]\n\n22\\. Goswami M, Sharma BS, Yadav K, Bahuguna SN, Lakra WS. Establishment and\ncharacterization of a piscean fibroblastic cell line from _Puntius (Tor)\nchelynoides_ suitable for toxicity and gene expression studies as in vitro\nmodel. Tissue Cell. 2014;46:206–212. doi: 10.1016/j.tice.2014.04.004. [PubMed]\n[CrossRef] [Google Scholar]\n\n23\\. Yashwanth BS, Goswami M, Valappil RK, Thakuria D, Chaudhari A.\nCharacterization of a new cell line from ornamental fish _Amphiprion\nocellaris_ (Cuvier, 1830) and its susceptibility to nervous necrosis virus.\nSci Rep. 2020;10(1):1–13. doi: 10.1038/s41598-020-76807-7. [PMC free article]\n[PubMed] [CrossRef] [Google Scholar]\n\n24\\. Wagg SK, Lee LE. A proteomics approach to identifying fish cell lines.\nProteomics. 2005;5(16):4236–4244. doi: 10.1002/pmic.200401290. [PubMed]\n[CrossRef] [Google Scholar]\n\n25\\. Goswami M, Dubey A, Yadav K, Sharma BS, Lakra WS. Identification of fish\ncell lines using 2-D electrophoresis based protein expression signatures. Curr\nProteomics. 2016;13(4):245–252. doi: 10.2174/157016461204160119161034.\n[CrossRef] [Google Scholar]\n\n26\\. Villena AJ. Applications and needs of fish and shellfish cell culture for\ndisease control in aquaculture. Rev Fish Biol Fisheries. 2003;13(1):111–140.\ndoi: 10.1023/A:1026304212673. [CrossRef] [Google Scholar]\n\n27\\. Ariel E, Nicolajsen N, Christophersen MB, Holopainen R, Tapiovaara H,\nJensen BB. Propagation and isolation of ranaviruses in cell culture.\nAquaculture. 2009;294(3–4):159–164. doi: 10.1016/j.aquaculture.2009.05.019.\n[CrossRef] [Google Scholar]\n\n28\\. Lorenzen E, Carstensen B, Olesen NJ. Inter-laboratory comparison of cell\nlines for susceptibility to three viruses: VHSV, IHNV and IPNV. Dis Aquat Org.\n1999;37(2):81–88. doi: 10.3354/dao037081. [PubMed] [CrossRef] [Google Scholar]\n\n29\\. Perez-Prieto SI, Rodriguez-Saint-Jean S, Garcia-Rosado E, Castro D,\nAlvarez MC, Borrego JJ. Virus susceptibility of the fish cell line SAF-1\nderived from gilt-head seabream. Dis Aquat Org. 1999;35(2):149–153. doi:\n10.3354/dao035149. [PubMed] [CrossRef] [Google Scholar]\n\n30\\. Dong C, Shuang F, Weng S, He J. Cloning of a new fibroblast cell line\nfrom an early primary culture from mandarin fish ( _Siniperca chuatsi_ ) fry\nfor efficient proliferation of megalocytiviruses. Cytotechnology.\n2014;66(6):883–890. doi: 10.1007/s10616-013-9642-7. [PMC free article]\n[PubMed] [CrossRef] [Google Scholar]\n\n31\\. Collet B, Urquhart K, Noguera P, Larsen KH, Lester K, Smail D, Bruno D. A\nmethod to measure an indicator of viraemia in Atlantic salmon using a reporter\ncell line. J Virol Methods. 2013;191(2):113–117. doi:\n10.1016/j.jviromet.2013.04.009. [PubMed] [CrossRef] [Google Scholar]\n\n32\\. Babu VS, Majeed SA, Nambi KSN, Taju G, Madan N, Raj NS, Hameed AS.\nComparison of betanodavirus replication efficiency in ten Indian fish cell\nlines. Adv Virol. 2013;158(6):1367–1375. doi: 10.1007/s00705-013-1617-7.\n[PubMed] [CrossRef] [Google Scholar]\n\n33\\. Liu X, Wen Y, Hu X, Wang W, Liang X, Li J, Vakharia V, Lin L. Breaking\nthe host range: mandarin fish is susceptible to a vesiculovirus derived from\nsnakehead fish. J Gen Virol. 2015;96(4):775–781. doi: 10.1099/vir.0.000037.\n[PubMed] [CrossRef] [Google Scholar]\n\n34\\. El-Etr SH, Yan L, Cirillo JD. Fish monocytes as a model for mycobacterial\nhost-pathogen interactions. Infect Immun. 2001;69:7310–7317. doi:\n10.1128/IAI.69.12.7310-7317.2001. [PMC free article] [PubMed] [CrossRef]\n[Google Scholar]\n\n35\\. Noguera PA, Grunow B, Klinger M, Lester K, Collet B, Del-Pozo J. Atlantic\nsalmon cardiac primary cultures: An in vitro model to study viral host\npathogen interactions and pathogenesis. PLoS ONE. 2017;12(7):e0181058. doi:\n10.1371/journal.pone.0181058. [PMC free article] [PubMed] [CrossRef] [Google\nScholar]\n\n36\\. Fryer JL, Lannan CN. Rickettsial infections of fish. Annu Rev Fish Dis.\n1996;6:3–13. doi: 10.1016/S0959-8030(96)90002-2. [CrossRef] [Google Scholar]\n\n37\\. McIntosh D, Flano E, Grayson TH, Gilpin ML, Austin B, Villena AJ.\nProduction of putative virulence factors by _Renibacterium salmoninarum_ grown\nin cell culture. Microbiology. 1997;143(10):3349–3356. doi:\n10.1099/00221287-143-10-3349. [PubMed] [CrossRef] [Google Scholar]\n\n38\\. Menanteau-Ledouble S, Nöbauer K, Razzazi-Fazeli E, El-Matbouli M. Effects\nof Yersinia ruckeri invasion on the proteome of the Chinook salmon cell line\nCHSE-214. Sci Rep. 2020;10(1):1–9. doi: 10.1038/s41598-020-68903-5. [PMC free\narticle] [PubMed] [CrossRef] [Google Scholar]\n\n39\\. Vallejo AN, Ellsaesser CF, Miller NW, Clem LW. Spontaneous development of\nfunctionally active long-term monocytelike cell lines from channel catfish. In\nVitro Cell Develop Biol-Animal. 1991;27(4):279–286. doi: 10.1007/BF02630904.\n[PubMed] [CrossRef] [Google Scholar]\n\n40\\. Faisal M, Ahne W. A cell line (CLC) of adherent peripheral blood\nmononuclear leucocytes of normal common carp _Cyprinus carpio_. Dev Comp\nImmunol. 1990;14(2):255–260. doi: 10.1016/0145-305X(90)90097-X. [PubMed]\n[CrossRef] [Google Scholar]\n\n41\\. Chaudhary DK, Sood N, Rathore G, Pradhan PK, Punia P, Agarwal NK. Jena JK\n(2014) Establishment and characterization of macrophage cell line from thymus\nof _Catla catla_ (Hamilton. Aquac Res. 1822;45(2):299–311. doi:\n10.1111/j.1365-2109.2012.03227.x. [CrossRef] [Google Scholar]\n\n42\\. Koppang EO, Fischer U, Satoh M, Jirillo E. Inflammation in fish as seen\nfrom a morphological point of view with special reference to the vascular\ncompartment. Curr Pharm Des. 2007;13(36):3649–3655. doi:\n10.2174/138161207783018644. [PubMed] [CrossRef] [Google Scholar]\n\n43\\. Ganassin RC, Bols NC. Development of a monocyte/macrophage-like cell\nline, RTS11, from rainbow trout spleen. Fish Shellfish Immunol.\n1998;8(6):457–476. doi: 10.1006/fsim.1998.0153. [CrossRef] [Google Scholar]\n\n44\\. DeWitte-Orr S (2006) A study of innate antiviral mechanisms using fish\ncell lines. http://hdl.handle.net/10012/1272.\n\n45\\. Kales SC, DeWitte-Orr SJ, Bols NC, Dixon B. Response of the rainbow trout\nmonocyte/macrophage cell line, RTS11 to the water molds Achlya and\nSaprolegnia. Mol Immunol. 2007;44(9):2303–2314. doi:\n10.1016/j.molimm.2006.11.007. [PubMed] [CrossRef] [Google Scholar]\n\n46\\. Bell JG, Sargent JR. The incorporation and metabolism of polyunsaturated\nfatty acids in phospholipids of cultured cells from chum salmon (\n_Oncorhynchus keta_ ) Fish Physiol Biochem. 1992;10:99–109. doi:\n10.1007/BF00004521. [PubMed] [CrossRef] [Google Scholar]\n\n47\\. Dehler CE, Boudinot P, Martin SA, Collet B. Development of an efficient\ngenome editing method by CRISPR/Cas9 in a fish cell line. Mar Biotechnol.\n2016;18(4):449–452. doi: 10.1007/s10126-016-9708-6. [PMC free article]\n[PubMed] [CrossRef] [Google Scholar]\n\n48\\. Corripio-Miyar Y, Secombes CJ, Zou J. Long-term stimulation of trout head\nkidney cells with the cytokines MCSF, IL-2 and IL-6: Gene expression dynamics.\nFish Shellfish Immunol. 2012;32(1):35–44. doi: 10.1016/j.fsi.2011.10.016.\n[PubMed] [CrossRef] [Google Scholar]\n\n49\\. Chen SP, Yang HL, Lin HY, Chen MC, Wu JL, Hong JR. Enhanced viability of\na nervous necrosis virus-infected stable cell line over-expressing a fusion\nproduct of the zfBcl-xL and green fluorescent protein genes. J Fish Dis.\n2006;29(6):347–354. doi: 10.1111/j.1365-2761.2006.00725.x. [PubMed] [CrossRef]\n[Google Scholar]\n\n50\\. Zhou Y, Wang M, Jiang M, Peng L, Wan C, Liu J, Liu W, Zhao R, Zhao X, Hu\nW, Liu S, Xiao Y. Autotetraploid cell Line induced by SP600125 from crucian\ncarp and its developmental potentiality. Sci Rep. 2016;6:21814. doi:\n10.1038/srep21814. [PMC free article] [PubMed] [CrossRef] [Google Scholar]\n\n51\\. Collet B, Collins C, Lester K. Engineered cell lines for fish health\nresearch. Dev Comp Immunol. 2018;80:34–40. doi: 10.1016/j.dci.2017.01.013.\n[PubMed] [CrossRef] [Google Scholar]\n\n52\\. Bonham K, Zafarullah M, Gedamu L. The rainbow trout metallothioneins:\nmolecular cloning and characterization of two distinct cDNA sequences. DNA.\n1987;6(6):519–528. doi: 10.1089/dna.1987.6.519. [PubMed] [CrossRef] [Google\nScholar]\n\n53\\. Helmrich A, Bailey GS, Barnes DW. Transfection of cultured fish cells\nwith exogenous DNA. Cytotechnology. 1988;1(3):215–221. doi:\n10.1007/BF00145024. [PubMed] [CrossRef] [Google Scholar]\n\n54\\. Molina A, Carpeaux R, Martial JA, Muller M. A transformed fish cell line\nexpressing a green fluorescent protein-luciferase fusion gene responding to\ncellular stress. Toxicol In Vitro. 2002;16(2):201–207. doi:\n10.1016/S0887-2333(01)00106-0. [PubMed] [CrossRef] [Google Scholar]\n\n55\\. Lester K, Hall M, Urquhart K, Gahlawat S, Collet B. Development of an in\nvitro system to measure the sensitivity to the antiviral Mx protein of fish\nviruses. J Virol Methods. 2012;182(1–2):1–8. doi:\n10.1016/j.jviromet.2012.01.014. [PubMed] [CrossRef] [Google Scholar]\n\n56\\. Kurita K, Burgess SM, Sakai N. Transgenic zebrafish produced by\nretroviral infection of in vitro-cultured sperm. Proc Natl Acad Sci.\n2004;101(5):1263–1267. doi: 10.1073/pnas.0304265101. [PMC free article]\n[PubMed] [CrossRef] [Google Scholar]\n\n57\\. Gabillard JC, Sabin N, Paboeuf G. In vitro characterization of\nproliferation and differentiation of trout satellite cells. Cell Tissue Res.\n2010;342(3):471–477. doi: 10.1007/s00441-010-1071-8. [PubMed] [CrossRef]\n[Google Scholar]\n\n58\\. Tanaka M, Kinoshita M, Kobayashi D, Nagahama Y. Establishment of medaka (\n_Oryzias latipes_ ) transgenic lines with the expression of green fluorescent\nprotein fluorescence exclusively in germ cells: a useful model to monitor germ\ncells in a live vertebrate. Proc Natl Acad Sci. 2001;98(5):2544–2549. doi:\n10.1073/pnas.041315498. [PMC free article] [PubMed] [CrossRef] [Google\nScholar]\n\n59\\. Takeuchi Y, Yoshizaki G, Takeuchi T. Generation of live fry from\nintraperitoneally transplanted primordial germ cells in rainbow trout. Biol\nReprod. 2003;69(4):1142–1149. doi: 10.1095/biolreprod.103.017624. [PubMed]\n[CrossRef] [Google Scholar]\n\n60\\. Hong Y, Liu T, Zhao H, Xu H, Wang W, Liu R, Chen T, Deng J, Gui J.\nEstablishment of a normal medakafish spermatogonial cell line capable of sperm\nproduction in vitro. Proc Natl Acad Sci. 2004;101(21):8011–8016. doi:\n10.1073/pnas.0308668101. [PMC free article] [PubMed] [CrossRef] [Google\nScholar]\n\n61\\. Wakamatsu Y, Ju B, Pristyaznhyuk I, Niwa K, Ladygina T, Kinoshita M,\nAraki K, Ozato K. Fertile and diploid nuclear transplants derived from\nembryonic cells of a small laboratory fish, medaka ( _Oryzias latipes_ ) Proc\nNatl Acad Sci. 2001;98(3):1071–1076. doi: 10.1073/pnas.98.3.1071. [PMC free\narticle] [PubMed] [CrossRef] [Google Scholar]\n\n62\\. Alvarez MC, Bejar J, Chen S, Hong Y. Fish _ES_ cells and applications to\nbiotechnology. Mar Biotechnol. 2007;9:117–127. doi: 10.1007/s10126-006-6034-4.\n[PubMed] [CrossRef] [Google Scholar]\n\n63\\. Yoshizaki G. Gene transfer in salmonidae: applications to aquaculture.\nAquaculture Sci. 2001;49(2):137–142. [Google Scholar]\n\n64\\. Baker BI, Ingleton PM. Secretion of prolactin and growth hormone by\nteleost pituitariesin vitro. J Comp Physiol. 1975;100(4):269–282. doi:\n10.1007/BF00691048. [CrossRef] [Google Scholar]\n\n65\\. Bloch SR, Vo NT, Walsh SK, Chen C, Lee LE, Hodson PV, Bols NC.\nDevelopment of a cell line from the American eel brain expressing endothelial\ncell properties. In Vitro Cell Develop Biol-Animal. 2016;52(4):395–409. doi:\n10.1007/s11626-015-9986-8. [PubMed] [CrossRef] [Google Scholar]\n\n66\\. Kawano A, Haiduk C, Schirmer K, Hanner R, Lee LEJ, Dixon B, Bols NC.\nDevelopment of a rainbow trout intestinal epithelial cell line and its\nresponse to lipopolysaccharide. Aquac Nutr. 2011;17(2):e241–e252. doi:\n10.1111/j.1365-2095.2010.00757.x. [CrossRef] [Google Scholar]\n\n67\\. Wang J, Lei P, Gamil AAA, Lagos L, Yue Y, Schirmer K, Mydland LT,\nØverland M, Krogdahl Å, Kortner TM. Rainbow Trout ( _Oncorhynchus Mykiss_ )\nintestinal epithelial cells as a model for studying gut immune function and\neffects of functional feed ingredients. Front Immunol. 2019;10:152. doi:\n10.3389/fimmu.2019.00152. [PMC free article] [PubMed] [CrossRef] [Google\nScholar]\n\n68\\. Langan LM, Owen SF, Trznadel M, Dodd NJ, Jackson SK, Purcell WM, Jha AN.\nSpheroid size does not impact metabolism of the β-blocker propranolol in 3D\nintestinal fish model. Front Pharmacol. 2018;9:947. doi:\n10.3389/fphar.2018.00947. [PMC free article] [PubMed] [CrossRef] [Google\nScholar]\n\n69\\. Drieschner C, Vo NT, Schug H, Burkard M, Bols NC, Renaud P, Schirmer K.\nImproving a fish intestinal barrier model by combining two rainbow trout cell\nlines: epithelial RTgutGC and fibroblastic RTgutF. Cytotechnology.\n2019;71(4):835–848. doi: 10.1007/s10616-019-00327-0. [PMC free article]\n[PubMed] [CrossRef] [Google Scholar]\n\n70\\. Lee LEJ, Bols NC. Collagen producing fish cell lines and their use in\nbiomedical research. In In Vitro Cell Develop Biol-Animal. 2016;52:17–17.\n[Google Scholar]\n\n71\\. Zaraska M (2013). Lab‐grown beef taste test: ‘Almost’ like a burger.\n_The Washington post_. Retrieved from\nhttp://www.washingtonpost.com/national/health-science/lab-grown-beef-taste-\ntest-almost-like-a-\nburger/2013/08/05/921a5996-fdf4-11e2-96a8-d3b921c0924a_story.html.\n\n72\\. Potter G, Smith AS, Vo NT, Muster J, Weston W, Bertero A, Maves L, Mack\nDL, Rostain A. A more open approach is needed to develop cell-based fish\ntechnology: it starts with Zebrafish. One Earth. 2020;3(1):54–64. doi:\n10.1016/j.oneear.2020.06.005. [CrossRef] [Google Scholar]\n\n73\\. Krueger K, Rubio N, Datar I, Stachura D. Cell-based fish: a novel\napproach to seafood production and an opportunity for cellular agriculture.\nFrontiers in Sustainable Food Systems. 2019;3:43. doi:\n10.3389/fsufs.2019.00043. [CrossRef] [Google Scholar]\n\n74\\. Benjaminson M, Gilchriest J, Lorentz M. In vitro edible muscle protein\nproduction system (MMPS): stage 1, fish. Acta Astronaut. 2002;51:879–889. doi:\n10.1016/S0094-5765(02)00033-4. [PubMed] [CrossRef] [Google Scholar]\n\n75\\. Zhao Z, Lu Y. Establishment and characterization of two cell lines from\nbluefin trevally _Caranx melampygus_. Dis Aquat Org. 2006;68(2):91–100. doi:\n10.3354/dao068091. [PubMed] [CrossRef] [Google Scholar]\n\n76\\. Zhao Z, Montgomery-Brock D, Lee CS, Lu Y. Establishment, characterization\nand viral susceptibility of 3 new cell lines from snakehead, _Channa striatus_\n(Blooch) Methods Cell Sci. 2004;25(3–4):155–166. doi:\n10.1007/s11022-004-3804-0. [PubMed] [CrossRef] [Google Scholar]\n\n77\\. Rougee L, Ostrander GK, Richmond RH, Lu Y. Establishment,\ncharacterization, and viral susceptibility of two cell lines derived from\ngoldfish _Carassius auratus_ muscle and swim bladder. Dis Aquat Org.\n2007;77(2):127–135. doi: 10.3354/dao01802. [PubMed] [CrossRef] [Google\nScholar]\n\n78\\. Kumar A, Singh N, Goswami M, Srivastava JK, Mishra AK, Lakra WS.\nEstablishment and characterization of a new muscle cell line of Zebrafish (\n_Danio rerio_ ) as an in vitro model for gene expression studies. Anim\nBiotechnol. 2016;27(3):166–173. doi: 10.1080/10495398.2016.1147455. [PubMed]\n[CrossRef] [Google Scholar]\n\n79\\. Peng L, Zheng Y, You F, Wu Z, Zou Y, Zhang P. Establishment and\ncharacterization of a testicular Sertoli cell line from olive flounder\n_Paralichthys olivaceus_. Chin J Oceanol Limnol. 2016;34(5):1054–1063. doi:\n10.1007/s00343-016-5091-4. [CrossRef] [Google Scholar]\n\n80\\. Koumans JTM, Akster HA, Dulos GJ, Osse JWM. Myosatellite cells of\n_Cyprinus carpio_ (Teleostei) in vitro: isolation, recognition and\ndifferentiation. Cell Tissue Res. 1990;261(1):173–181. doi:\n10.1007/BF00329450. [CrossRef] [Google Scholar]\n\n81\\. Powell RL, Dodson MV, Cloud JG. Cultivation and differentiation of\nsatellite cells from skeletal muscle of the rainbow trout _Salmo gairdneri_. J\nExp Zool. 1989;250(3):333–338. doi: 10.1002/jez.1402500314. [CrossRef] [Google\nScholar]\n\n82\\. Castellini MA, Somero GN. Buffering capacity of vertebrate muscle:\ncorrelations with potentials for anaerobic function. J Comp Physiol.\n1981;143(2):191–198. doi: 10.1007/BF00797698. [CrossRef] [Google Scholar]\n\n83\\. Anchelin M, Murcia L, Alcaraz-Pérez F, García-Navarro EM, Cayuela ML.\nBehaviour of telomere and telomerase during aging and regeneration in\nzebrafish. PLoS ONE. 2011;6(2):e16955. doi: 10.1371/journal.pone.0016955. [PMC\nfree article] [PubMed] [CrossRef] [Google Scholar]\n\n84\\. Kishimoto K, Washio Y, Yoshiura Y, Toyoda A, Ueno T, Fukuyama H, Kato K,\nKinoshita M. Production of a breed of red sea bream _Pagrus major_ with an\nincrease of skeletal muscle mass and reduced body length by genome editing\nwith CRISPR/Cas9. Aquaculture. 2018;495:415–427. doi:\n10.1016/j.aquaculture.2018.05.055. [CrossRef] [Google Scholar]\n\n85\\. Khalil K, Elayat M, Khalifa E, Daghash S, Elaswad A, Miller M,\nAbdelrahman H, Ye Z, Odin R, Drescher D, Vo K. Generation of myostatin gene-\nedited channel catfish ( _Ictalurus punctatus_ ) via zygote injection of\nCRISPR/Cas9 system. Sci Rep. 2017;7(1):1–12. doi: 10.1038/s41598-017-07223-7.\n[PMC free article] [PubMed] [CrossRef] [Google Scholar]\n\n86\\. Dolgin E. Sizzling interest in lab-grown meat belies lack of basic\nresearch. Nature. 2019;566:161–162. doi: 10.1038/d41586-019-00373-w. [PubMed]\n[CrossRef] [Google Scholar]\n\n87\\. Dhar AK, Manna SK, Allnutt FT. Viral vaccines for farmed finfish\nVirusdisease. 2014;25(1):1–17. doi: 10.1007/s13337-013-0186-4. [PMC free\narticle] [PubMed] [CrossRef] [Google Scholar]\n\n88\\. Genzel Y. Designing cell lines for viral vaccine production: Where do we\nstand? Biotechnol J. 2015;10(5):728–740. doi: 10.1002/biot.201400388. [PubMed]\n[CrossRef] [Google Scholar]\n\n89\\. Oh SY, Kim WS, Oh MJ, Nishizawa T. Multiplication rate of red seabream\niridovirus (RSIV) in rock bream _Oplegnathus fasciatus_ at different fish\nrearing temperatures. Fish Pathology. 2016;51(4):194–198. doi:\n10.3147/jsfp.51.194. [CrossRef] [Google Scholar]\n\n90\\. Nakajima K, Ito T, Kurita J, Kawakami H, Itano T, Fukuda Y, Aoi Y,\nTooriyama T, Manabe S. Effectiveness of a vaccine against red sea bream\niridoviral disease in various cultured marine fish under laboratory\nconditions. Fish Pathology. 2002;37(2):90–91. doi: 10.3147/jsfp.37.90.\n[CrossRef] [Google Scholar]\n\n91\\. Sato A, Okamoto N. Induction of virus-specific cell-mediated cytotoxic\nresponses of isogeneic ginbuna crucian carp, after oral immunization with\ninactivated virus. Fish Shellfish Immunol. 2010;29(3):414–421. doi:\n10.1016/j.fsi.2010.04.017. [PubMed] [CrossRef] [Google Scholar]\n\n92\\. Biering E, Villoing S, Sommerset I, Christie KE. Update on viral vaccines\nfor fish. Devlopmental Biology (Basel) 2005;121:97–113. [PubMed] [Google\nScholar]\n\n93\\. Ortega-Villaizan M, Martinez-Lopez A, Garcia-Valtanen P, Chico V, Perez\nL, Coll JM, Estepa A. Ex vivo transfection of trout pronephros leukocytes, a\nmodel for cell culture screening of fish DNA vaccine candidates. Vaccine.\n2012;30(41):5983–5990. doi: 10.1016/j.vaccine.2012.07.013. [PubMed] [CrossRef]\n[Google Scholar]\n\n94\\. He Y, Xu H, Yang Q, Xu D, Lu L. The use of an in vitro\nmicroneutralization assay to evaluate the potential of recombinant VP5 protein\nas an antigen for vaccinating against Grass carp reovirus. Virology journal.\n2011;8(1):1–6. doi: 10.1186/1743-422X-8-132. [PMC free article] [PubMed]\n[CrossRef] [Google Scholar]\n\n95\\. Balmer BF, Getchell RG, Powers RL, Lee J, Zhang T, Jung ME, Purcell MK,\nSnekvik K, Aguilar HC. Broad-spectrum antiviral JL122 blocks infection and\ninhibits transmission of aquatic rhabdoviruses. Virology. 2018;525:143–149.\ndoi: 10.1016/j.virol.2018.09.009. [PMC free article] [PubMed] [CrossRef]\n[Google Scholar]\n\n96\\. Li C, Fu X, Lin Q, Liu L, Liang H, Huang Z, Li N. Autophagy promoted\ninfectious kidney and spleen necrosis virus replication and decreased\ninfectious virus yields in CPB cell line. Fish Shellfish Immunol.\n2017;60:25–32. doi: 10.1016/j.fsi.2016.11.037. [PubMed] [CrossRef] [Google\nScholar]\n\n97\\. Bonetta L. The inside scoop—evaluating gene delivery methods. Nat Meth.\n2005;2(11):875–883. doi: 10.1038/nmeth1105-875. [CrossRef] [Google Scholar]\n\n98\\. Romoren K, Fjeld XT, Poleo AB, Smistad G, Thu BJ, Evensen O. Transfection\nefficiency and cytotoxicity of cationic liposomes in primary cultures of\nrainbow trout ( _Oncorhynchus mykiss_ ) gill cells. Biochim Biophys Acta.\n2005;1717(1):50–57. doi: 10.1016/j.bbamem.2005.09.011. [PubMed] [CrossRef]\n[Google Scholar]\n\n99\\. Schiotz BL, Rosado EG, Baekkevold ES, Lukacs M, Mjaaland S, Sindre H,\nGrimholt U, Gjøen T. Enhanced transfection of cell lines from Atlantic salmon\nthrough nucoleofection and antibiotic selection. BMC Res Notes. 2011;4(1):136.\ndoi: 10.1186/1756-0500-4-136. [PMC free article] [PubMed] [CrossRef] [Google\nScholar]\n\n100\\. Brocal I, Falco A, Mas V, Rocha A, Perez L, Coll JM, Estepa A. Stable\nexpression of bioactive recombinant pleurocidin in a fish cell line. Appl\nMicrobiol Biotechnol. 2006;72(6):217–1228. doi: 10.1007/s00253-006-0393-7.\n[PubMed] [CrossRef] [Google Scholar]\n\n101\\. Spiteri KW (2014) The establishment of a fibroblastic cell line from\nyellow perch ( _Perca flavescens_ ) and its potential applications in\ntoxicology. https://scholars.wlu.ca/etd/1630/.\n\n102\\. Behrens A, Schirmer K, Bols NC, Segner H. Polycyclic aromatic\nhydrocarbons as inducers of cytochrome P4501A enzyme activity in the rainbow\ntrout liver cell line, RTL-W1, and in primary cultures of rainbow trout\nhepatocytes. Environ Toxicol Chem Int J. 2001;20(3):632–643. doi:\n10.1002/etc.5620200324. [PubMed] [CrossRef] [Google Scholar]\n\n103\\. Lunden T, Miettinen S, Lönnström LG, Lilius EM, Bylund G. Effect of\nflorfenicol on the immune response of rainbow trout ( _Oncorhynchus mykiss_ )\nVet Immunol Immunopathol. 1999;67(4):317–325. doi:\n10.1016/S0165-2427(98)00232-3. [PubMed] [CrossRef] [Google Scholar]\n\n104\\. Russell WMS, Burch RL. The principles of humane experimental technique.\nMethuen; 1959. [Google Scholar]\n\n105\\. Segner H, Blair J, Wirtz G, Miller M. Cultured trout liver-cells-\nutilization of substrates and response to hormones. In Vitro Cellular &\nDevelopmental Biology-Animal. 1994;30A:306–311. doi: 10.1007/BF02631451.\n[PubMed] [CrossRef] [Google Scholar]\n\n106\\. Froehlich JM, Seiliez I, Gabillard JC, Biga PR. Preparation of primary\nmyogenic precursor cell/myoblast cultures from basal vertebrate lineages. J\nVis Exp. 2014 doi: 10.3791/51354. [PMC free article] [PubMed] [CrossRef]\n[Google Scholar]\n\n107\\. Bower NI, Johnston IA. Paralogs of Atlantic salmon myoblast\ndetermination factor genes are distinctly regulated in proliferating and\ndifferentiating myogenic cells. Am J Physiol-Regul Integr Comp Physiol.\n2010;298:R1615–R1626. doi: 10.1152/ajpregu.00114.2010. [PubMed] [CrossRef]\n[Google Scholar]\n\n108\\. Garcia de la Serrana D, Codina M, Capilla E, Jimenez-Amilburu V, Navarro\nI, Du SJ, Johnston IA, Gutierrez J. Characterisation and expression of\nmyogenesis regulatory factors during in vitro myoblast development and in vivo\nfasting in the gilthead sea bream ( _Sparus aurata_ ) Comp Biochem Physiol\nA-Mol Integr Physiol. 2014;167:90–99. doi: 10.1016/j.cbpa.2013.10.020.\n[PubMed] [CrossRef] [Google Scholar]\n\n109\\. Cleveland BM. In vitro and in vivo effects of phytoestrogens on protein\nturnover in rainbow trout ( _Oncorhynchus mykiss_ ) white muscle. Comp Biochem\nPhysiol C-Toxicol Pharm. 2014;165:9–16. doi: 10.1016/j.cbpc.2014.05.003.\n[PubMed] [CrossRef] [Google Scholar]\n\n110\\. Morin G, Pinel K, Dias K, Seiliez I, Beaumatin F. RTH-149 cell line, a\nuseful tool to decipher molecular mechanisms related to fish nutrition. Cells.\n2020;9(8):1754. doi: 10.3390/cells9081754. [PMC free article] [PubMed]\n[CrossRef] [Google Scholar]\n\n111\\. B’chir W, Maurin AC, Carraro V, Averous J, Jousse C, Muranishi Y, Parry\nL, Stepien G, Fafournoux P, Bruhat A. The eIF2 alpha/ATF4 pathway is essential\nfor stress-induced autophagy gene expression. Nucleic Acids Res.\n2013;41:7683–7699. doi: 10.1093/nar/gkt563. [PMC free article] [PubMed]\n[CrossRef] [Google Scholar]\n\n112\\. Kaizuka T, Morishita H, Hama Y, Tsukamoto S, Matsui T, Toyota Y, Kodama\nA, Ishihara T, Mizushima T, Mizushima N. An autophagic flux probe that\nreleases an internal control. Mol Cell. 2016;64:835–849. doi:\n10.1016/j.molcel.2016.09.037. [PubMed] [CrossRef] [Google Scholar]\n\n113\\. Nicklin P, Bergman P, Zhang B, Triantafellow E, Wang H, Nyfeler B, Yang\nH, Hild M, Kung C, Wilson C. Bidirectional transport of amino acids regulates\nmTOR and autophagy. Cell. 2009;136:521–534. doi: 10.1016/j.cell.2008.11.044.\n[PMC free article] [PubMed] [CrossRef] [Google Scholar]\n\n114\\. Beaumatin F, O’Prey J, Barthet VJA, Zunino B, Parvy JP, Bachmann AM,\nO’Prey M, Kania E, Gonzalez PS, Macintosh R. mTORC1 activation requires DRAM-1\nby facilitating lysosomal amino acid efflux. Mol Cell. 2019;76:163–176. doi:\n10.1016/j.molcel.2019.07.021. [PMC free article] [PubMed] [CrossRef] [Google\nScholar]\n\n115\\. Wildt DE. Genome resource banking for wildlife research, management, and\nconservation. ILAR J. 2000;41(4):228–234. doi: 10.1093/ilar.41.4.228. [PubMed]\n[CrossRef] [Google Scholar]\n\n116\\. Goswami M, Mishra A, Ninawe NS, Trudeau VL, Lakra WS. Bio-banking: an\nemerging approach for conservation of fish germplasm. Poultry Fisheries\nWildlife Sci. 2016 doi: 10.4172/2375-446X.1000143. [CrossRef] [Google Scholar]\n\n117\\. Caulfield T, Murdoch B. Genes, cells, and biobanks: Yes, there’s still a\nconsent problem. PLoS Biol. 2017 doi: 10.1371/journal.pbio.2002654. [PMC free\narticle] [PubMed] [CrossRef] [Google Scholar]\n\n118\\. Freshney RI. Culture of animal cells: a manual of basic technique and\nspecialized applications. NJ: Wiley; 2015. [Google Scholar]\n\n119\\. Minghetti M, Drieschner C, Bramaz N, Schug H, Schirmer K. A fish\nintestinal epithelial barrier model established from the rainbow trout (\n_Oncorhynchus mykiss_ ) cell line. RTgutGC Cell biology and toxicology.\n2017;33(6):539–555. doi: 10.1007/s10565-017-9385-x. [PMC free article]\n[PubMed] [CrossRef] [Google Scholar]\n\n120\\. Pasquariello R, Verdile N, Pavlovic R, Panseri S, Schirmer K, Brevini\nTA, Gandolfi F. New stable cell lines derived from the proximal and distal\nintestine of rainbow trout (Oncorhynchus mykiss) retain several properties\nobserved in vivo. Cells. 2021;10(6):1555. doi: 10.3390/cells10061555. [PMC\nfree article] [PubMed] [CrossRef] [Google Scholar]\n\n121\\. Scott J, Belden JB, Minghetti M. Applications of the RTgill-W1 cell line\nfor acute whole-effluent toxicity testing: in vitro–in vivo correlation and\noptimization of exposure conditions. Environ Toxicol Chem.\n2021;40(4):1050–1061. doi: 10.1002/etc.4947. [PubMed] [CrossRef] [Google\nScholar]\n\n122\\. Yu Y, Wei S, Wang Z, Huang X, Huang Y, Cai J, Li C, Qin Q. Establishment\nof a new cell line from the snout tissue of golden pompano _Trachinotus\novatus_ , and its application in virus susceptibility. J Fish Biol.\n2016;88(6):2251–2262. doi: 10.1111/jfb.12986. [PubMed] [CrossRef] [Google\nScholar]\n\n123\\. Ashton I, Clements K, Barrow SE, Secombes CJ, Rowley AF. Effects of\ndietary fatty acids on eicosanoid-generating capacity, fatty acid composition\nand chemotactic activity of rainbow trout ( _Oncorhynchus mykiss_ )\nleucocytes. Biochim Biophys Acta. 1994;1214:253–262. doi:\n10.1016/0005-2760(94)90071-X. [PubMed] [CrossRef] [Google Scholar]\n\n124\\. Tocher DR, Bell JG, Sargent JR. Production of eicosanoids derived from\n20:4n–6 and 20:5n–3 in primary cultures of turbot ( _Scophthalmus maximus_ )\nbrain astrocytes in response to platelet activating factor, substance P and\ninterleukin-1 beta. Comp Biochem Physiol B Biochem Mol Biol. 1996;115:215–222.\ndoi: 10.1016/0305-0491(96)00113-7. [PubMed] [CrossRef] [Google Scholar]\n\n  * Abstract\n  * Introduction\n  * Global status of fish cell lines\n  * Cell line characterization\n  * Fish health management\n  * Pathological & immunological studies\n  * gene-editing and genetic engineering\n  * Transgenic studies and reproductive biotechnology\n  * Fish cell lines as in vitro models\n  * Cell-based aquaculture\n  * Vaccine and other products developed from fish cell culture\n  * Toxicological and environmental monitoring studies\n  * Fish nutrition and metabolism\n  * Biobanking\n  * Conclusion\n  * Acknowledgements\n  * Author's Contribution\n  * Funding\n  * Declarations\n  * Footnotes\n  * References\n\n* * *\n\nArticles from Molecular Biology Reports are provided here courtesy of **Nature\nPublishing Group**\n\n* * *\n\n1\\. Bols NC. Biotechnology and aquaculture: the role of cell cultures.\nBiotechnol Adv. 1991;9(1):31–49. doi: 10.1016/0734-9750(91)90403-I. [PubMed]\n[CrossRef] [Google Scholar] [Ref list]\n\n2\\. Rubio N, Datar I, Stachura D, Krueger K. Cell-based fish: a novel approach\nto seafood production and an opportunity for cellular agriculture. 2019 doi:\n10.20944/preprints201811.0326.v2. [CrossRef] [Google Scholar] [Ref list]\n\n3\\. FDA (2018) Re: Foods Produced Using Animal Cell Culture Technology;\nRequest for Comments; Docket No. FDA-2018-N-2155. [Ref list]\n\n4\\. Wolf K, Quimby MC. Established eurythermic line of fish cells in vitro.\nScience. 1962;135(3508):1065–1066. doi: 10.1126/science.135.3508.1065.\n[PubMed] [CrossRef] [Google Scholar] [Ref list]\n\n5\\. Bairoch A. The Cellosaurus: a cell line knowledge resource. J Biomol Tech.\n2019;18:2902–3002. doi: 10.7171/jbt.18-2902-002. [PMC free article] [PubMed]\n[CrossRef] [Google Scholar] [Ref list]\n\n66\\. Kawano A, Haiduk C, Schirmer K, Hanner R, Lee LEJ, Dixon B, Bols NC.\nDevelopment of a rainbow trout intestinal epithelial cell line and its\nresponse to lipopolysaccharide. Aquac Nutr. 2011;17(2):e241–e252. doi:\n10.1111/j.1365-2095.2010.00757.x. [CrossRef] [Google Scholar] [Ref list]\n\n95\\. Balmer BF, Getchell RG, Powers RL, Lee J, Zhang T, Jung ME, Purcell MK,\nSnekvik K, Aguilar HC. Broad-spectrum antiviral JL122 blocks infection and\ninhibits transmission of aquatic rhabdoviruses. Virology. 2018;525:143–149.\ndoi: 10.1016/j.virol.2018.09.009. [PMC free article] [PubMed] [CrossRef]\n[Google Scholar] [Ref list]\n\n105\\. Segner H, Blair J, Wirtz G, Miller M. Cultured trout liver-cells-\nutilization of substrates and response to hormones. In Vitro Cellular &\nDevelopmental Biology-Animal. 1994;30A:306–311. doi: 10.1007/BF02631451.\n[PubMed] [CrossRef] [Google Scholar] [Ref list]\n\n121\\. Scott J, Belden JB, Minghetti M. Applications of the RTgill-W1 cell line\nfor acute whole-effluent toxicity testing: in vitro–in vivo correlation and\noptimization of exposure conditions. Environ Toxicol Chem.\n2021;40(4):1050–1061. doi: 10.1002/etc.4947. [PubMed] [CrossRef] [Google\nScholar] [Ref list]\n\n6\\. Bejar J, Hong Y, Alvarez MC. An ES-like cell line from the marine fish\n_Sparus aurata_ : characterization and chimaera production. Transgenic Res.\n2002;11(3):279–289. doi: 10.1023/A:1015678416921. [PubMed] [CrossRef] [Google\nScholar] [Ref list]\n\n7\\. Chen SL, Sha ZX, Ye HQ. Establishment of a pluripotent embryonic cell line\nfrom sea perch ( _Lateolabrax japonicus_ ) embryos. Aquaculture.\n2003;218(1–4):141–151. doi: 10.1016/S0044-8486(02)00570-7. [CrossRef] [Google\nScholar] [Ref list]\n\n8\\. Parameswaran V, Shukla R, Bhonde R, Hameed AS. Establishment of embryonic\ncell line from sea bass ( _Lates calcarifer_ ) for virus isolation. J Virol\nMethods. 2006;137(2):309–316. doi: 10.1016/j.jviromet.2006.07.006. [PubMed]\n[CrossRef] [Google Scholar] [Ref list]\n\n9\\. Dash C, Routray P, Tripathy S, Verma DK, Guru BC, Meher PK, Nandi S,\nEknath AE. Derivation and characterization of embryonic stem-like cells of\nIndian major carp _Catla catla_. J Fish Biol. 2010;77(5):1096–1113. doi:\n10.1111/j.1095-8649.2010.02755.x. [PubMed] [CrossRef] [Google Scholar] [Ref\nlist]\n\n10\\. Goswami M, Lakra WS, Yadav K, Jena JK. Development of an ES-like cell\nculture system (RESC) from rohu, Labeo rohita (Ham.) Fish Physiol Biochem.\n2012;38(6):1775–1783. doi: 10.1007/s10695-012-9674-5. [PubMed] [CrossRef]\n[Google Scholar] [Ref list]\n\n11\\. Hong N, Schartl M, Hong Y. Derivation of stable zebrafish ES-like cells\nin feeder-free culture. Cell Tissue Res. 2014;357(3):623–632. doi:\n10.1007/s00441-014-1882-0. [PubMed] [CrossRef] [Google Scholar] [Ref list]\n\n12\\. Geraghty RJ, Capes-Davis A, Davis JM, Downward J, Freshney RI, Knezevic\nI, Lovell-Badge R, Masters JR, Meredith J, Stacey GN, Thraves P, Vias M.\nGuidelines for the use of cell lines in biomedical research. Br J Cancer.\n2014;111(6):1021–1046. doi: 10.1038/bjc.2014.166. [PMC free article] [PubMed]\n[CrossRef] [Google Scholar] [Ref list]\n\n13\\. Kaplan J, Hukku B. Cell line characterization and authentication. In\nMethods in cell biology. Academic Press. 1998;57:203–216. doi:\n10.1016/S0091-679X(08)61579-4. [PubMed] [CrossRef] [Google Scholar] [Ref list]\n\n14\\. Food and Drug Administration (1993) Points to consider in the\ncharacterization of cell lines used to produce biologicals.\nhttps://www.fda.gov/downloads/BiologicsBloodVaccines/SafetyAvailability/UCM162863.pdf.\n[Ref list]\n\n15\\. Almeida JL, Cole KD, Plant AL. Standards for cell line authentication and\nbeyond. PLoS Biol. 2016;14(6):e1002476. doi: 10.1371/journal.pbio.1002476.\n[PMC free article] [PubMed] [CrossRef] [Google Scholar] [Ref list]\n\n16\\. Robin (2019) The Cellosaurus: a cell line knowledge resource.\nhttp://web.expasy.org/cellosaurus/. [PMC free article] [PubMed] [Ref list]\n\n17\\. Yu M, Selvaraj SK, Liang-Chu MM, Aghajani S, Busse M, Yuan J, Lee G,\nPeale F, Klijn C, Bourgon R, Kaminker JS. A resource for cell line\nauthentication, annotation and quality control. Nature.\n2015;520(7547):307–311. doi: 10.1038/nature14397. [PubMed] [CrossRef] [Google\nScholar] [Ref list]\n\n18\\. Fusenig NE, Capes-Davis A, Bianchini F, Sundell S, Lichter P. The need\nfor a worldwide consensus for cell line authentication: experience\nimplementing a mandatory requirement at the International Journal of Cancer.\nPLoS Biol. 2017 doi: 10.1371/journal.pbio.2001438. [PMC free article] [PubMed]\n[CrossRef] [Google Scholar] [Ref list]\n\n19\\. Hebert PD, Ratnasingham S, De Waard JR. Barcoding animal life: cytochrome\nc oxidase subunit 1 divergences among closely related species. Proc R Soc Lond\nB. 2003 doi: 10.1098/rsbl.2003.0025. [PMC free article] [PubMed] [CrossRef]\n[Google Scholar] [Ref list]\n\n20\\. Cooper JK, Sykes G, King S, Cottrill K, Ivanova NV, Hanner R, Ikonomi P.\nSpecies identification in cell culture: a two-pronged molecular approach. In\nVitro Cell Develop Biol-Animal. 2007;43(10):344–351. doi:\n10.1007/s11626-007-9060-2. [PubMed] [CrossRef] [Google Scholar] [Ref list]\n\n21\\. Dubey A, Goswami M, Yadav K, Sharma BS. Development and characterization\nof a cell line WAF from freshwater shark _Wallago attu_. Mol Biol Rep.\n2014;41(2):915–924. doi: 10.1007/s11033-013-2936-1. [PubMed] [CrossRef]\n[Google Scholar] [Ref list]\n\n23\\. Yashwanth BS, Goswami M, Valappil RK, Thakuria D, Chaudhari A.\nCharacterization of a new cell line from ornamental fish _Amphiprion\nocellaris_ (Cuvier, 1830) and its susceptibility to nervous necrosis virus.\nSci Rep. 2020;10(1):1–13. doi: 10.1038/s41598-020-76807-7. [PMC free article]\n[PubMed] [CrossRef] [Google Scholar] [Ref list]\n\n24\\. Wagg SK, Lee LE. A proteomics approach to identifying fish cell lines.\nProteomics. 2005;5(16):4236–4244. doi: 10.1002/pmic.200401290. [PubMed]\n[CrossRef] [Google Scholar] [Ref list]\n\n25\\. Goswami M, Dubey A, Yadav K, Sharma BS, Lakra WS. Identification of fish\ncell lines using 2-D electrophoresis based protein expression signatures. Curr\nProteomics. 2016;13(4):245–252. doi: 10.2174/157016461204160119161034.\n[CrossRef] [Google Scholar] [Ref list]\n\n26\\. Villena AJ. Applications and needs of fish and shellfish cell culture for\ndisease control in aquaculture. Rev Fish Biol Fisheries. 2003;13(1):111–140.\ndoi: 10.1023/A:1026304212673. [CrossRef] [Google Scholar] [Ref list]\n\n27\\. Ariel E, Nicolajsen N, Christophersen MB, Holopainen R, Tapiovaara H,\nJensen BB. Propagation and isolation of ranaviruses in cell culture.\nAquaculture. 2009;294(3–4):159–164. doi: 10.1016/j.aquaculture.2009.05.019.\n[CrossRef] [Google Scholar] [Ref list]\n\n28\\. Lorenzen E, Carstensen B, Olesen NJ. Inter-laboratory comparison of cell\nlines for susceptibility to three viruses: VHSV, IHNV and IPNV. Dis Aquat Org.\n1999;37(2):81–88. doi: 10.3354/dao037081. [PubMed] [CrossRef] [Google Scholar]\n[Ref list]\n\n29\\. Perez-Prieto SI, Rodriguez-Saint-Jean S, Garcia-Rosado E, Castro D,\nAlvarez MC, Borrego JJ. Virus susceptibility of the fish cell line SAF-1\nderived from gilt-head seabream. Dis Aquat Org. 1999;35(2):149–153. doi:\n10.3354/dao035149. [PubMed] [CrossRef] [Google Scholar] [Ref list]\n\n30\\. Dong C, Shuang F, Weng S, He J. Cloning of a new fibroblast cell line\nfrom an early primary culture from mandarin fish ( _Siniperca chuatsi_ ) fry\nfor efficient proliferation of megalocytiviruses. Cytotechnology.\n2014;66(6):883–890. doi: 10.1007/s10616-013-9642-7. [PMC free article]\n[PubMed] [CrossRef] [Google Scholar] [Ref list]\n\n31\\. Collet B, Urquhart K, Noguera P, Larsen KH, Lester K, Smail D, Bruno D. A\nmethod to measure an indicator of viraemia in Atlantic salmon using a reporter\ncell line. J Virol Methods. 2013;191(2):113–117. doi:\n10.1016/j.jviromet.2013.04.009. [PubMed] [CrossRef] [Google Scholar] [Ref\nlist]\n\n32\\. Babu VS, Majeed SA, Nambi KSN, Taju G, Madan N, Raj NS, Hameed AS.\nComparison of betanodavirus replication efficiency in ten Indian fish cell\nlines. Adv Virol. 2013;158(6):1367–1375. doi: 10.1007/s00705-013-1617-7.\n[PubMed] [CrossRef] [Google Scholar] [Ref list]\n\n33\\. Liu X, Wen Y, Hu X, Wang W, Liang X, Li J, Vakharia V, Lin L. Breaking\nthe host range: mandarin fish is susceptible to a vesiculovirus derived from\nsnakehead fish. J Gen Virol. 2015;96(4):775–781. doi: 10.1099/vir.0.000037.\n[PubMed] [CrossRef] [Google Scholar] [Ref list]\n\n34\\. El-Etr SH, Yan L, Cirillo JD. Fish monocytes as a model for mycobacterial\nhost-pathogen interactions. Infect Immun. 2001;69:7310–7317. doi:\n10.1128/IAI.69.12.7310-7317.2001. [PMC free article] [PubMed] [CrossRef]\n[Google Scholar] [Ref list]\n\n35\\. Noguera PA, Grunow B, Klinger M, Lester K, Collet B, Del-Pozo J. Atlantic\nsalmon cardiac primary cultures: An in vitro model to study viral host\npathogen interactions and pathogenesis. PLoS ONE. 2017;12(7):e0181058. doi:\n10.1371/journal.pone.0181058. [PMC free article] [PubMed] [CrossRef] [Google\nScholar] [Ref list]\n\n###### Other Formats\n\n  * PDF (1.0M)\n\n###### Actions\n\n  * Cite\n  * Collections\n\nAdd to Collections\n\n    * Create a new collection\n    * Add to an existing collection\n\nName your collection:\n\nName must be less than characters\n\nChoose a collection:\n\nUnable to load your collection due to an error  \nPlease try again\n\nAdd  Cancel\n\n###### Share\n\n  * _ _\n  * _ _\n  * __ _ _\n\nPermalink\n\nCopy\n\n###### RESOURCES\n\n  * Similar articles \n\n  * Cited by other articles \n\n  * Links to NCBI Databases \n\n[x]\n\nCite\n\nCopy  Download .nbib .nbib\n\nFormat: AMA  APA  MLA  NLM\n\nFollow NCBI\n\nTwitter Facebook LinkedIn GitHub\n\nConnect with NLM\n\n  * SM-Twitter\n  * SM-Facebook\n  * SM-Youtube\n\nNational Library of Medicine  \n8600 Rockville Pike  \nBethesda, MD 20894\n\nWeb Policies  \nFOIA  \nHHS Vulnerability Disclosure\n\nHelp  \nAccessibility  \nCareers\n\n  * NLM\n  * NIH\n  * HHS\n  * USA.gov\n\nExternal link. Please review our privacy policy.\n\n",
    "links": "[{\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/\", \"text\": \"\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/about/userguide/\", \"text\": \"\\n                            User Guide\\n                        \"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/journals/\", \"text\": \"Journal List\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/?term=Springer%20Nature%20PMC%20COVID-19%20Collection[filter]\", \"text\": \"Springer Nature - PMC COVID-19 Collection\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8747882/pdf/11033_2021_Article_6997.pdf\", \"text\": \"PDF (1.0M)\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/journals/\", \"text\": \"Journal List\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/?term=Springer%20Nature%20PMC%20COVID-19%20Collection[filter]\", \"text\": \"Springer Nature - PMC COVID-19 Collection\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/about/disclaimer/\", \"text\": \"PMC Disclaimer\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/about/copyright/\", \"text\": \"\\n        PMC Copyright Notice\\n    \"}, {\"link\": \"https://doi.org/10.1007%2Fs11033-021-06997-4\", \"text\": \"10.1007/s11033-021-06997-4\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/about/disclaimer/\", \"text\": \"PMC Disclaimer\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/about/copyright/\", \"text\": \"Copyright\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8747882/figure/Fig1/\", \"text\": \"1\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8747882/figure/Fig1/\", \"text\": \"fig/graphic|fig/alternatives/graphic mode=\\\"anchored\\\" m1\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8747882/figure/Fig1/\", \"text\": \"\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/core/lw/2.0/html/tileshop_pmc/tileshop_pmc_inline.html?title=Click%20on%20image%20to%20zoom&p=PMC3&id=8747882_11033_2021_6997_Fig1_HTML.jpg\", \"text\": \"\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8747882/figure/Fig1/?report=objectonly\", \"text\": \"Open in a separate window\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8747882/figure/Fig1/\", \"text\": \"Fig. 1\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8747882/table/Tab1/\", \"text\": \"\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8747882/table/Tab1/?report=objectonly\", \"text\": \"Open in a separate window\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8747882/table/Tab2/\", \"text\": \"\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8747882/table/Tab3/\", \"text\": \"\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8747882/table/Tab2/?report=objectonly\", \"text\": \"Open in a separate window\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8747882/table/Tab3/?report=objectonly\", \"text\": \"Open in a separate window\"}, {\"link\": \"https://doi.org/10.1016%2F0734-9750(91)90403-I\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.20944%2Fpreprints201811.0326.v2\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1126%2Fscience.135.3508.1065\", \"text\": \"CrossRef\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5945021/\", \"text\": \"PMC free article\"}, {\"link\": \"https://doi.org/10.7171%2Fjbt.18-2902-002\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1023%2FA%3A1015678416921\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1016%2FS0044-8486(02)00570-7\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1016%2Fj.jviromet.2006.07.006\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1111%2Fj.1095-8649.2010.02755.x\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1007%2Fs10695-012-9674-5\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1007%2Fs00441-014-1882-0\", \"text\": \"CrossRef\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4453835/\", \"text\": \"PMC free article\"}, {\"link\": \"https://doi.org/10.1038%2Fbjc.2014.166\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1016%2FS0091-679X(08)61579-4\", \"text\": \"CrossRef\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4907466/\", \"text\": \"PMC free article\"}, {\"link\": \"https://doi.org/10.1371%2Fjournal.pbio.1002476\", \"text\": \"CrossRef\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5945021/\", \"text\": \"PMC free article\"}, {\"link\": \"https://doi.org/10.1038%2Fnature14397\", \"text\": \"CrossRef\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5393552/\", \"text\": \"PMC free article\"}, {\"link\": \"https://doi.org/10.1371%2Fjournal.pbio.2001438\", \"text\": \"CrossRef\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1698023/\", \"text\": \"PMC free article\"}, {\"link\": \"https://doi.org/10.1098%2Frsbl.2003.0025\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1007%2Fs11626-007-9060-2\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1007%2Fs11033-013-2936-1\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1016%2Fj.tice.2014.04.004\", \"text\": \"CrossRef\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7676255/\", \"text\": \"PMC free article\"}, {\"link\": \"https://doi.org/10.1038%2Fs41598-020-76807-7\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1002%2Fpmic.200401290\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.2174%2F157016461204160119161034\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1023%2FA%3A1026304212673\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1016%2Fj.aquaculture.2009.05.019\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.3354%2Fdao037081\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.3354%2Fdao035149\", \"text\": \"CrossRef\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4235937/\", \"text\": \"PMC free article\"}, {\"link\": \"https://doi.org/10.1007%2Fs10616-013-9642-7\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1016%2Fj.jviromet.2013.04.009\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1007%2Fs00705-013-1617-7\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1099%2Fvir.0.000037\", \"text\": \"CrossRef\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC98816/\", \"text\": \"PMC free article\"}, {\"link\": \"https://doi.org/10.1128%2FIAI.69.12.7310-7317.2001\", \"text\": \"CrossRef\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5519056/\", \"text\": \"PMC free article\"}, {\"link\": \"https://doi.org/10.1371%2Fjournal.pone.0181058\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1016%2FS0959-8030(96)90002-2\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1099%2F00221287-143-10-3349\", \"text\": \"CrossRef\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7366648/\", \"text\": \"PMC free article\"}, {\"link\": \"https://doi.org/10.1038%2Fs41598-020-68903-5\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1007%2FBF02630904\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1016%2F0145-305X(90)90097-X\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1111%2Fj.1365-2109.2012.03227.x\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.2174%2F138161207783018644\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1006%2Ffsim.1998.0153\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1016%2Fj.molimm.2006.11.007\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1007%2FBF00004521\", \"text\": \"CrossRef\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5007268/\", \"text\": \"PMC free article\"}, {\"link\": \"https://doi.org/10.1007%2Fs10126-016-9708-6\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1016%2Fj.fsi.2011.10.016\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1111%2Fj.1365-2761.2006.00725.x\", \"text\": \"CrossRef\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4761888/\", \"text\": \"PMC free article\"}, {\"link\": \"https://doi.org/10.1038%2Fsrep21814\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1016%2Fj.dci.2017.01.013\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1089%2Fdna.1987.6.519\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1007%2FBF00145024\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1016%2FS0887-2333(01)00106-0\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1016%2Fj.jviromet.2012.01.014\", \"text\": \"CrossRef\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC337041/\", \"text\": \"PMC free article\"}, {\"link\": \"https://doi.org/10.1073%2Fpnas.0304265101\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1007%2Fs00441-010-1071-8\", \"text\": \"CrossRef\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC30174/\", \"text\": \"PMC free article\"}, {\"link\": \"https://doi.org/10.1073%2Fpnas.041315498\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1095%2Fbiolreprod.103.017624\", \"text\": \"CrossRef\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC419548/\", \"text\": \"PMC free article\"}, {\"link\": \"https://doi.org/10.1073%2Fpnas.0308668101\", \"text\": \"CrossRef\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC14710/\", \"text\": \"PMC free article\"}, {\"link\": \"https://doi.org/10.1073%2Fpnas.98.3.1071\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1007%2Fs10126-006-6034-4\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1007%2FBF00691048\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1007%2Fs11626-015-9986-8\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1111%2Fj.1365-2095.2010.00757.x\", \"text\": \"CrossRef\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6374633/\", \"text\": \"PMC free article\"}, {\"link\": \"https://doi.org/10.3389%2Ffimmu.2019.00152\", \"text\": \"CrossRef\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6113889/\", \"text\": \"PMC free article\"}, {\"link\": \"https://doi.org/10.3389%2Ffphar.2018.00947\", \"text\": \"CrossRef\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6663964/\", \"text\": \"PMC free article\"}, {\"link\": \"https://doi.org/10.1007%2Fs10616-019-00327-0\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1016%2Fj.oneear.2020.06.005\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.3389%2Ffsufs.2019.00043\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1016%2FS0094-5765(02)00033-4\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.3354%2Fdao068091\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1007%2Fs11022-004-3804-0\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.3354%2Fdao01802\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1080%2F10495398.2016.1147455\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1007%2Fs00343-016-5091-4\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1007%2FBF00329450\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1002%2Fjez.1402500314\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1007%2FBF00797698\", \"text\": \"CrossRef\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3036734/\", \"text\": \"PMC free article\"}, {\"link\": \"https://doi.org/10.1371%2Fjournal.pone.0016955\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1016%2Fj.aquaculture.2018.05.055\", \"text\": \"CrossRef\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5544710/\", \"text\": \"PMC free article\"}, {\"link\": \"https://doi.org/10.1038%2Fs41598-017-07223-7\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1038%2Fd41586-019-00373-w\", \"text\": \"CrossRef\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3889245/\", \"text\": \"PMC free article\"}, {\"link\": \"https://doi.org/10.1007%2Fs13337-013-0186-4\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1002%2Fbiot.201400388\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.3147%2Fjsfp.51.194\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.3147%2Fjsfp.37.90\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1016%2Fj.fsi.2010.04.017\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1016%2Fj.vaccine.2012.07.013\", \"text\": \"CrossRef\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3070673/\", \"text\": \"PMC free article\"}, {\"link\": \"https://doi.org/10.1186%2F1743-422X-8-132\", \"text\": \"CrossRef\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC10205048/\", \"text\": \"PMC free article\"}, {\"link\": \"https://doi.org/10.1016%2Fj.virol.2018.09.009\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1016%2Fj.fsi.2016.11.037\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1038%2Fnmeth1105-875\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1016%2Fj.bbamem.2005.09.011\", \"text\": \"CrossRef\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3113957/\", \"text\": \"PMC free article\"}, {\"link\": \"https://doi.org/10.1186%2F1756-0500-4-136\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1007%2Fs00253-006-0393-7\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1002%2Fetc.5620200324\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1016%2FS0165-2427(98)00232-3\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1007%2FBF02631451\", \"text\": \"CrossRef\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4136457/\", \"text\": \"PMC free article\"}, {\"link\": \"https://doi.org/10.3791%2F51354\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1152%2Fajpregu.00114.2010\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1016%2Fj.cbpa.2013.10.020\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1016%2Fj.cbpc.2014.05.003\", \"text\": \"CrossRef\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7463835/\", \"text\": \"PMC free article\"}, {\"link\": \"https://doi.org/10.3390%2Fcells9081754\", \"text\": \"CrossRef\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3763548/\", \"text\": \"PMC free article\"}, {\"link\": \"https://doi.org/10.1093%2Fnar%2Fgkt563\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1016%2Fj.molcel.2016.09.037\", \"text\": \"CrossRef\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3733119/\", \"text\": \"PMC free article\"}, {\"link\": \"https://doi.org/10.1016%2Fj.cell.2008.11.044\", \"text\": \"CrossRef\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6892261/\", \"text\": \"PMC free article\"}, {\"link\": \"https://doi.org/10.1016%2Fj.molcel.2019.07.021\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1093%2Filar.41.4.228\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.4172%2F2375-446X.1000143\", \"text\": \"CrossRef\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5526496/\", \"text\": \"PMC free article\"}, {\"link\": \"https://doi.org/10.1371%2Fjournal.pbio.2002654\", \"text\": \"CrossRef\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5658468/\", \"text\": \"PMC free article\"}, {\"link\": \"https://doi.org/10.1007%2Fs10565-017-9385-x\", \"text\": \"CrossRef\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8235179/\", \"text\": \"PMC free article\"}, {\"link\": \"https://doi.org/10.3390%2Fcells10061555\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1002%2Fetc.4947\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1111%2Fjfb.12986\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1016%2F0005-2760(94)90071-X\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1016%2F0305-0491(96)00113-7\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1016%2F0734-9750(91)90403-I\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.20944%2Fpreprints201811.0326.v2\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1126%2Fscience.135.3508.1065\", \"text\": \"CrossRef\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5945021/\", \"text\": \"PMC free article\"}, {\"link\": \"https://doi.org/10.7171%2Fjbt.18-2902-002\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1111%2Fj.1365-2095.2010.00757.x\", \"text\": \"CrossRef\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC10205048/\", \"text\": \"PMC free article\"}, {\"link\": \"https://doi.org/10.1016%2Fj.virol.2018.09.009\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1007%2FBF02631451\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1002%2Fetc.4947\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1023%2FA%3A1015678416921\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1016%2FS0044-8486(02)00570-7\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1016%2Fj.jviromet.2006.07.006\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1111%2Fj.1095-8649.2010.02755.x\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1007%2Fs10695-012-9674-5\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1007%2Fs00441-014-1882-0\", \"text\": \"CrossRef\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4453835/\", \"text\": \"PMC free article\"}, {\"link\": \"https://doi.org/10.1038%2Fbjc.2014.166\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1016%2FS0091-679X(08)61579-4\", \"text\": \"CrossRef\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4907466/\", \"text\": \"PMC free article\"}, {\"link\": \"https://doi.org/10.1371%2Fjournal.pbio.1002476\", \"text\": \"CrossRef\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5945021/\", \"text\": \"PMC free article\"}, {\"link\": \"https://doi.org/10.1038%2Fnature14397\", \"text\": \"CrossRef\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5393552/\", \"text\": \"PMC free article\"}, {\"link\": \"https://doi.org/10.1371%2Fjournal.pbio.2001438\", \"text\": \"CrossRef\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1698023/\", \"text\": \"PMC free article\"}, {\"link\": \"https://doi.org/10.1098%2Frsbl.2003.0025\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1007%2Fs11626-007-9060-2\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1007%2Fs11033-013-2936-1\", \"text\": \"CrossRef\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7676255/\", \"text\": \"PMC free article\"}, {\"link\": \"https://doi.org/10.1038%2Fs41598-020-76807-7\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1002%2Fpmic.200401290\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.2174%2F157016461204160119161034\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1023%2FA%3A1026304212673\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1016%2Fj.aquaculture.2009.05.019\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.3354%2Fdao037081\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.3354%2Fdao035149\", \"text\": \"CrossRef\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4235937/\", \"text\": \"PMC free article\"}, {\"link\": \"https://doi.org/10.1007%2Fs10616-013-9642-7\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1016%2Fj.jviromet.2013.04.009\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1007%2Fs00705-013-1617-7\", \"text\": \"CrossRef\"}, {\"link\": \"https://doi.org/10.1099%2Fvir.0.000037\", \"text\": \"CrossRef\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC98816/\", \"text\": \"PMC free article\"}, {\"link\": \"https://doi.org/10.1128%2FIAI.69.12.7310-7317.2001\", \"text\": \"CrossRef\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5519056/\", \"text\": \"PMC free article\"}, {\"link\": \"https://doi.org/10.1371%2Fjournal.pone.0181058\", \"text\": \"CrossRef\"}, {\"link\": \"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8747882/pdf/11033_2021_Article_6997.pdf\", \"text\": \"PDF (1.0M)\"}, {\"link\": \"https://www.nlm.nih.gov/\", \"text\": \"NLM\"}]"
}