{
    "summary": "Skip to main content\n\n  * Download Article\n\nDownload Article\n\n    * Download PDF \n    * ReadCube \n    * EPUB \n    * XML (NLM) \n\n  * Share on \n\n    *     *     *   * Export citation \n\n    * EndNote \n    * Reference Manager \n    * Simple TEXT file \n    * BibTex \n\n  * 54,335 Total views\n  * 6,415 Downloads\n  * 59 Citations\n\nCitation numbers are available from Dimensions\n\nView article impact\n\n  * View altmetric score\n\n##### SHARE ON\n\n  *   *   * \n\n##### Edited by\n\n###### Selena Ahmed\n\nMontana State University, United States\n\n#####  Reviewed by\n\n###### Peter Neubauer\n\nTechnical University of Berlin, Germany\n\n###### Steve Oh\n\nBioprocessing Technology Institute (A*STAR), Singapore\n\n##### TABLE OF CONTENTS\n\n  *     * Abstract\n    * Introduction\n    * Trends in Seafood Production\n    * Engineering Biology for Seafood Production\n    * Cell-Based Seafood Production\n    * Discussion\n    * Conclusions\n    * Author Contributions\n    * Funding\n    * Conflict of Interest Statement\n    * Acknowledgments\n    * References\n\n  * Export citation\n    * EndNote \n    * Reference Manager \n    * Simple TEXT file \n    * BibTex \n\nCheck for updates\n\n##### People also looked at\n\n##  REVIEW article\n\nFront. Sustain. Food Syst., 11 June 2019  \nSec. Nutrition and Sustainable Diets  \nVolume 3 - 2019 |  https://doi.org/10.3389/fsufs.2019.00043\n\n#####  This article is part of the Research Topic\n\nCellular Agriculture: Biotechnology for Sustainable Food\n\nView all 11 Articles\n\n# Cell-Based Fish: A Novel Approach to Seafood Production and an Opportunity\nfor Cellular Agriculture\n\nNatalie Rubio1,2 Isha Datar2 David Stachura3 David Kaplan1 Kate Krueger2*\n\n  * 1Department of Biomedical Engineering, Tufts University, Medford, MA, United States\n  * 2New Harvest, Brooklyn, NY, United States\n  * 3Department of Biological Sciences, Chico State University, Chico, CA, United States\n\nCellular agriculture is defined as the production of agricultural products\nfrom cell cultures rather than from whole plants or animals. With growing\ninterest in cellular agriculture as a means to address public health,\nenvironmental, and animal welfare challenges of animal agriculture, the\nconcept of producing seafood from fish cell- and tissue-cultures is emerging\nas an approach to address similar challenges with industrial aquaculture\nsystems and marine capture. Cell-based seafood—as opposed to animal-based\nseafood—can combine developments in biomedical engineering with modern\naquaculture techniques. Biomedical engineering developments such as closed-\nsystem bioreactor production of land animal cells create a basis for the large\nscale production of marine animal cells. Aquaculture techniques such as\ngenetic modification and closed system aquaculture have achieved significant\ngains in production that can pave the way for innovations in cell-based\nseafood production. Here, we present the current state of innovation relevant\nto the development of cell-based seafood across multiple species, as well as\nspecific opportunities and challenges that exist for advancing this science.\nThe authors find that the physiological properties of fish cell- and tissue-\nculture may be uniquely suited to cultivation _in vitro_. These physiological\nproperties, including tolerance to hypoxia, high buffering capacity, and low-\ntemperature growth conditions, make marine cell culture an attractive\nopportunity for scaled production of cell-based seafood; perhaps even more so\nthan mammalian and avian cell cultures for cell-based meats. This opportunity,\ncoupled with the unique capabilities of crustacean tissue-friendly scaffolding\nsuch as chitosan, a common seafood waste product and mushroom derivative,\npresents promise for cell-based seafood production via bioreactor cultivation.\nTo become fully realized, cell-based seafood research will require more\nunderstanding of fish muscle cell and tissue cultivation; more investigation\ninto serum-free media formulations optimized for fish cell culture; and\nbioreactor designs tuned to the needs of fish cells for large scale\nproduction.\n\n## Introduction\n\nIt is estimated that industrialized fisheries and fishing due to marine\ncapture have lowered ocean biomass content by up to 80% (Myers and Worm,\n2003). This effect, coupled with the effects of global warming on oceans,\nthreatens to decimate wild fish populations (Funk and Brown, 2009). While some\nherald the rise of aquaculture as an ecological and economic boon (Tidwell and\nAllan, 2001), others feel that its benefits have been overstated and that it\ndoes not fundamentally solve current strains on wild fish populations (Naylor\net al., 2000; Merino et al., 2012). At first glance, aquaculture seems capable\nof relieving the pressures of wild capture, however, this may not be the case.\nCarnivorous farmed fish are often fed wild fish, modifying natural habitats\nthrough harvest and cultivation (Naylor et al., 2000). While aquaculture was\nfound to be a suitable means of feeding the earth's growing population, this\nwould necessitate a reduction of wild-caught fish used for aquaculture feed,\nas many aquacultured fish eat fishmeal derived from wild-caught fish (Merino\net al., 2012). Thus, even as aquaculture increases, so does wild-capture.\n\nThe challenges of feeding the world's growing population in a healthy way and\nin the context of sustainability has been presented (Lindgren et al., 2018).\nIn this thesis, “Eating for the post-Anthropocene: Alternative proteins,\nSilicon Valley and the (bio)politics of food security,” novel animal proteins\nas a new locus for biopolitical disruption are presented as agents that affect\nculture and geographies (Sexton, 2018).\n\nWith oceans at risk, cell-based seafood provides a unique opportunity to\ntransform the sustainability landscape. The concept of producing meat from\ncell cultures rather than from whole animals as a means to provide nutritional\nmuscle tissue is no longer novel (Datar and Betti, 2010). The conversation\naround this concept has centered on the growth of mammalian or avian cells and\ntissues to replace meat, but cellular agriculture could easily be extended to\nfish, mollusk, and crustacean cells and tissues to replace seafoods. Such an\nextension could yield unique benefits that have not yet been explored. There\nare many considerations for cell-based seafood, with significant differences\nto those of cell-based land animals. These considerations include the\nscientific considerations of working with these unique cell lines, and human\nfactors including cultural, gustatory, and regulatory considerations, all fall\nwithin the broader framework of the necessity of this pursuit from a\nsustainability standpoint (Figure 1). While cell-based seafood shares some\ncommon grounding with its land-based analogs in science and human\nconsiderations, sustainability is an even more substantial driver, as cell-\nbased seafood could lead to greater preservation of marine environments.\n\nFIGURE 1\n\n**Figure 1**. Considerations for cell-based seafood are numerous, differing in\nmany respects from those of cell-based land animals. While cell-based seafood\nshares some common ground with land-based analogs in science and human\nconsiderations, sustainability is a more substantial driver, as cell-based\nseafood could lead to greater preservation of marine environments.\n\nPreliminary life-cycle analyses indicate that cultured meat production could\nreduce greenhouse gas emissions by as much as 95% (Tuomisto and Teixeira de\nMattos, 2011). However, the cost of these products remains to be seen as these\nproducts have not yet reached the market. There is much thought that initial\nproduct offerings will be more expensive than conventional meat. It is\npossible that the costs of cultured meat and fish production might lead them\nto become the food of the elite—allowing these individuals the opportunity to\nenjoy the nutritional and food safety benefits, and in some cases bypass the\nguilt of animal consumption (Stephens et al., 2018).\n\nCertain considerations, such as safety regulation and cultural acceptance, are\nmuch harder to quantify, and there is reason to believe that the passage of\ntime and increasing familiarity with cultured foods may support broader\nacceptance. Cultured meat adoption may prove easier and quicker in countries\nsuch as China and India, rather than in the United States (Bryant et al.,\n2019). There are other reports that indicate cultured fish may have a mixed\nreception initially; given most individuals prefer a beef burger or a plant-\nbased burger to a cultured meat burger (Slade, 2018). Such preferences may\nshift over time but do pose short-term challenges for the field.\n\nIn addition, safety regulations are not fully established for cellular\nagriculture products in the United States, United Kingdom, or the\nEuropeanUnion, though a number of regulation-relevant topics were recently\nsummarized (Stephens et al., 2018). Such regulations have not yet reached\ncellular aquaculture.\n\n## Trends in Seafood Production\n\nWhile aquaculture is a very old technology—pictorial engravings suggest that\nEgyptians used aquaculture for fish as early as 2,500 BC (Anon—FAO, 1987)- it\nwas only in the 1970s that aquaculture production became relevant beyond the\nsubsistence and small scale (Asche et al., 2008). Similar to the evolution of\nagricultural land animal farming, aquaculture has moved from extensive systems\nthat depend on natural environments with minimal human intervention, to semi-\nintensive and intensive systems, where producers actively control growing\nconditions through feeding, breeding, disease control and waste removal,\nresulting in much higher production rates (Asche et al., 2008). With the\nintensification of aquaculture comes several challenges similar to the\nintensification of land animal husbandry, including the greater production of\nnitrogen, and phosphorus waste materials from uneaten feed and metabolic waste\nproducts (Yeo et al., 2004). This creates a higher risk of negative\nenvironmental impacts (Piedrahita, 2003), such as the damage of waterways and\npromotion of algal blooms (Paerl et al., 2014). Intensification also increases\nthe risk of pathogen spread from farmed fish to native species (Naylor et al.,\n2000). Furthermore, an absence of research on the welfare of most aquaculture\nspecies has made it difficult to develop welfare standards for farmed aquatic\nanimals, and thus the ethical implications and appropriate welfare regulations\nof aquaculture remain an open question (Browman et al., 2018).\n\nAquaculture has recently surpassed marine capture as the main source of\nseafood for human consumption (Figure 2) (Food FAO, 2018). Global landings for\nmarine capture have remained constant at around 90 million tons per year since\n1994, while global aquaculture of fish and shellfish has nearly doubled over\nthe same time period (Food FAO, 2018), thus aquaculture has not relieved the\ndemand for wild-caught seafood (Naylor et al., 2000). While aquaculture is\noften seen as mitigating overfishing, many farmed fish depend on feed\noriginating from marine capture. Because several marine captured fish are used\nto feed a single carnivorous farmed fish; aquaculture may be decreasing the\nglobal fish supply, rather than increasing it (Naylor and Burke, 2005). While\nfully-controlled aquaculture environments are more efficient production\nsystems than the use of natural conditions (Tacon and Metian, 2008), to date\nthere is no scientific literature about fully-controlled environments for\nproducing seafood from cell cultures rather than from marine animal husbandry.\n\nFIGURE 2\n\n**Figure 2**. Global seafood production by marine capture and aquaculture by\nyear from 2011 to 2016. Aquaculture production has increased while marine\ncapture has remained fairly constant. Fish, crustaceans, mollusks and other\naquatic animals are included, and aquatic mammals, crocodiles, caimans,\nseaweeds, and other aquatic plants are excluded Data adapted from the FAO\n(2018).\n\n## Engineering Biology for Seafood Production\n\nGenetic modification has resulted in spectacular production increases, feed\nconversion rates, and reduced development times for fish in closed systems\n(Muir, 2004). Genetically-modified rohu develop over four times faster than\ntheir traditionally bred counterparts (Venugopal et al., 2004), while\ngenetically-modified mud loaches are able to grow 35 times faster and\nsubstantially larger (Nam et al., 2001). Like the mud loach, genetically-\nmodified tilapia containing a salmon growth hormone spliced to an ocean pout\nantifreeze promoter gene can grow over 320% larger than similarly reared non-\ntransgenic fish (Rahman et al., 1998). The OPAFPcsGH gene, which encodes for\nregulatory elements from ocean pout followed by growth hormone, forms the “all\nfish” chimera gene sequence used in Aquabounty salmon (Hew and Fletcher,\n1996). Aquabounty salmon, approved for manufacture and sale in Canada, develop\ntwice as fast as their wild type counterparts with an impressive feed\nconversion rate 10% higher than farmed salmon (Bisson, 2015). These fish are\nformidable food sources and an ecosystem threat—and thus are produced only in\nclosed, in-land systems as triploid, and therefore infertile females\n(Reichhardt, 2000). Despite these safety measures, significant regulatory\nhurdles, coupled with legislative pressure, have prevented the fish from\nentering the US market (Waltz, 2017). These fish are a good example of the\npower of engineering biology to improve closed-system seafood production.\nThese genome-level advances for closed aquaculture systems may lay important\ngroundwork for cell-based fish production research and development.\n\n## Cell-Based Seafood Production\n\n### The Progression of Cellular Agriculture\n\nIn the past 5 years, research focused on cell-based meats has accelerated from\nthe tasting of the cell-cultured hamburger in 2013 (Zaraska, 2013) and early\npublications, including life-cycle assessments and basic research (Tuomisto\nand Teixeira de Mattos, 2011; Post, 2012, 2014), to a growing start-up\ncommunity, updated life cycle assessments, and publications focused on\nrefining the technologies required to accelerate cell-based meat production\n(Tuomisto et al., 2014; Krieger et al., 2018; Rubio et al., 2019). To date,\nresearch decisions in cell-based meat production, such as selection of cell\nspecies and cell type have been largely driven by market size and\nenvironmental impact (Rodriguez-Fernandez, 2019), rather than suitability of\ncells species and types suitable for large scale bioreactor cultivation. This\nis the result of a general lack of basic research on the cell cultures of\ncommonly-consumed animals.\n\nCellular agriculture has recently become a topic of interest for regulators in\nthe United States. Given the regulatory jurisdiction of the Food and Drug\nAdministration (FDA) over products of biotechnology and the United States\nDepartment of Agriculture over livestock, there is interest in the regulations\nnecessary for potentially jurisdiction over cell-based meat products (Stephens\net al., 2018). Despite relative clarity over seafood, which is regulated\nentirely by the FDA (except for animals in the order Siluriformes) (Kobbeman,\n2004), cell-based seafood production, and its potential to address a growing\ndemand for seafood while avoiding the challenges of industrial aquaculture,\nhas remained relatively uninvestigated from a regulatory standpoint.\n\n#### Basic Methodology for Cell-Based Seafood Production\n\nAs with cell-based meat production, cell-based seafood relies on advanced\ntechnological developments in the optimization of cell lines, media\nformulation, and bioreactor design (Figure 3) (Datar and Betti, 2010). Like\nany closed cell- or tissue-culture system, a cell-based seafood production\nsystem would consist of the following integrated elements: appropriate cell\ntype(s) from the tissue of interest; a growth media to provide nutrients to\nproliferating and differentiating cells, and a bioreactor to provide the\nclosed environment to support the growth. For three-dimensional tissues, a\nbiocompatible scaffold would be needed to provide structure for cell growth\nand maturation. A muscle protein production system (mpps) for goldfish was\ndeveloped in 2002 with NASA funding (Benjaminson et al., 2002), however, there\nare no other examples of cell-based seafood production published during this\ntime period.\n\nFIGURE 3\n\n**Figure 3**. Cell-based seafood production will require the appropriate: (1)\ncell line(s), (2) compatible scaffold, (3) medium, and (4) bioreactor (Edelman\net al., 2005).\n\nBioreactors are complex closed-system environments for producing biomass that\nrequire the constant monitoring (feedback loops for process control),\nmaintenance, and optimization of several parameters. Marine cell cultures may\nbe more forgiving in terms of temperature, pH and oxygen requirements compared\nto mammalian cell cultures, based on the unique characteristics of native fish\nmuscle tissue. This difference has significant implications for energy use and\nthus cost considerations for mass production of cell-based seafood. These\ndifferences also present a new set of research opportunities for cellular\nagriculture and toward large-scale tissue engineering in general; most\nmedically-motivated tissue engineering is focused on generating smaller scale\ntissues, usually no larger than organs (Griffith and Naughton, 2002).\n\n#### Characteristics of Native Fish Muscle Tissue Compared to Mammalian Cell\nCulture\n\nDisciplines such as bioengineering, cell biology, and genetics have made\nsignificant gains in the understanding of cell and tissue culture over the\npast 20 years—however these advances have been mostly focused on mammalian\nsystems. Cells and tissues from fish and other marine species have not yet\nbeen widely investigated _in vitro_. In contrast, native fish muscle\nphysiology has been relatively well-researched because of the implications for\naquaculture. Some experimentation and assays have been carried out on\nharvested native muscle tissues from fresh water and marine animals\n(Castellini and Somero, 1981; Eberlee and Storey, 1984; Anchelin et al.,\n2011), and these studies provide interesting insights into the potential\ncapabilities of fish muscle in culture.\n\nNative fish muscle consists of three muscle types—each of which differs\nbetween species depending on fish type, location, and feed (Kiessling et al.,\n2006). In teleost and elasmobranch fish, there are three muscle types: red,\nwhite, and pink. Red muscle is highly vascularized and is comprised of slow\ntwitch fibers with a high density of mitochondria and a rich supply of\ncapillaries (Johnston, 2001). This muscle is for slow, sustainable swimming\nspeeds, and relies on aerobic metabolic pathways. White muscles are fast\ntwitch, tightly packed with myofibrils, and primarily utilize anaerobic\nmetabolic pathways (Kiessling et al., 2006). White muscle is used for burst-\nswimming and fast starts. Pink muscle shares some of the characteristics of\nboth white and red muscle (Johnston, 2001).\n\nThe variety of fish muscle cell types, which vary in physiology and metabolic\npathway, may offer a range of options when designing closed cultivation\nsystems for cell-based seafood production. Native fish muscle also has\ncharacteristics related to metabolism, as described below, that, if exploited\nin _ex vivo_ tissue culture, would make this tissue source uniquely suited for\ncell-based production.\n\n### Oxygen Requirements\n\n#### Mammalian Cell Culture\n\nLow oxygen concentrations are detrimental to mammalian cell growth and\nrecombinant protein production (Wang et al., 1994), and thus dissolved oxygen\nconcentration and air saturation are important variables that must be\nmonitored and maintained in bioreactor systems. Air saturation levels of\n40–60% are often required for mammalian cell culture (Furukawa and Ohsuye,\n1998; Link et al., 2004; Zhu et al., 2005). Air saturation and oxygen levels\nbecome even more critical in three-dimensional, thick vascularized tissues\nwhere oxygen diffusion limits the development of tissues past about 1.8 mm\n(Griffith et al., 2005).\n\n#### Fish Cell Culture\n\nFish are well-adapted to tolerate low oxygen environments as aquatic animals,\nas they are frequently subjected to low oxygen levels that result in hypoxic\nconditions (Vaquer-Sunyer and Duarte, 2008). Interestingly, many coral reef\nfish are tolerant of hypoxic conditions as low as 2.8–0.5% air saturation for\nthe goby _Gobiodon histrio_ and 1.6–0.7% air saturation for the blenny\n_Atrosalarias fuscus_ before showing signs of distress (Nilsson and Ostlund-\nNilsson, 2004). Using a microarray- and bioinformatics-based approach, over\ntwo hundred hypoxia-responsive genes were identified in the Japanese medaka\nbrain, gill, and liver ranging from cell metabolism to RNA processing to\nprotein degradation through the ubiquitin system (Zhang et al., 2009). For\ninstance, Hif-1-alpha is a transcription factor that is present under hypoxic\nconditions–when molecular oxygen is present the protein becomes hydroxylated\nand subsequently degraded by the ubiquitin system (Ivan et al., 2001). This\nhighly tuned system, discovered in mammals, plays a notable role in the\nhypoxia response of fish. Analysis of icefish mRNA revealed that the\nfunctional domains of Hif-1-alpha are highly conserved, indicating continued\nselective pressure exerted by hypoxia (Rix et al., 2017). These and other\nhypoxia response gene relationships have been characterized in detail in the\nhypoxic fish database, HRGFish, which provides a variety of prediction tools\nand validation methods to further evaluate the conservation of hypoxia genes\nin diverse fish species (Rashid et al., 2017).\n\nIn the absence of research on the oxygen requirements of fish cell culture in\nbioreactor systems, the authors speculated that the genetic adaptations of\nfish to the levels of hypoxia suggest that fish tissues may be uniquely suited\nto the oxygen-limited environments found in tissue culture and provided via\nbioreactor conditions. Further, the presence of hypoxia response genes that\nare conserved in mammals suggest potential targets to increase the ability of\nmammalian cells to tolerate low oxygen environments.\n\n### pH Considerations\n\n#### Mammalian Cell Culture\n\nExtracellular pH correlates with intracellular pH in mammalian cell culture\n(Lagadic-Gossmann et al., 2004), while lactic acid, which is formed by cells\nin anaerobic conditions (Brooks, 2009), accumulates over extended periods of\nculture in bioreactor systems (Zhao and Ma, 2005). This accumulation\ncontributes to acidification of the bioreactor environment. The well-\ndocumented relationship between intracellular acidification and cell death\n(Lagadic-Gossmann et al., 2004), and because reduction of extracellular pH\nfrom 6.8 to 6.3 can render cells quiescent (Taylor and Hodson, 1984), pH\ncontrol of bioreactor systems requires fine tuning to optimize cell growth.\nShifting the pH can also be used as an optimization tool, as changes in pH can\naffect protein production and glycosylation (Borys et al., 1993), however\naltering pH to increase protein production and process performance usually\nreduces cell growth and metabolism (Trummer et al., 2006). For mammalian cells\ncultures, the pH of a bioreactor system must be actively maintained to counter\nthe build-up of acidic metabolites like lactic acid, for either cell\nproliferation or protein production, depending on the goals of the culture\nsystem.\n\n#### Fish Cell Culture\n\nA key physiological characteristic of _in vivo_ muscle across species is\nintracellular buffering capacity (Burton, 1978), the ability of a cell to\nmaintain a neutral pH in the presence of metabolic end products such as lactic\nacid (Rogatzki et al., 2015). Intracellular buffering capacity is measured in\nSlykes, or micromoles of base required to change the pH of homogenized tissue\nby one unit per gram of wet weight (Slyke, 1922).\n\nLand mammals such as pigs have buffering capacities of 49.7 Slykes, and cows\n51.9 Slykes, while sea mammals such as the fur seal have buffering capacities\nof 79.2 Slykes, and spotted dolphins 84.1 Slykes (Castellini and Somero,\n1981). White muscle in warm-bodied fishes have particularly high buffering\ncapacities; 102 Slykes in the black skipjack, and 107 Slykes in the albacore\nor double that of many land mammals (Castellini and Somero, 1981). Further,\nmuscle lactate dehydrogenase (LDH), the enzyme responsible for breaking down\nlactic acid in muscle tissue, exhibits up to 2-fold higher activity in warm-\nbodied fish such as the albacore when compared to land animals such as the cow\n(Castellini and Somero, 1981).\n\nThe higher intracellular buffering capacity and the higher muscle lactate\ndehydrogenase activity unique to warm bodied white fish muscle _in vivo_\nsuggest that these muscle tissues may be more resilient than mammalian cells\nin terms of _in vitro_ tissue culture, with an ability to grow well over a\nwider pH range. More research is required to determine if buffering capacity\nof native muscle tissue correlates to the buffering capacity of these tissues\nwhen cultured _in vitro_.\n\n### Temperature Requirements\n\n#### Mammalian Cell Culture\n\nMammalian cells in culture are most often maintained at 37°C, human body\ntemperature, a key factor in mammalian bioreactor process design. However, the\nviability of mutant Chinese hamster ovary cells was improved by alternating\nculture temperatures between 39 and 34°C (Jenkins and Hovey, 1993), while\ncultures grown at 30°C can live longer and produce more protein (Moore et al.,\n1997) than those cultivated at 37°C.\n\n#### Fish Cell Culture\n\nFish vary widely in their adaptation strategies to frigid arctic and Antarctic\nenvironments, speciating at a higher rate near the earth's poles than near the\nequator (Rabosky et al., 2018). Some of these adaptations have resulted in the\ndevelopment of antifreeze defense systems that are optimized for temperatures\nof 0° to 10°C (Abele and Puntarulo, 2004) and an increased production of\nantioxidants, such as marine-derived tocopherol, which is found in greater\nquantities in salmon from cold waters than fish from equatorial waters\n(Yamamoto et al., 2001). Other adaptations include unique oxygen carrying and\nmetabolic capabilities (Verde et al., 2008). In some cases, these adaptations\nmanifest as even the lack of hemoglobin, as is the case in the demersal\nicefish, _Chaenocephalus aceratus_ ; these fish compensate for their lack of\nhemoglobin with increased numbers of mitochondria (Johnston, 1987).\nAdaptations in arctic species exhibit muscle design and mitochondrial density\nsimilar to high-performance adaptations in more equatorial species (Pörtner,\n2002). Fish cell culture conditions typically mirror those of their typical\nhabitats, with culture temperatures varying from 15 to 30°C. Some fish cell\nlines can vary their rate of metabolism within a 5°C temperature range, with\nthe cells metabolizing more quickly at higher temperatures (Courtenay and\nWilliams, 2004). Since fish cells can be cultured at cooler temperatures, this\nreduces the energy required to maintain a constant temperature of a culture\nsystem, and costs associated with producing cell-based seafood at scale. Thus,\ncell-based seafood may offer cost benefits at scale compared to cell-based\nmeats.\n\n### Fish Cell Lines\n\nUntil recently, fish cell lines have found limited applications, mainly to\ntest viral load, to examine water toxicology, and to generate vaccines for\nfarmed fish (Wolf and Mann, 1980; Lai et al., 2008). Few of these cell lines\nhave been utilized to produce edible fish; except for a study focused on\nproducing fish-based proteins for astronauts (Benjaminson et al., 2002). The\nAmerican Type Culture Collection (ATCC) contains over 4,000 cell lines,\nhowever, it does not currently contain any fish muscle cell lines (Hay et al.,\n1992).\n\nFew cell line databases include fish cell lines, while two (FICELdb and\nCellosaurus) do so. FICELdb is a fish cell database that refers to many legacy\nlines dating from 1962 to 1999 (Braga et al., 2006). Cellosaurus is a cell\nline compendium created in 2012 and published in 2018, housed within ExPASy, a\ndatabase maintained by the Swiss Institute for Bioinformatics (Bairoch, 2018).\nIt consists of cell line repositories from around the world, categorizing over\n100,000 known cell lines (Artimo et al., 2012). Interestingly, only 558 are\nimmortalized fish cell lines, only nine are lines of fish cells isolated from\nfish muscle, none of which are myoblastic, all of which have spontaneously\nimmortalized (Bairoch, 2018). While it is likely that not all immortalized\nfish cell lines are represented in these databases, the nine fish cell lines\nidentified in Cellosaurus are displayed in Table 1.\n\nTABLE 1\n\n**Table 1**. Immortalized fish muscle-isolated cell lines available from\nCellosaurus.\n\nTwo of the nine fish cells lines originated from salt water species, both of\nwhich are epithelial in nature: a white sturgeon line spontaneously\nimmortalized in 2003, and a bluefin trevally line from 2006. The cell line\noriginating from barramundi, a euryhaline fish, is fibroblastic. The remaining\nsix fish cell lines originate from fresh water species. Zebrafish _Brachydanio\nrerio_ and Goldfish _Carassius auratus_ are commonly-known model organisms and\npets; the remaining cell lines originate from commonly cultivated species in\nSoutheast Asia; the snakehead murrel, a common food fish in Thailand; the\nSahul Indian catla, a farmed fish that is often grown with other carp species,\nand the helicopter catfish, a species farmed commercially in Malaysia. Of\ninterest, a goldfish cell line, while fibroblastic in nature, was successfully\nutilized to grow edible fish filets (Benjaminson et al., 2002).\n\nWhile these nine cell lines have been useful for culturing a number of fish\npathogens, none have yet been used for bioengineering or tissue engineering\napplications, and none are myoblastic lines. Derivation and characterization\nof myoblastic cell lines from various fish would be an important resource for\nresearchers advancing cell-based seafood production. The availability of fish\ncell lines that are well-characterized could be invaluable for cell-based\nseafood research; similar to the availability of C2C12 cells and their impact\non mammalian muscle tissue engineering (Burattini et al., 2004).\n\n### Cell Isolation Methods\n\nLack of fish cell lines means that most fish tissue culture work is conducted\non primary cells isolated from fish. Fish cell isolation methods are similar\nto mammalian cell isolations (An Introduction to Mammalian Cell Culture,\n2016). In general, the fish is initially sterilized in ethanol, anesthetized,\nand a tissue sample is removed with a biopsy. The tissue sample is then either\nexplanted or enzymatically-digested with collagenase or trypsin. Explanted\ntissues are allowed to attach to the culture plate, and cells migrate from the\ntissue to the culture surface. Culture plates can be coated with proteins to\nenhance cell adhesion (e.g., gelatin, collagen, laminin). Enzymatically-\ndigested tissues are in prepared aqueous solutions, where digestion by trypsin\nor collagenase releases the cells into the liquid medium. The cells are then\nrinsed with buffer to remove contaminants and are often filtered to liberate\nthe cells from the residual debris (Oestbye and Ytteborg, 2018).\n\nWhile these techniques work well for isolating tissue from adult fish, recent\nresearch has begun investigating the isolation of cells from embryonic\nteleosts (Anchelin et al., 2011). Embryonic cells from many wild species and\nwild fish that are artificially fertilized at fish hatcheries are challenging\nto isolate. Additionally, many species of fish have high telomerase activity,\nso primary embryonic cells do not senesce as quickly as in mammalian systems\n(Anchelin et al., 2011). Importantly, while fish do not have embryonic stem\ncells _per se_ , they do have embryonic progenitors that may be coaxed down\ndifferent differentiation pathways (Ghosh et al., 1997; Ma et al., 2001;\nCiarlo et al., 2017).\n\nAs more research is carried out on fish muscle cell types, it should be\npossible to isolate cell types and populations of interest. Magnetic beads\ncoupled to muscle-progenitor-specific antibodies can facilitate rapid\nisolation of these cells with minimal damage (Plouffe et al., 2015).\nAdditionally, fluorescence-activated cell sorting (FACS) is an effective\ntechnique for cell isolation. The main challenge is identifying cell-surface\nproteins that distinguish these progenitor and muscle cells; particularly\nbecause the conservation in sequence with mammalian extracellular proteins is\nvery low (Liongue and Ward, 2007), so most mammalian antibodies do not cross-\nreact with fish-derived cells, thus limiting isolation and identification\noptions.\n\n### Culture Conditions\n\n#### Extracellular Environments and Scaffolds\n\nThe extracellular matrix (ECM) that fish cells need to survive and proliferate\n_in vitro_ is a key area of research interest; most mammalian cell lines are\nplated on tissue-culture plates coated with vacuum gas plasma, which makes the\npolystyrene surface more hydrophilic. Atlantic salmon primary muscle cells\nhave been successfully cultured and differentiated on laminin-coated tissue\nculture plates (Oestbye and Ytteborg, 2018). However, fish cells may require\nsurfaces or scaffolds of different ECM proteins such as elastins, collagens,\nfibronectin, and laminin to adhere and grow efficiently, and may also require\nfish glycoaminoglycans (Frantz et al., 2010; Arima et al., 2013). Optimizing\nthese ECM proteins would also likely be critical to efficient fish culture _in\nvitro_ , especially since fish protein glycosylation patterns are different\nfrom mammals.\n\n#### Growth Media\n\nVariables to consider for fish cell culture growth media include salt\nconcentration, buffer, temperature, carbon source, and pH. Past growth media\nformula suggest a trial and error approach that may not be optimal, including\nthe use of mammalian or insect cell formulations such as Eagle's Medium,\nModified Eagle's Medium (MEM), Medium 199 (M199) and Leibowitz's 15 (L-15)\nmedium (Fernandez et al., 1993). These media are fully defined and easily\nreplicated, including the content of inorganic salts, amino acids, and basic\nnutrients for culture growth. Additional salts are also added for some marine\nspecies such as the grunt (Clem et al., 1961). Fetal bovine serum (FBS) and\nfetal calf serum (FCS) are common additives (Arora, 2013). The use of\nbicarbonate in media formulations aids cell growth and buffering capabilities\nas well (Fernandez et al., 1993). The ability to control the buffering\ncapacity of the media is important; some fish cells require growth at 5%\ncarbon dioxide, but others utilize anoxic or standard oxygen tension\n(Fernandez et al., 1993). These conditions vary between species (and even\nbetween tissues from the same fish) but can be controlled for cell-based\nseafood production. The addition of growth factors, such as fibroblast growth\nfactor (FGF2) has proven to be helpful for the growth of some muscle cell\ncultures, including epithelial tuna cells in L-15 media with 10–20% FBS (Bain\net al., 2013). Attempts to lower the FBS content resulted in reduced cell\nproliferation, while the addition of vitamin E and fatty acids improved\nproliferation (Scholefield and Schuller, 2014).\n\nRemoving FBS or FCS from the media for cell-based seafood production would be\nadvantageous due to the high cost, their animal sources, and their potential\nfor carrying mammalian viruses and prions (Van der Valk et al., 2010).\nInvestigations into the molecular components of fish serum should be useful to\nidentify and then generate _in vitro_ the required components to keep fish\ncells active in culture. Importantly, fats are nutritionally-relevant in\nseafood, especially omega-3 long-chain polyunsaturated fatty acids (PUFAs),\neicosapentaenoic acid (EPA) and docosahexaenoic acid (DHA) (Wall et al.,\n2010). More research is necessary to understand how media composition affects\nthe nutritional quality and taste of cell-based seafood. EPA and DHA are\nnormally produced by marine algae, and studies have focused on large-scale\nproduction of omega-3 fatty acids from algal biomass; these studies indicate\nthat optimization of algal growth and EPA and DHA production has strong\npotential for optimizing the industrial production of PUFAs (Chauton et al.,\n2015; Hamilton et al., 2015) and their inclusion into the media and cells of\n_in vitro_ seafood cultures. The potential for non-animal sourcing of these\nPUFAs is environmentally attractive, avoiding ethical considerations, reducing\npotential contamination of cell-based seafood with animal pathogens, and also\nsignificantly reducing costs.\n\n### Crustacean Cell Culture\n\n#### Cell Lines\n\nCrustacean cell culture research has been pursued for use in aquaculture and\npharmaceutical industries for studying diseases affecting farmed seafood and\nto identify biologics with human clinical relevance (Zhao et al., 2003).\nAttempts have been made to establish cell lines from crustacean tissues to\nimprove isolation and maintenance methodology, including the use of short-term\ncultures obtained from repeated primary cell isolations (Rinkevich, 2005).\nShort-term cultures are sufficient for bench-scale research but not sufficient\nfor cell-based seafood applications with long-term goals of mass production\nand commercialization; thus studies into the long-term culture of these cells\nare essential.\n\nTo advance crustacean tissue culture for food purposes, new strategies for\ndeveloping immortalized or long-term cell lines of relevant lineages such as\nmuscle and fat are needed. Previous crustacean tissue culture studies have\ninstead largely focused on ovarian epithelial and fibroblast cells (Luedeman\nand Lightner, 1992; Fan and Wang, 2002; Maeda et al., 2003). Studies that\nexamined muscle, eye stalk, and hepatopancreas cells in crustaceans found poor\nsurvival and slow growth compared to the ovary-derived epithelial and\nfibroblast cells (George and Dhar, 2010). The most frequently studied\ncrustacean genus is _Penaeus_ which includes shrimp and prawn species. Studies\nwith this species have derived primary cell cultures from ovary,\nhepatopancreas, nerve, lymphoid and hematopoietic tissue (Rinkevich, 2005).\nHowever, to date no continuous crustacean cell lines have been established\n(Rinkevich, 2005).\n\nSignificant effort is needed to derive and characterize crustacean cells for\nuse in cell-based seafood research and development. It is possible that\nestablishment of such cell lines could also be relevant to the aquaculture and\npharmaceutical sectors.\n\n#### Cell Isolation Methods\n\nCell isolation procedures for crustaceans and vertebrates share some\nsimilarities in terms of animal age and digestion procedures. For example,\ncells isolated from younger “pre-molting” prawns have a higher success rate\nfor survival and growth (Tong and Miao, 1996). This is comparable to how more\nproliferative cells are correlated with younger mammal and avian donors\n(Doumit et al., 1990; Mesires and Doumit, 2002). Cell cultivation studies\noften attempt to isolate from both explanted and enzyme-digested tissues. For\nthe explant approach, which is better suited for less dense tissues, the\ntarget tissue is harvested from the animal, rinsed in buffer solution,\ndissected into small sections and allowed to attach to a tissue culture\nsurface. The cells within the explant then proliferate, migrate, and adhere to\nthe substrate. For the enzyme digestion method, digestive enzymes (e.g.,\ntrypsin, collagenase) are incubated with the dissected explants to degrade the\ntissue into single cells in suspension. The slurry is often filtered to remove\nundigested tissue and the enzymes are inhibited after a certain amount of\nincubation time to prevent cell damage. For cell isolations from most shrimp\ntissues, the explant method tends to be more successful than enzyme-digestion\nmethod in terms of cell proliferation, although enzyme digestion is preferred\nfor hepatopancreas tissues (Ma et al., 2017).\n\n#### Culture Conditions\n\nVariables such as temperature, pH and osmolality differ between vertebrate and\ninvertebrate cell culture. The incubation temperature for invertebrates is\nlower than for vertebrates and typically falls within the range of 25–30°C\n(Hink, 1979). The pH of shrimp and prawn cell cultures is typically within pH\n7.0-7.6 (Ma et al., 2017). Osmolality can range between 472 and 760 mmol/kg\ndepending on the hemolymph osmolality of the origin animal (Chen et al., 1986;\nRinkevich, 2005). Carbon dioxide exchange is generally not necessary for\ninvertebrate tissue culture because the basal media tends to be buffered by\nphosphates rather than sodium bicarbonate. While some of the reported\ncrustacean cell cultures (e.g., _Penaeus monodon_ gonad, heart, and epidermis\ncells) reach confluency and survive for extended periods of time with routine\nmedia changes, the cultures often degenerate after a few rounds of subculture\n(Chen et al., 1986; Owens and Smith, 1999). This loss of vitality in culture\nduring passaging can be due to many factors, but may be in part due to\nsensitivity of the cells to the enzymes employed during passaging.\n\nLike fish cells, crustacean cells can be cultured at lower temperatures\n(Toullec, 1999) suggesting an energy savings opportunity for large scale\nbioreactor cultures compared to mammalian cells. Similarly, crustacean cell\nculture does not require carbon dioxide exchange (Ma et al., 2017) obviating\nthe need for a common mammalian cell culture bioreactor parameter control\nsystem.\n\n#### Growth Media\n\nThe basal medium for invertebrate cell culture commonly consists of Grace's\nmedium or L-15 medium, though formulations such as M199 have exhibited\nsuperior effects in some studies (Ma et al., 2017). The standard for mammalian\ncell culture is basal media (e.g., Dulbecco's Modified Eagle Medium, RPMI\n1640, DMEM/F-12) supplemented with animal serum from domestic species like\ncows, horses or chickens. Fetal bovine serum is also important for shrimp cell\nculture at a concentration of 10–20% (Ma et al., 2017). However, this strategy\nhas not been sufficient to maintain crustacean cells in culture long-term, so\nsupplemented media with marine-relevant factors such as lipid solutions or\nhemolymph extracted from various sea creatures has been explored (Chen et al.,\n1986; Rinkevich, 2005). Common supplements include shrimp or crab muscle\nextract and hemolymph from _Penaeus_ species (Ma et al., 2017). These\nadditions likely provide trace and critical growth factors not supplied by\nmammalian serum. Some growth factors have been identified to improve shrimp\nlymphoid and ovarian cultures, including epidermal growth factor and\ntransforming growth factor beta (Ma et al., 2017).\n\nMore study is needed in the development of a sustainable, animal-free media\nfor the growth of crustacean cells. The emphasis on animal-based media likely\nreflects the lack of understanding of the fundamental metabolic and growth\nrequirements for crustacean cells and tissues.\n\n### Mollusk Considerations\n\n#### Buffering Capacity\n\nBuffering capacity varies widely in mollusks with some species exhibiting\nparticularly high buffering capacity (Eberlee and Storey, 1984). The channeled\nwhelk, _Busycotypus canaliculatus_ , has an aerobic buffering capacity in the\nhepatopancreas of 79.4 plus or minus 17.2 Slykes, and a remarkable buffering\ncapacity of almost 120 Slykes following 24 h of anoxic stress (Hetrick et al.,\n1981). While heart muscle tissues appear to have a lower buffering capacity,\nanoxic stress increases the buffering capacity to over 60 Slykes (Eberlee and\nStorey, 1984), a value that is still higher than that of many land animals.\nThe high buffering capacity of mollusks suggests an intrinsic ability of\nmollusk cell cultures to tolerate a wider pH range than mammalian cell\ncultures; assumptions that will require additional research.\n\n#### Cell Culture\n\nMollusk culture has been even more elusive than fish or crustacean cell\ncultures. While primary cell cultures have been attained, continuous cultures\nof mollusk cell lines have yet to achieve sustained proliferation _in vitro_\n(Chen and Wang, 1999). This includes attempts at long-term cultures of clam\nand oyster lines with 138 unique different media formulations (Hetrick et al.,\n1981). Some mitotic activity was observed in scallop cell cultures over 4\nmonths (Odintsova and Khomenko, 1991), and in the surf clam, _Spisula\nsoldissima_ , although the media in the later study contained fetal calf serum\nand whole egg extract (Cecil, 1969). An exception to the challenge of\nproliferative cultures are from abalone species cultivated for pearl\nproduction and hemocyte (blood cell) lines used for toxicological studies. The\nmantle cells derived from tissue explants of _Haliotis varia_ has been\nsuccessfully cultured for 370 days in Medium 199 containing additional salts,\nlactalbumin, kanamycin, sodium bicarbonate and fetal bovine serum (Suja and\nDharmaraj, 2005). The mantle of _H. varia_ was grown in serum free media\ncontaining whole-body extract (Suja et al., 2007). Even fewer mollusk muscle\ncells have been isolated compared to fish. Clam primary cardiomyocytes were\ngrown up to a month (Hanana et al., 2011) and primary cultures of clam heart\ntissue originating from _Meretrix luxoria_ was successfully cultured for over\n5 months (Chen and Wang, 1999).\n\nMollusk cell culture has been understudied, with demonstrated challenges in\nestablishing long term, proliferative, food-relevant cell lines. The success\nin the abalone industry suggests the opportunities are there with sufficient\nfocus on the cell sources and cultivation conditions.\n\n### Scaffolds for Three-Dimensional Tissue Cultivation\n\nCultivating three-dimensional tissues relies on the presence of a scaffold, a\nbiocompatible material capable of supporting cell growth and differentiation\nby providing a suitable morphology, chemical and structural template. Numerous\nscaffolding materials that are employed in medical tissue engineering could be\nrelevant to biofabricated food such as cellulose, alginate and chitosan.\nChitosan is of particular interest because it is edible, inexpensive,\naccessible and well-referenced in tissue engineering literature. Chitosan is a\nfood-relevant material that is derived from chitin; a primary component of\ninsect and crustacean exoskeletons and one of the most prevalent biopolymers\non earth (along with cellulose). Within exoskeletons, chitin exists as\nnanofibril structures, providing mechanical strength to the cuticle (Ifuku,\n2014). Chitosan can also be derived from non-animal sources like fungi, algae,\nand yeast (Croisier and Jérôme, 2013). Chitosan powder can be prepared from\ncrustacean, mushroom or microbial sources after the isolation of chitin and\nthe chemical deacetylation to generate chitosan. This material is then\ndissolved into an aqueous solution which can be cast into a variety of formats\nsuch as membranes, hydrogels, and sponges (Croisier and Jérôme, 2013). Fungal\nchitosan is a preferred source as it is: (1) non-allergenic, (2) customizable\nin terms of molecular weight, and (3) approved for human consumption as a food\nadditive or nutrition supplement (Pochanavanich and Suntornsuk, 2002; Wu et\nal., 2004; Nitschke et al., 2011).\n\n### Scaffold Fabrication\n\nChitosan can be dissolved in acidic solution, such as 1–2% acetic acid in\ndistilled water. The viscosity of the solution increases rapidly with an\nincrease in concentration (Jana et al., 2013). Many scaffolds that support\nvarious cell cultures use chitosan solutions as low as 0.5% (Katalinich,\n2001). To create films to support cell culture, chitosan solutions are cast on\nglass substrates and allowed to dry, then rinsed with buffer to neutralize the\nacetyl groups, washed with water or PBS and sterilized with 70% ethanol and UV\nlight prior to cell seeding (Rubio et al., 2019). Chitosan can also be\nmanipulated to produce physically associated or cross-linked hydrogels (Drury\nand Mooney, 2003), porous sponges with tunable mechanical properties and pore\nsize distributions (Jana et al., 2013; Rubio et al., 2019) and dry or wet spun\nfibers (Croisier and Jérôme, 2013).\n\n## Discussion\n\nGiven the progression of aquaculture toward more intensive, controlled and\nefficient systems, cell-based seafood production offers a new option to\npotentially avert the challenges associated with industrial aquaculture and\nmarine capture. The opportunities and challenges in the field of cell-based\nseafood production were reviewed, covering aspects of marine cell culture,\nnative marine muscle tissue, and marine animal considerations. Because of the\nminimal literature on marine cell cultures, some insights and speculations on\nthe characteristics of marine cell cultures are provided, based on the unique\nproperties of native muscle tissue in fish.\n\nOverall, fish muscle tissue may be well-suited for bioreactor cultivation\nrelative to mammalian muscle tissues, given the ability of fish tissues to:\n(1) endure hypoxic conditions, reducing the need for active oxygenation in\noxygen-limited bioreactor environments; (2) tolerate pH ranges, potentially\nestablishing a wider range of pH in which cell growth is feasible; and (3)\ngrowth at lower temperatures, potentially reducing heat transfer needs of\nbioreactor cultivation at scale and reducing production costs.\n\nA review of the literature on crustacean cell culture indicates that there is\nvery little research that is directly relevant to cell-based food production.\nA review of the literature on mollusk is even more sparse. This dearth in\ndirect insight into marine organisms related to cell isolations, cultivation\nconditions and related needs provides a unique opportunity for scientific\nactivity to help propel the field forward, not only for the field of cellular\nagriculture, but also for novel marine bioproducts and unique metabolic\ninsights with potential translation to benefit human health and the\nenvironment.\n\nApproaches to cell-based seafood production can range from large scale cell\ncultivation, resulting in large masses of seafood-relevant cells and tissues\nfor applications in processed seafoods like surimi; to three-dimensional\ntissue cultivation, resulting in structured products more akin to filets.\nChitosan is a promising, marine-relevant biomaterial for three-dimensional\ntissue culture applications. It is customizable, edible, and widely available;\nmaking it a suitable material to explore for cell-based seafood production, as\nwell as for other tissue engineering and cellular agriculture applications.\n\nThere could be several advantages to producing seafood from cell cultures\nrather than whole marine animals. The production of cell-based seafood has the\npotential to alter many fundamental parameters considered immutable in food\ncultivation, including the production of inedible excess tissues such as\nbones, skin, shells, and scales, that are often discarded and can negatively\nimpact the environment. Cell-based seafood may also shorten cycle time; cell\ncultures may require weeks to months to generate functional foods; while by\ncomparison, genetically-modified Aquabounty salmon require 18 months to grow\nto market size, roughly half the time of a normal salmon (Waltz, 2017).\n\n## Conclusions\n\nProducing seafood from marine cell cultures is a novel seafood production\nmethod and an intriguing opportunity for cellular agriculture. A survey of\nrelevant literature reveals that marine cell and tissue culture is an\nenormously neglected field of research. Few cell lines are available from\nmarine species and none are directly relevant to seafood production. Despite\nthe properties of marine muscle tissue that suggest this as a promising\nopportunity for bioreactor cultivation, the behavior of marine cells in large\nscale culture environments remains speculative. There are several research\ngaps that exist for marine cell culture, alongside several opportunities that\nmake these research gaps worth addressing. With growing interest in cellular\nagriculture as a means to produce meat, milk, eggs, and other animal proteins\nfrom cell cultures, and with the rapid intensification of aquaculture systems,\nthe time is right to investigate the production of seafood without marine\nanimals.\n\n## Author Contributions\n\nKK oversaw the preparation and writing of the manuscript and themes,\ncontributing sections on mollusk cell culture, and oxygen and pH\nconsiderations. NR contributed material on crustacean cell culture and\nchitosan biomaterials, and DS contributed to fish tissue isolation, embryonic\ncells, and muscle cell type sections. ID and DK contributed to the\norganization, writing and editing of the manuscript.\n\n## Funding\n\nNew Harvest is a 501(c)(3) research institute that supports basic research in\ncellular agriculture The research for this review was performed using funding\nto New Harvest from an anonymous donor.\n\n## Conflict of Interest Statement\n\nDS is a scientific advisor for Finless Foods.\n\nThe remaining authors declare that the research was conducted in the absence\nof any commercial or financial relationships that could be construed as a\npotential conflict of interest.\n\n## Acknowledgments\n\nThe authors would like to acknowledge Bradley Silverman for his insights on\nprocess engineering considerations, Arif Malik for his insights on the fish\nmusculature section of this review, Andrew Stout for his insights on the\nWarburg effect, Kevin Cadena for his cultured meat illustrations, Mike Selden\nfor his introductions.\n\n## References\n\nAbele, D., and Puntarulo, S. (2004). Formation of reactive species and\ninduction of antioxidant defence systems in polar and temperate marine\ninvertebrates and fish. _Comp. Biochem. Physiol._ 138, 405–415. doi:\n10.1016/j.cbpb.2004.05.013\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nAhmed, V. I., Babu, V. S., Chandra, V., Nambi, K. S., Thomas, J., Bhonde, R.,\net al. (2009). A new fibroblastic-like cell line from heart muscle of the\nIndian major carp ( _Catla catla_ ): development and characterization.\n_Aquaculture_ 293, 180–186. doi: 10.1016/j.aquaculture.2009.05.012\n\nCrossRef Full Text | Google Scholar\n\nAn Introduction to Mammalian Cell Culture (2016). _An Introduction to\nMammalian Cell Culture_. Available online at:\nhttps://www.aiche.org/resources/publications/cep/2016/april/introduction-\nmammalian-cell-culture\n\nGoogle Scholar\n\nAnchelin, M., Murcia, L., Alcaraz-Pérez, F., García-Navarro, E. M., and\nCayuela, M. L. (2011). Behaviour of telomere and telomerase during aging and\nregeneration in Zebrafish. _PLoS ONE_ 6:16955. doi:\n10.1371/journal.pone.0016955\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nArima, K., Fujita, H., Toita, R., Imazu-Okada, A., Tsutsumishita-Nakai, N.,\nTakeda, N., et al. (2013). Amounts and compositional analysis of\nglycosaminoglycans in the tissue of fish. _Carbohydrate Res._ 366, 25–32. doi:\n10.1016/j.carres.2012.11.010\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nArora, M. (2013). Cell culture media: a review. _Mater Methods_ 3:24. doi:\n10.13070/mm.en.3.175\n\nCrossRef Full Text | Google Scholar\n\nArtimo, P., Jonnalagedda, M., Arnold, K., Baratin, D., Csardi, G., De Castro,\nE., et al. (2012). ExPASy: SIB bioinformatics resource portal. _Nucl. Acids\nRes._ 40, W597–W603. doi: 10.1093/nar/gks400\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nAsche, F., Roll, K. H., and Tveterås, S. (2008). “Future trends in\naquaculture: productivity growth and increased production,” in _Aquaculture in\nthe Ecosystem_ , eds M. Holmer, K. Black, C. M. Duarte, N. Marbà, and I.\nKarakassis (Dordrecht: Springer Netherlands), 271–292. doi:\n10.1007/978-1-4020-6810-2_9\n\nCrossRef Full Text | Google Scholar\n\nBain, P. A., Hutchinson, R. G., Marks, A. B., Crane, M. S. J., and Schuller,\nK. A. (2013). Establishment of a continuous cell line from southern bluefin\ntuna (Thunnus maccoyii). _Aquaculture_ 376, 59–63. doi:\n10.1016/j.aquaculture.2012.11.008\n\nCrossRef Full Text | Google Scholar\n\nBairoch, A. (2018). The cellosaurus, a cell-line knowledge resource. _J.\nBiomol. Tech._ 29, 25–38. doi: 10.7171/jbt.18-2902-002\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nBenjaminson, M. A., Gilchriest, J. A., and Lorenz, M. (2002). _In vitro_\nedible muscle protein production system (MPPS): Stage 1, fish. _Acta\nastronautica_ 51, 879–889. doi: 10.1016/S0094-5765(02)00033-4\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nBisson, R. (2015). _AquaBounty: Label The Salmon, for Everyone's Sake. The\nGuardian_. Available online at: https://www.theguardian.com/sustainable-\nbusiness/2015/dec/21/aquabounty-salmon-fda-gmo-foods-labeling (accessed\nSeptember 7, 2018).\n\nBorys, M. C., Linzer, D. I. H., and Papoutsakis, E. T. (1993). Culture pH\naffects expression rates and glycosylation of recombinant mouse placental\nlactogen proteins by chinese hamster ovary (CHO) Cells. _Nat. Biotechnol._ 11,\n720–724. doi: 10.1038/nbt0693-720\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nBraga, D., Laizé, V., Tiago, D. M., and Cancela, M. L. (2006). Enhanced DNA\ntransfer into fish bone cells using polyethylenimine. _Mol. Biotechnol._ 34,\n51–54. doi: 10.1385/MB:34:1:51\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nBrooks, G. A. (2009). Cell–cell and intracellular lactate shuttles. _J.\nPhysiol._ 587, 5591–5600. doi: 10.1113/jphysiol.2009.178350\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nBrowman, H. I., Cooke, S. J., Cowx, I. G., Derbyshire, S. W. G., Kasumyan, A.,\nKey, B., et al. (2018). Welfare of aquatic animals: where things are, where\nthey are going, and what it means for research, aquaculture, recreational\nangling, and commercial fishing. _ICES J. Mar. Sci_. 76, 82–92. doi:\n10.1093/icesjms/fsy067\n\nCrossRef Full Text | Google Scholar\n\nBryant, C., Szejda, K., Parekh, N., Desphande, V., and Tse, B. (2019). A\nsurvey of consumer perceptions of plant-based and clean meat in the USA,\nIndia, and China. _Front. Sustain. Food Syst._ 3:11. doi:\n10.3389/fsufs.2019.00011\n\nCrossRef Full Text | Google Scholar\n\nBurattini, S., Ferri, P., Battistelli, M., Curci, R., Luchetti, F., and\nFalcieri, E. (2004). C2C12 murine myoblasts as a model of skeletal muscle\ndevelopment: morpho-functional characterization. _Eur. J. Histochem._ 48,\n223–234. doi: 10.4081/891\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nBurton, R. F. (1978). Intracellular buffering. _Respir. Physiol._ 33, 51–58.\ndoi: 10.1016/0034-5687(78)90083-X\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nCastellini, M. A., and Somero, G. N. (1981). Buffering capacity of vertebrate\nmuscle: correlations with potentials for anaerobic function. _J. Comp.\nPhysiol. B_ 143, 191–198. doi: 10.1007/BF00797698\n\nCrossRef Full Text | Google Scholar\n\nCecil, J. T. (1969). Mitoses in cell cultures from cardiac tissue of the surf\nclam Spisula solidissima. _J. Invertebr. Pathol_. 14, 407–410. doi:\n10.1016/0022-2011(69)90170-0\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nChauton, M. S., Reitan, K. I., Norsker, N. H., Tveter, R., and Kleivdal, H. T.\n(2015). A techno-economic analysis of industrial production of marine\nmicroalgae as a source of EPA and DHA-rich raw material for aquafeed: Research\nchallenges and possibilities. _Aquaculture_ 436, 95–103. doi:\n10.1016/j.aquaculture.2014.10.038\n\nCrossRef Full Text | Google Scholar\n\nChen, S. N., CHI, S.-C., Kou, G. H., and Liao, I. C. (1986). Cell culture from\ntissues of grass prawn, _Penaeus_ monodon. _Fish Pathol._ 21, 161–166. doi:\n10.3147/jsfp.21.161\n\nCrossRef Full Text | Google Scholar\n\nChen, S. N., and Wang, C. S. (1999). Establishment of cell lines derived from\noyster, crassostrea gigas thunberg and hard clam, meretrix lusoria röding.\n_Methods Cell Sci._ 21, 183–192. doi: 10.1023/A:1009829807954\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nCiarlo, C., Kaufman, C. K., Kinikoglu, B., Michael, J., Yang, S., D′Amato, C.,\net al. (2017). A chemical screen in zebrafish embryonic cells establishes that\nAkt activation is required for neural crest development. _eLife_ 6:e29145.\ndoi: 10.7554/eLife.29145\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nClem, L. W., Moewus, L., and Michael Sigel, M. (1961). Studies with cells from\nmarine fish in tissue culture. _Proc. Soc. Exp. Biol. Med._ 108, 762–766. doi:\n10.3181/00379727-108-27059\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nCourtenay, P. W. R., and Williams, J. D. (2004). _Snakeheads (Pisces,\nChannidae): A Biological Synopsis and Risk Assessment_. Reston, VA: United\nStates Geological Survey.\n\nGoogle Scholar\n\nCroisier, F., and Jérôme, C. (2013). Chitosan-based biomaterials for tissue\nengineering. _Eur. Poly. J._ 49, 780–792. doi: 10.1016/j.eurpolymj.2012.12.009\n\nCrossRef Full Text | Google Scholar\n\nDatar, I., and Betti, M. (2010). Possibilities for an _in vitro_ meat\nproduction system. _Innov. Food Sci. Emerg. Technol._ 11, 13–22. doi:\n10.1016/j.ifset.2009.10.007\n\nCrossRef Full Text | Google Scholar\n\nDoumit, M. E., McFarland, D. C., and Minshall, R. D. (1990). Satellite cells\nof growing turkeys: influence of donor age and sex on proliferation and\ndifferentiation _in vitro_. _Exper. Cell Res._ 189, 81–86. doi:\n10.1016/0014-4827(90)90259-D\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nDrury, J. L., and Mooney, D. J. (2003). Hydrogels for tissue engineering:\nscaffold design variables and applications. _Biomaterials_ 24, 4337–4351. doi:\n10.1016/S0142-9612(03)00340-5\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nEberlee, J. C., and Storey, K. B. (1984). Buffering capacities of the tissues\nof marine molluscs. _Physiol. Zool._ 57, 567–572. doi:\n10.1086/physzool.57.5.30163950\n\nCrossRef Full Text | Google Scholar\n\nEdelman, P. D., McFarland, D. C., Mironov, V. A., and Matheny, J. G. (2005).\nCommentary: _in vitro_ -cultured meat production. _Tissue Eng._ 11, 659–662.\ndoi: 10.1089/ten.2005.11.659\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nFan, T.-J., and Wang, X.-F. (2002). _In vitro_ culture of embryonic cells from\nthe shrimp, _Penaeus_ chinensis. _J. Exp. Marine Biol. Ecol._ 267, 175–184.\ndoi: 10.1016/S0022-0981(01)00364-1\n\nCrossRef Full Text | Google Scholar\n\nFAO (1987). _FAO Fisheries & Aquaculture-National Aquaculture Sector Overview-\nEgypt_. Available online at:\nhttp://www.fao.org/fishery/countrysector/naso_egypt/en\n\nPubMed Abstract\n\nFAO (2018). _The State of World Fisheries and Aquaculture 2018 - Meeting the\nSustainable Development Goals_. Rome: FAO. Licence: CC BY-NC-SA 3.0 IGO.\n\nFernandez, R. D., Yoshimizu, M., Ezura, Y., and Kimura, T. (1993). Comparative\ngrowth response of fish cell lines in different media, temperatures, and\nsodium chloride concentrations. _Fish Pathol._ 28, 27–34. doi:\n10.3147/jsfp.28.27\n\nCrossRef Full Text | Google Scholar\n\nFood FAO (2018). _The State of World Fisheries and Aquaculture 2018_. Rome:\nContributing to Food Security and Nutrition for All.\n\nGoogle Scholar\n\nFrantz, C., Stewart, K. M., and Weaver, V. M. (2010). The extracellular matrix\nat a glance. _J. Cell. Sci._ 123, 4195–4200. doi: 10.1242/jcs.023820\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nFunk, C. C., and Brown, M. E. (2009). Declining global per capita agricultural\nproduction and warming oceans threaten food security. _Food Security_ 1,\n271–289. doi: 10.1007/s12571-009-0026-y\n\nCrossRef Full Text | Google Scholar\n\nFurukawa, K., and Ohsuye, K. (1998). Effect of culture temperature on a\nrecombinant CHO cell line producing a C-terminal α-amidating enzyme.\n_Cytotechnology_ 26, 153–164. doi: 10.1023/A:1007934216507\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nGeorge, S. K., and Dhar, A. K. (2010). An improved method of cell culture\nsystem from eye stalk, hepatopancreas, muscle, ovary, and hemocytes of\n_Penaeus_ vannamei. _In Vitro Cell. Dev. Biol. Anim._ 46, 801–810. doi:\n10.1007/s11626-010-9343-x\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nGhosh, C., Liu, Y., Ma, C., and Collodi, P. (1997). Cell cultures derived from\nearly zebrafish embryos differentiate _in vitro_ into neurons and astrocytes.\n_Cytotechnology_ 23, 221–230. doi: 10.1023/A:1007915618413\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nGriffith, C. K., Miller, C., Sainson, R. C. A., Calvert, J. W., Jeon, N. L.,\nHughes, C. C. W., et al. (2005). Diffusion limits of an _in vitro_ thick\nprevascularized tissue. _Tissue Eng_. 11, 257–266. doi:\n10.1089/ten.2005.11.257\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nGriffith, L. G., and Naughton, G. (2002). Tissue engineering–current\nchallenges and expanding opportunities. _Science_ 295, 1009–1014. doi:\n10.1126/science.1069210\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nHamilton, M. L., Warwick, J., Terry, A., Allen, M. J., Napier, J. A., and\nSayanova, O. (2015). Towards the industrial production of omega-3 long chain\npolyunsaturated fatty acids from a genetically modified diatom _Phaeodactylum\ntricornutum_. _PLoS ONE_ 10:e0144054. doi: 10.1371/journal.pone.0144054\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nHanana, H., Talarmin, H., Pennec, J. P., Droguet, M., Gobin, E., Marcorelle,\nP., et al. (2011). Establishment of functional primary cultures of heart cells\nfrom the clam Ruditapes decussatus. _Cytotechnology_ 63, 295–305. doi:\n10.1007/s10616-011-9347-8\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nHay, R. J., Caputo, J., and Macy, M. L. (1992). _ATCC Quality Control Methods\nfor Cell Lines_. Manassas, VA: Amer Type Culture Collection.\n\nHetrick, F. M., Stephens, E., Lomax, N., and Lutrell, K. (1981). “Attempts to\ndevelop a marine molluscan cell line,” in _College Park, University of\nMaryland. Sea Grant College Program Technical Report UM-SG-T_ S-81–S-06.\n\nGoogle Scholar\n\nHew, C. L., and Fletcher, G. L. (1996). _Transgenic Salmonid Fish Expressing\nExogenous Salmonid Growth Hormone. Introduction To Aquaculture_. Available\nonline at: http://www.fao.org/docrep/field/003/ac169e/ac169e00.htm (accessed\nOctober 4, 2018).\n\nGoogle Scholar\n\nHink, W. F. (1979). “[39] Cell lines from invertebrates,” in _Methods in\nEnzymology_ , eds W. B. Jakoby and I. H. Pastan (Elsevier), 450–466. doi:\n10.1016/S0076-6879(79)58160-9\n\nCrossRef Full Text | Google Scholar\n\nIfuku, S. (2014). Chitin and chitosan nanofibers: Preparation and chemical\nmodifications. _Molecules_ 19, 18367–18380. doi: 10.3390/molecules191118367\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nIvan, M., Kondo, K., Yang, H., Kim, W., Valiando, J., Ohh, M., et al. (2001).\nHIFalpha targeted for VHL-mediated destruction by proline hydroxylation:\nimplications for O2 sensing. _Science_ 292, 464–468. doi:\n10.1126/science.1059817\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nJana, S., Cooper, A., and Zhang, M. (2013). Chitosan scaffolds with\nunidirectional microtubular pores for large skeletal myotube generation. _Adv.\nHealthcare Mater._ 2, 557–561. doi: 10.1002/adhm.201200177\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nJenkins, N., and Hovey, A. (1993). Temperature control of growth and\nproductivity in mutant Chinese hamster ovary cells synthesizing a recombinant\nprotein. _Biotechnol. Bioeng_. 42, 1029–1036. doi: 10.1002/bit.260420903\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nJohnston, I. A. (1987). Respiratory characteristics of muscle fibres in a fish\n( _Chaenocephalus aceratus_ ) that lacks haem pigments. _J. Experi. Biol._\n133, 415–428.\n\nPubMed Abstract | Google Scholar\n\nJohnston, I. A. (2001). _Fish Physiology: Muscle Development and Growth_.\nHouston, TX: Gulf Professional Publishing.\n\nGoogle Scholar\n\nKatalinich, M. (2001). _Characterization of Chitosan Films for Cell Culture\nApplications_. Orono, ME: University of Maine Digital Library.\n\nGoogle Scholar\n\nKiessling, A., Ruohonen, K., and Bjørnevik, M. (2006). Muscle fibre growth and\nquality in fish. _Archiv fur Tierzucht._ 49, 137–141.\n\nKobbeman, K. E. (2004). Hook, line and sinker: how congress swallowed the\ndomestic catfish industry's narrow definition of this ubiquitous bottomfeeder.\n_Ark. L. Rev._ 57:407.\n\nGoogle Scholar\n\nKrieger, J., Park, B.-W., Lambert, C. R., and Malcuit, C. (2018). 3D skeletal\nmuscle fascicle engineering is improved with TGF-β1 treatment of myogenic\ncells and their co-culture with myofibroblasts. _PeerJ._ 6:e4939. doi:\n10.7717/peerj.4939\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nKumar, A., Singh, N., Goswami, M., Srivastava, J. K., Mishra, A. K., and\nLakra, W. S. (2016). Establishment and characterization of a new muscle cell\nline of Zebrafish ( _Danio rerio_ ) as an _in vitro_ model for gene expression\nstudies. _Anim. Biotechnol._ 27, 166–173. doi: 10.1080/10495398.2016.1147455\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nLagadic-Gossmann, D., Huc, L., and Lecureur, V. (2004). Alterations of\nintracellular pH homeostasis in apoptosis: origins and roles. _Cell Death\nDifferent._ 11:953. doi: 10.1038/sj.cdd.4401466\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nLai, Y.-S., Chiou, P. P., Chen, W.-J., Chen, Y.-C., Chen, C.-W., Chiu, I.-S.,\net al. (2008). Characterization of apoptosis induced by grouper iridovirus in\ntwo newly established cell lines from barramundi, _Lates calcarifer_ (Bloch).\n_J. Fish Dis._ 31, 825–834. doi: 10.1111/j.1365-2761.2008.00957.x\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nLindgren, E., Harris, F., Dangour, A. D., Gasparatos, A., Hiramatsu, M.,\nJavadi, F., et al. (2018). Sustainable food systems—a health perspective.\n_Sustainab. Sci._ 13, 1505–1517. doi: 10.1007/s11625-018-0586-x\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nLink, T., Bäckström, M., Graham, R., Essers, R., Zörner, K., Gätgens, J., et\nal. (2004). Bioprocess development for the production of a recombinant MUC1\nfusion protein expressed by CHO-K1 cells in protein-free medium. _J.\nBiotechnol._ 110, 51–62. doi: 10.1016/j.jbiotec.2003.12.008\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nLiongue, C., and Ward, A. C. (2007). Evolution of class I cytokine receptors.\n_BMC Evolut. Biol._ 7:120. doi: 10.1186/1471-2148-7-120\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nLuedeman, R., and Lightner, D. V. (1992). Development of an _in vitro_ primary\ncell culture system from the _penaeid_ shrimp, _Penaeus_ stylirostris and\n_Penaeus_ vannamei. _Aquaculture_ 101, 205–211. doi:\n10.1016/0044-8486(92)90024-F\n\nCrossRef Full Text | Google Scholar\n\nMa, C., Fan, L., Ganassin, R., Bols, N., and Collodi, P. (2001). Production of\nzebrafish germ-line chimeras from embryo cell cultures. _Proc. Natl. Acad.\nSci. U.S.A._ 98, 2461–2466. doi: 10.1073/pnas.041449398\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nMa, J., Zeng, L., and Lu, Y. (2017). _Penaeid_ shrimp cell culture and its\napplications. _Rev. Aquaculture_ 9, 88–98. doi: 10.1111/raq.12106\n\nCrossRef Full Text | Google Scholar\n\nMaeda, M., Mizuki, E., Itami, T., and Ohba, M. (2003). Ovarian primary tissue\nculture of the kuruma shrimp Marsupenaeus japonicus. _In Vitro Cell. Dev.\nBiol. Anim._ 39, 208–212. doi: 10.1290/1543-706X(2003)039<0208:OPTCOT>2.0.CO;2\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nMerino, G., Barange, M., Blanchard, J. L., Harle, J., Holmes, R., Allen, I.,\net al. (2012). Can marine fisheries and aquaculture meet fish demand from a\ngrowing human population in a changing climate? _Global Environ. Change_ 22,\n795–806. doi: 10.1016/j.gloenvcha.2012.03.003\n\nCrossRef Full Text | Google Scholar\n\nMesires, N. T., and Doumit, M. E. (2002). Satellite cell proliferation and\ndifferentiation during postnatal growth of porcine skeletal muscle. _Am. J.\nPhysiol. Cell Physiol._ 282, C899–C906. doi: 10.1152/ajpcell.00341.2001\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nMoore, A., Mercer, J., Dutina, G., Donahue, C. J., Bauer, K. D., Mather, J.\nP., et al. (1997). Effects of temperature shift on cell cycle, apoptosis and\nnucleotide pools in CHO cell batch cultues. _Cytotechnology_ 23, 47–54. doi:\n10.1023/A:1007919921991\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nMuir, W. M. (2004). The threats and benefits of GM fish. _EMBO Rep._ 5,\n654–659. doi: 10.1038/sj.embor.7400197\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nMyers, R. A., and Worm, B. (2003). Rapid worldwide depletion of predatory fish\ncommunities. _Nature_ 423:280. doi: 10.1038/nature01610\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nNam, Y. K., Noh, J. K., Cho, Y. S., Cho, H. J., Cho, K. N., Kim, C. G., et al.\n(2001). Dramatically accelerated growth and extraordinary gigantism of\ntransgenic mud loach _Misgurnus mizolepis_. _Transgenic Res_. 10, 353–362.\ndoi: 10.1023/A:1016696104185\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nNaylor, R., and Burke, M. (2005). Aquaculture and ocean resources: raising\ntigers of the sea. _Annu. Rev. Environ_. _Resour_. 30, 185–218. doi:\n10.1146/annurev.energy.30.081804.121034\n\nCrossRef Full Text | Google Scholar\n\nNaylor, R. L., Goldburg, R. J., Primavera, J. H., Kautsky, N., Beveridge, M.\nC., Clay, J., et al. (2000). Effect of aquaculture on world fish supplies.\n_Nature_ 405:1017. doi: 10.1038/35016500\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nNilsson, G. E., and Ostlund-Nilsson, S. (2004). Hypoxia in paradise:\nwidespread hypoxia tolerance in coral reef fishes. _Proc. Biol. Sci_. 271\n(Suppl. 3), S30–S33. doi: 10.1098/rsbl.2003.0087\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nNitschke, J., Altenbach, H.-J., Malolepszy, T., and Mölleken, H. (2011). A new\nmethod for the quantification of chitin and chitosan in edible mushrooms.\n_Carbohydrate Res._ 346, 1307–1310. doi: 10.1016/j.carres.2011.03.040\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nOdintsova, N. A., and Khomenko, A. V. (1991). Primary cell culture from\nembryos of the Japanese scallop Mizuchopecten yessoensis (Bivalvia).\n_Cytotechnology_ 6, 49–54. doi: 10.1007/BF00353702\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nOestbye, T. K., and Ytteborg, E. (2018). Preparation and culturing of atlantic\nsalmon muscle cells for _in vitro_ studies. _Myogenesis_ 1889, 319–330. doi:\n10.1007/978-1-4939-8897-6_19\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nOwens, L., and Smith, J. (1999). Early attempts at production of prawn cell\nlines. _Methods Cell Sci._ 21, 207–212. doi: 10.1023/A:1009806606562\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nPaerl, H. W., Gardner, W. S., McCarthy, M. J., Peierls, B. L., and Wilhelm, S.\nW. (2014). Algal blooms: noteworthy nitrogen. _Science_ 346, 175–175. doi:\n10.1126/science.346.6206.175-a\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nPiedrahita, R. H. (2003). Reducing the potential environmental impact of tank\naquaculture effluents through intensification and recirculation. _Aquaculture_\n226, 35–44. doi: 10.1016/S0044-8486(03)00465-4\n\nCrossRef Full Text | Google Scholar\n\nPlouffe, B. D., Murthy, S. K., and Lewis, L. H. (2015). Fundamentals and\napplication of magnetic particles in cell isolation and enrichment. _Rep.\nProg. Phys._ 78:016601. doi: 10.1088/0034-4885/78/1/016601\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nPochanavanich, P., and Suntornsuk, W. (2002). Fungal chitosan production and\nits characterization. _Lett. Appl. Microbiol._ 35, 17–21. doi:\n10.1046/j.1472-765X.2002.01118.x\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nPörtner, H.-O. (2002). Climate variations and the physiological basis of\ntemperature dependent biogeography: systemic to molecular hierarchy of thermal\ntolerance in animals. _Compa. Biochem. Physiol. Part A_ 132, 739–761. doi:\n10.1016/S1095-6433(02)00045-4\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nPost, M. J. (2012). Cultured meat from stem cells: challenges and prospects.\n_Meat Sci._ 92, 297–301. doi: 10.1016/j.meatsci.2012.04.008\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nPost, M. J. (2014). An alternative animal protein source: cultured beef.\n_Anna. N. York Acad. Sci._ 1328, 29–33. doi: 10.1111/nyas.12569\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nRabosky, D. L., Chang, J., Title, P. O., Cowman, P. F., Sallan, L., Friedman,\nM., et al. (2018). An inverse latitudinal gradient in speciation rate for\nmarine fishes. _Nature_ 559, 392–395. doi: 10.1038/s41586-018-0273-1\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nRahman, M. A., Mak, R., Ayad, H., Smith, A., and Maclean, N. (1998).\nExpression of a novel piscine growth hormone gene results in growth\nenhancement in transgenic tilapia ( _Oreochromis niloticus_ ). _Transgenic\nRes_. 7, 357–369. doi: 10.1023/A:1008837105299\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nRashid, I., Nagpure, N. S., Srivastava, P., Kumar, R., Pathak, A. K., Singh,\nM., et al. (2017). HRGFish: a database of hypoxia responsive genes in fishes.\n_Sci. Rep._ 7:42346. doi: 10.1038/srep42346\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nReichhardt, T. (2000). _Will Souped Up Salmon Sink or Swim?_ London, UK:\nNature Publishing Group. doi: 10.1038/35017657\n\nCrossRef Full Text | Google Scholar\n\nRinkevich, B. (2005). Marine invertebrate cell cultures: new millennium\ntrends. _Marine Biotechnol._ 7, 429–439. doi: 10.1007/s10126-004-0108-y\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nRix, A. S., Grove, T. J., and O'Brien, K. M. (2017). Hypoxia-inducible\nfactor-1α in Antarctic notothenioids contains a polyglutamine and glutamic\nacid insert that varies in length with phylogeny. _Polar Biol._ 40, 2537–2545.\ndoi: 10.1007/s00300-017-2164-6\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nRodriguez-Fernandez, C. (2019). Beyond the lab-grown burger: “cellular\nagriculture” is taking over the food industry. _Labiotech.eu_. Available\nonline at: https://labiotech.eu/features/cellular-agriculture-food-industry/\n\nRogatzki, M. J., Ferguson, B. S., Goodwin, M. L., and Gladden, L. B. (2015).\nLactate is always the end product of glycolysis. _Front. Neurosci._ 9:00022.\ndoi: 10.3389/fnins.2015.00022\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nRougée, L., Ostrander, G. K., Richmond, R. H., and Lu, Y. (2007).\nEstablishment, characterization, and viral susceptibility of two cell lines\nderived from goldfish Carassius auratus muscle and swim bladder. _Dis. Aquat.\nOrgan._ 77, 127–135. doi: 10.3354/dao01802\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nRubio, N. R., Fish, K. F., Trimmer, B. A., and Kaplan, D. L. (2019). _In\nvitro_ insect muscle for tissue engineering applications. _ACS Biomater. Sci.\nEng_. 5, 1071–1082. doi: 10.1021/acsbiomaterials.8b01261\n\nCrossRef Full Text | Google Scholar\n\nScholefield, A. M., and Schuller, K. A. (2014). Cell proliferation and long\nchain polyunsaturated fatty acid metabolism in a cell line from southern\nbluefin tuna ( _Thunnus maccoyii_ ). _Lipids_ 49, 703–714. doi:\n10.1007/s11745-014-3910-y\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nSexton, A. E. (2018). Eating for the post-Anthropocene: alternative proteins\nand the biopolitics of edibility. _Transac. Institute Br. Geogr._ 43, 586–600.\ndoi: 10.1111/tran.12253\n\nCrossRef Full Text | Google Scholar\n\nSlade, P. (2018). If you build it, will they eat it? Consumer preferences for\nplant-based and cultured meat burgers. _Appetite_ 125, 428–437. doi:\n10.1016/j.appet.2018.02.030\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nSlyke, D. D. V. (1922). On the measurement of buffer values and on the\nrelationship of buffer value to the dissociation constant of the buffer and\nthe concentration and reaction of the buffer solution. _J. Biol. Chem._ 52,\n525–570.\n\nGoogle Scholar\n\nStephens, N., Di Silvio, L., Dunsford, I., Ellis, M., Glencross, A., and\nSexton, A. (2018). Bringing cultured meat to market: technical, socio-\npolitical, and regulatory challenges in cellular agriculture. _Trends Food\nSci. Technol._ 78, 155–166. doi: 10.1016/j.tifs.2018.04.010\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nSuja, C. P., and Dharmaraj, S. (2005). _In vitro_ culture of mantle tissue of\nthe abalone Haliotis varia Linnaeus. _Tissue Cell_ 37, 1–10. doi:\n10.1016/j.tice.2004.08.002\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nSuja, C. P., Sukumaran, N., and Dharmaraj, S. (2007). Effect of culture media\nand tissue extracts in the mantle explant culture of abalone, Haliotis varia\nLinnaeus. _Aquaculture_ 271, 516–522. doi: 10.1016/j.aquaculture.2007.04.086\n\nCrossRef Full Text | Google Scholar\n\nTacon, A. G. J., and Metian, M. (2008). Global overview on the use of fish\nmeal and fish oil in industrially compounded aquafeeds: trends and future\nprospects. _Aquaculture_ 285, 146–158. doi: 10.1016/j.aquaculture.2008.08.015\n\nCrossRef Full Text | Google Scholar\n\nTaylor, I. W., and Hodson, P. J. (1984). Cell cycle regulation by\nenvironmental pH. _J. Cell. Physiol._ 121, 517–525. doi:\n10.1002/jcp.1041210310\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nTidwell, J. H., and Allan, G. L. (2001). Fish as food: aquaculture's\ncontribution. _EMBO Rep._ 2, 958–963. doi: 10.1093/embo-reports/kve236\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nTong, S., and Miao, H.-Z. (1996). Attempts to initiate cell cultures from\n_Penaeus_ chinensis tissues. _Aquaculture_ 147, 151–157. doi:\n10.1016/S0044-8486(96)01386-5\n\nCrossRef Full Text | Google Scholar\n\nToullec, J.-Y. (1999). _Crustacean_ primary cell culture: a technical\napproach. _Methods Cell Sci._ 21, 193–198. doi: 10.1023/A:1009833924792\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nTrummer, E., Fauland, K., Seidinger, S., Schriebl, K., Lattenmayer, C.,\nKunert, R., et al. (2006). Process parameter shifting: Part I. Effect of DOT,\npH, and temperature on the performance of Epo-Fc expressing CHO cells\ncultivated in controlled batch bioreactors. _Biotechnol. Bioeng._ 94,\n1033–1044. doi: 10.1002/bit.21013\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nTuomisto, H. L., Ellis, M. J., and Haastrup, P. (2014). “Environmental impacts\nof cultured meat: alternative production scenarios,” in _Proceedings of the\n9th International Conference on Life Cycle Assessment in the Agri-Food Sector_\n(San Francisco, CA), 8–10.\n\nGoogle Scholar\n\nTuomisto, H. L., and Teixeira de Mattos, M. J. (2011). Environmental impacts\nof cultured meat production. _Environ. Sci. Technol._ 45, 6117–6123. doi:\n10.1021/es200130u\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nVan der Valk, J., Brunner, D., De Smet, K., Fex Svenningsen, A. A., Honegger,\nP., Knudsen, L. E., et al. (2010). Optimization of chemically defined cell\nculture media–replacing fetal bovine serum in mammalian _in vitro_ methods.\n_Toxicol. In Vitro_ 24, 1053–1063. doi: 10.1016/j.tiv.2010.03.016\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nVaquer-Sunyer, R., and Duarte, C. M. (2008). Thresholds of hypoxia for marine\nbiodiversity. _PNAS_ 105, 15452–15457. doi: 10.1073/pnas.0803833105\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nVenugopal, T., Anathy, V., Kirankumar, S., and Pandian, T. J. (2004). Growth\nenhancement and food conversion efficiency of transgenic fish _Labeo rohita_.\n_J. Exper. Zool. Part A._ 301A, 477–490. doi: 10.1002/jez.a.78\n\nCrossRef Full Text | Google Scholar\n\nVerde, C., Giordano, D., and di Prisco, G. (2008). The adaptation of polar\nfishes to climatic changes: structure, function and phylogeny of haemoglobin.\n_IUBMB Life_ 60, 29–40. doi: 10.1002/iub.1\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nWall, R., Ross, R. P., Fitzgerald, G. F., and Stanton, C. (2010). Fatty acids\nfrom fish: the anti-inflammatory potential of long-chain omega-3 fatty acids.\n_Nutri. Rev._ 68, 280–289. doi: 10.1111/j.1753-4887.2010.00287.x\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nWaltz, E. (2017). First genetically engineered salmon sold in Canada. _Nat.\nNews_ 548:148. doi: 10.1038/nature.2017.22116\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nWang, G., LaPatra, S., Zeng, L., Zhao, Z., and Lu, Y. (2003). Establishment,\ngrowth, cryopreservation and species of origin identification of three cell\nlines from white sturgeon, _Acipenser transmontanus_. _Methods Cell Sci._ 25,\n211–220. doi: 10.1007/s11022-004-9120-x\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nWang, J., Honda, H., Park, Y. S., Iijima, S., and Kobayashi, T. (1994).\n“Effect of Dissolved Oxygen Concentration on Growth and Production of\nBiomaterials by Animal Cell Culture,” in _Animal Cell Technology: Basic and\nApplied Aspects: Proceedings of the Sixth International Meeting of the\nJapanese Association for Animal Cell Technology, Nagoya, Japan, November 9–12,\n1993 The Sixth International Meeting of Japanese Association for Animal Cell\nTechnology JAACT'93_ , eds T. Kobayashi, Y. Kitagawa, and K. Okumura\n(Dordrecht: Springer Netherlands, 191–195.\n\nGoogle Scholar\n\nWolf, K., and Mann, J. A. (1980). Poikilotherm vertebrate cell lines and\nviruses: a current listing for fishes. _In Vitro_ 16, 168–179. doi:\n10.1007/BF02831507\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nWu, T., Zivanovic, S., Draughon, F. A., and Sams, C. E. (2004). Chitin and\nchitosan value-added products from mushroom waste. _J. Agri. Food Chem._ 52,\n7905–7910. doi: 10.1021/jf0492565\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nYamamoto, Y., Fujisawa, A., Hara, A., and Dunlap, W. C. (2001). An unusual\nvitamin E constituent (α-tocomonoenol) provides enhanced antioxidant\nprotection in marine organisms adapted to cold-water environments. _Proc.\nNatl. Acad. Sci. U.S.A_. 98, 13144–13148. doi: 10.1073/pnas.241024298\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nYeo, S. E., Binkowski, F. P., and Morris, J. E. (2004). _Aquaculture Effluents\nand Waste By-Products Characteristics, Potential Recovery, and Beneficial\nReuse_. Ames, IA: NCRAC Technical Bulletins.\n\nGoogle Scholar\n\nZaraska, M. (2013). _Lab-Grown Beef Taste Test:‘Almost' Like a Burger_. The\nWashington Post.\n\nZhang, Z., Ju, Z., Wells, M. C., and Walter, R. B. (2009). Genomic approaches\nin the identification of hypoxia biomarkers in model fish species. _J. Experi.\nMarine Biol. Ecol._ 381, S180–S187. doi: 10.1016/j.jembe.2009.07.021\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nZhao, F., and Ma, T. (2005). Perfusion bioreactor system for human mesenchymal\nstem cell tissue engineering: dynamic cell seeding and construct development.\n_Biotechnol. Bioeng_. 91, 482–493. doi: 10.1002/bit.20532\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nZhao, Z., and Lu, Y. (2006). Establishment and characterization of two cell\nlines from bluefin trevally _Caranx melampygus_. _Dis. Aquat. Organ._ 68,\n91–100. doi: 10.3354/dao068091\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nZhao, Z., Montgomery-Brock, D., Lee, C.-S., and Lu, Y. (2003). Establishment,\ncharacterization and viral susceptibility of 3 new cell lines from snakehead,\n_Channa striatus_ (Blooch). _Methods Cell Sci. 25_ , 155–166. doi:\n10.1007/s11022-004-3804-0\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nZhu, M. M., Goyal, A., Rank, D. L., Gupta, S. K., Boom, T. V., and Lee, S. S.\n(2005). Effects of elevated pCO2 and osmolality on growth of CHO cells and\nproduction of antibody-fusion protein B1: a case study. _Biotechnol. Progress_\n21, 70–77. doi: 10.1021/bp049815s\n\nPubMed Abstract | CrossRef Full Text | Google Scholar\n\nKeywords: cellular agriculture, cell-based seafood, fish tissue culture,\nbioreactor, serum-free media, ocean conservation, marine cell culture,\naquaculture\n\nCitation: Rubio N, Datar I, Stachura D, Kaplan D and Krueger K (2019) Cell-\nBased Fish: A Novel Approach to Seafood Production and an Opportunity for\nCellular Agriculture. _Front. Sustain. Food Syst._ 3:43. doi:\n10.3389/fsufs.2019.00043\n\nReceived: 08 November 2018; Accepted: 21 May 2019;  \nPublished: 11 June 2019.\n\nEdited by:\n\nSelena Ahmed, Montana State University, United States\n\nReviewed by:\n\nPeter Neubauer, Technische Universität Berlin, Germany  \nSteve Oh, Bioprocessing Technology Institute (A*STAR), Singapore\n\nCopyright © 2019 Rubio, Datar, Stachura, Kaplan and Krueger. This is an open-\naccess article distributed under the terms of the Creative Commons Attribution\nLicense (CC BY). The use, distribution or reproduction in other forums is\npermitted, provided the original author(s) and the copyright owner(s) are\ncredited and that the original publication in this journal is cited, in\naccordance with accepted academic practice. No use, distribution or\nreproduction is permitted which does not comply with these terms.\n\n*Correspondence: Kate Krueger, kate@new-harvest.org\n\nDisclaimer: All claims expressed in this article are solely those of the\nauthors and do not necessarily represent those of their affiliated\norganizations, or those of the publisher, the editors and the reviewers. Any\nproduct that may be evaluated in this article or claim that may be made by its\nmanufacturer is not guaranteed or endorsed by the publisher.\n\n##### People also looked at\n\nDownload\n\nClick to get updates and verify authenticity.\n\nNews (11)\n\nBlogs (3)\n\nPolicy documents (2)\n\nX (31)\n\nPatents (1)\n\nReddit (1)\n\nMendeley (345)\n\nSee more details\n\n",
    "links": "[{\"link\": \"https://www.frontiersin.org/articles/10.3389/fsufs.2019.00043/pdf?isPublishedV2=False\", \"text\": \"\\n                                            Download PDF\\n                                        \"}, {\"link\": \"https://www.frontiersin.org/articles/10.3389/fsufs.2019.00043/epub?isPublishedV2=False\", \"text\": \"\\n                                            EPUB\\n                                        \"}, {\"link\": \"https://www.frontiersin.org/articles/10.3389/fsufs.2019.00043/xml/nlm?isPublishedV2=False\", \"text\": \"\\n                                            XML (NLM)\\n                                        \"}, {\"link\": \"https://twitter.com/intent/tweet?url=https://www.frontiersin.org/articles/10.3389/fsufs.2019.00043&text=Cell-Based Fish: A Novel Approach to Seafood Production and an Opportunity for Cellular Agriculture\", \"text\": \"\"}, {\"link\": \"https://www.linkedin.com/sharing/share-offsite/?url=https://www.frontiersin.org/articles/10.3389/fsufs.2019.00043&title=Cell-Based Fish: A Novel Approach to Seafood Production and an Opportunity for Cellular Agriculture\", \"text\": \"\"}, {\"link\": \"https://www.facebook.com/sharer.php?u=https://www.frontiersin.org/articles/10.3389/fsufs.2019.00043\", \"text\": \"\"}, {\"link\": \"https://www.frontiersin.org/articles/10.3389/fsufs.2019.00043/endNote\", \"text\": \"\\n                                        EndNote\\n                                    \"}, {\"link\": \"https://www.frontiersin.org/articles/10.3389/fsufs.2019.00043/reference\", \"text\": \"\\n                                        Reference Manager\\n                                    \"}, {\"link\": \"https://www.frontiersin.org/articles/10.3389/fsufs.2019.00043/text\", \"text\": \"\\n                                        Simple TEXT file\\n                                    \"}, {\"link\": \"https://www.frontiersin.org/articles/10.3389/fsufs.2019.00043/bibTex\", \"text\": \"\\n                                        BibTex\\n                                    \"}, {\"link\": \"https://www.facebook.com/sharer.php?u=https://www.frontiersin.org/articles/10.3389/fsufs.2019.00043\", \"text\": \"\"}, {\"link\": \"https://twitter.com/intent/tweet?url=https://www.frontiersin.org/articles/10.3389/fsufs.2019.00043&text=Cell-Based Fish: A Novel Approach to Seafood Production and an Opportunity for Cellular Agriculture\", \"text\": \"\"}, {\"link\": \"https://www.linkedin.com/sharing/share-offsite/?url=https://www.frontiersin.org/articles/10.3389/fsufs.2019.00043&title=Cell-Based Fish: A Novel Approach to Seafood Production and an Opportunity for Cellular Agriculture\", \"text\": \"\"}, {\"link\": \"https://www.frontiersin.org/articles/10.3389/fsufs.2019.00043/endNote\", \"text\": \"\\n                                            EndNote\\n                                        \"}, {\"link\": \"https://www.frontiersin.org/articles/10.3389/fsufs.2019.00043/reference\", \"text\": \"\\n                                            Reference Manager\\n                                        \"}, {\"link\": \"https://www.frontiersin.org/articles/10.3389/fsufs.2019.00043/text\", \"text\": \"\\n                                            Simple TEXT file\\n                                        \"}, {\"link\": \"https://www.frontiersin.org/articles/10.3389/fsufs.2019.00043/bibTex\", \"text\": \"\\n                                            BibTex\\n                                        \"}, {\"link\": \"https://www.frontiersin.org/research-topics/7794#articles\", \"text\": \"\"}, {\"link\": \"https://www.frontiersin.org/articles/10.3389/fsufs.2019.00043/pdf?isPublishedV2=False\", \"text\": \"\"}]"
}