{
    "summary": "Loading [MathJax]/jax/output/HTML-CSS/config.js\n\n## Your privacy, your choice\n\nWe use essential cookies to make sure the site can function. We also use\noptional cookies for advertising, personalisation of content, usage analysis,\nand social media.\n\nBy accepting optional cookies, you consent to the processing of your personal\ndata - including transfers to third parties. Some third parties are outside of\nthe European Economic Area, with varying standards of data protection.\n\nSee our privacy policy for more information on the use of your personal data.\n\nManage preferences for further information and to change your choices.\n\nAccept all cookies\n\nSkip to main content\n\nThank you for visiting nature.com. You are using a browser version with\nlimited support for CSS. To obtain the best experience, we recommend you use a\nmore up to date browser (or turn off compatibility mode in Internet Explorer).\nIn the meantime, to ensure continued support, we are displaying the site\nwithout styles and JavaScript.\n\nAdvertisement\n\n  * View all journals\n  * Search\n\n## Search\n\nSearch articles by subject, keyword or author\n\nShow results from All journals This journal\n\nSearch\n\nAdvanced search\n\n### Quick links\n\n    * Explore articles by subject\n    * Find a job\n    * Guide to authors\n    * Editorial policies\n\n  * Log in\n\n  * Explore content\n\n## Explore content\n\n    * Research articles \n    * News & Comment \n    * Collections \n    * Subjects \n    * Follow us on Facebook \n    * Follow us on Twitter \n    * Sign up for alerts\n    * RSS feed\n\n  * About the journal\n\n## About the journal\n\n    * Open Access Fees and Funding \n    * About Scientific Reports \n    * Contact \n    * Journal policies \n    * Calls for Papers \n    * Guide to referees \n    * Editor's Choice \n    * Journal highlights \n\n  * Publish with us\n\n## Publish with us\n\n    * For authors \n    * Language editing services \n    * Submit manuscript\n\n  * Sign up for alerts\n  * RSS feed\n\n  1. nature\n  2. scientific reports\n  3. articles\n  4. article\n\nContinuous fish muscle cell line with capacity for myogenic and adipogenic-\nlike phenotypes\n\nDownload PDF\n\nDownload PDF\n\n  * Article\n  * Open access\n  * Published: 29 March 2023\n\n# Continuous fish muscle cell line with capacity for myogenic and adipogenic-\nlike phenotypes\n\n  * Michael K. Saad1, \n  * John S. K. Yuen Jr1, \n  * Connor M. Joyce1, \n  * Xinxin Li1, \n  * Taehwan Lim1, \n  * Talia L. Wolfson1, \n  * Justin Wu1, \n  * Jason Laird2, \n  * Sanjana Vissapragada1, \n  * Olivia P. Calkins1, \n  * Adham Ali1 &\n  * …\n  * David L. Kaplan1 \n\nShow authors\n\n_Scientific Reports_ **volume  13**, Article number: 5098 (2023) Cite this\narticle\n\n  * 6400 Accesses\n\n  * 7 Citations\n\n  * 18 Altmetric\n\n  * Metrics details\n\n## Abstract\n\nCell-cultivated fish offers the potential for a more ethical, sustainable, and\nsafe seafood system. However, fish cell culture is relatively understudied in\ncomparison to mammalian cells. Here, we established and characterized a\ncontinuous Atlantic mackerel ( _Scomber scombrus_ ) skeletal muscle cell line\n(“Mack” cells). The cells were isolated from muscle biopsies of fresh-caught\nfish, with separate isolations performed from two distinct fish. Mack1 cells\n(cells from the first isolation) were cultured for over a year and subcultured\nover 130 times. The cells proliferated at initial doubling times of 63.9 h (±\n19.1 SD). After a spontaneous immortalization crisis from passages 37–43, the\ncells proliferated at doubling times of 24.3 h (± 4.91 SD). A muscle phenotype\nwas confirmed through characterization of muscle stemness and differentiation\nvia paired-box protein 7 and myosin heavy chain immunostaining, respectively.\nAn adipocyte-like phenotype was also demonstrated for the cells through lipid\naccumulation, confirmed via Oil Red O staining and quantification of neutral\nlipids. New qPCR primers ( _HPRT_ , _PAX3B_ , _MYOD1_ , _MYOG_ , _TNNT3A_ ,\nand _PPARG_ ) were tailored to the mackerel genome and used to characterize\nmackerel cell genotypes. This work provides the first spontaneously\nimmortalized fish muscle cell line for research, ideally serving as a\nreference for subsequent investigation.\n\n### Similar content being viewed by others\n\n###  Proteomic characterization of primary cultured myocytes in a fish model\nat different myogenesis stages\n\nArticle Open access 01 October 2019\n\nAntonio F. Millan-Cubillo, Miguel Martin-Perez, … Josefina Blasco\n\n###  Proteomic profile and morphological characteristics of skeletal muscle\nfrom the fast- and slow-growing yellow perch (Perca flavescens)\n\nArticle Open access 11 August 2021\n\nKarolina Kwasek, Young Min Choi, … Macdonald Wick\n\n###  Histological and transcriptomic analysis of muscular atrophy associated\nwith depleted flesh pigmentation in Atlantic salmon (Salmo salar) exposed to\nelevated seawater temperatures\n\nArticle Open access 14 March 2023\n\nThu Thi Minh Vo, Gianluca Amoroso, … Abigail Elizur\n\n## Introduction\n\nCell culture research on aquatic and marine species is relatively understudied\nwhen compared to mammalian cell culture research, with zebrafish as an\nexception. In cellular agriculture, which is the production of animal-sourced\nfoods via cell culture, immortalized cells are essential for consistency\nduring large scale production. Most in vitro cell culture studies for future\nfoods have focused on livestock animals, such as beef cattle1,2,3,4. However,\ndue to concerns of overfishing and fish health in natural environments due to\nheavy metals, pesticides, and plastics, as well as the negative ecological\nimpact of aquaculture, _cellular aquaculture_ , or cell-cultivated fish, is an\nemerging yet understudied realm of cellular agriculture. Currently, fish\nsupport 15% of the global demand for animal protein; coupled with a growing\npopulation on the planet, the demand for fish is projected to rise further5.\nCurrent aquaculture and marine fish capture processes have significant\ndrawbacks in terms of food safety, depletion of fish stocks, and the\nenvironment. Overfishing is deleterious to marine ecosystems and is depleting\nnumerous fish species to the point of extinction6. In terms of food safety,\nfoodborne diseases, plastics accumulation, and heavy metal contamination are\nmajor issues, while environmental concerns connected to climate change are\ndamaging marine diversity7,8. Cellular aquaculture has the potential to\nalleviate fish sourcing concerns, with a focus on production efficiency,\nscaling, and controlled cultivation environments to address food security\nconcerns. However, to date there are no available fish skeletal muscle cell\nlines to produce cell-cultured fish meat, or to use as a model for research,\nlike immortalized C2C12 mouse myoblasts for mammalian muscle cell culture.\n\nNine fish cell lines, from _Acipenser transmontanus_ (white sturgeon), _Caranx\nmelampygus_ (bluefin trevally), _Lates calcarifer_ (barramundi), _Danio rerio_\n(zebrafish), _Carassius auratus_ (grass goldfish), _Channa striata_ (snakehead\nmurrel), _Labeo catla_ (Indian catla), and _Wallago attu_ (helicopter\ncatfish), have been isolated from fish muscle9,10; however, none of the cell\nlines are characterized as muscle cells, as they lack myogenic potential.\nWhile fish muscle cells from species such as _Danio rerio_ (zebrafish), _Salmo\nsalar_ (Atlantic salmon), _Carassius auratus_ (grass goldfish), and\n_Oncorhynchus mykiss_ (rainbow trout) have been isolated, their applicability\nto cellular aquaculture has been limited11,12,13,14. These limitations stem\nfrom some of these species not being commonly consumed (e.g., zebrafish,\ngoldfish), the cell population not demonstrating muscle function (e.g., the\naforementioned cell lines, goldfish), or their limited growth potential\n(salmon, trout) as the cells were not demonstrated in long-term culture. For\ncellular aquaculture, a cell line with applicability to food through\ndemonstration of myogenic or adipogenic functions in long-term culture would\nprovide a reference for research as well as applicability for food production\nprocesses. In particular, a cell line from a commonly consumed fish species\nhas direct benefits for potential commercialization, as consumers would likely\nfavor in vitro fish from a recognized source.\n\nAtlantic mackerel ( _Scomber scombrus_ ) is an understudied fish species, with\nfew in vivo research studies and no in vitro cell studies published. Mackerel\nis a popular fish for consumption, and the oils from this fish are desired for\nhealth benefits due to their high percentage of omega-3 fatty acids15.\nHowever, mackerel populations have significantly declined in recent years,\nwith the Monterey Bay Aquarium’s Seafood Watch, a platform for identifying\nenvironmentally sustainable seafood, recommending avoiding consumption of the\nfish due to its depleted stocks and exploitative overfishing16. Additionally,\nin 2004, the US Food and Drug Administration (FDA) advised against eating\nmackerel due to high levels of mercury17. As an alternative to fished\nmackerel, the isolation and propagation of mackerel cells (muscle, fat)\ntowards cell-cultivated mackerel tissue offers an option to address the above\nconcerns.\n\nThe objective of this work was to isolate and characterize mackerel muscle\ncells towards a continuous cell line via spontaneous immortalization. First,\nsince mackerel is wild-caught and confirmation of species identity is a high\npriority in the regulation of fish and their labeling18, we confirmed the\ncells’ identity as _S. scombrus_ through PCR on cell genomic DNA and\nsubsequent Sanger sequencing. After establishment of a continuous culture,\npast a spontaneous immortalization crisis event, we confirmed myogenicity\nthrough immunocytochemistry for paired-box protein 7 (PAX7) in proliferating\ncells, a marker for muscle cell stemness, and myosin heavy chain (MHC) in\ndifferentiated cells. As mackerel is an oily fish, we also demonstrated the\ncells’ ability for lipid accumulation towards adipogenic-like outcomes. We\ninvestigated cell culture optimization, determining optimal seeding and\ndifferentiation methods while screening various extracellular matrix (ECM)\nsurface coatings. Finally, we initiated the development of research tools,\novercoming difficulties due to the lack of annotations on the _S. scombrus_\ngenome and including the design of primers for future gene expression studies\nand research needs.\n\n## Results\n\n### PCR confirmation of _S. scombrus_ identity\n\nTo confirm the identity of the isolated cells as Atlantic mackerel, an adapted\nmethod from Aranishi19 was employed. PCR on cell genomic DNA was run with two\nsets of primers, fish universal 5S primers and _Scomber_ genus-specific Saba\nprimers (Fig. 1A). The amplification products matched the expected size of 486\nbase pairs (bp) and 311 bp for 5S and Saba reactions, respectively. To\ninvestigate the species specificity, PCR products were sequenced via Sanger\nsequencing. The sequencing results were then compared by alignment to four\nscombrid species, _S. colias_ (Atlantic chub mackerel), _S. scombrus_\n(Atlantic mackerel), _S. australasicus_ (Chub mackerel), and _S. japonicus_\n(Blue mackerel) (Fig. 1B). As _S. scombrus_ exhibited 97.7% sequence identity\nto the consensus mackerel sequence (the consensus sequence from alignment of\nall the PCR product sequences), the identity of the cells was confirmed as\nAtlantic mackerel. While _S. scombrus_ did exhibit slight deviations from\nAranishi’s sequencing (e.g., nucleotide mismatch in position 129), the other\n_Scomber_ species exhibited large insertions or deletions when compared\nagainst the DNA sequence of the cells (Fig. 1C).\n\n **Figure 1**\n\nPCR confirmation of S. scombrus identity. ( **A** ) PCR amplification of Mack\ncell genomic DNA (Mack2 P3, Mack1 P55, Mack1 P4) with fish universal 5S\nprimers and _Scomber_ -specific Saba primers, with apparent band size matching\nexpected size of 486 bp and 311 bp, respectively. The original gel is\npresented in Supplementary Fig. S1. ( **B** ) Comparison between Scomber\nspecies of Geneious Prime nucleotide alignment identity percentages of Sanger\nsequencing from Saba PCR reaction. Whiskers indicate min to max, n = 4;\nstatistical significance calculated by one-way ANOVA with multiple comparisons\nbetween the control _S. scombrus_ and the other species and indicated by\nasterisks, in which _p_ < 0.0001 (****). ( **C** ) Section of Geneious Prime\nalignment of the consensus mackerel nucleotide sequence (n = 4) and the four\n_Scomber_ species.\n\nFull size image\n\n### Establishment of continuous cell culture through spontaneous\nimmortalization crisis\n\nThe primary muscle cells were maintained in culture continuously by\nsubculturing. To establish a cell line without genetic modifications, the cell\nculture proceeded through a crisis of spontaneous immortalization\ntransformation, as previously described by Li et al.12. Li et al.\ncharacterized the spontaneous immortalization crisis by a large-scale\napoptosis/senescence, resulting in sporadic clusters of quiescent cells that\nthen grow out of quiescence to reach more confluent areas12. From passages\n37–43, the mackerel cells underwent a similar crisis, marked by increased\nincidence of senescent cell morphology with clusters of viable cells (Fig.\n2B). After the spontaneous immortalization crisis, there were notable\ndifferences between the mackerel cells before and after this process.\nMorphologically, the cells became shorter and less variable in morphology\n(Fig. 2A,C). These morphological changes were confirmed with measurements of\ncell diameters before and after the crisis; 18.3 µm (± 0.53 SD) and 16.8 µm (±\n0.17 SD), respectively (Fig. 2E). Importantly, cell doubling time also\ndecreased significantly after the crisis, from 63.9 h (± 19.1 SD) to 24.3 h (±\n4.91 SD) (Fig. 2D). During culture, the cells consistently tested negative for\nmycoplasma (Supplementary Fig. S2). Additionally, early passage Mack2 cells\n(i.e., cells from the second isolation), demonstrated slightly altered\nmorphology and similar growth rates to that of the post-crisis Mack1 cells,\nwith a doubling time of 22.9 h (± 3.99 SD) (Supplementary Figs. S3A,B).\n\n **Figure 2**\n\nSpontaneous immortalization crisis event of Mack1 cells. ( **A** – **C** ) The\nprogression of Mack1 cells through phase contrast imaging. Scale bars 200 μm.\n( **A** ) Passage number 15, ( **B** ) passage number 42, ( **C** ) passage\nNumber 84. Arrows in ( **B** ) indicate cells in crisis, as morphology is\nindicative of senescence. ( **D** ) Doubling time comparison between cells\nbefore crisis (passage numbers 12–26) and after crisis (passage numbers\n114–128). Error bars indicate standard deviation, n = 15 distinct samples;\nstatistical significance calculated by unpaired t-test and indicated by\nasterisks, in which _p_ < 0.0001 (****). ( **E** ) Cell diameter comparison\nbetween cells before crisis (passage number 27) and after crisis (passage\nnumber 77). Error bars indicate standard deviation, n = 3 distinct samples;\nstatistical significance calculated by unpaired t-test and indicated by\nasterisks, in which _p_ < 0.01 (**).\n\nFull size image\n\n### Confirmation of myogenicity\n\nTo confirm myogenicity, cells before and after crisis were continuously\nanalyzed for PAX7 protein expression through immunocytochemistry. PAX7 is a\nspecific marker of satellite cells and is detected through nuclear\nstaining20,21. Cells before and after crisis stained positively for PAX7 (Fig.\n3A), and image analysis showed a high percentage of PAX7+ nuclei, with cells\nafter crisis nearing a pure satellite cell population (Fig. 3C). To confirm\nthe cells potential to differentiate, cell feeding was ceased at 100%\nconfluency, and, after 10 days of serum starvation, cells were immunostained\nfor myosin heavy chain (MHC) with MF-20 (Fig. 3B). MF-20 staining confirmed\ncell differentiation into muscle fibers, with similar muscle morphology before\nand after the crisis. Despite cells before crisis being larger in diameter,\nimage analysis showed no significant difference in muscle fiber diameter\nbefore and after the crisis (Fig. 3D). Mack2 cells were also tested for their\ndifferentiation potential and demonstrated functionality with muscle fiber\nformation and lipid accumulation (Supplementary Fig. S3C). In fact, Mack2\ncells demonstrated robust muscle fiber formation, as confirmed with M-F20\nstaining (Supplementary Fig. S4).\n\n **Figure 3**\n\nMyogenic potential and differentiation of Mack1 cells. ( **A** )\nImmunofluorescence staining for cell nuclei (DAPI, blue) and PAX7 (red). Top\nand bottom panels are for passage numbers 14 and 93, respectively. Scale bars\n100 μm. ( **B** ) Immunofluorescence staining for cell nuclei (DAPI, blue) and\nMHC (MF-20, red). Top and bottom panels are for passage numbers 8 and 56,\nrespectively. Scale bars 100 μm. ( **C** ) Percent PAX7+ nuclei over multiple\npassages, as calculated through image analysis. Error bars indicate standard\ndeviation, n = 3 or 6; statistical significance calculated by two-way ANOVA\nwith multiple comparisons between the passage numbers and indicated by\nasterisks, in which _p_ < 0.05 (*). ( **D** ) Muscle fiber diameter comparison\nbetween cells from passage numbers 8 and 93, through image analysis. Error\nbars indicate standard deviation, n = 20; no statistical significance\ncalculated by unpaired t-test, in which n.s. is not significant.\n\nFull size image\n\n### Lipid accumulation towards adipogenic-like phenotype\n\nWhile muscle is the predominant component of fish fillets, fat plays an\nimportant role in flavor and texture. Fat is especially pronounced in\nmackerel, as it is often described as an oily fish22,23. Thus, to investigate\nthe potential for mackerel muscle cells to accumulate lipids, induction\ntowards an adipogenic-like phenotype was explored through media\nsupplementation. Specifically, medium was supplemented with a lipid mixture\nand PPARG agonists (dexamethasone, 3-isobutyl-1-methylxanthine (IBMX), and\ninsulin), as PPARG is the master regulator of adipogenic differentiation20.\nInclusion of the lipid mixture with the agonists promoted lipid accumulation,\nconfirmed through ORO staining and quantification of extracted ORO (Fig.\n4A,B).\n\n **Figure 4**\n\nLipid accumulation in Mack muscle cells. ( **A** ) Immunofluorescence staining\nfor cell nuclei (DAPI, blue) and neutral lipids (Oil Red O, red). ( **B** )\nQuantification of neutral lipid accumulation in different media through Oil\nRed O absorbance. GM: growth medium, GM+: growth medium + PPARG agonists, AM:\nadipogenic medium (GM+ with lipid mixture). ( **C** ) Percent of fatty acid\nsaturation in adipogenic-like mackerel muscle cells, native Atlantic mackerel\n(adapted from23,24,25,26), and cod liver oil (adapted from27,28). Error bars\nindicate standard deviation, n = 3. (D) Fatty acid composition of adipogenic-\nlike mackerel cells, native Atlantic mackerel (adapted from22,23,25,26), and\ncod liver oil (adapted from27,28,29). The top 13 most prevalent fatty acids\nfrom the in vitro mackerel are shown. Error bars indicate standard deviation,\nn = 3.\n\nFull size image\n\nLipidomics was used to characterize the fatty acid profiles of adipogenic-like\ncells and compared against published data for native Atlantic mackerel and cod\nliver oil, which is in the lipid mixture of the adipogenic medium. Fatty acid\ncomposition was binned into saturated fatty acids (SFAs), monounsaturated\nfatty acids (MUFAs), and polyunsaturated fatty acids (PUFAs) to compare lipid\ncomposition (Fig. 4C). In comparison to native mackerel, cultured cells\ncontained relatively higher MUFA levels and lower SFA levels. In comparison to\ncod liver oil, the cultured cells contained lower levels of MUFAs. Specific\nfatty acid composition from the top 13 most prevalent fatty acids in the in\nvitro mackerel are exhibited in Fig. 4D. Of note, oleic (18:1) and linoleic\n(18:2) acids appear enriched in the in vitro samples, while docosahexaenoic\nacid (22:6) was lower (Fig. 4D). More specific investigation into the\ncomposition of the phospholipids, which constitute the cell membrane and are\nassociated with **t** aste, and triacylglycerides, which are the storage form\nof fat and constitute most of the lipids present, are presented in\nSupplementary Fig. S5.\n\n### Cell culture optimization\n\nTo understand the best practices for culturing mackerel cells, we explored\nseeding density, muscle differentiation regimes, and surface coatings. For\nseeding density, cells were seeded at 1000–10,000 cell/cm2 to determine\nminimum seeding density and cell density at confluency. While cells seeded at\n2000 cells/cm2 proliferated well to roughly 30,000 cells/cm2 after 5 days,\nthose at 1000 cells/cm2 did not proliferate well after 5 days, indicating a\nminimum seeding density between 1000 and 2000 cells/cm2 (Fig. 5A). The maximum\ncell density (i.e., the cell density at 100% confluency) was determined to be\n~ 150,000 cells/cm2, as by day 5 the cells seeded at densities of at least\n4000 cells/cm2 experienced contact inhibition and did not exceed ~ 150,000\ncells/cm2 (Fig. 5A).\n\n **Figure 5**\n\nCell culture optimization. ( **A** ) Comparative growth curves for varying\nseeding densities over days 1, 3, and 5. For day 5, two-way ANOVA indicated no\nsignificant differences between 4000, 5000, 6000, 8000, and 10,000 cell/cm2. (\n**B** ) dsDNA quantification for Mack1 cells cultured on different ECM surface\nmimetics. Error bars indicate standard deviation, n = 3; statistical\nsignificance calculated by two-way ANOVA with multiple comparisons between the\nsurface mimetics and the no coating control at each time point and indicated\nby asterisks, in which _p_ < 0.05 (*) and _p_ < 0.01 (**). ( **C** ) Percent\nMHC+ nuclei for Mack1 cells cultured on different ECM surface mimetics. Error\nbars indicate standard deviation, n = 3; statistical significance calculated\nby two-way ANOVA with multiple comparisons between the surface mimetics and\nthe no coating control and indicated no significant differences between the\nmimetics. ( **D** ) Neutral lipid quantification, through Oil Red O\nextraction, for Mack1 cells cultured on different ECM surface mimetics. Error\nbars indicate standard deviation, n = 4; statistical significance calculated\nby two-way ANOVA with multiple comparisons between the surface mimetics and\nthe no coating control and indicated by asterisks, in which _p_ < 0.05 (*). (\n**E** ) Percent MHC+ nuclei comparison between different muscle\ndifferentiation methods. Error bars indicate standard deviation, n = 3;\nstatistical significance calculated by two-way ANOVA with multiple comparisons\nbetween differentiation methods and indicated by asterisks, in which _p_ <\n0.01 (**) and _p_ < 0.001(***).\n\nFull size image\n\nPreferences for extracellular matrix (ECM) mimetics was investigated for more\noptimized growth, muscle differentiation, and lipid accumulation. For growth,\nlaminin-511-E8 demonstrated increased proliferation rates (Fig. 5B), while for\ndifferentiation, the ECM mimetics did not improve differentiation efficiency\nof muscle differentiation or adipogenic-like phenotype induction (Fig. 5C,D).\n\nOptimization for muscle differentiation involved investigation of\ndifferentiation regimes chosen based on previous literature approaches that\ndemonstrated efficacy in mammalian cell differentiation2,3,21. The regimes\ninvolved reduction of serum to 2% in the differentiation medium, addition of\ntransferrin, lysophosphatidic acid (LPA), and insulin (termed “reduced-\nserum+”), inclusion of ERK inhibitor (ERKi), and supplementation with IGF-1.\nWhen compared against the control of cessation of feeding (termed “serum\nstarvation”), all of the tested regimes had significantly lower percentages of\nMHC+ cells (Fig. 5E).\n\n### Gene expression\n\nTo build a research toolkit for the mackerel muscle cell line, a gene\nexpression assay with RT-qPCR was developed. Due to the lack of an annotated\ngenome for _S. scombrus_ , a reference genome for southern bluefin tuna (\n_Thunnus maccoyii_ , NBCI RefSeq GCF_910596095.1) was originally used to\ndesign primers for the genes of interest: _HPRT_ (hypoxanthine–guanine\nphosphoribosyltransferase, a housekeeping gene), _PAX3B_ (paired-box 3b),\n_MYOD1_ (myogenic differentiation 1), _MYOG_ (myogenin), _TNNT3A_ (troponin T\ntype 3a), and _PPARG_ (peroxisome proliferator-activated receptor gamma). The\n_T. maccoyii_ genome was chosen because it is a fully annotated genome with\ngenes of interest and because _T. maccoyii_ is closely related to _S.\nscombrus_30. After initial screening for primer efficacy and specificity by\nrunning PCR products on DNA agarose gels, optimization was needed, due to\neither a lack of PCR product at the expected size or non-specific binding\nleading to multiple PCR products. To better investigate _S. scombrus_\nsequences, an Atlantic mackerel transcriptome (NCBI SRX2255766) was\nsuccessfully aligned to the tuna genome, with 78% of reads uniquely mapped via\nthe STAR aligner31. Of note, the 78% read mapping falls within the 70–90%\nobserved when mapping human RNA Sequencing reads to a human reference\ngenome31. Later iterations of primer design then referenced the _S. scombrus_\nannotated sequences. After successful confirmation where PCR products were\nsingular and matched the expected size on agarose gels, the primer specificity\nwas further confirmed through melt curves and Sanger sequencing (data not\nshown). Using the successful primers (Supplementary Table S1), gene expression\nduring proliferation, muscle differentiation through serum starvation\n(cessation of feeding), muscle differentiation through serum reduction (2%\nFBS) with additives, and lipid accumulation was investigated (Fig. 6).\nInterestingly, the adipogenic-like cells generally followed trends similar to\nmuscle differentiation and did not exhibit increases in _PPARG_. _PAX3B_ is a\nmarker of satellite cell stemness, while _MYOD1_ , _MYOG_ , and _TNNT3A_ are\nall genes associated with muscle differentiation. Thus, the decrease of\n_PAX3B_ and increases of _MYOD1, MYOG,_ and _TNNT3A_ during differentiation\nwere expected.\n\n **Figure 6**\n\nRT-qPCR Gene Expression for PAX3B, MYOD, MYOG, TNNT3A, and PPARG. Fold\ninduction over proliferation is represented as 2−ΔΔCt. Error bars indicate\nstandard error of the mean, n = 9 (n = 3 experimental, n = 3 technical,\noutliers removed); statistical significance calculated by two-way ANOVA with\nmultiple comparisons between the differentiation samples and indicated by\nasterisks, in which _p_ < 0.05 (*) and _p_ < 0.01 (**).\n\nFull size image\n\n## Discussion\n\nCellular aquaculture offers many potential advantages over conventional\nfishing and aquaculture. However, the lack of fish muscle cell lines has\nhindered cultured meat research for fish, such as studies into serum-free\nmedia, 3D expansion options, and structured tissue formation. While most\ncellular agriculture research involves the use of bovine satellite cells due\nto their food and environmental relevance, traditional animal muscle cell and\ntissue in vitro studies have focused on the mouse myoblast C2C12 cell line due\nto availability32,33. The present study provides a new option for the field of\nfish cell and tissue culture, through the establishment of a mackerel skeletal\nmuscle cell line.\n\nThe Atlantic mackerel cell line Mack1 is stable, having progressed out of a\nspontaneous immortalization crisis event and proliferating indefinitely since\nthe crisis (Fig. 2). The spontaneous immortalization method of establishing a\ncell line is preferred over genetic modification methods, as genetically\nmodified organisms (GMOs) will face stricter regulation, especially in\nEurope34. As noted in Goswami et al _._ , confirmation of species\nidentification is critical to cell line authenticity and regulation35. While\nwe performed PCR analysis on 5S ribosomal DNA (rDNA) to confirm the cell\nidentity as _S. scombrus_ , alternative approaches could target commonly\nsequenced DNA barcodes, such as other mitochondrial genes like 16S rDNA,\ncytochrome oxidase I ( _cox1_ ), or cytochrome b ( _cytb_ )36. Mack1 is a\nhighly pure muscle cell line, confirmed through immunostaining for PAX7 and\nMHC for myogenic potential and differentiation, respectively (Fig. 3). Mack1\ncells also possess the ability to accumulate lipids, demonstrating potential\nfor both fat and muscle phenotypes (Fig. 4). Optimization of Mack1 cell\nculture and research tool development was then explored through seeding\ndensity and differentiation studies, as well as RT-qPCR assay development\n(Figs. 5, 6).\n\nHowever, further understanding and optimization of cell culture are needed.\nWhile the expansion of the cells resulted in doubling times of 24.3 h (± 4.91\nSD), serum-free medium without FBS is necessary to reduce costs and to address\nethical considerations and animal-free ingredients in cellular agriculture.\nThe growth medium for the mackerel cell lines, which was based off an\nisolation medium for the closely related southern bluefin tuna ( _Thunnus\nmaccoyii)_37, contains a high serum percentage of 20% FBS. Given difficulties\nin adaptation to serum-free conditions, future mackerel isolations could\nexplore using serum-free or low-serum growth media. Methods that work well\nwith mammalian cell culture are not interchangeable with fish cell culture, as\nevaluations with Beefy9 serum-free medium (data not shown)38 and ERK\ninhibition (Fig. 5B)2 were unsuccessful. To develop a serum-free medium for\nfish cell culture, media with mushroom extracts and insulin-like growth factor\n2 (IGF-2) have shown promise in goldfish and medaka ( _Oryzias latipes_ )\ncultures, respectively39,40. However, neither medium promoted proliferation of\nMack1 cells (data not shown). Additionally, while the Mack1 cells did not\ndemonstrate a reliance on an ECM mimetic for cultivation (Fig. 5B), the\nsurface coating screens should be revisited during serum-free media\ndevelopment, as the FBS includes proteins that likely adsorb onto tissue\nculture plastic and encourage cell adhesion.\n\nWhile demonstration of myogenic and adipogenic-like phenotypes underscore cell\nfunctionality, the continued development of research tools to understand\nbiological and molecular processes should accelerate progress towards enhanced\nfunctional utility for these cells. While the Mack cells stained positively\nfor PAX7 and MHC, staining with antibodies for MYOD and MYOG was unsuccessful\n(data not shown). The unsuccessful trials highlight the need for future\nresearch tool development, to both pose and answer questions regarding cell\nline function and development. For example, the RT-qPCR assay introduced\nquestions regarding temporal gene and protein expression patterns in muscle\ndifferentiation, while the lack of _PPARG_ gene expression in lipid\naccumulation indicated the adipogenic-like cells likely undergo phenotypic\nchanges rather than a proper transdifferentiation. For muscle differentiation,\ndespite a lower percentage of MHC+ nuclei, the reduced serum differentiation\nregime resulted in increased gene expression of _TNNT3A_ when compared to\nserum starvation conditions (Figs. 5B, 6). While the gene and protein in the\nassays are different, TNNT3A and MHC are interrelated, as the troponin T\nbridges myosin heads to tropomyosin in differentiated muscle41,42. The\napparent discrepancy between _TNNT3A_ gene expression and MHC protein\nexpression could indicate a temporal difference in protein and gene expression\nor a difference in troponin T to MHC ratios during stages of differentiation.\nWhile mackerel muscle differentiation regimes generally followed expected gene\nexpression patterns (i.e., a decrease in _PAX7_ and increases in _MYOD_ ,\n_MYOG_ , and _TNNT3A_ ), lipid accumulation unexpectedly followed similar\npatterns, without a change in _PPARG_ (Fig. 6). Previous studies with\ntransdifferentiated C2C12s also noted the lack of expression of _PPARG_ in\nadipocyte-like cells; instead, increases in adipocyte lipid binding protein (\n_ALBP_ ), cyclooxygenase-2 ( _COX2_ ), and fatty acid-activated receptor (\n_FAAR_ ) were observed43,44. Because the Mack1 cells are muscle cells, it is\nlikely that cell-to-cell signaling/contact initiated intercellular\ncommunication for muscle differentiation45. Nonetheless, the specific\nmechanism of lipid accumulation in the Mack muscle cells is elusive. When\nC2C12s were fed with fatty acids and thiazolidinediones, _MYOG_ expression was\nhalted, although for the Mack cells _MYOG_ expression increased during lipid\naccumulation44. Despite gaps in understanding the mechanisms of these\nphenotypic changes, observing increased lipid accumulation was promising as a\nfat analog for cultivated foods.\n\nLipid accumulation in adipogenic medium was significant in comparison to\ngrowth medium (Fig. 3B), allowing for investigation into the lipid profile via\nlipidomics (Fig. 3C,D and Fig. S4). Comparing lipid composition generated with\nthese cells to native mackerel is limited due to the large variation in native\nmackerel lipid content seasonally and geographically23. However, an\ninteresting observation was the relatively high levels of saturated fatty\nacids in the phospholipid fraction (Fig. S4C). A hypothesis is that since the\nfish cells are cultured at 27 °C, a temperature higher than that of the\nAtlantic Ocean where the fish was caught, the phospholipid bilayer of the\ncells may be adapted to higher saturation levels to maintain solidified\nstates. In vivo studies have found that fish from warmer climates generally\nhave higher saturated fat phospholipid fractions than fish from cold water\nclimates, with _T. bernacchii_ increasing saturated fat levels when acclimated\nto a warmer water temperature46,47.\n\nThe present work details the establishment and characterization of a fish\nmuscle cell line that could serve as a characterization framework for other\ncellular agriculture cell line developments. The successful isolation and\npropagation of the Mack cells were achieved only after multiple isolation\nfailures for different species and with different protocols. Some observations\nfrom the attempted isolations were the need for robust sterilization methods\nfor the tissue, varying efficacy of enzymatic agents (e.g., trypsin,\ncollagenase, Accumax) for different species, and the need for debris removal\nthrough pre-plate methods (i.e., allowing cells and debris adhesion to an\ninitial cell culture vessel and then moving the non-adherent material to a new\nvessel) and subsequent washes after cell adhesion. While we hypothesized\nfreshness and the time between the death of the fish and the cell isolation\nwould be key parameters in success, surprisingly, that was not the case for\nthe two mackerel isolations. The fish were transported as whole fish on ice,\nand the isolations were not performed until about 5 h _post-mortem_. Despite\nthe time between fish death and cell isolation, the two mackerel cell\nisolations were more successful in comparison to cell isolations from other\nspecies (salmon, zebrafish, tilapia, trout, tuna), both in terms of yield of\nisolated cells per gram of tissue and in growth rate of the cells after\nisolation.\n\nFor future research, removal of all animal components, notably FBS in the\ngrowth medium and cod liver oil in the adipogenic medium, will be key to the\nfuture utility of these cells in cellular agriculture. To replace the cod\nliver oil, plant-based alternatives including intralipid or purified\nγ-linolenic acid from borage seed oil can be pursued48,49,50. For optimization\nof cell culture conditions and removal of animal components, further\nunderstanding of the biological and molecular mechanisms of the cells should\naccelerate further progress. However, since _S. scombrus_ and fish in general\nare relatively understudied from an in vitro cell culture perspective,\nunderstanding cell processes are more challenging due to the lack of suitable\nexperimental tools. In developing RT-qPCR, we circumvented the lack of an\nannotated genome by aligning a mackerel transcriptome with an annotated genome\nfrom southern bluefin tuna, a closely related species. This sequence\nsimilarity between the species was high30, and future studies on species\nwithout annotated genomes could also leverage phylogeny in determining\npotential reference genomes. While RT-qPCR is one step in developing research\ntools, omics techniques should provide important insight by gathering large\ndatasets to infer gene, metabolite, or protein functions. Transcriptomics and\nproteomics will inform sequences of genes and proteins specific to Atlantic\nmackerel, which could further inform the design of primers and antibodies to\nstudy the cells with more resolution. Optimization of cell characterization\nwill enhance cell culture and accelerate development of tissue cultures from\nthese cells. Ultimately, a proof-of-concept 3D tissue construct, with both\nmuscle and fat generation, will be invaluable in showcasing the potential\nvalue of the Mack cells for industrial applications.\n\n## Methods\n\n### Primary mackerel satellite cell isolation and maintenance\n\nIsolations were performed on two separate fish, and cells from the first and\nsecond isolations are referred to as Mack1 and Mack2, respectively. Primary\nmackerel satellite cells were isolated enzymatically using collagenase.\nBriefly, wild-caught, deceased Atlantic mackerel ( _S. scombrus_ ) was\nobtained from fishermen off the Atlantic coast, near Gloucester, MA, USA, and\nthen transported to the lab on ice. The isolations generally began ~ 5 h\n_post-mortem._ The whole fish was first dipped in 70% ethanol for 10 s before\nbeing transferred into the tissue culture hood. Then, ~ 5 g of epaxial white\nmuscle tissue was excised then sterilized in 70% ethanol and rinsed in\nDulbecco’s phosphate-buffered saline (DPBS, ThermoFisher Scientific #14190144,\nWaltham, MA, USA). The muscle tissue was minced into a paste and digested in\nDPBS containing 0.1% collagenase, type II (Worthington Biochemical #LS004176,\nLakewood, NJ, USA) for 1 h at room temperature, with trituration every 15 min.\nThe digested tissue was strained through 100, 70, and 40 µm strainers. The\nstrained cell suspension was centrifuged at 300× _g_ to pellet the cells and\nthen resuspended in 10 mL of growth medium, comprised of Leibovitz’s L-15\nMedium (ThermoFisher Scientific #11415064) with 20% fetal bovine serum (FBS;\nThermoFisher Scientific #26140079), 1 ng/mL recombinant human fibroblast\ngrowth factor (FGF-basic 154 a.a., PeproTech #100-18B, Cranbury, NJ, USA), 20\nmM HEPES pH 7.4 (Sigma Aldrich #H4034, St. Louis, MO, USA), 1%\nAntibiotic–Antimycotic (ThermoFisher Scientific #1540062), and 10 µg/mL\ngentamicin (Sigma Aldrich #G1397). The cells in growth medium were then\ncounted using a NucleoCounter NC-200™ automated cell counter (Chemometec,\nAllerod, Denmark) and seeded at ~ 100,000 cells/cm2 into tissue culture-\ntreated flasks. After 48 h of incubation at 27 °C without CO2, the plated\nsuspensions were transferred to flasks coated with 0.25 ug/cm2 iMatrix\nrecombinant laminin-511-E8 (Iwai North America #N892021, San Carlos, CA, USA).\nThe cells were not disturbed for 5 days to allow for adhesion. The cells were\nthen fed until they reached ~ 70% confluency, about 10 days after the\nisolation. Cells were maintained by passaging at ~ 70% confluency and seeding\nbetween 2000–8000 cells/cm2 or stored by freezing in growth medium with 10%\ndimethyl sulfoxide (DMSO, Sigma Aldrich #D2650). During early passages, 0.25%\ntrypsin–EDTA (ThermoFisher Scientific #25200056) was used to liberate the\ncells from the surfaces. 0.05% trypsin–EDTA (ThermoFisher Scientific\n#25300054) was used after a spontaneous immortalization crisis event,\ncharacterized by high incidence of senescent cell morphology in the culture,\nat around passage 37 (P37).\n\n### PCR identification\n\nTo confirm the identity of the cells from _S. scombrus_ , genomic DNA from in\nvitro culture [Mack1 P4 (n = 2), Mack1 P55 (n = 1), and Mack2 P3 (n = 1)] was\npurified using GeneJET Genomic DNA Purification Kits (ThermoFisher Scientific\n#K0721). In an adapted method from Aranishi19, PCR was performed with Q5®\nHigh-Fidelity 2X Master Mix (New England Biolabs (NEB) #M0492, Ipswich, MA,\nUSA), with primers designed to target fish universal 5S rDNA (5S primers) and\n_Scomber_ genus-specific sequences of the 5S rDNA (Saba primers). The 5S\nforward and reverse primers used were 5S21F (5′-TACGC CCGAT CTCGT CCGAT C-3′)\nand 5S21R (5′-CAGGC TGGTA TGGCC GTAAG C-3′), respectively. The Saba forward\nand reverse primers used were Saba-18F (5′-GGGCG CTGTT GCTCC ATC-3′) and\nSaba-20R (5′- ATGCT GTGAC ACCAC TGACA-3). To confirm successful PCR, the\namplification products were run on a 2% agarose gel and imaged on the G:BOX\nChemi XR5 (Syngene, Bangalore, India). To confirm species identity, the 5S and\nSaba PCR products were purified using Monarch® PCR & DNA Cleanup Kit (5 μg)\n(NEB, # T1030). The purified DNA sequence was then analyzed through Sanger\nsequencing (GENEWIZ from Azenta, South Plainfield, NJ), using the forward\nprimer for amplification. The sequences were aligned to known 5S rDNA\nsequences for _S. colias_ , _S. scombrus_ , _S. australasicus_ , and _S.\njaponicus_ (NCBI GenBank Accession Numbers AB245986.1, AB246033.1, AB246025.1,\nand AB246016.1, respectively) with Geneious Prime (Biomatters, Inc., San\nDiego, CA, USA) nucleotide alignment.\n\n### Doubling time and cell diameter measurements\n\nTo track doubling time during cell culture, the dates/times of subculture and\ntotal viable cell numbers, as reported by the NC-200 automated cell counter,\nwere recorded. The growth rate and doubling time were calculated using Eqs. 1\nand 2:\n\n$$growth\\;rate \\left( {{\\text{h}}^{ - 1} } \\right) = \\frac{{\\ln \\left(\n{\\frac{viable\\;cells\\;at\\;passaging}{{viable\\;cells\\;at\\;seeding}}}\n\\right)}}{{culture\\;time\\left( {\\text{h}} \\right)}}$$\n\n(1)\n\n$$doubling\\;time\\;(h) = \\frac{\\ln \\left( 2 \\right)}{{growth\\;rate\n({\\text{h}}^{ - 1} )}}$$\n\n(2)\n\nCell diameters were obtained with the NC-200 automated cell counter.\n\n### Immunoctyochemistry\n\nTo validate myogenic potential, proliferating mackerel satellite cells were\nstained for paired-box protein 7 (PAX7), a marker of satellite cell identity.\nCells were fixed with 4% paraformaldehyde (ThermoFisher Scientific\n#AAJ61899AK) for 30 min, washed in DPBS with 0.1% Tween-20 (PBST, Sigma\nAldrich #P1379), permeabilized for 10 min using 0.1% Triton-X (Sigma Aldrich\n#T8787), blocked for 30 min using 1× blocking buffer (Abcam #ab1265875,\nCambridge, UK) in DPBS, and washed with PBST. Primary PAX7 antibody\n(ThermoFisher Scientific #PA5-68506) was diluted 1:100 in 1× blocking buffer,\nadded to cells, and incubated overnight at 4 °C. Cells were then washed with\nPBST, blocked for 30 min using 1× blocking buffer, and incubated for 1 h with\nsecondary antibody (ThermoFisher Scientific, #A-11072) and Phalloidin-iFluor\n488 Reagent (Abcam #ab176753), both diluted 1:1000 in 1× blocking buffer.\nAfter washing with PBST, the cell nuclei were stained with 1 µg/mL\n4′,6-diamidino-2-phenylindole (DAPI, ThermoFisher Scientific #62248) in DPBS\nfor 15 min at room temperature. Imaging was performed with a fluorescent\nwidefield microscope (KEYENCE, BZ-X700, Osaka, Japan).\n\nTo verify myogenicity, cells were cultured to 90–100% confluency in growth\nmedium, after which cell feeding was ceased (termed “serum starvation”).\nFollowing 10 days of differentiation, the cells were fixed, stained, and\nimaged as previously described, using primary antibodies for myosin heavy\nchain (Developmental Studies Hybridoma Bank #MF-20, Iowa City, IA, USA; 4\nµg/mL), appropriate secondary antibodies (ThermoFisher Scientific #A-11001,\n1:1000), Phalloidin, and DAPI.\n\n### Image analysis of immunostaining\n\nTo quantify the percentage of nuclei expressing either PAX7 or MHC, the\nBZ-X800 Analyzer software (KEYENCE, Osaka, Japan) was used. Overlay images\nwith cell nuclei (DAPI) and the immunostained target of interest were analyzed\nusing the “Hybrid Cell Count” software for single extraction of fluorescence\nimages. Results from the analysis were then run through a custom Python script\nto remove any replicate counts within the same nuclei. For the PAX7 expression\ncomparison over multiple passages, the samples were first blinded and then\npassed through the analysis.\n\nMuscle fiber diameter analysis was performed using ImageJ. First, the scale\nbar in the image was used to set the measuring scale in the program. The line\ntool was then used to outline the diameter of the muscle fiber that needed to\nbe measured. Then, the measuring command was used to record the muscle fiber\ndiameter. The measurements were taken randomly, with n = 20 for each image.\n\n### Lipid accumulation\n\nFor lipid accumulation towards an adipogenic-like phenotype, cells were grown\nto 100% confluency and then fed 3 times a week with adipogenic medium (growth\nmedium with 10 μg/mL insulin (Sigma Aldrich #I0516), 0.5 mM\n3-isobutyl-1-methylxanthine (IBMX, Sigma Aldrich #I5879), 0.25 μM\ndexamethasone (Sigma Aldrich #D4902), and 10 μL/mL lipid mixture (Sigma\nAldrich #L5146)). To visualize neutral lipids after 7 and 14 days of lipid\naccumulation, cells were fixed then stained with Oil Red O (ORO, Sigma Aldrich\n#O0625) and imaged via fluorescence microscopy. Briefly, a 3 mg/mL ORO stock\nwas prepared by dissolving ORO powder in 100% 2-proponal (VWR #BDH2032-1GLP,\nRadnor, PA, USA). That stock solution was then diluted to a 1.8 mg/mL working\nsolution in UltraPure™ Distilled Water (ThermoFisher #10977015), incubated at\nroom temperature for 5 min, and then filtered through a 0.22 µm syringe\nfilter. After fixation, the cells were incubated with ORO working solution for\n10 min, washed with water, and then imaged. To quantify lipid accumulation,\nORO was extracted from the cells with 2-propanol, and absorbance at 510 nm was\nmeasured on a Synergy H1 microplate reader (BioTek Instruments, Winooski, VT,\nUSA).\n\n### Lipidomics\n\nCells accumulated lipids for 14 days as described above. The cells were\nharvested and the lipids extracted via methyl tert-butyl ether (MTBE, Alfa\nAesar #41839AK, Haverhill, MA, USA) extraction as previously described50,51.\nBriefly, cells were grown in 3× T75 flasks, rinsed with DPBS, and harvested\nwith a cell scraper (Fisher Scientific #NC1890484, Waltham, MA, USA).\nSuspended cells were vortexed with methanol (ThermoFisher Scientific #BPA4544)\nbefore adding MTBE and incubating for 1 h. Distilled water was added, then\nsamples were vortexed and centrifuged at 10,000× _g_ for 5 min. The upper\norganic phase was removed, and MTBE extraction was repeated. Double-extracted\nMTBE phases were dried under liquid nitrogen and stored at − 20 °C.\n\nUntargeted lipidomics profiling (n = 3) was performed via high-resolution\nliquid chromatography with tandem mass spectrometry (Thermo Scientific\nQExactive Plus/HF Orbitrap HR-LC-MS/MS) at the Mass Spectrometry Core at Beth\nIsrael Deaconess Medical Center in Boston, Massachusetts51. Data processing\nwas performed in Python (v 3.8.5). The code and preprocessed dataset are\navailable in GitHub at the following URL:\nhttps://github.com/mksaad28/Saad_et_al_Mack. Python’s pandas (v 1.2.3) was\nused to organize the data for manipulation. The lipids were binned according\nto their classification (e.g., phospholipids, triglycerides). Within each\nclassification, the lipid peak areas of the associated fatty acids were summed\nto determine total fatty acid area, and the fatty acids were sorted as\nsaturated (SFAs), monounsaturated (MUFAs), or polyunsaturated (PUFAs) based on\ncomposition.\n\n### Cell growth at different seeding densities\n\nTo determine the minimum seeding density and maximum cell confluency of\nmackerel cells, the viability of mackerel cells was measured using the\nCyQUANT™ Cell Proliferation Assay kit (ThermoFisher Scientific #C7026)\naccording to the manufacturer’s instructions. Cells were seeded in 96-well\nplates at different seeding densities (1000, 2000, 3000, 4000, 5000, 6000,\n8000, and 10,000 cells/cm2) in triplicate for each time point and cultured at\n27 °C. The culture medium was replaced every other day. At each time point\n(days 1, 3, and 5), medium was aspirated, and the plate was stored at −80 °C.\nAfter thawing and a 5-min incubation with CyQUANT™ working solution,\nfluorescence was measured at an excitation of 480 nm and emission of 520 nm\nusing a Synergy H1 microplate reader. Cell number was calculated using a\nstandard curve of cells seeded at a known density.\n\n### Surface coatings\n\nTo assess ECM efficacy in optimizing cell growth, muscle differentiation, and\nadipogenic-like differentiation, different 2D surface coatings were studied.\nThe following proteins and concentrations were used: no coating control; pre-\ncoated collagen, type IV (Corning #354233, Corning, NY, USA) at 5 µg/cm2; pre-\ncoated fibronectin bovine protein (ThermoFisher Scientific #33010018) at 10\nµg/cm2; pre-coated gelatin (ATCC #PCS-999-027, Manassas, VA, USA) at 0.1\nmg/cm2; laminin-511-E8 at 0.25 µg/cm2, added to the media; and pre-coated\nvitronectin recombinant human protein (ThermoFisher Scientific #A14700) at 0.5\nµg/cm2.\n\nMack cells were seeded on the different surfaces at 6000 cells/cm2 in\nexperimental triplicate. The proliferation of mackerel cells was monitored at\n1-, 3-, and 5-days post-seeding using FluoReporter™ Blue Fluorometric dsDNA\nQuantitation Kit (ThermoFisher Scientific #F2962) according to the\nmanufacturer’s instructions. For FluoReporter™, fluorescence readings were\nperformed on a Synergy H1 microplate reader using excitation and emission\nfilters centered at 360 and 460 nm, respectively. Mackerel muscle\ndifferentiation was encouraged with cessation of feeding (serum starvation)\nand evaluated for MHC expression with MF-20 (immunostaining), as described\nearlier. Mackerel adipogenic-like differentiation was performed using\nadipogenic medium and evaluated with ORO quantification, as described earlier.\n\n### Muscle differentiation method screen\n\nTo screen different muscle differentiation regimes, six different methods were\ntested: cessation of feeding (serum starvation); medium containing 2% FBS\n(reduced serum); a differentiation medium (reduced serum + additives) adapted\nfrom Messmer et al.3—reduced serum with insulin (Sigma Aldrich #I0516),\n1-oleoyl lysophosphatidic acid (LPA) (Fisher Scientific #NC9401387), and\ntransferrin (InVitria #777TRF029, Aurora, CO, USA); reduced serum medium with\ninsulin-like growth factor 1 (IGF-1; Shenandoah Biotechnology #100-34,\nWarminster, PA, USA); reduced serum medium + additives with IGF-1; and a\nmedium with an extracellular signal-regulated kinase inhibitor (ERKi,\nMilliPore Sigma #1049738-54-6, Burlington, MA, USA), adapted from Eigler et\nal.2 More details on the media used are provided in Supplementary Table S1.\n\nMack1 cells were seeded with laminin-511-E8 in experimental triplicate and,\nupon reaching 100% confluency, were fed with the different regimes listed\nabove. After 10 days in culture, cells were fixed, stained with DAPI and\nMF-20, and images analyzed for the percent of MHC+ nuclei, as described\nearlier.\n\n### RT-qPCR\n\nPrimers for RT-qPCR were designed using the National Center for Biotechnology\ninformation (NCBI) Primer-BLAST tool. Primers were designed for the following\nsouthern bluefin tuna ( _Thunnus maccoyii_ ) genes: hypoxanthine–guanine\nphosphoribosyltransferase ( _HPRT_ , a housekeeping gene), paired box 3b (\n_PAX3B_ ), myogenic differentiation 1 ( _MYOD1_ ), myogenin ( _MYOG_ ),\n(troponin T type 3a ( _TNNT3A_ ), and peroxisome proliferator-activated\nreceptor gamma ( _PPARG_ ). For subsequent iterations of primer design, a _S.\nscombrus_ transcriptome (NCBI SRX2255766) was aligned with a _T. maccoyii_\nannotated genome (NBCI RefSeq GCF_910596095.1) with STAR aligner (v.2.7.0a).\nPrimer designs were then manually altered to better match the _S. scombrus_\nsequences.\n\nFor RT-qPCR, experimental triplicate cultures of Mack1 cells were prepared for\nfour conditions: proliferation, muscle differentiation with serum starvation;\nmuscle differentiation with reduced serum + additives (serum reduction); and\nlipid accumulation (adipogenic-like). For RNA extraction, cell lysates were\nharvested using the RNeasy Mini kit (Qiagen #74104, Germantown, MD, USA),\naccording to the manufacturer’s instructions. RNA concentrations were\ndetermined by Nanadrop™ 2000 spectrophotometer (ThermoFisher Scientific\n#ND-2000) at 260 nm. After RNA concentrations were normalized to the\nconcentration of the least concentrated sample, RNA was reverse-transcribed to\ncDNA using the iScript™ cDNA Synthesis kit (Bio-Rad #1708890, Hercules, CA,\nUSA), according to the manufacturer’s instructions.\n\nTo screen for successful primers, PCR was performed on cDNA using Q5® High-\nFidelity 2X Master Mix, and PCR products run on 2% agarose gels for visual\nconfirmation of efficacy and specificity. After screening confirmation,\nRT–qPCR was performed with technical triplicates for each experimental\nreplicate using SsoAdvanced Universal SYBR® Green Supermix (Bio-Rad #1725270)\nwith primer pairs shown in Supplementary Table S2. Using the cycle threshold\n(Ct) values, ΔCt was calculated for each sample and gene of interest by\nsubtracting the Ct of the housekeeping _HPRT_ gene for each sample. ΔΔCt was\nthen calculated by subtracting the proliferation ΔCt from the sample ΔCt for\neach gene. When gene expression was not detected for proliferation samples (as\nwas observed in some replicates of _TNNT3A_ ), the average of the run’s other\nreplicates for that gene was used. Fold induction over proliferation was\ncalculated as 2−ΔΔCt.\n\n### Mycoplasma testing\n\nCell cultures were monitored for the presence of mycoplasma contamination\nusing the MycoAlert® Mycoplasma Detection Kit (Lonza #LT07-318, Basel,\nSwitzerland) according to the manufacturer’s instructions. The MycoAlert®\nAssay is a selective biochemical test that evaluates mycoplasma enzymatic\nactivity by measuring conversion of adenosine diphosphate (ADP) to adenosine\ntriphosphate (ATP). Spent medium was collected following > 24-h incubation in\ncell culture then centrifuged at 200× _g_ for 5 min, and the supernatant was\ntransferred into white-walled opaque bottom 96-well plate (Griener Bio-One\n#655083, Kremsmünster, Austria). Luminescence was measured using a Synergy H1\nmicroplate reader microplate reader. Samples were incubated with MycoAlert™\nReagent for 5 min, and luminescence was measured (Reading A). Samples were\nthen incubated with MycoAlert™ Substrate for 10 min, and luminescence was\nmeasured again (Reading B). The luminescence ratio of Reading B/Reading A was\nused to determine the presence of mycoplasma contamination with ratio < 0.9\ninterpreted as negative for mycoplasma contamination. Samples were tested in\ntechnical triplicate, and assay performance was validated using negative and\npositive controls (MycoAlert™ Assay Control Set, Lonza #LT07-518).\n\n### Statistical analyses\n\nStatistical analyses were performed with GraphPad Prism (v9.3.1, San Diego,\nCA, USA). For comparing means between two samples, unpaired t-tests were\nperformed, as indicated in figure legends. For comparison of more than two\nsamples, either one-way or two-way Analysis of Variance (ANOVA) was performed,\nas indicated in figure legends, with multiple comparisons performed via\nTukey’s honest significant difference (HSD) post-hoc test. _P_ values < 0.05\nwere treated as significant. All errors are given as ± standard deviation,\nunless otherwise indicated. For RT-qPCR data, outliers were removed with JMP\n(v16.0.0), using the Univariate Quantile Range Outliers command, with the tail\nquantile = 0.3 and Q = 3.\n\n### Similar content being viewed by others\n\n###  Proteomic characterization of primary cultured myocytes in a fish model\nat different myogenesis stages\n\nArticle Open access 01 October 2019\n\nAntonio F. Millan-Cubillo, Miguel Martin-Perez, … Josefina Blasco\n\n###  Proteomic profile and morphological characteristics of skeletal muscle\nfrom the fast- and slow-growing yellow perch (Perca flavescens)\n\nArticle Open access 11 August 2021\n\nKarolina Kwasek, Young Min Choi, … Macdonald Wick\n\n###  Histological and transcriptomic analysis of muscular atrophy associated\nwith depleted flesh pigmentation in Atlantic salmon (Salmo salar) exposed to\nelevated seawater temperatures\n\nArticle Open access 14 March 2023\n\nThu Thi Minh Vo, Gianluca Amoroso, … Abigail Elizur\n\n## Data availability\n\nLipidomics data has been deposited to Open Science Framework (Accession Number\nT742A) and can be accessed at digital object identifier (DOI)\nhttps://doi.org/10.17605/OSF.IO/T742A.\n\n## Cell line availability\n\nThe spontaneously immortalized MACK1 cells are available for non-profit\nresearchers through Kerafast (Catalog # ETU008-FP).\n\n## References\n\n  1. Stout, A. J., Mirliani, A. B., Soule-albridge, E. L., Cohen, J. M. & Kaplan, L. Engineering carotenoid production in mammalian cells for nutritionally enhanced cell-cultured foods. _Metab. Eng._ **62** , 126–137 (2020).\n\nArticle  CAS  PubMed  PubMed Central  Google Scholar\n\n  2. Eigler, T. _et al._ ERK1/2 inhibition promotes robust myotube growth via CaMKII activation resulting in myoblast-to-myotube fusion. _Dev. Cell_ **56** , 3349-3363.e6 (2021).\n\nArticle  CAS  PubMed  PubMed Central  Google Scholar\n\n  3. Messmer, T. _et al._ A serum-free media formulation for cultured meat production supports bovine satellite cell differentiation in the absence of serum starvation. _Nat. Food_ **3** , 74–85 (2022).\n\nArticle  CAS  Google Scholar\n\n  4. Ben-Arye, T. _et al._ Textured soy protein scaffolds enable the generation of three-dimensional bovine skeletal muscle tissue for cell-based meat. _Nat. Food_ **1** , 210–220 (2020).\n\nArticle  CAS  Google Scholar\n\n  5. Béné, C., Barange, M. & Subasinghe, R. Feeding 9 billion by 2050—Putting fish back on the menu. _Food Secur._ https://doi.org/10.1007/s12571-015-0427-z (2015).\n\nArticle  Google Scholar\n\n  6. Myers, R. A. & Worm, B. Rapid worldwide depletion of predatory fish communities. _Nature_ **423** , 280–283 (2003).\n\nArticle  ADS  CAS  PubMed  Google Scholar\n\n  7. Funk, C. C. & Brown, M. E. Declining global per capita agricultural production and warming oceans threaten food security. _Food Secur._ https://doi.org/10.1007/s12571-009-0026-y (2009).\n\nArticle  Google Scholar\n\n  8. Walker, P. J. & Winton, J. R. Emerging viral diseases of fish and shrimp. _Vet. Res._ **41** , 51 (2010).\n\nArticle  PubMed  PubMed Central  Google Scholar\n\n  9. Rubio, N., Datar, I., Stachura, D., Kaplan, D. & Krueger, K. Cell-based fish: A novel approach to seafood production and an opportunity for cellular agriculture. _Front. Sustain. Food Syst._ https://doi.org/10.3389/fsufs.2019.00043 (2019).\n\nArticle  Google Scholar\n\n  10. Bairoch, A. The cellosaurus, a cell-line knowledge resource. _J. Biomol. Tech._ **29** , 25–38 (2018).\n\nArticle  PubMed  PubMed Central  Google Scholar\n\n  11. Vishnolia, K. K., Martin, N. R. W., Player, D. J., Spikings, E. & Lewis, M. P. Zebrafish skeletal muscle cell cultures: Monolayer to three-dimensional tissue engineered collagen constructs. _bioRxiv_ **44** , 2020 (2020).\n\nGoogle Scholar\n\n  12. Li, N., Guo, L. & Guo, H. Establishment, characterization, and transfection potential of a new continuous fish cell line (CAM) derived from the muscle tissue of grass goldfish (Carassius auratus). _In Vitro Cell Dev. Biol. Anim._ https://doi.org/10.1007/s11626-021-00622-1 (2021).\n\nArticle  PubMed  PubMed Central  Google Scholar\n\n  13. Gabillard, J. C., Sabin, N. & Paboeuf, G. In vitro characterization of proliferation and differentiation of trout satellite cells. _Cell Tissue Res._ https://doi.org/10.1007/s00441-010-1071-8 (2010).\n\nArticle  PubMed  Google Scholar\n\n  14. Oestbye, T. K. & Ytteborg, E. Preparation and culturing of Atlantic salmon muscle cells for in vitro studies. _Myogenes. Methods Protoc._ **1889** , 319–330 (2019).\n\nArticle  CAS  Google Scholar\n\n  15. Specht-Overholt, S. _et al._ Fatty acid composition of commercially manufactured omega-3 enriched pork products, haddock, and mackerel. _J. Anim. Sci._ **75** , 2335–2343 (1997).\n\nArticle  CAS  PubMed  Google Scholar\n\n  16. Monterey Bay Aquarium. Seafood Watch—Atlantic Mackerel. https://www.seafoodwatch.org/recommendation/mackerel/atlantic-mackerel-15404?species=315 (2022).\n\n  17. FDA/EPA. FDA/EPA 2004 Advice on What You Need to Know About Mercury in Fish and Shellfish. https://www.fda.gov/food/metals-and-your-food/fdaepa-2004-advice-what-you-need-know-about-mercury-fish-and-shellfish (2004).\n\n  18. Ward, R. D., Hanner, R. & Hebert, P. D. N. The campaign to DNA barcode all fishes, FISH-BOL. _J. Fish Biol._ **74** , 329–356 (2009).\n\nArticle  CAS  PubMed  Google Scholar\n\n  19. Aranishi, F. PCR-RFLP analysis of nuclear nontranscribed spacer for mackerel species identification. _J. Agric. Food Chem._ **53** , 508–511 (2005).\n\nArticle  CAS  PubMed  Google Scholar\n\n  20. Ahmadian, M. _et al._ PPARγ signaling and metabolism: the good, the bad and the future. _Nat. Med._ **19** , 557–566 (2013).\n\nArticle  CAS  PubMed  Google Scholar\n\n  21. Furuhashi, M. _et al._ Formation of contractile 3D bovine muscle tissue for construction of millimetre-thick cultured steak. _NPJ Sci. Food_ **5** , 1–8. https://doi.org/10.1038/s41538-021-00090-7 (2021).\n\nArticle  Google Scholar\n\n  22. Aminullah, A. K. M., Ratnayake, W. M. N. & Ackman, R. G. Effect of smoking on the proximate composition Atlantic mackerel ( _Scomber scombrus_ ). _J. Food Sci._ **51** , 327–329 (1986).\n\nArticle  Google Scholar\n\n  23. el Oudiani, S., Chetoui, I., Darej, C. & Moujahed, N. Sex and seasonal variation in proximate composition and fatty acid profile of Scomber scombrus (L. 1758) fillets from the Middle East Coast of Tunisia. _Grasas Aceites_ **70** , 1–10 (2019).\n\nArticle  Google Scholar\n\n  24. Boselli, E., Pacetti, D., Lucci, P. & Frega, N. G. Characterization of phospholipid molecular species in the edible parts of bony fish and shellfish. _J. Agric. Food Chem._ **60** , 3234–3245 (2012).\n\nArticle  CAS  PubMed  Google Scholar\n\n  25. Bhuiyan, A. K. M. A., Ratnayake, W. M. N. & Ackman, R. G. Stability of lipids and polyunsaturated fatty acids during smoking of Atlantic mackerel ( _Scomber scombrus_ L.). _J. Am. Oil. Chem. Soc._ **63** , 324–328 (1985).\n\nGoogle Scholar\n\n  26. Molversmyr, E. Identification and quantitation of lipids in Atlantic mackerel (Scomber scombrus), wild and farmed Atlantic salmon (Salmo salar), and salmon feed by GC-MS. _Food Sci. Nutr._ **10** , 3117–3127 (2020).\n\nArticle  Google Scholar\n\n  27. Lamberstein, G. & Braekkan, O. R. The fatty acid composition of cod liver oil. Reports on Technological Research concerning Norwegian Fish Industry IV (1965).\n\n  28. Helland, I., Saarem, K., Saugstad, O. & Drevon, C. Fatty acid composition in maternal milk and plasma during supplementation with cod liver oil. _Eur. J. Clin. Nutr._ **52** , 839–845 (1998).\n\nArticle  CAS  PubMed  Google Scholar\n\n  29. Pan, S. X., Ushio, H. & Ohshima, T. Comparison of volatile compounds formed by autoxidation and photosensitized oxidation of cod liver oil in emulsion systems. _Fish Sci._ **71** , 639–647 (2005).\n\nArticle  CAS  Google Scholar\n\n  30. Miya, M. _et al._ Evolutionary origin of the scombridae (Tunas and Mackerels): Members of a paleogene adaptive radiation with 14 other pelagic fish families. _PLoS ONE_ **8** , 1–19 (2013).\n\nArticle  Google Scholar\n\n  31. Dobin, A. _et al._ STAR: Ultrafast universal RNA-seq aligner. _Bioinformatics_ **29** , 15–21 (2013).\n\nArticle  CAS  PubMed  Google Scholar\n\n  32. Blau, H. M., Chiu, C. & Webster, C. Cytoplasmic activation of human nuclear genes in stable heterocaryons. _Cell_ **32** , 1171–1180 (1983).\n\nArticle  CAS  PubMed  Google Scholar\n\n  33. Yaffe, D. & Saxel, O. Serial passaging and differentiation of myogenic cells isolated from dystrophic mouse muscle. _Nature_ **270** , 725–727 (1977).\n\nArticle  ADS  CAS  PubMed  Google Scholar\n\n  34. Post, M. J. _et al._ Scientific, sustainability and regulatory challenges of cultured meat. _Nat. Food_ **1** , 403–415 (2020).\n\nArticle  Google Scholar\n\n  35. Goswami, M. _et al._ Cellular aquaculture: Prospects and challenges. _Micromachines (Basel)_ **13** , 828 (2022).\n\nArticle  PubMed  Google Scholar\n\n  36. Kochzius, M. _et al._ Identifying fishes through DNA barcodes and microarrays. _PLoS ONE_ **5** , 1–15 (2010).\n\nArticle  Google Scholar\n\n  37. Bain, P. A. _et al._ Establishment of a continuous cell line from southern bluefin tuna ( _Thunnus maccoyii_ ). _Aquaculture_ **376–379** , 59–63 (2013).\n\nArticle  Google Scholar\n\n  38. Stout, A. J. _et al._ Simple and effective serum-free medium for sustained expansion of bovine satellite cells for cell cultured meat. _Commun. Biol._ **5** , 466 (2022).\n\nArticle  CAS  PubMed  PubMed Central  Google Scholar\n\n  39. Benjaminson, M. A., Gilchriest, J. A. & Lorenz, M. In vitro edible muscle protein production system (MPPS): Stage 1, fish. _Acta Astronaut._ **51** , 879–889 (2002).\n\nArticle  ADS  CAS  PubMed  Google Scholar\n\n  40. Yuan, Y. & Hong, Y. Medaka insulin-like growth factor-2 supports self-renewal of the embryonic stem cell line and blastomeres in vitro. _Sci. Rep._ **7** , 1–11 (2017).\n\nADS  Google Scholar\n\n  41. Rasmussen, M. & Jin, J.-P. Troponin variants as markers of skeletal muscle health and diseases. _Front. Physiol._ **12** , 1–14 (2021).\n\nArticle  Google Scholar\n\n  42. Muroya, S., Nakajima, I., Oe, M. & Chikuni, K. Effect of phase limited inhibition of MyoD expression on the terminal differentiation of bovine myoblasts: No alteration of Myf5 or myogenin expression. _Dev. Growth Differ._ **47** , 483–492 (2005).\n\nArticle  CAS  PubMed  Google Scholar\n\n  43. Chen, X. _et al._ Comparative proteomic study of fatty acid-treated myoblasts reveals role of cox-2 in palmitate- induced insulin resistance. _Sci. Rep._ **6** , 1–12 (2016).\n\nGoogle Scholar\n\n  44. Teboul, L. _et al._ Thiazolidinediones and fatty acids convert myogenic cells into adipose-like cells. _J. Biol. Chem._ **270** , 28183–28187 (1995).\n\nArticle  CAS  PubMed  Google Scholar\n\n  45. Demonbreun, A. R. & McNally, E. M. Muscle cell communication in development and repair. _Curr. Opin. Pharmacol._ **34** , 1–15 (2018).\n\nGoogle Scholar\n\n  46. Patton, J. S. The effect of pressure and temperature on phospholipid and triglyceride fatty acids of fish white msucle: A comparison of deepwater and surface marine species. _Comp. Biochem. Physiol._ **52B** , 105–110 (1975).\n\nGoogle Scholar\n\n  47. Malekar, V. C. _et al._ Effect of elevated temperature on membrane lipid saturation in Antarctic notothenioid fish. _PeerJ_ **6** , 1–25 (2018).\n\nArticle  Google Scholar\n\n  48. Starkey, J. D., Yamamoto, M., Yamamoto, S. & Goldhamer, D. J. Skeletal muscle satellite cells are committed to myogenesis and do not spontaneously adopt nonmyogenic fates. _J. Histochem. Cytochem._ **59** , 33–46 (2011).\n\nArticle  CAS  PubMed  PubMed Central  Google Scholar\n\n  49. Wada, M. R., Inagawa-ogashiwa, M., Shimizu, S. & Yasumoto, S. Generation of different fates from multipotent muscle stem cells. _Development_ **129** , 2987–2995 (2002).\n\nArticle  CAS  PubMed  Google Scholar\n\n  50. Yuen Jr., J. S. _et al_. Macroscale adipose tissue from cellular aggregates: A simplified method of mass producing cell-cultured fat for food applications. bioRxiv (2022).\n\n  51. Breitkopf, S. B. _et al._ A relative quantitative positive/negative ion switching method for untargeted lipidomics via high resolution LC-MS/MS from any biological source. _Metabolomics_ **13** , 1–21 (2018).\n\nMathSciNet  Google Scholar\n\nDownload references\n\n## Acknowledgements\n\nWe thank Jake Marko, Sophie Letcher, Andrew Stout, Natalie Rubio, Rebecca\nBatorsky, Christel Andreassen, Edward Gordon, and Claire Bomkamp for their\nscientific input. We also thank Captains Johnny Johnson, Ira Shank, Pete\nSpeeches, and Andrew Lebel for their graciousness in providing fish tissue for\nthis research.\n\n## Funding\n\nFunding was provided by the Good Food Institute, the United States Department\nof Agriculture (2021-69012-35978), the National Institutes of Health (Grant\nNo. P41EB027062), and Wanda Fish Technologies.\n\n## Author information\n\n### Authors and Affiliations\n\n  1. Biomedical Engineering Department, Tissue Engineering Resource Center, Tufts University, 4 Colby St, Medford, MA, 02155, USA\n\nMichael K. Saad, John S. K. Yuen Jr, Connor M. Joyce, Xinxin Li, Taehwan Lim,\nTalia L. Wolfson, Justin Wu, Sanjana Vissapragada, Olivia P. Calkins, Adham\nAli & David L. Kaplan\n\n  2. Research Technology, Tufts University, 16 Dearborn Rd, Somerville, MA, 02144, USA\n\nJason Laird\n\nAuthors\n\n  1. Michael K. Saad\n\nView author publications\n\nYou can also search for this author in PubMed Google Scholar\n\n  2. John S. K. Yuen Jr\n\nView author publications\n\nYou can also search for this author in PubMed Google Scholar\n\n  3. Connor M. Joyce\n\nView author publications\n\nYou can also search for this author in PubMed Google Scholar\n\n  4. Xinxin Li\n\nView author publications\n\nYou can also search for this author in PubMed Google Scholar\n\n  5. Taehwan Lim\n\nView author publications\n\nYou can also search for this author in PubMed Google Scholar\n\n  6. Talia L. Wolfson\n\nView author publications\n\nYou can also search for this author in PubMed Google Scholar\n\n  7. Justin Wu\n\nView author publications\n\nYou can also search for this author in PubMed Google Scholar\n\n  8. Jason Laird\n\nView author publications\n\nYou can also search for this author in PubMed Google Scholar\n\n  9. Sanjana Vissapragada\n\nView author publications\n\nYou can also search for this author in PubMed Google Scholar\n\n  10. Olivia P. Calkins\n\nView author publications\n\nYou can also search for this author in PubMed Google Scholar\n\n  11. Adham Ali\n\nView author publications\n\nYou can also search for this author in PubMed Google Scholar\n\n  12. David L. Kaplan\n\nView author publications\n\nYou can also search for this author in PubMed Google Scholar\n\n### Contributions\n\nM.K.S. conducted experiments, performed data analysis, designed figures, and\nwrote the main manuscript text. J.S.K.Y. assisted in primary cell isolations.\nC.M.J. and T.L.W. maintained cells over long-term culture. C.M.J., X.L., T.L.,\nT.L.W., J.W., and S.V. performed experiments and collected data for figures.\nJL assisted in bioinformatics. O.P.C. and A.A. assisted in figure design.\nD.L.K. contributed experimental design and manuscript drafting. All the\nauthors have read and approved the final submitted version.\n\n### Corresponding author\n\nCorrespondence to David L. Kaplan.\n\n## Ethics declarations\n\n### Competing interests\n\nThe authors declare no competing interests.\n\n## Additional information\n\n### Publisher's note\n\nSpringer Nature remains neutral with regard to jurisdictional claims in\npublished maps and institutional affiliations.\n\n## Supplementary Information\n\n### Supplementary Information.\n\n## Rights and permissions\n\n**Open Access** This article is licensed under a Creative Commons Attribution\n4.0 International License, which permits use, sharing, adaptation,\ndistribution and reproduction in any medium or format, as long as you give\nappropriate credit to the original author(s) and the source, provide a link to\nthe Creative Commons licence, and indicate if changes were made. The images or\nother third party material in this article are included in the article's\nCreative Commons licence, unless indicated otherwise in a credit line to the\nmaterial. If material is not included in the article's Creative Commons\nlicence and your intended use is not permitted by statutory regulation or\nexceeds the permitted use, you will need to obtain permission directly from\nthe copyright holder. To view a copy of this licence, visit\nhttp://creativecommons.org/licenses/by/4.0/.\n\nReprints and permissions\n\n## About this article\n\n### Cite this article\n\nSaad, M.K., Yuen, J.S.K., Joyce, C.M. _et al._ Continuous fish muscle cell\nline with capacity for myogenic and adipogenic-like phenotypes. _Sci Rep_\n**13** , 5098 (2023). https://doi.org/10.1038/s41598-023-31822-2\n\nDownload citation\n\n  * Received: 10 September 2022\n\n  * Accepted: 17 March 2023\n\n  * Published: 29 March 2023\n\n  * DOI: https://doi.org/10.1038/s41598-023-31822-2\n\n### Share this article\n\nAnyone you share the following link with will be able to read this content:\n\nGet shareable link\n\nSorry, a shareable link is not currently available for this article.\n\nCopy to clipboard\n\nProvided by the Springer Nature SharedIt content-sharing initiative\n\n### Subjects\n\n  * Biological techniques\n  * Biotechnology\n  * Cell biology\n\n## This article is cited by\n\n  * ###  Stem cell-based strategies and challenges for production of cultivated meat \n\n    * T. C. Jara\n    * K. Park\n    * A. C. Denicol\n\n_Nature Food_ (2023)\n\n  * ###  Development of a cell line from skeletal trunk muscle of the fish Labeo rohita \n\n    * Mukunda Goswami\n    * Nevil Pinto\n    * Reza Ovissipour\n\n_Cytotechnology_ (2023)\n\n  * ###  Fish cell line: depositories, web resources and future applications \n\n    * Murali S. Kumar\n    * Vijay Kumar Singh\n    * Kuldeep Kumar Lal\n\n_Cytotechnology_ (2023)\n\n## Comments\n\nBy submitting a comment you agree to abide by our Terms and Community\nGuidelines. If you find something abusive or that does not comply with our\nterms or guidelines please flag it as inappropriate.\n\nDownload PDF\n\n  * Sections\n  * Figures\n  * References\n\n  * Abstract\n  * Introduction\n  * Results\n  * Discussion\n  * Methods\n  * Data availability\n  * Cell line availability\n  * References\n  * Acknowledgements\n  * Funding\n  * Author information\n  * Ethics declarations\n  * Additional information\n  * Supplementary Information\n  * Rights and permissions\n  * About this article\n  * This article is cited by\n  * Comments\n\nAdvertisement\n\n  * **Figure 1**\n\nView in articleFull size image\n\n  *  **Figure 2**\n\nView in articleFull size image\n\n  *  **Figure 3**\n\nView in articleFull size image\n\n  *  **Figure 4**\n\nView in articleFull size image\n\n  *  **Figure 5**\n\nView in articleFull size image\n\n  *  **Figure 6**\n\nView in articleFull size image\n\n  1. Stout, A. J., Mirliani, A. B., Soule-albridge, E. L., Cohen, J. M. & Kaplan, L. Engineering carotenoid production in mammalian cells for nutritionally enhanced cell-cultured foods. _Metab. Eng._ **62** , 126–137 (2020).\n\nArticle CAS PubMed PubMed Central  Google Scholar\n\n  2. Eigler, T. _et al._ ERK1/2 inhibition promotes robust myotube growth via CaMKII activation resulting in myoblast-to-myotube fusion. _Dev. Cell_ **56** , 3349-3363.e6 (2021).\n\nArticle CAS PubMed PubMed Central  Google Scholar\n\n  3. Messmer, T. _et al._ A serum-free media formulation for cultured meat production supports bovine satellite cell differentiation in the absence of serum starvation. _Nat. Food_ **3** , 74–85 (2022).\n\nArticle CAS  Google Scholar\n\n  4. Ben-Arye, T. _et al._ Textured soy protein scaffolds enable the generation of three-dimensional bovine skeletal muscle tissue for cell-based meat. _Nat. Food_ **1** , 210–220 (2020).\n\nArticle CAS  Google Scholar\n\n  5. Béné, C., Barange, M. & Subasinghe, R. Feeding 9 billion by 2050—Putting fish back on the menu. _Food Secur._ https://doi.org/10.1007/s12571-015-0427-z (2015).\n\nArticle  Google Scholar\n\n  6. Myers, R. A. & Worm, B. Rapid worldwide depletion of predatory fish communities. _Nature_ **423** , 280–283 (2003).\n\nArticle ADS CAS PubMed  Google Scholar\n\n  7. Funk, C. C. & Brown, M. E. Declining global per capita agricultural production and warming oceans threaten food security. _Food Secur._ https://doi.org/10.1007/s12571-009-0026-y (2009).\n\nArticle  Google Scholar\n\n  8. Walker, P. J. & Winton, J. R. Emerging viral diseases of fish and shrimp. _Vet. Res._ **41** , 51 (2010).\n\nArticle PubMed PubMed Central  Google Scholar\n\n  9. Rubio, N., Datar, I., Stachura, D., Kaplan, D. & Krueger, K. Cell-based fish: A novel approach to seafood production and an opportunity for cellular agriculture. _Front. Sustain. Food Syst._ https://doi.org/10.3389/fsufs.2019.00043 (2019).\n\nArticle  Google Scholar\n\n  10. Bairoch, A. The cellosaurus, a cell-line knowledge resource. _J. Biomol. Tech._ **29** , 25–38 (2018).\n\nArticle PubMed PubMed Central  Google Scholar\n\n  11. Vishnolia, K. K., Martin, N. R. W., Player, D. J., Spikings, E. & Lewis, M. P. Zebrafish skeletal muscle cell cultures: Monolayer to three-dimensional tissue engineered collagen constructs. _bioRxiv_ **44** , 2020 (2020).\n\nGoogle Scholar\n\n  12. Li, N., Guo, L. & Guo, H. Establishment, characterization, and transfection potential of a new continuous fish cell line (CAM) derived from the muscle tissue of grass goldfish (Carassius auratus). _In Vitro Cell Dev. Biol. Anim._ https://doi.org/10.1007/s11626-021-00622-1 (2021).\n\nArticle PubMed PubMed Central  Google Scholar\n\n  13. Gabillard, J. C., Sabin, N. & Paboeuf, G. In vitro characterization of proliferation and differentiation of trout satellite cells. _Cell Tissue Res._ https://doi.org/10.1007/s00441-010-1071-8 (2010).\n\nArticle PubMed  Google Scholar\n\n  14. Oestbye, T. K. & Ytteborg, E. Preparation and culturing of Atlantic salmon muscle cells for in vitro studies. _Myogenes. Methods Protoc._ **1889** , 319–330 (2019).\n\nArticle CAS  Google Scholar\n\n  15. Specht-Overholt, S. _et al._ Fatty acid composition of commercially manufactured omega-3 enriched pork products, haddock, and mackerel. _J. Anim. Sci._ **75** , 2335–2343 (1997).\n\nArticle CAS PubMed  Google Scholar\n\n  16. Monterey Bay Aquarium. Seafood Watch—Atlantic Mackerel. https://www.seafoodwatch.org/recommendation/mackerel/atlantic-mackerel-15404?species=315 (2022).\n\n  17. FDA/EPA. FDA/EPA 2004 Advice on What You Need to Know About Mercury in Fish and Shellfish. https://www.fda.gov/food/metals-and-your-food/fdaepa-2004-advice-what-you-need-know-about-mercury-fish-and-shellfish (2004).\n\n  18. Ward, R. D., Hanner, R. & Hebert, P. D. N. The campaign to DNA barcode all fishes, FISH-BOL. _J. Fish Biol._ **74** , 329–356 (2009).\n\nArticle CAS PubMed  Google Scholar\n\n  19. Aranishi, F. PCR-RFLP analysis of nuclear nontranscribed spacer for mackerel species identification. _J. Agric. Food Chem._ **53** , 508–511 (2005).\n\nArticle CAS PubMed  Google Scholar\n\n  20. Ahmadian, M. _et al._ PPARγ signaling and metabolism: the good, the bad and the future. _Nat. Med._ **19** , 557–566 (2013).\n\nArticle CAS PubMed  Google Scholar\n\n  21. Furuhashi, M. _et al._ Formation of contractile 3D bovine muscle tissue for construction of millimetre-thick cultured steak. _NPJ Sci. Food_ **5** , 1–8. https://doi.org/10.1038/s41538-021-00090-7 (2021).\n\nArticle  Google Scholar\n\n  22. Aminullah, A. K. M., Ratnayake, W. M. N. & Ackman, R. G. Effect of smoking on the proximate composition Atlantic mackerel ( _Scomber scombrus_ ). _J. Food Sci._ **51** , 327–329 (1986).\n\nArticle  Google Scholar\n\n  23. el Oudiani, S., Chetoui, I., Darej, C. & Moujahed, N. Sex and seasonal variation in proximate composition and fatty acid profile of Scomber scombrus (L. 1758) fillets from the Middle East Coast of Tunisia. _Grasas Aceites_ **70** , 1–10 (2019).\n\nArticle  Google Scholar\n\n  24. Boselli, E., Pacetti, D., Lucci, P. & Frega, N. G. Characterization of phospholipid molecular species in the edible parts of bony fish and shellfish. _J. Agric. Food Chem._ **60** , 3234–3245 (2012).\n\nArticle CAS PubMed  Google Scholar\n\n  25. Bhuiyan, A. K. M. A., Ratnayake, W. M. N. & Ackman, R. G. Stability of lipids and polyunsaturated fatty acids during smoking of Atlantic mackerel ( _Scomber scombrus_ L.). _J. Am. Oil. Chem. Soc._ **63** , 324–328 (1985).\n\nGoogle Scholar\n\n  26. Molversmyr, E. Identification and quantitation of lipids in Atlantic mackerel (Scomber scombrus), wild and farmed Atlantic salmon (Salmo salar), and salmon feed by GC-MS. _Food Sci. Nutr._ **10** , 3117–3127 (2020).\n\nArticle  Google Scholar\n\n  27. Lamberstein, G. & Braekkan, O. R. The fatty acid composition of cod liver oil. Reports on Technological Research concerning Norwegian Fish Industry IV (1965).\n\n  28. Helland, I., Saarem, K., Saugstad, O. & Drevon, C. Fatty acid composition in maternal milk and plasma during supplementation with cod liver oil. _Eur. J. Clin. Nutr._ **52** , 839–845 (1998).\n\nArticle CAS PubMed  Google Scholar\n\n  29. Pan, S. X., Ushio, H. & Ohshima, T. Comparison of volatile compounds formed by autoxidation and photosensitized oxidation of cod liver oil in emulsion systems. _Fish Sci._ **71** , 639–647 (2005).\n\nArticle CAS  Google Scholar\n\n  30. Miya, M. _et al._ Evolutionary origin of the scombridae (Tunas and Mackerels): Members of a paleogene adaptive radiation with 14 other pelagic fish families. _PLoS ONE_ **8** , 1–19 (2013).\n\nArticle  Google Scholar\n\n  31. Dobin, A. _et al._ STAR: Ultrafast universal RNA-seq aligner. _Bioinformatics_ **29** , 15–21 (2013).\n\nArticle CAS PubMed  Google Scholar\n\n  32. Blau, H. M., Chiu, C. & Webster, C. Cytoplasmic activation of human nuclear genes in stable heterocaryons. _Cell_ **32** , 1171–1180 (1983).\n\nArticle CAS PubMed  Google Scholar\n\n  33. Yaffe, D. & Saxel, O. Serial passaging and differentiation of myogenic cells isolated from dystrophic mouse muscle. _Nature_ **270** , 725–727 (1977).\n\nArticle ADS CAS PubMed  Google Scholar\n\n  34. Post, M. J. _et al._ Scientific, sustainability and regulatory challenges of cultured meat. _Nat. Food_ **1** , 403–415 (2020).\n\nArticle  Google Scholar\n\n  35. Goswami, M. _et al._ Cellular aquaculture: Prospects and challenges. _Micromachines (Basel)_ **13** , 828 (2022).\n\nArticle PubMed  Google Scholar\n\n  36. Kochzius, M. _et al._ Identifying fishes through DNA barcodes and microarrays. _PLoS ONE_ **5** , 1–15 (2010).\n\nArticle  Google Scholar\n\n  37. Bain, P. A. _et al._ Establishment of a continuous cell line from southern bluefin tuna ( _Thunnus maccoyii_ ). _Aquaculture_ **376–379** , 59–63 (2013).\n\nArticle  Google Scholar\n\n  38. Stout, A. J. _et al._ Simple and effective serum-free medium for sustained expansion of bovine satellite cells for cell cultured meat. _Commun. Biol._ **5** , 466 (2022).\n\nArticle CAS PubMed PubMed Central  Google Scholar\n\n  39. Benjaminson, M. A., Gilchriest, J. A. & Lorenz, M. In vitro edible muscle protein production system (MPPS): Stage 1, fish. _Acta Astronaut._ **51** , 879–889 (2002).\n\nArticle ADS CAS PubMed  Google Scholar\n\n  40. Yuan, Y. & Hong, Y. Medaka insulin-like growth factor-2 supports self-renewal of the embryonic stem cell line and blastomeres in vitro. _Sci. Rep._ **7** , 1–11 (2017).\n\nADS  Google Scholar\n\n  41. Rasmussen, M. & Jin, J.-P. Troponin variants as markers of skeletal muscle health and diseases. _Front. Physiol._ **12** , 1–14 (2021).\n\nArticle  Google Scholar\n\n  42. Muroya, S., Nakajima, I., Oe, M. & Chikuni, K. Effect of phase limited inhibition of MyoD expression on the terminal differentiation of bovine myoblasts: No alteration of Myf5 or myogenin expression. _Dev. Growth Differ._ **47** , 483–492 (2005).\n\nArticle CAS PubMed  Google Scholar\n\n  43. Chen, X. _et al._ Comparative proteomic study of fatty acid-treated myoblasts reveals role of cox-2 in palmitate- induced insulin resistance. _Sci. Rep._ **6** , 1–12 (2016).\n\nGoogle Scholar\n\n  44. Teboul, L. _et al._ Thiazolidinediones and fatty acids convert myogenic cells into adipose-like cells. _J. Biol. Chem._ **270** , 28183–28187 (1995).\n\nArticle CAS PubMed  Google Scholar\n\n  45. Demonbreun, A. R. & McNally, E. M. Muscle cell communication in development and repair. _Curr. Opin. Pharmacol._ **34** , 1–15 (2018).\n\nGoogle Scholar\n\n  46. Patton, J. S. The effect of pressure and temperature on phospholipid and triglyceride fatty acids of fish white msucle: A comparison of deepwater and surface marine species. _Comp. Biochem. Physiol._ **52B** , 105–110 (1975).\n\nGoogle Scholar\n\n  47. Malekar, V. C. _et al._ Effect of elevated temperature on membrane lipid saturation in Antarctic notothenioid fish. _PeerJ_ **6** , 1–25 (2018).\n\nArticle  Google Scholar\n\n  48. Starkey, J. D., Yamamoto, M., Yamamoto, S. & Goldhamer, D. J. Skeletal muscle satellite cells are committed to myogenesis and do not spontaneously adopt nonmyogenic fates. _J. Histochem. Cytochem._ **59** , 33–46 (2011).\n\nArticle CAS PubMed PubMed Central  Google Scholar\n\n  49. Wada, M. R., Inagawa-ogashiwa, M., Shimizu, S. & Yasumoto, S. Generation of different fates from multipotent muscle stem cells. _Development_ **129** , 2987–2995 (2002).\n\nArticle CAS PubMed  Google Scholar\n\n  50. Yuen Jr., J. S. _et al_. Macroscale adipose tissue from cellular aggregates: A simplified method of mass producing cell-cultured fat for food applications. bioRxiv (2022).\n\n  51. Breitkopf, S. B. _et al._ A relative quantitative positive/negative ion switching method for untargeted lipidomics via high resolution LC-MS/MS from any biological source. _Metabolomics_ **13** , 1–21 (2018).\n\nMathSciNet  Google Scholar\n\nScientific Reports ( _Sci Rep_ )  ISSN 2045-2322 (online)\n\n## nature.com sitemap\n\n### About Nature Portfolio\n\n  * About us\n  * Press releases\n  * Press office\n  * Contact us\n\n### Discover content\n\n  * Journals A-Z\n  * Articles by subject\n  * Protocol Exchange\n  * Nature Index\n\n### Publishing policies\n\n  * Nature portfolio policies\n  * Open access\n\n### Author & Researcher services\n\n  * Reprints & permissions\n  * Research data\n  * Language editing\n  * Scientific editing\n  * Nature Masterclasses\n  * Live Expert Trainer-led workshops\n  * Research Solutions\n\n### Libraries & institutions\n\n  * Librarian service & tools\n  * Librarian portal\n  * Open research\n  * Recommend to library\n\n### Advertising & partnerships\n\n  * Advertising\n  * Partnerships & Services\n  * Media kits\n  * Branded content\n\n### Professional development\n\n  * Nature Careers\n  * Nature Conferences\n\n### Regional websites\n\n  * Nature Africa\n  * Nature China\n  * Nature India\n  * Nature Italy\n  * Nature Japan\n  * Nature Korea\n  * Nature Middle East\n\n  * Privacy Policy\n  * Use of cookies\n  * Your privacy choices/Manage cookies \n  * Legal notice\n  * Accessibility statement\n  * Terms & Conditions\n  * Your US state privacy rights\n\n© 2024 Springer Nature Limited\n\nClose banner Close\n\nSign up for the _Nature Briefing: Translational Research_ newsletter — top\nstories in biotechnology, drug discovery and pharma.\n\nEmail address\n\nSign up\n\nI agree my information will be processed in accordance with the _Nature_ and\nSpringer Nature Limited Privacy Policy.\n\nClose banner Close\n\nGet what matters in translational research, free to your inbox weekly. Sign up\nfor Nature Briefing: Translational Research\n\n  *[DOI]: Digital Object Identifier\n  *[ISSN]: International Standard Serial Number\n\n",
    "links": "[{\"link\": \"https://pubads.g.doubleclick.net/gampad/jump?iu=/285/scientific_reports/article&sz=728x90&c=1106621634&t=pos%3Dtop%26type%3Darticle%26artid%3Ds41598-023-31822-2%26doi%3D10.1038/s41598-023-31822-2%26subjmeta%3D1647,61,631,80%26kwrd%3DBiological+techniques,Biotechnology,Cell+biology\", \"text\": \"\"}, {\"link\": \"https://www.nature.com/srep\", \"text\": \"\"}, {\"link\": \"https://www.nature.com/search/advanced\", \"text\": \"\\n                Advanced search\\n            \"}, {\"link\": \"https://www.nature.com/subjects\", \"text\": \"Explore articles by subject\"}, {\"link\": \"https://www.nature.com/naturecareers\", \"text\": \"Find a job\"}, {\"link\": \"https://www.nature.com/authors/index.html\", \"text\": \"Guide to authors\"}, {\"link\": \"https://www.nature.com/authors/editorial_policies/\", \"text\": \"Editorial policies\"}, {\"link\": \"https://idp.nature.com/auth/personal/springernature?redirect_uri=https://www.nature.com/articles/s41598-023-31822-2\", \"text\": \"Log in\"}, {\"link\": \"https://www.nature.com/srep/research-articles\", \"text\": \"\\n                                    Research articles\\n                                \"}, {\"link\": \"https://www.nature.com/srep/news-and-comment\", \"text\": \"\\n                                    News & Comment\\n                                \"}, {\"link\": \"https://www.nature.com/srep/collections\", \"text\": \"\\n                                    Collections\\n                                \"}, {\"link\": \"https://www.nature.com/srep/browse-subjects\", \"text\": \"\\n                                    Subjects\\n                                \"}, {\"link\": \"https://www.nature.com/srep/open-access\", \"text\": \"\\n                                    Open Access Fees and Funding\\n                                \"}, {\"link\": \"https://www.nature.com/srep/about\", \"text\": \"\\n                                    About Scientific Reports\\n                                \"}, {\"link\": \"https://www.nature.com/srep/contact\", \"text\": \"\\n                                    Contact\\n                                \"}, {\"link\": \"https://www.nature.com/srep/journal-policies\", \"text\": \"\\n                                    Journal policies\\n                                \"}, {\"link\": \"https://www.nature.com/srep/calls-for-papers\", \"text\": \"\\n                                    Calls for Papers\\n                                \"}, {\"link\": \"https://www.nature.com/srep/guide-to-referees\", \"text\": \"\\n                                    Guide to referees\\n                                \"}, {\"link\": \"https://www.nature.com/srep/editorschoice\", \"text\": \"\\n                                    Editor's Choice\\n                                \"}, {\"link\": \"https://www.nature.com/srep/highlights\", \"text\": \"\\n                                    Journal highlights\\n                                \"}, {\"link\": \"https://www.nature.com/srep/author-instructions\", \"text\": \"\\n                                    For authors\\n                                \"}, {\"link\": \"https://www.nature.com/\", \"text\": \"nature\"}, {\"link\": \"https://www.nature.com/srep\", \"text\": \"scientific reports\"}, {\"link\": \"https://www.nature.com/srep/articles?type=article\", \"text\": \"articles\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2.pdf\", \"text\": \"\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2.pdf\", \"text\": \"\"}, {\"link\": \"https://www.nature.com/srep\", \"text\": \"Scientific Reports\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2/metrics\", \"text\": \"\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR4\", \"text\": \"4\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR5\", \"text\": \"5\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR6\", \"text\": \"6\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR7\", \"text\": \"7\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR8\", \"text\": \"8\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR9\", \"text\": \"9\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR10\", \"text\": \"10\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR14\", \"text\": \"14\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR15\", \"text\": \"15\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR16\", \"text\": \"16\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR17\", \"text\": \"17\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR18\", \"text\": \"18\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR19\", \"text\": \"19\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#Fig1\", \"text\": \"1\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#Fig1\", \"text\": \"1\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#Fig1\", \"text\": \"1\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2/figures/1\", \"text\": \"\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#MOESM1\", \"text\": \"S1\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2/figures/1\", \"text\": \"\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR12\", \"text\": \"12\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR12\", \"text\": \"12\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#Fig2\", \"text\": \"2\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#Fig2\", \"text\": \"2\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#Fig2\", \"text\": \"2\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#Fig2\", \"text\": \"2\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#MOESM1\", \"text\": \"S2\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#MOESM1\", \"text\": \"S3\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2/figures/2\", \"text\": \"\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2/figures/2\", \"text\": \"\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR20\", \"text\": \"20\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR21\", \"text\": \"21\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#Fig3\", \"text\": \"3\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#Fig3\", \"text\": \"3\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#Fig3\", \"text\": \"3\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#Fig3\", \"text\": \"3\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#MOESM1\", \"text\": \"S3\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#MOESM1\", \"text\": \"S4\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2/figures/3\", \"text\": \"\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2/figures/3\", \"text\": \"\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR22\", \"text\": \"22\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR23\", \"text\": \"23\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR20\", \"text\": \"20\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#Fig4\", \"text\": \"4\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2/figures/4\", \"text\": \"\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR26\", \"text\": \"26\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR27\", \"text\": \"27\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR28\", \"text\": \"28\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR22\", \"text\": \"22\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR23\", \"text\": \"23\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR25\", \"text\": \"25\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR26\", \"text\": \"26\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR29\", \"text\": \"29\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2/figures/4\", \"text\": \"\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#Fig4\", \"text\": \"4\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#Fig4\", \"text\": \"4\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#Fig4\", \"text\": \"4\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#MOESM1\", \"text\": \"S5\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#Fig5\", \"text\": \"5\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#Fig5\", \"text\": \"5\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2/figures/5\", \"text\": \"\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2/figures/5\", \"text\": \"\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#Fig5\", \"text\": \"5\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#Fig5\", \"text\": \"5\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR2\", \"text\": \"2\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR3\", \"text\": \"3\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR21\", \"text\": \"21\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#Fig5\", \"text\": \"5\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR30\", \"text\": \"30\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR31\", \"text\": \"31\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR31\", \"text\": \"31\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#MOESM1\", \"text\": \"S1\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#Fig6\", \"text\": \"6\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2/figures/6\", \"text\": \"\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2/figures/6\", \"text\": \"\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR32\", \"text\": \"32\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR33\", \"text\": \"33\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#Fig2\", \"text\": \"2\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR34\", \"text\": \"34\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR35\", \"text\": \"35\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR36\", \"text\": \"36\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#Fig3\", \"text\": \"3\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#Fig4\", \"text\": \"4\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#Fig5\", \"text\": \"5\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#Fig6\", \"text\": \"6\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR37\", \"text\": \"37\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR38\", \"text\": \"38\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#Fig5\", \"text\": \"5\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR2\", \"text\": \"2\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR39\", \"text\": \"39\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR40\", \"text\": \"40\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#Fig5\", \"text\": \"5\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#Fig5\", \"text\": \"5\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#Fig6\", \"text\": \"6\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR41\", \"text\": \"41\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR42\", \"text\": \"42\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#Fig6\", \"text\": \"6\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR43\", \"text\": \"43\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR44\", \"text\": \"44\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR45\", \"text\": \"45\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR44\", \"text\": \"44\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#Fig3\", \"text\": \"3\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#Fig3\", \"text\": \"3\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR23\", \"text\": \"23\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR46\", \"text\": \"46\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR47\", \"text\": \"47\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR50\", \"text\": \"50\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR30\", \"text\": \"30\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR19\", \"text\": \"19\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#Equ1\", \"text\": \"1\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#Equ2\", \"text\": \"2\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR50\", \"text\": \"50\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR51\", \"text\": \"51\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR51\", \"text\": \"51\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR3\", \"text\": \"3\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#ref-CR2\", \"text\": \"2\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#MOESM1\", \"text\": \"S1\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2#MOESM1\", \"text\": \"S2\"}, {\"link\": \"https://www.nature.com/articles/cas-redirect/1:CAS:528:DC%2BB3cXhvVajsb3K\", \"text\": \"CAS\"}, {\"link\": \"https://www.nature.com/articles/cas-redirect/1:CAS:528:DC%2BB3MXislygu7rJ\", \"text\": \"CAS\"}, {\"link\": \"https://www.nature.com/articles/cas-redirect/1:CAS:528:DC%2BB38XpvVymu70%3D\", \"text\": \"CAS\"}, {\"link\": \"https://www.nature.com/articles/cas-redirect/1:CAS:528:DC%2BB38XjsVensro%3D\", \"text\": \"CAS\"}, {\"link\": \"https://www.nature.com/articles/cas-redirect/1:CAS:528:DC%2BD3sXjs1ynurw%3D\", \"text\": \"CAS\"}, {\"link\": \"https://www.nature.com/articles/cas-redirect/1:CAS:528:DC%2BC1MXhvVyisbjM\", \"text\": \"CAS\"}, {\"link\": \"https://www.nature.com/articles/cas-redirect/1:CAS:528:DyaK2sXlvFKntbY%3D\", \"text\": \"CAS\"}, {\"link\": \"https://www.nature.com/articles/cas-redirect/1:CAS:528:DC%2BD1MXjvVWrsbw%3D\", \"text\": \"CAS\"}, {\"link\": \"https://www.nature.com/articles/cas-redirect/1:CAS:528:DC%2BD2MXjtFagug%3D%3D\", \"text\": \"CAS\"}, {\"link\": \"https://www.nature.com/articles/cas-redirect/1:CAS:528:DC%2BC3sXntF2kurs%3D\", \"text\": \"CAS\"}, {\"link\": \"https://www.nature.com/articles/cas-redirect/1:CAS:528:DC%2BC38XivVCmsLc%3D\", \"text\": \"CAS\"}, {\"link\": \"https://www.nature.com/articles/cas-redirect/1:CAS:528:DyaK1cXnvVemur4%3D\", \"text\": \"CAS\"}, {\"link\": \"https://www.nature.com/articles/cas-redirect/1:CAS:528:DC%2BD2MXlslGitLw%3D\", \"text\": \"CAS\"}, {\"link\": \"https://www.nature.com/articles/cas-redirect/1:CAS:528:DC%2BC38XhvV2gsbnF\", \"text\": \"CAS\"}, {\"link\": \"https://www.nature.com/articles/cas-redirect/1:CAS:528:DyaL3sXhvFGls74%3D\", \"text\": \"CAS\"}, {\"link\": \"https://www.nature.com/articles/cas-redirect/1:STN:280:DyaE1c%2FntFyjtQ%3D%3D\", \"text\": \"CAS\"}, {\"link\": \"https://www.nature.com/articles/cas-redirect/1:CAS:528:DC%2BB38XhvVGntbbE\", \"text\": \"CAS\"}, {\"link\": \"https://www.nature.com/articles/cas-redirect/1:STN:280:DC%2BD38nlsFynsA%3D%3D\", \"text\": \"CAS\"}, {\"link\": \"https://www.nature.com/articles/cas-redirect/1:CAS:528:DC%2BD2MXht1ahtrnL\", \"text\": \"CAS\"}, {\"link\": \"https://www.nature.com/articles/cas-redirect/1:CAS:528:DyaK2MXps1ahsLY%3D\", \"text\": \"CAS\"}, {\"link\": \"https://www.nature.com/articles/cas-redirect/1:CAS:528:DC%2BC3MXkvVOlsLk%3D\", \"text\": \"CAS\"}, {\"link\": \"https://www.nature.com/articles/cas-redirect/1:CAS:528:DC%2BD38XlsVyqurg%3D\", \"text\": \"CAS\"}, {\"link\": \"https://www.nature.com/search?author=Michael%20K.%20Saad\", \"text\": \"View author publications\"}, {\"link\": \"https://www.nature.com/search?author=John%20S.%20K.%20Yuen\", \"text\": \"View author publications\"}, {\"link\": \"https://www.nature.com/search?author=Connor%20M.%20Joyce\", \"text\": \"View author publications\"}, {\"link\": \"https://www.nature.com/search?author=Xinxin%20Li\", \"text\": \"View author publications\"}, {\"link\": \"https://www.nature.com/search?author=Taehwan%20Lim\", \"text\": \"View author publications\"}, {\"link\": \"https://www.nature.com/search?author=Talia%20L.%20Wolfson\", \"text\": \"View author publications\"}, {\"link\": \"https://www.nature.com/search?author=Justin%20Wu\", \"text\": \"View author publications\"}, {\"link\": \"https://www.nature.com/search?author=Jason%20Laird\", \"text\": \"View author publications\"}, {\"link\": \"https://www.nature.com/search?author=Sanjana%20Vissapragada\", \"text\": \"View author publications\"}, {\"link\": \"https://www.nature.com/search?author=Olivia%20P.%20Calkins\", \"text\": \"View author publications\"}, {\"link\": \"https://www.nature.com/search?author=Adham%20Ali\", \"text\": \"View author publications\"}, {\"link\": \"https://www.nature.com/search?author=David%20L.%20Kaplan\", \"text\": \"View author publications\"}, {\"link\": \"https://www.nature.com/subjects/biological-techniques\", \"text\": \"Biological techniques\"}, {\"link\": \"https://www.nature.com/subjects/biotechnology\", \"text\": \"Biotechnology\"}, {\"link\": \"https://www.nature.com/subjects/cell-biology\", \"text\": \"Cell biology\"}, {\"link\": \"https://www.nature.com/info/tandc.html\", \"text\": \"Terms\"}, {\"link\": \"https://www.nature.com/info/community-guidelines.html\", \"text\": \"Community Guidelines\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2.pdf\", \"text\": \"\"}, {\"link\": \"https://pubads.g.doubleclick.net/gampad/jump?iu=/285/scientific_reports/article&sz=300x250&c=-1065145902&t=pos%3Dright%26type%3Darticle%26artid%3Ds41598-023-31822-2%26doi%3D10.1038/s41598-023-31822-2%26subjmeta%3D1647,61,631,80%26kwrd%3DBiological+techniques,Biotechnology,Cell+biology\", \"text\": \"\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2/figures/1\", \"text\": \"\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2/figures/2\", \"text\": \"\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2/figures/3\", \"text\": \"\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2/figures/4\", \"text\": \"\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2/figures/5\", \"text\": \"\"}, {\"link\": \"https://www.nature.com/articles/s41598-023-31822-2/figures/6\", \"text\": \"\"}, {\"link\": \"https://www.nature.com/briefing/translational-research/?brieferEntryPoint=TransResBriefingBanner\", \"text\": \"Sign up for Nature Briefing: Translational Research\\n            \"}]"
}