{
    "summary": "  \n\n|  |  \n  |  \n---|---  \n  \n\n## Servicios Personalizados\n\n## Revista\n\n  * SciELO Analytics\n  * Google Scholar H5M5 (2021)\n\n## Articulo\n\n  * Inglés (pdf) \n  * Articulo en XML\n  * Como citar este artículo\n  * SciELO Analytics\n  * Traducción automática\n\n## Indicadores\n\n  * Citado por SciELO \n  * Accesos\n\n## Links relacionados\n\n  * Citado por Google \n  * Similares en SciELO \n  * Similares en Google \n\n## Compartir\n\n  * Otros\n\n  * Otros\n\n* * *\n\n  * Permalink\n\n## Biological Research\n\n##  _versión  impresa_ ISSN 0716-9760\n\n### Biol. Res. v.43 n.4 Santiago  2010\n\n####  http://dx.doi.org/10.4067/S0716-97602010000400002\n\n_Biol Res 43:_ 385-392, 2010\n\n**ARTICLES**\n\n\n\n**Development and characterization of two new cell lines from common carp,\n_Cyprinus carpio_ (Linn)**\n\n\n\n**Wazir S Lakra*, M Goswami, T Rajaswaminathan, Gaurav Rathore**\n\nMolecular Biology and Biotechnology Division - National Bureau of Fish Genetic\nResources - Canal Ring Road, Dilkusha, Lucknow, 226002, India\n\n* * *\n\n**ABSTRACT**\n\nTwo new cell lines (CCF and CCH) were established from fin and heart tissues\nof common carp, _Cyprinus carpio._ The cells were optimally maintained in\nLeibovitz-15 medium supplemented with 10% fetal bovine serum (FBS) and 10\nng/ml of basic fibroblastic growth factor (bFGF). The effects of temperature,\nconcentration of FBS and bFGF on the growth of CCF and CCH cells were\nexamined. The temperature ranged from 24 to 32 °C for good growth of the\ncells. The growth rate of cells was higher in medium containing 10% FBS and\nthe addition of bFGF to the medium significantly increased the growth rate.\nThe CCF cells were found to be epithelial, while the CCH cells were\nfibroblastic in nature. The cytogenetic analysis of the cell lines revealed a\ndiploid number of 100 chromosomes in C. _carpio._ The viability of CCF and CCH\ncell lines were 70 and 72%, respectively, after six months of storage in\nliquid nitrogen (-196 ° C). Molecular characterization of the cell lines using\n16S rRNA and Cytochrome Oxidase Subunit I (COI) revealed the origin of the\ncell lines. These new cell lines will be useful for isolation of fish viruses\nand other _in vitro_ biotechnological studies.\n\n**Key terms:** _Cyprinus carpio,_ cell line, mtDNA.\n\n* * *\n\n**INTRODUCTION**\n\n_Cyprinus carpio,_ commonly called common carp, is a widely distributed\nfreshwater fish and a natural inhabitant of riverine systems of Asia and\nEastern Europe. The species entered the carp polyculture system in India in\nthe late 1950s and thereafter the species has become an integral part of the\ncomposite fish culture system in the country. The adoption of intensive\nfarming practices, unregulated use of inputs and inbreeding in hatcheries, has\nled to increased disease incidence in tropical carp. There have been several\nincidences of mass mortality of carp in culture systems, which are suspected\nto be caused by microbial diseases, particularly of viral aetiology (Mohán and\nShankar, 1994). Henee, development of a cell line from tropical fish species\nfor identifying pathogenesis of viral diseases and for vaccine production\nagainst viral and bacterial diseases is necessary.\n\nMost cell lines in the past have been developed from températe fish (Fryer and\nLannon, 1994), except primary cultures from the kidney of the stinging catfish\n_Heteropneustes fossilis_ (Singh et al., 1995), caudal fin of _L. rohita_\n(Lakra and Bhonde, 1996), heart tissues of Indian major carp (Rao et al.,\n1997), caudal fin of _Tor putitora_ (Prassana et al., 2000), ovary of _Ciarias\ngariepinus_ (Kumar et al., 2001), gill of C. _gariepinus_ (Rathore et al.,\n2001) and liver and kidney of _L. rohita_ (Lakra et al., 2005). The\ndevelopment of new cell lines from _Tor putitora_ (Lakra et al., 2006a),\n_Lates calcarifer_ (Lakra et al., 2006b; Parameswaran et al., 2006 and 2007),\n_Epinephelus coioides_ and _Chanos chanos_ (Parameswaran et al., 2007) in\nrecent years have opened new vistas for fish tissue culture research on\ntropical aquatic species.\n\nAlthough viral infections in fish in India are likely to exist, no virus has\nbeen isolated and characterized so far (Lakra et al., 2006). The carp\nleucocyte cell line (CLC; Weyts et al., 1997) and epithelioma papulosum\ncyprini cell lines (EPC; Fijan et al., 1983) have been developed from the\ncommon carp. Development of cell lines from various tissues of common carp is\ndesirable for developing cell models for _in vitro_ study of their cellular\nphysiology, molecular biology, genetics, immunology, endocrinology, nutrition,\ncomparative biology and biotechnology (Ye et al., 2006).\n\nThe present study reports two new cell lines (CCF and CCH) from fin and heart\ntissues of C. _carpio_ and their evaluation for optimal growth conditions and\nmolecular and cytogenetic characterization.\n\n**METHODS**\n\n_Primary cell culture_\n\nHealthy juveniles of C. _carpio_ (body weight: 50-60 gm and body length: 20-25\ncm) were obtained from commercial hatcheries in Uttar Pradesh and maintained\nin the wet lab of the institute. All fish specimens were euthanized by keeping\nthem on ice for more than 15 min and surface sterilized by dipping in an\niodophore (Betadine, Pharmabutor, India) for 5 min. Primary cell cultures were\ninitiated by aseptically collecting fin, heart and swim bladder tissues. The\ntissues were transferred to phosphate buffered saline (PBS) (Invitrogen),\ncontaining antibiotic and antimyeotic solution (1000 U penicillin, 1000 µg\nstreptomyein and 25 µg amphotericin B per mi) (Invitrogen). The tissue samples\nwere then minced with sterile dissecting blades and scissors at room\ntemperature and washed four times with PBS containing antibiotic and\nantimyeotic solution. Approximately 25 tissue fragments (1 to 2 mm3) were\nindividually explanted into 25 cm2 tissue culture flasks (Nunc, Denmark) in 50\nµl of fetal bovine serum (FBS) (Invitrogen). After allowing the tissue to\nattach for 8 h at room temperature, 5 mi of Leibovitz-15 medium (L-15)\ncontaining 20% FBS and 10 ng/ml basic fibroblastic growth factor (bFGF) was\nadded to each flask. The flasks were incubated at 28°C and the medium was\nreplaced every five days. The flasks were observed daily for attachment,\nspreading, proliferation and morphological details using an inverted\nmicroscope (Olympus Optical Co., Ltd) equipped with phase optics.\n\n_Subculture_\n\nAfter reaching 95 % confluency, the cells were trypsinized using 0.25% trypsin\nsolution and 0.2% ethylenediaminetetraacetic acid (EDTA) in PBS. The\nsubcultured cells were grown in fresh L-15 with 15% FBS. In the initial 10\nsubcultures, 50% of the culture medium was replaced with the fresh medium. The\nconcentration of FBS in the L-15 medium was reduced to 10% for further\nsubculturing.\n\n_Growth studies_\n\nGrowth characteristics of the cell lines were assessed at selected\ntemperatures, FBS and bFGF concentrations in L-15 media. The growth rates were\nassessed at 5 incubation temperatures (18, 20, 24, 28 and 32 °C) for 7 days. A\nseeding concentration of 2 x 105 cells/ml at 45 passage was used in 25 cm2\ntissue culture flasks. On altérnate days, 3 flasks from different temperatures\nat which they were incubated were withdrawn, trypsinized and cells were\ncounted (4 counts per flask) using a hemocytometer. Analogous procedures were\nperformed for the effects of various concentrations of FBS (5, 10, 15 and 20%)\nand bFGF (0, 5 and 10 ng/ml) on cell growth at 28 °C for 7 days.\n\n_Cryopreservation_\n\nThe ability of cells to survive in liquid nitrogen (LN2) at -196 0 C and their\nstability were assessed in three replicates in freezing medium using\npreviously described methods (Freshney, 1994). Cells growing logarithmically\nfor CCF and CCH at 47 and 48 passages, respectively, were harvested by\ncentrifugation and washed with PBS and then suspended in recovery medium\n(Invitrogen) at 1 X 106 cells per mi. Aliquots (1.0 mi) were dispensed into\n2.0 mi sterile cryovials (10 numbers) (Nunc) held at 4 °C for 2 h, -20 °C for\n1 h, at -70 °C overnight and then transferred into LN2. The frozen cells were\nrecovered after 6 months of post-storage by thawing at 37 °C in a water bath.\nFollowing removal of the freezing medium by centrifugation, cells were\nsuspended in L-15 with 10% FBS. The viability of the cells was measured by\ntrypan blue staining and the number of cells was counted using a\nhaemocytometer. The viable cells were seeded into 25 cm2 tissue culture flasks\nfor further subculturing.\n\n_Karyotyping_\n\nChromosomal counts were established at passage 47 and 48 for fin and heart\ncells, respectively. Cells were seeded in duplicate 75 cm2 tissue culture\nflasks in L-15 medium with 10% FBS. After 24 h incubation, spent medium was\nreplaced with 10 mi of fresh medium containing 0.1 mi colcemid solution (1\n_[ig_ ml/1), (Sigma, St Louis, MO, USA) into the 1-day-old cell culture for 2\nh at 28 °C. After harvesting by centrifugation (70 g, 5 min), the cells were\nsuspended in a hypotonic solution consisting of 0.5% KC1 for 10 min and fixed\nin methanol: acetic acid (3:1). The slides were prepared following the\nconventional drop-splash technique (Freshney, 1994). The chromosomes were\ncounted under a microscope (Leica, Germany), after staining with 5% Giemsa for\n10 min.\n\n_Molecular characterization (16S rRNA and COI mtDNA genes_ )\n\n_DNA Isolation_\n\nDNA extractions from CCF and CCH cells at passage 47 and 48 respectively, were\ncompleted following Ruzzante et al. (1996) with minor modifications. Briefly,\nsamples were homogenized separately in incubation buffer (10 mM Tris-HC1 and\n10 mM ethylenediaminetetraacetic acid (EDTA), pH8.0), centrifuged at 10000 rpm\nat 4 °C after which the supernatants were digested with lysis buffer (lOmM\nTris-HC1, 10 mM ethylenediaminetetraacetic acid (EDTA), pH8.0, 0.5% SDS and 50\nug/ml Proteinase K). After incubation at 37 °C for overnight, the digests were\ndeproteinized by successive phenol / chloroform and iso-amyl alcohol\nextraction and DNA was recovered by ethanol precipitation, drying and\nresuspension in TE buffer. The concentration of isolated DNA was estimated at\nwavelength of 260 nm using a UV spectrophotometer. The DNA was diluted to get\na final concentration of 100 ng µl-1 .\n\n_Amplification and Sequencing_\n\nThe 551 bp fragment of mitochondrial 16S rRNA gene was amplified in a 50 µl\nreaction volume with 50 µl of 10X Taq polymerase buffer, 0.2 mM of each dNTP,\n0.4 uM of each primer, 2.5 U of Taq polymerase and 5µl genomic DNA using the\nthermal cycler PTC 200 (MJ Research). The primers used for the amplification\nof the partial 16S rRNA gene were **16SAR (5'-CGCCTGTTTATCAAAAACAT-3')** and\n**16SBR (5'CCGGTCTGAACTCAGATCACGT** -3') (Palumbi et al. 1991). The thermal\nprofile used was 36 repetitions of a three-step cycle consisting of\ndenaturation at 94 °C for 1 minute, annealing at 55 °C for 1 minute and\nextension at 72 °C for 1.5 minutes, including 4 minutes for initial\ndenaturation at 94 °C and 7 minutes for the final extension at 72 °C\n\nThe 655 bp fragments of cytochrome oxidase subunit I (COI) were also amplified\nin a final concentration of 50 µl volume with a final concentration of 5 ul of\n10X Taq polymerase buffer, 2µl of MgCl2 (50 mM), 0.25µl of each dNTP (0.05\nmM), 0.5µl of each primer (0.01 mM), 0.6 U of Taq polymerase and 5µl of\ngenomic DNA. The primers used for the amplification of the COI gene were\n**FISHF15'TCAACCAACCACAAAGACATTGGCAC3' and\nFISHR1-5'TAGACTTCTGGGTGGCCAAAGAATCA3'** (Ward et al, 2005). The thermal regime\nconsisted of an initial step of 2 minutes at 95 °C followed by 35 cycles of 40\nseconds at 94 °C, 40 seconds at 54 °C and 1 minute 10 seconds at 72 °C\nfollowed by final extension of 10 minutes at 72 °C\n\nThe PCR products were visualized on 1.2 % agarose gels and the most intense\nproducts were selected for sequencing. Products were labeled using the BigDye\nTerminator V.3.1 Cycle sequencing Kit (Applied Biosystems, Inc) and sequenced\nbidirectionally using an ABI 3730 capillary sequencer following manufacturer's\ninstructions. The obtained sequences of PCR fragments were compared to the\nknown sequences of the species.\n\n_Statistical Analysis_\n\nData were expressed as mean ± S.E. A value of P < 0.05 was considered as\nstatistically significant. The statistical analysis was computed using SPSS\nsoftware.\n\n**RESULTS**\n\nThe radiation of cells from the explants started after 2 to 3 days in 25 cm2\ntissue culture flasks for CCF and CCH and a monolayer of cells was formed\napproximately 3 weeks after the implantation. The morphology of common carp\nfin cells (CCF) was fibroblastic and epithelial during their initial growth,\nwhich changed to epithelial-like cells gradually (Fig. 1). In contrast, the\ncommon carp heart (CCH) cells were basically fibroblastic and myoctyes in the\nprimary culture. However, the cells became uniformly fibroblastic in later\npassages. The CCF cells were subcultured successfully 49 times, whereas CCH\ncells were subcultured 51 times. The cells were subcultured on 9-day intervals\nin L-15 medium with 20% FBS for the first 10 subcultures, at 5-day intervals\nin L-15 with 10% FBS during the subsequent passages.\n\n  \n  \n  \n---  \n**Fig. 1** : Phase contrast microscope of common carp cells derived from (A,\nB, C) fin and (D, E, F) heart (200X).  \nA & D) Explant showing radiation of cells after 3 days from fin and heart,\nrespectively.  \nB & E) subcultured cells of fin and heart, respectively, at 10th passage  \nC & F) subcultured cells of fin and heart, respectively, at 30th passage  \n  \nThe CCF and CCH cells exhibited different growth pattern at different\ntemperatures (Fig. 2 A). The growth of cells increased as the culture\ntemperature increased, when the temperature was between 20 and 28 °C. Although\ncells grew well at 28 °C, the growth rate of cells cultured at 32 °C began to\ndecrease. The growth rate was less markedly at 18 °C\n\n  \n  \n  \n---  \n**Fig. 2:** /n _vitro_ growth curves of CCF and CCH cells of _Cyprinus carpio_\nat (A) Temperatures (18, 20, 24, 28 and 32°C, (B) selected concentration of\nFBS (5, 10, 15 and 20% and (C) bFGF (0, 5 and 10 ng/ml). Values were\nsignificantly different (p<0.05). Values are means ± S.E. (n=3).  \n  \nThe effect of FBS and bFGF concentration on the proliferation of cells is\nshown in Fig. 2 B and Fig. 2 C. The growth rate of cells in medium containing\n20 % FBS was higher than that of cells in medium containing 5 -15 % FBS.\n\nThe addition of 10 ng/ml bFGF stimulated the proliferation of cells. The\nabsence of bFGF significantly decreased the proliferation of cells.\n\nEvaluation of the viability of CCF and CCH cells stored in liquid nitrogen\n(-196 °C) established the capability of the cells to survive following 6 month\nof storage. More than 70 and 72% of CCF and CCH cells from each vial remained\nviable after the storage period and retained the ability to attach and grow at\n28°C. Following storage, no obvious alterations in morphology or growth\npattern were observed for cells.\n\nThe CCF and CCH cell lines had similar chromosome morphology. The results of\nchromosome counts of 82 metaphase plates revealed that the diploid number of\nchromosomes in CCF and CCH cells ranged from 46 to 121 and 47 to 126,\nrespectively (Fig. 3 A & B). Both heteroploidy and aneuploidy were observed in\nthe two cell lines, although they were small in proportion. Nevertheless, the\nmodal diploid number of chromosomes for all the cell lines was found to be\n100.\n\n  \n  \n  \n---  \n**Fig. 3:** A chromosome spread of C _carpio_ from cell lines (A) CCF and (B)\nCCH  \n  \n\n\nAn analysis of mitochondrial 16S rRNA and COI genes was performed to verify\nthe origin of the two cell lines. Amplification from the 16S rRNA and COI\ngenes for all cell lines revealed the expected PCR products of 551 bp and 655\nbp, respectively (Fig. 4). Subsequent comparative analysis of the identified\nsequences demonstrated a _99%_ to 100 % match for 16S rRNA and COI region of\nthe known mitochondrial DNA sequences from C. _carpio._ GenBank Accession No.\nfor 16S rRNA and COI of CCF and CCH cell lines were **FJ183814-FJ183815** and\n**FJ183806 - FJ183807** respectively. Our data demonstrated that CCF and CCH\ncell lines are indeed truly derived from C. _carpio._\n\n  \n\n|   | **Fig. 4:** PCR amplification of 655 bp and 551 bp fragment of the\ncommon carp genome using oligonucleotide primers from the conserved portions\nof COI and 16S rRNA region. Lane.l. Generuler express DNA ladder (Fermentas);\nLane.2. COI negative control; Lane.3. Positive control COI; Lane 4. CCH COI;\nLane 5. CCF COI; Lane 6. 16S rRNA negative control; Lane 7. 1 6S rRNA positive\ncontrol; Lane 8. CCH 1 6S rRNA; Lane.9. CCF 1 6S rRNA; Lane.10. Generuler\nexpress DNA ladder (Fermentas). (Negative Control: Without témplate; Positive\nControl: Muscle tissue of _C. carpio)._  \n---|---|---  \n  \n**DISCUSSION**\n\nFish cell cultures are good models for _in vitro_ studies of the propagation\nof pathogenic fish viruses. They also play important role in toxicological and\nfunctional genomics studies in fish. However, presently very few fish cell\nlines are available for research in tropical species. In the present research,\n_in vitro_ cell culture systems from fin and heart of common carp, namely CCF\nand CCH cell lines, were established by the explant technique. The tissue of\nchoice and optimum physico-chemical environment-like culture medium, FBS\nconcentration, growth supplements, incubation temperature, etc. varies\nconsiderably across fish species. Joseph et al. (1998) observed good\nattachment and growth with caudal peduncle of _Cirrhinus mrigala_ and heart\ntissues of C. _mrigala_ and _Catla catla._ In primary culture of CCF,\nfibroblastic cells and epithelial cells coexisted. However, in subsequent\nsubcultures, the epithelial like cells proliferated more rapidly than the\nfibroblastic cells and ultimately predominated. The pattern in CCH cells was\nfibroblastic and myoctyic, but fibroblastic cells were dominant after\nsubsequent passage. Most of the primary cultures reported from fish in India\nwere comprised of fibroblastic cells (Singh et al., 1995; Lakra & Bhondel996).\nA predominance of fibroblastic cells over epithelioid cells in cell cultures\nfrom fish has been reported by several workers in the past (Bejar et al, 1997;\nChi et al., 1999).\n\nBoth CCF and CCH cells exhibited maximum growth rate at 28 °C, but were\ngrowing over a wide temperature range (20-32 °C). This property increases the\nspectrum of viruses that the cells can be used to isolate. The highest growth\nrate of various tropical fish cell lines was observed at 32 °C (Lai et al.\n2003), 28 °C (Sathe et al, 1995) and 20-25 °C (Tong et al., 1997). A\ntemperature of 35-37°C has been reported to be lethal to many fish cells (Tong\net al., 1997).\n\nThe FBS is essential for survival and optimal growth of cells. In primary cell\ncultures, FBS at high concentrations (20%) is favourable for cell growth and\nattachment. After subculture, the replication rate of CCF and CCH cells\nincreased as the FBS concentration increased from 5 to 20%. These observations\nare similar to those previously reported on the establishment of cell lines\nfrom other marine fish (Kang et al., 2003; Lai et al., 2003). However,\nconcentration of FBS at 10 % provided relatively good growth and this is an\nadvantage to maintain the cell line at low cost.\n\nMost cells do not survive or exhibit optimal phenotypic properties for any\nlength of time when cultured in basal medium alone. The medium needs to be\nsupplemented with additional growth and survival factors, such as hormones,\ntransport proteins, trace elements or ECM (Extra Cellular Matrix) factors (Ham\nand McKeehan, 1979). The growth factors like bFGF, a potent mitogenic agent\nfor human melanocytes has been used in previous studies (Halaban et al.,\n1998). The bFGF is a potent mitogen for embryonic stem cells derived from\nmedaka _Oryzias latipes_ (Hong and Schartl, 1996) and sea perch (Chen et al.,\n2003). Our results demónstrate that bFGF stimulates proliferation of CCF and\nCCH cells and can be used as growth factor in other cell cultures also.\n\nThe euploid cell condition is an important parameter for characterizing a cell\nline. The results of chromosome counts of 82 metaphase plates from cell line\nat passage 47 and 48 revealed that the chromosome numbers of CCF and CCH\nvaried from 46 to 121 and 47 to 126, respectively. Nevertheless, the modal\nnumber of chromosomes was 100. Karyotype analysis revealed that over 48% and\n46% of the CCF and CCH cells possessed a diploid chromosome number of 2n =100,\nrespectively, which is identical to the modal chromosome number of common carp\nreported earlier (Ohno et al., 1967). This diploid rate is similar to or\nhigher than other reports in other fish cell lines (Sun et al., 1995, Hong et\nal, 1996, Chen et al, 2003).\n\nTo confirm that the cell lines originated from common carp, amplifications of\n551 bp and 655 bp fragments of 16S rRNA and COI gene sequences for all cell\nlines were performed. The sequence analysis of both 16S rRNA and COI fragments\nshowed _99%_ to 100% similarity with respective gene fragment of C. _carpio._\nThe results indicated that the two cell lines were of C. _carpio._ Species\nidentification of cell lines is crucial for scientific research accuracy and\nreproducibility. Hebert et al. (2003) have demonstrated the utility of the COI\ngene as a universal barcode, referred to as \"DNA barcodes\" for the genetic\nidentification of animal life. Recently, Cooper et al. (2007) used the COI\nregion for identification of sixty-seven cell lines used for barcode analysis.\nOur analysis also proves the utility of the COI gene for identification of the\nnewly established cell lines from C. _carpio._\n\nCryopreservation of cell lines is necessary for long-term storage. The\nfeasibility of cryopreservation of these two cell lines was demonstrated, with\nappreciable recovery after thawing of up to 72%. It was 50% for SAF-1 (gilt-\nhead sea bream) (Bejar et al., 1997), 73% for GF-1 (grouper) (Chi et al.,\n1999) and 80-85% for SF (Asian sea bass) (Chang et al, 2001).\n\nSome pathogenic viruses are known to be organ- and tissue-specific, which\nmakes the establishment of additional cell lines from different organs and\ntissues of a host species essential for proper monitoring of viral diseases.\nTherefore, the established common carp cell lines, CCF and CCH from fin and\nheart, respectively, would provide an enhanced capability for viral detection\nand identification in the aquatic animal species in India. These newly\nestablished and characterized cell lines from C. _carpio_ will be disseminated\n/ distributed to researchers all over the world on request for further\nresearch in fish biotechnology.\n\nACKNOWLEDGMENTS\n\nThe authors are thankful to Dr S. Ayyappan, Director General, ICAR for his\nencouragement and the use of facilities.\n\n\n\n**REFERENCES**\n\nBEJAR J, BORREGO JJ, ALVAREZ MC (1997) A continuous cell line from the\ncultured marine fish gilt-head sea bream _Sparus aurata_ (L.). Aquaculture\n150:143-153.\n\nCHANG' SF, NGOH GH, KUEH LFS, QIN QW, CHEN CL, LAM TJ, SIN YM (2001)\nDevelopment of a tropical marine fish cell line from Asian seabass ( _Lates\ncalcarifer_ ) for virus isolation. Aquaculture 192 (2-4):133-145.\n\nCHEN SL, SHA ZX, YE HQ (2003) Establishment of a pluripotent embryonic cell\nline from sea perch ( _Lateolabrax japonicus)._ Aquaculture 218:141-151.\n\nCHI SC, LO BJ, LIN SC (2001) Characterization of grouper nervous necrosis\nvirus (GNNV). J. Fish Diseases 24 (1): 3-13.\n\nCOOPER, JK. SYKES G, KING S (2007) Species identification in cell culture: a\ntwo-pronged molecular approach. In Vitro Cell Dev. Biol -Animal 43: 344-351.\n\nFIJAN N, SULIMANOVIC D, BEARZOTTI M M, MUZINIC D, ZWILLENBERG L O, CHILMONCZYK\nS, VAUTHEROT JF, DE KINKELIN P (1983) Some properties of the epithelioma\npapulosum cyprini (EPC) cell line from carp _Cyprinus carpio._ Annales de\nd'Institut Pasteur. Virology 137: 207-220.\n\nFRESHNEY RI (1994) Culture of Animal Cells: A Manual of Basic Technique. New\nYork:Wiley- Liss. pp: 387-389.\n\nFRYER JL, LANNON CN (1994) Three decades of fish cell culture: A current\nlisting of cell lines derived from fishes. J. Tissue Cult. Methods 16: 87-94.\n\nGRIMMETT SG, WARG JV, GETCHELL RG, JOHNSON DJ, BOWSER PR (2006) An unusual Koi\nHerpesvirus associated with a mortality event of common carp _Cyprinus carpio_\nin New York State, USA. J. Wild Life Diseases 42(3): 658-662.\n\nHALABAN R, LANGDON R, BIRCHALL N, CUONO C, BAIRD A, SCOTT G, MOELLMAN G,\nMCGUIRE J (1988) Basic fibroblast growth factor from human keratinocytes is a\nnatural mitogen for melanocytes. J Cell Biol 107:1611-1619.\n\nHAM RG, MCKEEHAN WL (1979) Media and growth requirements. Methods in\nEnzymology _58:_ 44-93.\n\nHEBERT PD N, CYWINSKA A, BALL SL, WAARD JRD (2003) Biological identifications\nthrough DNA barcodes. Proc. R. Soc, London B 270: 313-321.\n\nHETRICK F.M, HEDRICK RP (1993) New Viruses described in finfish from\n1988-1992. Annu Rev Fish Dis 3:187-207.\n\nHONG Y, WINKLER C, SCHARTL M (1996) Pluripotency and differentiation of\nembryonic stem cell lines from the medakafish ( _Oryzias latipes)._ Mech Dev\n60:33-44.\n\nJENEY Z, JENEY G (1995) Recent achievements in studíes on diseases of common\ncarp ( _Cyprinus carpio_ L.). Aquaculture 129: 397-420.\n\nJOSEPH, MA, SUSHMITHA RK, MOHAN CV, SHANKAR KM (1998) Evaluation of tissues of\nIndian major carps for development of cell lines by explant method. Curr. Sci\n75:1403- 1406.\n\nLAI YS, JOHN JAC, LIN CH, GUO IC, CHEN SC, FANG K, LIN CH, CHANG CY (2003)\nEstablishment of cell lines from a tropical grouper, _Epinephelus awora_ and\ntheir susceptibility to grouper irido -and nodaviruses. J. Fish Diseases\n26:31-42.\n\nLAKRA WS, BHONDE RR (1996) Development of primary cell culture from the caudal\nfin of an Indian major carp, _Labeo rohita_ (Ham.). Asian Fisheries Science\n9:149-152.\n\nLAKRA W S, BHOINDE RR, SIVAKUMAR N, AYYAPPAN S (2006) A new fibroblast like\ncell line from the fry of golden masher _Tor puttitora_ (Ham). Aquaculture.\n253: 238-243.\n\nLAKRA WS, SIVAKUMAR N, GOSWAMI M, BHONDE R (2006) Development of two cell\nculture systems from Asian seabass _Lates calcarifer_ (Bloch). Aqua Research\n37:18-24.\n\nLAKRA WS, BEHERA MR, SIVAKUMAR N, GOSWAMI M, BHONDE RR (2005) Development of\ncell culture from liver and kidney of Indian Major Carp _Labeo rohita._ Indian\nJ. Fisheries 52(3):373-376.\n\nMOHAN CV, SHANKAR KM (1994) Role of fungus in epizootic ulcerative syndrome of\nfresh and brackishwater fishes of Karnataka, India. Curr Sci _66:656-658._\n\nKUMAR GS, SINGH IBS, PHILIP R (2001) Development of a cell culture system\nfromthe ovarian tissue of African cat-fish ( _Ciarias gariepinus_ ).\nAquaculture. 194: 51-62.\n\nOHNO S, MURAMOTO J, CHRISTIAN L, ATKIN B (1967) Diploid-tetraploid\nrelationship among Oíd World members of the fish family Cyprinidae. Chromosoma\n(Berl.) 23:1-9.\n\nOIE (2006) Diagnostic Manual for Aquatic Animal Diseases, 3rd ed. Office\nInternational des Epizooties, World Organisation for Animal Health, Paris,\npp:237, http://www.oie.int/eng/normes/fmanual/a_summry.htm.\n\nPALUMBI S, MARTÍN A, ROMANO S, MCMILLAN WO, STICE L, GRABOWSKI G (1991) The\nsimple fool's guide to PCR. Version 2.0. Honolulú, HL 96822: Department of\nZoology and Kewalo Marine Laboratory, University of Hawaii.\n\nPARAMESWARAN V, SHUKLA R, BHONDE RR, HAMEED ASS (2006) Splenic cell line from\nsea bass, _Lates calcerifer:_ Establishment and characterization. Aquaculture\n261:43-53.\n\nPARAMESWARAN V, AHMED VPI, SHUKLA R, BHONDE RR, HAMEED ASS (2007) PRASANNA I,\nLAKRA WS, OGALE SN, BHONDE RR (2000) Development and characterization of two\nnew cell lines from milkfish ( _Chanos chanos_ ) and grouper ( _Epinephelus\ncoloides_ ) for virus isolation Mar. Biotechnol. 9:281-291\n\nRAO KS, JOSEPH M.A, SHANKER K.M, MOHAN CV (1997) Primary cell culture from\nexplants of heart tissue of Indian Major carps. Curr. Sci. 73: 374-375.\n\nRATHORE G, SOOD N, SWAMINATHAN TR (2001) Primary Cell Culture from _Ciarias\ngarenpinus_ fish gills and kidney using fish serum. Indian J. Exp. Biol. 39:\n936-938.\n\nRUZZANTE DE, TAGGART CT, COOK C, GODDARD S (1996) Genetic differentiation\nbetween inshore and offshore Atlantic cod ( _Gadus morhua_ ) off New found\nland: microsatellite DNA variation and antifreeze level. Can J Fish Aquat Sci\n53: 634-645.\n\nSATHE PS, MAURYA DT, BASU A, GOGATE SS, BANERJEE K (1995) Establishment and\ncharacterization of a new fish cell line, MG-3, from the gills of Mrigal\n_Cirrhinus mrigala._ Indian J Exp Biol 33:589-594.\n\nSINGH I.S.B., ROSAMMA P., RAVEENDRANATHM. & SHANMUGAM J. (1995) Development of\nprimary cell cultures from kidney of freshwater fish _Heteropneustes\nfossilis._ Indian J Exp Biol 33:595-599.\n\nSUN L, BRADFORD CS, GHOSH C, COLLODI P, BARNES DW (1995) ES-like cell cultures\nderived from early zebrafish embryos. Mol Mar Biol Biotechnol 4:193-199.\n\nTONG SL, LI H, MIAO HZ (1997) The establishment and partial characterization\nof a continuous fish cell line FG- 9307 from the gill of flounder.\n_Paralichthys olivaceus._ Aquaculture 156:327-333.\n\nWAKAMATSU, Y, OIKAWA A, OBIKA M, HIROBE T, OZATO K (1984) Fish hereditary\nmelanoma cell lines _of_ different degrees _of_ cell differentiation.\nDevelopment Growth and Differentiation 25: 503-513.\n\nWARD RD, ZEMLAK TS, INNES BH, LAST PR, HEBERT PDN (2005) DNA barcoding\nAustralia's fish species. Proc. R. Soc, London B 360: 1847-1857.\n\nWEYTS FAA, ROMBOUT JHWM, FLIK G, VERBURG-VANKEMENADE BM L (1997) A common carp\nleucocyte cell line ( _Cyprinus carpioL._ ) shares morphological and\nfunctional characteristícs with macrophages. Fish & Shellfish Immunology\n7(2):123-133.\n\nYE, HQ, CHEN S L, SHA Z X, XU, MY (2006) Development and characterization _of_\ncell lines from heart, liver, spleen and head kidney _of_ sea perch\n_Lateolabrax japonicus._ J. Fish Biol. 69 (Supplement A): 115-126.\n\n\n\nReceived: June 16, 2009. In revised form: February 9, 2010. Accepted: June 2,\n2010.\n\n* Corresponding Author: Wazir S Lakra. Director, National Bureau of Fish Genetic Resources, Canal Ring Road, Dilkusha, Lucknow, 226002, India E-mail:wslakra@gmail.com Phone: +91-522-2442441. Fax: +91-522-2442403\n\n Todo el contenido de esta revista, excepto dónde está identificado, está bajo\nuna Licencia Creative Commons\n\nCanadá 253, piso 3º, Dpto. F.  \n  \nPO Box 16164  \n  \nSantiago - Chile  \n  \nTel.: (56-2) 22093503  \n  \nFax: (56-2) 22258427  \n  \n  \nsocbiol@biologiachile.cl\n\n",
    "links": "[{\"link\": \"http://www.scielo.cl/pdf/bres/v43n4/art02.pdf\", \"text\": \"\"}]"
}