{
    "summary": "  * Sign In\n  * +1 (650) 898-0226 +44 20 3608 4435\n  * CONTACT US\n\n  * Products\n\nDevices\n\n    * Joan 6 RE\n    * Joan 6 Pro\n    * Joan 13\n    * Accessories\n\nSolutions\n\n    * Room booking\n\nMake it easy to find, reserve, and manage the space you need in your\ncollaborative workplace.\n\n    * Desk and asset booking\n\nBook your favourite desk, reserve a parking space, or any other company asset\nyou need to excel at work.\n\n    * Visitor management\n\nAutomate your visitor registration process and create an amazing first\nimpression.\n\n    * Digital signage\n\nEnhance your workplace experience by displaying corporate or wayfinding\ninformation on large displays.\n\n  * Use cases\n\nRelated\n\n    * Your flexible hybrid workplace\n\nLearn about workplace solutions and tools that bring value to your company\nfrom day one.\n\n    * Corporate communications\n\nSeven ways to use Joan as a digital signage solution to enhance the workplace\nexperience.\n\n    * Frictionless equipment sharing\n\nRead how to enable easy, efficient, and transparent equipment reservations for\neveryone.\n\n    * A pleasant coworking space\n\nIf your space is a hub of different people and interests, it should be well\norganized to provide value for all.\n\n    * Company parking reservation\n\nThere are dozens of benefits to implementing a company parking reservation\nsystem.\n\n    * Activity-based-work\n\nEnable teams to happily and efficiently work in specific activity-based\ngroups.\n\n    * Efficient space management\n\nCollaborate, focus on your work, and recharge all in the same workplace.\n\n  * Pricing\n  * Resources\n\nResources\n\n    * Blog\n    * About us\n    * Developers\n    * Partners\n\nHelp center\n\n    * Getting started\n\nA complete guide to getting started with Joan right away.\n\n    * Meeting room management\n\nYour comprehensive guide through room booking.\n\n    * Workplace experience\n\nEverything about desk booking, asset reservation, and visitor management.\n\n  * About Joan\n\nRelated\n\n    * Joan Workplace Management System.\n\nStreamline your workplace with our system of connected solutions and devices.\n\nWhy Joan\n\n    * Simplicity\n    * Sustainability\n    * Design\n    * Integrations\n    * Security\n\n  * Sign In\n\n  * CONTACT US\n\n# Visitor Management System\n\nPicture no more inefficient, crumpled, and easily lost sign-in sheets. The\nelimination of your employees’ and visitors’ frustration and anxiety. Smooth\ncheck-in and check-outs without much effort and time involved.\n\nJoan’s visitor management system is the perfect solution to all those visitor\nmanagement problems. With it, you can simplify visitor access and seamlessly\ntrack who’s coming and going from your building or office space.\n\n## What Is A Visitor Management System?\n\nYour front desk clerk or receptionist has so many tasks to complete daily. Why\nadd visitor management and check-ins to their list?\n\nA visitor management system takes the pressure off these essential workers.\nThey no longer have to micromanage every visiting situation.\n\nJoan visitor management software entails a digital process of tracking every\nvisitor who enters and exits the building.\n\nThink of clients, delivery people, job applicants, contractors, consultants,\nand so on. There is a long list of individuals who visit your business. Joan\nis your solution to managing every single one of these visitations without\nputting the extra work on your receptionist. This not only enables them to\nfocus on other, more important tasks, but it makes signing in quick and\nconvenient for visitors too.\n\nGET STARTED\n\n## The Benefits Of A Visitor Management System\n\nThe Joan visitor management system is so easy to use and can benefit your\nbusiness in several ways. Visitors can enjoy a fast and seamless welcome to\nthe site and they’ll leave impressed and satisfied with their visit.\n\n### Convenient & Efficient\n\nOne of the main benefits of the Joan visitor management solution is that it\nimproves efficiency, checking in your visitors seamlessly.\n\nIt is a no-fuss visitor management solution that allows you to track any\nvisitors and let them check into the building using a QR code. This is a\nconvenient and efficient visitor check-in process. No more filling out sign-in\nforms by hand or waiting for the receptionist to check in visitors. You can\nalso enable the option to notify the host when a visitor arrives so that they\ncan meet them timeously.\n\nYou can effortlessly invite your visitors by integrating with your everyday\ncompany calendar (Google, Office 365, Exchange, etc.).\n\nYou can also invite visitors through the Joan Portal by filling out the\nvisitor’s information and selecting whether to notify the host and visitors or\nnot. If you also add the easy check-in choice to the invitation email, the\nvisitor can complete any necessary documents at home. They’ll get an email\nwith a link to pre-register.\n\nIf a visitor doesn’t have a planned meeting, they can ask for an ad-hoc\nmeeting upon reaching your office. An ad-hoc meeting can be requested using\ntwo methods:\n\n  * By scanning the QR code on your Visitor Management tablet.\n  * By entering their details on the Visitor Management tablet.\n\n### Boosts Your Brand Image\n\nHaving a convenient, well-performing visitor management system in place has\nvisitors impressed from the get-go. A good, lasting impression is essential\nfor boosting your business’ brand image. And showcasing professionalism can\nstart before your visitors even enter the company premises!\n\nJoan is easily customizable to suit your brand so that you can maintain a\ncohesive brand image across all touchpoints.\n\nAn efficient visitor management system also shows that your company is\norganized and that you care about your visitors’ time too. This helps to\ncreate a positive impression of your brand.\n\n### Log and Track Visitors\n\nThe company admin team, security team, and specific employees can access a\ndigital visitor log displaying details about each visit.\n\nHow many guests visited yesterday? How many visited last month? Or how many\nvisited last year?\n\nYou can answer all of these questions and more with Joan’s data-driven digital\nvisitors’ log.\n\nGET STARTED\n\n### Reduces Visitor Waiting Times\n\nNo one wants to experience long waiting times and congestion in the visitors’\nlobby. It’s frustrating for everyone.\n\nWith Joan’s visitor management, you can streamline visitor check-ins and\nensure visitors are greeted timeously. It can send instant notifications via\nemail or text to hosts and receptionists so they are prepared and ready for\nthe visitors when they arrive.\n\nIf visitors walk in and the receptionist isn’t at the desk, they don’t need to\nwaste any time waiting. Visitors have the option to easily check in using a\nself-service kiosk located at the front desk, which is compatible with both\nAndroid and Apple tablets.\n\nYou can **Learn more by reading our blog post**.\n\n### Make Your Workplace Smarter With Visitor Management\n\nThe Joan visitor management app is a smarter way to manage your visitor\nexperience. It is also visitor-led. So, rather than a receptionist managing\nthe entire visitor registration, the visitor is empowered and prepared.\n\nSince Joan is customizable, you can incorporate any company policies and other\ndocuments to inform the visitor in advance. A client can therefore enter your\nbuilding already informed and knowledgeable, creating less stress.\n\n### Simplify The Visitor Check-In Process\n\nThe visitor check-in process should be quick. It should only require a click\nor two. And this is the case with Joan’s smart software.\n\nBy the time your visitor scans the QR code on arrival, they have already pre-\nregistered and have received pre-appointment confirmations. Both employees and\nguests are prepared to ensure quick processing and a friendly welcome.\n\nJoan reduces the awkward scenario of visitors arriving and not quite knowing\nwhat to do or where to go. Hosts will know when their visitors arrive and can\nmeet them as they do.\n\n### Pre-check-in questions\n\nJoan also has the option to gather necessary information through\nquestionnaires prior to check-in. For example with a health screening feature,\nyou can have employees and visitors fill out a health screening questionnaire\nbefore they enter the office. This can help you maintain a healthy environment\nat all times and prevent the spread of colds and the flu.\n\nThe screening questions are customizable to you. So, you can decide on\nspecific questions to ask and other documentation you require before entry to\nthe company grounds.\n\nGET STARTED\n\n### Streamline Check-Ins With Joan’s Visitor Management Solution\n\nIf you’ve felt short-staffed due to an inefficient visitor management system,\nthe easiest solution is to switch to Joan!\n\nJoan’s visitor management solution is extremely versatile and will make\nvisitor check-ins a breeze. It has many additional benefits on top of being\ntime and energy efficient.\n\nJoan is also customizable to suit your needs. This means that it’s not a\nproblem if you decide you want to change up your Joan system. It is easy to\nmake quick changes within minutes to optimize your business’ visitors’\nmanagement system.\n\nKeep your workplace safe and operating efficiently with Joan’s digital visitor\nmanagement. Check out our solution today to effortlessly manage all visitors.\nIt will make check-ins and check-outs quick and seamless for visitors while\nensuring your employees are always ready for their clients as they arrive.\n\n## Frequently Asked Questions\n\nWhat is visitor management process?\n\n“Visitor management is the process of tracking and managing the flow of\nvisitors to a company or facility. The goal of visitor management is to ensure\nthe safety and security of employees, visitors, and property. A typical\nvisitor management process includes the following steps:\n\n  * Pre-registration: Visitors may be required to pre-register for their visit, either online or by phone. This can include providing personal information such as name, company, and purpose of visit.\n  * Check-in: Upon arrival, visitors are checked in at a reception or security desk, where they are asked to present identification, sign in, and receive a visitor badge.\n  * Screening: Visitors may be screened for security or compliance purposes, such as through a metal detector or security camera.\n  * Escorting: Visitors may be escorted by an employee or security guard while they are on the premises.\n  * Check-out: Visitors are required to sign out and return their visitor badge upon leaving the facility.\n  * Data management: The data collected through the visitor management process is used to track visitors, monitor facility usage, and maintain records for compliance and security purposes.  \nMany organizations are now using digital visitor management systems such as\nJoan visitor management to automate this process, which helps in reducing\nmanual errors and increasing simplicity and effectiveness.”\n\nWhat are the benefits of a visitor management system?\n\n“A visitor management system is a solution that automates the process of\ntracking and managing visitors. There are several benefits of using a visitor\nmanagement system like Joan, including:\n\n  * Improved security: A visitor management system can help to improve security by providing a more efficient way to check in visitors.\n  * Increased efficiency: A visitor management system can automate many of the tasks associated with visitor management, such as check-in and check-out, badge printing, and data collection. This can save time and reduce the workload on receptionists and security personnel.\n  * Compliance: Many organizations are required to maintain records of who enters and leaves their facility. A visitor management system can help organizations to comply with these regulations by providing an accurate and auditable record of visitors.\n  * Better communication: A VMS can help to improve communication between employees and visitors by providing real-time notifications, such as email or SMS, to the host employee when a visitor arrives, which helps the employees to be prepared for the meeting.\n  * Cost savings: A visitor management system can help organizations to save costs by reducing the need for manual processes and paper-based systems.\n  * Better visitor experience: By automating the check-in process, a visitor management system can help to reduce wait times and provide a more efficient and pleasant experience for visitors.”\n\n  *   *   *   *   * \n\n  * Devices\n    * Joan 6 RE\n    * Joan 6 Pro\n    * Joan 13\n    * Accessories\n  * Solutions\n    * Joan Room\n    * Joan Visitor\n    * Joan Desk\n    * Joan Sign\n  * Resources\n    * Workplace glossary\n    * Room management\n    * Room Booking\n    * Hot desking\n    * Visitor Management\n  * Why Joan\n    * Simplicity\n    * Sustainability\n    * Integrations\n    * Security\n    * Design\n  * List 1\n    * Pricing\n    * Blog\n    * Support\n    * Partners\n\n### Subscribe to our newsletter\n\nSign up and receive occasional emails with news and updates.\n\n1\n\nI'd like to receive occasional emails with news and updates. See our PRIVACY\nPOLICY.\n\n© 2023 Visionect d.o.o. All rights reserved\n\n  * Legal\n  * Privacy Policy\n  * Sitemap\n\n## Have a second?\n\nWe want to make your experience with us amazing. So we would appreciate it if\nyou could answer one quick question!\n\nWhat problem are you hoping to solve by visiting our website?  \n  \nHow important is it that you solve this problem? —Please choose an option—Not\nImportantSlightly ImportantImportantFairly ImportantVery Important  \n  \n\nNotifications\n\n",
    "links": "[{\"link\": \"https://getjoan.com/about/#contact\", \"text\": \"CONTACT US\"}, {\"link\": \"https://getjoan.com/shop/category/accessories/\", \"text\": \"\"}, {\"link\": \"https://getjoan.com/hybrid-work/\", \"text\": \"\"}, {\"link\": \"https://getjoan.com/corporate-communications/\", \"text\": \"\"}, {\"link\": \"https://getjoan.com/equipment-sharing/\", \"text\": \"\"}, {\"link\": \"https://getjoan.com/coworking/\", \"text\": \"\"}, {\"link\": \"https://getjoan.com/parking-booking/\", \"text\": \"\"}, {\"link\": \"https://getjoan.com/activity-based-work/\", \"text\": \"\"}, {\"link\": \"https://getjoan.com/space-management/\", \"text\": \"\"}, {\"link\": \"https://getjoan.com/solutions\", \"text\": \"\"}, {\"link\": \"https://getjoan.com/about/#contact\", \"text\": \"CONTACT US\"}, {\"link\": \"https://getjoan.com/shop/joan-6-re/\", \"text\": \"Joan 6 RE\"}, {\"link\": \"https://getjoan.com/shop/joan-13/\", \"text\": \"Joan 13\"}, {\"link\": \"https://getjoan.com/shop/category/accessories/\", \"text\": \"Accessories\"}, {\"link\": \"https://getjoan.com/workplace-glossary/\", \"text\": \"Workplace glossary\"}, {\"link\": \"https://getjoan.com/visitor-management/\", \"text\": \"Visitor Management\"}, {\"link\": \"https://getjoan.com/simplicity/\", \"text\": \"Simplicity\"}, {\"link\": \"https://getjoan.com/privacy-policy/\", \"text\": \"PRIVACY POLICY\"}]"
}