{
    "summary": "Opens in a new window Opens an external website Opens an external website in a\nnew window\n\nClose this dialog\n\nThis website utilizes technologies such as cookies to enable essential site\nfunctionality, as well as for analytics, personalization, and targeted\nadvertising purposes. To learn more, view the following link:  Cookie Policy\n\nClose Cookie Preferences\n\nSkip to content\n\n  * Home\n  * Products\n  * Industries __\n    * Corporate\n    * Food & Beverage\n    * Government\n    * K-12 Education\n    * Manufacturing\n  * Resources __\n    * Blog\n    * Case Studies\n    * Webinars\n  * About\n  * Support\n\n____ Menu\n\n  * Home\n  * Products\n  * Industries __\n    * Corporate\n    * Food & Beverage\n    * Government\n    * K-12 Education\n    * Manufacturing\n  * Resources __\n    * Blog\n    * Case Studies\n    * Webinars\n  * About\n  * Support\n\n  * Home\n  * Products\n  * Industries __\n    * Corporate\n    * Food & Beverage\n    * Government\n    * K-12 Education\n    * Manufacturing\n  * Resources __\n    * Blog\n    * Case Studies\n    * Webinars\n  * About\n  * Support\n\n____ Menu\n\n  * Home\n  * Products\n  * Industries __\n    * Corporate\n    * Food & Beverage\n    * Government\n    * K-12 Education\n    * Manufacturing\n  * Resources __\n    * Blog\n    * Case Studies\n    * Webinars\n  * About\n  * Support\n\n(888) 231-7487\n\nContact Sales\n\n  * Home\n  * Products\n  * Industries\n    * Corporate\n    * Food & Beverage\n    * Government\n    * K-12 Education\n    * Manufacturing\n  * Resources\n    * Blog\n    * Case Studies\n    * Webinars\n  * About\n  * Support\n\n____ Menu\n\n  * Home\n  * Products\n  * Industries\n    * Corporate\n    * Food & Beverage\n    * Government\n    * K-12 Education\n    * Manufacturing\n  * Resources\n    * Blog\n    * Case Studies\n    * Webinars\n  * About\n  * Support\n\n  * Home\n  * Products\n  * Industries\n    * Corporate\n    * Food & Beverage\n    * Government\n    * K-12 Education\n    * Manufacturing\n  * Resources\n    * Blog\n    * Case Studies\n    * Webinars\n  * About\n  * Support\n\n____ Menu\n\n  * Home\n  * Products\n  * Industries\n    * Corporate\n    * Food & Beverage\n    * Government\n    * K-12 Education\n    * Manufacturing\n  * Resources\n    * Blog\n    * Case Studies\n    * Webinars\n  * About\n  * Support\n\n(888) 231-7487\n\nContact Sales\n\n# What is Visitor Management?\n\nA visitor management system tracks the usage of a business, public building,\nor site. By gathering increasing amounts of information, a visitor management\nsystem can record the usage of the facilities by specific visitors and provide\ndocumentation of visitor’s whereabouts.\n\nBecause visitor tracking provides a record of building use, these systems are\nfrequently used to complement building security systems and access control\nsystems. As electronic visitor management systems become more common and more\npowerful, these systems are taking over many of the functions of building\nsecurity and access control.\n\n## Pen and Paper Visitor Management Systems\n\nA pen and paper visitor management system records basic information about\nvisitors to a public building or site in a log book. Information typically\nfound in an entry includes the visitor’s name, reason for the visit, date and\ncheck in and check out times.\n\nA pen and paper method’s main positive feature is low up-front cost. Training\nto use the system is minimal, and the equipment required to implement this\nvisitor management system is cheap and readily available.\n\nHowever, from the security and usage standpoint, a pen and paper visitor\nmanagement system has many negative points. Visitors must write entries by\nhand, creating a logjam effect in public entryways. Security personnel must\ncheck each visitor’s credentials and manually initiate any further security\nchecks (for example, a call for a background check or other action). Visitors\nbadges rarely have photo identification and can easily be swapped from person\nto person. Documentation requires either manually re-entering logbook\ninformation in a computer or keeping the logbook itself in storage.\n\n## Computer Visitor Management Systems\n\nBasic computer or electronic visitor management systems use a computer network\nto monitor and record visitor information. As computer processing power,\ndigital video and information gathering technology have improved, electronic\nvisitor management systems have added photo ID capability, database searching,\nautomatic door access and other functions.\n\nA LobbyGuard visitor management system kiosk in use at Carrollton Middle\nSchool.\n\nAn electronic visitor management system improves upon most of the negative\npoints of a pen and paper system. Visitor ID can be checked against national\nand local databases, as well as in-house databases for potential security\nproblems. Many visitor management systems feature searchable visitor\ninformation databases. Photo ID cards can be custom printed for one-time only\nor continuing use. Swipe cards speed the security screening process.\n\nElectronics visitor management systems are more expensive to implement than a\npen and paper system. They also require a longer familiarization period for\nthe security personnel, building staff, and visitors than a pen and paper\nsystem. The amount of information gathered by an electronic visitor management\nsystem, as well as the uses the information is put to, can also be a source of\nconsideration.\n\n## Considerations\n\nDatabase security, both at the national level and at the level of the end-user\nof an electronic security system, is a critical concern for privacy advocates.\nThey argue that as the level of information accessed, gathered and retained\nincreases, additional security measures to protect the information itself\nshould be put in place.\n\nAlso at issue, is the level of security given to the access cards themselves.\nSome privacy advocates point to experiments done by researchers that crack the\nsecurity of RFID cards, sometimes used as part of a visitor management system.\nIf the security of these types of cards can be compromised, this would allow\nidentity thieves to steal personal information.\n\nProponents of an information rich visitor management system point to increased\nschool security as one substantial benefit. As more parents demand action from\nthe schools that will protect children from sexual predators, some school\ndistricts are turning to modern visitor management systems. These systems not\nonly track a visitor’s stay, but also check the visitor’s information against\nnational and local criminal databases.\n\nAccording to the supporters of enhanced visitor management systems, the same\ndatabase search capabilities could be used to protect sensitive areas from\npotential threats such as terrorists or criminal activity.\n\n## Summary\n\nPen and paper visitor tracking is easy to implement and learn, but doesn’t\nprovide the same convenience or overall security of an electronic visitor\nmanagement system.\n\nThe amount of data recorded by a modern visitor management system is\nformidable, and issues of information privacy have created conversations\nregarding the use of these visitor management systems. However, terrorist\nactivities, school violence, and child protection issues have acted as\nrallying points for support of comprehensive visitor management systems in\nsensitive locations.\n\n## Sources:\n\n  * Technology Industry and Privacy Advocates Clash Capitol Weekly News 6/14/2007\n\n  * Closer Eye on Sex Offenders KOTV news story 2/8/2007\n\n  * Visitor Management on Wikipedia Wikipedia definition of Visitor Management\n\nLobbyGuard Scout Visitor Management Kiosk\n\n## LobbyGuard’s Visitor Management Solutions:\n\n  * The Optio\n  * The Scout\n  * The SL\n  * See All Products\n\n\n\nGet Started with LobbyGuard\n\n##\n\nSign In\n\n##\n\nPrint ID Badge\n\n##\n\nSign Out\n\n  \n\nVisitor Management Solutions for Security, Compliance, and Savings.\n\n  * Sales: (888) 231-7487\n  * Support: (866)-905-6229\n  * support@lobbyguard.com\n\n#### **CUSTOMERS:**\n\n  * Support\n  * Orders\n  * Remote Assistance\n\n#### **CAREERS:**\n\n  * Open Positions\n\nCopyright © 2023 LobbyGuard Solutions | All rights reserved\n\n",
    "links": "[{\"link\": \"https://lobbyguard.com/get-started/\", \"text\": \"Get Started with LobbyGuard\"}]"
}