{
    "summary": "Call Toll Free: 888-315-5230 or at: 303-954-8282\n\n  * Request a Demo\n  * Visitor Management\n  * Store\n  * Support\n  * Sign In\n\n______\n\n__ Navigation\n\n  * Product __\n    * Overview __\n    * All Features __\n    * Integrations __\n    * Attend a Product Tour __\n    * Enterprise Implementations __\n    * Reviews __\n    * Hardware Options __\n  * Pricing __\n    * What Does It Cost? __\n    * Request a Quote __\n  * Industries __\n    * Enterprise __\n    * * * *\n\n__\n\n    * Aerospace __\n    * Behavioral Health Practices __\n    * Coworking Spaces __\n    * Education __\n    * Engineering and Design __\n    * Food & Beverage __\n    * Private Practice __\n    * Logistics __\n    * Manufacturing __\n    * Technology & Software __\n  * Resources __\n    * Featured Customer Case Studies __\n    * Product Updates __\n    * The FABRIC podcast __\n    * Refer a Friend to The Receptionist __\n    * What is a Visitor Management System? __\n    * Security and Compliance __\n    * Partner Program __\n    * COVID-19 Resource Center __\n  * Blog __\n  * Company __\n    * Our Story __\n    * Team __\n    * Careers __\n    * Contact __\n  * See How It Works __\n  * \n\n  * Product __\n\n __\n\n    * Overview __\n    * All Features __\n    * Integrations __\n    * Attend a Product Tour __\n    * Enterprise Implementations __\n    * Reviews __\n    * Hardware Options __\n  * Pricing __\n\n __\n\n    * What Does It Cost? __\n    * Request a Quote __\n  * Industries __\n\n __\n\n    * Enterprise __\n    * * * *\n\n__\n\n    * Aerospace __\n    * Behavioral Health Practices __\n    * Coworking Spaces __\n    * Education __\n    * Engineering and Design __\n    * Food & Beverage __\n    * Private Practice __\n    * Logistics __\n    * Manufacturing __\n    * Technology & Software __\n  * Resources __\n\n __\n\n    * Featured Customer Case Studies __\n    * Product Updates __\n    * The FABRIC podcast __\n    * Refer a Friend to The Receptionist __\n    * What is a Visitor Management System? __\n    * Security and Compliance __\n    * Partner Program __\n    * COVID-19 Resource Center __\n  * Blog __\n  * Company __\n\n __\n\n    * Our Story __\n    * Team __\n    * Careers __\n    * Contact __\n  * See How It Works __\n  * \n\n__Home __ Visitor Management System Guide: How It Works\n\n# Visitor Management Systems\n\n#\n\n### What are they? Why would you need one?\n\nHow many visitors are in your office right now? How many did you have\nyesterday? What about in August of last year?\n\nYou probably struggled to answer at least that last question, if not the one\nbefore. And if you could answer them at all, you likely had to pull out the\nbinder that holds your visitor sign-in sheets or find the old Excel\nspreadsheet in your shared drive and manually count the entries.\n\n**While you’ve got that binder or spreadsheet open, here are a few more\nquestions for you:**\n\n  * How many of the names can you actually read or were typed incorrectly?\n  * How many visitors don't have a time noted as to when they arrived?\n  * Who forgot to sign out? (Or are they still hiding somewhere in the office?)\n  * Was the sign-in or sign-out time that was recorded accurate?\n  * Do you know which employee each visitor met with?\n\nNow, think about what happens when visitors arrive at your office. Who greets\nthem? A smiling receptionist who makes them feel welcome by engaging them on a\npersonal level? Or one who’s obviously hassled and hasn’t had enough coffee\nbecause they’ve been chained to the desk all day?\n\nMaybe no one’s there to greet visitors at all. Then what do they do? Hang out\nuntil an employee walks by or start knocking on random doors? Many buildings\nhave unattended lobbies and unlocked doors, which means anyone could walk into\nany office at any time.\n\nThese simple scenarios take place every day in offices worldwide. And they\nillustrate the need for visitor management. In particular, they show why you\nneed a digital check-in system, known as a visitor management system.\n\nThis article describes what a visitor management system is and why so many\nbusinesses today use this technology.\n\n_**To quickly jump to a specific section, use the links below.**_\n\n  * What is Visitor Management?\n\n __\n\n  * The Solution\n\n __\n\n  * Benefits\n\n __\n\n    * Office Productivity\n\n __\n\n    * Office Security\n\n __\n\n    * Brand Image\n\n __\n\n  * What to Look For\n\n __\n\n  * The Future\n\n __\n\n####  **1\\. What is a Visitor Management System?**\n\n**Visitor management** is the process of tracking everyone who enters your\nbuilding or your office. A visitor may be a customer, a delivery person, a job\napplicant, a contractor, a consultant, or the CEO’s third cousin twice\nremoved. Essentially, anyone who is not a regular full-time employee is a\nvisitor.\n\nA **visitor management system** is a technology used to track visitors in a\nformal way.\n\n_Interested in learning how much   visitor management software costs? Check\nout our pricing._\n\n  * Visitor Management Systems Before the Digital Revolution\n  * Visitor Management Systems Today\n\nThe old fashioned version of a visitor management system is the sign-in sheet\n-- a piece of paper usually kept on a clipboard or in a binder at the front\ndesk. When a visitor arrives, they write down their name, who they’re there to\nsee, and the time. Then the staff member sitting at the front desk notifies\nthe host that their visitor is waiting in the lobby. At some point, that sign-\nin sheet gets filed away, or shredded, and a new sheet appears on the\nclipboard to record the next 10 or so visitors.\n\nIt’s not a particularly good visitor management system (and certainly not\nenvironmentally friendly). But it does work \\-- as long as you don’t need an\neasily searchable visitor log, visitor photos, and ID badges. And as long as\nyou’re happy paying someone to sit at the front desk all day, just in case a\nvisitor or delivery may arrive.\n\nBut that doesn’t hack it for most companies today.\n\nMost companies can’t afford to pay someone just to man the front desk.\nReceptionist salaries can reach $36K, and that’s before taxes, benefits, and\noverhead! Businesses also need tighter security than a pen and paper can\nprovide.\n\nAnd -- let’s face it -- no company wants to look old-fashioned, especially\nwhen it comes to technology. You want to look innovative and modern. You want\nto show your customers, your job applicants, and the world that you’re on the\ncutting edge.\n\nToday, companies are eschewing binders, pens, and paper in favor of digital\nvisitor management systems, like The Receptionist for iPad.\n\nA digital visitor management system does the core job of checking in visitors.\nBut it also does many things a pen and paper can’t:\n\n  * Maintain a cloud-based visitor log\n  * Take photos of your visitors to help you identify them\n  * Print visitor ID badges, customized with your company’s logo\n  * Capture signatures for NDAs and other legal agreements\n  * Accept deliveries from UPS, FedEx, and other courier services\n  * Send SMS, email, and Slack notifications when visitors arrive\n  * Allow two-way communication between employees and visitors\n  * Accept food deliveries and document drop-off\n  * Provide instructions for visitors\n  * And more\n\nA visitor management system increases your office productivity, enhances your\noffice security, and elevates your brand image. Let’s dive into each of these\nbenefits in turn.\n\n####  **2\\. The Original iPad-Based Visitor Management System**\n\nThe Receptionist for iPad (formerly known as The iPad Receptionist), a Denver-\nbased company, was the original iPad-based visitor management system. It burst\nonto the scene in 2013, when Brad Feld of Boulder, CO’s, Foundry Group\napproached local startup TextUs about creating an app to protect employees\nfrom the demands of roaming visitors.\n\n> We’ve never had a dedicated receptionist at Foundry Group but our office was\n> oriented so the people “in the line of fire” were constantly interrupted\n> whenever someone came in the office….[TextUs] came up with an iPad app\n> called ‘Receptionist’ which freed up anyone from having to pay specific\n> attention to the front door. As a result, we redesigned the entrance to our\n> office with ‘Receptionist’ front and center…Brad Feld\n\nWith that simple idea, Feld created the entire product category of iPad-based\nvisitor management systems.\n\nSince then, the market has exploded. Visitor management systems now sit in\noffices around the globe, shielding the people “in the line of fire” from\ninterruptions. From tech companies to law offices, to manufacturing and\nengineering facilities, to schools -- organizations across the board are\nrealizing the benefits of visitor management.\n\nTextUs’s Receptionist app soon became The iPad Receptionist. Then, in April\n2015, The iPad Receptionist spun off as its own company under the direction of\nAndy Alsop (read his story). Just recently, it got a new name: The\nReceptionist (learn why).\n\nAll this in just three years! And all signs point toward continued growth.\n\n#### **3\\. Benefits of Visitor Management Systems: Office Productivity**\n\nThe first visitor management system was designed to solve two major challenges\nrelated to office productivity: too many interruptions and receptionists being\nstuck at their desks.\n\n###### **Top Productivity Challenges**\n\n  * Interruptions\n  * Receptionists Stuck at Desks\n\nWhen Brad Feld asked TextUs to create a visitor management app, he wanted to\neliminate interruptions.\n\nEspecially in offices that don’t have a full-time receptionist, interruptions\nare a huge problem. A study at the University of California, Irvine, found\nthat a typical office worker is interrupted once every 11 minutes.\nFurthermore, it takes 25 minutes to get back into a task after an\ninterruption.\n\nClearly, this math doesn’t work out well for productivity. After one\ninterruption, the typical office worker wouldn’t even be back to their peak on\na task before getting interrupted again.\n\nBut distractions aren’t just annoying. Research suggests they actually make us\ndumber. This study from researchers at Carnegie Mellon University found that\npeople who were interrupted during a cognitive skill test performed 20% worse\nthan those who weren’t interrupted. The author of the New York Times article\nput it bluntly:\n\n_\"...the distraction of an interruption, combined with the brain drain of\npreparing for that interruption, made our test takers 20% dumber. That’s\nenough to turn a B-minus student into a failure.\"_\n\nIn today’s competitive business landscape, no company can afford to have their\nemployees operating at a 20% disadvantage. You need your employees to work as\nfast as possible and at the highest level possible. To do that, they need to\nbe able to focus.\n\nDon’t let your employees suffer from Person Nearest the Door Syndrome. Your\ncompetitive advantage could be at stake.\n\nAnother productivity pitfall is the necessity of having a person at the front\ndesk all of the time.\n\nFor many companies, going receptionless isn’t an option. But that doesn’t mean\nthat checking in visitor and answering phones is all your front desk staff can\ndo. Jane Streat, the Head of Client Services at Lexington Reception Services,\nidentifies many ways in which the traditional receptionist role has expanded.\n\nHere are some common receptionist duties today:\n\n  * Enhancing organizational brand\n  * Creating a positive and memorable customer experience\n  * Welcoming guests as a host\n  * Assisting guests with office technology\n  * Providing first-line support for technical issues\n  * Coordinate meetings and prep conference rooms\n  * Providing concierge services\n\nAnd that's not all! Receptionists are often called upon to support other\ndepartments. In our 2015 survey, we found that receptionists, office managers,\nand executive assistants regularly perform work outside of their job\ndescription:\n\nData entry: 31%\n\nHuman resources: 20%\n\nAccounting: 15%\n\nSocial media: 14%\n\nNewsletters: 9%\n\nTravel planning: 7%\n\nOther: 4%\n\nThey also said they’d like to be doing more. Two out of three respondents\nagreed with the statement: “Companies often do not take full advantage of the\nskills their receptionists have.”\n\nYour receptionist can contribute a lot to the success of your business. But\nnot if they’re stuck at their desk all day.\n\nBy welcoming and checking in your office visitors, a visitor management system\nfrees your receptionist to work on other things. Guaranteed both you and your\nreceptionist will be happier for it.\n\nTo learn more about how a visitor management system complements your front\ndesk staff, read 5 Reasons You Need a Receptionist for iPad Even if You Have a\nReal, Live Receptionist.\n\n#### **4\\. Benefits of Visitor Management Systems: Office Security**\n\nThe next set of benefits revolves around office security. In particular, a\nvisitor management system helps combat challenges related to information\nsecurity, visitor privacy, emergency evacuation plans, and regulatory\ncompliance.\n\n###### **Top Security Challenges**\n\n* * *\n\n  * Information Security\n  * Visitor Privacy\n  * Emergency Evacuation Planning\n  * Regulatory Compliance\n\nDo you work with confidential documents? Intellectual property? Trade secrets?\nWould you want someone wandering into your office and discovering your\ncompany’s secret sauce? Of course not. Your lobby plays a big role in your\noffice security. That includes keeping your company’s information secure. And\na visitor management system can help.\n\n**Here are three stories that represent what we hear about why companies\nchoose to implement a visitor management system. Do any of them sound\nfamiliar?**\n\nImagine this scenario:\n\n_You’re an intellectual property lawyer who works with confidential documents\nalmost all day, every day. You don’t have a visitor management system, and\nyour receptionist is away from the front desk._\n\n_Your 2:00 appointment arrives 10 minutes early, while you’re on the phone\nwith another client. With no way to pre-alert you that she’s there, your 2:00\njust walks straight into your office,  overhearing part of your conversation\nand possibly seeing some of the other client’s intellectual property._\n\nOr how about this one:\n\n_Your company has 300 employees at its HQ. You’re in an active growth phase,\nso new faces appear monthly. Currently, you don’t have a visitor management\nsystem or any way of issuing ID badges to visitors.  As a result, you’re never\nsure the status of the people you see walking around._\n\n_One day you discover that some sensitive information was  stolen from a\nsenior VP's laptop. How can you even begin to find out who did it? You don’t\neven have a record of who was in your office that day._\n\nOne more:\n\n_Your  software company is just about to launch your new product. You hire\nseveral consultants to help you prepare for the big day. You know your\ncompetitors want to get the skinny, and you’ve been working hard to keep it\nunder wraps._\n\n_But then you discover a competitor’s name on the paper sign-in sheet at the\nfront desk. With dread, you notice that the names of the consultants you hired\nare on the same page. Now the competition knows who you’re working with. And\nwhile they might not have the full details yet, they’re one step closer to\nlearning your plans._\n\nNone of these stories is entirely fictional. For more on this topic, read Are\nYour Competitors Using Your Visitor Log to Spy on You? and How Secure is Your\nOffice? (And How a Visitor Management System Can Help).\n\nHopefully, your company puts customer privacy at the very top of the priority\nlist. But have you thought about how a visible visitor log might put them at\nrisk?\n\nThis is a concern we’ve heard from several customers, particularly those who\nwork in fields where privacy is paramount, like legal and financial services.\nYour customers might not want others to know they paid you a visit. And it’s\nyour responsibility to respect their desire for privacy.\n\nPrivacy killers exist everywhere in office environments. Learn about three of\nthe worst.\n\nNo one likes to think about it, but emergencies happen—floods, fires, civil\ndisturbances, incidences of workplace violence, and so on. And when those\nemergencies happen, you need to know who’s in your office so you can do\neverything in your power to keep them safe.\n\nThe Occupational Safety and Health Administration (OSHA) requires workplaces\nto have emergency action plans, which include an evacuation policy and\nprocedure. Although the standard doesn’t specifically mention visitors (OSHA’s\nmandate is to ensure employee safety and health), many insurance providers\nrequire emergency plans that extend to visitors.\n\nThe first step in making sure everyone on your premises is safe in an\nemergency is knowing exactly who’s on your premises. With a visitor management\nsystem, you have this information available at your fingertips.\n\nRead more from OSHA on How to Plan for Workplace Emergencies and Evacuations.\n\nWhile OSHA doesn’t specifically require visitor management, some other\nregulations do. Here are three types of compliance you should be aware of:\n\n###### _**ITAR Compliance**_\n\nThe International Traffic in Arms Regulations is a set of export control laws\nto prevent sensitive information from getting into the hands of foreign\nnationals. Any company involved in defense articles, services, and technical\ndata must be ITAR compliant (aka ITAR certified). All visitors to facilities\nthat supply these products must first verify that they are U.S. citizens, and\nthey may be required to sign other legal agreements as well.\n\n###### _**C-TPAT Compliance**_\n\nThe Customs-Trade Partnership Against Terrorism is a program to ensure the\nsafety of all goods entering the United States from foreign suppliers. This is\na voluntary program under which importers must ensure the security of their\nsupply chain, including keeping detailed records of everyone who visits the\nsuppliers’ facilities.\n\n###### _**FSMA Compliance**_\n\nThe Food Safety Modernization Act is a set of FDA rules aimed at improving the\nsafety of the U.S. food supply. As part of the Food Defense Rule, the FDA\nrecommends implementing a check-in/check-out system at security or reception\nareas, a comprehensive visitor policy, and a transportation driver check-in\npolicy.\n\nMany aspects of visitor management are just good practice. But regulatory\ncompliance is mandatory. Learn more about these three regulations and their\nimplications for your company.\n\n####  **5\\. Benefits of Visitor Management Systems: Brand Image**\n\nThe last key set of benefits revolves around a company’s brand image.\nSpecifically, a visitor management system helps you create a great first\nimpression and ensure the brand image you’ve got is the one you want.\n\n###### **Top Brand Image Challenges**\n\n  * Your Company's First Impression\n  * Building the Right Brand Image\n\nThink about the last few office you visited. How was your experience?\n\nWhen you walked in, did you think, “Wow! This is a great office!” Or did you\nthink, “Wow. I just really can’t wait to get out of here.”\n\nYou’ve probably heard that it takes only 7 seconds to make a first impression.\nThat’s a lot of pressure! It’s also a serious overstatement. You have far less\ntime than that. Researchers at Princeton found that we actually form first\nimpressions in about 1/10 of a second.\n\nOften, when visitors enter your office, they’re forming that crucial first\nimpression of your company. If they’re greeted promptly and made to feel\nwelcome, their first impression will be positive. If they feel ignored or\nlost, that impression will suffer.\n\nA visitor management system helps you make a great first impression, even if\nthere’s no receptionist there when your visitors walk through the door. It\nwelcomes them to your office and helps them immediately get in contact with\nwhoever they’re there to see. It also provides a positive and efficient\nvisitor experience by checking them in quickly and getting them where they\nneed to go.\n\nFinally, a visitor management system elevates your company’s brand image. Your\nbrand image is how other people view your company. And it’s incredibly\nimportant because of how it affects your bottom line. Studies show that\ncustomers are more likely to purchase from companies they perceive in a\npositive light.\n\nBrand image is tricky because it’s not something you can control entirely. But\nyou can shape it through the choices you make. For example, by supporting\ngreen initiatives, you can promote the image that you’re environmentally\nresponsible.\n\nYour office technology also influences your brand image. One of the comments\nwe hear repeatedly from customers is that a visitor management system enhances\ntheir brand image. That’s why a lot of them choose to use a visitor management\nsystem in the first place.\n\nThink about it — how would you feel if you walked into the office of a\ntechnology company and were asked to write your name on a paper sign-in sheet?\nYou’d probably wonder what kind of technology company still uses a paper sign-\nin sheet. You might question their tech savviness.\n\nThis is one of the reasons companies like Upland Software, eOriginal, and CCS\nPresentation Systems use The Receptionist for iPad. They’re all leaders in\ntheir technology fields, and they want to reinforce that image from the moment\npeople walk in the door.\n\nHigh-end fitness and training studio Vault Fitness provides another example.\nTheir clients want “attractive amenities and high-end technology, and they\nexpect the best.” A piece of paper on a clipboard with a pen attached simply\ndoesn’t fit the bill.\n\nMany of the companies we work with say the same thing — a visitor management\nsystem elevates their brand and impresses their visitors. Scroll through our\ncustomer stories for more examples of how this simple piece of technology can\ninfluence how customers view a brand.\n\n* * *\n\n* * *\n\n####  **6\\. What to Look for in a Visitor Management System**\n\nThere are several visitor management systems on the market. And while they all\nperform the basic task of checking in visitors, they differ in the features\nand functions they provide.\n\n**Here are seven of the most essential features to look for, based on our\ncustomers’ reports:**\n\n▸Customized Check-in Process\n\nYou probably have more than one type of visitor, and they don’t all need to go\nthrough the same check-in process. For example, for a general visitor, you may\nwant to capture their name, company, email, and phone number. They might also\nneed to sign an agreement and wear a badge. But for a courier delivering a\ndocument, probably all you need is their name and company. A customized check-\nin process allows you to design the reception experience around each visitor\nwho comes to your office.\n\n▸Notifications via Multiple Channels\n\nWhen a visitor arrives at the office, the visitor management system sends an\nautomatic notification to the person the visitor is there to see. The\nReceptionist for iPad can send notifications via email, text message, or\nSlack. This allows each contact within your company to choose the notification\nchannel(s) they prefer.\n\n▸Two-Way Communication\n\nYour employees don’t just receive messages from the visitor management system.\nThey can also send messages back to their visitors. For example, suppose an\nemployee is running late for a client meeting. When the client checks in, the\nemployee can send a quick note back to the iPad to say it will be just a few\nminutes.\n\n▸Message Forwarding\n\nSometimes a visitor’s primary contact isn’t available. In this case, a\nnotification can be sent to someone else. And if the secondary contact isn’t\navailable (maybe they’re at lunch together), a third person can be notified.\nUnlimited options for backup notifications ensures you don’t leave any\nvisitors hanging.\n\n▸NDAs and Other Legal Agreements\n\nMore and more companies are asking job applicants, business partners, and\ncolleagues to sign NDAs and other legal agreements. To make this even more\ncomplex, different visitors often need to sign different agreements. Being\nable to simplify the paperwork and get the signing done quickly upfront saves\na lot of time and hassle.\n\n▸Digital Visitor Log\n\nLet’s be honest — no one ever goes back to review paper visitor logs or takes\nthe time to enter the data into a spreadsheet. But companies find many uses\nfor digital visitor logs, from tracking visitors for security purposes to\nexporting lists of people who attended a particular event. For example, Vault\nFitness uses their visitor log for to streamline the billing process. Others\nuse it as a way to track pick-ups and deliveries.\n\n▸Badge Printing\n\nBadge printing is one of the most-searched-for features. Visitor badges\ncontribute to security by letting you know at a glance who’s in your office.\nSome of our customers take it a step further by printing badges for some types\nof visitors, but not others.\n\nThese are just a few of the ways a visitor management system makes office life\neasier. View The Receptionist for iPad’s full list of features.\n\n#### **7\\. The Future of Visitor Management**\n\n##### What's coming in the next 3 to 5 years?\n\nIf you’ve made it this far, congratulations! And thanks for reading. As a\nreward for your perseverance, here’s a sneak peek at the future of visitor\nmanagement.\n\n▸A Visitor Management System in Every Office\n\nIn the next few years, digital visitor management systems will become the norm\nand paper sign-in sheets will disappear from offices completely. No one will\nbe sad about this.\n\n▸Integration with Physical Security Systems\n\nThe next major development will be the ability to scan visitor IDs (like\ndriver’s licenses) and integrate with physical security systems (like keycard\naccess control).\n\n▸Integration with Other Office Management Technologies\n\nAfter physical security, visitor management systems will start integrating\nwith other office management tools, like conference room scheduling apps. The\nresult will be seamless communication among all of the tools you use to move\npeople into and around your office.\n\n* * *\n\nThere you have it! An in-depth look at visitor management systems, their\nbenefits and features, and what’s coming down the road. If you have any\nquestions, don’t hesitate to contact us at 888-315-5230 or\nhello@thereceptionist.com.\n\nTo see the original visitor management app in action in your office, sign up\nfor a free 14-day trial of The Receptionist for iPad today.\n\n### 12-Minute Product Tour\n\nJoin the next tour\n\nBest webinar platform for customer success\n\n  * Terms of Service\n  * Privacy Policy\n  * GDPR Compliance\n  * Support\n  * Careers\n  * Contact\n  * Sitemap\n  * Opt-out preferences\n\n______\n\nProudly Headquartered in Denver, CO\n\n12-Minute Product Tour\n\nJoin the next tour\n\n00:00:00\n\n10 more sessions › Powered by\n\n",
    "links": "[{\"link\": \"https://thereceptionist.com/visitor-management-system/\", \"text\": \"Visitor Management\"}, {\"link\": \"https://thereceptionist.com/visitor-management-system/\", \"text\": \"\"}, {\"link\": \"https://thereceptionist.com/visitor-management-system/\", \"text\": \"\"}, {\"link\": \"https://thereceptionist.com/visitor-management-system/\", \"text\": \"Visitor Management System Guide: How It Works\"}, {\"link\": \"https://thereceptionist.com/pricing\", \"text\": \"Check out our pricing\"}]"
}