{
    "summary": "Skip to content\n\nWe’re hiring!\n\nMRI Software\n\n  * MyMRI\n  * Select Region __ __\n  * +1 800 321 8770\n\n  * Solutions  __\n    *       *         * MRI Living™ \n\nSimplify living for property professionals and residential communities with\nintegrated digital services.\n\n        * Multifamily Lead-to-Lease\n        * Multifamily Property Management\n        * Affordable/Public Housing Management\n        * Condo/HOA Management\n      *         * MRI @Work™ \n\nStay agile and competitive with flexible solutions for commercial owners,\noperators and investors.\n\n        * Commercial Property Management\n        * Investment Management\n        * Building Operations\n        * Energy Management\n        * Footfall Analytics\n        * Visitor Management\n      *         * MRI @Work™ for Occupiers \n\nUncomplicate compliance and prepare for the future with solutions for\ncorporate occupiers.\n\n        * Workplace Management\n        * Facilities Management\n        * Energy Management\n        * Lease Management\n        * Lease Accounting\n        * Footfall Analytics\n        * Visitor Management\n    *       * Property Management Software \n      * A-Z Products \n  * Sectors  __\n    *       * Residential Sectors\n      * Multifamily\n      * Affordable/Public Housing\n      * Condo/HOA\n    *       * Owners and Operators\n      * Office\n      * Industrial & Logistics\n      * Retail\n    *       * Property Occupiers\n      * Office\n      * Industrial & Logistics\n      * Retail\n    *       * Public/Other Sectors\n      * Healthcare\n      * State & Local Government\n      * Education\n      * Telecommunications\n  * Partners \n  * Services  __\n    *       * Managed Services\n      * Data Management \n      * Fee Accounting\n      * Asset Management\n      * Lease Administration \n      * Recurring Professional Services\n    *       * Cloud Services\n      * Hosting & Deployment\n    *       * Support & Implementation\n      * Contact Support\n      * OnLocation Support\n      * Client Support\n      * Professional Services\n    *       * Training\n      * Training Academy\n  * The MRI Difference  __\n    * About Us\n    * MRI Agora platform\n    * Careers\n    * Leadership \n    * Foundation\n  * Resources  __\n    * Resources\n    * Blog\n    * Events\n    * News\n  * Search for: Submit Search Click here to search\n\n  * Contact \n  * MyMRI\n  * Select Region __ __\n  * +1 800 321 8770\n\nToggle navigation\n\nOnLocation\n\n  * OnLocation\n  * Visitor\n  * Employee \n  * Contractor \n  * Emergency\n  * Resources\n  * Pricing\n  * Support\n  * Login\n\nSelect a solution OnLocation Visitor Employee  Contractor  Emergency Resources\nPricing Support Login\n\nFree Trial\n\nVisitor Management System\n\n# Keep your workplace safe with a comprehensive visitor management system\n\nStrengthen the security of your facilities, instill confidence in employee\nsafety, and protect intellectual property by taking control of visitor access\nand managing foot traffic throughout the workspace.\n\n  \n  \n\nRequest Demo Download Brochure\n\n  * Monitor and report on all visitors in your workplace\n  * Keep your team safe and ease employee health and safety concerns\n  * Keep your locations secure and stop those who pose a risk\n\n## Keep your workplace safe and secure\n\nLearn why Beckman Coulter chose OnLocation to digitize their visitor\nmanagement processes and keep everyone in their duty of care safe and secure.\n\nFind out more\n\n## Worried about visitors in your building?\n\nAs a property or facilities manager, managing and monitoring the safe and\nsecure movement of visitors through buildings and worksites can be stressful.\nWith the right visitor management system, you can ensure that all health and\nsafety procedures are followed while providing a smooth and pleasant\nexperience for both the visitor and the host.\n\n__\n\n### Pre-screen visitors before they arrive on-site to ensure they meet your\nhealth & safety requirements.\n\n__\n\n### Scan, validate, and ensure that only verified visitors gain access to the\nspace with mobile photo ID scanning.\n\n__\n\n### Determine where visitors can go in the workplace through tight access\ncontrols.\n\n__\n\n### Reduce queues and visitor waiting time at sign-in by automatically\nnotifying hosts as soon as your visitors arrive.\n\n## A visitor management system that makes life simple for visitors and hosts\n\n### Give your visitors the best experience\n\nAsk visitors to pre-register before they arrive on-site to speed up sign-in\nand to ensure they meet your on-site requirements. Print customizable, branded\nbadge passes for visitors and ensure they are easily identified.\n\n### Facilitate touchless entry for improved hygiene\n\nSwitch your kiosk to touchless mode or print and display QR code posters for a\nhygienic sign-in solution. Minimize the risk of spreading seasonal flu strains\nand cut down waiting times by allowing visitors to scan a QR code and sign in\nfrom their smartphone’s browser. No app download required.\n\n### Customised workflows to suit your needs\n\nAdd custom workflows for visitor health screenings, ensuring safety videos are\nwatched and the proper waivers are signed. These workflows ensure your\nvisitors and employees can gain access to your workplace in accordance with\nyour company policy.\n\nRequest Demo\n\n## Visitor Management System\n\n  * __\n\nArrival notifications\n\n  * __\n\nMultiple devices\n\n  * __\n\nRich data\n\n  * __\n\nRed flag alerts\n\n  * __\n\nMulti-language kiosk\n\n  * __\n\nHealth Checks\n\n  * __\n\nDeliveries\n\n####  __ Arrival notifications\n\n### Arrival notifications\n\nEliminate the extra time your reception or security team spends tracking down\nemployees to advise them that their visitor has arrived. Our visitor\nmanagement system will send hosts a visitor arrival notification by push, SMS,\nand/or email automatically when their visitor has signed in.\n\n####  __ Multiple devices\n\n### Multiple devices\n\nOnLocation is not limited by hardware, and getting started is as simple as\nsetting up a kiosk on any desktop or tablet.\n\n####  __ Rich data\n\n### Rich data\n\nReport extensive, real-time information, from who is on-site at a particular\ntime, to how long a lone worker spent in a particular area. Track and manage\nan emergency in real time and submit post-incident summaries to better\nunderstand your operations and crisis preparedness.\n\n####  __ Red flag alerts\n\n### Red flag alerts\n\nRed flag alerts notify you when a particular event occurs. If a visitor is due\noff-site but has not signed out, or a competitor has signed in, you can\nreceive an SMS or email notification. Get alerted when a guest does not meet\nyour on-site conditions, has flu-like symptoms, or has travelled\ninternationally in the last 14 days.\n\n####  __ Multi-language kiosk\n\n### Multi-language kiosk\n\nHallo! Bienvenue! Use our multi-language feature so your guests can sign in at\nthe kiosk using their preferred language. Multi-language is not just for\nguests – your front of house staff and security guards can use their preferred\nlanguage to operate the Sign In/Out Manager. Arrival notifications (email,\npush, and SMS) will also adjust to your location’s default language. C’est\nFantastique, non?\n\n####  __ Health Checks\n\n### Health Checks\n\nNeed to capture documents before a visitor can enter your workplace? Add steps\nto your sign-in process, and request visitors upload the documents your\norganisation requires. Capture anything from ID, certifications and other\ndocumentation during sign-in gives you the confidence that only those who meet\nyour on-site requirements can gain access.\n\n####  __ Deliveries\n\n### Deliveries\n\nActivate the deliveries options on your kiosk to display a custom message or\nset instructions for delivery agents.  For instance, you can display\ninstructions to let the delivery agent know an employee is coming to meet\nthem, or inform them where to leave the package.\n\n> The QR code feature, whether it was on screen or via a kiosk poster, allowed\n> us to minimize surface contact. Global Questionnaire Manager helped us to\n> create and maintain a consistent message across all our sites . A lot of\n> what we do is risk management and the OnLocation features allowed us to\n> manage some of the risks around Covid for ourselves, our clients, and our\n> subcontractors while maintaining visibility of who was on site.\n\nLee Harris | Naylor Love\n\n> Nice clean user interface which is easy for everyone to use. New features\n> coming out every month with great business user feedback. Lots of hardware\n> support options for kiosks and printers. Speedy and helpful support\n> responses by knowledgeable staff.\n\nNick | Operations Engineer @ Computer Concepts\n\n## Trusted by organizations of all sizes\n\n## 3 Steps to improve your visitor management process  \nGet started today to start providing the best experience.\n\n__\n\n### 1\\. Schedule a no-obligation customised demo with a friendly account\nmanager.\n\n__\n\n### 2\\. Sign up for a free trial to see how you can improve the flow of\nvisitors through your buildings.\n\n__\n\n### 3\\. Start using OnLocation to create the best visitor experience.\n\nRequest Demo\n\n## Key Facts\n\n53\n\nCountries using OnLocation\n\n1.9M\n\nEmployees protected\n\n88M\n\nDaily people movements\n\n### Who uses visitor management software?\n\nA range of organizations use visitor management software to monitor the safe\nand secure movements of visitors in the workplace. Giving them confidence your\nhealth and safety procedures get followed while providing your visitors the\nbest digital experience.\n\n### What is the cost of visitor management software?\n\nMRI makes it easy for your workplace to manage visitors with all core features\nincluded in one subscription with prices starting from USD$55 per location,\nper month. Get a free trial today and learn how valuable visitor management\nsoftware can be for your organization.\n\n### What is a visitor management system?\n\nA visitor management system allows you to manage and monitor visitors’ safe\nand secure movement through your buildings and worksites, alleviating a\npotentially stressful and time-consuming task. Ensure that your organization’s\nhealth and safety procedures are followed and provide visitors and hosts with\na smooth and pleasant experience. Account for everyone in your duty of care\nwith visitor management software.\n\n### What are the benefits of using a visitor management system?\n\nA visitor management system has many perks and benefits and goes much deeper\nthan logging visitors in and out of your organization. Some of the benefits of\nusing our visitor management software are:\n\n  * Authorizing and monitoring visitors on-site. \n  * Creating an engaging first impression with a slick solution that offers multiple ways to sign in. \n  * Pre-screening to ensure only those who meet on-site requirements can gain access. \n  * Improving front-line productivity by automating the sign-in and out process. \n  * Visibility of who is on-site in real-time.\n  * Ease workplace health and safety concerns.\n  * Integrate with access control systems. \n  * Manage risk with watchlist management. \n  * Paperless alternative with less manual labor required to manage visitors. \n  * Your visitors won’t get kept waiting with automated arrival notifications to hosts. \n  * Workplace data insights and reporting.\n\n### Why should I use OnLocation for my visitor management?\n\nGet OnLocation and start strengthening the security of your facilities,\ninstill confidence in employee safety, and protect intellectual property by\ntaking control of visitor access and managing foot traffic throughout the\nworkspace.\n\n## Let's Connect\n\nFill in the form to learn more about our software solutions for workplace\nsafety and security.\n\nRequest Information\n\nBook a demo\n\nFirst Name\n\nLast Name\n\nCompany\n\nJob Title\n\nEmail address\n\nTelephone\n\nCountry\n\nTell us about your requirements\n\nTerms of use\n\nBy clicking submit, you agree to our terms and conditions and consent to being\ncontacted by MRI Software about our products or services. You can opt-out at\nany time. Please see our privacy policy for more information about how MRI\nSoftware handles your personal information.\n\nSubmit\n\n## Call 1 800 321 8770 today\n\nSpeak to an expert about our visitor management system.\n\n**Global Sites**Global/USCanadaUKIrelandSouth AfricaAustraliaNew\nZealandSingaporeHong KongIndia\n\n **MRI Companies**RentPaymentCheckpointIDMRI Contract Intelligence\n\n **Services**myMRIClient SupportMRI Cloud Status\n\n **Company**ContactCareersJob Openings\n\n **Resources**BlogNewsWebinarsEventsMRI Training\n\nMRI Software Home\n\nGlobal Headquarters\n\n28925 Fountain Parkway  \nSolon, OH 44139  \nUnited States\n\nSales 1 800 321 8770\n\nFacebookTwitterYouTubeLinkedIn\n\nUS: 1 800 321 8770Canada: 1 800 321 8770UK: +44 (0)20 3861 7100South Africa:\n+27 21 686 3145 Australia: +61 2 8915 5000Singapore: +65 6932 2930\n\n  * Privacy Policy (Americas, Asia, Australasia)\n  * Terms of Use\n  * OnLocation Terms\n  * Sitemap\n  * Cookies\n  * Don’t Sell My Personal Info\n\n  \n© 2024 MRI Software LLC – All Rights Reserved. MRI Software LLC is a\nregistered ISO of Wells Fargo Bank, N.A., Concord, CA.\n\nClose\n\n## Select your region\n\n  * Global & US \n  * Australia \n  * Canada \n  * Hong Kong \n  * India \n  * Ireland \n  * Middle East \n  * New Zealand \n  * Singapore \n  * South Africa \n  * UK \n\n45000+\n\nClients\n\n20.1m\n\nUnits\n\n4.2m\n\nLeases\n\n300+\n\nPartners\n\n170+\n\nCountries\n\nWe use cookies to enhance your site experience, analyze site performance and\ncustomize content and advertisements.\n\nBy continuing to browse our site (by scrolling or clicking), you agree to the\nuse of these cookies. You can adjust your preferences in Cookie Settings.\n\n__\n\nChange cookie settings\n\nClose GDPR Cookie Settings\n\n  * Overview\n  * Strictly Necessary Cookies\n  * Performance Cookies\n  * Marketing Cookies\n  * Cookie Policy\n\nPowered by  GDPR Cookie Compliance\n\nOverview\n\nThis website uses cookies so that we can provide you with the best user\nexperience possible. Cookie information is stored in your browser and performs\nfunctions such as recognising you when you return to our website and helping\nour team to understand which sections of the website you find most interesting\nand useful.\n\nYou can adjust all of your cookie settings by navigating the tabs on the left\nhand side.\n\nStrictly Necessary Cookies\n\nStrictly necessary cookies should be enabled at all times. They help us make\nour website usable, enabling you to move around the site and use its features.\n\nPreferences cookies enable our website to remember information that changes\nthe way our site behaves or looks, like your preferred language or the region\nyou are in.\n\nEnable or Disable Cookies\n\nPerformance Cookies\n\nPerformance cookies help us understand how visitors interact with our website,\nby collecting and reporting information that doesn't identify you personally.\nKeeping these cookies enables us to improve our website.\n\nEnable or Disable Cookies\n\nPlease enable Strictly Necessary Cookies first so that we can save your\npreferences!\n\nMarketing Cookies\n\nMarketing cookies may be set by our advertising partners to collect\ninformation about your browsing habits. Keeping these cookies enables us to\ndisplay advertisements that are more relevant to you and your interests.\n\nEnable or Disable Cookies\n\nPlease enable Strictly Necessary Cookies first so that we can save your\npreferences!\n\nCookie Policy\n\nMore information about our Cookie Policy\n\nEnable All Save Changes\n\n",
    "links": "[{\"link\": \"https://www.mrisoftware.com/solutions/\", \"text\": \"\"}, {\"link\": \"https://www.mrisoftware.com/solutions/visitor-management-system/\", \"text\": \"\"}, {\"link\": \"https://www.mrisoftware.com/solutions/visitor-management-system/\", \"text\": \"\"}, {\"link\": \"https://www.mrisoftware.com/solutions/visitor-management-system/\", \"text\": \"Visitor\"}]"
}