{
    "summary": "__\n\n  * Software Categories\n  * Blog\n  * About Us\n  * For Vendors\n\n __\n\n __\n\nHome\n\nVisitor Management Systems\n\n# Find the best Visitor Management Systems\n\nOverview\n\nON THIS PAGE\n\n  1. Popular Comparisons\n\n  2. FrontRunners\n\n  3. Buyers Guide\n\nON THIS PAGE\n\n  1. Popular Comparisons\n\n  2. FrontRunners\n\n  3. Buyers Guide\n\n##### Filter products\n\n200 results\n\n### Filter products\n\n __\n\n#### Industry\n\nSelect your industry\n\n __ __\n\n#### Company Size\n\n  * Self-Employed\n\n  * 2-10\n\n  * 11-50\n\n  * 51-200\n\n  * 201-500\n\n  * 501-1000\n\n  * 1000+\n\n  * \\+ Show all\n\n#### Pricing Options\n\n  * $$$$$\n\n  * $$$$$\n\n  * $$$$$\n\n  * $$$$$\n\n  * $$$$$\n\n#### Sort by\n\n __\n\n **Recommendations** : Sorts listings by the number of recommendations our\nadvisors have made over the past 30 days. Our advisors assess buyers’ needs\nfor free and only recommend products that meet buyers’ needs. Vendors pay\nSoftware Advice for these referrals.  \n **Reviews** : Sorts listings by the number of user reviews we have published,\ngreatest to least.  \n **Sponsored** : Sorts listings by software vendors running active bidding\ncampaigns, from the highest to lowest bid. Vendors who have paid for placement\nhave a ‘Visit Website’ button, whereas unpaid vendors have a ‘Learn More’\nbutton.  \n **Avg Rating** : Sorts listings by overall star rating based on user reviews,\nhighest to lowest.  \n **A to Z** : Sorts listings by product name from A to Z.\n\n  * Sponsored\n\n  * # of User Reviews\n\n  * Average Rating\n\n  * Alphabetically (A-Z)\n\n  * Frontrunners\n\nClearShow 200 Products\n\n## Compare Products\n\nShowing 1 - 20 of 200 products\n\n __Sort and Filter\n\nSort by\n\n __\n\n **Recommendations** : Sorts listings by the number of recommendations our\nadvisors have made over the past 30 days. Our advisors assess buyers’ needs\nfor free and only recommend products that meet buyers’ needs. Vendors pay\nSoftware Advice for these referrals.  \n **Reviews** : Sorts listings by the number of user reviews we have published,\ngreatest to least.  \n **Sponsored** : Sorts listings by software vendors running active bidding\ncampaigns, from the highest to lowest bid. Vendors who have paid for placement\nhave a ‘Visit Website’ button, whereas unpaid vendors have a ‘Learn More’\nbutton.  \n **Avg Rating** : Sorts listings by overall star rating based on user reviews,\nhighest to lowest.  \n **A to Z** : Sorts listings by product name from A to Z.\n\nSponsored __\n\n### Honeywell Forge Visitor Management\n\n### Honeywell Forge Visitor Management\n\nHoneywell Forge Performance+ for Buildings | Visitor and Contractor Management\nis a modern visitor management system enabling a streamlined, secure check-in\nexperience for visitors, contractors, and staff. Visitors simply check ...Read\nmore about Honeywell Forge Visitor Management\n\n **4.4** (593 reviews)\n\nStarting Price: $69.00 per month\n\n __Free version unavailable\n\n __Free trial available\n\nCompare\n\nVisit Website\n\n### Sign In App\n\n### Sign In App\n\nSign In App is a smart visitor management solution helping businesses and\nschools keep track of their visitors and employees. As guests and team members\nsign in, their details are automatically stored in your secure online portal\n...Read more about Sign In App\n\n **4.9** (102 reviews)\n\nStarting Price: $436.00 per year\n\n __Free version unavailable\n\n __Free trial available\n\nCompare\n\nVisit Website\n\n### SwipedOn\n\n### SwipedOn\n\n __FrontRunners 2023\n\nSwipedOn is the world's easiest, most loved flexible workplace management\nsystem for Apple and Android. Manage your visitors, employees, resources and\nmore. Customize the logo, colors and backgroundto match your branding. Sync\nm...Read more about SwipedOn\n\n **4.8** (296 reviews)\n\nStarting Price: Available upon request\n\n __Free version unavailable\n\n __Free trial available\n\nCompare\n\nVisit Website\n\n### HID Visitor Management Solutions\n\n### HID Visitor Management Solutions\n\nWorkforceID Visitor Manager is cloud-based software, which helps small and\nmedium businesses in transportation, energy, healthcare, education and other\nsectors manage physical and digital identity access. The solution enables\nadmi...Read more about HID Visitor Management Solutions\n\n **5.0** (1 reviews)\n\nStarting Price: $6,000.00 per year\n\n __Free version unavailable\n\n __Free trial available\n\nVisit Website\n\n### The Receptionist for iPad\n\n### The Receptionist for iPad\n\n __FrontRunners 2023\n\nThe Receptionist for iPad is a cloud-based visitor management solution that\nserves businesses of all sizes across all industries. The primary features of\nThe Receptionist are visitor logs, visitor badges, visitor notifications\n(vi...Read more about The Receptionist for iPad\n\n **4.8** (314 reviews)\n\nStarting Price: $55.00 per month\n\n __Free version unavailable\n\n __Free trial available\n\nCompare\n\nVisit Website\n\n### HSI Donesafe\n\n### HSI Donesafe\n\nHSI Donesafe is the single source of truth that satisfies infinite EHSQ use-\ncases across every imaginable industry, all while driving record levels of\nengagement rates. Health & Safety leaders who are in a data...Read more about\nHSI Donesafe\n\n **4.7** (69 reviews)\n\nStarting Price: Available upon request\n\n __Free version unavailable\n\n __Free trial available\n\nCompare\n\nVisit Website\n\n### Qminder\n\n### Qminder\n\n __FrontRunners 2023\n\nQminder is a cloud-based queue management platform that helps businesses\ndeliver memorable waiting experiences. Manage customer queues via onsite\ncheck-in kiosks and real-time status updates. Qminder lets customers queue up\nremot...Read more about Qminder\n\n **4.8** (82 reviews)\n\nStarting Price: $389.00 per month\n\n __Free version unavailable\n\n __Free trial available\n\nCompare\n\nVisit Website\n\n### FMS:Visitor\n\n### FMS:Visitor\n\nFMS:Visitor is a solution that reduces security and compliance risk while\nimproving an organization’s brand. With intuitive check-in kiosks and a\nvariety of options including parcel management, FMS:Visitor allows companies\nto crea...Read more about FMS:Visitor\n\nNo reviews yet\n\nStarting Price: Available upon request\n\n __Free version unavailable\n\n __Free trial unavailable\n\nVisit Website\n\n### GymMaster\n\n### GymMaster\n\nGymMaster is a cloud-based gym and health club member management system\ndesigned for gyms, fitness studios and clubs of all sizes. Key features\ninclude membership management, administrative task management, automated\nmarketing, re...Read more about GymMaster\n\n **4.7** (152 reviews)\n\nStarting Price: $89.00 per month\n\n __Free version available\n\n __Free trial available\n\nCompare\n\nVisit Website\n\n### Brivo Access\n\n### Brivo Access\n\nLooking for access control and proptech solutions to improve security and add\ntechnology to the building? Add cloud-based access control and make spaces\nsmart with a platform that brings keyless entry, mobile credentials, remote\ns...Read more about Brivo Access\n\n **4.3** (49 reviews)\n\nStarting Price: Available upon request\n\n __Free version unavailable\n\n __Free trial unavailable\n\nCompare\n\nVisit Website\n\n### inspace\n\n### inspace\n\ninspace is a highly adaptable workplace platform that has been designed with\nyour unique requirements in mind! In today's fast-paced work environment, we\nunderstand the importance of having a seamless and efficient system to\nmanag...Read more about inspace\n\n **4.1** (14 reviews)\n\nStarting Price: Available upon request\n\n __Free version unavailable\n\n __Free trial available\n\nVisit Website\n\n### KeepnTrack\n\n### KeepnTrack\n\nKeepnTrack is a cloud-based visitor management software suitable for\ninstitutions such as schools, hospitals, retirement homes and summer camps of\nall sizes. The key features of this solution include visitor tracking, visitor\nback...Read more about KeepnTrack\n\n **4.2** (13 reviews)\n\nStarting Price: Available upon request\n\n __Free version unavailable\n\n __Free trial unavailable\n\nVisit Website\n\n### Genea Access Control\n\n### Genea Access Control\n\nGenea Access Control is a cloud-based access control software designed to help\nsmall businesses to large enterprises ensure the security of access across\nbuilding facilities. Key features include attendance reports, credential\nman...Read more about Genea Access Control\n\n **4.8** (20 reviews)\n\nStarting Price: Available upon request\n\n __Free version unavailable\n\n __Free trial unavailable\n\nVisit Website\n\n### MyLobby\n\n### MyLobby\n\nDesigned with the needs of modern businesses in mind, MyLobby offers a\ncomprehensive visitor management system that combines cutting-edge technology\nwith user-friendly features to create a seamless experience for visitors and\nempl...Read more about MyLobby\n\n **4.9** (14 reviews)\n\nStarting Price: $70.00 per month\n\n __Free version available\n\n __Free trial available\n\nVisit Website\n\n### SphereMail\n\n### SphereMail\n\nSphereMail's mailroom solution automates the process of organizing,\ndistributing, and tracking postal mail for corporate employees and their\ncustomers. SphereMail's full-stack API allows the adoption of its cutting-edge\ntechnolog...Read more about SphereMail\n\n **4.6** (11 reviews)\n\nStarting Price: Available upon request\n\n __Free version unavailable\n\n __Free trial available\n\nVisit Website\n\n### TeleSign Platform\n\n### TeleSign Platform\n\nTeleSign connects and protects online experiences with sophisticated customer\nidentity and engagement solutions to enables businesses to register accounts,\nverify phone numbers, identify users, prevent fraud, streamline customer\ne...Read more about TeleSign Platform\n\n **5.0** (1 reviews)\n\nStarting Price: Available upon request\n\n __Free version unavailable\n\n __Free trial available\n\nVisit Website\n\n### Visitly\n\n### Visitly\n\nVisitly is a cloud-based visitor management solution for contractors,\nemployees, visitors and customers to sign in and out. The solution is also\navailable as an iPad app that can be used at the lobby or front desk. Key\nfeatures in...Read more about Visitly\n\n**4.6** (20 reviews)\n\nStarting Price: $59.00 per month\n\n __Free version unavailable\n\n __Free trial available\n\nVisit Website\n\n### Robin\n\n### Robin\n\nRobin Powered is a cloud-based scheduling solution that caters to businesses\nacross various industries such as real estate, consumer electronics,\nmarketing, advertising, finance, information technology and more. Key features\ninclu...Read more about Robin\n\n **4.7** (55 reviews)\n\nStarting Price: Available upon request\n\n __Free version unavailable\n\n __Free trial available\n\nCompare\n\nVisit Website\n\n### NOVIDIC\n\n### NOVIDIC\n\nNOVIDIC is a visitor tracking solution that utilizes QR code technology to\nhelp businesses and public spaces manage visitor registration and arrivals.\nThe platform allows supervisors to monitor visitor data and generate QR codes\nf...Read more about NOVIDIC\n\n **5.0** (3 reviews)\n\nStarting Price: $9.99 per month\n\n __Free version available\n\n __Free trial available\n\nVisit Website\n\n### MRI OnLocation\n\n### MRI OnLocation\n\nOnLocation is an app that allows you to easily set up mobile check-in for all\nyour employees, visitors, and contractors with just one click. It also allows\nyou to manage desk booking for both internal and external users, so\neveryo...Read more about MRI OnLocation\n\n **4.7** (62 reviews)\n\nStarting Price: $55.00 per month\n\n __Free version unavailable\n\n __Free trial available\n\nCompare\n\nVisit Website\n\nView all products\n\n## Popular Comparisons\n\nFareHarbor\n\n _VS_\n\nHoneywell Forge Visitor Management\n\nEnvoy\n\n _VS_\n\nWeTravel\n\nProxyclick\n\n _VS_\n\nThe Receptionist for iPad\n\nSwipedOn\n\n _VS_\n\nSkedda\n\n## Your Guide to Top Visitor Management Systems, September 2023\n\nSoftware Advice uses reviews from real software users to highlight the top-\nrated Visitor Management Systems products in North America.\n\nLearn how products are chosen\n\n#### Explore FrontRunners\n\nHistory:September 2023 (current)July 2022July 2021November 2020\n\n  * Othership\n  * The Receptionist for iPad\n  * WaitWell\n  * WorkInSync\n  * Eden Workplace\n  * Qminder\n  * Nspace\n  * Kadence\n  * Vizito Visitor Management System\n  * SwipedOn\n\n“Usability” includes user ratings for Functionality and Ease of Use.\n\n“Customer Satisfaction” includes user ratings for Customer Support, Likelihood\nto Recommend and Value for Money.\n\nReviews analysis period: The reviews analysis period spans two years and ends\nthe 15th of the month prior to publication.\n\n## Buyers Guide\n\nLast Updated: March 16, 2023\n\nBuilding security is critical for any organization, especially when visitor\naccess to company facilities is necessary for meetings or events.\n\nSimilar to software that manages reservations for hospitality, a visitor\nmanagement system (VMS) helps manage and track visitors, allows selective\naccess to buildings and improves the overall visitor experience.\n\nThis buyer’s guide is intended to help those seeking a VMS. We’ll cover:\n\nWhat Is a Visitor Management System?\n\nCommon Features of a Visitor Management System\n\nWhat Type of Buyer Are You?\n\nKey Considerations\n\nPricing and Purchasing Options\n\n## What Is a Visitor Management System?\n\nA VMS helps manage the flow of visitors into a company’s facilities or other\nlocations. As visitors arrive, they can use a kiosk loaded with a VMS to self-\nregister for a meeting or event. Visitor identification, such as a photo ID or\nbusiness card, can also be scanned and checked against a watch list to\nincrease security. Additionally, administrative personnel can use the solution\nto manage assets, such as keys and access cards assigned to visitors. Each\nitem can be individually tagged to mitigate the risk of loss or theft.\n\n _A contractor uses a Sine VMS kiosk to check in for a meeting (Source:\nsine.co)_\n\nOnce the system clears a person for entry, they can print a customized name\ntag or visitor badge that will allow them access to any area the company\ndetermines.\n\nThe system can also notify an employee that their guest has arrived and offer\nthe guest directions to a meeting room or display a directory. In the case of\nemergency evacuations, security supervisors and floor wardens can sign people\nout of the building premises securely using an electronic verification\nprocess.\n\nOver time, visitor data can be collected for return visits and reporting\npurposes.\n\n## Common Features of a Visitor Management System\n\nFeatures vary among top VMS software platforms, but the following features are\nmost common:\n\n **Visitor screening**\n\n|\n\nA VMS screens visitors against local or online watch lists. Schools and day\ncares often use a VMS to prevent entry or alert security officials if a\nregistered sex offender attempts to enter.  \n  \n---|---  \n  \n **Preregistration**\n\n|\n\nVMS users can enable pre-registration, which emails guests ahead of their\nvisit. These emails can include dates, times, directions, parking information\nand other details that help visitors get to their meetings quickly.  \n  \n **Self check-in**\n\n|\n\nGuests can self-register by using a tablet kiosk or smartphone as they enter\nthe building. These visitor-facing interfaces can be customized with company\nlogos or special instructions.  \n  \n **ID scanning and badging**\n\n|\n\nInstead of entering information with a keypad, visitors can scan their\nbusiness card or other photo identification to check in. A VMS can instantly\nprint a name tag to give guests access to their intended destination in a\nbuilding.  \n  \n **Electronic documents**\n\n|\n\nA company can ask visitors to digitally sign documents when checking in, such\nas a non-disclosure agreement to protect sensitive corporate information.  \n  \n **Visitor tracking and reporting**\n\n|\n\nThe system can retain information about each person, such as arrival and\ndeparture time, duration of visit and more. This data is useful for\ndetermining the location of a visitor or generating reports on attendance, for\nexample.  \n  \n **Notifications**\n\n|\n\nAfter a visitor checks in, the system can notify the employee they are\nscheduled to meet with, so meetings can start on time.  \n  \n **Embedded database**\n\n|\n\nA VMS comes integrated with an embedded database where all data is stored\nlocally. This eliminates the need of any connections with third-party database\nsystems or setting up preregistration tools, as visitor information is stored\nby the system.  \n  \n## What Type of Buyer Are You?\n\nYour industry determines the features and extras that can be useful for your\norganization. A variety of industries may use a VMS to increase security and\nefficiency in their facilities, such as:\n\n **K-12 education.** Primary school VMS users can benefit from ID cards\ncustomized with the school’s logo for faculty and name badges for students.\nThis helps increase transparency among students and faculty and prevent entry\nfor those who have no official business at the school.\n\n **University campus.** Campus security is a top priority. Using a VMS, higher\neducation campuses can maintain secure facilities with access control so that\nonly professors and administrators are allowed into sensitive areas.\n\n **Corporate and government.** Companies and government organizations can keep\ndata and hardware secure with access control, as well as improve the visitor\nexperience for nonemployees by providing directions and other information to\nhelp them reach their meetings on time.\n\n## Key Considerations\n\nA VMS often requires the use of extra hardware and other accessories so\nvisitors can check in, print name tags and gain access to buildings. These can\ninclude:\n\n **Kiosk computers.** A receptionist can greet visitors and use a VMS to check\nthem in. However, for companies or organizations with a high volume of guests,\nevents and meetings, setting up a kiosk for self check in can speed up the\ncheck-in process.\n\n **Printers.** Guests can be identified visually with customized name tags\nprinted on a specialized printer, located either behind the reception desk or\nnext to a self-service kiosk.\n\n **ID cards and keytags.** For frequent visitors, companies may decide to\nissue permanent plastic ID cards or keytags, which are small plastic tags\nguests can scan upon entry.\n\n _An ID badge printed using Proxyclick’s Visitor Management (Source:\nProxyclick.com)_\n\n## Pricing and Purchasing Options\n\nMost systems require a monthly payment, but may differ on how that payment is\ncalculated. Here are some common pricing models:\n\n  *  **Per lobby, location or room.** Many systems offer pricing that increases with the number of lobbies the user needs to manage. Additional features or support services are available as pricing scales.\n\n  *  **Per visits or contacts.** Fewer VMS vendors price their systems in this way. However, if you have a small business with infrequent visitors, a system priced in this way may be more affordable.\n\nIt’s important to note that some vendors combine these pricing structures,\ne.g., a basic package may charge a flat monthly price for one lobby location\nand up to 25 visitors per day. Evaluate system providers to determine the plan\nthat makes the most sense for your needs.\n\n  * About Us\n\n  * Careers\n\n  * Vendors\n\n  * Blog\n\n  * View All Categories\n\n  * © 2006-2024 Software Advice, Inc.\n\n  * User Terms\n\n  * Vendor Terms\n\n  * Community Guidelines\n\n  * Content Policy\n\n  * Content Policy FAQs\n\n  * Cookie Policy\n\n  * Privacy Policy\n\n  * Data Protection Agreement\n\n## Privacy Preference Center\n\nWhen you visit any website, it may store or retrieve information on your\nbrowser, mostly in the form of cookies. This information might be about you,\nyour preferences or your device and is mostly used to make the site work as\nyou expect it to. The information does not usually directly identify you, but\nit can give you a more personalized web experience. Because we respect your\nright to privacy, you can choose not to allow some types of cookies. Click on\nthe different category headings to find out more and change our default\nsettings. However, blocking some types of cookies may impact your experience\nof the site and the services we are able to offer.  \nMore information\n\nAllow All\n\n###  Manage Consent Preferences\n\n#### Performance Cookies\n\nAlways Active\n\nThese cookies allow us to count visits and traffic sources so we can measure\nand improve the performance of our site. They help us to know which pages are\nthe most and least popular and see how visitors move around the site. All\ninformation these cookies collect is aggregated and therefore anonymous. If\nyou do not allow these cookies we will not know when you have visited our\nsite, and will not be able to monitor its performance.\n\n#### Functional Cookies\n\nAlways Active\n\nThese cookies enable the website to provide enhanced functionality and\npersonalisation. They may be set by us or by third party providers whose\nservices we have added to our pages. If you do not allow these cookies then\nsome or all of these services may not function properly.\n\n#### Strictly Necessary Cookies\n\nAlways Active\n\nThese cookies are necessary for the website to function and cannot be switched\noff in our systems. They are usually only set in response to actions made by\nyou which amount to a request for services, such as setting your privacy\npreferences, logging in or filling in forms. You can set your browser to block\nor alert you about these cookies, but some parts of the site will not then\nwork. These cookies do not store any personally identifiable information.\n\n#### Targeting Cookies\n\nAlways Active\n\nThese cookies may be set through our site by our advertising partners. They\nmay be used by those companies to build a profile of your interests and show\nyou relevant adverts on other sites. They do not store directly personal\ninformation, but are based on uniquely identifying your browser and internet\ndevice. If you do not allow these cookies, you will experience less targeted\nadvertising.\n\nBack Button\n\n### Cookie List\n\nSearch Icon\n\nFilter Icon\n\nClear\n\ncheckbox label label\n\nApply Cancel\n\nConsent Leg.Interest\n\ncheckbox label label\n\ncheckbox label label\n\ncheckbox label label\n\nConfirm My Choices\n\n",
    "links": "[{\"link\": \"https://www.softwareadvice.com/visitor-management/sine-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/sine-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/sine-profile/reviews/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/sign-in-app-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/sign-in-app-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/sign-in-app-profile/reviews/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/swipedon-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/swipedon-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/swipedon-profile/reviews/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/hid-workforceid-visitor-manager-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/hid-workforceid-visitor-manager-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/hid-workforceid-visitor-manager-profile/#reviews\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/the-receptionist-for-ipad-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/the-receptionist-for-ipad-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/the-receptionist-for-ipad-profile/reviews/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/donesafe-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/donesafe-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/donesafe-profile/reviews/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/qminder-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/qminder-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/qminder-profile/reviews/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/fms-visitor-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/fms-visitor-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/gymmaster-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/gymmaster-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/gymmaster-profile/reviews/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/brivo-access-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/brivo-access-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/brivo-access-profile/reviews/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/inspace-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/inspace-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/inspace-profile/reviews/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/keepntrack-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/keepntrack-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/keepntrack-profile/reviews/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/genea-access-control-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/genea-access-control-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/genea-access-control-profile/reviews/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/mylobby-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/mylobby-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/mylobby-profile/reviews/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/spheremail-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/spheremail-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/spheremail-profile/reviews/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/telesign-platform-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/telesign-platform-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/telesign-platform-profile/#reviews\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/visitly-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/visitly-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/visitly-profile/reviews/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/robin-powered-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/robin-powered-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/robin-powered-profile/reviews/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/novidic-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/novidic-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/novidic-profile/#reviews\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/mri-onlocation-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/mri-onlocation-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/mri-onlocation-profile/reviews/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/p/all/\", \"text\": \"View all products\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/fareharbor-profile/vs/sine/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/envoy-profile/vs/wetravel/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/proxyclick-profile/vs/the-receptionist-for-ipad/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/skedda-profile/vs/swipedon/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/othership-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/othership-profile/\", \"text\": \"Othership\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/the-receptionist-for-ipad-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/the-receptionist-for-ipad-profile/\", \"text\": \"The Receptionist for iPad\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/waitwell-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/waitwell-profile/\", \"text\": \"WaitWell\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/workinsync-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/workinsync-profile/\", \"text\": \"WorkInSync\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/eden-workplace-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/eden-workplace-profile/\", \"text\": \"Eden Workplace\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/qminder-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/qminder-profile/\", \"text\": \"Qminder\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/nspace-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/nspace-profile/\", \"text\": \"Nspace\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/chargifi-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/chargifi-profile/\", \"text\": \"Kadence\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/vizito-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/vizito-profile/\", \"text\": \"Vizito Visitor Management System\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/swipedon-profile/\", \"text\": \"\"}, {\"link\": \"https://www.softwareadvice.com/visitor-management/swipedon-profile/\", \"text\": \"SwipedOn\"}]"
}