{
    "summary": "Skip to main content\n\nCustomer Support SecureStat HQ Login\n\nBelgium (Dutch) Belgium (French) Canada (English) Canada (French) Denmark\n(Danish) Finland (Finnish) France (French) Ireland (English) Netherlands\n(Dutch) Norway (Norwegian) Sweden (Swedish) United Kingdom (English) United\nStates (English)\n\nSearch\n\nContact Us\n\nSearch\n\nSearch\n\nSearch\n\nBelgium (Dutch) Belgium (French) Canada (English) Canada (French) Denmark\n(Danish) Finland (Finnish) France (French) Ireland (English) Netherlands\n(Dutch) Norway (Norwegian) Sweden (Swedish) United Kingdom (English) United\nStates (English)\n\nSearch Toggle navigation\n\nMain navigation\n\n  * Solutions\n\n    * Solutions\n\n    * Top Solutions \n\nSee All\n\n      *       * Video Surveillance\n\n      * Access Control\n\n      * Electronic Article Surveillance\n\n      * Intrusion Systems\n\n      * Visitor Management\n\n      * Weapons & Threat Detection\n\n      * Security Monitoring\n\n      * Workplace Management\n\n  * Services\n\n    * Services\n\n    * Fire and Emergency Preparedness\n\n    * Interactive Security Monitoring\n\n    * Service and Maintenance\n\n    * Video Verification\n\n    * Security Management Platforms\n\n  * Industries\n\n    * Industries\n\n    * Top Industries \n\nSee All\n\n      *       * Manufacturing & Logistics\n\n      * Utilities & Energy\n\n      * Retail\n\n      * Commercial Offices\n\n      * Finance & Banking\n\n      * Healthcare\n\n      * Data Centers\n\n      * BioTech & Pharma\n\n      * Government\n\n  * Resources\n\n    * Resources\n\n    * Customer Support\n\n    * Knowledge Center\n\n    * Careers\n\n    * Blog\n\n    * News\n\n  * Who We Are\n\n    * Who We Are\n\n    * Who We Are \n\n      *       * About Us\n\n      * Why Securitas Technology?\n\n      * Technology Innovation\n\n      * Who We Serve\n\n      * Engineering Center of Excellence\n\n      * Global Clients Program\n\n      * Securitas Protective Services \n\n      * Meet Our Team\n\n  * 2024 Technology Report\n\nCustomer Support SecureStat HQ Login\n\nContact Us\n\n  1. Home\n  2. Solutions\n  3. Visitor Management \n\n#  Visitor Management\n\nCreate and automate a professional, safe, and inviting visitor experience with\nour visitor management systems and solutions.\n\nOverview\n\nOverview Benefits Resources FAQs\n\nGet a Quote\n\n##  Visitor Management Systems to Power a Safer Workplace\n\nManaging who enters and leaves your building can be quite time-consuming and\ncostly. And without automation, you could have long wait times and a\ncumbersome process for your visitors, which leads to a poor experience.\n\n##  Protect Your People and Your Property\n\nKnow exactly who is entering and exiting your facility. Gain confidence that\nall those entering meet your protocols and criteria to ensure a safe workplace\nenvironment.\n\n\n\n##  Streamline the Visitor Experience\n\nSave time and money by eliminating manual steps and the need for paper or\ndedicated staff by streamlining and digitizing processes, workflows, and\nreports.\n\n##  Scalable for Your Evolving Business\n\nThe market and your business processes are ever-changing. You need a visitor\nsolution that is scalable and flexible to meet these new demands to help\nprovide a healthy, safe, and secure workplace.\n\n\n\n##  Manage Your Workplace\n\nSecuritas Technology Visitor Management technology also empowers you to manage\nthe workplace for safety and efficiency. Workplace Management solutions help\nstreamline daily screening and tasks like workspace reservation.\n\n\n\nBenefits\n\n##  The Advantages of Visitor Management\n\nStart with one location or one hundred — Visitor management can grow as your\nbusiness grows.\n\n###  Simple, Flexible & Scalable\n\nMeet the needs of today and prepare for tomorrow with a flexible system you\ncan scale depending on your requirements.\n\n###  Automated Reporting & Dashboards\n\nUse the activity dashboard to monitor visitors and employees in real-time.\nQuickly notify your staff when a potential threat is detected.\n\n###  Ensure Compliance\n\nImplement the signing of a waiver as part of your visitor management system.\n\n###  Decrease Administrative Costs\n\nSave time and money by automating visitor management, eliminating the need to\nmanually screen and record each visitor.\n\nShow More\n\nWhy Securitas Technology?\n\n##  Experts in Visitor Management Solutions\n\n  * One Integrated System\n  * Committed to Quality\n  * Expertise Across Industries\n\nCreating a Unified Ecosystem\n\nAs with any tailored solution, there is no “one size fits all” system.\nCustomer requirements, physical building attributes and assets can all change\nhow our security experts approach designing your security system. Whether your\ninstitution has an existing system in place or you need to start from scratch,\nour experts will work with your in-house teams to ensure your needs are met\nand you have a fully integrated system.  \n\nWe’re Focused on Meeting Your Needs\n\nFinding the right solution for your business requires an in-depth\nunderstanding of the needs of your organization. Our security experts work\nclosely with you to learn your specific requirements and consider your needs\nfor scalability, functionality, features, and any special requirements before\nproposing the most cost-effective solution.\n\nA Versatile Portfolio of Partners\n\nOur knowledgable, certified security professionals have worked with clients\nranging from local stores and small retail chains to Fortune 500 companies and\ngovernment agencies. This range of expertise across industries gives us the\nexperience needed to identify security issues for any type of facility, and\nrecommend effective solutions.\n\nA Versatile Portfolio of Partners\n\nOur knowledgable, certified security professionals have worked with clients\nranging from local stores and small retail chains to Fortune 500 companies and\ngovernment agencies. This range of expertise across industries gives us the\nexperience needed to identify security issues for any type of facility, and\nrecommend effective solutions.\n\nCreating a Unified Ecosystem\n\nAs with any tailored solution, there is no “one size fits all” system.\nCustomer requirements, physical building attributes and assets can all change\nhow our security experts approach designing your security system. Whether your\ninstitution has an existing system in place or you need to start from scratch,\nour experts will work with your in-house teams to ensure your needs are met\nand you have a fully integrated system.  \n\nWe’re Focused on Meeting Your Needs\n\nFinding the right solution for your business requires an in-depth\nunderstanding of the needs of your organization. Our security experts work\nclosely with you to learn your specific requirements and consider your needs\nfor scalability, functionality, features, and any special requirements before\nproposing the most cost-effective solution.\n\nA Versatile Portfolio of Partners\n\nOur knowledgable, certified security professionals have worked with clients\nranging from local stores and small retail chains to Fortune 500 companies and\ngovernment agencies. This range of expertise across industries gives us the\nexperience needed to identify security issues for any type of facility, and\nrecommend effective solutions.\n\nCreating a Unified Ecosystem\n\nAs with any tailored solution, there is no “one size fits all” system.\nCustomer requirements, physical building attributes and assets can all change\nhow our security experts approach designing your security system. Whether your\ninstitution has an existing system in place or you need to start from scratch,\nour experts will work with your in-house teams to ensure your needs are met\nand you have a fully integrated system.  \n\nWe’re Focused on Meeting Your Needs\n\nFinding the right solution for your business requires an in-depth\nunderstanding of the needs of your organization. Our security experts work\nclosely with you to learn your specific requirements and consider your needs\nfor scalability, functionality, features, and any special requirements before\nproposing the most cost-effective solution.\n\nA Versatile Portfolio of Partners\n\nOur knowledgable, certified security professionals have worked with clients\nranging from local stores and small retail chains to Fortune 500 companies and\ngovernment agencies. This range of expertise across industries gives us the\nexperience needed to identify security issues for any type of facility, and\nrecommend effective solutions.\n\nPrevious Next\n\nRelated Resources\n\n##  Our Visitor Management Insights\n\nVisitor Management Systems\n\n###  Visitor Management Systems: Benefits You May Not Know About\n\nNow more than ever, businesses are looking to their security systems to\nreinforce business policies – from updating their access control systems to\nreflect threat mitigation policies to leveraging...\n\nLearn More\n\nVisitor Management Systems\n\n###  How Visitor Management Software Makes a Happier Customer and Employee\n\nIt’s time to consider other security measures besides front-desk personnel.\nThe right screening technology can help you with not only visitor management\nbut workplace management as well.\n\nLearn More\n\n##  FAQs\n\n  * 01\n  * 02\n  * 03\n\n  * 01\n  * 02\n  * 03\n\nWhat is visitor management?\n\nVisitor management is the proactive screening of every individual who crosses\nyour organization’s threshold. There are different methods for visitor\nscreening, from I.D. badges to electronic registration.  \n\nWhat is visitor management software?\n\nVisitor management software is a way to digitize how organizations manage and\ntrack visitors. Different components can include:\n\n  * I.D. Scanning \n\n  * Electronic logbooks \n\n  * Facial recognition technology \n\n  * Mobile-card readers\n\nHow does a visitor management system work?\n\nA visitor management system is a cloud-based solution that integrates a\nvariety of hardware for you to plan and manage the visitor experience.  \n\nVisitor management can begin even before a person enters the building. Your\ncan enter planned visits into an electronic logbook and send customized access\ninformation to guests.\n\nOnce a person arrives, they can check-in at a self-serve kiosk where they can\nbe asked to complete a screening questionnaire, or they can be welcomed at\nreception where their ID is scanned, and a visitor pass issued. You can also\nintegrate the solution into your access control system to grant temporary\naccess to parts of your facility.  \n\nA visitor management system also helps you keep track of who is in your\nfacility, while also helping you keep sensitive information secure. You’ll\nhave analytics on who’s visiting and visitor volumes, and gain insight into\ntrends and patterns.\n\nWhy is visitor management important?\n\nCreating an environment where your customers and employees feel safe and\nsecure is extremely important. Visitor Management is the process of keeping\ntrack of who is on-site so that everyone can feel more confident that visitors\nhave been consistently processed and screened to ensure compliance and\nincreased safety.\n\nCan I integrate a visitor management solution with my existing security\nsystem?\n\nYes, our visitor management solution can integrate with your existing access\ncontrol and identity systems, including human resources, email and calendar,\nmass notification and guest Wi-Fi management systems. You will benefit from\navoiding costly rip and replace activities to extend the usability of your\ncurrent technologies. An access control system that integrates with a visitor\nmanagement system can be a powerful combination to help you give or take away\naccess for a visitor, to ultimately keep areas of the facility secure.\n\nHow do you manage visitors?\n\nYour approach to visitor management starts with defining your goals. Are you\ntying to facilitate timed meetings or events? Do you need to screen for\nsecurity and health? Is it important to create highly personalized and\ncustomized experiences? What is your need for insight and analytics into the\nvisitor experience?\n\nOnce you have answered these questions, you can create visitor management\nprocedures and implement the right visitor management technology tailored to\nyour organization. For example, to assess the health of new entrants, you can\nhave health questionnaires or a temperature screening system. If you want to\ndeploy touchless screening systems, set up mobile card readers to scan I.D.s.\n\nWhy is an automated visitor management system better than a manual one?\n\nThe biggest advantage of automating visitor management is that it accurately\nidentifies and tracks visitors, keeping your building secure and your\nemployees safe. An automated system drives operational efficiencies by\nreducing administrative costs including any costs associated with a potential\nsecurity breach, along with saving time. An automated software allows you to\nidentify anyone who is in your building at any time and to help ensure\ncompliance. Additionally, you have access to data to analyze and understand\nvisitor patterns or be able to search history. Having visitor management\nautomated allows visitors as they enter your lobby a more pleasant on-site\nexperience along with a seamless pre-registration experience.\n\nWhat to look for in a visitor management system?\n\nWhen you’re choosing a visitor management system, confirm that it will\naccomplish—and hopefully exceed—your security and monitoring goals.  \n\nGo beyond standalone systems—your system should be easy to integrate with your\nother security platforms, such as fire detection and access control.\nScalability is also essential. You’ll want your system to support your\norganization’s evolving needs, including expanding to other sites.  \n\nWhat are visitor management techniques?\n\nSecurity is just one aspect of successful visitor management. Fundamentally,\nvisitor management is about creating the right experience for your visitors\nand empowering your staff to deliver great experiences time after time. Map\nout your desired visitor touchpoints and then determine how they will happen.\n\nFor example, you may want a visitor kiosk where people can fill out pre-\nregistration forms. The system can notify employees who are expecting a\nvisitor when they arrive. You can also verify if the visitor is approved to\ncome in by checking it against a prohibited visitors list.  \n\nCloud and mobile devices can help to streamline the identification process.\nAlso decide if you want screening technology to identify people through face\nmasks or check their temperature.  \n\nTurn to your visitor management technology to enable automation and digitize\nmanual processes for accuracy and efficiency. Your goal? A positive, safe, and\ninviting visitor experience.  \n\nRelated Solutions\n\n##  Frequently Bundled With\n\nExplore Solutions\n\n###  Video Surveillance\n\nKeep an eye on your business from anywhere, any time with Securitas\nTechnology, one of the top verified video surveillance companies.\n\nLearn more\n\n###  Professional Integrated Security Services\n\nFrom security system integration to security risk assessments, Securitas\nTechnology offers a wide range of professional and managed services.\n\nLearn more\n\n###  Workplace Management Solutions\n\nIntegrate workplace management into your existing security for a safer,\nhealthier and more flexible environment.\n\nLearn more\n\nPrevious Next\n\nPrevious Next\n\n##  Get Started With Visitor Management Today\n\nGet in Touch\n\n## Company\n\n  * About\n  * Our Brands\n  * Locations\n  * News\n  * Careers\n\n## Resources\n\n  * Knowledge Center\n  * Blog\n  * Pay My Bill\n\n## Policies\n\n  * Responsible Disclosure\n  * Licenses\n  * Privacy Policy\n\n## Get Connected\n\nStay up-to-date on Securitas Technology insights, news and events.\n\n*\n\nEmail:\n\nBy submitting your information, you agree to receiving communications from\nSecuritas Technology and to our use of your data in accordance with our\nPrivacy Policy.\n\nGet Instant Access\n\n  * view our facebook page \n  * view our twitter page \n  * view our linkedin page \n  * view our youtube channel \n\n© 2023 Securitas Technology\n\nThis website uses cookies to enhance user experience and to analyze\nperformance and traffic on our website. We also share information about your\nuse of our site with our social media, advertising and analytics partners.\n\nDo Not Sell My Personal Information Accept Cookies\n\n## Do Not Share My Personal Information\n\nYour Opt Out Preference Signal is Honored\n\n  * ### Your Privacy\n\n  * ### Strictly Necessary Cookies\n\n  * ### Functional Cookies\n\n  * ### Performance Cookies\n\n  * ### Targeting Cookies\n\n  * ### Social Media Cookies\n\n#### Your Privacy\n\nWhen you visit our website, we store cookies on your browser to collect\ninformation. The information collected might relate to you, your preferences\nor your device, and is mostly used to make the site work as you expect it to\nand to provide a more personalized web experience. However, you can choose not\nto allow certain types of cookies, which may impact your experience of the\nsite and the services we are able to offer. Click on the different category\nheadings to find out more and change our default settings according to your\npreference. You cannot opt-out of our First Party Strictly Necessary Cookies\nas they are deployed in order to ensure the proper functioning of our website\n(such as prompting the cookie banner and remembering your settings, to log\ninto your account, to redirect you when you log out, etc.). For more\ninformation about the First and Third Party Cookies used please follow this\nlink.  \nMore information\n\n#### Strictly Necessary Cookies\n\nAlways Active\n\nThese cookies are necessary for the website to function and cannot be switched\noff in our systems. They are usually only set in response to actions made by\nyou which amount to a request for services, such as setting your privacy\npreferences, logging in or filling in forms. You can set your browser to block\nor alert you about these cookies, but some parts of the site will not then\nwork. These cookies do not store any personally identifiable information.\n\n#### Functional Cookies\n\nFunctional Cookies\n\nThese cookies enable the website to provide enhanced functionality and\npersonalisation. They may be set by us or by third party providers whose\nservices we have added to our pages.    If you do not allow these cookies then\nsome or all of these services may not function properly.\n\n#### Performance Cookies\n\nPerformance Cookies\n\nThese cookies allow us to count visits and traffic sources so we can measure\nand improve the performance of our site. They help us to know which pages are\nthe most and least popular and see how visitors move around the site. All\ninformation these cookies collect is aggregated and therefore anonymous. If\nyou do not allow these cookies we will not know when you have visited our\nsite, and will not be able to monitor its performance.\n\n#### Targeting Cookies\n\nTargeting Cookies\n\nThese cookies may be set through our site by our advertising partners. They\nmay be used by those companies to build a profile of your interests and show\nyou relevant adverts on other sites.    They do not store directly personal\ninformation, but are based on uniquely identifying your browser and internet\ndevice. If you do not allow these cookies, you will experience less targeted\nadvertising.\n\n#### Social Media Cookies\n\nSocial Media Cookies\n\nThese cookies are set by a range of social media services that we have added\nto the site to enable you to share our content with your friends and networks.\nThey are capable of tracking your browser across other sites and building up a\nprofile of your interests. This may impact the content and messages you see on\nother websites you visit.    If you do not allow these cookies you may not be\nable to use or see these sharing tools.\n\nBack Button\n\n### Cookie List\n\nFilter Button\n\nConsent Leg.Interest\n\ncheckbox label label\n\ncheckbox label label\n\ncheckbox label label\n\nClear\n\ncheckbox label label\n\nApply Cancel\n\nConfirm My Choices\n\nAllow All\n\n",
    "links": "[{\"link\": \"https://www.securitastechnology.com/\", \"text\": \"\"}, {\"link\": \"https://www.securitastechnology.com/customer-support\", \"text\": \"Customer Support\"}, {\"link\": \"https://www.securitastechnology.com/solutions/security-management-platform\", \"text\": \"SecureStat HQ Login\"}, {\"link\": \"https://www.securitastechnology.com/be-nl/?noredirect=1\", \"text\": \"Belgium (Dutch)\"}, {\"link\": \"https://www.securitastechnology.com/be-fr/?noredirect=1\", \"text\": \"Belgium (French)\"}, {\"link\": \"https://www.securitastechnology.com/en-ca/?noredirect=1\", \"text\": \"Canada (English)\"}, {\"link\": \"https://www.securitastechnology.com/fr-ca/?noredirect=1\", \"text\": \"Canada (French)\"}, {\"link\": \"https://www.securitastechnology.com/da/?noredirect=1\", \"text\": \"Denmark (Danish)\"}, {\"link\": \"https://www.securitastechnology.com/fi/?noredirect=1\", \"text\": \"Finland (Finnish)\"}, {\"link\": \"https://www.securitastechnology.com/fr/?noredirect=1\", \"text\": \"France (French)\"}, {\"link\": \"https://www.securitastechnology.com/ie/?noredirect=1\", \"text\": \"Ireland (English)\"}, {\"link\": \"https://www.securitastechnology.com/nl/?noredirect=1\", \"text\": \"Netherlands (Dutch)\"}, {\"link\": \"https://www.securitastechnology.com/no/?noredirect=1\", \"text\": \"Norway (Norwegian)\"}, {\"link\": \"https://www.securitastechnology.com/sv/?noredirect=1\", \"text\": \"Sweden (Swedish)\"}, {\"link\": \"https://www.securitastechnology.com/uk/?noredirect=1\", \"text\": \"United Kingdom (English)\"}, {\"link\": \"https://www.securitastechnology.com/?noredirect=1\", \"text\": \"United States (English)\"}, {\"link\": \"https://www.securitastechnology.com/contact\", \"text\": \"Contact Us\"}, {\"link\": \"https://www.securitastechnology.com/\", \"text\": \"\"}, {\"link\": \"https://www.securitastechnology.com/be-nl/?noredirect=1\", \"text\": \"Belgium (Dutch)\"}, {\"link\": \"https://www.securitastechnology.com/be-fr/?noredirect=1\", \"text\": \"Belgium (French)\"}, {\"link\": \"https://www.securitastechnology.com/en-ca/?noredirect=1\", \"text\": \"Canada (English)\"}, {\"link\": \"https://www.securitastechnology.com/fr-ca/?noredirect=1\", \"text\": \"Canada (French)\"}, {\"link\": \"https://www.securitastechnology.com/da/?noredirect=1\", \"text\": \"Denmark (Danish)\"}, {\"link\": \"https://www.securitastechnology.com/fi/?noredirect=1\", \"text\": \"Finland (Finnish)\"}, {\"link\": \"https://www.securitastechnology.com/fr/?noredirect=1\", \"text\": \"France (French)\"}, {\"link\": \"https://www.securitastechnology.com/ie/?noredirect=1\", \"text\": \"Ireland (English)\"}, {\"link\": \"https://www.securitastechnology.com/nl/?noredirect=1\", \"text\": \"Netherlands (Dutch)\"}, {\"link\": \"https://www.securitastechnology.com/no/?noredirect=1\", \"text\": \"Norway (Norwegian)\"}, {\"link\": \"https://www.securitastechnology.com/sv/?noredirect=1\", \"text\": \"Sweden (Swedish)\"}, {\"link\": \"https://www.securitastechnology.com/uk/?noredirect=1\", \"text\": \"United Kingdom (English)\"}, {\"link\": \"https://www.securitastechnology.com/?noredirect=1\", \"text\": \"United States (English)\"}, {\"link\": \"https://www.securitastechnology.com/solutions\", \"text\": \"See All\"}, {\"link\": \"https://www.securitastechnology.com/solutions/video-surveillance\", \"text\": \"Video Surveillance\"}, {\"link\": \"https://www.securitastechnology.com/solutions/access-control\", \"text\": \"Access Control\"}, {\"link\": \"https://www.securitastechnology.com/solutions/electronic-article-surveillance\", \"text\": \"Electronic Article Surveillance\"}, {\"link\": \"https://www.securitastechnology.com/solutions/intrusion-systems\", \"text\": \"Intrusion Systems\"}, {\"link\": \"https://www.securitastechnology.com/solutions/visitor-management\", \"text\": \"Visitor Management\"}, {\"link\": \"https://www.securitastechnology.com/solutions/weapons-threat-detection\", \"text\": \"Weapons & Threat Detection\"}, {\"link\": \"https://www.securitastechnology.com/solutions/remote-monitoring\", \"text\": \"Security Monitoring\"}, {\"link\": \"https://www.securitastechnology.com/solutions/workplace-management\", \"text\": \"Workplace Management\"}, {\"link\": \"https://www.securitastechnology.com/solutions/fire-emergency-preparedness\", \"text\": \"Fire and Emergency Preparedness\"}, {\"link\": \"https://www.securitastechnology.com/solutions/remote-monitoring\", \"text\": \"Interactive Security Monitoring\"}, {\"link\": \"https://www.securitastechnology.com/solutions/service-and-maintenance\", \"text\": \"Service and Maintenance\"}, {\"link\": \"https://www.securitastechnology.com/solutions/video-verification\", \"text\": \"Video Verification\"}, {\"link\": \"https://www.securitastechnology.com/solutions/security-management-platform\", \"text\": \"Security Management Platforms\"}, {\"link\": \"https://www.securitastechnology.com/industries\", \"text\": \"See All\"}, {\"link\": \"https://www.securitastechnology.com/industries/manufacturing-logistics\", \"text\": \"Manufacturing & Logistics\"}, {\"link\": \"https://www.securitastechnology.com/industries/utilities-energy\", \"text\": \"Utilities & Energy\"}, {\"link\": \"https://www.securitastechnology.com/industries/retail\", \"text\": \"Retail\"}, {\"link\": \"https://www.securitastechnology.com/industries/commercial-offices\", \"text\": \"Commercial Offices\"}, {\"link\": \"https://www.securitastechnology.com/industries/finance-banking\", \"text\": \"Finance & Banking\"}, {\"link\": \"https://www.securitastechnology.com/industries/healthcare\", \"text\": \"Healthcare\"}, {\"link\": \"https://www.securitastechnology.com/industries/data-centers\", \"text\": \"Data Centers\"}, {\"link\": \"https://www.securitastechnology.com/industries/biotech-pharma\", \"text\": \"BioTech & Pharma\"}, {\"link\": \"https://www.securitastechnology.com/industries/government\", \"text\": \"Government\"}, {\"link\": \"https://www.securitastechnology.com/customer-support\", \"text\": \"Customer Support\"}, {\"link\": \"https://www.securitastechnology.com/resources\", \"text\": \"Knowledge Center\"}, {\"link\": \"https://www.securitastechnology.com/careers\", \"text\": \"Careers\"}, {\"link\": \"https://www.securitastechnology.com/blog\", \"text\": \"Blog\"}, {\"link\": \"https://www.securitastechnology.com/news\", \"text\": \"News\"}, {\"link\": \"https://www.securitastechnology.com/about-us\", \"text\": \"About Us\"}, {\"link\": \"https://www.securitastechnology.com/why-securitas-technology\", \"text\": \"Why Securitas Technology?\"}, {\"link\": \"https://www.securitastechnology.com/technology-innovation\", \"text\": \"Technology Innovation\"}, {\"link\": \"https://www.securitastechnology.com/who-we-serve\", \"text\": \"Who We Serve\"}, {\"link\": \"https://www.securitastechnology.com/engineering-center-excellence\", \"text\": \"Engineering Center of Excellence\"}, {\"link\": \"https://www.securitastechnology.com/global-clients-program\", \"text\": \"Global Clients Program\"}, {\"link\": \"https://www.securitastechnology.com/meet-our-team\", \"text\": \"Meet Our Team\"}, {\"link\": \"https://www.securitastechnology.com/2024-technology-outlook-report\", \"text\": \"2024 Technology Report\"}, {\"link\": \"https://www.securitastechnology.com/customer-support\", \"text\": \"Customer Support\"}, {\"link\": \"https://www.securitastechnology.com/solutions/security-management-platform\", \"text\": \"SecureStat HQ Login\"}, {\"link\": \"https://www.securitastechnology.com/contact\", \"text\": \"Contact Us\"}, {\"link\": \"https://www.securitastechnology.com/\", \"text\": \"Home\"}, {\"link\": \"https://www.securitastechnology.com/solutions\", \"text\": \"Solutions\"}, {\"link\": \"https://www.securitastechnology.com/get-quote\", \"text\": \"Get a Quote\"}, {\"link\": \"https://www.securitastechnology.com/blog/visitor-management-systems-benefits-you-may-not-know-about\", \"text\": \"\"}, {\"link\": \"https://www.securitastechnology.com/blog/how-visitor-management-software-makes-happier-customer-and-employee\", \"text\": \"\"}, {\"link\": \"https://www.securitastechnology.com/solutions\", \"text\": \"Explore Solutions\"}, {\"link\": \"https://www.securitastechnology.com/solutions/video-surveillance\", \"text\": \"\"}, {\"link\": \"https://www.securitastechnology.com/solutions/video-surveillance\", \"text\": \"\\n    Learn more\\n  \"}, {\"link\": \"https://www.securitastechnology.com/solutions/professional-managed-services\", \"text\": \"\"}, {\"link\": \"https://www.securitastechnology.com/solutions/professional-managed-services\", \"text\": \"\\n    Learn more\\n  \"}, {\"link\": \"https://www.securitastechnology.com/solutions/workplace-management\", \"text\": \"\"}, {\"link\": \"https://www.securitastechnology.com/solutions/workplace-management\", \"text\": \"\\n    Learn more\\n  \"}, {\"link\": \"https://www.securitastechnology.com/contact/\", \"text\": \"Get in Touch\"}, {\"link\": \"https://www.securitastechnology.com/about-us\", \"text\": \"About\"}, {\"link\": \"https://www.securitastechnology.com/our-brands\", \"text\": \"Our Brands\"}, {\"link\": \"https://www.securitastechnology.com/our-locations\", \"text\": \"Locations\"}, {\"link\": \"https://www.securitastechnology.com/news\", \"text\": \"News\"}, {\"link\": \"https://www.securitastechnology.com/careers\", \"text\": \"Careers\"}, {\"link\": \"https://www.securitastechnology.com/resources\", \"text\": \"Knowledge Center\"}, {\"link\": \"https://www.securitastechnology.com/blog\", \"text\": \"Blog\"}, {\"link\": \"https://www.securitastechnology.com/bill-payment\", \"text\": \"Pay My Bill\"}, {\"link\": \"https://www.securitastechnology.com/licenses\", \"text\": \"Licenses\"}]"
}