{
    "summary": "The Wayback Machine -\nhttp://web.archive.org/web/20240112201448/https://pharmanewsintel.com/\n\n  *   * Register | \n  * Login\n\n  * Home\n  * News\n  * Features\n  * Podcasts\n  * Research\n  * White Papers & Webcasts\n  * Events\n\n  * Technology\n  * Supply Chain\n  * Mergers & Acquisitions\n  * Clinical Trials & Research\n  * Policy & Regulation\n  * Industry News\n  * \n\nToggle navigation PharmaNewsIntelligence\n\n  * Home\n  * News\n  * Features\n  * Interviews\n  * Podcasts\n  * White Papers & Webcasts\n  * Events\n  *   * Login\n  * Register | \n\n  * Technoloogy\n  * Supply Chain\n  * Mergers & Acquisitions\n  * Clinical Trials & Research\n  * Policy & Regulation\n  * Industy News\n\nTopicTechnoloogySupply ChainMergers & AcquisitionsClinical Trials &\nResearchPolicy & RegulationIndusty News\n\n  * ##  Lilly Launches Digital Obesity, Migraine, Diabetes Management Platform\n\nJanuary 5, 2024 \\- Yesterday, January 4, 2024, Eli Lilly and Company issued a\npress release announcing the launch of LillyDirect. The platform is a digital\nhealthcare tool for managing and supporting patients with obesity, migraine,\nand diabetes in the United States. According to the release, LillyDirect\noffers multiple services for disease management, support, and...\n\nRead More...\n\n  * ##  FDA Investigates the Safety of GLP-1 Weight Loss Drugs\n\nJanuary 12, 2024 \\- Yesterday, on January 11, 2024, the United States FDA\nissued a drug safety communication updating the public on an ongoing\ninvestigation of glucagon-like peptide-1 receptor agonists. The administration\nevaluated the link between using these medications and suicidal thoughts,\nnoting that there is no causal relationship. Glucagon-like...\n\nRead More...\n\n  * ##  FDA Recalls 3 IV Drugs from Leiters Health for Potential Superpotency\n\nJanuary 11, 2024 \\- On January 5, 2024, the United States FDA published an\nannouncement detailing a voluntary recall of multiple intravenous (IV) drugs\nmanufactured by Leiters Health. The release notes that 33 lots of IV bags,\nincluding vancomycin, phenylephrine, and fentanyl IV bags, have been recalled\ndue to potential superpotency. The recalled compounds and...\n\nRead More...\n\n  * ##  Online Pharmacies Under Scrutiny for Lax Safety Checks, Endangering Patients\n\nJanuary 10, 2024 \\- In a groundbreaking investigation, the BBC uncovered a\nconcerning trend in the online pharmaceutical industry, where prescription-\nonly medicines are sold without adequate checks. The report exposes a\nregulatory loophole that risks patients' lives and highlights the urgent need\nfor stricter rules and oversight. The BBC investigation revealed...\n\nRead More...\n\n  * ##  Lilly Launches Digital Obesity, Migraine, Diabetes Management Platform\n\nJanuary 5, 2024 \\- Yesterday, January 4, 2024, Eli Lilly and Company issued a\npress release announcing the launch of LillyDirect. The platform is a digital\nhealthcare tool for managing and supporting patients with obesity, migraine,\nand diabetes in the United States. According to the release, LillyDirect\noffers multiple services for disease management, support, and...\n\nRead More...\n\n  * ##  FDA Investigates the Safety of GLP-1 Weight Loss Drugs\n\nJanuary 12, 2024 \\- Yesterday, on January 11, 2024, the United States FDA\nissued a drug safety communication updating the public on an ongoing\ninvestigation of glucagon-like peptide-1 receptor agonists. The administration\nevaluated the link between using these medications and suicidal thoughts,\nnoting that there is no causal relationship. Glucagon-like...\n\nRead More...\n\n1\n\n2\n\n3\n\n4\n\nPrevNext\n\n  \n\nFeatures\n\n### How the Medical Education System Contributes to Physician Burnout\n\nOne could argue that the medical education system is the cornerstone of\nhealthcare and patient care. Through the education and certification\nprotocols, medical schools mold the providers that play a critical role in\nnearly every aspect of patient care. However, this system has been critiqued\nfor...\n\nRead More...\n\nEthical Guidelines, Emerging Regulations in Octopus Research\n\nUnderstanding the Pharmacotherapy of Hypertensive Disorders\n\nView all features\n\n  \n\nToday's Top Stories\n\n### FDA Investigates the Safety of GLP-1 Weight Loss Drugs\n\nYesterday, on January 11, 2024, the United States FDA issued a drug safety\ncommunication updating the public on an ongoing investigation of glucagon-like\npeptide-1 receptor agonists. The administration...\n\n### FDA Recalls 3 IV Drugs from Leiters Health for Potential Superpotency\n\nOn January 5, 2024, the United States FDA published an announcement detailing\na voluntary recall of multiple intravenous (IV) drugs manufactured by Leiters\nHealth. The release notes that 33 lots of IV...\n\n### Online Pharmacies Under Scrutiny for Lax Safety Checks, Endangering\nPatients\n\nIn a groundbreaking investigation, the BBC uncovered a concerning trend in the\nonline pharmaceutical industry, where prescription-only medicines are sold\nwithout adequate checks. The report exposes a...\n\n### Lilly Launches Digital Obesity, Migraine, Diabetes Management Platform\n\nYesterday, January 4, 2024, Eli Lilly and Company issued a press release\nannouncing the launch of LillyDirect. The platform is a digital healthcare\ntool for managing and supporting patients with...\n\n### Semaglutide Reduces Weight in Patients with Failed Bariatric Surgery\n\nAccording to a study published in Obesity, semaglutide effectively triggers\nweight loss in severely obese patients, including those who have had bariatric\nsurgery to manage weight but have not yielded...\n\n### 500 Drugs from Over 140 Brands Are Expected to Cost More This Year\n\nLast week, just before the end of 2023, Reuters published an article breaking\na story from data analyzed by 3 Axis Advisors, a healthcare research firm. The\nanalysis evaluated anticipated drug price...\n\n### Psilocybin-Assisted Group Therapy Manages MDD in Cancer Patients\n\nOn December 18, 2023, researchers published a study in Cancer, a journal of\nthe American Cancer Society, evaluating the safety, feasibility, and efficacy\nof psilocybin-assisted group therapy to manage...\n\nView all stories\n\nInterviews\n\n  * Exploring the Role of Identity and Access Management in Healthcare Jan 12, 2024\n  * How Virtual Nursing Can Help Fortify a Workforce in Crisis Jan 11, 2024\n  * Key Considerations For Choosing a Revenue Cycle Technology Vendor Jan 10, 2024\n  * How One Payer Tackled the No Surprises Act Provider Directory Rule Jan 10, 2024\n  * Healthcare Stakeholders Plan to Prioritize AI, Analytics This Year Jan 08, 2024\n\nMore Interviews\n\nFeatured Resources\n\n  * Industry Report: Virtual Value: A Market Survey on The Shift to Digital Scientific Discourse in Pharma and Biotech\n  * America's Amphetamine Problem, Beyond the Pharmaceutical Supply Chain\n  * Bring Differentiated Therapeutics to Market Faster\n\nView all resources\n\nNews From The Network\n\n[mHealthIntelligence]\n\nFCC Updates Funding Program to Boost Rural Telehealth Adoption\n\n[RevCycleIntelligence]\n\nHospital Finances Show Signs of Recovery as Revenues Rise\n\n[HealthITAnalytics]\n\nGenerative AI May Help Flag Social Determinants of Health in EHR Data\n\n[LifeSciencesIntelligence]\n\nAlmost 10% of Adolescents Use Non-Prescription Weight Loss Products\n\n  \n\nNewsletter Signup\n\nSign up to receive our newsletter and access our resources\n\n    * Bio and Pharma News\n    * Analytics, AI and Blockchain\n    * Payers, Policy and Employee Wellness\n    * Pharma/BioMed\n    * Life Sciences\n  * You forgot to provide an Email Address.\n\nThis email address doesn’t appear to be valid.\n\nPlease provide a Corporate Email Address.\n\nThis email address is already registered. Please log in.\n\nYou have exceeded the maximum character limit.\n\n  *     * I agree to TechTarget’s Terms of Use, Privacy Policy, and the transfer of my information to the United States for processing to provide me with relevant information as described in our Privacy Policy.\n\nPlease check the box if you want to proceed.\n\n  *     * I agree to my information being processed by TechTarget and its Partners to contact me via phone, email, or other means regarding information relevant to my professional interests. I may unsubscribe at any time.\n\nPlease check the box if you want to proceed.\n\n  * \n\nRecent Articles\n\n  * Semaglutide Reduces Weight in Patients with Failed Bariatric Surgery\n  * Novo Nordisk Launches Vaccine Initiative for Airborne Infections\n  * Researcher Study Non-Opioid Pain Medication for Diabetic Neuropathy\n  * 34% of Conventional Baby Food Contains Pesticides\n\nUpcoming Webcasts\n\n  * Saying “No” to Ransomware Woes: Operational Resiliency with EHR on AWS\n  * Health-Related Social Needs and the Integrated Delivery Network\n\nPopular Topics\n\n  * Pharmaceutical Companies\n  * Clinical Trials\n  * Coronavirus\n  * FDA\n  * Chronic Disease Management\n  * Vaccinations & Immunizations\n  * Research & Evidence\n  * Patient Centered Care\n  * Access To Medicine\n  * Drug Development\n\n  * About Us\n  * Contact Us\n  * Advertise on PharmaNewsIntel\n  * Privacy Policy\n  * DMCA Policy\n  * Terms & Conditions\n  * Sitemap\n\n    * EHRIntelligence\n    * HealthITSecurity\n    * HealthITAnalytics\n    * RevCycleIntelligence\n    * mHealthIntelligence\n\n    * HealthPayerIntelligence\n    * HITInfrastructure\n    * PatientEngagementHIT\n    * HealthCareExecIntelligence\n    * LifeSciencesIntelligence\n\nDo Not Sell or Share My Personal Information  \n©2012-2024 TechTarget, Inc. Xtelligent Healthcare Media is a division of\nTechTarget. All rights reserved. HealthITAnalytics.com is published by\nXtelligent Healthcare Media a division of TechTarget.\n\n",
    "links": "[]"
}