{
    "summary": "IE 11 is not supported. For an optimal experience visit our site on another\nbrowser.\n\nSKIP TO CONTENT\n\nNBC News Logo\n\nSponsored By\n\n  * New Hampshire primary\n  * Israel-Hamas War\n  * Politics\n  * U.S. News\n  * World\n  * Business\n  * NBC News Tipline\n  * Video\n  * Health\n  * Culture & trends\n\nWatch live\n\nHow one U.S. drugmaker contributed to the escalating drug shortage crisis\n\n  * Share & Save —\n  *   *   *   *   *   * \n\nMy NewsManage ProfileEmail PreferencesSign Out\n\nSearch\n\nSearch\n\nProfile\n\n My NewsSign Out\n\n Sign InCreate your free profile\n\nSections\n\n  * Meet the Press\n  * U.S. News\n  * Politics\n  * World\n  * Local\n  * Business\n  * Health\n  * Investigations\n  * Culture & Trends\n  * Science\n  * Sports\n  * Tech & Media\n  * Video Features\n  * Photos\n  * Weather\n  * NBC Select\n  * Decision 2024\n  * NBC Asian America\n  * NBC BLK\n  * NBC Latino\n  * NBC OUT\n\ntv\n\n  * Today\n  * Nightly News\n  * MSNBC\n  * Meet the Press\n  * Dateline\n\nFeatured\n\n  * NBC News Now\n  * Nightly Films\n  * Stay Tuned\n  * Special Features\n  * Newsletters\n  * Podcasts\n  * Listen Now\n\nMore From NBC\n\n  * CNBC\n  * NBC.COM\n  * NBCU Academy\n  * Peacock\n  * NEXT STEPS FOR VETS\n  * NBC News Site Map\n  * Help\n\nFollow NBC News\n\n  *   *   * \n\n##  news Alerts\n\nThere are no new alerts at this time\n\nSearch\n\nSearch\n\n  * Facebook\n  * Twitter\n  * Email\n  * SMS\n  * Print\n  * Whatsapp\n  * Reddit\n  * Pocket\n  * Flipboard\n  * Pinterest\n  * Linkedin\n\n  * Latest Stories\n  * New Hampshire primary\n  * Israel-Hamas War\n  * Politics\n  * U.S. News\n  * World\n  * Business\n  * NBC News Tipline\n  * Video\n  * Health\n  * Culture & trends\n\nEXCLUSIVE\n\nHealth news\n\nHealth news\n\n# How one U.S. drugmaker contributed to the escalating drug shortage crisis\n\nAkorn Pharmaceuticals abruptly filed for bankruptcy this year, affecting\nhospitals across the U.S.\n\nAkorn Pharmaceuticals made 75 generic drugs, as well as drugs used in\nveterinary medicine.Justine Goode / NBC News / Getty Images\n\n  *   *   *   *   *   *   * Print\n  * Save\n\nCreate your free profile or log in to save this article\n\nJuly 16, 2023, 10:00 AM UTC\n\nBy Berkeley Lovelace Jr.\n\nWhen Akorn Pharmaceuticals shut its doors in February, hospitals across the\ncountry felt it.\n\nThe Lake Forest, Illinois-based drugmaker was responsible for producing 75\ngeneric drugs, all of which were pulled from the market when the company\nclosed down. In some cases, the company was the sole supplier of particular\nproducts.\n\nThe closure comes amid — and contributed to — an ongoing drug shortage crisis\nin the U.S. Akorn’s bankruptcy and subsequent shuttering are part of a bigger\ndisaster caused by fewer manufacturers’ in the U.S. making cheaper generic\ndrugs, scarce profits for the remaining companies and an overly complicated\nglobal supply chain that could leave patients scrambling for lifesaving\nmedications for months or possibly years to come.\n\nNew drug shortages increased by nearly 30% from 2021 to 2022, affecting 295\nproducts at the end of last year, according to a March report from the Senate\nCommittee on Homeland Security and Governmental Affairs. The drug shortages\nare affecting cancer patients who are in desperate need of chemotherapy drugs\nand people in intensive care units or emergency rooms who need certain generic\nintravenous medications, which are in tight supply.\n\nThe shortages are getting worse: As of June, there were more than 300 active\ndrug shortages, the most in nearly a decade, according to the American Society\nof Health-System Pharmacists, a professional organization that tracks drug\nshortages.\n\n##  **Why is this happening now?  **\n\nDrug shortages are not new. There have been supply crunches for heart\nmedications, cancer treatments and ADHD medications in the U.S. and globally\nin recent years. The generic drug supply is especially vulnerable. Companies\nlike Akorn face intense competition and declining profits and have been forced\nto lay off workers and cut costs to stay in business.\n\nWith Akorn's closure, the U.S. lost a “chunk” of its manufacturing capacity,\nall while other generic drugmakers struggle to stay in business, said Valerie\nJensen, the associate director of the Food and Drug Administration’s drug\nshortage program.\n\n“When we see a firm like Akorn close down, that’s extremely concerning to us\nbecause then we lose that capacity,” Jensen said. “And then we have to work\nreally closely with other companies to ramp up to cover that shortfall. So\nit’s definitely concerning, and we continue to monitor very closely.”\n\nDouglas Boothe, the former CEO of Akorn, did not respond to a request for\ncomment. Emails to Akorn’s media relations contacts went unanswered.\n\nAmericans rely heavily on generic drugs: They account for about 90% of all\nprescriptions filled, according to the Association for Accessible Medicines, a\ntrade group that represents generic drugmakers.\n\nAt the same time, generic drugs — which are sold for very low prices —\nrepresent only about 20% of drug spending in the U.S. Even with high demand\nfor the products, the low cost of the drugs means generic drugmakers don’t\nmake much money, according to David Gaugh, the interim president and CEO of\nthe AAM.\n\nOver the last decade, the number of generic drugs made in the U.S. has\ndwindled. A working paper from the National Bureau of Economic Research, a\nnonprofit, nonpartisan research group based in Cambridge, Massachusetts, found\nthat from 2013 to 2019, the number of U.S. facilities registered to make\nactive pharmaceutical ingredients fell about 10%, to 118. The only year that\nnumber did not fall was 2014, according to the report.\n\n## Latest on drug shortages\n\n  * 14 cancer drugs are in shortage, forcing doctors to ration doses or delay care.\n  * To ease shortage, the FDA allows chemotherapy drug cisplatin to be imported from China.\n  * Penicillin shortage poses risk for people with strep infection or syphilis.\n\nWhen Akorn shut down after it filed for bankruptcy, it was one of two U.S.\nsuppliers of liquid albuterol, an essential medication hospitals use to treat\nasthma and RSV in children.\n\nIt was one of the most in-demand products for the company, said Mohammed\nKabir, who worked as Akorn’s director of formulation development before the\ncompany closed.\n\n“It was a huge surprise,” Kabir said of Akorn’s shuttering.\n\nThe company, which was founded in 1971 as an eye care products manufacturer,\nexpanded to make a range of drugs such as antibiotics, pain and allergy\nmedicines, and veterinary drugs. Its generic drugs included adenosine, which\nis a drug for irregular heartbeats, and lorazepam, which is used for anxiety\nas well as nausea and vomiting in some cancer patients. It was the sole\nsupplier of physostigmine, an antidote for overdoses from certain medications,\n**** according to a report from the End Drug Shortages Alliance, a group\ndedicated to preventing drug shortages.\n\nIn the wake of Akorn’s closure, all its drugs are either in shortage or\nrunning into supply problems as other generic manufacturers struggle to fill\nthe gap, according to the American Society of Health-System Pharmacists.\n\nEven worse, when Akorn shuttered, it could no longer monitor the quality and\nsafety of many of the drugs it had already distributed nationwide to\nretailers, medical facilities and consumers online. In early May, the FDA\nannounced that Akorn was recalling drugs that had been distributed.\n\nAt the Mayo Clinic, pharmacists scrambled to switch suppliers or figure out a\nway to get medications that only Akorn produced. The clinic also had to get\nrid of any remaining Akorn products and notify doctors and patients about the\nrecall.\n\n“It’s definitely a challenging situation,” said Eric Tichy, division chair of\npharmacy supply solutions for the Mayo Clinic in Rochester, Minnesota, and\nboard chair of the End Drug Shortages Alliance. “The experience led to\nadditional work for our team and anxiety for patients.”\n\n##  **Generic drug shortages could get worse**\n\nOnce a pharmaceutical patent expires, generics are allowed on the market,\noften at a lower price than the brand-name drug.\n\n“The fundamental problem is the economics of the system,” FDA Commissioner\nRobert Califf said at the Aspen Ideas Festival in late June. Unlike brand-name\ndrug companies, he said, generic drugmakers are not protected by patents that\nallow them to exclusively sell medications for a set period of time. In order\nfor generic drug manufacturing to grow in the U.S., companies need to be paid\nenough to manufacture the drugs and stay in business.\n\n## Cancer drug shortage across U.S. has become ‘life-threatening’\n\nMay 26, 202302:17\n\nThe problems facing the industry now are likely to get worse as more U.S.\ncompanies go under.\n\nLannett Co., a generic drug manufacturer in Pennsylvania, announced in May\nthat it was filing for Chapter 11 bankruptcy, although it plans to continue\noperating as it restructures its business.\n\n### Recommended\n\nVaping\n\n### VapingA 22-year-old man who vaped required a double lung transplant after\nparainfluenza infection\n\nHealth Care\n\n### Health CareOwner of failed nursing home chain accused of $38 million tax\nfraud scheme pleads guilty\n\nTeva Pharmaceuticals, a major generic drugmaker based in Israel, said in a\nstatement the same month that it was cutting back on its generic\nmanufacturing. Early last year, Aurobindo Pharma, based in India, announced it\nwas closing its U.S. generic manufacturing facility in New Jersey.\n\n“It has become a race to the bottom,” Gaugh said.\n\nThe generic drug industry’s business model has become unsustainable for many\nmanufacturers, said Michael Ganio, senior director of pharmacy practice and\nquality at the American Society of Health-System Pharmacists.\n\n“If you talk to someone in the generic drug industry, they’ll tell you that\nabout a third make money, a third break even and a third lose money,” he said.\n\n##  **Risks of relying on foreign drugmakers**\n\nThe U.S. is already highly dependent on foreign drugmakers. In 2021, 78% of\nthe suppliers of active pharmaceutical ingredients were in China, India and\nthe European Union, according to the FDA. With Akorn’s closure, the U.S. will\nbe even more dependent on overseas manufacturing.\n\nForeign suppliers don’t always meet the rigorous FDA standards for generic\ndrugs. What’s more, FDA visits to foreign facilities are often notified in\nadvance and the investigators may rely on the facility to provide translation\nservices — raising concerns about whether the agency is getting all the\ninformation it needs to accurately assess the quality of the products.\n\n“Overseas production in China and India has edged out all but a few\nmanufacturing plants in North America,” said David Gortler, a former science\npolicy adviser at the FDA and an FDA oversight expert. “Unfortunately, lower\nprices are usually accompanied by poor quality.”\n\nIn December, Intas Pharmaceuticals, a generic drug manufacturer based in\nIndia, suspended production after an FDA inspection last year cited numerous\nquality concerns. The suspension caused a widespread shortage of cisplatin, a\nchemotherapy drug used for a variety of cancers, including testicular, lung,\nbladder, cervical and ovarian.\n\nGlobal Pharma, also based in India, recalled its EzriCare Artificial Tears eye\ndrops this year after the products were linked to highly drug-resistant\nbacterial infections that resulted in four deaths. An FDA inspection found\nthat the company did not follow proper protocol to prevent contamination of\nits products.\n\nIntas Pharmaceuticals and Global Pharma did not respond to requests for\ncomment.\n\nThe move toward more drug manufacturing abroad is “a big issue of national\nsecurity,” especially given the current state of international strife, Califf\nsaid.\n\n##  **What can be done?  **\n\nThere are no quick fixes. Drug companies are not required to disclose exactly\nwhich suppliers are making which product as well as the location, said Erin\nFox, a pharmacist and professor at the University of Utah College of Pharmacy.\nThat means it’s very difficult for the FDA to know which products are made\noverseas.\n\n“The problem is we don’t know what’s coming from where and how much,” Ganio\nsaid. “It’s not easy to access.”\n\nIn a report **** published in June, the Association for Accessible Medicines’\npolicy team described several steps the U.S. government could take to help\nkeep domestic generic drug manufacturers afloat.\n\nThey included creating incentives for hospitals to purchase supplies of\ngenerics at fixed prices for multiple years, providing generic drugmakers with\na continuous source of revenue. The government could also provide grants to\ngeneric manufacturers that would allow them to update their manufacturing\nfacilities as well as build new facilities that could provide additional\ncapacity.\n\nThe steps also included that Medicare drug plans cover and encourage the use\nof new generics.\n\nBecause generic drug manufacturing is a very complex, highly regulated\nindustry, it’s not easy for new manufacturers to immediately jump in, Tichy\nsaid.\n\nThat means patients who need the medications will go without them.\n\n“The marketplace is already tight on supplies,” Tichy said. “How are we going\nto communicate that to patients?\n\n ** _Follow  _** ** _NBC HEALTH_** ** _  on _** ** _Twitter_** ** _  & _** **\n_Facebook_**.\n\nBerkeley Lovelace Jr.\n\nBerkeley Lovelace Jr. is a health and medical reporter for NBC News. He covers\nthe Food and Drug Administration, with a special focus on Covid vaccines,\nprescription drug pricing and health care. He previously covered the biotech\nand pharmaceutical industry with CNBC.\n\n  * About\n  * Contact\n  * Help\n  * Careers\n  * Ad Choices\n  * Privacy Policy\n  * Your Privacy Choices\n  * CA Notice\n  * Terms of Service (Updated JULY 7, 2023)\n  * NBC News Sitemap\n  * Closed Captioning\n  * Advertise\n  * Select Shopping\n  * Select Personal Finance\n\n© 2024 NBC UNIVERSAL\n\nNBC News LogoMSNBC LogoToday Logo\n\n### Your Privacy Choices: Opt-out of sale of personal information and Opt-out\nof sharing or processing personal information for targeted ads\n\nTo provide you with a more relevant online experience, certain online ad\npartners may combine personal information that we make available with data\nacross different businesses and otherwise assist us with related advertising\nactivities, as described in our Privacy Policy. This may be considered\n\"selling\" or \"sharing/processing” for targeted online advertising under\napplicable law.\n\nIf you are a resident of California, Connecticut, Colorado, Utah or Virginia,\nto opt out of us selling or sharing/processing your personal information:\n\n  * Such as cookies and devices identifiers for the targeted ads and related purposes for this site/app on this browser/device: switch the “Allow Sale of My Personal Info or Sharing/Processing for Targeted Ads” toggle under Manage Preferences to OFF (grey color) by moving it LEFT and clicking “Confirm My Choice”.\n  * Such as your name, email address and other associated personal information for targeted advertising activities as described above, please submit the form below.\n\n**_Please note that choices related to cookies and device identifiers are\nspecific to the brand’s website or app on the browser or device where you are\nmaking the election._**\n\n### Manage Preferences\n\n#### Allow Sale of My Personal Info and Sharing/Processing for Targeted Ads\n\nAllow Sale of My Personal Info and Sharing/Processing for Targeted Ads\n\n**California, Connecticut, Colorado, Utah & Virginia Residents Only:** To opt\nout of selling or sharing/processing for targeted advertising of information\nsuch as cookies and device identifiers processed for targeted ads (as defined\nby law) and related purposes for this site/app on this browser/device, switch\nthis toggle to off (grey color) by moving it left and clicking “Confirm My\nChoice” below. (This will close this dialogue box, so please open the email\nOpt-Out Form 1st).  \n  \n**ALL OTHER LOCATIONS:** If we do not detect that you are in **California,\nConnecticut, Colorado, Utah or Virginia,** this choice will not apply even if\nyou toggle this button off.  \n  \nIf you turn this off, you will still see ads, but they may be less relevant or\nbased only on our first-party information about you.  \n  \nPlease note, you must make the Manage Preference choices on each site/app on\neach browser/device you use to access the services. You must also renew this\nchoice if you clear your cookies. You can change your precise geolocation\npermissions for our mobile apps in your mobile device settings.\n\n#### Opt-Out Form\n\nAlways Active\n\nTo opt out of the use of your email and other personal information related to\nthat email such as your name for targeted advertising activities please\ncomplete this Opt-Out Form\n\n#### Other Categories of Data Collection\n\nAlways Active\n\nPlease see our Cookie Notice for more details which can be found by navigating\nto the Privacy Policy in the menu settings page.\n\n### Back Button Performance Cookies\n\nVendor Search Search Icon\n\nFilter Icon\n\nClear\n\ncheckbox label label\n\nApply Cancel\n\nConsent Leg.Interest\n\ncheckbox label label\n\ncheckbox label label\n\ncheckbox label label\n\nConfirm My Choice\n\n",
    "links": "[{\"link\": \"https://www.facebook.com/sharer/sharer.php?u=https://www.nbcnews.com/health/health-news/akorn-us-drugmaker-closure-escalating-drug-shortage-rcna91402&cid=article_share_facebook\", \"text\": \"\"}, {\"link\": \"https://twitter.com/intent/tweet?text=How%20one%20U.S.%20drugmaker%20contributed%20to%20the%20escalating%20drug%20shortage%20crisis&via=nbcnews&url=https://www.nbcnews.com/health/health-news/akorn-us-drugmaker-closure-escalating-drug-shortage-rcna91402&original_referer=URL&cid=article_share_twitter\", \"text\": \"\"}, {\"link\": \"mailto:?subject=How%20one%20U.S.%20drugmaker%20contributed%20to%20the%20escalating%20drug%20shortage%20crisis&body=https://www.nbcnews.com/health/health-news/akorn-us-drugmaker-closure-escalating-drug-shortage-rcna91402\", \"text\": \"\"}, {\"link\": \"sms:?body=How%20one%20U.S.%20drugmaker%20contributed%20to%20the%20escalating%20drug%20shortage%20crisis via nbcnews - https://www.nbcnews.com/health/health-news/akorn-us-drugmaker-closure-escalating-drug-shortage-rcna91402\", \"text\": \"\"}, {\"link\": \"https://www.nbcnews.com/my-news\", \"text\": \"My News\"}, {\"link\": \"https://www.nbcnews.com/my-news\", \"text\": \"\"}, {\"link\": \"https://www.facebook.com/sharer/sharer.php?u=https://www.nbcnews.com/health/health-news/akorn-us-drugmaker-closure-escalating-drug-shortage-rcna91402&cid=article_share_facebook\", \"text\": \"\"}, {\"link\": \"https://twitter.com/intent/tweet?text=How%20one%20U.S.%20drugmaker%20contributed%20to%20the%20escalating%20drug%20shortage%20crisis&via=nbcnews&url=https://www.nbcnews.com/health/health-news/akorn-us-drugmaker-closure-escalating-drug-shortage-rcna91402&original_referer=URL&cid=article_share_twitter\", \"text\": \"\"}, {\"link\": \"mailto:?subject=How%20one%20U.S.%20drugmaker%20contributed%20to%20the%20escalating%20drug%20shortage%20crisis&body=https://www.nbcnews.com/health/health-news/akorn-us-drugmaker-closure-escalating-drug-shortage-rcna91402\", \"text\": \"\"}, {\"link\": \"sms:?body=How%20one%20U.S.%20drugmaker%20contributed%20to%20the%20escalating%20drug%20shortage%20crisis via nbcnews - https://www.nbcnews.com/health/health-news/akorn-us-drugmaker-closure-escalating-drug-shortage-rcna91402\", \"text\": \"\"}, {\"link\": \"https://api.whatsapp.com/send?phone=&text=How%20one%20U.S.%20drugmaker%20contributed%20to%20the%20escalating%20drug%20shortage%20crisis https://www.nbcnews.com/health/health-news/akorn-us-drugmaker-closure-escalating-drug-shortage-rcna91402&cid=article_share_whatsapp\", \"text\": \"\"}, {\"link\": \"http://www.reddit.com/submit?url=https://www.nbcnews.com/health/health-news/akorn-us-drugmaker-closure-escalating-drug-shortage-rcna91402&title=How%20one%20U.S.%20drugmaker%20contributed%20to%20the%20escalating%20drug%20shortage%20crisis&cid=article_share_reddit\", \"text\": \"\"}, {\"link\": \"https://getpocket.com/save?url=https://www.nbcnews.com/health/health-news/akorn-us-drugmaker-closure-escalating-drug-shortage-rcna91402&title=How%20one%20U.S.%20drugmaker%20contributed%20to%20the%20escalating%20drug%20shortage%20crisis&cid=article_share_pocket\", \"text\": \"\"}, {\"link\": \"https://share.flipboard.com/bookmarklet/popout?v=2&title=How%20one%20U.S.%20drugmaker%20contributed%20to%20the%20escalating%20drug%20shortage%20crisis&url=https://www.nbcnews.com/health/health-news/akorn-us-drugmaker-closure-escalating-drug-shortage-rcna91402&cid=article_share_flipboard\", \"text\": \"\"}, {\"link\": \"http://pinterest.com/pin/create/link/?url=https://www.nbcnews.com/health/health-news/akorn-us-drugmaker-closure-escalating-drug-shortage-rcna91402&cid=article_share_pinterest\", \"text\": \"\"}, {\"link\": \"https://www.linkedin.com/shareArticle?mini=true&url=https://www.nbcnews.com/health/health-news/akorn-us-drugmaker-closure-escalating-drug-shortage-rcna91402&title=How%20one%20U.S.%20drugmaker%20contributed%20to%20the%20escalating%20drug%20shortage%20crisis&cid=article_share_linkedin\", \"text\": \"\"}, {\"link\": \"https://www.nbcnews.com/latest-stories\", \"text\": \"Latest Stories\"}, {\"link\": \"https://www.facebook.com/sharer/sharer.php?u=https://www.nbcnews.com/health/health-news/akorn-us-drugmaker-closure-escalating-drug-shortage-rcna91402&cid=article_social_share_facebook\", \"text\": \"\"}, {\"link\": \"https://www.twitter.com/intent/tweet?text=How%20one%20U.S.%20drugmaker%20contributed%20to%20the%20escalating%20drug%20shortage%20crisis&via=nbcnews&url=https://www.nbcnews.com/health/health-news/akorn-us-drugmaker-closure-escalating-drug-shortage-rcna91402&original_referer=https://www.nbcnews.com/health/health-news/akorn-us-drugmaker-closure-escalating-drug-shortage-rcna91402&cid=article_social_share_twitter\", \"text\": \"\"}, {\"link\": \"http://pinterest.com/pin/create/link/?url=https://www.nbcnews.com/health/health-news/akorn-us-drugmaker-closure-escalating-drug-shortage-rcna91402&cid=article_social_share_pinterest\", \"text\": \"\"}, {\"link\": \"mailto:?subject=How one U.S. drugmaker contributed to the escalating drug shortage crisis&body=https://www.nbcnews.com/health/health-news/akorn-us-drugmaker-closure-escalating-drug-shortage-rcna91402\", \"text\": \"\"}, {\"link\": \"sms:?&body=How one U.S. drugmaker contributed to the escalating drug shortage crisis via nbcnews - https://www.nbcnews.com/health/health-news/akorn-us-drugmaker-closure-escalating-drug-shortage-rcna91402\", \"text\": \"\"}]",
    "priceAndPlans": "Error: Timeout 30000ms exceeded. =========================== logs\n=========================== navigating to\n\"http://web.archive.org/web/20240123195428/https://www.nbcnews.com/\", waiting\nuntil \"load\" ============================================================\n\n"
}