{
    "summary": "This website uses cookies. By continuing to use this site, you are giving your\nconsent to cookies being used. See our Privacy policy for more info.\n\n__\n\n  * Home\n  * About us \n  * Join us \n  * Contact\n  * Jobs\n  * Upload CV\n\nYou are here: Home > Who are the top 10 pharmaceutical companies in the world?\n(2023)\n\n### Content types\n\n  * Quizzes \n  * Blogs \n  * Guidebooks \n  * Videos \n  * Infographics \n  * Case studies \n  * Press releases \n\n### Tags\n\n  * Career Advice \n  * Contracting/Freelancing \n  * Digital health \n  * Employee Engagement & Retention \n  * Employer Advice \n  * Employer Brand \n  * Leadership \n  * Life Science news \n  * Proclinical News \n  * Top 10s \n  * Working in Recruitment \n  * Workplace Diversity \n\n### Latest jobs\n\nAdministrative Clerk\n\nSalary\n\nHighly Competitive Salary\n\nLocation:\n\nPlainsboro, USA\n\nProclinical Staffing is seeking an Administrative Clerk to join global\npharmaceutical company.\n\nApply\n\nShortlist\n\nQC Scientist\n\nSalary\n\nHighly Competitive Salary\n\nLocation:\n\nMount Vernon, USA\n\nProclinical Staffing is seeking a QC Scientist to join cutting-edge recruiting\nfirm.\n\nApply\n\nShortlist\n\n#  Who are the top 10 pharmaceutical companies in the world? (2023)\n\nour consultant managing the role\n\nAuthor:  Hannah Burke\n\nPosting date: 27/07/2023\n\nShare this post __ __ __ __\n\n#  \n\n# Who are the top 10 pharmaceutical companies in the world (2023)?\n\n  \n\nThe pharmaceutical industry continues to grow rapidly and was valued at a\nremarkable US$1.48 trillion in 2022. Despite disruptions caused by the\nCovid-19 pandemic in recent years, pharmaceutical companies have remained\nagile. New medications are constantly being developed, approved and marketed,\npowering market growth.\n\n## The pharmaceutical market in 2022\n\nIn 2022, 37 new molecular entities were approved, a slowdown from 2021 when 42\ndrugs were given the green light, this was largely down to a more stringent\ncriteria on approvals. However, non-NME and biosimilar approvals were up in\n2022.\n\nA number of drug patents expired in 2022, including Bristol Myers Squibb’s\nRevlimid, Roche’s Lucentis, and AbbVie’s Restasis. The pharma industry in 2023\nis set to face further shake-ups, many more blockbuster drugs from Johnson &\nJohnson, AbbVie, Roche and other companies are set to face their first generic\nor biosimilar competitors in the largest global pharma market, the US. As\nalways, the patent expirations should create quite a disturbance for many of\nthe top players.\n\nMergers and acquisitions (M&A) are also gradually changing the marketplace and\nsome of the largest pharma companies have been strengthened through joining\nforces with or being bought out by other businesses. Heading into 2022, top\npharma companies had $1.7 trillion of deals in the pipeline, but many of those\ndidn’t materialise, 2023 so far has also been lacklustre in terms of M&A\nactivity too.\n\nThe below list of the top 10 biggest pharma companies in the world in 2023 is\nranked by 2022 revenue for pharmaceutical sales only.\n\n  \n\n## The top 10 pharmaceutical companies in the world in 2023\n\n### 10\\. GSK US$36.15 (+11%)\n\nUK-based multinational company, GlaxoSmithKline remains in tenth place. Formed\nby the merger of Glaxo Wellcome plc and SmithKline Beecham plc in 2000, GSK\nspecialises in fields of pharmaceutical, biologics, vaccines and consumer\nhealthcare.\n\nIn July 2022, GSK completed the demerger of the Consumer Healthcare business\nfrom the GSK Group to form the Haleon Group. A year on and the demerger has\nalready started to pay dividends, allowing GSK to focus purely on\nbiopharmaceuticals, prioritising investment towards the development of\ninnovative vaccines and speciality medicines. In 2022, sales for the company’s\npharmaceuticals and vaccines segments added up to US$36.15mn, an increase of\n11% YOY. Growth was driven by a solid performance across speciality medicines\nand vaccines, including record sales for the shingles vaccine, Shingrix.\n\nLooking ahead, CEO Emma Walmsley is confident in their ability to deliver\nlong-term sales ambition and growth through the next 10 years. As of the start\nof 2023, the company announced they had a strong pipeline of 69 vaccines and\nspeciality medicines based on the science of the immune system, with 18 in\nphase III/registration. By June 2023, the FDA and European Medicines Agency\napproved GSK’s Arexvy, the world’s first respiratory syncytial virus (RSV)\nvaccine for older adults. Arexvy is tipped to be a blockbuster and is hoped to\nbe as successful for the company as Shingrix.\n\n### 9\\. AstraZeneca US$44.35 (+16%)\n\nHeadquartered in Cambridge, UK, AstraZeneca specialises in providing solutions\nfor major disease areas, including oncology, cardiovascular, gastrointestinal,\ninfection, neuroscience, respiratory and inflammation.\n\nAstraZeneca acquired American pharma company, Alexion, in 2021 helping them to\nstrengthen their rare disease portfolio. With the acquisition sinking in for a\nfull year, in 2022 AstraZeneca’s total full-year revenue surpassed an\nimpressive $40 billion for the first time in the company’s history. The\ncompany made excellent progress with a record 34 approvals in major markets,\nand also has some high potential medicines such as camizestrant and\ndatopotamab in late-stage trials. For full year 2023, AstraZeneca expects to\nsee another year of double-digit revenue growth (excluding Covid-19), as they\ncontinue to invest in their strong pipeline, with new launches boosting\nprofitability.\n\nThe company’s R&D success and revenue increase in 2022 demonstrates that they\nare on track to deliver solid revenue growth through to 2025 and beyond with\nthe aim to deliver at least fifteen new medicines before the end of the\ndecade.\n\n### 8\\. Sanofi US$45.22 (+1%)\n\nOver the last half century, Sanofi has grown into one of the world’s leading\nhealthcare companies and is the eighth largest pharmaceutical company in the\nworld by revenue in 2023. Sanofi provides healthcare solutions to over 100\ncountries worldwide and has three core focuses: speciality care, vaccines, and\ngeneral medicines.\n\nIn 2022, Sanofi’s global sales totalled just under €43 billion ($45bn) up by\n7% in euros from 2021, this was largely owing to healthy sales for Dupixent,\neczema treatment. The FDA originally approved Dupixent in 2017 for atopic\ndermatitis, and recently it has been approved for new uses, including asthma\nand eosinophilic esophagitis, which has been powering sales. The company’s\nvaccines portfolio also performed well and remained a key driver of growth.\n\nThe company launched a new brand identity in 2022, which kick-started a new\nlong-term growth strategy for the business, with strong pipelines for\ninnovative medicine in oncology, inflammation and immunology. Looking ahead,\nSanofi plans to continue to invest in R&D to further strengthen their\npipelines.\n\nIn the 2022 earnings report, CEO of Sanofi, Paul Hudson commented, “With ten\nconsecutive quarters of growth, the progress we’ve made in the past three\nyears speaks for itself. As we launch the next phase of our strategy, our\ncontinued commitment to investing in the science will be crucial to\nmaintaining a steady-state cadence of first and best-in-class medicines.”\n\n### 7\\. Bristol-Myers Squibb US$46.16 (0%)\n\nIn seventh place in 2023 is global biopharma, Bristol-Myers Squibb. With a\nlegacy in healthcare innovation dating back to the early 1800s, the company\nhas made significant medical advances in oncology, hematology, immunology and\ncardiovascular disease.\n\nBristol-Myers Squibb’s sales totalled US$46.2bn in 2022, consistent with prior\nyear (-0.5%) or an increase of 3% when excluding foreign exchange. The slight\ndrop in sales is largely owing to the loss of exclusivity for multiple myeloma\ntreatment, Revlimid. Sales for Revlimid peaked at $12.8 billion in 2021 but\ndropped 22% to $10 billion last year and Bristol-Myers Squibb expects an even\nmore significant decline in 2023. Despite losses for Revlimid, the company\npredicts revenue will increase in 2023 as it anticipates healthy growth from\ntwo of their blockbusters —Eliquis and Opdivo - as well as boosts from newly\napproved products.\n\n###  6\\. Roche US$50.38 (+4%)\n\nWith over 125 years of history in medical innovation, Roche is at the\nforefront of oncology, immunology, infectious diseases, ophthalmology and\nneuroscience, and is split into two divisions: pharma and diagnostics. In\n2022, the pharmaceutical segment accounted for 72% of their overall revenues,\nwith sales of CHF45.6bn (US$50.38). Roche continued to be negatively impacted\nby continued declines for cancer drugs Rituxan, Herceptin and Avastin with\nmore biosimilar competition. Roche also saw a decline for Covid-19 treatments,\nwith sales for Actemra falling by a significant 22%. However, losses were\noffset by growth from some of Roche’s best performers, including multiple\nsclerosis treatment Ocrevus, Hemophilia A drug Hemlibra and cancer\nimmunotherapy, Tecentriq.\n\nIn early 2023, Roche announced a series of changes to the leadership team.\nThomas Schinecker, Ph.D., became the new CEO as Severin Schwan rose to\nchairman; and Teresa Graham took over from Bill Anderson, who left to lead\nBayer, as new Pharmaceuticals CEO.\n\nLooking ahead, Severin Schwan commented in the earnings press release that\nRoche expects “solid underlying growth in both divisions, which will largely\ncompensate for the further significant drop in sales of roughly CHF 5 billion\nin Covid-19 products,” in 2023.\n\n### 5\\. Novartis US$50.54 (-2%)\n\nJust beating Roche into the top 5 is Swiss multinational pharmaceutical\ncompany, Novartis. For over a quarter of a millennium, Novartis has developed,\nmanufactured and marketed breakthrough medicines. Now with presence in 155\ncountries across the world, the company focuses on innovative medicines, as\nwell as generics and biosimilars.\n\n2022 was a major year of transformation for Novartis, with the spin-off of\nSandoz and the biosimilars division, the merger of their Oncology and\nPharmaceuticals commercial organisations and the joining of forces of their\nmanufacturing and services activities to form a new Operations organisation.\nThis streamlining has all been carried out in a bid to further improve\ninnovation capabilities and strengthen their position as a purely medicines\nfocussed company, as they hone in on their efforts to become one of the top\nfive drugmakers in the United States by 2027.\n\nFull year revenues fell by 2%, but were up by 4% at constant currencies. A\nthird of Innovative Medicines sales were down to the company’s six key brands\n(Cosentyx, Entresto, Promacta/Revolade, Gilenya, Tasigna and Lucentis).\nEntresto, cardiovascular treatment, remained the company’s star performer,\nwith sales increasing by over 30% to $4,644 million. Generic competition had a\nnegative impact on multiple sclerosis medicine, Gilenya, chronic iron overload\ntablet, Exjade, and immunosuppressant, Afinitor.\n\nCommenting on 2022 results, Vas Narasimhan, CEO of Novartis, said “Novartis is\non track to become a pure-play innovative medicines company, uniquely\npositioned to leverage its global scale and R&D platforms”. He went on to say,\n“Looking ahead, we have a catalyst rich pipeline with 15 pivotal readouts in\nthe mid-term. We expect to continue to deliver improved financials and\nstrengthen Novartis ESG foundations, on our journey to become most trusted and\nvalued medicines company in the world”.\n\n### Merck & Co US$52.01 (+7%)\n\nPropelling from seventh position to fourth in 2023 is Merck & Co. Founded in\n1891, Merck is headquartered in New Jersey and focuses on pharmaceuticals,\nvaccines and animal health. With 69,000 employees worldwide, the company is\nwell known for its contributions to diabetes and cancer care.\n\nOver the last few years Merck & Co has made their way up the ranks thanks to\ntheir blockbuster cancer immunotherapy, Keytruda. In 2022, Keytruda accounted\nfor 40% of the company’s pharmaceutical sales. Increased demand for Gardasil\nHPV vaccine and the ongoing paediatric launch of Vaxneuvance, as well as\ngrowth for hospital acute care products, also helped to boost Merck’s pharma\ndivision. Further growth in 2022 was partially offset by lower sales of\nJanuvia and Janumet, owing to increased generic competition and a decline for\nPneumovax 23, pneumococcal vaccine.\n\nAs Keytruda, moves toward the loss of market exclusivity in 2028, Merck has\nhad to look for new avenues for growth. In late 2021, it was announced the\nMerck was buying Acceleron Pharma for US$11.5bn, broadening its portfolio of\ntreatments that have brought in a new area of revenue for Merck.\n\nIn the full year 2022 earnings report, Robert M. Davis, chairman and chief\nexecutive officer said \"2022 was an exceptional year for Merck, which is a\ntestament to the profound impact our medicines and vaccines are having on\npatients globally,\". He went on to add, “Our science-led strategy is working\nas we continue to build a sustainable engine that will drive innovation and\ngenerate long-term value for patients and shareholders well into the next\ndecade.”\n\n### 3\\. Johnson & Johnson US$52.6 (+2%)\n\nJohnson & Johnson, also referred to as J&J, remains in third place in 2023.\nWith headquarters based in New Jersey, Johnson & Johnson develops and produces\npharmaceuticals, medical devices and consumer health goods.\n\nFor the company’s pharmaceutical division, sales rose by 2% in 2022 on a\nreported basis and 7% on an operational basis. This was driven by a number of\nkey performers, including Darzalex, a treatment of multiple myeloma, Stelara,\na treatment of a number of immune-mediated inflammatory diseases, Tremfya, a\nplaque psoriasis and psoriatic arthritis treatment, Erleada, a prostate cancer\ndrug and Invega sustenna/xeplio and Invega trinza/trevicta, an injectable\natypical antipsychotic for the treatment of schizophrenia in adults.\n\nIn an earnings report, Joaquin Duato, Chairman of the Board and Chief\nExecutive Officer, said “Our full year 2022 results reflect the continued\nstrength and stability of our three business segments, despite macroeconomic\nchallenges,” he went on to say “As we look ahead to 2023, Johnson & Johnson is\nwell-positioned to drive near-term growth, while also investing strategically\nto deliver long-term value.”\n\n### 2\\. AbbVie US$58.05 (+3%)\n\nWith over 50,000 employees spread over 70 countries, innovation-driven AbbVie\nis in second place. AbbVie was created in 2013, when the company separated\nfrom Abbott, and tends to drive its R&D efforts towards difficult-to-cure\ndiseases. Seven years later in 2020, AbbVie successfully acquired Allergan,\nwhich has strengthened the company’s position in a number of therapeutic areas\nincluding immunology, oncology and neuroscience.\n\nIn 2022 sales totalled US$58.05, an increase of 3% mainly driven by the\ncompany’s Immunology and Neuroscience portfolios. Humira, the rheumatoid\narthritis blockbuster drug generated $21.24 billion last year, a 3% increase\nfrom 2021. Although they are yet to see the true impact, AbbVie lost market\nexclusivity in the US for Humira, the company’s top drug and the bestselling\nnon-covid product in biopharma history. Which means AbbVie must find other\navenues for revenue and the company is hoping immunology duo Skyrizi and\nRinvoq will be their next star performers.\n\nIn a press release announcing the company’s full year results, Richard A.\nGonzalez, chairman and chief executive officer, AbbVie commented \"2022 was\nanother highly productive year capping a decade of outstanding performance.\nSince our inception, we have built a diverse portfolio of growth products with\nsignificant leadership positions, developed a robust pipeline of innovative\nassets and created a culture of strong execution,\" he went on to add, \"Looking\nforward, we have a solid foundation which will allow us to absorb the U.S.\nHumira loss of exclusivity, return to strong top-line growth in 2025 and drive\ntop-tier financial performance over the long term.\"\n\n### 1\\. Pfizer US$100.33 (+19%)\n\nTaking the number one spot in 2023 is American multinational pharmaceutical\nand biotechnology corporation, Pfizer. Pfizer specialises in the development\nof medicines and vaccines across a wide range of disciplines including\nimmunology, oncology, cardiology and neurology. Since the spin-off of Upjohn,\nwhich completed in 2020, the company has moved forward as a single focused\ninnovative biopharmaceutical company, working on the discovery, development,\nmanufacturing, marketing, sales and distribution of biopharmaceutical products\nworldwide.\n\nIn the fiscal year of 2021, Pfizer’s sales accelerated to an impressive\nUS$79.6bn with their year-on-year growth up 90%, thanks to its top-selling\nproduct Comirnaty, mRNA vaccine for Covid-19. Even though demand for the\ninoculation has dropped off, 2022 was still a monumental year for Pfizer with\nsales totalling $100.3 billion which represented an all-time high for the\ncompany.\n\nAs Pfizer continue to advance their R&D pipeline of potential breakthrough\nmedicines and vaccines, in 2022, the company managed to secure eight key\nregulatory approvals, completed 13 regulatory submissions and initiated 10\npivotal study starts. They also successfully completed four acquisitions—Arena\nPharmaceuticals, Biohaven Pharmaceuticals, Global Blood Therapeutics, and\nReViral— which has greatly strengthened their pharma offerings.\n\nIn an earnings statement, Dr. Albert Bourla, Chairman and Chief Executive\nOfficer, stated: “2022 was a record-breaking year for Pfizer, not only in\nterms of revenue and earnings per share, which were the highest in our long\nhistory, but more importantly, in terms of the percentage of patients who have\na positive perception of Pfizer and the work we do. As proud as we are about\nwhat we have accomplished, our focus is always on what is next. As we turn to\n2023, we expect to once again set records, with potentially the largest number\nof new product and indication launches that we’ve ever had in such a short\nperiod of time. We believe that the combination of these expected near-term\nlaunches, additional pipeline products that could potentially come to market\nin the medium-term, and anticipated contributions from business development,\nhas the potential to set the company up for continued robust growth through\nthe rest of this decade and beyond.”\n\n## Is your pharmaceutical company aiming to grow this year?\n\nAt Proclinical Staffing, we work with a number of leading global\npharmacuetical companies. Our dedicated pharmaceutical recruitment team are\nspecialists in sourcing skilled and experienced professionals to fill a wide\nvariety of roles across all areas of the pharma industry, including biotech,\ngenomics, vaccines, generics, biosimilars, and OTC medicines. Find out more\nabout our range of workforce solutions and how we can help your business grow\nglobally.\n\n## Interested in working for one of the top pharma companies?\n\nAt Proclinical Staffing, we are specialists at recruiting for all types of\npharmaceutical jobs. If you’re looking for a new position, simply send us your\nCV or use our job search tool to find the right role for you.\n\nShare this post __ __\n\n### Latest Posts\n\n### Leading remotely: How to retain remote workers\n\nby  Hannah Burke\n\n03 Nov 23\n\n### Proclinical broadens its network of offices by opening in Munich\n\nby  Hannah Burke\n\n12 Oct 23\n\n### Who are the top 10 medical device companies in the world in 2023?\n\nby  Dove Jociute\n\n09 Oct 23\n\n### Proclinical honoured with International Recruitment Company of the Year\naward\n\nby  Hannah Burke\n\n03 Oct 23\n\n### Leadership strengths quiz\n\nby  Hannah Burke\n\n29 Jun 23\n\n### Diabetes MedTech, IT team build for EU product launch\n\nby  Proclinical Staffing\n\n23 Jun 23\n\n### American biotech, sales team build-out in Germany\n\nby  Proclinical Staffing\n\n23 Jun 23\n\n### 10 of the most important vaccines in history\n\nby  Hannah Burke\n\n21 Jun 23\n\n### Top 10 global pharmaceutical companies to work for according to Glassdoor\n\nby  Hannah Burke\n\n30 May 23\n\n### Top 10 biotech companies to watch in 2023\n\nby  Max Robinson\n\n10 May 23\n\nprev\n\nnext\n\n### Latest jobs\n\nAdministrative Clerk\n\nSalary\n\nHighly Competitive Salary\n\nLocation:\n\nPlainsboro, USA\n\nProclinical Staffing is seeking an Administrative Clerk to join global\npharmaceutical company.\n\nJanelle Jones\n\nApply\n\nShortlist\n\nQC Scientist\n\nSalary\n\nHighly Competitive Salary\n\nLocation:\n\nMount Vernon, USA\n\nProclinical Staffing is seeking a QC Scientist to join cutting-edge recruiting\nfirm.\n\nJackie Cerchio\n\nApply\n\nShortlist\n\nSenior Accounts Payable Consultant\n\nSalary\n\nHighly Competitive Salary\n\nLocation:\n\nRaleigh, USA\n\nProclinical Staffing is seeking a Senior Accounts Payable Consultant to join\ncutting-edge recruiting firm.\n\nJackie Cerchio\n\nApply\n\nShortlist\n\nLead HTA Statistical Programmer\n\nSalary\n\nHighly Competitive\n\nLocation:\n\nMunich, Germany\n\nProclinical are recruiting for a Lead HTA Statistical Programmer to join a\npharmaceutical organisation. This role is on a permanent basis with the\nability to work remotely.\n\nHeidi Hennigan\n\nApply\n\nShortlist\n\nSolution Architect E-Commerce\n\nSalary\n\nHighly Competitive\n\nLocation:\n\nBerne, Switzerland\n\nProclinical are recruiting for a Solution Architect E-Commerce to join an\norganisation. This role is on a permanent basis and is located in Bern.\n\nTania Maphoso\n\nApply\n\nShortlist\n\nInnovation & Alliance Manager (Healthcare)\n\nSalary\n\nHighly Competitive\n\nLocation:\n\nSingapore River, Singapore\n\nProclinical is recruiting for an Innovation & Alliance Manager (Healthcare) to\njoin a global consultancy firm. This role is on a permanent basis and is\nlocated in Singapore.\n\nMandy Fang\n\nApply\n\nShortlist\n\nICT Security Officer / Security Officer 80-100%\n\nSalary\n\nHighly Competitive\n\nLocation:\n\nBaden-Württemberg, Germany\n\nProclinical are recruiting for an ICT Security Officer / Security Officer\n80-100% to join a healthcare organisation. This role is on a permanent basis\nand is located in Baden.\n\nTania Maphoso\n\nApply\n\nShortlist\n\nTeam Lead Inside Sales\n\nSalary\n\nHighly Competitive\n\nLocation:\n\nStarnberg, Germany\n\nFür unserne Kunden, ein mittelständisches Lifescience Unternehmen im Süden von\nMünchen suchen wir aktuell eine:n Teamleiter:in Vertriebsinnendienst\n\nMax Slevogt\n\nApply\n\nShortlist\n\nSenior Manager - Drug Product Manufacturing\n\nSalary\n\nHighly Competitive\n\nLocation:\n\nReykjavík, Iceland\n\nProclinical are recruiting for a Senior Manager - Drug Product Manufacturing\nto join a biotech organisation. This role is on a permanent basis and is\nlocated in the Nordics.\n\nDominic Williams\n\nApply\n\nShortlist\n\nOffice Manager - RO/BU\n\nSalary\n\nHighly Competitive\n\nLocation:\n\nСофия, България\n\nProclinical are recruiting for an Office Manager - RO/BU to join a\npharmaceutical organisation. This role is on a permanent basis and is located\neither in Sofia.\n\nMustaq Ahmed\n\nApply\n\nShortlist\n\nprev\n\nnext\n\n### Career advice\n\nFrom CV and interview tips to career guidance from our expert consultantsGet\ncareer advice\n\nclose\n\nJobs\n\nSearch\n\nclose\n\n  * Home\n  * About us \n  * Join us \n  * Contact\n  * Jobs\n  * Upload CV\n\n  * Proclinical Staffing\n  * Proclinical Consulting\n  * Proclinical Executive\n  * Proclinical Engage\n\n  * Job Opportunities\n  * Our Services\n  * Submit vacancy\n  * Insights and Advice\n  * Meet the Team\n\nLogin Header\n\n## Login\n\n* * *\n\nEmail\n\nPassword\n\nRemember Me\n\nLogin\n\nRegister a new account\n\nForgot your password?\n\nEmail  Please supply a valid email  Please supply a valid email\n\nReset\n\nPlease check your email inbox. If we were able to find an account using the\nemail address you provided, we will have sent instructions to you on how to\nreset your password. If you have not received anything after an hour or so, it\nmay mean you entered your email address incorrectly or do not have an account\nwith us.\n\n__Saved jobs 0\n\nYou currently have no jobs shortlisted!\n\n© 2023 Proclinical® | All Rights Reserved\n\n**Members of:**\n\n  * Modern slavery agreement\n\n  * Gender pay gap\n\n  * Privacy policy\n\n  * Sitemap\n\n  * Carbon Reduction Plan PPN 06/21\n\n**Connect with us:**\n\n__________\n\nPost\n\nKeyword: No Keyword\n\nOptions: No options\n\nLocation:\n\nCity:\n\nGeoOptions: No options\n\n",
    "links": "[{\"link\": \"https://www.proclinical.com/privacy-policy\", \"text\": \"Privacy policy\"}, {\"link\": \"https://www.proclinical.com/\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/index\", \"text\": \"Home\"}, {\"link\": \"https://www.proclinical.com/about-proclinical\", \"text\": \"About us \"}, {\"link\": \"https://www.proclinical.com/join-us\", \"text\": \"Join us \"}, {\"link\": \"https://www.proclinical.com/contact\", \"text\": \"Contact\"}, {\"link\": \"https://www.proclinical.com/job-opportunities\", \"text\": \"Jobs\"}, {\"link\": \"https://www.proclinical.com/upload-cv\", \"text\": \"Upload CV\"}, {\"link\": \"https://www.proclinical.com/\", \"text\": \"Home\"}, {\"link\": \"https://www.proclinical.com/quizzes\", \"text\": \"Quizzes\\n                    \"}, {\"link\": \"https://www.proclinical.com/blogs\", \"text\": \"Blogs\\n                    \"}, {\"link\": \"https://www.proclinical.com/guidebooks\", \"text\": \"Guidebooks\\n                    \"}, {\"link\": \"https://www.proclinical.com/videos\", \"text\": \"Videos\\n                    \"}, {\"link\": \"https://www.proclinical.com/infographics\", \"text\": \"Infographics\\n                    \"}, {\"link\": \"https://www.proclinical.com/case-studies\", \"text\": \"Case studies\\n                    \"}, {\"link\": \"https://www.proclinical.com/press-releases\", \"text\": \"Press releases\\n                    \"}, {\"link\": \"https://www.proclinical.com/posts/tags/career-advice\", \"text\": \"Career Advice\\n                \\n                \"}, {\"link\": \"https://www.proclinical.com/posts/tags/contractingfreelancing\", \"text\": \"Contracting/Freelancing\\n                \\n                \"}, {\"link\": \"https://www.proclinical.com/posts/tags/digital-health\", \"text\": \"Digital health\\n                \\n                \"}, {\"link\": \"https://www.proclinical.com/posts/tags/employee-engagement-retention\", \"text\": \"Employee Engagement & Retention\\n                \\n                \"}, {\"link\": \"https://www.proclinical.com/posts/tags/employer-advice\", \"text\": \"Employer Advice\\n                \\n                \"}, {\"link\": \"https://www.proclinical.com/posts/tags/employer-brand\", \"text\": \"Employer Brand\\n                \\n                \"}, {\"link\": \"https://www.proclinical.com/posts/tags/leadership\", \"text\": \"Leadership\\n                \\n                \"}, {\"link\": \"https://www.proclinical.com/posts/tags/life-science-news\", \"text\": \"Life Science news\\n                \\n                \"}, {\"link\": \"https://www.proclinical.com/posts/tags/proclinical-news\", \"text\": \"Proclinical News\\n                \\n                \"}, {\"link\": \"https://www.proclinical.com/posts/tags/top-10s\", \"text\": \"Top 10s\\n                \\n                \"}, {\"link\": \"https://www.proclinical.com/posts/tags/working-in-recruitment\", \"text\": \"Working in Recruitment\\n                \\n                \"}, {\"link\": \"https://www.proclinical.com/posts/tags/workplace-diversity\", \"text\": \"Workplace Diversity\\n                \\n                \"}, {\"link\": \"https://www.proclinical.com/job/administrative-clerk-in-plainsboro-usa-jid-20099\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/job/administrative-clerk-in-plainsboro-usa-jid-20099\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/job/qc-scientist-in-mount-vernon-usa-jid-20098\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/job/qc-scientist-in-mount-vernon-usa-jid-20098\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/profile/hannah-burke\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/Profile/hannah-burke\", \"text\": \"\\n                    Hannah Burke\\n                \"}, {\"link\": \"https://www.proclinical.com/EmailToFriend?id=fc0f40d8-14c0-48d5-9b94-0a5cbdfc8558&pagetype=post\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/blogs/2023-11/leading-remotely-how-to-retain-remote-workers\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/blogs/2023-11/leading-remotely-how-to-retain-remote-workers\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/profile/hannah-burke\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/press-releases/2023-10/proclinical-broadens-its-network-by-opening-in-munich\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/press-releases/2023-10/proclinical-broadens-its-network-by-opening-in-munich\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/profile/hannah-burke\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/blogs/2023-10/top-10-medical-device-companies-in-the-world-in-2023\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/blogs/2023-10/top-10-medical-device-companies-in-the-world-in-2023\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/profile/dove-jociute\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/press-releases/2023-10/apsco-international-recruitment-company-of-the-year-award\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/press-releases/2023-10/apsco-international-recruitment-company-of-the-year-award\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/profile/hannah-burke\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/quizzes/2023-6/leadership-strengths-quiz\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/quizzes/2023-6/leadership-strengths-quiz\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/profile/hannah-burke\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/case-studies/2023-6/diabetes-medtech-it-team-build-for-eu-product-launch\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/case-studies/2023-6/diabetes-medtech-it-team-build-for-eu-product-launch\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/profile/proclinical-staffing\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/case-studies/2023-6/american-biotech-sales-team-build-out-in-germany\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/case-studies/2023-6/american-biotech-sales-team-build-out-in-germany\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/profile/proclinical-staffing\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/blogs/2023-6/10-of-the-most-important-vaccines-in-history\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/blogs/2023-6/10-of-the-most-important-vaccines-in-history\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/profile/hannah-burke\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/blogs/2023-5/top-10-global-pharmaceutical-companies-to-work-for\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/blogs/2023-5/top-10-global-pharmaceutical-companies-to-work-for\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/profile/hannah-burke\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/blogs/2023-5/top-10-biotech-companies-to-watch-in-2023\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/blogs/2023-5/top-10-biotech-companies-to-watch-in-2023\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/profile/max-robinson\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/job/administrative-clerk-in-plainsboro-usa-jid-20099\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/profile/janelle-jones\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/job/administrative-clerk-in-plainsboro-usa-jid-20099\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/job/qc-scientist-in-mount-vernon-usa-jid-20098\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/profile/jackie-cerchio\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/job/qc-scientist-in-mount-vernon-usa-jid-20098\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/job/senior-accounts-payable-consultant-in-raleigh-usa-jid-20097\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/profile/jackie-cerchio\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/job/senior-accounts-payable-consultant-in-raleigh-usa-jid-20097\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/job/lead-hta-statistical-programmer-in-munich-germany-jid-20096\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/profile/heidi-hennigan\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/job/lead-hta-statistical-programmer-in-munich-germany-jid-20096\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/job/solution-architect-e-commerce-in-berne-switzerland-jid-20095\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/profile/tania-maphoso\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/job/solution-architect-e-commerce-in-berne-switzerland-jid-20095\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/job/innovation-and-alliance-manager-healthcare-in-singapore-river-singapore-jid-20086\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/profile/mandy-fang\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/job/innovation-and-alliance-manager-healthcare-in-singapore-river-singapore-jid-20086\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/job/ict-security-officer-security-officer-80-100-in-baden-wuerttemberg-germany-jid-20094\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/profile/tania-maphoso\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/job/ict-security-officer-security-officer-80-100-in-baden-wuerttemberg-germany-jid-20094\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/job/team-lead-inside-sales-in-starnberg-germany-jid-20093\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/profile/max-slevogt\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/job/team-lead-inside-sales-in-starnberg-germany-jid-20093\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/job/senior-manager-drug-product-manufacturing-in-reykjavik-iceland-jid-20092\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/profile/dominic-williams\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/job/senior-manager-drug-product-manufacturing-in-reykjavik-iceland-jid-20092\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/job/office-manager-ro-bu-in--jid-20091\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/profile/mustaq-ahmed\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/job/office-manager-ro-bu-in--jid-20091\", \"text\": \"\"}, {\"link\": \"https://www.proclinical.com/posts/tags/Career%20advice\", \"text\": \"Get career advice\"}, {\"link\": \"https://www.proclinical.com/index\", \"text\": \"Home\"}, {\"link\": \"https://www.proclinical.com/about-proclinical\", \"text\": \"About us \"}, {\"link\": \"https://www.proclinical.com/join-us\", \"text\": \"Join us \"}, {\"link\": \"https://www.proclinical.com/contact\", \"text\": \"Contact\"}, {\"link\": \"https://www.proclinical.com/job-opportunities\", \"text\": \"Jobs\"}, {\"link\": \"https://www.proclinical.com/upload-cv\", \"text\": \"Upload CV\"}, {\"link\": \"https://www.proclinical.com/recruitment-solutions\", \"text\": \"Proclinical Staffing\"}, {\"link\": \"https://www.proclinical.com/consulting\", \"text\": \"Proclinical Consulting\"}, {\"link\": \"https://www.proclinical.com/executive\", \"text\": \"Proclinical Executive\"}, {\"link\": \"https://www.proclinical.com/managed-services\", \"text\": \"Proclinical Engage\"}, {\"link\": \"https://www.proclinical.com/job-opportunities\", \"text\": \"Job Opportunities\"}, {\"link\": \"https://www.proclinical.com/our-services\", \"text\": \"Our Services\"}, {\"link\": \"https://www.proclinical.com/submit-a-vacancy\", \"text\": \"Submit vacancy\"}, {\"link\": \"https://www.proclinical.com/posts\", \"text\": \"Insights and Advice\"}, {\"link\": \"https://www.proclinical.com/team/recruitment-team\", \"text\": \"Meet the Team\"}, {\"link\": \"https://www.proclinical.com/Register\", \"text\": \"\\n                                Register a new account\\n                            \"}, {\"link\": \"https://www.proclinical.com/privacy-policy\", \"text\": \"Privacy policy\"}, {\"link\": \"https://www.proclinical.com/sitemap\", \"text\": \"Sitemap\"}, {\"link\": \"https://www.proclinical.com/assets/file/9fef6f34-4dcd-48bd-13e8-08daff790325/acacium-group-carbon-reduction-plan-website-version.pdf\", \"text\": \"Carbon Reduction Plan PPN 06/21\"}]",
    "priceAndPlans": "Error: Timeout 30000ms exceeded. =========================== logs\n=========================== navigating to\n\"http://web.archive.org/web/20231221134057/https://www.proclinical.com/\",\nwaiting until \"load\"\n============================================================\n\n"
}