{
    "summary": "  * Skip to main content\n  * Skip to FDA Search\n  * Skip to in this section menu\n  * Skip to footer links\n\nAn official website of the United States government Here’s how you know\n\n**The .gov means it’s official.**  \nFederal government websites often end in .gov or .mil. Before sharing\nsensitive information, make sure you're on a federal government site.\n\n**The site is secure.**  \nThe **https://** ensures that you are connecting to the official website and\nthat any information you provide is encrypted and transmitted securely.\n\n# U.S. Food and Drug Administration\n\n  *   Search\n  *   Menu\n\nSearch FDA Submit search\n\n## Featured\n\n  * Contact FDA\n  * FDA Guidance Documents\n  * Recalls, Market Withdrawals and Safety Alerts\n  * Press Announcements\n  * Warning Letters\n  * Advisory Committees\n  * En Español\n\n## Products\n\n  * Food\n  * Drugs\n  * Medical Devices\n  * Radiation-Emitting Products\n  * Vaccines, Blood, and Biologics\n  * Animal and Veterinary\n  * Cosmetics\n  * Tobacco Products\n\n## Topics\n\n  * About FDA\n  * Combination Products\n  * Regulatory Information\n  * Safety\n  * Emergency Preparedness\n  * International Programs\n  * News and Events\n  * Training and Continuing Education\n  * Inspections and Compliance\n  * Science and Research\n\n## Information For\n\n  * Consumers\n  * Patients\n  * Industry\n  * Health Professionals\n  * Federal, State and Local Officials\n\nIn this section: Congressional Testimony\n\n  * Congressional Testimony \n\n    * Congressional Testimony 2018 - 2019\n    * Congressional Testimony 2017\n    * Congressional Testimony 2016\n\n  1. Home\n  2. News & Events\n  3. Congressional Testimony\n  4. Safeguarding Pharmaceutical Supply Chains in a Global Economy - 10/30/2019\n\n  1. Congressional Testimony \n\nTestimony\n\n#\n\nEvent Title\n\nSafeguarding Pharmaceutical Supply Chains in a Global Economy\n\n     October 30, 2019\n\n  * Share\n  * Post \n  * Linkedin\n  * Email\n  * Print\n\nTestimony of\n\n       \n  \n\nBefore the\n\n    \n\nRecipient\n\nHouse Committee on Energy and Commerce, Subcommittee on Health\n\n## **Introduction**  \n\nMadam Chairwoman, Ranking Member Burgess, and Members of the Subcommittee, I\nam Dr. Janet Woodcock, Director of the Center for Drug Evaluation and Research\n(CDER) at the Food and Drug Administration (FDA or the Agency), which is part\nof the Department of Health and Human Services (HHS).\n\nThe United States, through its investment in biomedical research, has become a\nworld leader in drug discovery and development, but is no longer in the\nforefront of drug manufacturing.  Historically, the production of medicines\nfor the U.S. population has been domestically based.  However, in recent\ndecades, drug manufacturing has gradually moved out of the United States.\nThis is particularly true for manufacturers of active pharmaceutical\ningredients (APIs), the actual drugs that are then formulated into tablets,\ncapsules, injections, etc.  As of August 2019, only 28 percent of the\nmanufacturing facilities making APIs to supply the U.S. market were in our\ncountry.  By contrast, the remaining 72 percent of the API manufacturers\nsupplying the U.S. market were overseas, and 13 percent are in China.  **(See\nFigure 1)** FDA’s data show that the number of registered facilities making\nAPIs in China more than doubled between 2010 and 2019.\n\n**Figure 1: Manufacturing Sites of APIs for U.S. Market by Country or\nRegion,**  \n **August 2019**\n\nWhile there are many reasons for this shift, underlying factors that are often\ncited include the fact that most traditional drug production processes require\na large factory site, often have environmental liabilities, and can utilize a\nlow-cost labor force.  A 2009 paper by the World Bank, “Exploratory Study on\nActive Pharmaceutical Ingredient Manufacturing for Essential Medicines,”\nstated that if a typical Western API company has an average wage index of 100,\nthis index is as low as 8 for a Chinese company and 10 for an Indian\ncompany.[1]  China has lower electricity, coal, and water costs. Chinese firms\nare also embedded in a network of raw materials and intermediary suppliers,\nand so have lower shipping and transaction costs for raw materials.  They also\nface fewer environmental regulations regarding buying, handling, and disposing\nof toxic chemicals, leading to lower direct costs for these firms.  FDA’s 2011\nreport, “Pathway to Global Product Safety and Quality,” noted that both China\nand India enjoy a labor cost advantage and that API manufacturing in India can\nreduce costs for U.S. and European companies by an estimated 30 percent to 40\npercent.[2]\n\nUsing traditional pharmaceutical manufacturing technology, a U.S.-based\ncompany could never offset the labor and other cost advantages that China\nenjoys simply by achieving higher productivity.  However, FDA believes that\nadvanced manufacturing technologies could enable U.S.-based pharmaceutical\nmanufacturing to regain its competitiveness with China and other foreign\ncountries, and potentially ensure a stable supply of drugs critical to the\nhealth of U.S. patients.  Advanced manufacturing is a collective term for new\nmedical product manufacturing technologies that can improve drug quality,\naddress shortages of medicines, and speed time-to-market.  Every field has a\ndifferent set of production techniques that are considered advanced.  Examples\nof some cross-cutting advanced manufacturing technologies include continuous\nmanufacturing and 3D printing.  Advanced manufacturing technology, which FDA\nsupports through its Emerging Technology Program (ETP), has a smaller facility\nfootprint, lower environmental impact, and more efficient use of human\nresources than traditional technology, as will be explained later in this\ntestimony.\n\nThe pharmaceutical sector relies heavily on foreign sourcing for critical\ncomponents, materials, and finished products, as identified in the U.S.\nDepartment of Commerce’s Office of Technology Evaluation’s 2011 report,\n“Reliance on Foreign Sourcing in the Healthcare and Public Health (HPH)\nSector:  Pharmaceuticals, Medical Devices and Surgical Equipment.”[3]\nHowever, use of foreign-sourced materials creates vulnerabilities in the U.S.\ndrug supply.  For example, in August 2018 FDA issued an alert that a Chinese\nAPI manufacturer, Sichuan Friendly Pharmaceutical Co. Limited, was recalling\ncertain lots of porcine thyroid API due to inconsistent quality of the API.[4]\nThis thyroid API comes from porcine (pig) thyroid glands and is used to make a\nmedicine to treat hypothyroidism (underactive thyroid).  FDA laboratory\ntesting confirmed that the Sichuan Friendly API had inconsistent levels of\nactive ingredients and should not be used to manufacture or compound drugs for\npatient use.  Risks associated with over- or undertreatment of hypothyroidism\ncould result in permanent or life-threatening adverse health consequences.\n\nIn December 2015, FDA alerted drug compounders that certain lots of baclofen\nAPI manufactured by Chinese manufacturer Taizhou Xinyou Pharmaceutical &\nChemical Co., Limited might be at risk for contamination with particulates and\nshould not be used to compound sterile injectable drugs.  Taizhou manufactures\nAPIs for repackagers and distributors, some of which sell these products to\ncompounding facilities in the United States.[5]\n\nFDA contacted Taizhou and the company confirmed that, due to the level of\ncontrols in the manufacturing process, the baclofen API it manufactures was\nnot suitable for use in injectable drugs.  FDA recommended that no baclofen\nAPI from Taizhou be used to manufacture or compound any injectable drugs.  The\naffected API potentially could have posed serious safety risks for U.S.\npatients who used or received injectable drug products compounded with the\naffected baclofen, especially when administered directly into the spine\n(intrathecally).  There was also a potential risk that the baclofen API might\nhave been contaminated by endotoxin or microorganisms.\n\nToday, I would like to share CDER’s information about the location of API\nmanufacturing facilities in China, the United States, and the rest of the\nworld; discuss the implications for national security; and explain how\nadvanced manufacturing can increase the security and reliability of the U.S.\ndrug supply.\n\n## **Explanation of CDER’s Data and its Limitations**\n\nFrom a national security perspective, it is useful to look at the locations of\nfacilities for three sets of drugs:\n\n  * All drugs on the U.S. market, including brand and generic drugs under approved applications, over-the-counter (OTC) drugs, and compounded medications.\n  * Drugs on the World Health Organization (WHO) Essential Medicines List that are marketed in the United States.\n  * Drugs on the medical countermeasures (MCM) lists.  These include drugs we would use to counter biological, chemical, nuclear, or radiation threats and influenza.\n\nCDER maintains a Site Catalog (“Catalog”) of all manufacturing facilities\nmaking drugs for the U.S. market, either through an approved application or\nthat have registered and listed to supply drugs for the U.S market.  This\nincludes suppliers for API, finished dosage forms (FDF), or both.  The APIs\nmanufactured in these facilities may be used in prescription drugs (brand or\ngeneric), OTC drugs, and compounded drugs.\n\nData available to CDER have several limitations, including the following:\n\n  * Facilities listed in the Catalog may or may not be producing APIs.  Including a facility in an application or the registration and listing process does not require a facility to produce API.  Producing an API at the facility, or not producing it, is a business decision made by the company. \n  * Manufacturers are not required to report to FDA whether they are actually producing an API at a facility, and if they are, the volume they are producing. \n  * APIs made in listed facilities may be used in drugs for both the U.S. and other markets, and some APIs distributed in the United States are subsequently formulated into FDF that are then exported. \n  * Some FDF applications list more than one API supplier in the application.  FDA has no visibility into which API supplier an FDF manufacturer uses at any given time.\n  * CDER has limited information about API suppliers for products that do not need an approved application from FDA to be marketed, such as compounded and OTC monograph drugs.  API suppliers for such products may not register their facility with FDA if they are sending material to a drug product manufacturer outside the United States to make the FDF, which is then sold in the United States.\n  * Information in the Catalog is continually being updated.  The analysis presented below is based on August 2019 listings and represents a snapshot at a point in time.\n\nThese limitations mean that, although CDER can describe the locations of API\nmanufacturing facilities, we cannot determine with any precision the volume of\nAPI that China is actually producing, or the volume of APIs manufactured in\nChina that is entering the U.S. market, either directly or indirectly by\nincorporation into finished dosages manufactured in China or other parts of\nthe world.\n\n## API Manufacturing Facilities for All Regulated Drug Products\n\nCDER’s analysis shows that overall, China has only a modest percentage of the\nfacilities able to produce APIs for the U.S. market.  For all regulated drugs,\nChina has 230 (13 percent) of the API manufacturing facilities, while the\nUnited States has 510 (28 percent), and the rest of the world has 1048 (59\npercent).  “All regulated drugs” includes prescription (brand and generic),\nOTC, and compounded drugs.   **(See Figure 2)** However, the percentages of\nAPIs produced at these facilities may differ, and as mentioned above, cannot\nbe determined from the data available to FDA.\n\n**Figure 2: Number and Percentage of API Manufacturing Facilities for All\nDrugs by Region, August 2019**\n\n** **\n\n## API Manufacturing Facilities for WHO Essential Medicines on the U.S. Market\n\nThe 2019 WHO Essential Medicines List comprises 461 drugs that have been\nselected by the WHO Expert Committee to meet the most important needs in a\nhealth system.  This list includes application and non-application products\nacross a wide range of therapeutic categories such as anesthetic,\nantibacterial, antidepressant, antiviral, cardiovascular, anti-diabetic, and\ngastrointestinal agents.  \nFDA matched 370 of the drugs on the WHO Essential Medicines List with products\nlisted for the U.S. market and determined the location of the facilities used\nto make their APIs.[6]  FDA data show that there is a total of 1,079 API\nfacilities worldwide that make the 370 drugs on the WHO list that are marketed\nin the U.S.  Of these, 166 (15%) are in China, 221 (21%) are in the United\nStates, and 687 (64%) are in the rest of the world.   **(See Figure 3)**\n\n**Figure 3:   Number and Percentage of API Facilities for the 370 U.S.\nMarketed Drugs on the 2019 WHO Essential Medicines List**\n\nFDA determined that there are three WHO Essential Medicines whose API\nmanufacturers are based only in China.  The three medicines are: capreomycin\nand streptomycin, both indicated to treat Mycobacterium tuberculosis; and\nsulfadiazine, used to treat chancroid and trachoma.\n\nThe distribution of API facilities worldwide varies from drug to drug and may\ndiffer from the patterns for all drugs or WHO Essential Medicines List Drugs.  \n\n## API Manufacturing Facilities for Medical Countermeasures\n\nFDA maintains a list of drugs that are used as medical countermeasures (MCMs)\nagainst threats in four categories:  biological threats, chemical threats,\ninfluenza, and radiation threats.  Many of these drugs are contained in\nstrategic drug stockpiles, including the Nation’s Strategic National\nStockpile, the Nation’s largest supply of potentially life-saving\npharmaceuticals and medical supplies for use in a public health emergency\nsevere enough to cause local supplies to run out.\n\nFor APIs for 14 drugs in the biological threat category, China has 37\nfacilities, the United States has 19, and the rest of the world has 117.\nChina has just six of the facilities producing APIs for the 10 drugs in the\nchemical threat category, versus 24 in the United States and 52 in the rest of\nthe world. **(See Table 1)**\n\n**MCM Type   **  \n **(# products)** | **U.S. API Sites  **  \n **# (%)** | **China API Sites**  \n **# (%)** | **Other Foreign API Sites  \n# (%)**  \n---|---|---|---  \nBiological (14) | 19 (11%) | 37 921% | 117 (68%)  \nChemical (10) | 24 (29%) | 6 (7%) | 52 (64%)  \nInfluenza (3) | 2 (11%) | 0 (0%) | 16 (89%)  \nRadiation (7) | 13 (46%) | 0 (0%) | 15 (54%)  \n  \n**Table 1:   Number and Percent of API Manufacturing Sites for MCM Drugs for\nUse Against Biological, Chemical, and Radiation Threats, and Influenza, August\n2019**\n\nChina has none of the facilities making APIs for medicines to prevent or treat\ninfluenza versus two in the United States and 16 in the rest of the world.\nChina also has none of the facilities producing APIs for radiation threats.\nThe United States has 13 of these facilities versus 15 in the rest of the\nworld.\n\nCiprofloxacin and doxycycline are two drugs considered critical as MCMs and\nused to treat anthrax and plague.  As shown in Table 2 below, the United\nStates has one facility for ciprofloxacin, versus three in China and 21 in\nother foreign countries.  The United States has fewer facilities than China or\nother foreign countries for doxycycline. **(See Table 2)**\n\nMCM | # (%) U.S. API Sites | # (%) China API Sites | **# (%) Other Foreign API\nSites**  \n---|---|---|---  \nCiprofloxacin | 1 (4%) | 3 (12%) | 21 (84%)  \nDoxycycline | 2 (18%) | 3 (27%) | 6 (55%)  \n  \n**Table 2:   Number and Percent of API Manufacturing Sites for Ciprofloxacin\nand Doxycycline by Region, August 2019**\n\n## Implications for National Security\n\nThe security of the nation’s drug supply rests on three main factors: freedom\nfrom dependence on foreign sources of API, the resilience of our domestic\nmanufacturing base, and the reliability of the facilities that make products\nfor the U.S. market.\n\n**Dependence** :  How dependent are we on China, India, or other countries for\nthe APIs used in drugs produced for patients in the United States?  How has\nthis dependence changed over time?\n\nThe number of Chinese facilities producing APIs for the U.S. market has\nincreased over the past decade, as part of a massive movement of\npharmaceutical production offshore.  This movement is being driven by the\npharmaceutical industry’s desire for cost savings and less stringent\nenvironmental regulations.  Absent any intervention, FDA believes that this\ntrend is likely to continue.\n\nHowever, data available to FDA do not enable us to calculate the volume of\nAPIs being used for U.S.-marketed drugs from China or India, and what\npercentage of U.S. drug consumption this represents.  As mentioned above, we\ndo not know whether Chinese facilities are actually producing APIs, how much\nthey are producing, or where the APIs they are producing are being distributed\nworldwide, including in the United States.\n\n**Resilience:**   How resilient is the U.S. manufacturing base?  How quickly\ncould U.S.-based manufacturers increase their production of APIs to meet\ndomestic demand if China or India, or another country, ceased supplying the\nUnited States, particularly for drugs on the WHO Essential Medicines list or a\nsubset that is widely used by the U.S. population?\n\nTo answer this question, FDA would need to know:\n\n  * how much unused capacity exists in the U.S. manufacturing base for APIs;\n  * how much additional API this capacity could supply within a given time period;\n  * how far this capacity would go in filling the gap between U.S. patients’ needs and the amount available if China or India, or another country, were to reduce or stop the supply to the U.S. market; and\n  * how long would it take to increase production enough to meet patients’ needs, and whether the financial investment would be sustainable for the pharmaceutical industry.\n\nSince we do not currently know whether API manufacturing facilities are\nactually producing the drug, or in what volume, or what portion of U.S. drug\nconsumption is dependent on APIs from China or India, or another country, we\ncannot perform a reliable gap analysis.\n\nEven if we could estimate the potential API shortfall and available production\ncapacity, pharmaceutical companies make business decisions about whether to\nproduce a drug product, including an API, and FDA does not have the power to\ntell them to make a drug.  This provides additional uncertainty in assessing\nthe potential responsiveness of the U.S. manufacturing base to a crisis\ntriggered by another country’s withdrawal.\n\n**Reliability:** How reliable is the manufacturing base that produces APIs for\nthe U.S. market?\n\nFDA recently analyzed 163 drugs that went into shortage during the five-year\nperiod from 2013 to 2017 and found that quality problems were responsible for\nthe shortages 62 percent of the time.[7]    These shortages can worsen\npatients’ health outcomes by causing delays in treatment or changes in\ntreatment regimens, such as substituting less-effective or well-tolerated\nmedicines when a drug of choice is not available.  \nIn looking for ways to ensure Americans’ access to a supply of safe and\neffective drugs, we need to consider all three dimensions of the problem.\n\n## Summary of National Security Findings\n\nFDA’s information shows that overall, the number of China’s API facilities is\nsomewhat smaller than the United States, but comparable in size and growing.\nHowever, because of the limitations of available data, we cannot assess the\nextent of U.S. dependence on China.  For instance, we do not have information\nabout the volume of API being produced in China or even in the United States,\nor how much of China’s API output reaches the U.S. market through other\ncountries.\n\nSimilarly, we do not have information that would enable us to assess the\nresilience of the U.S. manufacturing base, should it be tested by China’s\nwithdrawal from supplying the U.S. market. We do know that the U.S. drug\nsupply is being compromised by drug shortages, in most cases triggered by\nmanufacturing quality problems by U.S.-based as well as foreign producers.\n\n## Advanced Manufacturing Offers a Multi-dimensional Solution\n\nAdvanced manufacturing is the use of innovative technology to improve products\nand processes.  Although widely used in some other industries, such as\nautomotive, aerospace, and semiconductors, advanced manufacturing is now just\nbeginning to be used by pharmaceutical companies. For API and/or FDF\nmanufacturing, new technologies include “continuous manufacturing” (CM),\nwherein the finished drug product is produced as a continuous stream, as\nopposed to traditional batch manufacturing where breaks or stops exist between\ndifferent processing steps.  In some examples of advanced pharmaceutical\nmanufacturing, production can be continuous from chemical synthesis of the\nactive ingredient through production of the tablets or other dosage forms.\n\nAdvanced manufacturing offers many advantages over traditional pharmaceutical\nmanufacturing, and if the United States invests in this technology, it can be\nused to reduce the Nation’s dependence on foreign sources of APIs, increase\nthe resilience of our domestic manufacturing base, and reduce quality issues\nthat trigger drug shortages or recalls.  For example:\n\n  * Product quality can be precisely controlled with modern automation and control systems and can be closely monitored during production by using high-resolution analytics.\n  * High technology, computer-controlled production facilities are better able to rapidly respond to changes in demand because they typically do not have the equipment scale-up issues associated with traditional methods and can be capable of seamlessly producing a variety of dosages and even dosage forms.\n  * Advanced manufacturing platforms also have a much smaller footprint than traditional manufacturing platforms, and the equipment can be made portable so that it can be moved closer to markets, reducing the need for transcontinental shipping of components.\n  * Medicines can be produced at lower cost than by traditional methods.\n  * Environmental impact of manufacturing is significantly reduced.\n\nBy supporting the growth of advanced manufacturing in the United States, we\ncan reduce our dependence on China and other overseas manufacturers for APIs\nas well as improve the resilience and responsiveness of our manufacturing base\nand reduce drug shortages.\n\nFDA’s advanced manufacturing initiative is fostering this growth in several\nways.\n\n## Emerging Technology Program (ETP)\n\nThe ETP, launched in late 2014, encourages and supports the adoption of\ninnovative technology to modernize pharmaceutical development and\nmanufacturing through close collaboration with industry and other relevant\nstakeholders starting from early technology development.\n\nTo reduce barriers to entry for advanced manufacturing, the Emerging\nTechnology Team (ETT) provides a gateway for the early (pre-submission)\ndiscussion of innovative technologies and approaches, even before a candidate\ndrug is identified.  The ETT supports the entry, assessment, and lifecycle\nmanagement of advanced manufacturing at CDER.  It provides subject matter\nexperts and fosters coordination within CDER and FDA’s Office of Regulatory\nAffairs (ORA) for precedent-setting issues regarding quality and good\nmanufacturing practices.  ETT serves as a hub for identification of\napplication-driven regulatory and research needs and provides strategic input\nfor supporting advanced manufacturing innovation.  Based on ETT efforts in\ncontinuous manufacturing, CDER’s Office of Pharmaceutical Quality (OPQ)\npublished a draft guidance, “Quality Considerations for Continuous\nManufacturing” of solid oral dosage forms in early 2019.[8]\n\nUnder this program, CDER has approved five drug applications utilizing\ncontinuous manufacturing for FDF manufacturing, and the first application\nutilizing 3-D printing technologies.  Currently, these drugs are being made in\nthe United States, and one drug is being made both in the United States and in\nthe United Kingdom.\n\n## Regulatory and Policy Initiatives\n\nThe adoption of advanced manufacturing technologies may pose a challenge to\nthe current regulatory framework, because most regulations were developed\nbased on traditional batch manufacturing methods under a unified\npharmaceutical quality system.  As a result, FDA has launched an effort to\nidentify and implement needed changes in the regulatory structure.  For\nexample, new policy and regulatory topics related to emerging technologies\ninclude the management of data-rich environments, the evolving concepts of\nprocess validation for advanced manufacturing systems, and the regulatory\noversight of post-approval changes for such systems.  Furthermore, CDER, in\ncollaboration with the Biomedical Advanced Research and Development Authority\n(BARDA), is working on a strategy and new regulatory framework to develop and\nimplement miniature, mobile manufacturing platforms (“Pharmacy on Demand”) for\nmanufacture of essential drugs near or at the point of care.\n\nFDA actively engages with stakeholders in industry, academia, and other\nregulatory agencies to identify and address regulatory hurdles to adoption of\nadvanced manufacturing.  For example, CDER, in partnership with FDA’s Center\nfor Biologics Evaluation and Research (CBER), is leading the International\nCouncil for Harmonisation of Technical Requirements for Pharmaceuticals for\nHuman Use (ICH) effort to develop the Q13 guideline on continuous\nmanufacturing of drug substances and drug products for both small-molecule and\nbiological products, which will help to achieve global regulatory\nharmonization.\n\n## Intramural and Extramural Research\n\nLaboratories in CDER’s OPQ actively conduct advanced manufacturing research\nand invest in equipment, facilities, and personnel with expertise to\ninvestigate these topics.  OPQ has established the Center of Excellence for\nManufacturing Science and Innovation to coordinate internal advances in\nmanufacturing research for both small molecules and biologics.  OPQ publishes\nand leads research on continuous manufacturing, advanced analytics for process\ncontrols, and modeling and simulation.  OPQ also provides training for\nassessment and inspection personnel.\n\nExtramurally, OPQ awards research grants and contracts for advanced\nmanufacturing and emerging technologies.  OPQ also participates in consortia\nwith academia and industry to identify new areas for research in advanced\nmanufacturing.  Participation in these intramural and extramural research\nefforts occurs with strong alignment and coordination between assessment,\npolicy, and surveillance offices.  This ensures that resources are allocated\nto projects that provide practical approaches to regulating innovative\ntechnologies.\n\nOn behalf of FDA, I would like to thank Congress for having the foresight to\nprovide resources to support our efforts to assist the pharmaceutical industry\nas it makes a transition from traditional manufacturing methods to the use of\nadvanced technologies.  These new tools and methods have the potential to\nreinvigorate our pharmaceutical manufacturing base and repatriate it from\noverseas.  This will help to ensure that Americans have a secure and reliable\nsupply of medicines in the future, as well as contribute to our economy.\n\n**Promoting Domestic Manufacturing**\n\nIn FY19, Congress approved appropriations to promote domestic manufacturing\nwith the intent that FDA advance modern drug and biological product\ntechnologies.  The spending plan for these additional resources builds on the\nCDER strategic goals to improve overall staff understanding and expertise in\nadvanced manufacturing by expanding support of these innovative technologies\nin assessment, policy, surveillance, and research, as well as by making\nprogrammatic improvements.  In addition, this funding is used to reinforce\nextramural outreach with stakeholders via planned technology forecasting\nactivities with the National Academies of Sciences, Engineering, and Medicine\nand other forums.\n\n## Conclusion\n\nThe increasing number of API manufacturing sites in China and other countries\nsuggests that the United States’ reliance on Chinese and other foreign sources\nof API is growing.  FDA has been working diligently in collaboration with\nindustry and other federal agencies to ensure our reliance of foreign\nmanufacturing does not pose a national security risk.  While FDA cannot tell\nindustry where they can and cannot manufacture APIs, we can work with industry\nto utilize new technologies and new manufacturing methods to further\nincentivize domestic production of drugs and APIs.  These new ways of making\ndrugs could, with the proper strategies, revitalize pharmaceutical\nmanufacturing in the United States.\n\n### Footnotes\n\n1\\. Bumpas, Janet; Betsch, Ekkehard.  _Exploratory study on active\npharmaceutical ingredient manufacturing for essential medicines (English)_.\nHealth, Nutrition and Population (HNP) discussion paper. Washington, DC: World\nBank. _Exploratory study on active pharmaceutical ingredient manufacturing for\nessential medicines External Link Disclaimer._  Accessed September 30, 2019.\n\n2\\. U.S. Food and Drug Administration, “Pathway to Global Product Safety and\nQualityExternal Link Disclaimer,” A Special Report, p. 20.  Accessed October\n4, 2019.\n\n3\\. See Reliance on Foreign Sourcing in the Healthcare and Public Health (HPH)\nSector: Pharmaceuticals, Medical Devices, and Surgical Equipment, accessed\nOctober 15, 2019.\n\n4\\. See FDA alerts drug makers of a recall of porcine thyroid API from Sichuan\nFriendly Pharmaceutical Co., Limited, China, accessed October 6, 2019.\n\n5\\. See FDA Warns of potential contamination of baclofen active pharmaceutical\ningredient from Taizhou Xinyou Pharmaceutical & Chemical Co., Limited, China\n_,_ accessed October 7, 2019.\n\n6\\. Some of the 461 drugs on the 2019 WHO Essential Medicines List were\nexcluded from the analysis because they are not regulated by CDER.  The List\nincludes products regulated by the Center for Biologics Evaluation and\nResearch (CBER), such as cholera vaccine and anti-rabies immunoglobulin, and\nproducts regulated by the Center for Devices and Radiological Health (CDRH),\nsuch as diaphragms and condoms.\n\n7\\. U.S. Food and Drug Administration, “Drug Shortages:  Root Causes and\nPotential Solutions,” October 2019.\n\n8\\. Quality Considerations for Continuous Manufacturing, Draft Guidance for\nIndustry, accessed October 15, 2019.\n\n\n\n  * ## Content current as of:\n\n10/29/2019\n\n  * \n\nMore Congressional  \nTestimonies\n\n  * Congressional Testimony \n\n    * Congressional Testimony 2018 - 2019\n    * Congressional Testimony 2017\n    * Congressional Testimony 2016\n\n## Footer Links\n\n  * FDA Archive\n  * About FDA\n  * Accessibility\n\n  * Visitor Information\n  * Website Policies / Privacy\n  * No FEAR Act\n  * Vulnerability Disclosure Policy\n\n  * FOIA\n  * HHS.gov\n  * USA.gov\n\nContact FDA Follow FDA on Facebook Follow FDA on X Follow FDA on Instagram  \nFollow FDA on LinkedIn View FDA videos on YouTube Subscribe to FDA RSS feeds\n\nFDA Homepage\n\nContact Number 1-888-INFO-FDA (1-888-463-6332)\n\nBack to Top\n\n",
    "links": "[{\"link\": \"https://www.fda.gov/\", \"text\": \"\"}, {\"link\": \"https://www.fda.gov/about-fda/contact-fda\", \"text\": \"Contact FDA\"}, {\"link\": \"https://www.fda.gov/regulatory-information/search-fda-guidance-documents\", \"text\": \"FDA Guidance Documents\"}, {\"link\": \"https://www.fda.gov/safety/recalls-market-withdrawals-safety-alerts\", \"text\": \"Recalls, Market Withdrawals and Safety Alerts\"}, {\"link\": \"https://www.fda.gov/news-events/newsroom/press-announcements\", \"text\": \"Press Announcements\"}, {\"link\": \"https://www.fda.gov/inspections-compliance-enforcement-and-criminal-investigations/compliance-actions-and-activities/warning-letters\", \"text\": \"Warning Letters\"}, {\"link\": \"https://www.fda.gov/advisory-committees\", \"text\": \"Advisory Committees\"}, {\"link\": \"https://www.fda.gov/about-fda/en-espanol\", \"text\": \"En Español\"}, {\"link\": \"https://www.fda.gov/food\", \"text\": \"Food\"}, {\"link\": \"https://www.fda.gov/drugs\", \"text\": \"Drugs\"}, {\"link\": \"https://www.fda.gov/medical-devices\", \"text\": \"Medical Devices\"}, {\"link\": \"https://www.fda.gov/radiation-emitting-products\", \"text\": \"Radiation-Emitting Products\"}, {\"link\": \"https://www.fda.gov/vaccines-blood-biologics\", \"text\": \"Vaccines, Blood, and Biologics\"}, {\"link\": \"https://www.fda.gov/animal-veterinary\", \"text\": \"Animal and Veterinary\"}, {\"link\": \"https://www.fda.gov/cosmetics\", \"text\": \"Cosmetics\"}, {\"link\": \"https://www.fda.gov/tobacco-products\", \"text\": \"Tobacco Products\"}, {\"link\": \"https://www.fda.gov/about-fda\", \"text\": \"About FDA\"}, {\"link\": \"https://www.fda.gov/combination-products\", \"text\": \"Combination Products\"}, {\"link\": \"https://www.fda.gov/regulatory-information\", \"text\": \"Regulatory Information\"}, {\"link\": \"https://www.fda.gov/safety\", \"text\": \"Safety\"}, {\"link\": \"https://www.fda.gov/emergency-preparedness-and-response\", \"text\": \"Emergency Preparedness\"}, {\"link\": \"https://www.fda.gov/international-programs\", \"text\": \"International Programs\"}, {\"link\": \"https://www.fda.gov/news-events\", \"text\": \"News and Events\"}, {\"link\": \"https://www.fda.gov/training-and-continuing-education\", \"text\": \"Training and Continuing Education\"}, {\"link\": \"https://www.fda.gov/inspections-compliance-enforcement-and-criminal-investigations\", \"text\": \"Inspections and Compliance\"}, {\"link\": \"https://www.fda.gov/science-research\", \"text\": \"Science and Research\"}, {\"link\": \"https://www.fda.gov/consumers\", \"text\": \"Consumers\"}, {\"link\": \"https://www.fda.gov/patients\", \"text\": \"Patients\"}, {\"link\": \"https://www.fda.gov/industry\", \"text\": \"Industry\"}, {\"link\": \"https://www.fda.gov/health-professionals\", \"text\": \"Health Professionals\"}, {\"link\": \"https://www.fda.gov/federal-state-local-tribal-and-territorial-officials\", \"text\": \"Federal, State and Local Officials\"}, {\"link\": \"https://www.fda.gov/news-events/congressional-testimony\", \"text\": \"\\n                                        Congressional Testimony\\n                    \"}, {\"link\": \"https://www.fda.gov/news-events/congressional-testimony/congressional-testimony-2018-2019\", \"text\": \"Congressional Testimony 2018 - 2019\"}, {\"link\": \"https://www.fda.gov/news-events/congressional-testimony/congressional-testimony-2017\", \"text\": \"Congressional Testimony  2017\"}, {\"link\": \"https://www.fda.gov/news-events/congressional-testimony/congressional-testimony-2016\", \"text\": \"Congressional Testimony 2016\"}, {\"link\": \"https://www.fda.gov/\", \"text\": \"Home\"}, {\"link\": \"https://www.fda.gov/news-events\", \"text\": \"News & Events\"}, {\"link\": \"https://www.fda.gov/news-events/congressional-testimony\", \"text\": \"Congressional Testimony\"}, {\"link\": \"https://www.fda.gov/news-events/congressional-testimony\", \"text\": \"\\n     Congressional Testimony\\n    \"}, {\"link\": \"https://www.fda.gov/drugs/drug-safety-and-availability/fda-alerts-drug-makers-recall-porcine-thyroid-api-sichuan-friendly-pharmaceutical-co-limited-china\", \"text\": \"FDA alerts drug makers of a recall of porcine thyroid API from Sichuan Friendly Pharmaceutical Co., Limited, China\"}, {\"link\": \"https://www.fda.gov/drugs/drug-safety-and-availability/fda-warns-potential-contamination-baclofen-active-pharmaceutical-ingredient-taizhou-xinyou\", \"text\": \"FDA Warns of potential contamination of baclofen active pharmaceutical ingredient from Taizhou Xinyou Pharmaceutical & Chemical Co., Limited, China\"}, {\"link\": \"https://www.fda.gov/about-fda/page-not-found\", \"text\": \"Quality Considerations for Continuous Manufacturing, Draft Guidance for Industry\"}, {\"link\": \"https://www.fda.gov/news-events/congressional-testimony\", \"text\": \"\"}, {\"link\": \"https://www.fda.gov/news-events/congressional-testimony\", \"text\": \"\\n                                        Congressional Testimony\\n                      \"}, {\"link\": \"https://www.fda.gov/news-events/congressional-testimony/congressional-testimony-2018-2019\", \"text\": \"Congressional Testimony 2018 - 2019\"}, {\"link\": \"https://www.fda.gov/news-events/congressional-testimony/congressional-testimony-2017\", \"text\": \"Congressional Testimony  2017\"}, {\"link\": \"https://www.fda.gov/news-events/congressional-testimony/congressional-testimony-2016\", \"text\": \"Congressional Testimony 2016\"}, {\"link\": \"https://www.fda.gov/about-fda/about-website/fdagov-archive\", \"text\": \"FDA Archive\"}, {\"link\": \"https://www.fda.gov/about-fda\", \"text\": \"About FDA\"}, {\"link\": \"https://www.fda.gov/about-fda/about-website/internet-accessibility\", \"text\": \"Accessibility\"}, {\"link\": \"https://www.fda.gov/about-fda/visitor-information\", \"text\": \"Visitor Information\"}, {\"link\": \"https://www.fda.gov/about-fda/about-website/website-policies\", \"text\": \"Website Policies / Privacy\"}, {\"link\": \"https://www.fda.gov/about-fda/jobs-and-training-fda/no-fear-act\", \"text\": \"No FEAR Act\"}, {\"link\": \"https://www.fda.gov/regulatory-information/freedom-information\", \"text\": \"FOIA\"}, {\"link\": \"https://www.fda.gov/about-fda/contact-fda\", \"text\": \"Contact FDA\"}, {\"link\": \"https://www.fda.gov/about-fda/contact-fda/subscribe-podcasts-and-news-feeds\", \"text\": \"\"}, {\"link\": \"https://www.fda.gov/\", \"text\": \"\"}]"
}