{
    "summary": "Skip to main content\n\nmenu\n\n## Main menu\n\n  * About CBO\n  * Topics\n  * Cost Estimates\n  * Data\n  * Interactives\n  * FAQs\n  * Blog\n\nEnter your keywords\n\nSearch Only:\n\nBill Number\n\nTitle\n\n### Refine Results By\n\n## Contents\n\n  * Summary\n    * What Are Recent Trends in Pharmaceutical R&D and New Drug Approvals?\n    * What Factors Influence Spending for R&D?\n  * Trends in R&D Spending and New Drug Development\n    * R&D Spending\n    * New Drug Development\n  * Factors That Influence R&D Spending\n    * Anticipated Revenues\n    * R&D Costs of a New Drug\n    * Public Policy\n  * About This Document\n\nFigures\n\n  * 1\\. Average R&D Intensities for Publicly Traded U.S. Companies, by Industry \n  * 2\\. Average Annual Approvals of New Drugs by the FDA\n  * 3\\. R&D Spending and New Drug Approvals\n  * 4\\. Total U.S. Retail Drug Spending by Therapeutic Class, 2009 and 2019\n  * 5\\. Worldwide and Domestic Revenues of PhRMA Member Firms\n  * 6\\. Federal Funding for the National Institutes of Health, Fiscal Years 1995 to 2020\n\n## Contents\n\n  * Summary\n    * What Are Recent Trends in Pharmaceutical R&D and New Drug Approvals?\n    * What Factors Influence Spending for R&D?\n  * Trends in R&D Spending and New Drug Development\n    * R&D Spending\n    * New Drug Development\n  * Factors That Influence R&D Spending\n    * Anticipated Revenues\n    * R&D Costs of a New Drug\n    * Public Policy\n  * About This Document\n\nFigures\n\n  * 1\\. Average R&D Intensities for Publicly Traded U.S. Companies, by Industry \n  * 2\\. Average Annual Approvals of New Drugs by the FDA\n  * 3\\. R&D Spending and New Drug Approvals\n  * 4\\. Total U.S. Retail Drug Spending by Therapeutic Class, 2009 and 2019\n  * 5\\. Worldwide and Domestic Revenues of PhRMA Member Firms\n  * 6\\. Federal Funding for the National Institutes of Health, Fiscal Years 1995 to 2020\n\nApril 2021\n\n#  Research and Development in the Pharmaceutical Industry\n\nReport's Home PageData and Supplemental Information\n\nRelated Publications\n\nDownload\n\nTable of Contents\n\n## At a Glance\n\nThis report examines research and development (R&D) by the pharmaceutical\nindustry.\n\n**Spending on R &D and Its Results.** Spending on R&D and the introduction of\nnew drugs have both increased in the past two decades.\n\n  * In 2019, the pharmaceutical industry spent $83 billion dollars on R&D. Adjusted for inflation, that amount is about 10 times what the industry spent per year in the 1980s.\n  * Between 2010 and 2019, the number of new drugs approved for sale increased by 60 percent compared with the previous decade, with a peak of 59 new drugs approved in 2018.\n\n**Factors Influencing R &D Spending. **The amount of money that drug companies\ndevote to R&D is determined by the amount of revenue they expect to earn from\na new drug, the expected cost of developing that drug, and policies that\ninfluence the supply of and demand for drugs.\n\n  * The expected lifetime global revenues of a new drug depends on the prices that companies expect to charge for the drug in different markets around the world, the volume of sales they anticipate at those prices, and the likelihood the drug-development effort will succeed.\n  * The expected cost to develop a new drug—including capital costs and expenditures on drugs that fail to reach the market—has been estimated to range from less than $1 billion to more than $2 billion.\n  * The federal government influences the amount of private spending on R&D through programs (such as Medicare) that increase the demand for prescription drugs, through policies (such as spending for basic research and regulations on what must be demonstrated in clinical trials) that affect the supply of new drugs, and through policies (such as recommendations for vaccines) that affect both supply and demand.\n\n## Notes\n\n## Notes\n\nTo remove the effects of inflation, the Congressional Budget Office adjusted\ndollar amounts with the gross domestic product price index from the Bureau of\nEconomic Analysis. Amounts are expressed in 2019 dollars.\n\n## Research and Development in the Pharmaceutical Industry\n\n## Summary\n\nEvery year, the U.S. pharmaceutical industry develops a variety of new drugs\nthat provide valuable medical benefits. Many of those drugs are expensive and\ncontribute to rising health care costs for the private sector and the federal\ngovernment. Policymakers have considered policies that would lower drug prices\nand reduce federal drug expenditures. Such policies would probably reduce the\nindustry’s incentive to develop new drugs.\n\nIn this report, the Congressional Budget Office assesses trends in spending\nfor drug research and development (R&D) and the introduction of new drugs. CBO\nalso examines factors that determine how much drug companies spend on R&D:\nexpected global revenues from a new drug; cost to develop a new drug; and\nfederal policies that affect the demand for drug therapies, the supply of new\ndrugs, or both.\n\n### What Are Recent Trends in Pharmaceutical R&D and New Drug Approvals?\n\nThe pharmaceutical industry devoted $83 billion to R&D expenditures in 2019.\nThose expenditures covered a variety of activities, including discovering and\ntesting new drugs, developing incremental innovations such as product\nextensions, and clinical testing for safety-monitoring or marketing purposes.\nThat amount is about 10 times what the industry spent per year in the 1980s,\nafter adjusting for the effects of inflation. The share of revenues that drug\ncompanies devote to R&D has also grown: On average, pharmaceutical companies\nspent about one-quarter of their revenues (net of expenses and buyer rebates)\non R&D expenses in 2019, which is almost twice as large a share of revenues as\nthey spent in 2000. That revenue share is larger than that for other\nknowledge-based industries, such as semiconductors, technology hardware, and\nsoftware.\n\nThe number of new drugs approved each year has also grown over the past\ndecade. On average, the Food and Drug Administration (FDA) approved 38 new\ndrugs per year from 2010 through 2019 (with a peak of 59 in 2018), which is 60\npercent more than the yearly average over the previous decade.\n\nMany of the drugs that have been approved in recent years are “specialty\ndrugs.” Specialty drugs generally treat chronic, complex, or rare conditions,\nand they may also require special handling or monitoring of patients. Many\nspecialty drugs are biologics (large-molecule drugs based on living cell\nlines), which are costly to develop, hard to imitate, and frequently have high\nprices. Previously, most drugs were small-molecule drugs based on chemical\ncompounds. Even while they were under patent, those drugs had lower prices\nthan recent specialty drugs have. Information about the kinds of drugs in\ncurrent clinical trials indicates that much of the industry’s innovative\nactivity is focused on specialty drugs that would provide new cancer therapies\nand treatments for nervous-system disorders, such as Alzheimer’s disease and\nParkinson’s disease.\n\n### What Factors Influence Spending for R&D?\n\nDrug companies’ R&D spending decisions depend on three main factors:\n\n  * Anticipated lifetime global revenues from a new drug,\n  * Expected costs to develop a new drug, and\n  * Policies and programs that influence the supply of and demand for prescription drugs.\n\nVarious considerations inform companies’ expectations about a drug’s revenue\nstream, including the anticipated prices it could command in different markets\naround the world and the expected global sales volume at those prices (given\nthe number of people who might use the drug). The prices and sales volumes of\nexisting drugs provide information about consumers’ and insurance plans’\nwillingness to pay for drug treatments. Importantly, when drug companies set\nthe prices of a new drug, they do so to maximize _future_ revenues net of\nmanufacturing and distribution costs. A drug’s sunk R&D costs—that is, the\ncosts already incurred in developing that drug—do not influence its price.\n\nDeveloping new drugs is a costly and uncertain process, and many potential\ndrugs never make it to market. Only about 12 percent of drugs entering\nclinical trials are ultimately approved for introduction by the FDA. In recent\nstudies, estimates of the average R&D cost per new drug range from less than\n$1 billion to more than $2 billion per drug. Those estimates include the costs\nof both laboratory research and clinical trials of successful new drugs as\nwell as expenditures on drugs that do not make it past the laboratory-\ndevelopment stage, that enter clinical trials but fail in those trials or are\nwithdrawn by the drugmaker for business reasons, or that are not approved by\nthe FDA. Those estimates also include the company’s capital costs—the value of\nother forgone investments—incurred during the R&D process. Such costs can make\nup a substantial share of the average total cost of developing a new drug. The\ndevelopment process often takes a decade or more, and during that time the\ncompany does not receive a financial return on its investment in developing\nthat drug.\n\nThe federal government affects R&D decisions in three ways. First, it\nincreases _demand_ for prescription drugs, which encourages new drug\ndevelopment, by fully or partially subsidizing the purchase of prescription\ndrugs through a variety of federal programs (including Medicare and Medicaid)\nand by providing tax preferences for employment-based health insurance.\n\nSecond, the federal government increases the _supply_ of new drugs. It funds\nbasic biomedical research that provides a scientific foundation for the\ndevelopment of new drugs by private industry. Additionally, tax credits—both\nthose available to all types of companies and those available to drug\ncompanies for developing treatments of uncommon diseases—provide incentives to\ninvest in R&D. Similarly, deductions for R&D investment can be used to reduce\ntax liabilities immediately rather than over the life of that investment.\nFinally, the patent system and certain statutory provisions that delay FDA\napproval of generic drugs provide pharmaceutical companies with a period of\nmarket exclusivity, when competition is legally restricted. During that time,\nthey can maintain higher prices on a patented product than they otherwise\ncould, which makes new drugs more profitable and thereby increases drug\ncompanies’ incentives to invest in R&D.\n\nThird, some federal policies affect the number of new drugs by influencing\nboth _demand and supply_. For example, federal recommendations for specific\nvaccines increase the demand for those vaccines and provide an incentive for\ndrug companies to develop new ones. Additionally, federal regulatory policies\nthat influence returns on drug R&D can bring about increases or decreases in\nboth the supply of and demand for new drugs.\n\n## Trends in R&D Spending and New Drug Development\n\nPrivate spending on pharmaceutical R&D and the approval of new drugs have both\nincreased markedly in recent years, resuming a decades-long trend that was\ninterrupted in 2008 as generic versions of some top-selling drugs became\navailable and as the 2007–2009 recession occurred. In particular, spending on\ndrug R&D increased by nearly 50 percent between 2015 and 2019. Many of the\ndrugs approved in recent years are high-priced specialty drugs for relatively\nsmall numbers of potential patients. By contrast, the top-selling drugs of the\n1990s were lower-cost drugs with large patient populations.\n\n### R&D Spending\n\nR&D spending in the pharmaceutical industry covers a variety of activities,\nincluding the following:\n\n  * **Invention** , or research and discovery of new drugs;\n  * **Development** , or clinical testing, preparation and submission of applications for FDA approval, and design of production processes for new drugs;\n  * **Incremental innovation** , including the development of new dosages and delivery mechanisms for existing drugs and the testing of those drugs for additional indications;\n  * **Product differentiation** , or the clinical testing of a new drug against an existing rival drug to show that the new drug is superior; and\n  * **Safety monitoring** , or clinical trials (conducted after a drug has reached the market) that the FDA may require to detect side effects that may not have been observed in shorter trials when the drug was in development.\n\nIn real terms, private investment in drug R&D among member firms of the\nPharmaceutical Research and Manufacturers of America (PhRMA), an industry\ntrade association, was about $83 billion in 2019, up from about $5 billion in\n1980 and $38 billion in 2000.1 Although those spending totals do not include\nspending by many smaller drug companies that do not belong to PhRMA, the trend\nis broadly representative of R&D spending by the industry as a whole.2 A\nsurvey of all U.S. pharmaceutical R&D spending (including that of smaller\nfirms) by the National Science Foundation (NSF) reveals similar trends.3\n\nAlthough total R&D spending by all drug companies has trended upward, small\nand large firms generally focus on different R&D activities. Small companies\nnot in PhRMA devote a greater share of their research to developing and\ntesting new drugs, many of which are ultimately sold to larger firms (see Box\n1). By contrast, a greater portion of the R&D spending of larger drug\ncompanies (including those in PhRMA) is devoted to conducting clinical trials,\ndeveloping incremental “line extension” improvements (such as new dosages or\ndelivery systems, or new combinations of two or more existing drugs), and\nconducting postapproval testing for safety-monitoring or marketing purposes.\n\n### Box 1.\n\n### Large and Small Drug Companies and the “Make or Buy” Decision\n\nSmall drug companies (those with annual revenues of less than $500 million)\nnow account for more than 70 percent of the nearly 3,000 drugs in phase III\nclinical trials.1 They are also responsible for a growing share of drugs\nalready on the market: Since 2009, about one-third of the new drugs approved\nby the Food and Drug Administration have been developed by pharmaceutical\nfirms with annual revenues of less than $100 million.2 Large drug companies\n(those with annual revenues of $1 billion or more) still account for more than\nhalf of new drugs approved since 2009 and an even greater share of revenues,\nbut they have only initiated about 20 percent of drugs currently in phase III\nclinical trials.3\n\nFor a large drug company, one option for increasing the number of drugs it\nexpects to introduce is to acquire a smaller firm that is developing new\ndrugs. Over the past three decades, about one-fifth of drugs in development—or\nthe companies developing them—have been acquired by another pharmaceutical\ncompany.4\n\nWhen a large company acquires a small drug company or the rights to one of its\ndrugs, it can use its specialized knowledge to increase the value of its\nacquisition or to diversify its risk of a decline in revenues (from a drug’s\nloss of patent protection, for instance). In making that acquisition, a large\ncompany might bring a drug to market more quickly than the small company could\nhave or might distribute it more widely. With the rise of generic drugs, the\nloss in sales revenues that occurs when a drug’s patent expires can leave\nfirms with excess capacity in production. Acquiring a smaller company can help\nquickly fill that capacity.\n\nThe acquisition of a small company by a larger one can create efficiencies\nthat might increase the combined value of the firms by allowing drug companies\nof different sizes—in terms of the number of researchers, administrative\nemployees, and financial and physical assets—to specialize in activities in\nwhich they have a comparative advantage. Small companies—with relatively fewer\nadministrative staff, less expertise in conducting clinical trials, and less\nphysical and financial capital to manage—can concentrate primarily on\nresearch. For their part, large drug companies are much better capitalized and\ncan more easily finance and manage clinical trials. They also have readier\naccess to markets through established drug distribution networks and\nrelationships with buyers.\n\nResearchers have found some evidence that such acquisitions by larger drug\nfirms are sometimes motivated by large firms’ desire to limit competition.\nAccording to a recent study of acquisitions in the pharmaceutical industry,\nfor example, a company was about 5 percent to 7 percent less likely to\ncomplete the development of drugs in its acquired company’s pipeline if those\ndrugs would compete with the acquirer’s existing drugs than it would be\notherwise.5 In a 2017 study of competition and research and development (R&D),\nthe Government Accountability Office cited several retrospective studies of\nmergers in the drug industry that found such transactions reduced R&D spending\nand patenting for several years.6 The reverse was also true: Increases in\npharmaceutical industry competition have been found to increase firms’ R&D\nspending.7\n\n* * *\n\n1. See IQVIA Institute for Human Data Science, _The Changing Landscape of Research and Development_ (April 2019), p. 15, https://tinyurl.com/1cm3g2fs.\n\n2. See Ulrich Geilinger and Chandra Leo, _HBM New Drug Approval Report_ (HBM Partners, January 2019), p. 16\\. https://tinyurl.com/yyzze476, (PDF, 1.14 MB). HBM Partners is a Swiss health care investment company.\n\n3. The 30 largest companies have developed 53 percent of drugs approved since 2009, and in 2014, the 25 largest drug companies received more than 70 percent of industry revenues. See IQVIA Institute for Human Data Science, _The Changing Landscape of Research and Development_ (April 2019), p. 16, https://tinyurl.com/y2kpxve8; and Government Accountability Office, _Drug Industry: Profits, Research and Development Spending, and Merger and Acquisition Deals_ , GAO-18-40 (November 2017), p. 16, www.gao.gov/products/GAO-18-40.\n\n4. See Colleen Cunningham, Florian Ederer, and Song Ma, “Killer Acquisitions,” _Journal of Political Economy_ , vol. 129, no. 3 (March 2021), p. 670, http://dx.doi.org/10.1086/712506.\n\n5. Ibid., pp. 649–702.\n\n6. See Government Accountability Office, _Drug Industry: Profits, Research and Development Spending, and Merger and Acquisition Deals_ , GAO-18-40 (November 2017), p. 16, www.gao.gov/products/GAO-18-40. For the individual studies, see Carmine Ornaghi, “Mergers and Innovation in Big Pharma,” _International Journal of Industrial Organization_ , vol. 27, no. 1 (January 2009), pp. 70–79, https://doi.org/10.1016/j.ijindorg.2008.04.003; and Patricia M. Danzon, Andrew Epstein, and Sean Nicholson, “Mergers and Acquisitions in the Pharmaceutical and Biotech Industries,” _Managerial and Decision Economics_ , vol. 28, no. 4/5 (June–August 2007), pp. 307–328, www.jstor.org/stable/25151520.\n\n7. See Richard T. Thakor and Andrew W. Lo, “Competition and R&D Financing: Evidence From the Biopharmaceutical Industry,” _Journal of Financial and Quantitative Analysis_ (forthcoming), http://dx.doi.org/10.2139/ssrn.3754494.\n\nCBO relied on the PhRMA data because before 2008, the NSF survey did not\ninclude domestic firms’ R&D spending outside of the United States. (Both the\nNSF and PhRMA estimates reflect worldwide R&D spending by pharmaceutical\ncompanies with operations in the United States.) NSF’s estimates of R&D\nspending since 2008 suggest that PhRMA members’ worldwide R&D spending\nconstitutes about 75 percent to 85 percent of the industry total, depending on\nthe year.\n\nIn recent years, the pharmaceutical industry’s R&D spending as a share of net\nrevenues (sales less expenses and rebates) has increased: Consumer spending on\nbrand-name prescription drugs has risen, but R&D spending has risen more\nquickly. In the early 2000s, when drug industry revenues were rising sharply,\nthe industry’s R&D intensity—that is, its R&D spending as a share of net\nrevenues—averaged about 13 percent each year. Over the decade from 2005 to\n2014, the industry’s R&D intensity averaged 18 percent to 20 percent each\nyear. That ratio has been trending upward since 2012, and it exceeded 25\npercent in 2018 and 2019, the highest R&D intensities recorded by the\npharmaceutical industry as a whole since at least 2000. Data are limited for\nearlier years, but among PhRMA member companies, annual R&D intensities\naveraged 18 percent from 1980 through 2010 and never exceeded 22 percent.4\nSince then, R&D intensity has increased among PhRMA firms just as it has for\nthe industry as a whole, reaching 25 percent in 2017 before decreasing\nslightly in 2018. By comparison, average R&D intensity across all industries\ntypically ranges between 2 percent and 3 percent.5 R&D intensity in the\nsoftware and semiconductor industries, which are generally comparable to the\ndrug industry in their reliance on research and development, has remained\nbelow 18 percent (see Figure 1).\n\n### Figure 1.\n\n### Average R&D Intensities for Publicly Traded U.S. Companies, by Industry\n\nPercent\n\nPharmaceutical companies have devoted a growing share of their net revenues to\nR&D activities, averaging about 19 percent over the past two decades. By\ncomparison, other research-intensive industries, like software and\nsemiconductors, averaged about 15 percent.\n\nData source: Congressional Budget Office, using data from Bloomberg, limited\nto U.S. firms as identified by Aswath Damodaran, “Data: Breakdown” (accessed\nJanuary 13, 2020), https://tinyurl.com/yd5hq4t6. See\nwww.cbo.gov/publication/57025#data.\n\nR&D intensity is research and development spending as a share of net revenues\n(sales less expenses and rebates).\n\nR&D = research and development; S&P = Standard and Poor’s.\n\nThere are several possible explanations for the increase in the industry’s R&D\nintensity over the past eight years. It could reflect the increased role of\nsmall drug companies, which have little revenue and, therefore, high ratios of\nR&D spending to net revenues. It could also indicate that the expected returns\nfrom investments in R&D have increased (if market conditions have changed) or\nthat opportunities to develop new drugs have increased (if recent advances in\nscience and technology have been particularly productive). Finally, it could\nreflect rising costs of R&D inputs, such as capital equipment and skilled\nlabor. CBO has not evaluated the relative importance of those possibilities.\n\n### New Drug Development\n\nOver the past decade, the pharmaceutical industry has introduced growing\nnumbers of new drugs annually (see Figure 2). Between 2010 and 2019, 38 new\ndrugs were approved each year, on average. That is about a 60 percent increase\ncompared with the previous decade. Drug approvals reached a new peak in 2018,\nsurpassing the record number of approvals of the late 1990s. (Counts of new\ndrug approvals are a readily available but imperfect measure of output from\nthe drug industry’s R&D spending. The measure does not reflect differences in\nthe effectiveness of the new drugs relative to alternative treatments, or the\nnumber of people who might benefit from the new drugs.)\n\n### Figure 2.\n\n### Average Annual Approvals of New Drugs by the FDA\n\nNumber of Drugs\n\nFrom 2015 to 2019, the FDA approved about twice as many new drugs as it did a\ndecade earlier. Biologic drugs make up a growing share of FDA approvals.\n\nData source: Congressional Budget Office, using data from the FDA’s Center for\nDrug Evaluation and Research and the FDA’s Center for Biologics Evaluation and\nResearch. See www.cbo.gov/publication/57025#data.\n\nUntil the 1990s, the FDA did not count biologics as a separate category; they\nwere counted with NMEs.\n\nBLA = biologic license application; FDA = Food and Drug Administration; NME =\nnew molecular entity.\n\nInformation about the _kinds_ of new drugs the pharmaceutical industry has\nintroduced can be inferred from changes in retail spending across different\ntherapeutic classes of drugs. When ranked by retail spending, therapeutic\nclasses in which many expensive specialty drugs have been introduced over the\npast decade top the ranking, whereas classes in which the best-selling drugs\nare now available in generic form rank lower now than they did a decade ago.6\nInformation about the kinds __ of new drugs the pharmaceutical industry may\nintroduce in the future can be inferred from clinical trials under way.\n\n**Approval of New Drugs.** Over the past five years, both R&D spending and\ndrug approvals have increased substantially. The relationship between them is\ncomplex and variable (see Figure 3). Because it can take a decade or more of\nR&D spending to develop a new drug and successfully shepherd it through\nclinical trials, drug approvals lag behind the underlying R&D spending. That\nlag makes it difficult to interpret the relationship between R&D spending and\nnew drug approvals. For instance, drug approvals declined over the 2000s\ndespite steadily rising R&D spending over the preceding years, provoking\nconcerns about a decline in the industry’s R&D productivity. Those concerns\nproved temporary, however. Despite flat R&D spending from 2008 through 2014,\ndrug approvals began to increase around 2012.\n\n### Figure 3.\n\n### R&D Spending and New Drug Approvals\n\nSustained increases in pharmaceutical R&D spending do not necessarily lead to\nrising numbers of new drugs. R&D spending also reflects rising costs of labor\n(skilled researchers) and capital (laboratory technologies).\n\nData source: Congressional Budget Office, using data from the FDA’s Center for\nDrug Evaluation and Research and PhRMA annual reports (various years). See\nwww.cbo.gov/publication/57025#data.\n\nData for 1980–1983 are not shown because the five-year moving average cannot\nbe calculated for the first four years of data.\n\nFDA = Food and Drug Administration; NME = new molecular entity; PhRMA =\nPharmaceutical Research Manufacturers of America; R&D = research and\ndevelopment.\n\na. A five-year moving average replaces the value for each year in an annual\ndata series with an average over five consecutive years. (Here the arithmetic\nmean of each annual value and the preceding four is used.) A moving average is\nsmoother than the underlying data series and is useful for reducing year-to-\nyear changes unrelated to overall trends in the data.\n\nThat increase in drug approvals does not, by itself, indicate the extent to\nwhich the new drugs are particularly innovative (for instance, targeting\nillnesses in new ways) as opposed to improving only incrementally upon\nexisting drugs. Furthermore, the recent trend of sharply rising R&D spending\ndoes not necessarily portend a continued high rate of drug introductions. A\ndecline in clinical trials success rates, for example, could slow the rate of\nnew drug introductions even while R&D spending continued to increase.\nAdditionally, not all R&D spending is directed toward development of new\ndrugs. Drug companies devote some R&D resources to finding effective new\ncombinations of existing drugs, as with newer HIV treatments and\npreventatives, or to new drug-delivery mechanisms, such as insulin pumps.\n\nFinally, the rise in the industry’s R&D spending does not provide information\nabout the kinds __ of drugs that may be introduced in coming years. To some\ndegree, that information can be inferred from descriptions of clinical trials\ncurrently in progress. But it cannot be known with any certainty which of\nthose drugs will eventually make it to market.\n\n**Trends in Recent Drug Spending by Therapeutic Class.** New or improved\nspecialty drugs for diabetes, various cancers, autoimmune disorders (such as\nrheumatoid arthritis or multiple sclerosis), and HIV have propelled large\nretail-spending increases in the therapeutic classes for those illnesses (see\nFigure 4). Many of the new specialty drugs are biologics, based on living cell\nlines rather than chemical active ingredients. For HIV, the new antiretroviral\ntherapies have been combinations of specialty drugs that simplify treatment.\n\n### Figure 4.\n\n### Total U.S. Retail Drug Spending by Therapeutic Class, 2009 and 2019\n\nBillions of 2019 dollars\n\nNew drugs can lead to large increases in retail spending because they have\nhigher prices, they are in high demand, or both. Spending decreases can result\nwhen patent protection expires on leading drugs and low-cost generic versions\nare introduced.\n\nData source: Congressional Budget Office, using data from IQVIA Institute for\nHuman Data Science, _Medicine Spending and Affordability in the United States:\nUnderstanding Patients’ Costs for Medicines_ (August 2020), Exhibit 24,\nhttps://tinyurl.com/5655tnoc; IMS Institute for Healthcare Informatics,\n_Medicines Use and Spending Shifts: A Review of the Use of Medicines in the\nU.S. in 2014_ (April 2015), p. 40, https://tinyurl.com/3bk9oufn, and _Medicine\nUse and Shifting Costs of Healthcare: A Review of the Use of Medicines in the\nUnited States in 2013_ (April 2014), Appendix 8, https://go.usa.gov/xsaFR. See\nwww.cbo.gov/publication/57025#data.\n\nTherapeutic classes in the figure are ranked in order of 2019 spending. The\nfigure excludes “other cardiovasculars” (ranked 12th in 2019, with total\nspending of $10.1 billion) because 2009 data for that class could not be\nfound.\n\nRetail spending overstates actual spending and revenues received by\nmanufacturers, because it does not include rebates paid by those\nmanufacturers.\n\nADHD = attention deficit hyperactivity disorder; GI = gastrointestinal.\n\na. Viral hepatitis entered the list of the top 20 therapeutic classes by\nretail spending in 2014; therefore, spending levels for that year have been\nsubstituted for 2009 levels.\n\nSome of the therapeutic classes that have experienced large spending increases\nfeature new drugs with relatively large populations of patients or new\ntreatments for chronic conditions that can be therapeutically managed but\nrequire continued treatment. (As a result, drugs for chronic conditions\ntypically sell in steady quantities.) Other such classes include new drugs\nwith relatively small numbers of potential patients or shorter treatment\ndurations but that have high prices per unit of treatment. High prices may\nreflect demand that is relatively insensitive to price because of the serious\nnature of the illness and coverage of those drugs by insurance plans. For\nexample, prices for oncology drugs tend to be high.\n\nIn some cases, observed increases in retail spending overstate increases in\nnet revenues to the manufacturer because they do not account for unobserved\nrebates.7 Rebates tend to be higher for drugs for which several competing\ntherapies are available. (Larger rebates correspond with lower net prices.)\nThus, rebates on diabetes drugs tend to be considerably higher—as a percentage\nof the retail price—than they do for oncology drugs, which are not highly\nsubstitutable.\n\nSeveral therapeutic classes that contain top-selling drugs developed in the\n1990s experienced decreases __ in retail spending from 2009 to 2019 as they\nfaced competition from generic versions. Those blockbuster small-molecule\ndrugs include atypical antipsychotics, ACE inhibitors, and proton pump\ninhibitors. The therapeutic classes containing those drugs—mental health,\nantihypertensives, and gastrointestinal products, respectively—experienced\nlarge declines in retail spending. One therapeutic class, lipid regulators\n(the class that includes statins), experienced such a decrease that it no\nlonger appears among the top 20, ranked by retail spending. Those declines\nreflect widespread use of the new generic versions of those drugs.\n\nOne therapeutic class has experienced a decline in retail spending for a\ndifferent reason. Viral hepatitis only entered the top 20 in 2014, coinciding\nwith the introduction of several highly effective—and high-priced—new\ntreatments for hepatitis C. In contrast to the spending declines described\nabove, the decline in retail spending on viral hepatitis drugs is attributable\nto a combination of factors. First, newer, lower-priced drugs have since been\nintroduced, lowering the average price in that class as they have gained\nmarket share. Second, the number of prescriptions has declined: As the\ntreatments have been administered, the number of potential patients has\nfallen. That is because the new drugs successfully treat about 95 percent of\npatients with chronic hepatitis C infection.8 By contrast, older, less\nexpensive therapies were successful in far fewer patients and had severe side\neffects in many cases.\n\n**Types of New Drugs in Development.** Information about the kinds of drugs\nthat may be approved in coming years can be gleaned from data on recent\nclinical trials. That information suggests that drug companies are emphasizing\ntreatments for cancer and nervous system disorders like Alzheimer’s disease\nand Parkinson’s disease. Among human clinical trials in progress as of 2018,\ndrugs in those two therapeutic classes accounted for more than twice as many\ntrials as did drugs in the next three classes combined (vaccines; pain,\nincluding arthritis therapies; and dermatologics.)9\n\nThe 2020–2021 coronavirus pandemic has spurred the development of vaccines to\nhalt the spread of COVID-19, the disease caused by the coronavirus. In\naddition to R&D spending by the private sector, the federal government has\nprovided support to the private sector to develop vaccines to address the\npandemic (see Box 2).\n\n### Box 2.\n\n### Federal Funding to Support the Development of a COVID-19 Vaccine\n\nThe federal government can directly support private vaccine development in two\nprimary ways, either by covering the costs of research and development (R&D),\nor by committing in advance to purchasing a successful vaccine contingent upon\na firm achieving specified development goals. Under the first method, the\ngovernment would supply R&D funding that would ordinarily come from the\npharmaceutical firms themselves, from venture capital investments, or from\nother sources outside the firm. That method might be better suited to cases in\nwhich the R&D effort had a relatively high risk of failure and an expected\nreturn that would be too low to attract private investment. The rationale for\ngovernment funding in such cases would depend on whether the expected value to\nsociety—rather than to private investors—exceeded the cost of the funding.\nHowever, a drawback of such funding is that the outside funder—including the\ngovernment, in this case—cannot observe the innovator’s private costs and may\npay more than necessary for developing the vaccine.\n\nUnder the second method—that is, agreeing to a future purchase of a specified\nnumber of vaccine doses at a specific price—the government would become the\nsource of demand that ordinarily comes from the market. Such an advance-\npurchase agreement might be preferable in cases in which the government\nplanned to purchase the new product in large quantities regardless of the\namount of financial support it provided for R&D. It might also be preferable\nin cases in which a variety of approaches to developing the product are\navailable, but with much uncertainty about which approach is best. An advance-\npurchase agreement would also ensure the developer a certain amount of\nrevenues in cases in which the government was supporting the development of\nmultiple, competing products simultaneously. By offering advance purchase\ncontracts to vaccine manufacturers—the promise of future payment conditional\non a successful vaccine being developed—the government can provide greater\ncertainty to pharmaceutical firms undertaking risky investments in R&D for\nvaccines.\n\nIn May 2020, the Department of Health and Human Services initiated “Operation\nWarp Speed,” a collaborative effort involving the Centers for Disease Control\nand Prevention, the Food and Drug Administration (FDA), the National\nInstitutes of Health, and the Department of Defense, with funding provided\nthrough the Biomedical Advanced Research and Development Authority (BARDA).\nThrough Operation Warp Speed, the federal government has provided more than\n$19 billion in assistance to seven private pharmaceutical manufacturers to\ndevelop and produce a vaccine or treatment for COVID-19, the disease caused by\nthe coronavirus (see the table below).1 As of March 2, 2021, five of those\nseven companies accepted up-front funding for research and clinical trials.\nFive of the seven companies accepted advance funding aimed at helping\nmanufacturers ramp up their production capabilities while their potential\nvaccines were still in development; a sixth accepted funding to develop the\ncapacity to manufacture another firm’s vaccine after it received emergency use\nauthorization. Finally, six of the seven manufacturers signed advance-purchase\nagreements. Two of the companies with vaccines that have received emergency\nuse authorizations have received additional funding for selling more doses\nthan were guaranteed by advance-purchase agreements.\n\nThe parallel execution of several stages of development that would usually be\nconducted in sequence, such as combining phase I and phase II clinical trials\nor building manufacturing capacity while the trials are still under way, has\nallowed pharmaceutical manufacturers to advance much more quickly through the\ndevelopment process than is typical for vaccines.2 One year after the first\ncase of COVID-19 was diagnosed in the United States, three of the vaccines\nsupported by BARDA funding had received emergency use authorizations from the\nFDA, and two other vaccines were in phase III clinical trials. (It ordinarily\ntakes several years of research and testing before a candidate vaccine enters\nphase III clinical trials.3 Seasonal influenza vaccines take much less time to\ndevelop and approve because their technologies, and the regulatory and\nlicensing procedures for those vaccines, have been used before.) According to\nthe World Health Organization, more than 200 candidate COVID-19 vaccines were\nin development in February 2021.4\n\n* * *\n\n1. Most of the manufacturers have also received research support from or signed advance-purchase agreements with the European Union, several national governments, and two global partnerships supported by foundations and other donors (Coalition for Epidemic Preparedness Innovations and Gavi, the Vaccine Alliance). See, for example, Christopher M. Snyder and others, “Designing Pull Funding for a COVID-19 Vaccine,” _Health Affairs_ , vol. 39, no. 9 (September 2020), pp. 1633–1642, https://doi.org/10.1377/hlthaff.2020.00646.\n\n2. See Nicole Lurie and others, “Developing Covid-19 Vaccines at Pandemic Speed,” _New England Journal of Medicine,_ vol. 382 (May 21, 2020), pp. 1969-1973, https://doi.org/10.1056/NEJMp2005630.\n\n3. See Wellcome Trust, “The 5 Stages of Vaccine Development” (accessed January 15, 2021), https://tinyurl.com/y6rxbbuf.\n\n4. See World Health Organization, “COVID-19 Vaccines” (accessed March 24, 2021), https://tinyurl.com/fpdcc777.\n\n## Factors That Influence R&D Spending\n\nPharmaceutical companies invest in R&D in anticipation of future profits. For\neach drug that a company considers pursuing, anticipated returns depend on\nthree main factors: the expected lifetime global revenue from the drug (minus\nits manufacturing and marketing costs), the new drug’s likely R&D costs, and\npolicies that affect the supply of and demand for prescription drugs. When the\nanticipation of future profits is higher, companies invest more in R&D and\nproduce more new drugs, CBO estimates. Similarly, if expectations about prices\nand profits were lower, companies would invest in less R&D, and fewer drugs\nwould be developed (see Box 3).\n\n### Box 3.\n\n### Effects of Changes in Expected Profitability on the Introduction of New\nDrugs\n\nIf expected profitability of new drugs declined—because of a change in federal\npolicy, a shift in demand or supply, a revision in the balance of power\nbetween drug companies and drug buyers, or for any other reason—the expected\nreturns on drug R&D would decline as well. Lower expected returns would\nprobably mean fewer new drugs, because there would be less incentive for\ncompanies to spend on R&D. (If expected profitability were to rise, the\nopposite effects would occur.) Expectations about returns on R&D partly depend\non expectations of prices that future drugs could command—which, in turn,\npartly depend on current drug prices and influences on those prices.\n\nThe Congressional Budget Office’s analysis of H.R. 3 in the 116th Congress\nillustrates those effects. That bill would have required the Secretary of\nHealth and Human Services to negotiate prices for drugs—primarily those for\nwhich spending was highest—and to subject manufacturers who did not\nparticipate in negotiations to an excise tax. In that analysis, CBO concluded\nthat the bill would reduce drug companies’ expectations about future revenues\nbecause of the new negotiating leverage of the Secretary. The prospect of such\nlower revenues would make investments in R&D less attractive to pharmaceutical\ncompanies. CBO estimated that under the bill, approximately 8 fewer drugs\nwould be introduced to the U.S. market over the 2020–2029 period and about 30\nfewer drugs over the subsequent 10 years.1 Those estimates were in the middle\nof the distribution of possible outcomes, in CBO’s assessment, and were\nuncertain. CBO’s analysis is in line with a broader literature that has found\na positive relationship between drug prices and R&D efforts.2\n\n* * *\n\n1. See Congressional Budget Office, letter to the Honorable Frank Pallone Jr. regarding the budgetary effects of H.R. 3, the Elijah Cummings Lower Drug Costs Now Act (December 10, 2019), www.cbo.gov/publication/55936.\n\n2. See Margaret E. Blume-Kohout and Neeraj Sood, “Market Size and Innovation: Effects of Medicare Part D on Pharmaceutical Research and Development,” _Journal of Public Economics,_ vol. 97 (January 2013), pp. 327–336, https://doi.org/10.1016/j.jpubeco.2012.10.003; Daron Acemoglu and Joshua Linn, “Market Size in Innovation: Theory and Evidence From the Pharmaceutical Industry,” _Quarterly Journal of Economics,_ vol. 119, no. 3 (August 2004), pp. 1049–1090, https://doi.org/10.1162/0033553041502144; and Pierre Dubois and others, “Market Size and Pharmaceutical Innovation,” _RAND Journal of Economics,_ vol. 46, no. 4 (Winter 2015), pp. 844–871, https://doi.org/10.1111/1756-2171.12113.\n\n### Anticipated Revenues\n\nA company’s expectations about the revenues it could earn from a drug depend\non the prices that the company anticipates the drug could command in various\nmarkets around the world and the quantities that the company anticipates might\nbe purchased at those prices. Those expectations are informed by the prices\nand sales volumes observed for existing drugs in various markets. For\nestablished drug companies, current revenue streams from existing products\nalso provide an important source of financing for their R&D projects.\n\n**How Revenue Expectations are Formulated.** A company develops its\nexpectations about a potential drug’s lifetime future revenues based on the\ndrug’s potential market size, which depends on the prices it might command in\nsales to different patient groups and in negotiations with payers,\ndomestically and abroad. In that sense, the prices of existing drugs—including\nvariations in prices to different patient populations—help determine R&D\nspending on future drugs. (The converse is not true: In CBO’s assessment,\ncurrent R&D spending does not influence the future prices of the drugs that\nresult from that spending.)\n\nRevenues generated by existing drugs provide information about the potential\nmarket size for new drugs by indicating consumers’ and insurance plans’\nwillingness to pay for drug treatments. The number of prescriptions for those\ndrugs support inferences about the number of potential patients, their\npropensity to use drug therapies at the observed prices, and the popularity of\ncompeting therapies.\n\nSales revenues from other unrelated drugs also help companies form\nexpectations about market size. They reveal information about the magnitude of\ndrug-treatment costs that the market currently tolerates, both in general and\nfor various conditions that will have more or less in common—with regard to\nduration, severity, or effects on quality or length of life—with the\nconditions the new drug would treat.\n\nExpected revenues also depend on anticipated unit sales in different markets\naround the world. Those quantities are determined by the number of potential\npatients for the drug in those markets, the shares of those populations that\nmight buy the drug at the prices the manufacturer envisions for those markets\n(taking into account any substitute drugs that might be available), and the\nnumber of prescriptions a course of treatment would require.\n\nOnce a new drug has been approved, CBO expects that its developer would set\nits price in a forward-looking fashion, meaning the price is set to maximize\nthe net revenues from the drug without regard to how much it cost to develop.\n\nReal (inflation-adjusted) pharmaceutical revenues increased sharply from the\nmid-1990s until around the mid-2000s, when patents on a number of blockbuster\ndrugs expired and lower-cost generic equivalents were introduced. Revenues\nthen declined slightly from the mid-2000s through the mid-2010s, a result of\nthose patent expirations and the 2007–2009 recession. Revenue growth returned\nwith the introduction of some expensive new drugs (see Figure 5).\n\n### Figure 5.\n\n### Worldwide and Domestic Revenues of PhRMA Member Firms\n\nBillions of 2019 Dollars\n\nRevenues from drug sales have grown substantially since 1980, although that\ngrowth was interrupted by patent expirations of some widely used drugs and by\nthe 2007–2009 recession. Revenue growth has since resumed, in part due to\nexpensive new drugs.\n\nData source: Congressional Budget Office, using data from PhRMA, _2019 PhRMA\nAnnual Membership Survey_ , Table 4 (PhRMA, 2019),\nhttps://tinyurl.com/ycvneve7 (PDF, 2.15 MB). See\nwww.cbo.gov/publication/57025#data.\n\nPhRMA revenue data reflect payments received by manufacturers, excluding cash\ndiscounts, Medicaid rebates, returns, and allowances for marketing expenses.\n\nPhRMA = Pharmaceutical Research and Manufacturers of America.\n\n**Revenues as Source of Funding for R &D.** In the pharmaceutical industry,\nrevenues have traditionally been an important source of R&D financing for\nestablished companies with brand-name drugs to sell. Brand-name drugs can\ngenerate large volumes of cash because their manufacturing and distribution\ncosts are typically very low relative to their sales revenues. Established\ncompanies appear to prefer to finance their R&D with current revenues whenever\npossible rather than to rely on outside funding sources such as venture\ncapital.10 Outside financing involves transactions costs as well as other\nimplicit costs, such as compensation for risks borne by outside investors who\ncannot perfectly monitor a firm’s efforts and skills.11\n\nThe share of R&D funded directly by revenues has declined in recent years\nbecause an increasing amount of R&D is now conducted by research-oriented drug\ncompanies with few or no products on the market. Over the past decade, small\nor emerging drug companies have developed a rising share of new drugs. Those\ncompanies have relatively little revenue (some have none at all), and most of\nthem must seek outside financing, such as venture capital, and collaborative\nagreements with larger drug companies. Although venture capital still only\nfinances a small share of the drug industry’s R&D spending in total, it\nsupports a much larger share of the R&D spending of smaller firms than of\nlarge established companies.\n\nDrug development also occurs in university research labs. In addition to\ngrants funded by the National Institutes of Health (NIH) that many\nuniversities receive for performing basic biomedical research, universities\nmay collaborate with (and be funded by) private drug companies to perform\napplied research toward the development of new drugs.12 The funding for that\nR&D may come predominantly from revenues, as the collaborations typically\ninvolve established pharmaceutical companies.13\n\n### R&D Costs of a New Drug\n\nR&D spending is also influenced by the expected costs of developing a new\ndrug, including those incurred in the preclinical research phase and in\nclinical trials. In addition to those out-of-pocket expenses, drug companies\nincur capital costs that result from tying up funds in the drug-development\nprocess for years before they generate earnings from those investments. Those\ncapital costs reflect the returns that the funds could have earned if they had\nbeen invested in other ways.\n\nDevelopment of a drug that will eventually reach the market often entails a\ndecade or more of R&D expenditures. Each successive phase of clinical trials\nrequires increasing amounts of spending. Drug developers can reassess their\ncommitment at each stage, and a drug’s expected value may change as more is\nlearned in clinical trials or as market conditions change—that is, there is an\noption value to continuing. Companies will not necessarily cancel a drug\nproject even if its likely future costs exceed its likely value when that\nassessment is made, because the expected value might rise with additional\ninformation about the drug or its market.\n\nPharmaceutical research is inherently risky and canceled or failed projects\nare a normal part of any drug development program. Companies initiate drug\nprojects knowing that most of them will not yield a marketable drug. Some\ndrugs developed in the preclinical phase never enter clinical trials, and of\nthose that do, only about 12 percent reach the market (recent estimates range\nfrom 10 percent to 14 percent).14\n\nEstimates, from multiple sources, of average R&D expenditures per new drug\nrange from less than $1 billion to more than $2 billion. Those estimates all\ninclude capital costs as well as expenditures on drugs that did not make it to\nmarket. The different estimates are averages over different samples of\ncompanies and drugs—that is, they depend on analytical and sampling choices\nmade by the researchers producing those estimates and are best interpreted as\nillustrative of the general conclusion that developing new drugs is expensive\nand subject to high rates of failure.\n\n**Preclinical Phase.** Although drugs spend much less time in preclinical\ndevelopment than they do in clinical trials, a company’s total preclinical R&D\nexpenditures typically constitute a considerable share of its total R&D\nspending. That is because companies typically develop many potential drugs in\nthe preclinical phase that never enter or complete clinical trials. According\nto one estimate using data provided by large pharmaceutical firms, preclinical\ndevelopment accounted for an average of 31 percent of a company’s total\nexpenditures on drug R&D, or $474 million per approved new drug.15\n\nWhen capital costs were taken into account, the share of R&D spending in the\npreclinical phase rose to 43 percent. Any return on R&D spending on early,\npreclinical drug development must await successful completion of both the\npreclinical phase and the clinical trials that follow. As a result, the lag\nbetween investment and return is longer for R&D spending that occurs in the\npreclinical phase than for spending in clinical trials. (For drugs that do not\nreach the market, no return is realized, although lessons learned from those\nefforts may aid the development of other drugs.) According to one study, the\npreclinical phase takes an average of about 31 months, followed by around 95\nmonths, on average, for clinical trials—or about 10.5 years from start to\nfinish.16 Other estimates differ; in a sample of 10 cancer drugs, for example,\none study found that the median time from discovery to approval was 7.3\nyears.17 Those numbers are measures of central tendency: Some drugs are\nbrought to market in less time.18\n\n**Clinical-Trials Phase.** The costs to conduct clinical trials on a drug are\nhigher than those to conduct the preclinical phase because trials involve the\ncontributions of many more people for a longer time. Clinical trials occur in\nseveral phases:\n\n  * Phase I trials (also known as human-safety trials) test a potential new drug at different dosage levels, generally in a small group of healthy volunteers in order to assess its safety in humans. For drugs with high levels of expected toxicity, phase I trial subjects are people with the targeted illness.\n  * Phase II trials are larger and include only people with the medical condition the drug is intended to treat. Phase II trials assess the drug’s biological activity and identify and characterize any side effects.\n  * Phase III trials are larger still and assess a drug’s clinical effectiveness. They can take years to complete. The smaller a drug’s expected therapeutic effect relative to a placebo, the larger the number of patients that are needed in the drug’s phase III trials so that the drug’s true effect (if any) can be distinguished from random variation in patient outcomes.\n  * Phase IV trials (also known as pharmacovigilance trials) may be conducted after a new drug has reached the market. They look for side effects not seen in earlier trials and measure a drug’s efficacy over longer periods of use than were studied in earlier trials.\n\nGenerally, only drugs that have successfully navigated the first three phases\ncan be considered for FDA approval, although regulators sometimes approve new\ndrugs without a phase III trial. (Of the 59 drugs approved in 2018, 7 did not\nundergo phase III trials before approval.)19 In some cases the FDA may require\na phase IV trial after the drug is approved to detect adverse reactions that\nmight not be observed until a drug is in wider use. Drug companies also might\nchoose to conduct phase IV trials to show (for marketing purposes) the\nsuperiority of their product over other available drug therapies.\n\nFew of the drugs that enter clinical trials are ultimately approved; some fail\nin clinical trials, and others are set aside when a company decides to focus\non more promising drugs. In a few cases, drugs submitted for approval are\nrejected by the FDA. In one sample of drugs in clinical trials, researchers\nfound that for every 100 drugs entering phase I trials, around 60 advanced to\nphase II trials, just over 20 entered phase III trials, and only about 12\ngained FDA approval.20 Such winnowing is reflected in the average R&D cost per\napproved drug, which includes all of the R&D spending on drugs that do not\nreach the market.\n\nCosts tend to rise in each successive phase of development. In the sample just\ndescribed, companies spent an average of about $1,065 million in clinical\ntrials per approved new drug (more than twice the amount spent in the\npreclinical research phase). Spending averaged $28 million in phase I, $65\nmillion in phase II, and $282 million in phase III.21 For each drug that\ncompleted the first three phases of clinical trials, the average total cost of\nthose trials was about $375 million. The remaining $690 million (of the $1,065\nmillion in average total spending on clinical trials) reflects companies’\ncontemporaneous spending on drugs that failed in clinical trials or were\notherwise set aside.\n\n**Capital Costs of R &D. **In addition to the cost of preclinical research and\nclinical trials, drug companies incur costs by forgoing other opportunities\nfor investment with money spent on clinical trials. Because drug companies’\nR&D spending on a drug occurs over many years, those capital costs are\nsubstantial and can approach the value of actual R&D expenditures to develop a\nnew drug.\n\n**Estimates of Total R &D Costs.** Three recent studies have estimated the\naverage R&D cost per new drug. They all measure R&D costs the same way: They\nadd up all of the R&D spending by each company in their sample—not only its\nspending on the sampled new drug but the company’s spending on other drugs\nthat were being developed at the same time but that did not reach the market.\nThe studies also all apply a cost-of-capital adjustment to each company’s R&D\nspending to reflect the lag between investment and return on investment.22\nDespite their methodological similarities, the studies’ estimates range from\n$0.8 billion to $2.3 billion of R&D spending per new drug.\n\nDifferences in sample selection and data sources appear to be important\nsources of variation in those estimates. The largest estimate, $2.3 billion\n(from a 2016 study, expressed here in 2019 dollars), includes around $900\nmillion in preclinical research spending and $1.4 billion for clinical\ntrials.23 Those estimates are based on a sample of 106 randomly selected drugs\nfrom 10 large pharmaceutical firms, 5 of which are ranked among the industry’s\ntop 10 by sales revenues, with an additional 3 ranked in the top 50 but\noutside the top 25.24 That widely cited study is the latest in a series of\nsimilar studies the authors have published over the past three decades.\nBecause the R&D expenditures reported by the sampled firms are not publicly\navailable, it is difficult to evaluate the extent to which the results of\nthose studies are affected by the selection of the sample and other aspects of\nthe method of collecting data.25 An independent effort to replicate an earlier\niteration of the study found similar results, however.26\n\nThe second study, which was conducted in part to provide an alternative to\nthose 2016 estimates, found an average R&D cost of $1.2 billion (expressed\nhere in 2019 dollars), with expenditures for individual drugs ranging from\n$137 million to $5.8 billion.27 That upper bound, based on one outlier drug\naccounting for $2.2 billion in actual R&D outlays and $3.6 billion in capital\ncosts, skews the average estimate upward. The _median_ R&D cost, unaffected by\nthe outlier, is $0.9 billion.\n\nThe sample in that study consisted of 63 drugs (developed by 47 different\ncompanies) out of the 355 drugs that the FDA approved between 2009 and 2018.\nR&D expenditure data for those 63 drugs are publicly available (unlike the\ndata used in the 2016 study). The sample skews toward smaller firms—although\nthe same is now true of drug development generally—and the authors caution\nthat their sample may overrepresent drugs approved between 2014 and 2018 and\nthose in certain therapeutic areas, first-in-class drugs, orphan drugs, and\ntherapeutic agents that received accelerated approval. The R&D data include\nthe companies’ spending on drugs that did not reach the market.\n\nIn the third study, researchers limited their sample to new cancer drugs from\ncompanies with no previously approved products. They found an average cost of\n$0.9 billion per approved drug (expressed here in 2019 dollars).28 Notably,\nthat study excluded R&D spending by firms that had not developed any approved\ndrugs, and thus the study underestimates R&D spending on failed drugs and, by\nextension, expected costs per new drug. Median observed R&D costs in that\nsample were about $0.8 billion per new drug, with estimates for individual\ndrugs ranging from about $212 million to $2.7 billion including capital costs.\nThose estimates include the developers’ total R&D spending while the approved\ndrugs were under development, including that on failed drugs.\n\n**Trends in R &D Costs** **.** **** R&D costs have increased by about 8.5\npercent per year over roughly the past decade.29 The increase in average R&D\ncosts might reflect changes in the kinds of drugs being developed or in the\nnumber of drugs in costly clinical trials. If success rates for new biologic\ndrugs were lower than for traditional, small-molecule drugs, or if R&D\nspending on failed drugs was higher for biologics, that would also contribute\nto higher average R&D costs.\n\nSome evidence suggests that average success rates may indeed have declined.\nThe 2016 study found that fewer than 12 percent of the drugs entering phase I\nclinical trials ultimately reached the market, but it reported success rates\nin excess of 20 percent for drugs developed in the 1980s and 1990s.30 However,\nother evidence suggests that the overall success rate of clinical trials has\nnot declined.31\n\nAnother possible factor in rising R&D costs is that it has become harder to\nrecruit candidate patients into some kinds of clinical trials.32 For example,\nprospective patients might be less interested in taking a chance on untested\ntreatments in clinical trials when approved treatment options are relatively\neffective already. And, in some therapeutic classes, it has become more\ndifficult to demonstrate that a new drug would improve on the existing\nstandard of care. For example, advances in oncology treatments have extended\ncancer patients’ expected lifespans. As a result, clinical trials on potential\ncancer drugs have had to be expanded or extended so that the treatment effect\non the lifespans of patients can be estimated with suitable precision. That\nis, because oncology treatments have become more effective, it now takes\nlonger, on average, to observe a given number of deaths in a clinical trial.33\n\n### Public Policy\n\nFederal policy influences pharmaceutical companies’ R&D spending, both in\nmagnitude and direction. (Policies in other countries and at other levels of\ngovernment can also affect such spending. Those policies are outside the scope\nof this report.)\n\nPolicies around federal health care programs and subsidies most directly\naffect the _demand_ for new drugs. Other policies affect the _supply_ of new\ndrugs (federal support for basic research, tax treatment of R&D spending, and\nthose policies that affect market exclusivity). Still other areas of federal\npolicymaking affect both _supply and demand_ (vaccine policies and regulatory\npolicies).\n\nChanges in policy that increased the demand for pharmaceuticals or encouraged\ntheir supply would tend to make R&D activity a more attractive investment.\nPolicy changes in the opposite direction could make it a less appealing one.\n\n**Federal Health Care Programs and Subsidies** **.** **** A variety of federal\nhealth care programs and subsidies increase demand for health care services\nand products, including prescription drugs. Such initiatives indirectly\nstimulate spending on drug R&D. In particular, the federal government—through\nMedicare, Medicaid, TRICARE, the Veterans Health Administration, the\nChildren’s Health Insurance Program, and health insurance marketplaces\nestablished by the Affordable Care Act—purchases or subsidizes the purchase of\na substantial number of prescription drugs on behalf of retirees, veterans,\npersons with disabilities, and low-income households. Taken together, federal\nand state expenditures on prescription drugs accounted for about 40 percent of\ntotal U.S. retail expenditures on prescription drugs in 2019.34\n\nChanges to those programs would influence R&D spending. For instance, when\nMedicare Part D (Medicare’s prescription drug benefit) was implemented in\n2006, sales of prescription drugs to enrollees increased considerably. In\naddition, for Medicare enrollees with full Medicaid benefits, coverage of\nprescription drugs shifted from Medicaid to Medicare Part D, increasing the\naverage prices paid for those enrollees’ brand-name drugs. Those increases in\ncurrent and anticipated revenues encouraged the industry to develop new drugs\nfor the Medicare population. Between 2003 and 2010, the number of drugs\nentering phase I clinical trials increased by roughly 50 percent in\ntherapeutic classes with relatively high sales to Medicare enrollees. That\nincreased development activity eventually led to increases in the number of\ndrugs in those classes.35\n\nThe federal government also increases demand for prescription drugs by\nsubsidizing employment-based health insurance: An employer’s contribution\ntoward the cost of that coverage is excluded from an employee’s taxable\nincome, effectively reducing its price to the employee. As a result, many\npeople select more generous health insurance coverage than they otherwise\nwould, which increases their spending on health care (including prescription\ndrugs) and indirectly stimulates pharmaceutical R&D. That stimulus would\ndisappear if the tax subsidy on employment-based health insurance was\neliminated. The size of the effect that would have on R&D spending would\ndepend on how the elimination of the subsidy would affect individuals’ choices\nof health insurance coverage.36\n\n**Support for Basic Research.** The federal government is the primary funder\nof basic research in biomedical sciences. That research ultimately increases\nthe supply of new drugs because drug companies rely on the findings from that\nresearch—for example, the identification of disease targets toward which new\ndrug therapies can be aimed. That basic research creates knowledge that, in\neffect, reduces private companies’ R&D costs and stimulates private investment\nin R&D, because it expands the set of potentially profitable drug development\nopportunities. In particular, increases in basic health-related research at\nthe NIH or other federal research agencies have been found to increase private\ndrug R&D in therapeutic classes related to that basic research.37\n\nThe rationale for public investment in basic biomedical research is that\nprivate firms’ incentives to invest in it are muted. Basic research generates\nknowledge (such as the identification of a disease target) that is not readily\nembodied in a marketable product (such as a drug). The more of that\ninformation a company could keep to itself, the greater its value to the\ncompany—and the stronger the company’s incentive would be to invest in that\nresearch. But because information can be communicated at low cost, it can be\ndifficult to contain within a firm. Private companies tend to be reluctant to\nconduct basic research such as identifying a new disease target, because it\nwould be difficult to keep much of the value of that discovery for themselves.\nFor example, once a disease target is known, multiple companies (not just the\ncompany that identified it) might be able to develop drugs aimed at that\ntarget. That weakens private incentives to invest in basic research and, as a\nresult, private firms do too little of it from the perspective of society as a\nwhole (meaning that the social benefit if they performed additional basic\nresearch would be greater than the cost).\n\nThe Role of NIH-Funded Research. In the past two decades, federal funding for\nNIH has totaled over $700 billion.38 Much of that funding has supported basic\nresearch (in genomics, molecular biology, and other life sciences) that has\nidentified new disease mechanisms. Federal support for NIH nearly doubled\nbetween 1995 and 2003, rising from $18 billion to about $37 billion (see\nFigure 6). Federal funding for NIH declined (in inflation-adjusted dollars)\neach year from 2003 to 2015, when that funding was about $33 billion. With\nreal annual increases over the subsequent five years, funding for NIH reached\n$41 billion in 2020.\n\n### Figure 6.\n\n### Federal Funding for the National Institutes of Health, Fiscal Years 1995\nto 2020\n\nBillions of 2019 Dollars\n\nLarge increases in funding for NIH—the locus of much of the federal\ngovernment’s basic biomedical research support—in the late 1990s and early\n2000s preceded a decade of declining funding. Since 2016, NIH funding has\nincreased annually.\n\nData source: Congressional Budget Office, using data from National Institutes\nof Health, Office of Budget. See www.cbo.gov/publication/57025#data.\n\nNIH = National Institutes of Health.\n\nBetween 2010 and 2016, every drug approved by the FDA was in some way based on\nbiomedical research funded by NIH.39 In many cases, new drugs targeted a\ndisease mechanism that had been identified by advances in basic science\nresulting from that funding. Indeed, most of the important new drugs\nintroduced by the pharmaceutical industry over the past 60 years were\ndeveloped with the aid of research conducted in the public sector.40 Publicly\nfunded basic science thus provided the foundation upon which complementary\nwork on the applied science of drug development could be undertaken by the\nprivate sector.\n\nHow NIH-Funded Research Affects Private R&D. Empirical studies find that\npublic-sector research tends to increase private R&D rather than to decrease\nit—that is, they are complements, not substitutes.41 Several recent studies\nhave associated increases in NIH-funded basic research with increased private\nR&D efforts.42 One study found that in the decade following an increase in NIH\nfunding, private R&D spending grew by about eight times as much as the\nincrease in that funding.43 Another study found that for every two NIH\nresearch grants, about one new private-sector patent was awarded.44\n\nThe complementary relationship between public and private R&D spending arises\nmainly because NIH funding focuses on basic research that leads to the\ndiscovery of new drugs, whereas private spending focuses on applications of\nsuch research. Private R&D spending on clinical testing, incremental\ninnovation, product differentiation, and safety all follows from basic\nresearch.\n\nThat relationship is complicated by two factors. First, the distinction\nbetween basic and applied research is not well defined, and the likelihood\nthat federal research spending crowds out private R&D spending varies by type\nof research. The risk of crowding out is greater when the government funds\nresearch whose potential commercial applications are obvious and valuable, as\nwas the case when federal and private research labs raced to map the human\ngenome. Second, federal research spending can also indirectly crowd out\nprivate spending by increasing the demand for skilled researchers. That could\ncause an increase in research labor costs in the private sector as well as in\nthe public sector.45\n\n**Tax Treatment of R &D Spending. **The tax code increases the supply of new\ndrugs in two ways: First, it provides tax credits for certain R&D expenditures\n(including credits available to all types of companies and credits\nspecifically for developing drug treatments for uncommon diseases). Second, it\nallows all types of companies to deduct expenditures that are not eligible for\nthe credits as business expenses in the year they are made. Both incentives\nencourage R&D spending by reducing its cost to the company.\n\nTax Incentives. __ The research and experimentation tax credit, available to\nall types of companies for certain qualifying R&D expenditures, directly\nreduces the amount of income tax a company owes.46 That tax credit has been\nmodified over time and was made permanent by the Consolidated Appropriations\nAct, 2016 (Public Law 114-113).47 Some of the increase in R&D spending by\npharmaceutical industries over the past several decades might have been a\nresponse to changes in that credit. In addition, the Orphan Drug Act (P.L.\n97-414), enacted in 1983, created a tax credit to encourage the development of\ndrugs to treat relatively uncommon diseases. Companies can also choose to\ndeduct the cost of R&D investments immediately rather than over the life of\nthe investment. Many companies use both tax credits and the ability to\naccelerate their deductions for investments in R&D, although only one tax\npreference may be used for any particular investment expense.\n\nEffects of the 2017 Tax Act. The net effect of P.L. 115-97 (originally called\nthe Tax Cuts and Jobs Act and called the 2017 tax act in this report) on R&D\ninvestment is uncertain. Investment in R&D is encouraged by the reduction in\nthe top corporate tax rate from 35 percent to 21 percent because earnings on\nnew drugs would be taxed at a lower rate.\n\nInvestment is discouraged by changes in how deductions for R&D expenditures\ncan be taken. The act is expected to reduce the value of tax deductions for\nR&D when they take effect. Beginning in 2022, companies will deduct their\nannual R&D costs over a five-year period rather than receiving the full tax\ndeduction in the year the expenses are incurred. That discourages investment\nin R&D because the value of that deduction will decline. The reduction in the\ntop corporate tax rate will further reduce the value of the tax deduction.\n\nThe 2017 tax act also reduced the tax credit created by the Orphan Drug Act\nfrom 50 percent to 25 percent of the cost of clinical trials.48 When combined\nwith the lower tax rate, that change will reduce the first-year tax benefits\nfor R&D spending on orphan drugs by about 40 percent. (Costs applied to the\ntax credit for orphan drugs cannot also be applied to the research and\nexperimentation credit, nor can they be deducted as expenses.) That change\nwill also discourage investment in drug R&D.\n\n**Policies Affecting Market Exclusivity.** The federal government has adopted\na variety of policies that grant periods of market exclusivity to\nmanufacturers in order to increase the supply of new drugs. During those\nperiods, the average prices for those new drugs are higher than they will be\nlater, once lower-priced, generic versions are allowed to enter the market.\nThe return on R&D spending provided by those higher prices encourages\ncompanies to develop new drugs. That incentive is not unlimited: A\nmanufacturer only receives market exclusivity over its own drug. There may be\ncompeting drugs in the same therapeutic market, and companies may introduce\nother new drugs into that market, providing they do not infringe the existing\ndrugs’ patents.\n\nThe primary way that the federal government grants innovators temporary market\nexclusivity is through the U.S. patent system. Most patents expire 20 years\nafter the date on which the patent application was filed, but pharmaceutical\ncompanies can receive several additional years of patent protection in\nrecognition that patented drugs cannot be sold until they complete clinical\ntrials. (Drug patent applications are often filed before the drug enters\nclinical trials, because disclosures from those trials could be considered\n“prior art” that might invalidate a patent if its application were filed after\nthose disclosures occurred.) In recognition that a drug might spend several\nyears of its market exclusivity in clinical trials, earning no revenue, the\nHatch-Waxman Act (P.L. 98-417) allows pharmaceutical companies to seek up to\nfive years of additional patent protection.\n\nPharmaceutical companies can also receive additional exclusivity—distinct from\nthat afforded by patents—for drugs that treat relatively uncommon diseases.\nThe Orphan Drug Act, enacted in 1983, offers seven years of market exclusivity\n(for the designated orphan use, irrespective of remaining patent life) for\ndrugs that either treat conditions affecting fewer than 200,000 persons in the\nUnited States or that, in the FDA’s judgment, face market conditions making it\nunlikely that an innovator could recover its R&D costs. The Orphan Drug Act\nappears to have led to an increase in the number of new drugs for rare\ndiseases.49\n\nPolicies Affecting Generic Drugs. __ In addition to extending the period of\nmarket exclusivity on brand-name drugs, the Hatch-Waxman Act (enacted in 1984)\nalso supports the development of generic drugs. It extends drug patents by up\nto five years but encourages competition from generic drugs once the patents\non a pioneering drug have expired.\n\nThe legislation allows the FDA to approve most generic drugs without clinical\ntrials. Instead, a manufacturer must show that its drug is pharmaceutically\nequivalent to the brand-name drug it copies, with the same active ingredients\nand no significant differences in the rate and extent of absorption at the\nsite of drug action in the body.\n\nThe legislation also allows the FDA to extend by three years a brand-name\ndrug’s market exclusivity for incremental changes, such as new indications,\ndosing regimens, or patient populations. (The FDA only grants that additional\nexclusivity when the manufacturer has conducted clinical trials that the\nagency judges were essential.)50\n\nThus, the act strengthened incentives to develop new drugs by extending drug\npatent life, and it made it easier for lower-cost generic versions to be\nintroduced when the drugs enter the public domain by allowing the FDA to\napprove most generics based on pharmaceutical equivalence rather than clinical\ntrials.\n\nPolicies Affecting Biosimilar Drugs. __ Congress has sought to provide\ninducement to the development of biosimilar drugs—the analog, for biologic\ndrugs, of the generic copies of small-molecule drugs. The Patient Protection\nand Affordable Care Act (P.L. 111-148) created an abbreviated pathway for FDA\napproval of biosimilar drugs. The manufacturer of a proposed biosimilar drug\nmust demonstrate that the drug is “highly similar to and has no clinically\nmeaningful differences from” the pioneering biologic drug.51 In addition,\nbiosimilar manufacturers do not need to conduct as many clinical trials as\nwere conducted for the pioneering drug because they can cite the FDA’s safety\nand effectiveness determinations for the original biologic drug.\n\nSo far, that legislation has resulted in relatively few approved biosimilar\ndrugs compared to the effect that the Hatch-Waxman Act had on the development\nof generic drugs. As of December 2020, the FDA had approved only 29 biosimilar\ndrugs, and not all of them have been introduced.52 Of the $125 billion in\nreported domestic retail spending on biologic drugs in 2017 (expressed here in\n2019 dollars), $11 billion was spent on biologics for which biosimilar\nversions are available, and only $0.9 billion was spent on those\nbiosimilars.53\n\nThe relative lack of competition for pioneering biologic drugs might\ncontribute to the shift in new-drug development toward biologic drugs instead\nof small-molecule drugs. In part, that shift might simply reflect advances in\nthe underlying science. But biologic drugs are also attractive targets of\nresearch because they are harder to copy. The patent system does not require\nthe original innovator to share the original cell line. Manufacturers seeking\nto make a biosimilar drug must develop their own living cell line to use as\nthe basis for the new drug. By contrast, the primary challenge in making a\ngeneric copy of a small-molecule drug is to replicate the original drug’s\nactive molecule, which is publicly disclosed in the patent. In addition, even\nunder the abbreviated pathway specified by the FDA, biosimilar drugs must\nstill be put through some clinical trials; unlike generic drugs, biosimilar\ndrugs cannot avoid them altogether.54\n\nBiologic drugs may face less competition than small- molecule drugs.\nIndependent of (but concurrent with) patent protection, the FDA grants\npioneering biologic drugs 12 years of guaranteed exclusivity in contrast to 5\nyears of exclusivity for small-molecule drugs.55 In addition, where biologic\ndrugs are concerned, consumers may not as readily accept a biosimilar\nsubstitute as they do a generic drug, because a biosimilar is not identical to\nthe drug it imitates.56 Consumer acceptance may be increasing with greater\navailability and familiarity with biosimilars. However, certain federal\npayment policies and private contractual agreements may discourage the use of\nbiosimilars.57 With the possibility of facing less competition even beyond the\nperiod of market exclusivity, makers of biologic drugs would anticipate\ngreater lifetime sales of those drugs as well.\n\n**Vaccine Policies** **.** **** Several federal policies increase the demand\nfor vaccines and therefore R&D spending to develop them. The federal Vaccines\nfor Children program provides vaccines at no cost to children who might\notherwise go unvaccinated because of their family’s inability to pay.\nAdditionally, the Centers for Disease Control and Prevention publishes a\nschedule of recommended childhood and adult vaccinations, including specific\nrecommendations for various groups, such as health care providers, travelers,\nexpectant mothers, racial and ethnic populations, and people with certain\nunderlying health conditions. Those recommendations induce individuals to have\nthemselves and their children vaccinated, and federal subsidies lower the\ncosts to consumers of those vaccinations. A study that analyzed the effects of\nsuch policies found that the recommendation in 1991 that infants be vaccinated\nagainst hepatitis B and the expansion of Medicare coverage to include the cost\nof influenza vaccination in 1993 were both associated with subsequent\nincreases in the development of new vaccines.58 Those findings suggest that\nmanufacturers expected demand for vaccines to increase as a result of the new\nrecommendations.\n\nFederal policies also affect the supply of vaccines. The same study considered\nthe federal Vaccine Injury Compensation Fund, which was established in 1986 to\nencourage manufacturers to develop and supply new vaccines by indemnifying the\nmanufacturers against lawsuits arising from adverse reactions to childhood\nvaccines. The study found that the fund’s introduction was associated with\nincreased development of new vaccines.\n\nIn 2020, the federal government invested directly in the development of\nvaccines by providing more than $19 billion in funding to support the private\ndevelopment of vaccines to prevent COVID-19 through its Biomedical Advanced\nResearch and Development Authority (see Box 2).\n\n**Regulatory Policies** **.** **** Federal regulatory policies that affect\neither drug supply or drug demand can influence drug companies’ returns on R&D\nspending, which would in turn affect the amount they were willing to spend on\nR&D. Proposed regulation of some drug prices would affect the sales volumes of\nexisting drugs and, as a result, expected returns on R&D on future drugs; in\nturn, lower expected returns would result in fewer new drugs. Changes to\nregulation of clinical trials would also affect the supply of new drugs.\n\nDrug Prices. U.S. markets are subject to less price regulation than are the\nmarkets in many other countries. Drug companies can mostly set their own\nprices, although some federal agencies purchase drugs at prices subject to a\nstatutory cap, impose statutory limits on how quickly a manufacturer can raise\nits prices, or receive rebates from manufacturers that are specified in\nstatute.59\n\nIn 2019, the House of Representatives passed H.R. 3, which would have required\nthe Secretary of Health and Human Services to negotiate with drug\nmanufacturers over the domestic prices of certain high-priced, single-source\ndrugs to ensure that they were no more than 20 percent higher than the average\nprices for those drugs in specific other countries. Under H.R. 3, drug\nmanufacturers that did not agree to participate in negotiations or that failed\nto agree to a negotiated price would have been subject to an excise tax. The\ncombination of income taxes and excise taxes on a drug’s sales might have\ncaused the manufacturer to lose money if the drug were sold in the United\nStates. Those taxes would have had the same effect as if the drug had not been\napproved for sale or as if there were a formulary—that is, a national list of\ndrugs that insurers could cover—from which the drug was excluded. Therefore,\nthe potential use of the excise tax would have served as a source of pressure\non drug manufacturers in negotiations and would have lowered drug prices and\nfederal spending, CBO estimated.60 (For a discussion of the effects of lower\nprices on the introduction of new drugs, see Box 3.)\n\nMore generally, state laws mandating or encouraging substitution of generic\ndrugs for their brand-name equivalents help lower drug prices.61 In addition,\nmost Medicare Part D plans encourage the substitution of generic drugs for\ntheir brand-name equivalents.62 And although the existence of generic drugs is\nenabled by the patent system’s disclosure requirement (compelling drugmakers\nto disclose the molecular structure of a drug’s active ingredient), several\nfederal regulatory decisions hasten the introduction of those drugs.63 Under\nthe Hatch-Waxman Act, generic drugs shown to contain the same active\ningredient as the pioneering drug do not need to be tested in clinical trials,\nas described above. The act also provides legal protections from claims of\npatent infringement to manufacturers who try to develop generic versions of a\npioneering drug before its patents have expired and from liability for adverse\nevents not __ listed on the label of the pioneering drug.64\n\nThat competition from generic drugs—which can also reduce the demand for new\ndrugs entering those markets—has tended to discourage investment in drug\nR&D.65 Several studies have found that a real 10 percent decrease in the\ngrowth of drug prices would be associated with about a 6 percent decrease in\npharmaceutical R&D spending as a share of net revenues.66\n\nClinical Trials. A substantial R&D expense that can account for more than half\nof R&D spending (excluding capital costs), clinical trials are conducted in\naccordance with federal requirements. As a result, changes to federal policy\nregarding clinical trials can meaningfully affect private R&D spending. In\nparticular, policymakers have made several changes to federal regulations\ngoverning clinical trials in an effort to reduce the time they take and\ntherefore lower their cost.\n\nFor example, FDA’s guidance, described above, on how drug companies can\nestablish bioequivalence between a biosimilar drug and the pioneering biologic\ndrug is intended to minimize the expenses of clinical trials associated with\ndeveloping biosimilar drugs.67 The Prescription Drug User Fee Act, enacted in\n1992, provided the FDA with additional resources to hasten the drug approval\nprocess, which reduced both the time to market and the capital costs of new-\ndrug development.\n\nMore recently, federal policymakers have allowed the use of “surrogate\nendpoints” in drug trials for certain illnesses, including HIV infection and\nsome cancers, to shorten some clinical trials. Surrogate endpoints include\nindirect, predictive indicators (such as blood pressure, cholesterol level,\ntumor size, T-cell counts, or other physical signs of disease), along with\nother test results and laboratory measures.68 The FDA can approve certain\nkinds of drug for sale in the U.S. based on clinical-trials results that rely\non such surrogate measures rather than on direct measures of a drug’s clinical\nbenefit.\n\nThe use of surrogate endpoints has helped neutralize a tendency in privately\nfunded research to emphasize treatments that can be commercialized more\nquickly, which can result in too little investment in clinically valuable\ntreatments that would take longer to develop.69 Speedier clinical trials can\nalso benefit patients by hastening the introduction of life-extending\ntherapies like the HIV antiretroviral treatments developed in the 1990s.70\nHowever, relying on surrogate endpoints means that consumers might spend money\non some drugs that would turn out to have little clinically meaningful\neffect.71\n\n* * *\n\n1. See Pharmaceutical Research and Manufacturers of America, _2020  PhRMA Annual Membership Survey_ (PhRMA, 2020), https://tinyurl.com/ydh6p64t, and _2019  PhRMA Annual Membership Survey_ (PhRMA, 2019), https://tinyurl.com/ycvneve7 (PDF, 2.15 MB).\n\n2. The total includes only research funded by PhRMA member firms, including any contract research funded by those firms and performed on their behalf by universities or other contract-research laboratories. In particular, the PhRMA total does not __ include expenditures to acquire the R&D assets (such as drugs in development) of another firm.\n\n3. See National Science Foundation, “Business Enterprise Research and Development Survey” (accessed February 25, 2021), www.nsf.gov/statistics/srvyberd/.\n\n4. See Pharmaceutical Research and Manufacturers of America, _2019  PhRMA Annual Membership Survey_ (PhRMA, 2019), Table 2, https://tinyurl.com/ycvneve7 (PDF, 2.15 MB).\n\n5. That range applies to average R&D intensity for the approximately 4,000 firms in the Standard & Poor’s (S&P) Total Market Index, a combination of the S&P 500 Index and the S&P Completion Index (an index of the total U.S. stock market, excluding firms in the S&P 500). CBO chose the Total Market Index as a basis of comparison because of its breadth.\n\n6. See Congressional Budget Office, _Prices for and Spending on Specialty Drugs in Medicare Part D and Medicaid_ (March 2019), www.cbo.gov/publication/54964.\n\n7. Unobserved rebates are paid by manufacturers to insurers or buyers and are considered proprietary information.\n\n8. See Department of Veterans Affairs, “Hepatitis C Medications: An Overview for Patients” (accessed March 16, 2021), https://go.usa.gov/xs7qe.\n\n9. See IQVIA Institute for Human Data Science, _Medicine Use and Spending in the U.S._ (April 2018), p. 37, https://tinyurl.com/yd5cnvrl.\n\n10. See Qi Sun and Mindy Z. Xiaolan, “Financing Intangible Capital,” _Journal of Financial Economics,_ vol. 133, no. 3 (September 2019), pp. 564-588, https://doi.org/10.1016/j.jfineco.2019.04.003; Bronwyn Hall and Josh Lerner, “The Financing of R&D and Innovation,” in Bronwyn H. Hall and Nathan Rosenberg, eds., _Handbook of the Economics of Innovation_ , vol. 1 (North Holland, 2010), pp. 609–639; and Thomas W. Bates, Kathleen M. Kahle, and René M. Stulz, “Why Do U.S. Firms Hold So Much More Cash Than They Used To?” _The Journal of Finance,_ vol. 64, no. 5 (October 2009), pp. 1985–2021, https://doi.org/10.1111/j.1540-6261.2009.01492.x.\n\n11. See R. Glenn Hubbard, “Capital-Market Imperfections and Investment,” _Journal of Economic Literature,_ vol. 36, no. 1 (March 1998), pp. 193–225, www.jstor.org/stable/2564955.\n\n12. See Government Accountability Office, _Drug Industry: Profits, Research and Development Spending, and Merger and Acquisition Deals_ , GAO-18-40 (November 2017), p. 36, www.gao.gov/products/GAO-18-40.\n\n13. Ibid., p. 37.\n\n14. A company can, within limits, influence its own success rate because that rate depends on the kinds of drugs the company chooses to pursue and to advance into clinical trials and on how the company manages its research process. For estimated success rates, see Chi Heem Wong, Kien Wei Siah, Andrew W Lo, “Estimation of clinical trial success rates and related parameters,” _Biostatistics_ , vol. 20, no. 2 (April 2019), pp. 273–286, https://doi.org/10.1093/biostatistics/kxx069; David Thomas and others, _Clinical Development Success Rates 2006–2015  _(Biotechnology Innovation Organization, Amplion, and Biomedtracker, 2016), https://tinyurl.com/y2n8rnzb (PDF, 4.02 MB); and Michael Hay and others, “Clinical Development Success Rates for Investigational Drugs,” _Nature Biotechnology_ , vol. 32, no. 1 (2014), pp. 40–51, https://doi.org/10.1038/nbt.2786.\n\n15. See Joseph A. DiMasi, Henry G. Grabowski, and Ronald W. Hansen, “Innovation in the Pharmaceutical Industry: New Estimates of R&D Costs,” _Journal of Health Economics,_ vol. 47 (May 2016), p. 25, https://doi.org/10.1016/j.jhealeco.2016.01.012. The estimate reported in that study is $430 million in 2013 dollars.\n\n16. Ibid., p. 23.\n\n17. See Vinay Prasad and Sham Mailankody, “Research and Development Spending to Bring a Single Cancer Drug to Market and Revenues After Approval,” _JAMA Internal Medicine,_ vol. 177, no. 11 (November 2017), pp. 1569–1575, https://doi.org/10.1001/jamainternmed.2017.3601.\n\n18. See Barbara Bolten, “Fastest Drug Developers and Their Practices,” _The CenterWatch Monthly,_ vol. 24, no. 8 (August 1, 2017), www.centerwatch.com/articles/13284%20.\n\n19. See __ IQVIA Institute for Human Data Science, _The Changing Landscape of Research and Development_ (April 2019), p. 7, https://tinyurl.com/y2kpxve8.\n\n20. See Joseph A. DiMasi, Henry G. Grabowski, and Ronald W. Hansen, “Innovation in the Pharmaceutical Industry: New Estimates of R&D Costs,” _Journal of Health Economics_ , vol. 47 (May 2016), pp. 23–24, https://doi.org/10.1016/j.jhealeco.2016.01.012.\n\n21. Ibid., pp. 24–25. The corresponding values in the study, reported in millions of 2013 dollars, are $965, $25.3, $58.6, and $255.4, respectively.\n\n22. The values reported here all use a 7 percent cost of capital, as each study includes calculations that use that rate. (In its analysis of the budgetary effects of H.R. 3 for the 116th Congress, CBO used an 8.1 percent cost of capital for drug R&D because that is CBO’s assessment of the cost; using a higher rate tends to slightly increase estimates of R&D costs.) See Congressional Budget Office, letter to the Honorable Frank Pallone Jr. regarding the budgetary effects of H.R. 3, the Elijah E. Cummings Lower Drug Costs Now Act (December 10, 2019), www.cbo.gov/publication/55936. CBO has converted the values reported here to 2019 dollars.\n\n23. See Joseph A. DiMasi, Henry G. Grabowski, and Ronald W. Hansen, “Innovation in the Pharmaceutical Industry: New Estimates of R&D Costs,” _Journal of Health Economics_ , vol. 47 (May 2016), p. 26–27, https://doi.org/10.1016/j.jhealeco.2016.01.012. The values reported in the 2016 DiMasi study, in millions of 2013 dollars and using their central discount rate value of 10.5 percent, are $2,558, $1,098, and $1,460, respectively.\n\n24. Ibid., p. 20.\n\n25. For a critical review of the 2016 study by DiMasi and others, see Sammy Almashat, “Pharmaceutical Research Costs: The Myth of the $2.6 Billion Pill” (Public Citizen, September 2017), https://tinyurl.com/y4kb4xoq.\n\n26. See Christopher P. Adams and Van V. Brantner, “Estimating the Cost of New Drug Development: Is It Really $802 Million?” _Health Affairs_ , vol. 25, no. 2 (March/April 2006), pp. 420–428, https://doi.org/10.1377/hlthaff.25.2.420.\n\n27. See Olivier J. Wouters, Martin McKee, and Jeroen Luyten, “Estimated Research and Development Investment Needed to Bring a New Medicine to Market, 2009–2018,” _Journal of the American Medical Association,_ vol. 323, no. 9 (2020), pp. 844–853, https://doi.org/10.1001/jama.2020.1166. The study’s central published values differ from those reported above: they are expressed in 2018 dollars and use a 10.5 percent cost of capital. The authors also estimated R&D costs using a 7 percent discount rate.\n\n28. See Vinay Prasad and Sham Mailankody, “Research and Development Spending to Bring a Single Cancer Drug to Market and Revenues After Approval,” _JAMA Internal Medicine,_ vol. 177, no. 11 (November 2017), pp. 1569–1575, https://doi.org/10.1001/jamainternmed.2017.3601. The estimates reported in the study are in 2017 dollars.\n\n29. See Joseph A. DiMasi, Henry G. Grabowski, and Ronald W. Hansen, “Innovation in the Pharmaceutical Industry: New Estimates of R&D Costs,” _Journal of Health Economics_ , vol. 47 (May 2016), p. 20, https://doi.org/10.1016/j.jhealeco.2016.01.012. The estimate is based on the authors’ comparison of their 2016 findings with an estimate they published in 2007 ($1.2 billion, in 2005 dollars) using the same methods. See Joseph A. DiMasi and Henry G. Grabowski, “The Cost of Biopharmaceutical R&D: Is Biotech Different?” _Managerial and Decision Economics_ , vol. 28, no. 4-5 (June–August 2007), pp. 469–479, https://doi.org/10.1002/mde.1360.\n\n30. See Joseph A. DiMasi, Henry G. Grabowski, and Ronald W. Hansen, “Innovation in the Pharmaceutical Industry: New Estimates of R&D Costs,” _Journal of Health Economics_ , vol. 47 (May 2016), Table 1, https://doi.org/10.1016/j.jhealeco.2016.01.012.\n\n31. See Chi Heem Wong, Kien Wei Siah, and Andrew W. Lo, “Estimation of Clinical Trial Success Rates and Related Parameters,” _Biostatistics_ , vol. 20, no. 2 (April 2019), pp. 273–286. https://doi.org/10.1093/biostatistics/kxx069; and Jorge Mestre-Ferrandiz, Jon Sussex, and Adrian Towse, _The R &D Cost of a New Medicine_ (Office of Health Economics, United Kingdom, 2012).\n\n32. See Anup Malani and Tomas J. Philipson, _Can Medical Progress Be Sustained? Implications of the Link Between Development and Output Markets_ , Working Paper 17011 (National Bureau of Economic Research, September 2012), www.nber.org/papers/w17011.\n\n33. See Darius N. Lakdawalla, “Economics of the Pharmaceutical Industry,” _Journal of Economic Literature,_ vol. 56, no. 2 (June 2018), p. 401, https://doi.org/10.1257/jel.20161327.\n\n34. See Centers for Medicare & Medicaid Services, National Health Expenditures Data, “NHE Tables” (accessed December 16, 2020), Table 16, https://go.usa.gov/xASdV. In the table, the sum of expenditures by Medicare, Medicaid, and “Other Health Insurance Programs” (primarily the Veterans Health Administration, TRICARE, and the Children’s Health Insurance Program) accounts for 40 percent of total retail expenditures on prescription drugs in 2019.\n\n35. See Margaret E. Blume-Kohout and Neeraj Sood, “Market Size and Innovation: Effects of Medicare Part D on Pharmaceutical Research and Development,” _Journal of Public Economics,_ vol. 97 (January 2013), pp. 327–336, https://doi.org/10.1016/j.jpubeco.2012.10.003; and David Dranove, Craig Garthwaite, and Manuel I. Harmosilla, _Expected Profits and the Scientific Novelty of Innovation_ , Working Paper 27093 (National Bureau of Economic Research, May 2020), www.nber.org/papers/w27093.\n\n36. For an analysis of likely effects of such a policy change on individuals’ decisions about health insurance and consumption of health-care services in general, see Congressional Budget Office, _Options for Reducing the Deficit: 2019 to 2028  _(December 2018), pp. 235–236, www.cbo.gov/publication/54667.\n\n37. See Margaret E. Blume-Kohout, “Does Targeted, Disease-Specific Public Research Funding Influence Pharmaceutical Innovation?” _Journal of Policy Analysis and Management_ , vol. 31, no. 3 (Summer 2012), pp. 641–660, https://doi.org/10.1002/pam.21640; and Michael R. Ward and David Dranove, “The Vertical Chain of Research and Development in the Pharmaceutical Industry,” _Economic Inquiry,_ vol. 33, no. 1 (January 1995), pp. 70–87, https://tinyurl.com/z7huxuxv.\n\n38. See Kavya Sekar, _National Institutes of Health (NIH) Funding, FY1995–FY2021,  _Report R43341, version 39 (Congressional Research Service, May 12, 2020), https://go.usa.gov/xshZu. Nominal funding levels have been adjusted for inflation by CBO using the gross domestic price index.\n\n39. Ekaterina Galkina Cleary and others, “Contribution of NIH Funding to New Drug Approvals 2010–2016,” _Proceedings of the National Academy of Sciences_ , vol. 115, no. 10 (March 6, 2018), pp. 2329–2334. https://doi.org/10.1073/pnas.1715368115.\n\n40. Department of Health and Human Services, Office of the Assistant Secretary for Planning and Evaluation, _Report to Congress: Prescription Drug Pricing_ (May 20, 2020), https://go.usa.gov/xAVns (PDF, 2.04 MB).\n\n41. See Paul A. David, Bronwyn H. Hall, and Andrew A. Toole, “Is Public R&D a Complement or Substitute for Private R&D? A Review of the Econometric Evidence,” _Research Policy_ , vol. 29, no. 4–5 (April 2000), pp. 497–529, https://doi.org/10.1016/S0048-7333(99)00087-6; and Bettina Becker, “Public R&D Policies and Private R&D Investment: A Survey of the Empirical Evidence,” _Journal of Economic Surveys_ , vol. 29, no. 5 (December 2015), pp. 917–942, https://doi.org/10.1111/joes.12074.\n\n42. For additional information, see Wendy H. Schacht, _Federal R &D, Drug Discovery, and Pricing: Insights From the NIH-University-Industry Relationship_, Report RL32324 (Congressional Research Service, November 30, 2012).\n\n43. See Andrew A. Toole, “Does Public Scientific Research Complement Private Investment in R&D in the Pharma-ceutical Industry?” _Journal of Law & Economics_, vol. 50, no. 1 (February 2007), pp. 81–104, https://doi.org/10.1086/508314.\n\n44. See Pierre Azoulay and others, “Public R&D Investments and Private-Sector Patenting: Evidence From NIH Funding Rules,” _Review of Economic Studies_ , vol. 86, no. 1 (January 2019), pp. 117–15, https://doi.org/10.1093/restud/rdy034.\n\n45. See Austan Goolsbee, “Does Government R&D Policy Mainly Benefit Scientists and Engineers?” _American Economic Review_ , vol. 88, no. 2 (May 1998), pp. 298–302, www.jstor.org/stable/116937.\n\n46. For example, only spending on research deemed to be “technological in nature” qualifies for the credit. See Congressional Budget Office, _How Taxes Affect the Incentive to Invest in New Intangible Assets_ (November 2018), www.cbo.gov/publication/54648.\n\n47. For a history and description of the credit, see Gary Guenther, _Research Tax Credit: Current Law and Policy Issues for the 114th Congress,_ Report RL31181, version 70 (Congressional Research Service, June 18, 2016), https://go.usa.gov/xshBx.\n\n48. See Congressional Budget Office, _How Taxes Affect the Incentive to Invest in New Intangible Assets_ (November 2018), www.cbo.gov/publication/54648.\n\n49. Wesley Yin, “Market Incentives and Pharmaceutical Innovation,” _Journal of Health Economics,_ vol. 27, no. 4 (2008), pp. 1060–1077. https://doi.org/10.1016/j.jhealeco.2008.01.002.\n\n50. See New Drug Product Exclusivity, 21 C.F.R. § 314.108 (2020).\n\n51. See Food and Drug Administration, “Biosimilar Development, Review, and Approval” (October 20, 2017), https://go.usa.gov/xASPs.\n\n52. See Food and Drug Administration, “Biosimilar Product Information” (December 17, 2020), https://go.usa.gov/xAVna.\n\n53. See IQVIA Institute for Human Data Science, _Medicine Use and Spending in the U.S.: A Review of 2017 and Outlook to 2022  _(April 2018), p. 11\\. https://tinyurl.com/y36l4bqt.\n\n54. See Food and Drug Administration, “Generic Drugs Undergo Rigorous FDA Scrutiny” (October 8, 2014), https://go.usa.gov/xAVRg, and “Biosimilar Development, Review, and Approval” (October 20, 2017), https://go.usa.gov/xAVR4.\n\n55. For biologics, see 42 U.S.C. § 262(k)(7)(A) (2018); for orphan drugs, see 21 U.S.C. § 360cc (2018); for small-molecule drugs, see § 355(j)(5)(F)(ii) (2018). Companies can receive an additional six months of exclusivity (beyond its patent exclusivity) if a drug—in any of its formulations, dosages, or approved indications—is designed for pediatric patients. See Food and Drug Administration, “Qualifying for Pediatric Exclusivity Under Section 505A of the Federal Food, Drug, and Cosmetic Act: Frequently Asked Questions on Pediatric Exclusivity” (November 30, 2016), https://go.usa.gov/xAVRP.\n\n56. See Darius N. Lakdawalla, “Economics of the Pharmaceutical Industry,” _Journal of Economic Literature,_ vol. 56, no. 2 (June 2018), pp. 403–404, https://doi.org/10.1257/jel.20161327.\n\n57. See Revisions to Payment Policies under the Physician Fee Schedule and Other Revisions to Part B for CY 2018, 82 Fed. Reg. 52976, 53181 (November 15, 2017), www.govinfo.gov/app/details/FR-2017-11-15; and Tony Hagen, “Remove the Disincentives and Biosimilars Will Flourish,” The Center for Biosimilars (July 7, 2020), https://tinyurl.com/acq5f5t3.\n\n58. See Amy Finkelstein, “Static and Dynamic Effects of Health Policy: Evidence From the Vaccine Industry,” _Quarterly Journal of Economics,_ vol. 119, no. 2 (May 2004), pp. 527–564, https://doi.org/10.1162/0033553041382166.\n\n59. See Congressional Budget Office, _A Comparison of Brand-Name Drug Prices Among Selected Federal Programs_ (February 2021), www.cbo.gov/publication/56978.\n\n60. See Congressional Budget Office, letter to the Honorable Frank Pallone Jr. regarding the budgetary effects of H.R. 3, the Elijah E. Cummings Lower Drug Costs Now Act (December 10, 2019), www.cbo.gov/publication/55936; Christopher Adams and Evan Herrnstadt, _CBO’s Model of Drug Price Negotiations Under the Elijah E. Cummings Lower Drug Costs Now Act_ , Working Paper 2021-01 (Congressional Budget Office, February 2021), www.cbo.gov/publication/56905.\n\n61. See Yan Song and Douglas Barthold, “The Effects of State-Level Pharmacist Regulations on Generic Substitution of Prescription Drugs,” _Health Ecoomics,_ vol. 27, no. 11 (November 2018), pp. 1717-1737. https://doi.org/10.1002/hec.3796.\n\n62. See Stacie B. Dusetzina and others, “Medicare Part D Plans Rarely Cover Brand-Name Drugs When Generics Are Available,” _Health Affairs,_ vol. 39, no. 8 (August 2020), pp. 1326–1333, https://doi.org/10.1377/hlthaff.2019.01694.\n\n63. The patent system enables imitation of innovation (such as generic copies of pioneering drugs) by requiring the innovator, in exchange for a patent on a pioneering drug, to disclose sufficient details about the invention to allow “a person having ordinary skill in the art” to replicate it when the patent expires. See 35 U.S.C. § 103 (2018).\n\n64. For legal protection against adverse-event liability, see Aaron S. Kesselheim, Jerry Avorn, and Jeremy A. Greene, “Risk, Responsibility, and Generic Drugs,” _New England Journal of Medicine,_ vol. 367, no. 18 (November 1, 2012), pp. 1679–1681, https://doi.org/10.1056/NEJMp1208781. In the Hatch-Waxman Act, those provisions are balanced by the provision of stronger patent protections to drug innovators, including extension of the statutory period of patent protection by a portion of the time the drug is under FDA review, and five years of ensured market exclusivity before the FDA may approve the first generic copy of a pioneering drug.\n\n65. See Joseph P. Cook, Graeme Hunter, and John A. Vernon, _Generic Utilization Rates, Real Pharmaceutical Prices, and Research and Development Expenditures_ , Working Paper 15723 (National Bureau of Economic Research, February 2010), www.nber.org/papers/w15723.\n\n66. See Carmelo Giaccotto, Rexford E. Santerre, and John A. Vernon, “Drug Prices and Research and Development Investment Behavior in the Pharmaceutical Industry,” _Journal of Law and Economics_ , vol. 48, no. 1 (April 2005), pp. 194–214, https://doi.org/10.1086/426882; and F. M. Scherer, _Industry Structure, Strategy, and Public Policy_ (Harper Collins, 1996).\n\n67. See Food and Drug Administration, “Bioavailability and Bioequivalence Studies Submitted in NDAs or INDs—General Considerations” (March 2014), https://go.usa.gov/xAV5f.\n\n68. For a comprehensive list of surrogate endpoints used, see Food and Drug Administration, “Table of Surrogate Endpoints That Were the Basis of Drug Approval or Licensure” (March 30, 2021), https://go.usa.gov/xASyF.\n\n69. See Eric Budish, Benjamin N. Roin, and Heidi Williams, “Do Firms Underinvest in Long-Term Research? Evidence from Cancer Clinical Trials,” _American Economic Review,_ vol. 105, no. 7 (July 2015), pp. 2044–2085. https://doi.org/10.1257/aer.20131176.\n\n70. See Mark G. Duggan and William N. Evans, “Estimating the Impact of Medical Innovation: A Case Study of HIV Antiretroviral Treatments,” _Forum for Health Economics and Policy,_ vol. 11, no. 2 (January 2008), pp. 1–37, https://doi.org/10.2202/1558-9544.1102.\n\n71. See Bishal Gyawali, Spencer Phillips Hey, and Aaron S. Kesselheim, “Assessment of the Clinical Benefit of Cancer Drugs Receiving Accelerated Approval,” _JAMA Internal Medicine,_ vol. 179, no. 7 (May 28, 2019), pp. 906–913, https://doi.org/10.1001/jamainternmed.2019.0462.\n\n## About This Document\n\nThis Congressional Budget Office report was prepared at the request of the\nChairman of the Senate Committee on Finance. In accordance with CBO’s mandate\nto provide objective, impartial analysis, the report makes no recommendations.\n\nDavid Austin and Tamara Hayford prepared the report with guidance from Joseph\nKile, Lyle Nelson, and Julie Topoleski. Christopher Adams, Pranav Bhandarkar,\nand David Wylie (formerly of CBO) contributed to the analysis. Anna Anderson-\nCook (formerly of CBO), Colin Baker, Paul Burnham, Julia Christensen, Michael\nFalkenheim, Sebastien Gay, Ryan Greenfield, Stuart Hammond, Evan Herrnstadt,\nLeo Lex, Paul Masi, John McClelland, Lara Robillard, Ellen Werble, Chapin\nWhite, and Katherine Young provided useful comments.\n\nPierre Azoulay of the Sloan School of Management at the Massachusetts\nInstitute of Technology, Peter Bach of the Memorial Sloan Kettering Cancer\nCenter, and Craig Garthwaite of the Kellogg School of Management at\nNorthwestern University provided helpful comments on the draft. (The\nassistance of external reviewers implies no responsibility for the final\nproduct, which rests solely with CBO.)\n\nJeffrey Kling reviewed the report. The editor was Caitlin Verboon, and R. L.\nRebach was the graphics editor and cover illustrator. The report is available\non CBO’s website (www.cbo.gov/publication/57025).\n\nCBO continually seeks feedback to make its work as useful as possible. Please\nsend any comments to communications@cbo.gov.\n\nPhillip L. Swagel\n\nDirector\n\nApril 2021\n\n## Stay Connected\n\nGet CBO’s Email Updates\n\n  1. Email Address\n  2. Submit\n\n## Footer Menu\n\n  * About\n  * Topics\n  * Cost Estimates\n  * FAQs\n  * Blog\n\n## Footer Menu - Utility\n\n  * Work at CBO\n  * Business Opportunities\n  * Contact CBO\n  * Press Center\n  * Privacy, Security, and Copyright Policies\n  * Sitemap\n\n",
    "links": "[{\"link\": \"https://www.cbo.gov/\", \"text\": \"\"}, {\"link\": \"https://www.cbo.gov/about/overview\", \"text\": \"About CBO\"}, {\"link\": \"https://www.cbo.gov/topics\", \"text\": \"Topics\"}, {\"link\": \"https://www.cbo.gov/cost-estimates\", \"text\": \"Cost Estimates\"}, {\"link\": \"https://www.cbo.gov/data\", \"text\": \"Data\"}, {\"link\": \"https://www.cbo.gov/interactives\", \"text\": \"Interactives\"}, {\"link\": \"https://www.cbo.gov/faqs\", \"text\": \"FAQs\"}, {\"link\": \"https://www.cbo.gov/blog\", \"text\": \"Blog\"}, {\"link\": \"https://www.cbo.gov/publication/57025\", \"text\": \"Report's Home Page\"}, {\"link\": \"https://www.cbo.gov/publication/57025#data\", \"text\": \"Data and Supplemental Information\"}, {\"link\": \"https://www.cbo.gov/publication/57025#related_pub\", \"text\": \"Related Publications\"}, {\"link\": \"https://www.cbo.gov/system/files/2021-04/57025-Rx-RnD.pdf\", \"text\": \"Download\"}, {\"link\": \"https://www.cbo.gov/publications/all/rss.xml\", \"text\": \"\"}, {\"link\": \"https://www.cbo.gov/about/overview\", \"text\": \"About\"}, {\"link\": \"https://www.cbo.gov/topics\", \"text\": \"Topics\"}, {\"link\": \"https://www.cbo.gov/cost-estimates\", \"text\": \"Cost Estimates\"}, {\"link\": \"https://www.cbo.gov/faqs\", \"text\": \"FAQs\"}, {\"link\": \"https://www.cbo.gov/blog\", \"text\": \"Blog\"}, {\"link\": \"https://www.cbo.gov/about/careers\", \"text\": \"Work at CBO\"}, {\"link\": \"https://www.cbo.gov/about/business-opportunities\", \"text\": \"Business Opportunities\"}, {\"link\": \"https://www.cbo.gov/about/contact\", \"text\": \"Contact CBO\"}, {\"link\": \"https://www.cbo.gov/about/press-center\", \"text\": \"Press Center\"}, {\"link\": \"https://www.cbo.gov/about/privacy\", \"text\": \"Privacy, Security, and Copyright Policies\"}, {\"link\": \"https://www.cbo.gov/sitemap\", \"text\": \"Sitemap\"}]"
}