{
    "summary": "How it works Open Source Enterprise Pricing\n\nLogin Signup\n\nHow it works Open Source Enterprise Pricing About Blog Login Try for free\n\n# Regain control over  \nyour dependencies\n\n## We believe doing small, easy to assess updates regularly and supported by\nautomation is the best way for busy teams to keep their apps up-to-date.\n\nProud that these great companies rely on Depfu to keep their apps up-to-date\n\n  *   *   *   *   * \n\n\"Absolutely loving Depfu. When managing quite a few repos across Baremetrics,\nit really helps keep on top of updates and security patches.\"\n\nScott Robertson — Software Engineer, Baremetrics\n\n\"Before I was always running bundle outdated first thing in the morning, but\nit was up to me to actually remember. With Depfu I wake up to PRs that I can\nact on right away.\"\n\nRobin Mehner — Freelance Developer\n\n## A lightweight process for updating  \ndependencies that actually works\n\n### Get notified about new versions right where you work — with a pull request\n\nThe number of open PRs is limited and Depfu adapts to your pace so we never\noverwhelm you or your CI system with updates.\n\nBy default we send one PR per new version, but you can also get weekly or\nmonthly PRs updating several dependencies at once.\n\n* * *\n\nUpdating becomes part of your day-to-day workflow — instead of a boring,\neasily forgotten task.\n\n### The PR has all the info you need to make an informed decision about a\ndependency update\n\nWe collect everything from security advisories, release notes to all commits\nfor that version. We even parse the changelog to extract the details of a\nsingle version.\n\nTogether with your build status, you can easily judge the risk of that update.\n\n* * *\n\nThe vast majority of updates can be done by just clicking that merge button —\nyou stay in control.\n\n### Depfu figures out the minimum number of updates you need to keep you\nreasonably up-to-date\n\nThere is no value in being on all the latest versions, you just want your\ndependencies to stay current. It's called bleeding edge for a reason.\n\nThe Depfu scheduler \"matures\" new versions depending on the library's past\nrelease frequency instead of opening a PR right away.\n\n* * *\n\nThis reduces the number of PRs per week compared to sending you every new\nversion by roughly 50% — sometimes more, sometimes less.\n\n## Does this sound familiar?\n\n  * Your process for dependency updates is “whenever someone on the team has some extra time”.\n  * You're a bit behind and would have to update a lot of things at the same time if there is a security vulnerability in one of your dependencies.\n  * Upgrading dependencies is too easily ignored over more visible work — it's a pretty boring and thankless job.\n\n## Depfu's continuous updates keep your  \napp secure and maintainable\n\n  * Doing small, easy to assess updates continuously is a lot easier than falling behind and having to update a big batch at once.\n  * Depfu notifies you about security releases and ensures you are able to apply and deploy them as quickly as possible.\n  * We help you bring even really out-of-date apps slowly up to speed. At your own pace, without overwhelming you with PRs.\n\n## Ready to get started?\n\n#### All plans start with a 21-day free trial\n\nStart using Depfu\n\n#### Or read more  \nabout the details\n\nSee how Depfu works\n\n\"Depfu is a great tool that helps you to reduce the stress of periodically\nchecking dependency updates, with the risk to miss important releases. It\ndefinitely reduced the time we spend on maintenance at dnsimple.\"\n\nSimone Carletti  \nCTO, dnsimple\n\n👋\n\n**Welcome 5by5 Ruby on Rails Podcast listeners!** We've prepared a little gift\nfor you. If you sign up now, you'll automatically get an additional free month\nof Depfu!\n\nGet the great feeling of up-to-date dependencies and secure software without\nall the boring manual work.\n\n  * Pricing\n  * Enterprise\n  * Open Source\n  * How it works\n\n  * Terms\n  * Privacy\n  * Imprint\n  * Security\n\n  * Blog\n  * Docs\n  * About\n  * @depfu\n\n",
    "links": "[{\"link\": \"https://depfu.com/\", \"text\": \"\"}, {\"link\": \"https://depfu.com/how-it-works\", \"text\": \"How it works\"}, {\"link\": \"https://depfu.com/for-open-source\", \"text\": \"Open Source\"}, {\"link\": \"https://depfu.com/enterprise\", \"text\": \"Enterprise\"}, {\"link\": \"https://depfu.com/pricing\", \"text\": \"Pricing\"}, {\"link\": \"https://depfu.com/login\", \"text\": \"Login\"}, {\"link\": \"https://depfu.com/signup\", \"text\": \"Signup\"}, {\"link\": \"https://depfu.com/how-it-works\", \"text\": \"How it works\"}, {\"link\": \"https://depfu.com/for-open-source\", \"text\": \"Open Source\"}, {\"link\": \"https://depfu.com/enterprise\", \"text\": \"Enterprise\"}, {\"link\": \"https://depfu.com/pricing\", \"text\": \"Pricing\"}, {\"link\": \"https://depfu.com/about\", \"text\": \"About\"}, {\"link\": \"https://depfu.com/blog/\", \"text\": \"Blog\"}, {\"link\": \"https://depfu.com/login\", \"text\": \"Login\"}, {\"link\": \"https://depfu.com/signup\", \"text\": \"Try for free\"}, {\"link\": \"https://depfu.com/signup\", \"text\": \"Start using Depfu\"}, {\"link\": \"https://depfu.com/how-it-works\", \"text\": \"See how Depfu works\"}, {\"link\": \"https://depfu.com/\", \"text\": \"\"}, {\"link\": \"https://depfu.com/pricing\", \"text\": \"Pricing\"}, {\"link\": \"https://depfu.com/enterprise\", \"text\": \"Enterprise\"}, {\"link\": \"https://depfu.com/for-open-source\", \"text\": \"Open Source\"}, {\"link\": \"https://depfu.com/how-it-works\", \"text\": \"How it works\"}, {\"link\": \"https://depfu.com/terms\", \"text\": \"Terms\"}, {\"link\": \"https://depfu.com/privacy-policy\", \"text\": \"Privacy\"}, {\"link\": \"https://depfu.com/imprint\", \"text\": \"Imprint\"}, {\"link\": \"https://depfu.com/security\", \"text\": \"Security\"}, {\"link\": \"https://depfu.com/blog/\", \"text\": \"Blog\"}, {\"link\": \"https://depfu.com/about\", \"text\": \"About\"}]",
    "priceAndPlans": "How it works Open Source Enterprise Pricing\n\nLogin Signup\n\nHow it works Open Source Enterprise Pricing About Blog Login Try for free\n\n# Try Depfu free for 21 days\n\n## Spend your time on stuff that matters and let us do the boring chore of\nupdating dependencies.\n\nOpen Source/  \nPersonal\n\nFree\n\nfor public and personal account repos\n\nUnlimited  \ndependency updates\n\nStart now\n\nStarter\n\n$29/mo\n\n5 private repos\n\nUnlimited  \ndependency updates\n\nStart now\n\nTeam\n\n$59/mo\n\n25 private repos\n\nUnlimited  \ndependency updates\n\nStart now\n\nBusiness\n\n$99/mo\n\n100 private repos\n\nUnlimited  \ndependency updates\n\nPremium Support\n\nStart now\n\n## All plans come with a 21 days trial period. No credit card required. Cancel\nanytime.\n\n\"Depfu is really worth every cent. It helps so much with keeping all\ndependencies up to date and makes the process so seamless. That good feeling\nof having it all up to date is really great!\"\n\nTobias Pfeiffer  \nTech Lead, Liefery\n\n### Free for Open Source. Forever.\n\nAdd your public repo\n\n### GitHub or GitLab on premise?\n\nDepfu Enterprise\n\n#### How does the 21-day free trial work?\n\nWe're confident you're going to like Depfu, so we make it easy. No credit card\nis required to create an account. Just signup, add your first Git repository,\nand you’re on your way. After 21 days you'll need to add your billing\ninformation to keep using Depfu for private repositories – or you can keep\nusing it for OSS for free, forever.\n\n#### Can I change my plan? Can I cancel anytime?\n\nAbsolutely! You can upgrade or downgrade plans, as well as cancel altogether.\n\n#### How can I pay?\n\nPrices are in USD. We accept all major credit cards.\n\n#### Do the listed prices include VAT?\n\nPrices listed are excluding VAT, which will be added depending on origin\n(Germany and Europe). Make sure to have your company's VAT ID ready when\nentering billing details to remove VAT.\n\n#### Can I pay annually?\n\nYou most certainly can! When signing up for a subscription, simply select the\nannual option. You get 2 months for free – 12 months for the price of 10!\n\n#### I’m using microservices and have a ton of projects. What should I do?\n\nIf you have many small repositories, contact us and we’ll work something out.\n\n#### Do you store any credit card information in your systems?\n\nNo. All credit card activity and information is handled by our third-party\nprovider, Stripe. See Stripe’s Terms and Services.\n\n#### How does Depfu keep my code safe?\n\nWe take the security of your company's source code very seriously. Our\nSecurity page outlines how we ensure your code is safe. For companies with\nsecurity requirements that limit their ability to host their code with third-\nparty services, please get in touch, we're working on a solution for that.\n\nStill have some questions?\n\n#### We would be happy to hear from you\n\nContact Us\n\nGet the great feeling of up-to-date dependencies and secure software without\nall the boring manual work.\n\n  * Pricing\n  * Enterprise\n  * Open Source\n  * How it works\n\n  * Terms\n  * Privacy\n  * Imprint\n  * Security\n\n  * Blog\n  * Docs\n  * About\n  * @depfu\n\n"
}