{
    "summary": "## Select your cookie preferences\n\nWe use essential cookies and similar tools that are necessary to provide our\nsite and services. We use performance cookies to collect anonymous statistics\nso we can understand how customers use our site and make improvements.\nEssential cookies cannot be deactivated, but you can click “Customize cookies”\nto decline performance cookies.  \n  \nIf you agree, AWS and approved third parties will also use cookies to provide\nuseful site features, remember your preferences, and display relevant content,\nincluding relevant advertising. To continue without accepting these cookies,\nclick “Continue without accepting.” To make more detailed choices or learn\nmore, click “Customize cookies.”\n\nAccept all cookiesContinue without acceptingCustomize cookies\n\n## Customize cookie preferences\n\nWe use cookies and similar tools (collectively, \"cookies\") for the following\npurposes.\n\n### Essential\n\nEssential cookies are necessary to provide our site and services and cannot be\ndeactivated. They are usually set in response to your actions on the site,\nsuch as setting your privacy preferences, signing in, or filling in forms.\n\n### Performance\n\nPerformance cookies provide anonymous statistics about how customers navigate\nour site so we can improve site experience and performance. Approved third\nparties may perform analytics on our behalf, but they cannot use the data for\ntheir own purposes.\n\nAllow performance category\n\nAllowed\n\n### Functional\n\nFunctional cookies help us provide useful site features, remember your\npreferences, and display relevant content. Approved third parties may set\nthese cookies to provide certain site features. If you do not allow these\ncookies, then some or all of these services may not function properly.\n\nAllow functional category\n\nAllowed\n\n### Advertising\n\nAdvertising cookies may be set through our site by us or our advertising\npartners and help us deliver relevant marketing content. If you do not allow\nthese cookies, you will experience less relevant advertising.\n\nAllow advertising category\n\nAllowed\n\nBlocking some types of cookies may impact your experience of our sites. You\nmay review and change your choices at any time by clicking Cookie preferences\nin the footer of this site. We and selected third-parties use cookies or\nsimilar technologies as specified in the AWS Cookie Notice.\n\nCancelSave preferences\n\n## Unable to save cookie preferences\n\nWe will only store essential cookies at this time, because we were unable to\nsave your cookie preferences.  \n  \nIf you want to change your cookie preferences, try again later using the link\nin the AWS console footer, or contact support if the problem persists.\n\nDismiss\n\nContact Us\n\nEnglish\n\nCreate an AWS Account\n\n  1. AWS\n\n  2. ...\n\n  3. Documentation\n\n  4. SAP on AWS Technical Documentation\n\n  5. SAP HANA Guides\n\nFeedback\n\nPreferences\n\n## SAP HANA on AWS\n\n### SAP HANA Guides\n\n  * Home\n  * AWS Backint Agent for SAP HANA\n\n    * Amazon S3\n\n      * Install and configure\n      * Backup and restore\n      * Uninstall\n\n    * AWS Backup\n    * Verify signature\n    * Troubleshoot\n    * Version history\n\n  * EBS snapshots for SAP HANA\n\n    * Considerations\n    * How to automate the creation of EBS snapshots for SAP HANA\n    * Restoring SAP HANA from EBS snapshots\n\n  * Migrating SAP HANA to AWS\n\n    * Migration frameworks\n    * Planning\n    * SAP HANA sizing\n    * Migration tools and methodologies\n    * Migration scenarios\n    * Migrating anyDB to SAP HANA on AWS\n    * Migrating SAP HANA to AWS\n    * Migrating SAP HANA to a High Memory instance\n    * Security\n    * Document history\n\n  * SAP HANA Environment Setup\n\n    * Prerequisites\n    * Plan the deployment\n    * Configure operating system\n\n      * SLES 12/15\n      * RHEL 7/8/9\n\n    * Configure storage\n\n      * Storage architecture\n\n        * Amazon EBS\n        * Amazon FSx for NetApp ONTAP\n\n      * Configure storage (EBS)\n\n        * Deploy workloads with Amazon EBS\n        * Configure Storage for SAP HANA\n\n      * Configure storage (FSx for ONTAP)\n\n        * Amazon EC2 instance type considerations\n        * Set up FSx for ONTAP file system\n        * Set up host\n\n          * SAP HANA scale-up\n          * SAP HANA scale-out\n\n      * Configure storage (EFS)\n\n    * Configure ENA Express\n    * Post deployment steps\n\n  * SAP HANA on AWS Operations Guide\n\n    * Introduction\n    * Administration\n    * Automated patching\n    * Storage configuration\n    * Networking\n    * SAP support access\n    * Security\n    * Architecture patterns for SAP HANA on AWS\n\n      * Single Region patterns\n      * Multi-Region patterns\n\n    * High availability and disaster recovery\n\n      * SAP HANA system replication\n      * Testing\n      * Troubleshoot\n\n    * Appendix: Configuring Linux to recognize Ethernet devices for multiple network interfaces\n    * Document history\n\n  * SAP HANA Data Tiering on AWS Overview\n\n    * Prerequisites\n    * SAP Data Tiering\n    * Warm Data Tiering Options\n    * Cold Data Tiering Options\n    * Document Revisions\n\n  * SAP on AWS High Availability with Overlay IP Address Routing\n\n    * Prerequisites\n    * SAP on AWS High Availability Setup\n    * Overlay IP Routing using AWS Transit Gateway\n\n      * Architecture\n      * Configuration Steps for AWS Transit Gateway\n\n    * Overlay IP Routing with Network Load Balancer\n\n      * Architecture\n      * Configuration Steps for Network Load Balancer\n      * Additional Implementation Notes\n\n    * Document Revisions\n\n  * SAP HANA on AWS: High Availability Configuration Guide for SLES and RHEL\n\n    * Automated deployment of SAP HANA on AWS with high availability\n    * Manual deployment of SAP HANA on AWS with high availability clusters\n\n      * AWS infrastructure, operating system setup and HANA installation\n      * Configuring the SAP HANA HA/DR provider hook\n\n        * Implementing the Python hook SAPHanaSR in RHEL\n        * Implementing Python hook SAPHanaSR in SLES\n\n      * Cluster configuration prerequisites\n\n        * Tagging the EC2 instances (required only for SLES)\n\n      * HA cluster configuration on SLES\n\n        * Cluster configuration\n        * Cluster resources\n\n          * STONITH\n          * Overlay IP resource\n          * SAPHanaTopology\n          * SAPHana\n          * Constraints\n          * Cluster status\n\n        * Testing the cluster\n\n          * Stop the SAP HANA database on the primary node\n          * Stop the SAP HANA database on the secondary node\n          * Crash the primary SAP HANA database on node 1\n          * Crash the primary database on node 2\n          * Reboot SAP HANA on node 1\n          * Reboot SAP HANA on node 2\n          * Simulating a cluster network failure\n\n        * Administration and troubleshooting\n\n          * Cluster administration\n          * Resource cleanup activities\n          * Checking the logs\n\n        * Sample working configuration\n\n      * HA cluster configuration on RHEL\n\n        * Cluster configuration\n        * Cluster resources\n\n          * SAPHanaTopology\n          * Constraints\n\n        * Testing the cluster\n\n          * Stop the SAP HANA database on the primary node\n          * Stop the SAP HANA database on the secondary node\n          * Crash the primary database on node 1\n          * Crash the primary database on node 2\n          * Reboot SAP HANA on node 1\n          * Reboot SAP HANA on node 2\n          * Simulating a cluster network failure\n\n        * Administration and troubleshooting\n\n          * Cluster administration\n          * Resource cleanup activities\n          * Checking the logs\n\n        * Sample working configuration\n\n      * High availability cluster and shared Amazon VPC\n\n        * Overlay IP with shared Amazon VPC\n        * High availability cluster setup\n\n    * Document history\n\nMigration Tools and Methodologies - SAP HANA on AWS\n\nAWSDocumentationSAP on AWS Technical DocumentationSAP HANA Guides\n\nAWS Launch WizardAWS Migration Hub OrchestratorAmazon S3 Transfer\nAccelerationAMIsAWS SnowballAmazon S3 Transfer AccelerationSAP HANA HSR with\ninitialization via backup and restoreMigration using DMO with System MoveSAP\nHANA classical migrationSAP Software SUM DMODMO Move to SAP S/4HANA on AWS\n(single step) – DMOVE2S4Backup/restore tools\n\n# Migration Tools and Methodologies\n\nPDF\n\nThis section provides an introduction to the tools and methodologies available\nto you for your SAP system migration.\n\n###### Topics\n\n  * AWS Launch Wizard for SAP\n  * AWS Migration Hub Orchestrator\n  * Amazon EC2 Instance Resize\n  * AMIs\n  * AWS Snowball\n  * Amazon S3 Transfer Acceleration\n  * SAP HANA HSR with Initialization via Backup and Restore\n  * Migration Using DMO with System Move\n  * SAP HANA Classical Migration\n  * SAP Software SUM DMO\n  * DMO Move to SAP S/4HANA on AWS (single step) – DMOVE2S4\n  * Backup/Restore Tools\n\n## AWS Launch Wizard for SAP\n\nAWS Launch Wizard for SAP is a service that guides you through the sizing,\nconfiguration, and deployment of SAP applications on AWS, and follows AWS\ncloud application best practices.\n\nAWS Launch Wizard reduces the time it takes to deploy SAP applications on AWS.\nYou input your application requirements, including SAP HANA settings, SAP\nlandscape settings, and deployment details on the service console, and Launch\nWizard identifies the appropriate AWS resources to deploy and run your SAP\napplication. Launch Wizard provides an estimated cost of deployment, which\nallows you to modify your resources and instantly view the updated cost. When\nyou finalize your settings, Launch Wizard provisions and configures the\nselected resources. It then optionally installs an SAP HANA database and\nsupported SAP applications using customer-provided software.\n\nAfter you deploy an SAP application, you can access it from the Amazon EC2\nconsole. You can manage your SAP applications with AWS SSM.\n\nFor more information, see AWS Launch Wizard for SAP.\n\n## AWS Migration Hub Orchestrator\n\nAWS Migration Hub Orchestrator simplifies and automates the migration of\nservers and enterprise applications to AWS. It provides a single location to\nrun and track your migrations.\n\nYou can migrate SAP HANA scale-up and scale-out systems to AWS cloud with AWS\nMigration Hub Orchestrator. Migration Hub Orchestrator offers templates to\ncreate a migration workflow that can be customized to fit your unique\nmigration requirements. For more information, see AWS Migration Hub\nOrchestrator?\n\nYou can access AWS Migration Hub Orchestrator from\nhttps://console.aws.amazon.com/migrationhub/orchestrator/ or from the AWS\nCommand Line Interface.\n\n## Amazon EC2 Instance Resize\n\nAmazon EC2 provides you with the ability to easily change your instance type\nin minutes, from the Amazon EC2 console, the AWS Command Line Interface (AWS\nCLI), or the Amazon EC2 API. You can start with an instance type that meets\nyour current needs and size your instance up or down, when your requirements\nchange. When you change your EC2 instance type, all instance metadata,\nincluding the IP address, instance ID, and hostname, remains the same. This\nenables you to migrate your SAP HANA to a new instance type seamlessly,\nwithout incurring a longer downtime. For details, see the Changing the\nInstance Type in the Amazon EC2 documentation.\n\n## AMIs\n\nYou can use an Amazon Machine Image (AMI) to launch any EC2 instance. You can\ncreate an AMI of an EC2 instance that hosts SAP HANA, including the attached\nEBS volumes, through the Amazon EC2 console, the AWS CLI, or the Amazon EC2\nAPI. You can then use the AMI to launch a new EC2 instance with SAP HANA in\nany Availability Zone within the AWS Region where the AMI was created. You can\nalso copy your AMI to another AWS Region and use it to launch a new instance.\nYou can use this feature to move your SAP HANA instance to another\nAvailability Zone or AWS Region, or to change the tenancy type of your EC2\ninstance. For example, you can create an AMI of your EC2 instance with default\ntenancy and use it to launch a new EC2 instance with host or dedicated tenancy\nand vice versa. For details, see the Amazon Machine Images (AMIs) in the\nAmazon EC2 documentation.\n\n## AWS Snowball\n\nWith AWS Snowball, you can copy large amounts of data from your on-premises\nenvironment to AWS, when it’s not practical or possible to copy the data over\nthe network. AWS Snowball is a storage appliance that is shipped to your data\ncenter. You plug it into your local network to copy large volumes of data at\nhigh speed. When your data has been copied to the appliance, you can ship it\nback to AWS, and your data will be copied to Amazon S3 based on the desired\ntarget storage destination that you specify. AWS Snowball is very useful when\nyou’re planning very large, multi-TB SAP system migrations. For more\ninformation, see _When should I consider using Snowball instead of the\nInternet_ in the AWS Snowball FAQ.\n\n## Amazon S3 Transfer Acceleration\n\nAmazon S3 Transfer Acceleration provides a faster way to copy data from your\non-premises environment to AWS by copying data first to Amazon CloudFront edge\nlocations that are closest to the source, and then using an optimized network\npath to copy data to Amazon S3. There is a network charge associated with this\ntype of transfer. You can run an AWS-provided test tool to compare the speed\nof Amazon S3 Transfer Acceleration to standard Amazon S3 data transfer. For\nSAP workloads, you can copy backups or DB logs at regular intervals over\nAmazon S3 Transfer Acceleration to reduce the transfer time, if your regular\nnetwork connection is slow—for example, if your SAP environment is hosted in a\nlocation that doesn’t have very strong internet connectivity. For more\ninformation, see the Amazon S3 documentation.\n\n## SAP HANA HSR with Initialization via Backup and Restore\n\nSAP supports the option of initializing the HSR target system with a backup\nand restore process. Using backup and restore can be useful if the network\nconnection between your source SAP HANA system and the target system does not\nhave enough bandwidth to replicate the data in a timely manner. Additionally,\nyou may not want the data replication to consume part of your network traffic\nbandwidth. For details, see SAP Note 1999880 – FAQ: SAP HANA System\nReplication.\n\n## Migration Using DMO with System Move\n\nSAP has enhanced the database migration option (DMO) of their Software Update\nManager (SUM) tool to accelerate the testing of SAP application migrations.\nDMO with System Move enables you to migrate your SAP system from your on-\npremises environment to AWS by using a DMO tool and a special export and\nimport process. You can use AWS services such as Amazon S3, Amazon EFS (over\nAWS Direct Connect), Storage Gateway file interface, and AWS Snowball to\ntransfer your SAP export files to AWS.\n\nYou can then use the AWS Launch Wizard for SAP to rapidly provision SAP HANA\ninstances and build your SAP application servers on AWS, when you are ready to\ntrigger the import process of the DMO tool.\n\nThe SUM DMO tool can convert data from _anyDB_ to SAP HANA or SAP ASE, with OS\nmigrations, release/enhancement pack upgrades, and Unicode conversions\noccurring at the same time. Results are written to flat files, which are\ntransferred to the target SAP HANA system on AWS. The second phase of DMO with\nSystem Move imports the flat files and builds the migrated SAP application\nwith the extracted data, code, and configuration. Here’s a conceptual flow of\nthe major steps involved:\n\n## SAP HANA Classical Migration\n\nSAP offers the SAP HANA classical migration option for migrating from other\ndatabase systems to SAP HANA. This option uses the SAP heterogeneous system\ncopy process and tools. To copy the exported files, you can use the options\ndescribed in the Backup/Restore Tools section later in this guide. For details\non the classical migration approach, see the classical migration overview on\nthe SAP website.\n\n## SAP Software SUM DMO\n\nSAP offers the standard SUM DMO approach as a one-step migration option from\nother database systems to HANA. This option uses the SAP DMO process and tool\nto automate multiple required migration steps. This is a preferred option if\nyou are already running SAP on _anyDB_ on AWS, as it will improve your\nmigration times to SAP HANA, since there is no need for data export/import at\na file system level. For details, see the DMO of SUM overview on the SAP\nwebsite.\n\n## DMO Move to SAP S/4HANA on AWS (single step) – DMOVE2S4\n\nUsing SAP Database Migration Option (DMO) feature DMOVE2S4, you can migrate\nSAP ECC on SAP HANA or any other database, such as Oracle, SQL or others\nhosted on-premises to AWS Cloud. It combines migration with conversion. With\nthis option, you can convert SAP ERP on SAP HANA to SAP S/4HANA while\nmigrating the system to SAP S/4HANA cloud, private edition on AWS Cloud.\n\nThe migration is performed over network, using memory pipe option. It\neliminates the requirement to import/export data over file system. You can\nfurther accelerate the migration by using one or both of the following\noptions.\n\n  * Use AWS Direct Connect to enable secure and fast data transfer over the network. For more information, see What is AWS Direct Connect?\n\n  * Use an Amazon EC2 instance with a high number of vCPUs as the SAP application server running the import. This increases the parallel processing rate of the database load and reduces the time taken for migration and conversion.\n\nOne of the biggest advantages of a heterogeneous migration is that you can use\nDMO features, downtime optimized techniques, such as downtime optimized DMO\n(doDMO) or downtime optimized conversion (DOC), that are not available when\nusing traditional DMO with system move option.\n\nFor more information, see the following SAP resources.\n\n  * SAP Note 3296427 - Database Migration Option (DMO) of SUM 2.0 SP17 (requires SAP portal access)\n\n  * SAP Documentation - DMO Move to SAP S/4HANA (on Hyperscaler)\n\n## Backup/Restore Tools\n\nBackup and restore options are tried-and-true mechanisms for saving data on a\nsource system and restoring it to another destination. AWS has various storage\noptions available to help facilitate data transfer to AWS. Some of those are\nexplained in this section. We recommend that you discuss which option would\nwork best for your specific workload with your systems integrator (SI) partner\nor with an AWS solutions architect.\n\n  * Storage Gateway: This is a virtual appliance installed in your on-premises data center that helps you replicate files, block storage, or tape libraries by integrating with AWS storage services such as Amazon S3 and by using standard protocols like Network File system (NFS) or Internet Small Computer System Interface (iSCSI). Storage Gateway offers file-based, volume-based, and tape-based storage solutions. For SAP systems, we will focus on file replication using a file gateway and block storage replication using a volume gateway. For scenarios where multiple backups or logs need to be continuously copied to AWS, you can copy these files to the locally mounted storage and they will be replicated to AWS.\n\n  * Amazon EFS file transfer: AWS provides options to copy data from an on-premises environment to AWS by using Amazon Elastic File System (Amazon EFS). Amazon EFS is a fully managed service, and you pay only for the storage that you use. You can mount an Amazon EFS file share on your on-premises server, as long as you have AWS Direct Connect set up between your corporate data center and AWS.\n\n**Javascript is disabled or is unavailable in your browser.**\n\nTo use the Amazon Web Services Documentation, Javascript must be enabled.\nPlease refer to your browser's Help pages for instructions.\n\nDocument Conventions\n\nSAP HANA sizing\n\nMigration scenarios\n\nDid this page help you? - Yes\n\nThanks for letting us know we're doing a good job!\n\nIf you've got a moment, please tell us what we did right so we can do more of\nit.\n\nDid this page help you? - No\n\nThanks for letting us know this page needs work. We're sorry we let you down.\n\nIf you've got a moment, please tell us how we can make the documentation\nbetter.\n\n#### Did this page help you?\n\nYes\n\nNo\n\nProvide feedback\n\n#### Next topic:\n\nMigration scenarios\n\n#### Previous topic:\n\nSAP HANA sizing\n\n#### Need help?\n\n  * Connect with an AWS IQ expert \n\nPrivacySite termsCookie preferences\n\n© 2024, Amazon Web Services, Inc. or its affiliates. All rights reserved.\n\n## On this page\n\n  * AWS Launch Wizard\n  * AWS Migration Hub Orchestrator\n  * Amazon S3 Transfer Acceleration\n  * AMIs\n  * AWS Snowball\n  * Amazon S3 Transfer Acceleration\n  * SAP HANA HSR with initialization via backup and restore\n  * Migration using DMO with System Move\n  * SAP HANA classical migration\n  * SAP Software SUM DMO\n  * DMO Move to SAP S/4HANA on AWS (single step) – DMOVE2S4\n  * Backup/restore tools\n\n",
    "links": "[{\"link\": \"https://docs.aws.amazon.com/forms/aws-doc-feedback?hidden_service_name=SAP&topic_url=https://docs.aws.amazon.com/sap/latest/sap-hana/migrating-hana-tools.html\", \"text\": \"\"}, {\"link\": \"https://docs.aws.amazon.com/pdfs/sap/latest/sap-hana/sap-hana.pdf#migrating-hana-tools\", \"text\": \"\"}, {\"link\": \"https://docs.aws.amazon.com/index.html\", \"text\": \"Documentation\"}, {\"link\": \"https://docs.aws.amazon.com/pdfs/sap/latest/sap-hana/sap-hana.pdf#migrating-hana-tools\", \"text\": \"PDF\"}, {\"link\": \"https://docs.aws.amazon.com/general/latest/gr/docconventions.html\", \"text\": \"Document Conventions\"}]"
}