{
    "summary": "__\n\n  * Solutions\n    * EDI as a Service\n    * E-invoicing and Peppol\n    * Deep ERP-EDI Integration\n    * EDI in SAP® Systems\n    * Routing and VAN Connectivity\n    * Web EDI\n__\n\n  * Products\n    * Introducing the ecosio.monitor\n    * Products WebEDI\n    * Products EDI\n    * Products Invoicing\n    * Products Integration\n    * Products Internal\n__\n\n  * Industries\n    * Automotive\n    * Engineering\n    * Retailers\n    * Retail Suppliers\n__\n\n  * The ecosio advantage\n  * Success Stories\n  * Partnerships\n    * Your B2B Integration Partner\n    * Your EDI Partner for SAP®\n    * Our Partners\n__\n\n  * Resources\n    * White Papers\n    * Webinars\n    * Infographics\n    * Blog\n    * Podcasts\n    * B2B Integration Life Cartoons\n    * Peppol and XML Document Validator\n    * EDI Glossary\n__\n\n  * About us\n    * Team\n    * Mission, Vision, Values\n    * Contact\n    * Employee Voices\n__\n\n  * Careers\n\n__\n\nBook a demo\n\ndeen\n\nYou are using a **outdated** browser. Please update your browser so that the\npage can be used.\n\n__ __\n\n  * Solutions & Products \n\nClose Solutions & Products Open Solutions & Products\n\n  * Industries \n\nClose Industries Open Industries\n\n  * The ecosio advantage \n\n  * Success Stories \n\n  * Partnerships \n\nClose Partnerships Open Partnerships\n\n  * Resources \n\nClose Resources Open Resources\n\n  * About us \n\nClose About us Open About us\n\n  * Careers \n\n#### Solutions\n\n  * EDI as a Service\n  * E-invoicing and Peppol\n  * Deep ERP-EDI Integration\n  * EDI in SAP® Systems\n  * Routing and VAN Connectivity\n  * Web EDI\n\n#### Products\n\n  * ecosio.monitor\n  * ecosio.webedi\n  * ecosio.edi\n  * ecosio.invoicing\n  * ecosio.integration\n  * ecosio.internal\n\n  * Automotive\n  * Engineering\n  * Retailers\n  * Retail Suppliers\n\n  * Your B2B Integration Partner\n  * Your EDI Partner for SAP®\n  * Our Partners\n\n  * White Papers\n  * Webinars\n  * Infographics\n  * Blog\n  * Podcasts\n  * B2B Integration Life Cartoons\n  * Peppol and XML Document Validator\n  * EDI Glossary\n\n  * Team\n  * Mission, Vision, Values\n  * Contact\n  * Employee Voices\n\nBook a demo\n\ndeen\n\n__ __\n\n  * Solutions & Products \n\nClose Solutions & Products Open Solutions & Products\n\n  * Industries \n\nClose Industries Open Industries\n\n  * The ecosio advantage \n\n  * Success Stories \n\n  * Partnerships \n\nClose Partnerships Open Partnerships\n\n  * Resources \n\nClose Resources Open Resources\n\n  * About us \n\nClose About us Open About us\n\n  * Careers \n\n#### Solutions\n\n  * EDI as a Service\n  * E-invoicing and Peppol\n  * Deep ERP-EDI Integration\n  * EDI in SAP® Systems\n  * Routing and VAN Connectivity\n  * Web EDI\n\n#### Products\n\n  * ecosio.monitor\n  * ecosio.webedi\n  * ecosio.edi\n  * ecosio.invoicing\n  * ecosio.integration\n  * ecosio.internal\n\n  * Automotive\n  * Engineering\n  * Retailers\n  * Retail Suppliers\n\n  * Your B2B Integration Partner\n  * Your EDI Partner for SAP®\n  * Our Partners\n\n  * White Papers\n  * Webinars\n  * Infographics\n  * Blog\n  * Podcasts\n  * B2B Integration Life Cartoons\n  * Peppol and XML Document Validator\n  * EDI Glossary\n\n  * Team\n  * Mission, Vision, Values\n  * Contact\n  * Employee Voices\n\nBook a demo\n\ndeen\n\nBook a demo\n\n__ Menu\n\nBook a demo\n\n__ Menu\n\n__\n\n  * Solutions\n    * EDI as a Service\n    * E-invoicing and Peppol\n    * Deep ERP-EDI Integration\n    * EDI in SAP® Systems\n    * Routing and VAN Connectivity\n    * Web EDI\n  * Products\n    * Introducing the ecosio.monitor\n    * Products WebEDI\n    * Products EDI\n    * Products Invoicing\n    * Products Integration\n    * Products Internal\n  * Industries\n    * Automotive\n    * Engineering\n    * Retailers\n    * Retail Suppliers\n  * The ecosio advantage\n  * Success Stories\n  * Partnerships\n    * Your B2B Integration Partner\n    * Your EDI Partner for SAP®\n    * Our Partners\n  * Resources\n    * White Papers\n    * Webinars\n    * Infographics\n    * Blog\n    * Podcasts\n    * B2B Integration Life Cartoons\n    * Peppol and XML Document Validator\n    * EDI Glossary\n  * About us\n    * Team\n    * Mission, Vision, Values\n    * Contact\n    * Employee Voices\n  * Careers\n\n__\n\nBook a demo\n\ndeen\n\n11 minute read\n\n# Migration to SAP S/4HANA - 5 Key Considerations\n\nTable of Contents\n\nContents\n\n  * 1 – What iteration of S/4HANA is a good fit for your organisation? \n  * 2 – “When should I start the migration process?”\n  * 3 – Have you archived legacy data in preparation for migration to SAP S/4HANA?\n  * 4 – Should I move to a cloud-based EDI approach or will older EDI systems still be compatible? \n  * 5 – Which cloud-based EDI approach shall I choose? \n  * Summary\n  * Find out more\n\nWill\n\nFollow the author\n\nLast Update: 25.5.2023\n\nWhile 2025 may signal many things to different people, for those working in IT\nfor supply chain organisations currently using SAP systems, it is synonymous\nwith one key deadline. 2025 is, of course, the deadline set by SAP for\nbusinesses to migrate to their new and improved system S/4HANA, after which\nsupposedly they will no longer provide support for older systems. Whilst this\nmay seem a generous deadline, as we shall explore in this article,\ntransitioning to S/4HANA is by no means a simple process. In addition to the\ntime-consuming exercise of migration itself, for those considering the move to\nS/4HANA the next few years offers a unique opportunity to refresh and update\nother key business processes, such as electronic data interchange (EDI), to\nensure their businesses are in the best possible position when 2025 comes\naround.\n\nIn this article we’ll look at five key questions that anyone who is likely to\nbe involved in coordinating a migration to S/4HANA should consider before\nproceeding.\n\n## **1 – What iteration of S/4HANA is a good fit for your organisation?**\n\nUndoubtedly S/4HANA represents an exciting advance in ERP software and comes\nwith considerable advantages. Key benefits include:\n\n  * **Simplicity – The SAP Business Suite data model has been hugely simplified following the impact of the SAP HANA in-memory platform. Specifically, SAP has been able to remove (or reduce the number of) several table types from the data model. As a result, in addition to a significant reduction in your database’s memory footprint, your new system should also run faster.**\n  * **Ease of Use – Thanks largely to the above simplification, S/4HANA users also benefit from an improved user experience. S/4HANA makes heavy use of SAP’s new and improved user interface based on SAP Fiori apps.   \n**\n\n  * **Future-proof solution –** Another key benefit of transitioning to S/4HANA is the improved approach towards updates. Whereas previously new functionalities had to be manually switched on by in-house teams, with the S/4HANA cloud systems, updates will be implemented quarterly, removing the possibility of updates being delayed due to lack of in-house resources.  \n\nThere are four basic options for businesses considering migration to SAP\nS/4HANA: self-hosted and on-premise, hosted by a hosting partner, private\nmanaged cloud and cloud ERP.  The following Figure gives an overview of the\ndifferent options.\n\n  \n  \nMigration to SAP S/4HANA – SAP Provisioning Platforms  \n\nThe Cloud ERP solution is available in two different versions. The single\ntenant solution is hosted by SAP for a single tenant (= company), also\nallowing for company-specific code and system extensions. The SAP S/4HANA\nCloud is a classic cloud-based software solution, where multiple different\ncompanies share the same SAP instance. The multi-tenant solution allows for\nless company-specific customisations than the Single Tenant Cloud edition. If\na company seeks to implement custom adaptations or extensions to third party\nsoftware solutions for the multi-tenant edition, they can be achieved through\nthe SAP Cloud Platform.\n\nIt is important to remember, however, that every business is different and the\nmost effective system for your company is unlikely to be any of the above\n‘out-of-the-box’ solutions. Increasingly forward facing businesses are\ntransitioning to so-called ‘postmodern’ ERP systems (those in which more\nsuitable or tailored system packages from independent providers are integrated\nwith standard ERP elements) in order to achieve the most efficient solution\nfor them. Whilst postmodern ERP arrangements can prove complicated to set up\nand integration can, if handled poorly, jeopardise data integrity, intelligent\nintegration of solutions better suited to your business’s needs (such as\nmanaged EDI) will produce a flexible and future-proof ERP environment.\n\nRegardless of what system you are currently using or what version of S/4HANA\nyou are looking to move to, the switch to S/4HANA is less of an upgrade and\nmore of a full ERP implementation project. As migration is likely to be\nextremely heavy on in-house time and resources, it makes sense to consider\nwhat an optimum ERP landscape would look like for your business in advance of\nprogressing with implementation. After all, if you are going to invest a huge\namount of effort into the transition to S/4HANA, you may as well aim to finish\nwith a system as closely tailored to your organisation’s needs as possible!\n\n## **2 – “When should I start the migration process?”**\n\nAccording to SAP, moving from traditional SAP systems to SAP S/4HANA should\ntake between 12 and 18 months. However, according to research from Gartner,\ncompanies that have already started the process have reported that migration\nto SAP S/4HANA can take far longer, with key steps potentially taking as long\nas the entire migration reportedly should.\n\n_“Migration” vastly underestimates the level and scope of transformation\ninvolved in adopting SAP S/4HANA. This is not a straightforward movement of\nyour existing data and processes from one location to another. It’s more like\nyou’re trying to relocate from the house you’ve lived in for the past 20 years\nto a more modern city apartment._\n\n**Wolfgang Platz – Founder & Chief Strategy Officer, Tricentis**\n\nWith the above in mind, assuming you have identified the best ERP solution for\nyou moving forward, it makes sense to start the migration process as early as\npossible. In addition to ensuring you have enough time to complete the\ntransition to S/4HANA, starting the process earlier may save your business\nmoney, as implementation costs are likely to rise as the 2025 deadline\napproaches.\n\n## **3 – Have you archived legacy data in preparation for migration to SAP\nS/4HANA?**\n\nGiven the size of the task facing in-house IT teams, identifying effective\nmethods of speeding up the migration process may prove crucial. With this in\nmind, perhaps the most worthwhile preparatory step a business can take in\nadvance of transitioning is to archive legacy ERP custom code. Studies have\nshown that the majority of ABAP code is customer-specific code, a large\nproportion of which generally remains unused after being created. Migration to\nSAP S/4HANA offers a good opportunity to give your ERP system a spring clean.\nBy completing this exercise in advance of migration you will benefit from a\nreduced migration volume and thus reduced financial and time costs. It really\nis a win-win!\n\n## **4 – Should I move to a cloud-based EDI approach or will older EDI systems\nstill be compatible?  **\n\nWith such a large-scale transition involving changing the source of EDI data\n(i.e. your ERP system) there will always be risks. Given the scope of the work\ninvolved in migration to SAP S/4HANA your EDI solution will inevitably be\naffected at some stage during the process. With this in mind it makes sense to\nuse this as an opportunity to transition to a future-proof EDI solution.\nMoreover, thanks to the modern features of S/4HANA some older EDI solutions\nmay simply not be compatible.\n\nAs explored in detail in our white paper in which we compare the benefits of\non-premise and cloud-based EDI solutions, cloud-based EDI offers numerous\nadvantages, such as flexibility, scalability and predictable pricing.\n\nSignificantly, while (as illustrated in the above diagram) the SAP S/4HANA\nmulti-tenant cloud option offers only limited customisation, it is still\npossible for users with this system to integrate an external EDI solution into\ntheir ERP landscape. This means all users of S/4HANA have the opportunity to\nbenefit from more efficient EDI in addition to the new features of S/4HANA,\nregardless of what system they opt for.\n\n## **5 – Which cloud-based EDI approach shall I choose?  **\n\nThanks to the number of cloud-based EDI providers out there, selecting the\nright EDI partner can be a complicated process unless you know what to look\nfor. Yet, much like deciding to upgrade your ERP to S/4HANA, selecting the\nright EDI solution for your business constitutes an important step towards\nfuture-proofing your organisation.\n\nOn the face of it, the most obvious candidate for a cloud-based EDI platform\nfor businesses looking to move to S/4HANA is the SAP Cloud Platform\nIntegration (or SAP Cloud PI for short). However, significantly SAP Cloud PI\nis an entirely unmanaged solution, meaning that everything is dependent on\nyour in-house resources. Whilst this could potentially be a viable solution\nfor businesses that have a wealth of in-house EDI expertise, for companies\nlooking to optimise business data processes and streamline in-house resources\na managed, cloud-based EDI solution represents a far more attractive option.\n\nAs we’ve already touched on, one of the common criticisms levelled at\npostmodern ERP setups is that the improved flexibility they offer comes at the\nprice of additional complexity. However, when it comes to implementing a\nmanaged EDI solution with S/4HANA, whether your business opts for on-premise,\nprivate cloud or multi-tenant cloud, the end result will be a significant\nreduction in user complexity and required internal effort.\n\nWhen considering potential managed EDI providers, make sure to consider the\nfollowing:  \n\n  * **Are they compliant with SAP Cloud PI?** – If you opt for either S/4HANA’s private cloud or multi-tenant cloud system, you will need to select an EDI provider (such as ecosio) that is compliant with SAP Cloud PI and can connect to your new ERP system. Unlike on-premise S/4HANA systems, where EDI connections can be set up via any channel (API, EPO Connector, SAP PI/PO, Business Connector, Local Converter etc.), with cloud-based S/4HANA systems, EDI integration must happen via SAP Cloud PI.  \n  \nFor businesses running both on-premise and cloud systems, SAP Cloud PI can be\nused as a gateway to connect all systems to the EDI provider.\n\n  * **Do they offer 24/7 monitoring?** – Undoubtedly the biggest benefit of choosing a managed EDI service is that it should relieve you of the responsibility of monitoring incoming and outgoing data. Choosing a provider that offers effective, round-the-clock monitoring will mean you will no longer have to check that messages have been sent and received, that certificates have been renewed, or that the correct e-invoicing protocols are being followed.\n  * **How comprehensive is their support?** – Unfortunately, the level of support offered by EDI solution providers often leaves a lot to be desired. Asking about the specifics surrounding the support you can expect may help you avoid frustrating and potentially costly situations when you experience issues further down the line.\n  * **How simple is partner onboarding?** – The key here is to select a provider who will manage the onboarding process from start to finish. With a dedicated project manager partner onboarding becomes a simple and streamlined process. Choosing a provider who offers Web EDI is also essential if you want to connect to partners that don’t have EDI systems.\n  * **Do they implement ongoing updates?** – It makes sense that in order to future-proof your business you should select an EDI provider that is committed to implementing ongoing updates. For example, not every managed EDI provider provides access to Peppol, which can be disastrous when it comes to e-invoicing.\n  * **Do they have “price cliffs”?** – Again the key here is to think of your future needs as well as your current requirements. Many contracts include steep price rises (or “price cliffs”) if your EDI usage passes a certain point which can prove very costly.\n\n## **Summary**\n\nIn short, while 2025 may seem a long way off still, as we have covered, the\njourney to S/4HANA is a long one, and should ideally not be started without\nthe necessary research and provisions. Given the scale of the task facing\nteams responsible for coordinating a migration to S/4HANA, it makes sense for\ndecision-makers to use this time to consider what their ideal ERP would look\nlike and upgrade or outsource other processes as necessary. Hopefully those\nwho consider the above questions and make the effort to identify and implement\nthe best solutions for them will ensure that 2025 starts to look less like a\ndark cloud on the horizon and more like the dawn of a new, more efficient era\nfor their business.\n\n## **Find out more**\n\nFor more information about ecosio’s managed B2B integration solution and how\nit could help your business.\n\nAlternatively, if you have questions about EDI and S/4HANA please contact us\nor use our chat – we are happy to help!\n\n\n\n_SAP ERP and SAP S/4HANA are the trademarks or registered trademarks of SAP SE\nor its affiliates in Germany and in several other countries._\n\nSubjects\n\n__\n\n__\n\nslide 5 to 8 of 3\n\nSAP S/4HANA\n\nEDI Migration\n\nSAP ERP\n\nSAP S/4HANA\n\nEDI Migration\n\nSAP ERP\n\nSAP S/4HANA\n\nEDI Migration\n\nSAP ERP\n\nSAP S/4HANA\n\nEDI Migration\n\nStay up to date with the latest news on EDI, B2B integration and e-invoicing\nFollow us on LinkedIn\n\nBack to overview __\n\nRessourcen\n\nWhite Paper\n\nEDI Integration in SAP - A Definitive Guide\n\nDownload Now __\n\nWebinar\n\nWhy EDI is an Essential Part of Your Next SAP S/4HANA® Project\n\nView Webinar __\n\nmost read\n\nKeep on reading\n\n__ __\n\n4 minute read\n\nIDoc Status Change in SAP ERP\n\nIDoc statuses are not always the clearest - particularly when errors occur. In\nthis article we explain how to change IDoc status as required.\n\nread article __\n\n5 minute read\n\nHow Can I Add an Entry to an SAP Table?\n\nIn this article we show how to add entries to an existing SAP table - even if\nit does not have its own maintenance dialog.\n\nread article __\n\n5 minute read\n\nAlternatives to the Seeburger PI Adapter\n\nThe end of maintenance for the Seeburger PI Adapter is imminent. What\nalternatives are there and which is the best suited for your business?\n\nread article __\n\n4 minute read\n\nIDocs in SAP S/4HANA: The Differences to SAP ECC 6.0\n\nThe change to S/4HANA also impacts the format of IDocs. In this article we\nexplore IDocs in S/4HANA and the new and changed elements.\n\nread article __\n\n2 minute read\n\nHow to End Another User's SAP Session\n\nUnable to edit a crucial document in SAP® because you're locked out? Learning\nhow to end another user's SAP session will solve this issue.\n\nread article __\n\n3 minute read\n\nFinding Translations for SAP® Terminology\n\nUsing the correct translations for SAP® terminology is important in\ninternational projects. Discover how to find these quickly.\n\nread article __\n\n2 minute read\n\nHow to Save an IDoc Parser Report to a Local File\n\nIn this short and simple guide we show you how to save an IDoc parser report\nto a local file in just a couple of easy steps.\n\nread article __\n\n6 minute read\n\nHow to Debug SAP Message ME161 - \"The Notified Quantity Exceeds the Ordered\nQuantity\"\n\nDon't know how to fix SAP error message ME161 \"The notified quantity exceeds\nthe ordered quantity\"? In this article we break it down.\n\nread article __\n\n6 minute read\n\nSAP® EDI Project Roles - A Breakdown\n\nLearn the various EDI project roles involved in achieving successful EDI\nintegration in SAP systems and how the different roles interact.\n\nread article __\n\n3 minute read\n\nHow to create an SAP transaction code\n\nWant to know how to create an SAP transaction code for an existing ABAP\nprogram so that you can easily call the program?\n\nread article __\n\n9 minute read\n\nAlternative Solutions for EDI Data Exchange with SAP PI and SAP PO\n\nDiscover the three possibilities when it comes to implementation of electronic\ndata interchange (EDI) in SAP Process Integration or SAP Process Orchestration\n(SAP PI/PO).\n\nread article __\n\n6 minute read\n\nHow to Set Up and Manage Automatic SAP Jobs\n\nSAP jobs can be used to automate processes in SAP ERP so they can be carried\nout without user intervention. We explore the key features.\n\nread article __\n\n4 minute read\n\nIDoc Status Change in SAP ERP\n\nIDoc statuses are not always the clearest - particularly when errors occur. In\nthis article we explain how to change IDoc status as required.\n\nread article __\n\n5 minute read\n\nHow Can I Add an Entry to an SAP Table?\n\nIn this article we show how to add entries to an existing SAP table - even if\nit does not have its own maintenance dialog.\n\nread article __\n\n5 minute read\n\nAlternatives to the Seeburger PI Adapter\n\nThe end of maintenance for the Seeburger PI Adapter is imminent. What\nalternatives are there and which is the best suited for your business?\n\nread article __\n\n4 minute read\n\nIDocs in SAP S/4HANA: The Differences to SAP ECC 6.0\n\nThe change to S/4HANA also impacts the format of IDocs. In this article we\nexplore IDocs in S/4HANA and the new and changed elements.\n\nread article __\n\n2 minute read\n\nHow to End Another User's SAP Session\n\nUnable to edit a crucial document in SAP® because you're locked out? Learning\nhow to end another user's SAP session will solve this issue.\n\nread article __\n\n3 minute read\n\nFinding Translations for SAP® Terminology\n\nUsing the correct translations for SAP® terminology is important in\ninternational projects. Discover how to find these quickly.\n\nread article __\n\n2 minute read\n\nHow to Save an IDoc Parser Report to a Local File\n\nIn this short and simple guide we show you how to save an IDoc parser report\nto a local file in just a couple of easy steps.\n\nread article __\n\n6 minute read\n\nHow to Debug SAP Message ME161 - \"The Notified Quantity Exceeds the Ordered\nQuantity\"\n\nDon't know how to fix SAP error message ME161 \"The notified quantity exceeds\nthe ordered quantity\"? In this article we break it down.\n\nread article __\n\n6 minute read\n\nSAP® EDI Project Roles - A Breakdown\n\nLearn the various EDI project roles involved in achieving successful EDI\nintegration in SAP systems and how the different roles interact.\n\nread article __\n\n3 minute read\n\nHow to create an SAP transaction code\n\nWant to know how to create an SAP transaction code for an existing ABAP\nprogram so that you can easily call the program?\n\nread article __\n\n9 minute read\n\nAlternative Solutions for EDI Data Exchange with SAP PI and SAP PO\n\nDiscover the three possibilities when it comes to implementation of electronic\ndata interchange (EDI) in SAP Process Integration or SAP Process Orchestration\n(SAP PI/PO).\n\nread article __\n\n6 minute read\n\nHow to Set Up and Manage Automatic SAP Jobs\n\nSAP jobs can be used to automate processes in SAP ERP so they can be carried\nout without user intervention. We explore the key features.\n\nread article __\n\n4 minute read\n\nIDoc Status Change in SAP ERP\n\nIDoc statuses are not always the clearest - particularly when errors occur. In\nthis article we explain how to change IDoc status as required.\n\nread article __\n\n5 minute read\n\nHow Can I Add an Entry to an SAP Table?\n\nIn this article we show how to add entries to an existing SAP table - even if\nit does not have its own maintenance dialog.\n\nread article __\n\n5 minute read\n\nAlternatives to the Seeburger PI Adapter\n\nThe end of maintenance for the Seeburger PI Adapter is imminent. What\nalternatives are there and which is the best suited for your business?\n\nread article __\n\n4 minute read\n\nIDocs in SAP S/4HANA: The Differences to SAP ECC 6.0\n\nThe change to S/4HANA also impacts the format of IDocs. In this article we\nexplore IDocs in S/4HANA and the new and changed elements.\n\nread article __\n\n+44 20 3369 5760\n\nLONDON\n\n+43 1 996 2106 100\n\nVIENNA\n\n+39 02 82942127\n\nMILAN\n\nedi@ecosio.com\n\nEMAIL\n\n  * Contact\n  * Imprint\n  * Data protection\n\nWe use cookies to provide an optimal website experience. You decide which one\nyou want to allow. Depending on the setting, however, not all functionalities\nmay be available to you. Data protection & imprint.\n\nSelect all Confirm Selection Decline all\n\n  * Essential Cookies Details\n\nThese cookies are vital for the functionality of the website\n\n    * Wordpress\n\nCookies that are set in connection with the system of the website.\n\n  * Statistics Details\n\nThese cookies are used to generate statistics and enable us to optimise the\nwebsite for visitors.\n\n    * Google Analytics\n\nUsed to send data to Google Analytics about the visitor's device and\nbehaviour. Tracks the visitor across devices and marketing channels.\n\n  * Marketing Details\n\nThese cookies are used to ensure that any adverts visible are relevant to your\ninterests.\n\n    * Google Adwords\n\n    * Pardot\n\n    * Facebook\n\n    * LinkedIn\n\n    * Livechat\n\n    * Outbrain\n\n",
    "links": "[{\"link\": \"https://ecosio.com/en/contact\", \"text\": \"\"}, {\"link\": \"https://ecosio.com/en/blog/migration-to-sap-s4hana-5-key-considerations/\", \"text\": \"en\"}, {\"link\": \"https://ecosio.com/en/contact\", \"text\": \"\"}, {\"link\": \"https://ecosio.com/en/blog/migration-to-sap-s4hana-5-key-considerations/\", \"text\": \"en\"}, {\"link\": \"https://ecosio.com/en/contact\", \"text\": \"\"}, {\"link\": \"https://ecosio.com/en/blog/migration-to-sap-s4hana-5-key-considerations/\", \"text\": \"en\"}, {\"link\": \"https://ecosio.com/en/contact\", \"text\": \"\"}, {\"link\": \"https://ecosio.com/en/contact\", \"text\": \"\"}, {\"link\": \"https://ecosio.com/en/contact\", \"text\": \"\"}, {\"link\": \"https://ecosio.com/en/blog/migration-to-sap-s4hana-5-key-considerations/\", \"text\": \"en\"}]"
}