{
    "summary": "  * Products \n    * Application Access Governance \n      * Access Risk Analysis \n      * Compliant Provisioning \n      * Access Certification \n      * Elevated Access Management \n      * Role Management \n    * Continuous Controls Monitoring \n      * Risk Quantification and Transaction Monitoring \n      * Configuration Change Monitoring \n      * Business Process Control Management \n      * Manual Process Control Management \n    * Cybersecurity Application Controls \n      * Dynamic Data Masking \n      * Vulnerability Scanning \n      * Threat Detection \n      * Transport Control \n      * Session Logging and DLP \n  * Solutions \n    * Initiative \n      * ERP and Cloud Migrations \n      * Audit Readiness \n      * Finance Transformation \n      * Cross Application SOD \n      * Continuous Compliance \n      * SAP Data Security \n      * Mergers and Acquisitions Integration \n      * User Access Reviews \n    * Role \n      * Application Owner \n      * Internal Audit \n      * Finance Leaders \n      * CISO and IT Security \n    * Applications \n      * SAP ERP \n      * PeopleSoft \n      * Oracle EBS \n      * Oracle Fusion Cloud \n      * SAP Ariba \n      * PeopleSoft Campus Solutions \n      * Workday \n      * Coupa \n      * JD Edwards \n      * SAP SuccessFactors \n      * Microsoft Dynamics 365 \n      * SAP Access Control \n      * Microsoft Entra ID Governance \n    * Regulatory \n      * Data Security Regulations \n      * Financial Regulations \n  * Resources \n    * Resources \n      * Learning \n      * Blog \n      * Events \n      * Integrations \n      * Case Studies \n      * Innovation Series \n    * Marketing Resources \n      * Analyst Reports \n      * On-Demand Webinar \n      * Solution Briefs \n      * Data Sheet \n      * E-book \n    * Featured resources\n\nBlog\n\nPathlock CEO Piyush Pandey on Reshaping Application Access Governance:\nInsights from KuppingerCole Reports\n\nThe IT industry is currently exp...\n\nBlog\n\nPathlock Reshapes the Access Governance Market with a Series of Strategic\nMergers\n\n...\n\n  * Company \n    * About Pathlock\n\nHelping the world’s largest enterprises and organizations secure their data\nfrom the inside out\n\n    * Our Partners\n\nPartnering with success with the world's leading solution providers\n\n    * Careers\n\nJoin us on our mission\n\n    * Featured Resources\n\nBlog\n\nPathlock CEO Piyush Pandey on Reshaping Application Access Governance:\nInsights from KuppingerCole Reports\n\nThe IT industry is currently exp...\n\nBlog\n\nStreamlining SOX Compliance and 404 Audits with Continuous Controls Monitoring\n(CCM)\n\nFor many publicly trad...\n\n  * Contact \n  * Innovation Series \n  *     *     * \nRequest A demo\n\n  * Products \n    * Application Access Governance \n      * Access Risk Analysis \n      * Compliant Provisioning \n      * Access Certification \n      * Elevated Access Management \n      * Role Management \n    * Continuous Controls Monitoring \n      * Risk Quantification and Transaction Monitoring \n      * Configuration Change Monitoring \n      * Business Process Control Management \n      * Manual Process Control Management \n    * Cybersecurity Application Controls \n      * Dynamic Data Masking \n      * Vulnerability Scanning \n      * Threat Detection \n      * Transport Control \n      * Session Logging and DLP \n  * Solutions \n    * Initiative \n      * ERP and Cloud Migrations \n      * Audit Readiness \n      * Finance Transformation \n      * Cross Application SOD \n      * Continuous Compliance \n      * SAP Data Security \n      * Mergers and Acquisitions Integration \n      * User Access Reviews \n    * Role \n      * Application Owner \n      * Internal Audit \n      * Finance Leaders \n      * CISO and IT Security \n    * Applications \n      * SAP ERP \n      * PeopleSoft \n      * Oracle EBS \n      * Oracle Fusion Cloud \n      * SAP Ariba \n      * PeopleSoft Campus Solutions \n      * Workday \n      * Coupa \n      * JD Edwards \n      * SAP SuccessFactors \n      * Microsoft Dynamics 365 \n      * SAP Access Control \n      * Microsoft Entra ID Governance \n    * Regulatory \n      * Data Security Regulations \n      * Financial Regulations \n  * Resources \n    * Resources \n      * Learning \n      * Blog \n      * Events \n      * Integrations \n      * Case Studies \n      * Innovation Series \n    * Marketing Resources \n      * Analyst Reports \n      * On-Demand Webinar \n      * Solution Briefs \n      * Data Sheet \n      * E-book \n    * Featured resources\n\nBlog\n\nPathlock CEO Piyush Pandey on Reshaping Application Access Governance:\nInsights from KuppingerCole Reports\n\nThe IT industry is currently exp...\n\nBlog\n\nPathlock Reshapes the Access Governance Market with a Series of Strategic\nMergers\n\n...\n\n  * Company \n    * About Pathlock\n\nHelping the world’s largest enterprises and organizations secure their data\nfrom the inside out\n\n    * Our Partners\n\nPartnering with success with the world's leading solution providers\n\n    * Careers\n\nJoin us on our mission\n\n    * Featured Resources\n\nBlog\n\nPathlock CEO Piyush Pandey on Reshaping Application Access Governance:\nInsights from KuppingerCole Reports\n\nThe IT industry is currently exp...\n\nBlog\n\nStreamlining SOX Compliance and 404 Audits with Continuous Controls Monitoring\n(CCM)\n\nFor many publicly trad...\n\n  * Contact \n  * Innovation Series \n  *     *     * \n\n  *   *   * \n\n# SAP S/4HANA Migration: Everything You Need to Know\n\nMike Puterbaugh - July 20, 2023\n\nSAP’s announcement in 2018 mandated enterprises using SAP ERP to migrate to\nS/4HANA by 2025, a deadline that has been revised due to slow adoption and\nlimited SAP consultants. Currently, around 35,000 companies are either using\nor implementing SAP S/4HANA, making it a top discussion among CIOs, IT\nleaders, and CFOs. While the shift from SAP ECC to S/4HANA is inevitable for\nmany due to end-of-life support on ECC, it’s crucial not to approach the\nmigration blindly.\n\nThe process of migrating systems, whether to S/4HANA or other platforms like\nOracle Fusion or Workday, presents numerous challenges and risks to business\noperations and value realization, even with SAP’s new offering SAP RISE.\nAdditionally, SAP plans to end support for legacy ERP applications on SAP\nNetWeaver by 2027, promoting the adoption of SAP HANA and SAP S/4HANA while\ndiscontinuing support for other databases.\n\n## **Why Migrate to S/4HANA?**\n\nMigrating to SAP S/4HANA offers many advantages for organizations, including\nenhanced real-time analytics, quicker financial closings, access to cutting-\nedge technologies like AI and process automation, and more manageable business\nmodel updates. Deciding to move to SAP S/4HANA is fundamentally about aligning\nwith a company’s strategic goals and maintaining a competitive edge.\n\nBefore creating a business case, thorough research into the challenges of the\ncurrent SAP ECC system is crucial for SAP Architects or enterprise architects.\nThis step enables a comprehensive assessment of the benefits SAP S/4HANA can\nbring to the business, allowing them to effectively communicate the\ntransformation’s advantages and return on investment to management. Some of\nthese benefits include:\n\n**Faster and More Powerful Database** : This is primarily due to adopting SAP\nHANA. This in-memory database accelerates queries and enables powerful\nanalytics using massive external and internal data pools. The common thread\nthrough many of these advantages is the increased speed compared to\ntraditional ERP systems based on conventional databases.\n\n**Better Integration** : Another set of benefits derives from the multi-\ntenancy of SAP S/4HANA Cloud. It has a software-as-a-service (SaaS), enabling\ndeep integration with various cloud-based technologies like SAP Business\nNetwork. Other S/4HANA cloud deployments can also access these services.\n\n**Enables Business Transformation** : S/4HANA supports faster financial\nclosings and real-time data analytics. It provides access to new technologies\nsuch as IoT, AI, and chatbots. It allows organizations to automate business\nprocesses, facilitating the creation of flexible business models, which are\neasier to update, and offers automatic quarterly updates. Finally, S/4HANA has\na simpler user interface than previous SAP ERP systems.\n\n## **When Should You Start the S/4HANA Migration Process?**\n\nSAP suggests that the migration process from a traditional SAP environment to\na S/4HANA system generally takes between a year and a year and a half.\nHowever, many organizations take much longer to transition to SAP S/4HANA\nfully. In some cases, complex migration steps can take as long as the expected\ntimeframe for the whole migration project.\n\nWith the unpredictability of the migration journey, it is advisable to begin\nmigrating to the appropriate ERP solution as soon as possible. Starting the\nmigration process early helps ensure the organization has more time to\nimplement the transition and save money. Some observers believe that SAP will\nincrease S/4HANA implementation costs by the 2027 deadline, so completing the\nprocess earlier may allow businesses to avoid higher fees.\n\n## **Common S4/HANA Migration Approaches**\n\nThe suitability of S/4HANA migration strategies varies for each organization,\nand there is no one-size-fits-all approach. Some opt for a greenfield project,\nwhich basically means from scratch, while others prefer a brownfield project\ninvolving a complete system conversion to avoid disrupting existing business\nprocesses. Additionally, the hybrid approach is suited for those seeking to\nconsolidate their current system landscape into SAP S/4HANA, combining the\nstrengths of both greenfield and brownfield implementations. This strategy\nproves most effective for large enterprises dealing with extensive data and\ncomplex systems. Here are three approaches for SAP ECC migrations to S/4HANA:\n\n### **Greenfield Approach**\n\nThe greenfield approach or re-implementation approach enables organizations to\nredesign undesirable processes according to the latest S/4HANA innovations. It\nis ideal for organizations that need a new implementation of SAP S/4HANA and\ncan use their existing ECC system as a legacy.\n\nHowever, the significant changes brought about by adopting the greenfield\napproach may be unsettling for some. The re-implementation process can be both\narduous and time-consuming, particularly when managing change effectively.\nTherefore, it is essential to be fully prepared for a rigorous and\ncomprehensive re-engineering process before embarking on the greenfield path.\n\n### **Brownfield Approach**\n\nThe brownfield approach, or upgrade approach, is a database migration and\napplication conversion. It is ideal for organizations using legacy systems,\nsuch as SAP R/3 or ECC, and are satisfied with existing data management and\nbusiness processes but require quicker adoption and innovation.\n\nThis approach enables migration from SAP ECC to S/4HANA by converting an\nexisting SAP environment without reimplementing or disrupting current business\nprocesses. While a Brownfield project carries the risk of potential technical\nissues during and after the conversion, SAP offers dedicated conversion tools\nand guidelines designed to proactively address and minimize such problems from\nthe outset.\n\n### **Hybrid Approach or Selective Data Transition**\n\nSelective data transition is a technical migration performed at the table\nlevel. It involves using preconfigured transformation rules to extract\nspecific master and transactional datasets.\n\nThis approach enables organizations to define new configuration settings to\nimprove business processes. For example, applying selective data migration to\nS/4HANA by setting various organizational elements, such as legal entities. It\nalso enables keeping historical data so organizations can convert and\ntransform it as needed to fit a new S/4HANA configuration.\n\n## **Top S/4HANA Migration Challenges**\n\nOrganizations preparing for SAP S/4HANA migration should be aware of the\nfollowing challenges:\n\n**Complex Data Migration** : Transferring data from legacy systems to SAP\nS/4HANA requires careful planning and execution, especially when dealing with\nlarge volumes of data. Ensuring data accuracy, integrity, and completeness\nduring the migration process is critical.\n\n**Customization Compatibility** : Organizations often have customized their\nexisting systems to meet specific business needs. Adapting these\ncustomizations to work seamlessly with SAP S/4HANA may require significant\neffort, as the underlying architecture and data models differ.\n\n**Technical Integration** : Integrating SAP S/4HANA with other systems,\napplications, and processes within the organization can be technically\nchallenging. Ensuring smooth interoperability is essential to avoid\ndisruptions to existing workflows.\n\n**Cost and Resources** : The migration process can be costly, not only in\nterms of software licensing and implementation but also due to the need for\nskilled consultants, technical experts, and project resources. Adequate\nfunding and resource allocation are essential for a successful migration.\n\n**Complex Business Processes** : SAP S/4HANA brings new functionalities and\nprocess changes, which may require organizations to re-evaluate and redesign\ntheir existing business processes. Adapting to these changes can be time-\nconsuming and complex.\n\n**Testing and Quality Assurance** : Thorough testing is crucial to validate\nthe accuracy and functionality of the migrated system. Organizations need to\nallocate sufficient time and resources for testing to avoid post-migration\nissues.\n\n**Downtime and Disruption** : The migration process may involve downtime,\nwhich can impact regular business operations. Minimizing disruption and\nensuring a smooth transition is vital for business continuity.\n\n**Change Management** : Introducing a new ERP system like SAP S/4HANA requires\neffective change management. Employees need to be trained and prepared for the\nnew system to ensure its successful adoption.\n\n## S/4HANA Migration: Automated Role Re-design Solution Brief\n\nLearn how Pathlock automates the role design and testing process, allowing\nsecurity teams to complete the role re-design project significantly faster,\nsaving both time and costs.\n\nDownload the Solution Brief\n\n## **S/4HANA Migration Considerations and Best Practices**\n\n### **Get Executive Buy-In**\n\nEmployees and stakeholders are often reluctant to undertake a complex project\nlike S/4HANA migration. IT leaders, CIOs, and CFOs might be wary of the costs,\nefforts, and risks. However, migration initiatives are sometimes necessary to\nmeet changing business requirements.\n\nOrganizations should treat migration as a company-wide strategy rather than a\ntactical project. Everyone in the organization must understand the strategy to\nensure adequate planning and implementation. Management should establish a\nroadmap that IT and business teams can understand and support.\n\n### **Leverage Outsourced Expertise**\n\nMany challenges are involved in migrating to S/4HANA, with many organizations\nlacking the required in-house expertise to migrate. Many businesses choose to\npartner with external migration experts to support various aspects of the\nmigration process, including workload assessments, planning, process mapping,\nimplementation, and management.\n\nInternal IT support is essential, but consulting with external specialists\noften provides more business value. However, it is also important to ensure\nthe external and internal teams collaborate effectively.\n\n### **Determine the Right Migration Strategy**\n\nBefore initiating the SAP S/4HANA migration, the organization must make\nseveral key decisions about the overall migration strategy. Different\napproaches may better suit different S/4HANA systems (for example, on-premise\nvs cloud).\n\nIt is also useful to consider simply converting the data and settings from the\nexisting ECC system. However, sometimes it makes more sense to establish an\nentirely new SAP ERP system to avoid future problems. A successful migration\nrequires proper planning based on a clear strategy.\n\n### **Archive Legacy Data**\n\nA crucial preparatory step for businesses transitioning to SAP S/4HANA is\narchiving legacy ERP custom code. Research indicates that a significant\nportion of ABAP code is customer-specific and often goes unused after\ncreation. Performing this clean-up before migration presents an excellent\nopportunity to optimize the ERP system. By doing so, you can achieve a reduced\nmigration volume, leading to lower financial and time costs. ****\n\n### **Focus on Security**\n\nIn light of the ever-evolving business application threat landscape and the\nincreasing sophistication of threat actors, it has become imperative for\norganizations to integrate security from the outset of transformation projects\nand application development. Neglecting SAP security at the application level\ncan lead to significant business impacts that cannot be overlooked.\n\nBy adopting a “shifting left” approach, which involves incorporating security\nvalidation during code creation rather than deployment or testing, enterprises\ncan proactively prevent potential risks from materializing during production\nor leaving the development environment altogether. This proactive stance\nenables businesses to identify and address security issues early on,\nmitigating the risk of security breaches and their detrimental consequences.\n\n## **Secure Your SAP S/4HANA Migration with Pathlock**\n\nSAP S/4HANA migration can be a massive undertaking that requires careful\nplanning and preparation. Far too often, companies forget to think about how\ntheir access control and security strategies will change until they are\ngetting close to going live on a new platform. S4 HANA will often require a\nnew approach to access control that can adapt to the new landscape and\nchallenges.\n\nWith Pathlock, organizations using SAP S4 HANA can automate many of their SAP\nsecurity processes to provide 360-degree protection across the SAP system\nlandscape. The Pathlock platform can provide complete capabilities, including:\n\n**Automated Role Design** : Pathlock automates the design of SAP roles by\nanalyzing a user’s existing authorizations, their historical usage patterns,\nand their job function groupings, as well as segregation of duties (SOD) rules\nand sensitive access concerns. The solution ensures that roles adhere to\ndefined naming conventions, are adequately reviewed, and are properly\ndocumented for a smooth migration to S/4HANA. Learn more\n\n**Vulnerability Management** : Migrating to a new environment is never going\nto be perfect. It takes time to get your configurations and security right.\nPathlock continuously scans your SAP applications to identify critical\nvulnerabilities. It dynamically visualizes your SAP landscape, shows you where\nyour vulnerabilities are, automatically prioritizes them, and then shows you\nhow to remove the weaknesses in your applications. Learn more\n\n**Threat Detection** : The Threat Detection and Response module from Pathlock\nprovides SAP security and application teams with focused visibility into\nthreats facing critical business systems. It analyzes logs from over 60 data\nsources to identify critical events and combinations of non-critical/complex\nevents to identify threats in your application environment. Learn more\n\nApart from the above modules, Pathlock offers many other solutions like\nLicense Optimization, Access Analysis, Provisioning, and more to help make\nyour S/4HANA migration process more efficient.\n\nInterested to learn how Pathlock can help automate your SAP Security program\nwhile keeping your landscape secure and compliant? Request a demo of Pathlock\ntoday!\n\nTable of contents\n\n  * Why Migrate to S/4HANA?\n  * When Should You Start the S/4HANA Migration Process?\n  * Common S4/HANA Migration Approaches\n  * Greenfield Approach\n  * Brownfield Approach\n  * Hybrid Approach or Selective Data Transition\n  * Top S/4HANA Migration Challenges\n  * S/4HANA Migration: Automated Role Re-design Solution Brief\n  * S/4HANA Migration Considerations and Best Practices\n  * Get Executive Buy-In\n  * Leverage Outsourced Expertise\n  * Determine the Right Migration Strategy\n  * Archive Legacy Data\n  * Focus on Security\n  * Secure Your SAP S/4HANA Migration with Pathlock\n\nShare\n\nPathlock is revolutionizing the way enterprises secure their sensitive\nfinancial and customer data.\n\nRequest a demo\n\nOur Awards\n\n  *   *   * \n\nProducts\n\nApplication Access Governance Continuous Controls Monitoring Cybersecurity\nApplication Controls\n\nSolutions\n\nInitiative\n\nERP and Cloud Migrations Audit Readiness Finance Transformation Cross\nApplication SOD Continuous Compliance Mergers and Acquisitions Integration\n\nRole\n\nApplication Owner Internal Audit Finance Leaders CISO and IT Security\n\nApplications\n\nSAP PeopleSoft Oracle EBS Oracle Fusion Cloud SAP Ariba Workday Coupa JD\nEdwards SAP SuccessFactors Microsoft Dynamcs 365 SAP Access Control Microsoft\nEntra Identity Governance\n\nResources\n\nBlog Marketing Resources Integrations\n\nCompany\n\nAbout Us Why Pathlock Partners Careers\n\nContact\n\nSupport\n\n+1 469.906.2100  \n8111 Lyndon B Johnson Fwy, Dallas, TX 75251\n\nOFFICES\n\nNORTH AMERICA\n\n**US HEADQUARTERS**  \n+1 469.906.2100  \nOne Tabor Center  \n1200 17th St  \nSuite 880  \nDenver, CO 80202\n\n**DALLAS OFFICE**  \n14555 Dallas Pkwy  \nSte 100  \nDallas, TX 75254\n\n**REGISTERED ADDRESS**  \n169 Madison Ave., #2246  \nNew York, NY 10016\n\nEUROPE\n\n**BELGIUM**  \nBieststraat 2  \nB-3020 Herent, Belgium\n\n**GERMANY** DORTMUND  \nLindemannstr. 81, 44137 Dortmund\n\n**GERMANY** HAMBURG  \nWerner-Otto-Str. 6, 22179 Hamburg\n\n**UNITED KINGDOM**  \n17 Solent House  \nLansbury Business Estate  \n102 Lower Guildford Road  \nKnaphill, Woking  \nSurrey GU21 2EP  \nUnited Kingdom\n\nASIA\n\n**ISRAEL**  \n94 Yigal Alon Street,  \nTel Aviv-Yafo, Israel\n\n**INDIA** PUNE  \n1st Floor, Sr No 150,  \nLohia Jain IT Park,  \nA wing, Paud Road, Kothrud,  \nPune 411038\n\n**INDIA** BENGALURU  \nAVR Heights, I Floor, #L372,  \n5th Main Road, 6th Sector  \nHSR Layout, Bengaluru  \n560102\n\n**INDIA** PUNJAB  \nUnit No. 318, 319, and 329, 3rd Floor,  \nTower-B, Bestech Business Tower,  \nSector 66, Mohali, Punjab 160062\n\n**PHILIPINES**  \nRockwell Business Center, South Tower  \nMandaluyong City 1550\n\nCopyright 2024 © Pathlock. All rights reserved.\n\n  * Privacy Policy\n  * Cookie policy\n\n",
    "links": "[{\"link\": \"https://pathlock.com/\", \"text\": \"\"}, {\"link\": \"https://pathlock.com/\", \"text\": \"\"}, {\"link\": \"https://pathlock.com/products/application-access-governance/#access-risk-analysis\", \"text\": \"\"}, {\"link\": \"https://pathlock.com/products/application-access-governance/#compliant-provisioning\", \"text\": \"\"}, {\"link\": \"https://pathlock.com/products/application-access-governance/#access-certification\", \"text\": \"\"}, {\"link\": \"https://pathlock.com/products/application-access-governance/#elevated-access-management\", \"text\": \"\"}, {\"link\": \"https://pathlock.com/products/application-access-governance/#role-management\", \"text\": \"\"}, {\"link\": \"https://pathlock.com/products/continuous-controls-monitoring/#risk-quantification-and-transaction-monitoring\", \"text\": \"\"}, {\"link\": \"https://pathlock.com/products/continuous-controls-monitoring/#configuration-change-monitoring\", \"text\": \"\"}, {\"link\": \"https://pathlock.com/products/continuous-controls-monitoring/#business-process-control-management\", \"text\": \"\"}, {\"link\": \"https://pathlock.com/products/continuous-controls-monitoring/#manual-process-control-management\", \"text\": \"\"}, {\"link\": \"https://pathlock.com/products/cybersecurity-application-controls/#dynamic-data-masking\", \"text\": \"\"}, {\"link\": \"https://pathlock.com/products/cybersecurity-application-controls/#vulnerability-and-code-scanning\", \"text\": \"\"}, {\"link\": \"https://pathlock.com/products/cybersecurity-application-controls/#threat-detection-\", \"text\": \"\"}, {\"link\": \"https://pathlock.com/products/cybersecurity-application-controls/#transport-control\", \"text\": \"\"}, {\"link\": \"https://pathlock.com/products/cybersecurity-application-controls/#session-logging-and-dlp\", \"text\": \"\"}, {\"link\": \"https://pathlock.com/learn\", \"text\": \"\"}, {\"link\": \"https://pathlock.com/integrations\", \"text\": \"\"}, {\"link\": \"https://pathlock.com/case-studies\", \"text\": \"\"}, {\"link\": \"https://pathlock.com/resources\", \"text\": \"\"}, {\"link\": \"https://pathlock.com/resources/?_sft_content_type=analyst-report\", \"text\": \"\"}, {\"link\": \"https://pathlock.com/resources/?_sft_content_type=on-demand-webinar\", \"text\": \"\"}, {\"link\": \"https://pathlock.com/resources/?_sft_content_type=solution-brief\", \"text\": \"\"}, {\"link\": \"https://pathlock.com/resources/?_sft_content_type=data-sheet\", \"text\": \"\"}, {\"link\": \"https://pathlock.com/resources/?_sft_content_type=ebook\", \"text\": \"\"}, {\"link\": \"https://pathlock.com/learn/s4-hana-migration/\", \"text\": \"\"}, {\"link\": \"https://pathlock.com/contact?tab=request-a-demo\", \"text\": \"\"}, {\"link\": \"https://pathlock.com/products/application-access-governance/#access-risk-analysis\", \"text\": \"\"}, {\"link\": \"https://pathlock.com/products/application-access-governance/#compliant-provisioning\", \"text\": \"\"}, {\"link\": \"https://pathlock.com/products/application-access-governance/#access-certification\", \"text\": \"\"}, {\"link\": \"https://pathlock.com/products/application-access-governance/#elevated-access-management\", \"text\": \"\"}, {\"link\": \"https://pathlock.com/products/application-access-governance/#role-management\", \"text\": \"\"}, {\"link\": \"https://pathlock.com/products/continuous-controls-monitoring/#risk-quantification-and-transaction-monitoring\", \"text\": \"\"}, {\"link\": \"https://pathlock.com/products/continuous-controls-monitoring/#configuration-change-monitoring\", \"text\": \"\"}, {\"link\": \"https://pathlock.com/products/continuous-controls-monitoring/#business-process-control-management\", \"text\": \"\"}, {\"link\": \"https://pathlock.com/products/continuous-controls-monitoring/#manual-process-control-management\", \"text\": \"\"}, {\"link\": \"https://pathlock.com/products/cybersecurity-application-controls/#dynamic-data-masking\", \"text\": \"\"}, {\"link\": \"https://pathlock.com/products/cybersecurity-application-controls/#vulnerability-and-code-scanning\", \"text\": \"\"}, {\"link\": \"https://pathlock.com/products/cybersecurity-application-controls/#threat-detection-\", \"text\": \"\"}, {\"link\": \"https://pathlock.com/products/cybersecurity-application-controls/#transport-control\", \"text\": \"\"}, {\"link\": \"https://pathlock.com/products/cybersecurity-application-controls/#session-logging-and-dlp\", \"text\": \"\"}, {\"link\": \"https://pathlock.com/learn\", \"text\": \"\"}, {\"link\": \"https://pathlock.com/integrations\", \"text\": \"\"}, {\"link\": \"https://pathlock.com/case-studies\", \"text\": \"\"}, {\"link\": \"https://pathlock.com/resources\", \"text\": \"\"}, {\"link\": \"https://pathlock.com/resources/?_sft_content_type=analyst-report\", \"text\": \"\"}, {\"link\": \"https://pathlock.com/resources/?_sft_content_type=on-demand-webinar\", \"text\": \"\"}, {\"link\": \"https://pathlock.com/resources/?_sft_content_type=solution-brief\", \"text\": \"\"}, {\"link\": \"https://pathlock.com/resources/?_sft_content_type=data-sheet\", \"text\": \"\"}, {\"link\": \"https://pathlock.com/resources/?_sft_content_type=ebook\", \"text\": \"\"}, {\"link\": \"https://pathlock.com/learn/s4-hana-migration/\", \"text\": \"\"}, {\"link\": \"https://www.facebook.com/sharer/sharer.php?u=https://pathlock.com/learn/s4-hana-migration/\", \"text\": \"\"}, {\"link\": \"https://twitter.com/intent/tweet?url=https://pathlock.com/learn/s4-hana-migration/\", \"text\": \"\"}, {\"link\": \"http://www.linkedin.com/shareArticle?mini=true&url=https://pathlock.com/learn/s4-hana-migration/\", \"text\": \"\"}, {\"link\": \"mailto:?subject=&body=https://pathlock.com/learn/s4-hana-migration/\", \"text\": \"\"}, {\"link\": \"https://pathlock.com/\", \"text\": \"\"}, {\"link\": \"https://pathlock.com/contact?tab=request-a-demo\", \"text\": \"Request a demo\"}, {\"link\": \"https://pathlock.com/blog/\", \"text\": \"Blog\"}, {\"link\": \"https://pathlock.com/resources\", \"text\": \"Marketing Resources\"}, {\"link\": \"https://pathlock.com/integrations\", \"text\": \"Integrations\"}, {\"link\": \"https://pathlock.com/about-us/\", \"text\": \"About Us\"}, {\"link\": \"https://pathlock.com/why-pathlock/\", \"text\": \"Why Pathlock\"}, {\"link\": \"https://pathlock.com/our-partners/\", \"text\": \"Partners\"}, {\"link\": \"https://pathlock.com/contact/\", \"text\": \"\"}]"
}