{
    "summary": "## The Whatfix Blog | Drive Digital Adoption\n\nThe Whatfix Blog | Drive Digital Adoption\n\n  * CIO\n\nCIO\n\n**CIO Blog**\n\nExplore all new CIO and IT-related content on our enterprise digitalization\nblog hub.\n\nExplore by category\n\nChange Management\n\nDigital Adoption\n\nDigital Transformation\n\nIT Optimization\n\nProcurement\n\n  * Employee Experience\n\nEmployee Experience\n\n**EX Blog**\n\nExplore all new employee experience related content on our EX blog hub.\n\nExplore by category\n\nEmployee Onboarding\n\nEmployee Performance\n\nEmployee Training & Development\n\nHR & People Management\n\nKnowledge Management\n\nSales Enablement & Training\n\n  * Customer Experience\n\nCustomer Experience\n\n**CX Blog**\n\nExplore all new customer experience related content on our CX blog hub.\n\nExplore by category\n\nCustomer Adoption & Education\n\nCustomer Growth & Retention\n\nCustomer Support\n\n  * Product\n\nProduct\n\n**Product Manager Blog**\n\nExplore all new product-related content on our product manager blog hub.\n\nExplore by category\n\nProduct Documentation\n\nPX & User Analysis\n\nUser Onboarding\n\n  * What Is Whatfix?\n\nWhat Is Whatfix?\n\nWhat Is Whatfix?\n\nWhatfix is a digital adoption and analytics platform that enables technology\nend-users with in-app guidance and support.\n\nWhat Is a Digital Adoption Platform?\n\nOur ultimate guide to digital adoption platforms is a crash course for DAP\nbeginners.\n\nWhatfix Resources\n\nCustomers\n\nPricing\n\nResource Library\n\nGet a Demo Start Your Free Trial\n\nToggle Menu\n\nGet a Demo\n\n  * Back to Blog \n\n  * IT Optimization\n\n# S/4HANA Migration Checklist & Implementation Guide (2024)\n\n  * April 5, 2023 \n\nLevi Olmstead\n\nBy the end of 2027, SAP plans to shelf their Business Suite 7 in favor of\nS/4HANA, which in comparison, will be supported until at least 2040. Although\nSAP had announced 2025 as the initial deadline for the transition, it had to\nbacktrack after seeing lower-than-expected ERP adoption numbers from its\nusers.\n\nBut, given the current uptick in the number of users making the switch, it’s\nsafe to say they won’t be any other extension. This article will help you\nunderstand how to transition your SAP ERP to S/4HANA, whether you’re deploying\nit from scratch or you want to bring along your data from ECC.\n\n## What Is the SAP S/4Hana Migration?\n\nIn 2018, SAP announced they’d be sunsetting _Business Suite 7_ by 2025, but\ndue to an underwhelming response and a lack of experienced implementation\npartners, they had to extend their deadline. Users who’re on _Business Suite\n7’s_ ERP Central Component (i.e. ECC) now have until the end of 2027 to make\nthe switch to S/4 HANA. Past that deadline, SAP will only provide maintenance\nservices for BS7.0 at a 2% premium, on top of their existing 22% support fees.\n\n## When’s the Deadline for Migrating to S4 Hana?\n\nWhen SAP released their initial 2025 deadline for the ECC-to-S/4HANA\ntransition, they had to change tack after the backlash they received from\naggrieved users & enterprises who felt the timeline was restrictive to\ntransition to a new platform and reengineer their processes from scratch.\n\nBut, given the growing rate of adoption by ECC users, there’s no reason to\nassume that the deadline will be extended any longer. Or, as Paul Cooper,\nchairman, UK & Ireland SAP User Group, puts it, _“SAP is being very strong in\nholding that line that [the 2027 deadline] will be the end or the beginning of\nthe end if you purchase extended maintenance which runs until 2030.”_\n\nRECOMMENDED Article\n\nERP Implementation: 12-Step Plan to Success (2024)\n\nRead More »\n\n## Three Types of S/4HANA Migration\n\nDepending on what your current SAP deployment looks like, there are three\nstrategies you can use to make the ERP implementation and transition, to limit\nbusiness disruption, and make the most of the functionality of the S/4HANA\nplatform. There’s no good or bad way to go about it—it all depends on how long\nyou’ve been running your setup, your existing workflows, configurations, and\ndatabase structure.\n\n### 1\\. Greenfield approach (ie. new implementation)\n\nA greenfield installation entails rebuilding your entire enterprise resource\nplanning infrastructure from scratch on top of the S/4HANA platform— process\nflows, workflow automations, integrations, and configurations—without\nimporting existing system structures.\n\nAs you might expect, a greenfield deployment and software implementation is\nthe most expensive, and making the switch must include an aggressive training\nand adoption regimen to help your users familiarize themselves with UI\nchanges, workflow logic, and S/4HANA’s tooling.\n\n **A greenfield migration approach is best for** : Enterprises with legacy,\noutdated SAP applications and infrastructure that is 20+ years old.\nEnterprises should take advantage of this time to fully reimagine and redefine\ntheir ERP processes, tasks, and workflows.\n\nThe Keys to a Successful Enterprise Software Implementation\n\n→ Get the white paper now\n\n### 2\\. Brownfield approach (ie. full migration)\n\nSAP recommends a brownfield deployment (aka system conversion) for customers\nwho want to make the switch to S/4HANA but want to preserve their custom\napplications, workflows, and data structures, avoid costly disruptions to\ntheir enterprise resource planning ops, and instead, migrate and adapt their\nprocesses to the S/4HANA platform.\n\nNow, while SAP has released tools and published extensive documentation that’s\ndesigned to help in-house technicians and implementation partners make the\ntransition a breeze, there’s a significant chance that you’ll encounter\ntechnical edge cases that can freeze your operations and delay you more than\nyou expected.\n\n **A full migration approach is best for:** Enterprises that are “all-on” on\nthe SAP application suite and SAP implementation partners who’re coming in to\nassist as third-party support.\n\n### 3\\. Hybrid approach\n\nThere are two different pathways a hybrid S/4HANA migration can take, namely:\n\n  * An empty shell migration, where you generate a copy of your existing system, excluding any live data, discard any configuration settings and programs you no longer intend to use & “repair” those you intend to use on S/4HANA, before upgrading and moving your data back in;\n  * A mix & match migration, where you run an S/4HANA instance and import your existing configurations and data into it, while operating your ECC instance concurrently until you’re done\n\n **A hybrid approach is best for** : Enterprises that want to build certain\nparts of their new S/4HANA ERP from the ground up, use SAP applications and\npartners for some migration, but desire the flexibility and agility to\nintegrate best-of-breed applications and change processes in the future.\n\nRelated Resources\n\n5 ERP Adoption Challenges & How to Overcome Them (2024)\n\nThe Cost of a Failed ERP Implementation (+7 Infamous Failures)\n\nSAP ERP Adoption: 4 Challenges SAP Users Face\n\n## S4 Hana Migration Checklist for the Greenfield, New Implementation Approach\n\nHere’s a simple, eight-step process to guide you through rebuilding your ERP\nfunctions on top of S/4HANA, from when you begin your gap-fit analysis until\nyour post-deployment adoption efforts.\n\n### 1\\. Discovery and research\n\nThe discovery process helps you define gaps within existing SAP BS7.0\ndeployment and understand how the S/4HANA platform can help you plug those\nholes, generate a positive ROI, and help your users streamline business\nprocesses. This is not a C-level task a few business intelligence managers can\nembark on—you need to involve your entire organization, help them map their\nexisting processes to S/4HANA’s improved functionalities, and try to build\nconsensus on how S/4HANA can change how they operate.\n\n### 2\\. Create an implementation and migration team\n\nAn S/4HANA implementation & migration team should include internal oversight\nin the form of an executive stakeholder, usually a C-level executive who makes\nkey decisions but doesn’t get involved in day-to-day efforts and a hands-on\nproject coordinator who ensures the migration meets all the objectives set\nduring the discovery process.\n\nYour technical team should include migration architects, engineers, a project\ninfrastructure build team, and a project manager, developers, security\nadministrators, SAP Fiori developers, change managers, training leads, and\nprocess orchestration consultants.\n\n### 3\\. Explore S4 Hana and its modern solutions\n\nIn this phase, your ERP and IT team will explore and research S/4HANA and its\nimproved functionalities. This is where you’ll realize the digital\ntransformation benefits of the projects and the value you can derive from the\nnew ERP. This will help you to identify how these new features and\nfunctionalities can improve your workflows.\n\n### 4\\. Document and map your current SAP business processes\n\nIn this phase, you’ll map your existing processes, which will help you\neliminate redundant steps, automate repetitive tasks, and redesign processes\nfrom scratch inside S/4HANA.\n\n### 5\\. Build your custom configuration\n\nS/4HANA is significantly more powerful that BS7.0 & it empowers users to\ncreate SAP Fiori applications & deploy them to the S/4HANA cloud, create\ncustom business objects, enrich them with ABAP programs, and release them for\ninternal usage faster than BS7.0.\n\n### 6\\. Create an end-user onboarding, training, and support plan\n\nA well-rounded coaching program needs to reassure your end-users that they\nhave the proficiency required to maximize the capabilities offered by the\nS/4HANA platform. Given the scope of the platform, your training strategy\nneeds to meet users where they are and deliver helpful assistance with minimal\ndisruption.\n\n  * Use on-demand training resources to resolve queries with bite-sized videos and guides\n  * Embed content libraries inside the SAP dashboard where users can search through relevant product docs, help resources, guides, and bite-sized video explainer without leaving the SAP user interface\n  * Personalize training programs for your staff based on their role, location, skill level, and business use cases\n  * Use a learning management system to guide employees through an S/4HANA curriculum, track their performance over time, and keep them engaged with gamification, alerts, and rewards\n\nWith a digital adoption platform (DAP) like Whatfix, you can create in-app\nguidance and on-demand support content from your employees and end-users. This\nincludes creating product tours, interactive walkthroughs, field validations,\ntooltips, task lists, self-help wikis, and more – all overlaying on S/4 HANA,\nand all contextual to different user roles.\n\nWith Whatfix, you can provide moment-of-need guidance and support to\nemployees, helping to drive adoption, reduce downtime, and empower your\norganization to fully realize the benefits of S/4 Hana.\n\nDrive S/4HANA adoption with in-app, personalized learning & training flows\nwith Whatfix\n\nSee Whatfix for SAP in action now →\n\n### 7\\. Deploy S/4HANA\n\nOnce you’re confident that your S/4HANA setup is complete, you can go test it\nin a sandbox where you’ll test run applications, observe workflows, and make\nsure custom objects are functional  before going live.\n\n### 8\\. Monitor use and track adoption\n\nA product analytics tool like Whatfix will help you track which of your users\nare engaging with your S/4HANA instance, how much, which features they’re\nusing, and vice versa. Armed with that data, you can design better training\nprograms, set up your end-users with 1:1 SAP coaching, and emphasize the need\nto complete the training process so they can extract all the value the S/4HANA\nplatform promises.\n\nYou can also identify friction and pain points inside the platform, and create\nnew in-app guidance or help documentation to resolve those difficult-to-use\nareas in your new S/4 HANA platform.\n\n## S/4HANA Migration Checklist for the Brownfield, Full Migration Approach\n\nA brownfield S/4HANA helps you make the switch without sacrificing your\nexisting configurations and limits disruption to your business process—but you\nneed to carefully coordinate the change management process, ensure the utmost\ndata accuracy, and build an extensive training infrastructure to make the\ntransition smooth.\n\n### 1\\. Align your SAP ERP migration plan with your business goals\n\nYour transition strategy should start by tying your desired business goals to\nS/4HANA benefits as it’ll help you make the case for the transition, convince\nyour end-users to give you their full support since they’ll understand it’s\nnot yet another vanity digital transformation effort that’s bound to fail.\n\nClearly explain how much S/4HANA can streamline your source-to-pay, plan-to-\nproduct, order-to-cash, and HR operations in terms of tasks that can be\nautomated, redundant steps you can remove, and the time it’ll save.\n\n### 2\\. Prepare your system requirements and needs\n\nYour system requirements will differ, depending on whether you opt for an on-\npremise deployment or a cloud-based operation, your industry vertical (e.g.,\nretail, healthcare, energy, commodity management, finance, policy management,\netc.), the languages your custom applications are written in, company size,\netc.\n\n### 3\\. Create an SAP ERP change team\n\nYour change management team should include the process engineers, Fiori\ndevelopers, security administrators, and the application developers who’re\nresponsible for coordinating the transition, building or tweaking\nintegrations, workflows, and custom applications inside your S/4HANA\ndeployment.\n\n### 4\\. Confirm all your integrations and add-ons will work in your new SAP\ninstance\n\nWhether they’re published by SAP, a third-party, or were built in-house, SAP\nadd-ons can only run on the S/4HANA platform if they’ve explicitly been\ndesigned to. To prevent this from becoming a bottleneck (especially for add-\nons that are critical to your operations), it’s important to contact vendors\non time to notify them to prepare a compatible version or give you a timeline\nfor its availability.\n\n### 5\\. Custom code migration and installation\n\nSAP maintains Fiori Custom Code Migration App and ABAP Development Tools in\nEclipse with Quick Fixes, both of which are designed to help organizations\nswitching to S/4HANA to scope, analyze, migrate, and adapt custom code to the\nS/4HANA environment.\n\n### 6\\. Customize your S4 Hana configuration\n\nThe customization process includes basic settings that set the stage for the\nsystem landscape and data transfer, as well as other application-specific\nsettings and enhancements like customer exists, BAdIs, and individual\napplications settings. You can also:\n\n  * Define the origin and endpoints for logical systems and activate BTEs.\n  * Activate change transfer of records.\n  * Integrate your list of planning calendars from SAP IBP.\n  * Create business add-ins (BAdIs) that’ll work with your S/4HANA master data.\n\n### 7\\. Spot-check data accuracy\n\nBefore you begin importing your data into S/4HANA with SAP Migration Cockpit,\nyour IT and Business teams should review the entries in your templates to\nensure accuracy. Additionally, it’s important to:\n\n  * load import batches incrementally.\n  * use the DEV system to test loads before the TEST system.\n  * mark your master datasets with prefixes for easier tracking.\n\n### 8\\. Create an end-user onboarding, training, and support plan\n\nThere are several ways you can navigate the training and adoption journey\nafter your S/4HANA setup, including:\n\n  * Support—on-demand content, such as video explainers, product documentation, guides, and articles, as well as live assistance from your implementation partners for edge cases where your existing support library can’t help\n  * Onboarding—Use step-by-step product tours that guides users through the S/4HANA interface, as well as tooltips, hotspots, alerts, and notifications that can deliver contextual updates quickly\n  * Training—SAP offers training resources such as their openSAP program, Learning Journeys, Learning Hub, Certification Programs designed to get users to ramp up their proficiency on the S/4HANA platform, mostly for free.\n\nWith Whatfix’s DAP, support your ERP end-users with various in-app guided and\nhelp content widgets – helping them to familiarize themselves with S/4HANA’s\nUI and workflows, overcome friction points in the application, adopt new\nworkflows and tasks, and empower them to realize their full potential with the\nnew ERP investment.\n\n### 9\\. Deploy S/4HANA\n\nGo live across all departments where you have S/4HANA functionality. Be sure\nto keep an eye out for downtime, as well as user resistance or frustration.\n\n### 10\\. Monitor use and track adoption\n\nSAP is a complicated piece of enterprise software and it’s understandable if\nsome of your end-users are slow to adopt S/4HANA—they may not be forthright\nabout their struggles but their productivity will reduce noticeably. A product\nanalytics platform like Whatfix can help you track usage trends, monitor which\nfeatures users engage with, record sessions, and get a comprehensive outlook\non where your employees are struggling with the S/4HANA experience.\n\nHow a DAP Drives S/4HANA Implementation Success\n\nAccording to SAP experts, Brightwork Research & Analysis, a 1 – 2TB instance\nof S/4HANA would attract a one-time bill of $6.2 million— and that’s before\nyou factor in ongoing maintenance, training, etc.\n\nAt that price point, any users within your company who don’t use SAP to its\nfull functionality are literally lighting money on fire—but they won’t until\nthey can learn how it works, at their own pace.\n\nWhatfix is a digital adoption platform that helps enterprise users make sense\nof complicated software products like SAP. Our product acts like a canvas on\ntop of your S/4HANA instance and guides your users with contextual assistance—\n\n  * Teach users every feature inside the S/4HANA user interface works with step-by-step walkthroughs, flows, and onboarding task lists\n  * Embed self-help content widgets inside the application so that users can search through resources like product docs, guides, videos, and explainers without leaving the SAP dashboard by \n  * Collect user feedback with interactive surveys and polls\n  * Keep users engaged throughout the onboarding process using alerts, pop-ups, and beacons\n  * Automatically translate product docs into 70+ languages\n\n **Learn howWhatfix transforms your SAP ERP experience and helps you generate\na positive ROI on your S/4HANA investment by making it a part of your\nemployees’ day-to-day workflow.**\n\nLike this article? Share it with your network.\n\nSubscribe to the Whatfix newsletter now!\n\nemail\n\nSubscribe\n\nTable of Contents\n\n  * What Is the SAP S/4Hana Migration?\n\n  * When’s the Deadline for Migrating to S4 Hana?\n\n  * Three Types of S/4HANA Migration\n\n  * S4 Hana Migration Checklist for the Greenfield, New Implementation Approach\n\n  * S/4HANA Migration Checklist for the Brownfield, Full Migration Approach\n\nSoftware Clicks With Whatfix\n\nWhatfix's digital adoption platform empowers your employees, customers, and\nend-users with in-app guidance, reinforcement learning, and contextual self-\nhelp support to find maximum value from software.\n\nSee Whatfix in action now!\n\nRelated Posts\n\nCoupa Implementation: How to Drive User Adoption\n\nUKG Pro Implementation: How to Drive User Adoption\n\nEpic Hyperdrive Migration Plan for Healthcare IT Teams\n\nThank you for subscribing!\n\nSign up for the Whatfix blog\n\nJoin 300,000+ monthly readers learning how to drive software adoption by\nsigning up to receive the latest best practices and resources.\n\nemail\n\nSign up\n\nSoftware Clicks Better With Whatfix\n\nExplore Whatfix\n\nWhatfix DAP\n\nWhatfix Product Analytics\n\nCustomer Stories\n\nWhatfix Use Cases\n\nWhy Whatfix\n\nResources\n\nBlog\n\nDigital Adoption\n\nDigital Adoption Platform\n\nDigital Transformation\n\nChange Management\n\nProduct Tour\n\nInteractive Walkthroughs\n\nIn-App Guidance\n\nIn-App Support\n\nIn-App Surveys\n\nEnd-User Behavioral Analytics\n\nCompany\n\nAbout Us\n\nCustomers\n\nCareers\n\nFAQs\n\nNewsroom\n\nPricing\n\nSupport\n\nWhitepapers\n\nFollow\n\nTwitter\n\n__\n\nFacebook\n\n__\n\nLinkedIn\n\n__\n\nExplore Whatfix\n\nWhatfix DAP\n\nWhatfix Product Analytics\n\nCustomer Stories\n\nWhatfix Use Cases\n\nWhy Whatfix\n\nResources\n\nBlog\n\nDigital Adoption\n\nDigital Adoption Platform\n\nDigital Transformation\n\nChange Management\n\nProduct Tour\n\nInteractive Walkthroughs\n\nIn-App Guidance\n\nIn-App Support\n\nIn-App Surveys\n\nEnd-User Behavioral Analytics\n\nCompany\n\nAbout Us\n\nCustomers\n\nCareers\n\nFAQs\n\nNewsroom\n\nPricing\n\nSupport\n\nWhitepapers\n\nFollow\n\n__\n\n__\n\n__\n\n© 2024 Whatfix.\n\nPrivacy Policy\n\nTerms of Service\n\nWhatfix Trust\n\nManage Preferences\n\n+1(800) 459-7098\n\nWe use cookies to ensure that you have the best experience on our website. If\nyou continue to use this site we assume that you accept this. OK\n\n",
    "links": "[{\"link\": \"https://whatfix.com/blog/\", \"text\": \"The Whatfix Blog | Drive Digital Adoption\"}, {\"link\": \"https://whatfix.com/blog/\", \"text\": \"The Whatfix Blog | Drive Digital Adoption\"}, {\"link\": \"https://whatfix.com/products/analyze/\", \"text\": \"\\n                                                                Whatfix Product Analytics                                                            \"}, {\"link\": \"https://whatfix.com/resources/case-studies/\", \"text\": \"\\n                                                                Customer Stories                                                            \"}, {\"link\": \"https://whatfix.com/blog/dap-use-cases/\", \"text\": \"\\n                                                                Whatfix Use Cases                                                            \"}, {\"link\": \"https://whatfix.com/why-whatfix/\", \"text\": \"\\n                                                                Why Whatfix                                                            \"}, {\"link\": \"https://whatfix.com/blog/\", \"text\": \"\\n                                                                Blog                                                            \"}, {\"link\": \"https://whatfix.com/digital-adoption/\", \"text\": \"\\n                                                                Digital Adoption                                                            \"}, {\"link\": \"https://whatfix.com/digital-adoption-platform/\", \"text\": \"\\n                                                                Digital Adoption Platform                                                            \"}, {\"link\": \"https://whatfix.com/digital-transformation/\", \"text\": \"\\n                                                                Digital Transformation                                                            \"}, {\"link\": \"https://whatfix.com/change-management/\", \"text\": \"\\n                                                                Change Management                                                            \"}, {\"link\": \"https://whatfix.com/product-tour/\", \"text\": \"\\n                                                                Product Tour                                                            \"}, {\"link\": \"https://whatfix.com/interactive-walkthrough/\", \"text\": \"\\n                                                                Interactive Walkthroughs                                                            \"}, {\"link\": \"https://whatfix.com/blog/in-app-guidance/\", \"text\": \"\\n                                                                In-App Guidance                                                            \"}, {\"link\": \"https://whatfix.com/blog/in-app-support/\", \"text\": \"\\n                                                                In-App Support                                                            \"}, {\"link\": \"https://whatfix.com/blog/in-app-surveys/\", \"text\": \"\\n                                                                In-App Surveys                                                            \"}, {\"link\": \"https://whatfix.com/blog/behavior-analytics/\", \"text\": \"\\n                                                                End-User Behavioral Analytics                                                            \"}, {\"link\": \"https://whatfix.com/about-us/\", \"text\": \"\\n                                                                About Us                                                            \"}, {\"link\": \"https://whatfix.com/customers/\", \"text\": \"\\n                                                                Customers                                                            \"}, {\"link\": \"https://whatfix.com/careers/\", \"text\": \"\\n                                                                Careers                                                            \"}, {\"link\": \"https://whatfix.com/newsroom/\", \"text\": \"\\n                                                                Newsroom                                                            \"}, {\"link\": \"https://whatfix.com/pricing/\", \"text\": \"\\n                                                                Pricing                                                            \"}, {\"link\": \"https://whatfix.com/products/analyze/\", \"text\": \"\\n                                                        Whatfix Product Analytics                                                    \"}, {\"link\": \"https://whatfix.com/resources/case-studies/\", \"text\": \"\\n                                                        Customer Stories                                                    \"}, {\"link\": \"https://whatfix.com/blog/dap-use-cases/\", \"text\": \"\\n                                                        Whatfix Use Cases                                                    \"}, {\"link\": \"https://whatfix.com/why-whatfix/\", \"text\": \"\\n                                                        Why Whatfix                                                    \"}, {\"link\": \"https://whatfix.com/blog/\", \"text\": \"\\n                                                        Blog                                                    \"}, {\"link\": \"https://whatfix.com/digital-adoption/\", \"text\": \"\\n                                                        Digital Adoption                                                    \"}, {\"link\": \"https://whatfix.com/digital-adoption-platform/\", \"text\": \"\\n                                                        Digital Adoption Platform                                                    \"}, {\"link\": \"https://whatfix.com/digital-transformation/\", \"text\": \"\\n                                                        Digital Transformation                                                    \"}, {\"link\": \"https://whatfix.com/change-management/\", \"text\": \"\\n                                                        Change Management                                                    \"}, {\"link\": \"https://whatfix.com/product-tour/\", \"text\": \"\\n                                                        Product Tour                                                    \"}, {\"link\": \"https://whatfix.com/interactive-walkthrough/\", \"text\": \"\\n                                                        Interactive Walkthroughs                                                    \"}, {\"link\": \"https://whatfix.com/blog/in-app-guidance/\", \"text\": \"\\n                                                        In-App Guidance                                                    \"}, {\"link\": \"https://whatfix.com/blog/in-app-support/\", \"text\": \"\\n                                                        In-App Support                                                    \"}, {\"link\": \"https://whatfix.com/blog/in-app-surveys/\", \"text\": \"\\n                                                        In-App Surveys                                                    \"}, {\"link\": \"https://whatfix.com/blog/behavior-analytics/\", \"text\": \"\\n                                                        End-User Behavioral Analytics                                                    \"}, {\"link\": \"https://whatfix.com/about-us/\", \"text\": \"\\n                                                        About Us                                                    \"}, {\"link\": \"https://whatfix.com/customers/\", \"text\": \"\\n                                                        Customers                                                    \"}, {\"link\": \"https://whatfix.com/careers/\", \"text\": \"\\n                                                        Careers                                                    \"}, {\"link\": \"https://whatfix.com/newsroom/\", \"text\": \"\\n                                                        Newsroom                                                    \"}, {\"link\": \"https://whatfix.com/pricing/\", \"text\": \"\\n                                                        Pricing                                                    \"}]"
}