{
    "summary": "Skip to content Skip to footer\n\nFeatured insights Capabilities Industries Technology About us Careers\n\nMore\n\nMy Account Sign Out\n\nSign in Register\n\nUnited States\n\nFind a country or region\n\nGlobal\n\nAfrique\nFrancophoneAlbaniaAmericaAndorraAngolaArgentinaArmeniaAustraliaAustriaAzerbaijanBahamasBahrainBarbadosBelgiumBermudaBoliviaBosnia\nand HerzegovinaBotswanaBrasilBritish Virgin\nIslandsBruneiBulgariaCambodiaCameroonCanadaCape VerdeCaribbeanCayman\nIslandsCentral and Eastern EuropeChadChannel IslandsChileChinaColombiaCongo\n(Brazzaville)Congo (Dem. Rep.)Costa RicaCroatiaCyprusCzech RepublicCôte\nd'IvoireDenmarkDominican RepublicEcuadorEgyptEl SalvadorEquatorial\nGuineaEstoniaFinlandFranceGabonGazaGeorgiaGermanyGhanaGibraltarGreeceGuatemalaGuineaHondurasHong\nKong SAR, ChinaHungaryIcelandIndiaIndonesiaInteraméricasIraqIreland (Republic\nof)Isle of\nManIsraelItalyJamaicaJapanJordanKazakhstanKenyaKosovoKuwaitLaosLatviaLebanonLiberiaLibyaLiechtensteinLithuaniaLuxembourgMacedoniaMadagascarMalaysiaMaltaMauritiusMexicoMiddle\nEast\nRegionMoldovaMongoliaMontenegroMozambiqueMéxicoNamibiaNetherlandsNetherlands\nAntillesNew ZealandNicaraguaNigeriaNorwayOmanPakistanPanamaPapua New\nGuineaParaguayPeruPhilippinesPolandPortugalQatarRomaniaRwandaSaudi\nArabiaSenegalSerbiaSingaporeSlovakiaSloveniaSouth AfricaSouth\nKoreaSpainSwedenSwitzerlandTaiwanTanzaniaThailandTrinidad and\nTobagoTurkeyTürkiyeU.S.UKUSUSAUgandaUkraineUnited Arab EmiratesUnited\nKingdomUnited StatesUruguayUzbekistanVenezuela VietnamWest\nBankZambiaZimbabweeSwatini/SwazilandУкраїнаישראל臺灣\n\nSearch\n\nShow full breadcrumb\n\nHome Technology PwC’s strategic alliances SAP Choosing the right migration\napproach for RISE with SAP\n\nMenu\n\nFeatured insights\n\nFeatured insights\n\n2024 Global Digital Trust Insights Survey C-Suite insights Board governance\nissues Case studies ESG PwC Executive Pulse Podcasts Tech Effect Webcasts All\nResearch and insights\n\nMenu\n\nFeatured insights\n\n2024 Global Digital Trust Insights Survey\n\nMenu\n\nFeatured insights\n\nC-Suite insights\n\nBoard of directors CEO insights CFO insights Chief Legal Officer insights\nChief Sustainability Officer insights CIO insights CISO insights CMO insights\nController insights COO insights Future CFO insights Tax executives insights\nTransformation leader insights\n\nMenu\n\nFeatured insights\n\nBoard governance issues\n\nMenu\n\nFeatured insights\n\nCase studies\n\nMenu\n\nFeatured insights\n\nESG\n\nMenu\n\nFeatured insights\n\nPwC Executive Pulse\n\nMenu\n\nFeatured insights\n\nPodcasts\n\nMenu\n\nFeatured insights\n\nTech Effect\n\nMenu\n\nFeatured insights\n\nWebcasts\n\nMenu\n\nFeatured insights\n\nAll Research and insights\n\nFeatured\n\nThe New Equation\n\nExecutive leadership hub - What’s important to the C-suite?\n\nMenu\n\nCapabilities\n\nCapabilities\n\nAudit and assurance Alliances and ecosystems Board governance issues Business\nModel Reinvention Cloud and digital Consulting Cybersecurity, Risk and\nRegulatory Deals Digital assets and crypto Digital assurance and transparency\nFinancial statement audit Generative AI Managed Services Metaverse PwC Private\nSustainability and ESG Tax services Transformation Viewpoint All capabilities\n\nMenu\n\nCapabilities\n\nAudit and assurance\n\nMenu\n\nCapabilities\n\nAlliances and ecosystems\n\nAdobe Amazon Web Services Google Guidewire Microsoft Oracle Salesforce SAP\nWorkday Workiva All alliances\n\nMenu\n\nCapabilities\n\nBoard governance issues\n\nMenu\n\nCapabilities\n\nBusiness Model Reinvention\n\nMenu\n\nCapabilities\n\nCloud and digital\n\nAlliances and Ecosystems Application Managed Services Cloud engineering Cloud\nTransformation Data and Analytics Industry Cloud\n\nMenu\n\nCapabilities\n\nConsulting\n\nMenu\n\nCapabilities\n\nCybersecurity, Risk and Regulatory\n\nCybersecurity defense and engineering Data risk and privacy Investigations and\nforensics Strategy, risk and compliance Enterprise risk and controls solutions\nEnterprise tech solutions Financial crimes Risk and regulatory - Financial\nservices Risk and regulatory - Health industries\n\nMenu\n\nCapabilities\n\nDeals\n\nAcquisitions Capital markets Divestitures Turnaround and restructuring\nAccounting advisory Alliances Corporate finance Deal analytics Deals strategy\nDigital deals experience Due diligence M&A integration M&A tax Valuation and\nbusiness modeling Value creation\n\nMenu\n\nCapabilities\n\nDigital assets and crypto\n\nMenu\n\nCapabilities\n\nDigital assurance and transparency\n\nAdvanced technologies ERP and other financial systems SOC reporting services\n\nMenu\n\nCapabilities\n\nFinancial statement audit\n\nMenu\n\nCapabilities\n\nGenerative AI\n\nMenu\n\nCapabilities\n\nManaged Services\n\nCorporate Managed Services Risk and Regulatory Managed Services Technology\nManaged Services\n\nMenu\n\nCapabilities\n\nMetaverse\n\nMenu\n\nCapabilities\n\nPwC Private\n\nEmerging companies  Family enterprises Law firms Private equity and portfolio\ncompanies Ultra high net worth individuals US inbounds\n\nMenu\n\nCapabilities\n\nSustainability and ESG\n\nESG reporting Sustainability strategy Sustainable technology and digital\n\nMenu\n\nCapabilities\n\nTax services\n\nMenu\n\nCapabilities\n\nTransformation\n\nCustomer transformation Enterprise strategy and value Operations\ntransformation Workforce transformation Finance transformation\n\nMenu\n\nCapabilities\n\nViewpoint\n\nMenu\n\nCapabilities\n\nAll capabilities\n\nMenu\n\nIndustries\n\nIndustries\n\nConsumer markets Energy, utilities and resources Financial services Health\nindustries Industrial products Technology, media and telecommunications All\nindustries\n\nMenu\n\nIndustries\n\nConsumer markets\n\nHospitality and leisure Retail and consumer products Transportation and\nlogistics\n\nMenu\n\nIndustries\n\nEnergy, utilities and resources\n\nEnergy Mining Power and utilities\n\nMenu\n\nIndustries\n\nFinancial services\n\nAsset and wealth management Banking and capital markets Insurance Private\nEquity\n\nMenu\n\nIndustries\n\nHealth industries\n\nHealth Research Institute Health services Medical technology Pharmaceuticals\nand life sciences\n\nMenu\n\nIndustries\n\nIndustrial products\n\nAerospace and defense Automotive Capital projects and infrastructure Chemicals\nEngineering and construction Forest, paper, and packaging Industrial\nmanufacturing Metals\n\nMenu\n\nIndustries\n\nTechnology, media and telecommunications\n\nMedia Sports Technology Telecommunications\n\nMenu\n\nIndustries\n\nAll industries\n\nMenu\n\nTechnology\n\nTechnology\n\nAlliances and ecosystems Cloud and digital Delivery platforms Emerging\ntechnology Products Tech-enabled services Tech Effect\n\nMenu\n\nTechnology\n\nAlliances and ecosystems\n\nAdobe Amazon Web Services Google Guidewire Microsoft Oracle Salesforce SAP\nWorkday Workiva\n\nMenu\n\nTechnology\n\nCloud and digital\n\nApplication Managed Services Cloud engineering Cloud transformation Data and\nAnalytics Experience Centers Industry Cloud\n\nMenu\n\nTechnology\n\nDelivery platforms\n\nAura Concourse Junction Sightline\n\nMenu\n\nTechnology\n\nEmerging technology\n\nDigital assets and crypto Generative AI Metaverse Responsible AI Web3\n\nMenu\n\nTechnology\n\nProducts\n\nAnalytics Foundation Bookkeeping Connect Connected Solutions Enterprise\nControl Investor Survey Model Edge Next Level HR ProEdge Profit Seeker Ready\nAssess Saratoga Risk Link View all products\n\nMenu\n\nTechnology\n\nTech-enabled services\n\nAgile Commerce Bias Analyzer Carbon Ledger Change Navigator Culture Thumbprint\nESG Decarbonization Toolkit (DT) ESG Geospatial Climate Intelligence (GCI)\nInsights to Enablement Market Advantage Payer Advocacy Center Ready Command\nShovel Ready\n\nMenu\n\nTechnology\n\nTech Effect\n\nMenu\n\nAbout us\n\nAbout us\n\nAlumni Analyst relations Investing in our people Newsroom Offices Our\nleadership Purpose and values The New Equation\n\nMenu\n\nAbout us\n\nAlumni\n\nJoin the PwC Alumni Network Meet our alumni\n\nMenu\n\nAbout us\n\nAnalyst relations\n\nMenu\n\nAbout us\n\nInvesting in our people\n\nMenu\n\nAbout us\n\nNewsroom\n\nMenu\n\nAbout us\n\nOffices\n\nMenu\n\nAbout us\n\nOur leadership\n\nMenu\n\nAbout us\n\nPurpose and values\n\nBe Well, Work Well Diversity and inclusion Environmental sustainability Social\nresponsibility US Public Policy\n\nMenu\n\nAbout us\n\nThe New Equation\n\nFeatured\n\nThe New Equation\n\nTech Effect\n\nMenu\n\nCareers\n\nCareers\n\nWhy PwC Entry Level Careers Experienced Careers University Relations\n\nMenu\n\nCareers\n\nWhy PwC\n\nBenefits & Compensation Our Culture The PwC Professional US Careers Podcast\nhub\n\nMenu\n\nCareers\n\nEntry Level Careers\n\nAdvance Internship Military and Veterans Recruiting process Search\nopportunities Student Development Programs Student programs quiz\n\nMenu\n\nCareers\n\nExperienced Careers\n\nAlumni Careers Contract opportunities Military and Veterans Search\nopportunities\n\nMenu\n\nCareers\n\nUniversity Relations\n\nFaculty Newsletter University Relations\n\nFeatured\n\nShared success benefits\n\nLoading Results\n\nNo Match Found\n\nView All Results\n\n# Choosing the right migration approach for RISE with SAP\n\nOctober 25, 2021\n\nMark Shields  \nSAP S/4HANA and Cloud Transformation Leader, Partner PwC US\n\nRajdeep Sarma  \nDirector, PwC US\n\nRISE with SAP is designed to be a powerful—but simple—way to migrate to SAP\nS/4HANA and the cloud, without the overhead involved in a typical ERP business\ntransformation. By utilizing this streamlined Business Transformation as a\nService offering, customers are able to quickly engage with a subscription-\nbased version of the SAP platform, giving them painless, turnkey access to the\nlatest cloud technologies and features.\n\nBut while RISE with SAP represents a singular end result, there are a few ways\nto get to the finish line. With PwC’s SAP transition framework, our goal is to\nhelp customers understand their options for adopting RISE with SAP and to help\nthem choose the migration approach that works for their particular needs.\n\nFunctionally, we look at three broad transition methodologies:\n\n  * Greenfield: Building a completely new installation of SAP S/4HANA, essentially starting from scratch and defining a wholly new operating model.\n\n  * Brownfield: Commonly referred to as “lift and shift,” brownfield approaches preserve existing enhancements, customizations and data as much as possible by approaching the process as a system and data conversion rather than a replacement.\n\n  * Hybrid: A spectrum of options that create a vast middle ground, often replacing some systems outright while renovating and refreshing others. This approach uses strategies such as selective data migration and selective process renovation and transformation—leveraging the best aspects of both greenfield and brownfield approaches.\n\n#### Key factors that influence the S/4HANA transformation journey\n\nDetermining which of these approaches is right for a customer requires\nanalysis, which we begin by analyzing the strategic needs of the enterprise.\nSome of the top factors that inform that analysis include the degree to which\nthe customer wishes to make processes easier or simpler, the desire to reduce\ncosts and improve return on investment and the need to improve reporting and\ndecision-making. We look at a total of nine strategic and tactical factors as\npart of our recommendation process. Here are some of the top factors that\ninfluence a company’s transition decision:\n\n  \n  \n\n#### PwC benchmark results: Factors influencing the transformation journey to\nS/4 HANA\n\n  \n\nMake processes easier and simpler\n\n%\n\nImprove return on investment (ROI) / Reduce costs\n\n%\n\nImprove reporting and decision making\n\n%\n\nAutomation of controls, security operational risk\n\n%\n\nEnable restructuring of business operation and / or maximize shared service\norganizations\n\n%\n\nImprove cash flow\n\n%\n\nAttract / retain talent with digital work experience\n\n%\n\nImprove tax management and reimbursable processes\n\n%\n\nEnable or streamline Mergres, Acquisition and / or Disestiture\n\n%\n\n  \n\nSource: The Journey Guide to SAP S/4HANA\n\nWhen we examine the responses customers provide when asked about these\nfactors, we are able to hone in on the ideal transition methodology for that\ncustomer. Customers who want to support a future-friendly digital workforce or\nwho wish to simplify the enterprise data model (or operating structure) and\nreduce the total number of business processes used are more likely to benefit\nfrom a greenfield implementation approach. On the other hand, customers who\nwish to minimize the business risk of making organizational changes or want to\nreduce implementation costs are more likely to benefit from a brownfield or\nhybrid approach to adopting RISE with SAP.\n\n#### Typical transition scenarios  \n\nWhat does a RISE with SAP transition look like? Here are a few scenario\narchetypes that fall into our various frameworks:\n\n  * **Greenfield deployment:** A classic greenfield transition offers the greatest opportunity for process improvement and simplification, allowing the enterprise to align its operating structure with leading practices in the market. We generally recommend this option when the quality of data in the existing ERP system is low, or when the current enterprise data model (or operating model) and processes are archaic and inefficient. The goal with a greenfield deployment is to simplify operations by leveraging as many of SAP’s out-of-the-box features as possible, with a focus on standardization and consistency. These deployments generally take the longest, making greenfield the costliest type of transition.\n\n  * **Brownfield deployment:** If an organization has effective existing processes and requires all (or most) of its historical data to be migrated intact—generally for compliance reasons—brownfield often makes sense. We generally recommend this approach when the total amount of data to be migrated is smaller, or when the organization simply has no appetite for change. Brownfield migrations can be done quickly, with minimal disruption to the business, but the overall benefits of SAP tend to be more limited once the transformation is complete.\n\n  * **Hybrid deployment (selective process and data transformation):** While PwC offers a range of hybrid solutions, a typical configuration might include one that maintains 30 to 50% of existing business processes and replaces the remainder with more efficient alternatives, selectively transitioning data as necessary. This type of transition is often recommended when multiple ERPs—some working, some not—are being consolidated on a global scale, giving the customer the flexibility to be selective about which processes and which data are worth keeping. It’s less expensive and costly than a full-scale greenfield transition, balancing migration speed with ROI.\n\nThese are just a few examples of our recommended RISE with SAP migration\ntactics. Additional hybrid frameworks may land closer to a greenfield solution\nfor organizations that want to define a new operating model while leveraging\nexisting capabilities, or closer to a brownfield solution for organizations\nthat desire a quick transition—making fewer architectural changes in order to\nbuild the foundation for a future transformation.\n\n#### How does PwC S/4HANA industrialization help organizations choose the\nright transition approach and execute for RISE with SAP?\n\nOur assessment framework, tools and industry benchmarks are designed to\nilluminate the many considerations every enterprise faces when it comes to an\nSAP S/4HANA transition, weighing numerous criteria to help guide the\norganization on the optimal strategic direction it should take as it begins\nits transformation process.\n\nIn order to help you get on the path to S/4HANA, PwC developed the S/4 Journey\nGuide, a survey-based assessment that can help you quickly determine which\nmigration option may be best for your business.\n\nPwC provides a customized transition offering to help organizations embark on\nthe RISE with SAP journey. Our program includes a vast collection of industry-\nleading frameworks, methodologies and toolsets, plus automation routines for\ncustom code remediation, selective data transition and business downtime\noptimization. Our goal at PwC is to help organizations reap the benefit of\nRISE with SAP in an expedited manner while minimizing overall risk.\n\nIf you would like to learn more about how PwC can help guide your\ntransformation and increase value as you implement RISE with SAP, contact us\nusing the form below.\n\n## Related content\n\nLoading...\n\n24/07/20\n\n####  PwC’s S/4 Journey Guide\n\nReimagine your business and transform your enterprise\n\n11/06/21\n\n####  Unlocking business value through RISE with SAP\n\nWith our comprehensive support for RISE with SAP, PwC is ready to lead clients\nas they transition to SAP S/4HANA and unlock the value of the cloud.\n\nLoading...\n\nFollow us\n\nTrust solutions Consulting Tax services Newsroom Alumni US offices Contact us\n\n© 2017 \\- 2024 PwC. All rights reserved. PwC refers to the PwC network and/or\none or more of its member firms, each of which is a separate legal entity.\nPlease see www.pwc.com/structure for further details.\n\n  * Privacy\n  * Data Privacy Framework\n  * Cookie info\n  * Legal\n  * Terms and conditions\n  * Site provider\n  * Site map\n  * Your Privacy Choices\n\n## Cookies: The choice is yours\n\nWe use cookies to make our site work well for you and so we can continually\nimprove it. The cookies that keep the site functioning are always on. We use\nanalytics and marketing cookies to help us understand what content is of most\ninterest and to personalize your experience. Cookie Notice\n\nCustomize cookie settings Reject all optional cookies Accept and close\n\n## Cookies: The choice is yours\n\nWe use cookies to make our site work well for you and so we can continually\nimprove it. The cookies that are necessary to keep the site functioning are\nalways on. We use analytics and marketing cookies to help us understand what\ncontent is of most interest and to personalize your user experience. You can\nuse the toggle switches below to customize your choices for these optional\ncookies, toggling left to disable cookies in the applicable category and\ntoggling right to enable those cookies. For detailed information on how we use\ncookies and other tracking technologies, please visit our cookie notice.  \nCookie Notice\n\nI accept all cookies\n\n###  Manage Consent Preferences\n\n#### Necessary Cookies\n\nAlways Active\n\nThese cookies are necessary for the website to operate. Our website cannot\nfunction without these cookies and they can only be disabled by changing your\nbrowser preferences.\n\n#### Analytical/Performance Cookies\n\nAnalytical/Performance Cookies\n\nThese cookies allow us to measure and report on website activity by tracking\npage visits, visitor locations and how visitors move around the site. The\ninformation collected does not directly identify visitors. We drop these\ncookies to help us analyze the data.\n\n#### Functional Cookies\n\nFunctional Cookies\n\nThese cookies enable the website to provide enhanced functionality and\npersonalization. They may be set by us or by third party providers whose\nservices we have added to our pages. If you do not allow these cookies then\nsome or all of these services may not function properly.\n\n#### Marketing Cookies\n\nMarketing Cookies\n\nThese cookies help us provide you with personalized and relevant services or\nadvertising, and track the effectiveness of our digital marketing activities.\n\nBack Button\n\n### Cookie List\n\nSearch Icon\n\nFilter Icon\n\nClear\n\ncheckbox label label\n\nApply Cancel\n\nConsent Leg.Interest\n\ncheckbox label label\n\ncheckbox label label\n\ncheckbox label label\n\nConfirm my choices\n\n",
    "links": "[{\"link\": \"https://www.pwc.com/us/en\", \"text\": \"\\n\"}, {\"link\": \"https://www.pwc.com/us/en/content/pwc/userReg/user-details.html?referrerUrl=/content/pwc/us/en/technology/alliances/sap-implementation/rise-with-sap-migration-approach\", \"text\": \"My Account\"}, {\"link\": \"https://login.pwc.com/identity/register?goto=https://www.pwc.com/us/en/technology/alliances/sap-implementation/rise-with-sap-migration-approach.html\", \"text\": \" Register\"}, {\"link\": \"https://www.pwc.com/us/en/technology/alliances/sap-implementation/rise-with-sap-migration-approach.html\", \"text\": \"Choosing the right migration approach for RISE with SAP\"}, {\"link\": \"https://www.pwc.com/us/en/global/forms/contactUsNew.html?parentPagePath=/content/pwc/us/en/contacts/m/mark-shields&style=pwc&territory=us&contactLink=/content/pwc/us/en/contacts/m/mark-shields\", \"text\": \"Mark Shields\"}, {\"link\": \"https://www.pwc.com/us/en/global/forms/contactUsNew.html?parentPagePath=/content/pwc/us/en/contacts/r/rajdeep-sarma&style=pwc&territory=us&contactLink=/content/pwc/us/en/contacts/r/rajdeep-sarma\", \"text\": \"Rajdeep Sarma\"}, {\"link\": \"https://www.pwc.com/gx/en/services/consulting/technology/alliances/sap-business-solutions/rise-with-sap-transend-with-pwc.html\", \"text\": \"RISE with SAP\"}, {\"link\": \"https://www.pwc.com/gx/en/services/consulting/technology/alliances/sap-business-solutions/rise-with-sap-transend-with-pwc.html\", \"text\": \"RISE with SAP\"}, {\"link\": \"https://www.pwc.com/us/en/services/trust-solutions.html\", \"text\": \"Trust solutions\"}, {\"link\": \"https://www.pwc.com/us/en/services/consulting.html\", \"text\": \"Consulting\"}, {\"link\": \"https://www.pwc.com/us/en/services/tax.html\", \"text\": \"Tax services\"}, {\"link\": \"https://www.pwc.com/us/en/about-us/newsroom/press-releases.html\", \"text\": \"Newsroom\"}, {\"link\": \"https://www.pwc.com/us/en/about-us/alumni/our-alumni.html\", \"text\": \"Alumni\"}, {\"link\": \"https://www.pwc.com/us/en/about-us/pwc-office-locations.html\", \"text\": \"US offices\"}, {\"link\": \"https://www.pwc.com/us/en/global/forms/contactUs.en_us.html?parentPagePath=/content/pwc/us/en&style=red\", \"text\": \"Contact us\"}, {\"link\": \"https://www.pwc.com/us/en\", \"text\": \"\"}, {\"link\": \"https://www.pwc.com/us/en/site/privacy.html\", \"text\": \"Privacy\"}, {\"link\": \"https://www.pwc.com/us/en/site/data-privacy-framework.html\", \"text\": \"Data Privacy Framework\"}, {\"link\": \"https://www.pwc.com/us/en/site-information.html\", \"text\": \"Cookie info\"}, {\"link\": \"https://www.pwc.com/us/en/site/legal.html\", \"text\": \"Legal\"}, {\"link\": \"https://www.pwc.com/us/en/site/terms-and-conditions.html\", \"text\": \"Terms and conditions\"}, {\"link\": \"https://www.pwc.com/us/en/site/provider.html\", \"text\": \"Site provider\"}, {\"link\": \"https://www.pwc.com/us/en/site.html\", \"text\": \"Site map\"}, {\"link\": \"https://www.pwc.com/us/en/site/notice-of-right-to-opt-out.html\", \"text\": \"Your Privacy Choices\"}, {\"link\": \"https://www.pwc.com/us/en/site-information.html\", \"text\": \"Cookie Notice\"}, {\"link\": \"https://www.pwc.com/us/en/site-information.html\", \"text\": \"Cookie Notice\"}]"
}