{
    "summary": "__ SearchSAP __ Search the TechTarget Network __\n\nLogin Register\n\nExplore the Network\n\n  * TechTarget Network\n  * ERP\n  * Oracle\n  * Data Management\n  * AWS\n  * Business Analytics\n  * Content Management\n  * HRSoftware\n\n  * SearchSAP\n\n  *     * Data Management\n    * ERP Software\n    * HANA\n    * Infrastructure & Cloud\n    * SAP Developer Tools\n\nOther Content\n\n    * News\n    * Features\n    * Tips\n    * Webinars\n    * 2023 IT Salary Survey Results\n    * More __\n\n      * Answers\n      * Conference Guides\n      * Definitions\n      * Opinions\n      * Podcasts\n      * Quizzes\n      * Tech Accelerators\n      * Tutorials\n      * Videos\n      * Sponsored Communities\n\n  * Follow:\n  * __\n  * __\n  * __\n  * __\n  * __\n\n  * Home\n  * SAP HANA\n\n  * Share this item with your network:\n  * __\n  * __\n  * __\n  * __\n  * __\n\n__\n\n#####  Tech Accelerator\n\n__Download 1\n\nFeature\n\n# SAP S/4HANA migration: A definitive guide\n\n## Implementing S/4HANA comes with significant risk -- yet it also offers a\nreal opportunity for digital transformation. Here's the information and best\npractices to ensure success.\n\n  * __\n  * __\n  * __\n    * __\n    * __\n    * __\n    * __\n\nBy\n\n  * David Essex, Industry Editor\n\nPublished: 10 Mar 2022\n\nSAP turns 50 this year, but the enterprise software pioneer remains firmly\nfocused on the future as it pushes adoption of its next-generation ERP\nplatform, S/4HANA. So much so, it has given customers a 2027 deadline to move\noff their old SAP ERP to S/4HANA.\n\nBut the vendor's looming deadline isn't the only reason to move to SAP\nS/4HANA. According to numerous surveys, most SAP customers are convinced\nenough of the tangible benefits of an SAP S/4HANA migration to either actively\nconsider or plan one. For its part, SAP claims S/4HANA adoption is growing 18%\na year.\n\nStill, an SAP S/4HANA implementation takes a major commitment of time and\nresources and is not to be undertaken without a clear-eyed view of the entire\nprocess.\n\nReading this overview will help you understand the steps, benefits and\nchallenges of an SAP S/4HANA migration. Clicking on the links provides\ndetailed explanations of key terms and best practices.\n\n## __Why migrate to SAP S/4HANA?\n\nPractice leaders at three major consulting firms that are also SAP ERP\nimplementation partners -- Deloitte, EY and IBM -- say companies typically\nmove to S/4HANA because their legacy systems are no longer sustainable or they\nwant a more current ERP system with access to leading-edge technologies.\n\nIn the first three or four years after S/4HANA's 2015 debut, the demand came\nfrom companies with some kind of \"real, immediate, burning platform,\" said\nJesse Rothermel, SAP transformation lead at EY.\n\n\"The house was burning down, and they needed to get out of it: legacy\narchitecture or infrastructure that just didn't work anymore, and disparate\nsystems that were really just not serving the day-to-day needs of the\nbusiness,\" Rothermel said.\n\nMerger and acquisition activity was another early driver of demand for\nS/4HANA, he said. At companies with disparate ERP systems, it made sense to\nconsolidate, while companies that were spun off from their parent companies\nneeded to start fresh on a new ERP.\n\nJesse Rothermel\n\nLately, Rothermel said, EY is seeing more thoughtful, long-term planning by\ncompanies that view S/4HANA as important to their business strategy -- whether\nthat's to become a serial acquirer of companies, divest themselves or reinvent\ntheir business models to become subscription based.\n\n\"When they're looking to reinvent their business, that's when they've found\nthe ability to align to S/4 and actually justify the cost,\" he said.\n\nDecember 2027 is the deadline SAP has set for customers to move to S/4HANA\nfrom its predecessor, Business Suite and its digital core, SAP ERP Central\nComponent (ECC), which it plans to stop supporting in 2030. But that's not why\ncompanies are moving to S/4HANA, asserted Keith Costello, IBM's general\nmanager for global SAP business.\n\n\"It's not about believing whether SAP will stick to the deadline or not. It's\nmore about, 'We've got a business to run, we already run everything on SAP and\nwe're going to continue to run everything on SAP. The question is, what\nversion? How does it support our strategic objectives?'\"\n\n## __What are the benefits of an S/4HANA migration?\n\nThe list of potential SAP S/4HANA benefits is extensive. Most of them derive\nfrom S/4HANA's roots in its underlying SAP HANA in-memory database, which\nspeeds up queries and analytics on potentially large pools of data, both\ninternal and external. The common theme is speed -- especially compared to ERP\non traditional databases.\n\nThe other big batch of potential benefits is enabled by the multi-tenant SaaS\narchitecture of SAP S/4HANA Cloud and close integration with the SAP Business\nNetwork and other cloud-enabled technologies, such as AI -- many of which are\nalso accessible from S/4HANA's other cloud deployment options.\n\nThe most important advantages include the following:\n\n  * real-time analytics on consolidated data;\n  * speedier period-end financial closings;\n  * access to the latest technology, including AI, chatbots and IoT;\n  * automatic updates every quarter;\n  * a simpler UI;\n  * process automation; and\n  * easier-to-update business models.\n\n## __Three SAP S/4HANA migration approaches\n\nOrganizations that move their ERP to S/4HANA have a handful of options that\nvary by how complete the migration process is, whether SAP or an\nimplementation partner provides the consulting services, and whose cloud\ninfrastructure hosts the ERP.\n\nHere are three typical methods.\n\n**Greenfield.** A greenfield deployment is a fresh start: a completely new ERP\nsystem often running on new data center or cloud infrastructure. In some\ncases, it is an organization's very first ERP. More often, though, a\ngreenfield S/4HANA deployment involves a move from another vendor's ERP or an\nolder SAP system. One significant drawback is the work required to translate\nexisting business processes into S/4HANA's way of doing things. Moving data\nfrom the old ERP and training employees on the new system are the other major\nchallenges. But this kind of wholesale move is the best way to get all of\nS/4HANA's purported advantages, such as predictive analytics, AI modeling,\nprocess automation and real-time reporting.\n\nCarsten Hilker\n\n**Starting with S/4HANA Finance.** A very common approach is to start with the\nfinancial module, SAP S/4HANA Finance, and its integration platform, Central\nFinance, and put off the move to other modules. Such a partial migration is\nfeasible because accounting is a classic back-end process that doesn't change\nmuch, according to Carsten Hilker, SAP's global solution owner for S/4HANA\nCentral Finance. \"You can change finance in the background without any\ndisruption. Once you really change the front end -- [for example] logistics --\nyou're talking about logistics processes, customer-facing processes. Finance\nis always the back end. You change the back end once and don't have to do\nanything to mount the logistics.\"\n\nThe S/4HANA Finance-Central Finance move is a so-called _brownfield_ approach,\nthe generic term in IT for continuing to use some legacy components. The SAP\ngreenfield vs. brownfield debate can be helpful in framing the S/4HANA\nmigration discussion.\n\n**Using Rise with SAP.** Billed as \"business transformation as a service,\"\nRise with SAP is a bundle of products and services SAP offers to get customers\nquickly up and running on S/4HANA Cloud and its broader ecosystem, which\nincludes the SAP Ariba procurement network and intelligent business process\nreengineering, among others. The ERP runs on SAP's public cloud or that of a\nhyperscaler, such as Amazon Web Services or Google Cloud Platform. Many of\nSAP's longstanding system integration and implementation partners handle the\nconsulting, development and integration, among them Capgemini, Deloitte, EY,\nIBM and PwC. It's all done under a single contract meant to simplify\nadministration and coordination of the various platforms and vendors.\n\nThe consulting firms also have their own methodologies and tools for SAP\nS/4HANA implementation outside of Rise with SAP. They can automate testing of\nERP program code to determine what can and should move over to S/4HANA. They\nalso offer prebuilt configurations of S/4HANA for certain industries.\n\n__S/4HANA migration involves the usual tradeoffs between brownfield and\ngreenfield deployments.\n\n__\n\n## __How to choose your S/4HANA migration approach\n\nThe choice of migration method -- say, S/4HANA Finance vs. some other\nbrownfield approach -- usually comes up in the design phase of planning the\nimplementation when you set the strategy and roadmap.\n\nSAP and its consulting partners each offer rigorous strategy and planning\nprocesses for analyzing the factors that determine which migration method is\nbest. It's often called _phase zero_ and aligns with the early stages of SAP's\nActivate methodology. The terminology varies, but here are the key steps:\n\n  * **Evaluate the current system.** Also called _discovery_ or _readiness assessment_ , this involves assessing the existing ERP system itself, its data and the business processes they impact, often with statistics to quantify their efficiency. Licensing and maintenance costs are also considered, and users share their pain points. IT takes an inventory of custom code and analyzes master data.\n  * **Review the architecture.** Here, you determine how your existing ERP modules and business processes map to the available S/4HANA modules and deployment options and decide which ones to leave behind.\n  * **Analyze the future state.** In this step, you envision what the new ERP should do based on requirements gathered from users, department heads, executives and other stakeholders. You also try to quantify the benefits, such as cost savings from consolidating ERP systems or launching a new e-commerce business. The information feeds into the ERP business case, which is usually one of the next steps.\n\n## __Choosing an S/4HANA deployment option\n\nSAP has long claimed S/4HANA is a complete rewrite of Business Suite to the\ntune of 400 million lines of program code. What has gradually become clear\nover the years, despite SAP's marketing claims and mixed messages, is that the\non-premises version of S/4HANA does not yet cover all of the major functional\nareas in Business Suite. The most glaring example is human capital management,\nwhich SAP has bluntly said will only be available on SuccessFactors, a\nseparate SaaS HCM suite it acquired years ago, or an upcoming \"sidecar\" based\non the previous-generation SAP HCM that will run on HANA.\n\nOther important SAP S/4HANA modules have been added since the initial rollout\nof Finance, such as Sales and Distribution, Production Planning, Sourcing and\nProcurement, and Supply Chain Management.\n\nThe divergence between on-premises Business Suite and on-premises S/4HANA can\nbe mission critical to many enterprises, which is why it is essential to\nscrutinize S/4HANA's capabilities. Often, the decision comes down to whether\nto exchange longstanding customizations for the standardized processes, best\npractices, real-time analytics and leading-edge technology that S/4HANA\noffers.\n\nThe differences from legacy SAP ERP are usually even more pronounced with\nS/4HANA Cloud, the version that runs on the purest form of cloud: multi-tenant\nSaaS. S/4HANA Cloud is a significantly streamlined, somewhat generic and\nmostly noncustomizable version of S/4HANA. Understanding what S/4HANA Cloud\ndoes and doesn't do is absolutely vital when deciding whether to buy it.\n\n\"It's mature and well beyond what I ever imagined in the last five years,\"\nRothermel said, adding that it is nonetheless still targeted at smaller\ncompanies that can use software out of the box. It also works well in two-tier\nERP, where a company already runs ECC -- typically in headquarters -- and\nneeds to extend its SAP environment quickly to a new market or business unit.\n\nKeith Costello\n\nIBM's Costello said the decision whether to buy S/4HANA Cloud usually comes\ndown to the size of the company, the complexity of its operations, whether\nthose operations are global, and the specific industry.\n\n\"The SaaS version has been proven to be very effective in professional\nservices organizations and probably others where it's been deployed, but I\ndon't think it's been deployed to run an entire Fortune 500 company,\" Costello\nsaid. \"That's not what it's built for yet.\"\n\nIf adopting multi-tenant SaaS ERP is a goal in itself, or perhaps S/4HANA\nseems like too risky a bet, SAP offers another option: Business ByDesign,\nwhich it markets to SMBs. More than 11,000 customers use it, according to SAP,\nwhich continues to update the product and publish a roadmap of planned\nimprovements. Carefully comparing SAP Business ByDesign vs. S/4HANA before\ncommitting to the latter, which is more complex and expensive but also more\ncapable, could save significant time and money.\n\nSAP S/4HANA alternatives are worth a look when buying from SAP is not a\npriority. Oracle Fusion Cloud ERP from archrival Oracle is among the leaders\nin full-featured SaaS ERP alongside Workday, which focuses more narrowly on\nSaaS HR and financials. Oracle's other product lines include SaaS-based\nNetSuite, which targets SMBs, and the on-premises E-Business Suite and JD\nEdwards, which have large installed bases in manufacturing and remain viable\noptions. Other prominent brands, some of which continue to update on-premises\nmanufacturing and supply chain suites that rival SAP and Oracle products while\ndirecting most new investment to SaaS, include Epicor, IFS, Infor, Microsoft,\nQAD and Unit4.\n\nBesides the on-premises version and S/4HANA Cloud, there are three more\nS/4HANA deployment options: Private Edition, Extended Edition and Any Premise.\nAll three are the on-premises S/4HANA code running on some type of cloud\ninfrastructure. They differ mostly on whether they run in SAP data centers or\na third-party cloud provider’s and where that cloud infrastructure is\nphysically located.\n\n## __What are common migration challenges?\n\nComplex legacy landscapes, a high degree of customization and unclean master\ndata are the top three SAP S/4HANA migration challenges, according to a survey\nby PwC and LeanIX, a maker of enterprise architecture tools.\n\n__Top three challenges of S/4HANA migration, according to a survey by PwC and\nLeanIX.\n\n__\n\nAnother big challenge is figuring out during phase zero whether the platform\nhas the ERP functions the business needs. It involves closely examining the\nfeatures of the S/4HANA modules that align with the business -- say,\nprocurement, supply chain management and accounting -- and trying to map the\nspecific actions and workflows of the existing ERP to S/4HANA.\n\nFor Chip Kleinheksel, principal and global SAP CTO at Deloitte Consulting,\nbusiness adoption and change management are the biggest challenges, especially\nin greenfield deployments. Companies are spread thin across multiple\ninitiatives, so it's critical to pay close attention to adoption and change\nmanagement to ensure that the project delivers value and enables digital\ntransformation.\n\nOrganizations also typically struggle with data and integration, he said,\nbecause legacy IT landscapes can be extremely complex with a mix of on-\npremises, SaaS and private cloud applications that have to be integrated with\nthe new ERP.\n\n\"Establishing an inclusive integration layer and a common data model is\nnecessary to break down the silos across applications for integration to and\nfrom the newly migrated S/4HANA ERP,\" he said.\n\n## __Key steps and considerations to a successful SAP S/4HANA migration\n\nEvery S/4HANA project demands close attention to the steps outlined above for\ndeciding on a migration approach and choosing a deployment option. Kleinheksel\noffered the following high-level advice for keeping them on track:\n\nChip Kleinheksel\n\n  1. **Have a well-thought-out roadmap.** \"We've found taking the time to execute a phase zero to align on scope, business engagement, future state technical landscape and deployment is extremely helpful,\" Kleinheksel said, referring to Deloitte's early-stage process. \"It doesn't have to be a static roadmap. It's OK if it changes over time to continue to align with business priorities.\"\n  2. **Don't get stuck in the past.** Kleinheksel stressed the importance of not trying to recreate the old configuration and holding on to technical debt: i.e., the neglected infrastructure, training and documentation that older ERP systems tend to accumulate. Preconfigured industry applications, \"accelerators\" and automated processes -- things Deloitte and competitors provide -- can help S/4HANA adopters put all that behind, he said, so they can focus on using the capabilities of next-generation ERP.\n  3. **Avoid recreating the old mistakes in S/4HANA.** There's also a risk of building up future technical debt with S/4HANA, according to Kleinheksel. It helps to establish a governance model at the beginning that specifies where software extensions are best suited, not just in S/4HANA but in other parts of the SAP ecosystem, such as the Business Technology Platform -- the collective name for the cloud, analytics, AI, machine learning and integration tools and platforms from which S/4HANA gets much of its mojo. Doing so will produce a more agile technology stack and avoid burdening and prematurely aging S/4HANA as a development platform, he said.\n\n## __More migration best practices\n\nCostello shared these tips for ensuring a successful SAP S/4HANA migration:\n\n  1. **Use what's already available.** No need to start from scratch if you can buy an S/4HANA extension, for example, instead of having one developed.\n  2. **Think long term.** Anticipating what you might need from S/4HANA in several years can avoid getting locked into an inflexible model that requires overengineered, customized systems.\n  3. ******Avoid customization.** Costello said some IBM clients set a goal of zero customization when designing their S/4HANA migration projects. It usually requires being willing to use out-of-the-box functions.\n  4. ******Set a time limit.** Previous ERP implementations took a long time, and setting a goal of completing one in a year could induce panic. But with SAP and its partners offering prebuilt templates, it's possible to get some parts of the business running on S/4HANA in six months. Setting a one-year time frame requires having a strong change management process that includes hands-on experience so users can see how the software really works.\n\n## __Choosing an S/4HANA implementation partner\n\nDozens of implementation partners have long histories with SAP that predate\nS/4HANA by decades. Choosing the right one for your organization requires due\ndiligence. Here is the consensus expert advice:\n\n  * Look for a strong selection of deployment methodologies, automated testing and data migration tools.\n  * Ask how many people will be assigned to the project, and which of them will be working exclusively for you.\n  * Check for SAP S/4HANA certification, an indicator not just of education but of experience in S/4HANA implementation.\n  * Talk to references with similar projects, ideally in the same industry.\n  * Ask what kind of support is available after the new system goes live and whether it costs extra.\n  * Insist on guarantees that the project won't be late or go over budget.\n\nClose collaboration between your internal project team, SAP and its partner,\nall working from a detailed roadmap, can go a long way toward ensuring a\nsuccessful S/4HANA deployment.\n\n### Hear more from the S/4HANA implementation partners\n\nOrganizations considering an S/4HANA migration often turn to an SAP\nimplementation partner to help them with the complexities, from initial\nresearch through planning, system design, testing and deployment.\n\nThis podcast has excerpts from the interviews with the S/4HANA consultants\nquoted in the article: Chip Kleinheksel of Deloitte, Jesse Rothermel of EY and\nKeith Costello of IBM.\n\nDownload this podcast\n\n####  __Dig Deeper on SAP HANA\n\n  * ##### New Rise with SAP program targets barriers to cloud moves\n\nBy: Jim O'Donnell\n\n  * ##### Move to S/4HANA or not? Some real-world experiences\n\nBy: Linda Rosencrance\n\n  * ##### SAP S/4HANA implementation partners on cloud vs. on premises\n\nBy: David Essex\n\n  * ##### Rise with SAP vs. S/4HANA Cloud: What are the differences?\n\nBy: James Kofalt\n\nLatest TechTarget resources\n\n  * ERP ____\n  * Oracle ____\n  * Data Management ____\n  * AWS ____\n  * Business Analytics ____\n  * Content Management ____\n  * HR Software ____\n\nERP\n\n  * __5 use cases for edge computing in manufacturing\n\nEdge computing's capabilities can help improve various aspects of\nmanufacturing operations and save companies time and money. ...\n\n  * __Industrial 3D printing matures but faces steep climb ahead\n\nIndustrial 3D printing vendors are bolstering their products just as use cases\nand factors such as supply chain disruptions show ...\n\n  * __6 industrial metaverse use cases for manufacturing\n\nIndustrial metaverse use cases for manufacturing include facility design and\nemployee training, though adoption of the technology...\n\nSearchOracle\n\n  * __Oracle sets lofty national EHR goal with Cerner acquisition\n\nWith its Cerner acquisition, Oracle sets its sights on creating a national,\nanonymized patient database -- a road filled with ...\n\n  * __With Cerner, Oracle Cloud Infrastructure gets a boost\n\nOracle plans to acquire Cerner in a deal valued at about $30B. The second-\nlargest EHR vendor in the U.S. could inject new life ...\n\n  * __Supreme Court sides with Google in Oracle API copyright suit\n\nThe Supreme Court ruled 6-2 that Java APIs used in Android phones are not\nsubject to American copyright law, ending a ...\n\nData Management\n\n  * __Healthcare industry shows importance of data interoperability\n\nData interoperability facilitates the quick and easy exchange of information\nbetween different systems or applications. Its use ...\n\n  * __Collibra launches AI Governance, unveils GenAI capabilities\n\nThe vendor's AI Governance suite enables users to ensure the quality and\nsecurity of AI models while new GenAI features let them ...\n\n  * __Coalesce raises $50M to expand data transformation platform\n\nThe startup's new funding is a vote of confidence from investors given how\ndifficult it has been for technology vendors to secure...\n\nSearchAWS\n\n  * __AWS Control Tower aims to simplify multi-account management\n\nMany organizations struggle to manage their vast collection of AWS accounts,\nbut Control Tower can help. The service automates ...\n\n  * __Break down the Amazon EKS pricing model\n\nThere are several important variables within the Amazon EKS pricing model. Dig\ninto the numbers to ensure you deploy the service ...\n\n  * __Compare EKS vs. self-managed Kubernetes on AWS\n\nAWS users face a choice when deploying Kubernetes: run it themselves on EC2 or\nlet Amazon do the heavy lifting with EKS. See ...\n\nBusiness Analytics\n\n  * __Customer segmentation analytics evolve with GenAI, ML\n\nGenAI, machine learning and advanced analytics techniques automate time-\nconsuming aspects of customer segmentation, freeing up ...\n\n  * __Google Cloud to inject Gemini into data, analytics tools\n\nThe tech giant unveiled integrations between its LLM and BigQuery, Looker and\nits databases to provide customers with a ...\n\n  * __AI assistant from Tableau targets efficiency, deep analysis\n\nThe analytics vendor's copilot can recommend questions that might lead to\notherwise undiscovered insights as well as understand ...\n\nContent Management\n\n  * __Adobe intros new GenAI tools and apps for marketers\n\nThe new applications and tools are for marketers looking to connect the\ndifferent processes of the content supply chain in a safe...\n\n  * __8 top enterprise search engines\n\nWhether an organization wants to improve its internal or external search\nstrategies, an enterprise search engine can help users ...\n\n  * __The importance of ethics in information management\n\nAdvancements in data collection and processing may tempt information\nmanagement professionals to use as much customer data as ...\n\nHRSoftware\n\n  * __White-sounding names have edge in hiring, bias study says\n\nA recent study exposes ongoing racial bias in hiring practices, showing that\nwhite-sounding names are often preferred, with a ...\n\n  * __Learn how to improve employee survey response rates\n\nEmployee feedback is a valuable tool for every organization, yet workers may\nnot feel motivated to fill out surveys. Learn how to...\n\n  * __As AI expands, big tech to upskill, reskill 100M people\n\nCisco, Google, IBM, Microsoft and others will work to train 100 million people\nin digital skills by 2032. Details are lacking, ...\n\n  * About Us\n  * Editorial Ethics Policy\n  * Meet The Editors\n  * Contact Us\n  * Advertisers\n  * Partner with Us\n  * Media Kit\n  * Corporate Site\n\n  * Contributors\n  * Reprints\n  * Answers\n  * Definitions\n  * E-Products\n  * Events\n  * Features\n\n  * Guides\n  * Opinions\n  * Photo Stories\n  * Quizzes\n  * Tips\n  * Tutorials\n  * Videos\n\nAll Rights Reserved,  Copyright 2000 - 2024, TechTarget  \n  \nPrivacy Policy  \nCookie Preferences  \nCookie Preferences  \nDo Not Sell or Share My Personal Information\n\nClose\n\n",
    "links": "[]"
}