{
    "summary": "Skip to main content\n\nSopra Steria Group\n\n  * Sopra Steria Netherlands\n\n  * Sopra Steria Belgium\n\n  * Sopra Steria Luxembourg\n\n  * Tobania\n\n  * * * *\n\n  * Sopra Steria Austria\n  * Sopra Steria Denmark\n  * Sopra Steria Germany\n  * Sopra Steria France\n  * Sopra Steria India\n  * Sopra Steria Italy\n  * Sopra Steria Norway\n  * Sopra Steria Poland\n  * Sopra Steria Spain\n  * Sopra Steria Sweden\n  * Sopra Steria Switzerland\n  * Sopra Steria United Kingdom\n  * * * *\n\n  * Sopra Banking Software\n  * Sopra HR Software\n  * CIMPA \n\n  * Who we are\n\n    * Who we are\n\n    * * * *\n\n    * Strategy\n    * Social responsibility\n    * News\n\n  * What we do\n\n    * What we do\n\n    * * * *\n\n    * Our approach\n    * Focus areas\n    * Who we work with\n    * Partnerships\n\n  * Insights\n\n    * Insights\n\n    * * * *\n\n    * Latest\n    * White Papers\n    * Podcasts\n\n  * Careers\n\n    * Careers\n\n    * * * *\n\n    * Events\n    * Explore jobs\n    * Join us, be you\n    * Make a difference in...\n    * A day in the life\n    * How we hire\n\n  *   * Investors\n\n    * Investors\n\n    * * * *\n\n    * News\n    * Events\n    * General meeting\n    * Governance\n    * Reports\n    * Investor relations\n\n  * Let's talk\n\nPopular\n\nTry \"jobs\"Try \"high performance teams\"Try \"customer stories\"\n\n# Step by step guide for a SAP S/4 HANA data migration\n\nAre you on the brink of an SAP S/4HANA public cloud migration, seeking a\nreliable guide through the complexities? Our blog is your essential companion\non this transformative journey.\n\nWe delve deep into the nuances of SAP's Migration Cockpit, offering expert\ninsights, practical tips, and real-world solutions. Whether you're a seasoned\nSAP professional or a business owner embarking on digital transformation, our\nblog provides a comprehensive resource hub.\n\nWe decode the intricacies, address common challenges, and keep you updated\nwith the latest trends, ensuring your migration process is smooth, efficient,\nand successful. Join us and empower your migration strategy with knowledge,\nconfidence, and a community of experts. Don't just migrate, transform with us!\n\nIn the ever-evolving landscape of enterprise technology, data migration plays\na pivotal role in ensuring smooth transitions, system upgrades and business\nprocess optimization. SAP, offers a powerful tool called the Data Migration\nCockpit to facilitate seamless data migration.\n\nIn this blog post, we will delve into the intricacies of SAP's Migration E2E\nprocess providing you with a comprehensive guide on how to migrate data\neffortlessly and efficiently.\n\nThe process consists of the following points:\n\nThe complete process can be converted to 3 major topics\n\n  * Pre-migration actions (Select Migr. Obj., Get Data, Map & Transform)\n\n  * Migrating the data, through Migration Cockpit (Simulate, Migrate)\n\n  * Post-migration actions (Checks in destination system and testing)\n\n# Pre-migration actions/steps  \nStep 1: Migration Strategy\n\nIt is important to determine a Migration Strategy on how the data is\ntransferred from the legacy system to the new system as early as possible.\n\nOne area where SAP S/4HANA Cloud (SAP S/4HC) implementations are different\nthan OnPremise implementations is in the area of data migration. Customers and\npartners who have previously implemented OnPremise versions of SAP software\nare often used to repeating the same data loads again and again. This approach\nof loading the same set of file(s) repeatedly is done in order to perfect the\ndata quality and optimize the loads from a performance perspective.\n\nTechnically, this is achieved either by restoring the SAP system to a state\njust before the test execution cycle or by refreshing the test client from a\ngolden client. However, these concepts of client and/or system refresh do not\nexist in SAP S/4HC and different strategies are used to successfully test data\nmigrations before production loads.\n\nThere are many influencing factors that could drive the appropriate approach\nfor a specific system. Some factors to consider include, but are not limited\nto:\n\n  * Amount of business data to be transferred and converted\n\n  * Permitted business downtime\n\n  * Data changes in scope during migration\n\n  * Type of data in scope for migration\n\n  * Business data quality of the source system\n\n  * Check customizing\n\n  * …\n\nThere are two types of data for migrations-master data and transactional data.\nTypically, the challenges are faced with master data because you cannot keep\nloading the same datasets over and over due to primary key constraints (i.e.\nproduct number, business partner number, etc). Transactional data generates a\nnew number on documentation creation (i.e. sales order number) and can usually\nbe loaded multiple times although there are some considerations here as well\n(for example, legacy document number no longer being unique in SAP S/4HC).\n\nThe first key point before outlining some options is that prior to loading any\ndata into S/4HC, both the IT and business teams should review the data in the\nmigration templates to make sure it is complete and spot check it for\naccuracy. This will help to identify some issues that can be corrected prior\nto system loading and is often an overlooked step. This will save you the\nunfortunate circumstance of loading in data that is not correct and now needs\nto be corrected in the system but cannot be loaded again.\n\nHere are some approaches for data migration in SAP S/4HC that customers have\nused to date:\n\n  1. Incremental loading of data by starting small and growing the datasets with each subsequent load. In this approach, the data is migrated in small increments until confidence levels grow for a large volume test. For example, load 1 BP, then another 5, then 15, 25, 50, etc. until you load it in a large set of several thousand. After each incremental data load is completed, you should review the data and process a few transactions through the system to make sure nothing was missed and the data is accurate. Then, make any corrections required and load the next incremental data set.\n\n  2. Use DEV system to test data loads before the TEST system. If you have a 3 system landscape for SAP S/4HANA Cloud, you can tune your data loads in the DEV system before testing in the TEST system. This will give you an opportunity to work out any data quality issues in advance of the final tests in the TEST system.\n\n  3. Use a prefix on the master data. In this approach, for each load a prefix is added to the data with 1-2 characters that don’t already exist for master data so you can exclude it if required when using apps in the system. If there is a lot of linked data, this approach would require a little bit of extra work to Find and Replace in each template that has linked data like Customers to Sales Pricing and Sales Orders. The advantage to this approach is that it gives you the capability to load in the same datasets. However, one drawback to this approach is that you end up with a lot of junk data in your TEST system.\n\nFor all migration projects each approach is valid, nevertheless each approach\nshould be analyzed against the system architecture and the flow of data that\nhave an impact on the migration.\n\n## Step 2: Select Migration Objects\n\nOnce the how question is answered you need to determine where all the data is\ncoming from and what kind of data (master data, transactional data, financial\ndata and historical data) is required to be transferred from the legacy system\nto the SAP Cloud system. This overview/strategy is created in association with\nthe process owners and business owners.\n\nTo be able to determine the required data all future processes and setup of\nthe final system should be known and/or in progress.\n\nOnce all data has been determined you can find the relevant migration objects\nrelated to the data.\n\nThe complete list of migration objects can be found via the following links.\n\nAvailable migration objects SAP S/4HANA\n\nAvailable migration objects SAP S/4HANA Cloud\n\nCloud overview\n\n## Step 3: Get Data from legacy system(s) and perform data quality checks\n\nHistory shows us that legacy data can be spread across different data sources\nall with their own structures and key fields.\n\nThese sources can consist of:\n\n  * ERP systems from different legal entities\n\n  * Third-party ERP Systems\n\n  * Microsoft products\n\n  * ….\n\nTo support the project during the migration process you can opt to use your\nown ETL tool or to make use of the “Ordina solution - Data Migration OSDM)”.\n\nExternal links:\n\nData migration - Towards a correctly functioning new information system\n\nDatamigratie: naar een correct werkend nieuw systeem\n\nDatamigration: Big bang or dripping data\n\nDatamigratie: big-bang of druppelen\n\nWhen choosing the “Ordina Solutions – Data Migration (OSDM)”, it will help you\nto perform the following tasks:\n\n  * Perform data quality checks\n\n  * Transform data based on business rules\n\n  * Same business rules will apply for Development, Quality and Production\n\n  * Regenerate the content for the upload structures\n\n  * Provide the required audit trails and reports\n\nThe retrieval and quality checks of the data from the legacy system should be\ndone on a regular basis during the life of the project. This should start as\nearly as possible.\n\nIn an ideal world the data should be retrieved from the production legacy\nsystem.\n\nThis is an iterative process until the quality is good enough for go-live.\n\n## Step 4: Map & Transform data into the correct migration object structures\n\nOnce the structure of the different processes has been identified, you can\nmove on to the mapping and transformation of the legacy data into the upload\nsheets.\n\nFor each selected migration object, the mapping and transformation rules\nshould be determined and approved by the business owners.\n\nYou have different options to fill the migration object structures:\n\nThe XML files or CSV files?\n\nEach file has its own purpose. The XML file is used when the migration\nconsultant or Business owner fills the file by hand. This can be helpful when\nperforming some simple tests or checks. When using an ETL tool you can make\nuse of the CSV structure.\n\nWithin the migration strategy it was decided what ETL tool will be used to\nimplement the mapping and transformation rules. With this setup we can request\nnew upload files when some rules change during the project.\n\nThe following changes need to be communicated to or checked by the migration\nconsultants:\n\n  * New custom fields\n\n  * Process changes that have an impact on the migration\n\n  * SAP modifications on the migration object structures\n\n# Migrating the data, through Migration Cockpit (Simulate, Migrate)\n\n## Understanding SAP's Migration Cockpit\n\nSAP's Migration Cockpit is a user-friendly tool designed to simplify the data\nmigration process. It allows businesses to migrate their data from various\nsources into SAP S/4HANA or other SAP systems. The Migration Cockpit supports\nboth cloud and on-premise implementations, making it a versatile solution for\nbusinesses of all sizes.\n\n## Prerequisites\n\nBefore diving into the migration process, ensure that you have the following\nprerequisites in place:\n\n  * Access to SAP S/4HANA or the target SAP system\n\n  * Data Source: Prepare the data to be migrated in compatible file formats such as CSV, Excel, or XML.\n\n  * Migration Objects: Identify the specific data objects you want to migrate (e.g., customers, vendors, materials) and understand their relationships.\n\n  * Request the required authorizations (Migration Cockpit & Change/create for the selected data objects)\n\n## Step 1: Accessing the Migration Cockpit\n\nLog in to your SAP system using appropriate credentials.\n\nNavigate to the Migration Cockpit by accessing it through the SAP Fiori\nLaunchpad.\n\n## Step 2: Creating a Migration Project\n\nClick on Create to start a new migration project.\n\nEnter a project name and select the migration object that corresponds to the\ndata you want to migrate.\n\nDefine the source and target structures, mapping the fields from the source\nfile to the corresponding fields in the SAP system.\n\n## Step 3: Data Upload and Mapping\n\nUpload your source data file into the Migration Cockpit.\n\nPerform field mapping, ensuring that data from the source file is correctly\nmapped to the target fields in the SAP system.\n\nIf required you can download all mapping values and populate  the values\naccording to the mapping sheet.\n\nValidate the mapping to identify and rectify any errors or inconsistencies.\n\n## Step 4: Data Simulation and Migration\n\nRun a simulation to preview the migration process and identify potential\nissues.\n\nReview the simulation results and make necessary adjustments to the mapping\nand data.\n\nOnce satisfied with the simulation, execute the migration process to transfer\nthe data into the SAP system.\n\n# Post-migration actions (Checks in destination system and testing)\n\nThis part of the migration process is always underestimated. IT and business\nneed to take the necessary time to handle all post-migration actions and run\nthe predefined test cases.\n\nTo be able to use the migrated data within your testing runs some actions\nneeds to be done:\n\n  * The recommendation of SAP is that you do not migrate historical data, with the exception of some financial data. When historical data is required to be migrated (ex: monitoring of the % of completeness of a contract or a project) you should load the already processed amounts together with the unprocessed amounts. Afterwards already processed amounts need to be handled and financially reversed.\n\n  * Validate the migrated data within the SAP system to ensure accuracy and completeness.\n\n  * Perform necessary data reconciliation and cross-checks to verify the integrity of the migrated data.\n\nAfter conducting the required E2E business process testing with newly created\ndata the same tests need to be carried out with migrated data. Both tests must\nbe successful to be able to sign off the migration files.\n\n **Useful links**\n\nSAP Note 2538700 is the master FAQ note for migrating data using the SAP\nS/4HANA Migration Cockpit for SAP S/4HANA Cloud.\n\n **Conclusion**\n\nSAP's Migration Cockpit empowers businesses to achieve seamless data\nmigration, enabling them to harness the full potential of their SAP systems.\nBy following the step-by-step guide outlined above and leveraging the\ncapabilities of the Migration Cockpit, organizations can streamline their data\nmigration processes, minimize risks, and pave the way for successful digital\ntransformations. Embrace the power of SAP's Migration Cockpit and embark on a\njourney towards data migration excellence.\n\n _Renaat van Dorp – Senior SAP consultant at Ordina_\n\n _Jasper Heinsbroek – Practice Lead SAP at Ordina_\n\n## Would you like more information on this topic? Get in touch.\n\nLet's talk\n\n* * *\n\nDanny Nooyens\n\nBusiness unit director SAP\n\ndanny.nooyens@ordina.be\n\n+32 496 57 44 05\n\n#### Explore\n\n  * Who we are\n  * What we do\n  * Our approach\n  * Focus areas\n  * Who we work with\n\nExplore\n\n  * Who we are\n  * What we do\n  * Our approach\n  * Focus areas\n  * Who we work with\n\n* * *\n\n#### Careers\n\n  * A Career at Ordina\n  * Events\n  * Find jobs\n  * Make a difference in...\n  * Life at Ordina\n  * Diversity & Inclusion\n  * How We Hire\n\nCareers\n\n  * A Career at Ordina\n  * Events\n  * Find jobs\n  * Make a difference in...\n  * Life at Ordina\n  * Diversity & Inclusion\n  * How We Hire\n\n* * *\n\n#### Invest\n\n  * Investors\n  * Reports\n  * Financial News\n  * Events\n  * Governance\n  * Investor Relations\n\nInvest\n\n  * Investors\n  * Reports\n  * Financial News\n  * Events\n  * Governance\n  * Investor Relations\n\n* * *\n\n#### Get in touch\n\n  * Contact\n  * Locations\n\nGet in touch\n\n  * Contact\n  * Locations\n\n* * *\n\n#### Socials\n\n* * *\n\n  * Privacy & Cookie Policy\n  * Disclaimer\n  * Copyright\n  * Manage cookies\n\nCopyright © 2024 Ordina\n\n",
    "links": "[{\"link\": \"https://www.ordina.com/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/who-we-are/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/who-we-are/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/who-we-are/strategy/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/who-we-are/social-responsibility/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/who-we-are/news/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/what-we-do/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/what-we-do/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/what-we-do/our-approach/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/what-we-do/focus-areas/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/what-we-do/who-we-work-with/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/what-we-do/partnerships/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/insights/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/insights/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/insights/latest/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/insights/white-paper-overview/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/insights/overview-podcasts/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/careers/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/careers/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/careers/career-events/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/job-search/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/careers/join-us-be-you/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/careers/make-a-difference-in/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/careers/a-day-in-the-life/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/careers/how-we-hire/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/investors/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/investors/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/investors/news/overview/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/investors/events/financial-calendar/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/investors/governance/general-meetings/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/investors/governance/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/investors/reports/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/investors/investor-relations/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/lets-talk/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/insights/data-migration\", \"text\": \"Data migration - Towards a correctly functioning new information system\"}, {\"link\": \"https://www.ordina.com/insights/data-migration-big-bang-or-dripping-data\", \"text\": \"Datamigration: Big bang or dripping data\"}, {\"link\": \"https://www.ordina.com/lets-talk/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/who-we-are/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/what-we-do/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/what-we-do/our-approach/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/what-we-do/focus-areas/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/what-we-do/who-we-work-with/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/who-we-are/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/what-we-do/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/what-we-do/our-approach/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/what-we-do/focus-areas/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/what-we-do/who-we-work-with/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/careers/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/careers/career-events/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/job-search/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/careers/make-a-difference-in/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/careers/a-day-in-the-life/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/who-we-are/social-responsibility/diversity-inclusion/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/careers/how-we-hire/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/careers/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/careers/career-events/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/job-search/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/careers/make-a-difference-in/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/careers/a-day-in-the-life/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/who-we-are/social-responsibility/diversity-inclusion/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/careers/how-we-hire/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/investors/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/investors/reports/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/investors/news/overview/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/investors/events/financial-calendar/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/investors/governance/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/investors/investor-relations/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/investors/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/investors/reports/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/investors/news/overview/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/investors/events/financial-calendar/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/investors/governance/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/investors/investor-relations/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/lets-talk/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/locations/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/lets-talk/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/locations/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/privacy/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/disclaimer/\", \"text\": \"\"}, {\"link\": \"https://www.ordina.com/copyright/\", \"text\": \"\"}]"
}