{
    "summary": "Skip to Content\n\nSearch Magnifying Glass\n\nSearch for: Close Search ×\n\n  * Home\n  * About\n  * Recipes\n    * Healthy\n      * Drinks\n      * Smoothies\n      * Sugar Free\n      * Vegetarian\n    * Breakfast\n      * Eggs\n      * Muffins\n      * Pancakes\n    * Lunch\n      * Salads\n      * Sandwiches\n      * Snacks\n      * Soup\n    * Dinner\n      * Chicken\n      * Lamb\n      * Pasta\n      * Quick and Easy\n      * Sauces\n      * Seafood\n      * Vegetarian\n    * Dessert\n      * Bars\n      * Cakes\n      * Cookies\n      * Tarts\n    * Local Favourites\n    * Bread\n    * Appetizers\n    * Sides\n  * Life\n  * Miscellaneous\n  * Contact\n  * Instagram\n  * Facebook\n\n# Homemade Durban Masala\n\n35 Comments\n\nThis **Homemade Durban Masala** was my little creation for my online store. I\nexperimented a little until I got that perfect mix. Although I didn’t enjoy\nthe online store and all those goes into it. One thing I am satisfied with is\nthe fact that I got to try out new things. My **Homemade Durban Masala** did\nsell very well and everyone that purchased it told me it was amazing.\n\nRecently I chatted to the owner of a very popular chain of spice stores. I\nmust say I wasn’t surprised by what he told me but disgusted nevertheless. He\ntold me that a lot of spice stores add salt to their masala mix. The reason\nthey do this is obviously to bulk up their masala and sell more. It is the\nreality of things. There are business owners that are so consumed by greed\nthat they would compromise on quality.\n\nAfter my chat I swore I am never buying masala again. I would rather take some\ntime, roast and grind my own spices. At least that way I know all my\ningredients are fresh and I know exactly what goes into it. Trust me it is not\ndifficult to make your own masala.\n\nYou can also store your masala for a month in an airtight container in a cool\nplace. If you make your masala in bulk you can freeze it for up to 6 months. I\nhave in the past stored my masala in the freezer and it I’ve had no problems.\n\nYou don’t have to do all the work, that goes into making the masala, at once.\nYou can roast and grind the spices ahead of time. That way when you ready to\nmake your masala it doesn’t become a tediuos task.\n\nI created this masala, especially, for those that struggle with adding the\nright balance of spices to their curries. This Homemade Durban Masala works\nperfectly well on it’s own, without the added spices. You can however, add\nsome whole spices (cinnamon, cardamom, cloves, bay leaf, star aniseed, black\ncardamom) for that added flavour.\n\nAs you make your own masala you can try and balance the flavours the way you\nlike it. You can add less cumin, more coriander, some crushed cloves…whatever\nworks for your palate. There’s no hard and fast rule in terms of making a\nmasala.\n\nHave you ever been to a spice bar and watched those aunties mix your\nmasala…haha! I have never seen them measure anything. They just dump a little\nof everything into a bag and that’s their art of masala making.\n\nSo please don’t let those masala snobs tell you there’s a fixed recipe. Some\nspice shops do have a strict recipe they use, if pre-packed, just so they can\nkeep all their masalas the same.\n\nFrom time to time I change my masala, I love adding more spices to it or\nreduce something that I don’t think works anymore. Play around until you\nperfect that Masala. One day you could be selling your own mix.\n\nSome Recipes to try using this Masala:\n\n**Durban Lamb Curry**\n\n**Spicy Durban Chicken Curry**\n\n## Homemade Durban Masala\n\nHomemade masala with freshly ground spices made the Durban way\n\n5 from 3 votes\n\nPrint Recipe Pin Recipe\n\nPrep Time 30 minutes mins\n\nCourse Condiment\n\nCuisine Indian\n\n### Ingredients\n\n  \n\n  * 500 gram chilli powder \n  * 1/4 cup/25g ground cumin\n  * 1/4 cup/25g ground coriander\n  * 2 tbsp garam masala\n  * 2 tbsp ground fennel/soomph\n  * 2 tbsp turmeric\n  * 1 tspn ground cardamom\n  * 1 tspn ground cinnamon\n\n### Instructions\n\n\n\n  * Roast all your seeds separately in a pan\n\n  * Grind them individually, using a coffee grinder or a pestle and mortar\n\n  * Add all the spices to a large bowl and mix well\n\n### Notes\n\n  1. You can use any chilli powder you prefer\n  2. I used a local chilli powder called \"Rustenberg Chilli Powder\" or the regular Osmans Extra Special Chilli Powder from the stores is perfect too\n  3. You can also use some Paprika or Kashmiri Chilli Powder to your regular chilli powder to add to the red colouring\n  4.  You can add dry curry leaves and bay leaf, ground star aniseed and cloves to the masala if you prefer. \n\nKeyword durban masala, homemade masala\n\nTried this recipe?Mention @tamarindnthyme\n\n\n\nIf you loved this, please share!\n\n  *   *   *   *   * \n\nBy Author Lorraine\n\nPosted on Published: 30 January 2020\n\nCategories Local Favourites, Recipe\n\n## Post navigation\n\nSimple Tomato Pasta Sauce\n\nSpicy Indian Lamb Kebabs\n\nClick here to cancel reply.\n\nRecipe Rating Recipe Rating  \n  \n  \n  \n  \n\nResh\n\nMonday 22nd of November 2021\n\nThank you for the recipe. I live in Australia , it’s a struggle to get SA\nmasala. I have to get families to post it for me. Definitely try and make\nthis. Many Thanks Resh\n\nLorraine\n\nThursday 2nd of December 2021\n\nHope it work for you Resh:-)\n\nKhushi\n\nMonday 30th of August 2021\n\nNamaste Lorraine..Do you perhaps have the grams measurment of the spices for\nthis Durban masala. Thank you.\n\nLorraine\n\nTuesday 31st of August 2021\n\nHi Khushi! For every 1kg you use 100grams of coriander and cumin. The other\nspices I don't have in grams as it's so little I just add them. Will try and\npost another recipe soon with grams\n\nAnnet Schoombie\n\nFriday 27th of August 2021\n\nThank you so much! I have been looking for the perfect mix. I am from KZN and\nmy mother used to mix my masala the way her friends taught her, but since her\ndeath 6 years ago I have not been able to get the perfect blend even though I\nknow exactly what goes into the masala\n\nShanie\n\nWednesday 26th of May 2021\n\nHi Lorraine\n\nThanks for this recipe. Need to get my quantities in grams right.I have baking\ncups as measurements. You asked for 500grams chilli powder-i have 1 baking cup\n250g ×2 ? Also 1/4 cup in baking cup is 60ml.Can i use this for all your 1/4\ncup measurements?\n\nLorraine\n\nSunday 30th of May 2021\n\nHi Shanie! Yes you can use the 1/4 measuring cups as I use proper measuring\ncups when I say cups. In terms of grams I use a scale for that. Good luck:-)\n\nAlthea\n\nTuesday 6th of April 2021\n\nHi Lorraine. I see your recipe calls for garam masala...I'm in the Netherlands\nand trust me, I have tried just about every masala they sell here and it\ntastes different. Do you have a recipe for the masala also? Would really\nappreciate it\n\nLorraine\n\nWednesday 7th of April 2021\n\nHi Althea! The garam masala is also on my blog. Everybody has a different\nrecipe unfortunately. It's all about your own taste and preference. You can\nalways adjust the recipes according to your own needs. There is no right and\nwrong recipe in terms of spice blends and I do hope you eventually create a\nmix that works for you. However, do try my recipes on my blog and if you need\nany help feel free to message me. Take Care:-)\n\n### Welcome\n\nHello! I am Lorraine. Welcome to Tamarind and Thyme, where I share my passion\nfor food, a little healthy, a little indulgent, and a whole lot of spice. Hope\nyou enjoy your stay ❤\n\n### Looking for a recipe?\n\nSearch for:\n\n### More Recipes\n\n### Best Ever Lemon Loaf Recipe\n\nShares: 7343\n\n### Cheesy Garlic Naan Bread\n\nShares: 4529\n\n### Soft Butter Rotis\n\nShares: 6428\n\n  * Home\n  * About Me\n  * Privacy Policy\n  * Contact Me\n  * Instagram\n  * Facebook\n\nCopyright © 2024 Tamarind & Thyme\n\nVirginia Privacy Notice\n\n53 and lots has changed but so grateful to be aliv\n\nThese Eggless Snowballs are super delicious and re\n\nI just can’t get enough of WRewards. This Dhania\n\nThis Chicken a la King has been quite a hit on my\n\nI couldn’t resist … I’m probably going to ge\n\nAlthough it’s been forever since I made this che\n\nThrowback to when I made my TV debut 😂 Can’t\n\nI created a new recipe because I don’t use gelat\n\n470 shares\n\n  * Facebook\n  * Twitter\n  * Pinterest\n  * WhatsApp\n  * Email\n\n",
    "links": "[{\"link\": \"https://www.tamarindnthyme.com/homemade-durban-masala/#respond\", \"text\": \"Click here to cancel reply.\"}]",
    "priceAndPlans": "Error: Timeout 30000ms exceeded. =========================== logs\n=========================== navigating to\n\"http://web.archive.org/web/20240121053457/https://www.tamarindnthyme.com/\",\nwaiting until \"load\"\n============================================================\n\n"
}