{
    "summary": "top of page\n\nThanu's Tried and Tested\n\n  * Home\n\n  * About\n\n  * Blog\n\n  * Contact\n\n  * More\n\nUse tab to navigate through the menu items.\n\n  * All Posts\n  * Travel and Places\n  * Tried and Tested Recipes\n  * Product Reviews\n  * Business\n\nSearch\n\nLog in / Sign up\n\n  * Thanu\n  *   *     * Jul 15, 2019\n    *     * 3 min read\n\n# Durban Red Masala / Red Curry Powder (my not so secret ingredient)\n\nUpdated: Sep 23, 2019\n\nI was born and raised in Durban, South Africa which is heavily populated with\nIndians to say the least. Indians have been in South Africa for over 150 years\nand while we still kept a lot of the India culture alive over the generations,\nmuch of the population adapted and created a culture of our own. While we are\nIndian, we proudly differentiate ourselves as _South African Indian_ and that\ndifferentiation is evident in our cooking styles.\n\n  \n\nWhen it comes to recipes my blog does not do justice to the AMAZINGLY TALENTED\nSouth Africans who cook every day for their families. I grew up with aunts,\ncousins, friends, grannies and a community that created so much deliciousness\nwith every type of ingredient they touch. They would cook for very large\ncrowds without measurements but simply their gut feel and the result would be\nphenomenal.\n\nLiving in the USA and craving a South African Indian style curry is difficult.\nWhile US Indian restaurants serve great and flavorful dishes, it does not curb\nthe yearning for my Durban Style Curries that remind me of home. These curries\nare usually distinguished by being redder and hotter and really little to no\nuse of cream/milk. A major ingredient contributing to these flavors, is the\nDurban Masala (red curry powder). When I moved to California I had it at the\ntop of my request list whenever any friend/relative visited. There are many\nslight variations but overall it is extremely abundant and accessible in\nDurban - not so much in California. Some of these variations were store bought\nor mixed at home with families passing down their versions to their children.\nIf I still lived in South Africa I may not have taken an interest in the\nindividual spices that can make up the mixture, but I don't, so I have created\na recipe with ingredients available to me. One may increase or decrease an\ningredient based on taste preference.\n\n  \n\nSome of these spices can technically be added individually at the time of\nmaking the curry or spicy dish. Typically we make the powder in large\nquantities and store in a jar (tradition in my house is to re-purpose an old\ncoffee jar :). Thinking back, I have had the same lucky jar for the past 10\nyears - no rhyme or reason why) You could also seal and store in the freezer\nfor longer periods of time. This makes it ready to use at any moment you\ndecide to whip up something spicy and delicious.\n\nThe base of this mix is red chili powder and depending on your taste you could\ngo from mild to hot. I usually lean towards the hotter kind. The additional\nspices can vary slightly but most types of Durban masala contain very similar\ningredients. At times if there isn't something that is easily available to me\nin California or if I am feeling lazy to drive out and get it, I may omit an\ningredient or substitute.\n\n  \n\nYou can roast and grind all the whole ingredients at the same time or buy the\nones already available in the powder form.\n\n  \n\n  \n\n##  **Durban Red Masala / Red Curry Powder Recipe**\n\n  \n\n###  **Ingredients**\n\n  * 1 cup chili powder\n\n  * 3 Tbsp coriander seeds (ground)\n\n  * 4 cardamom seeds (ground)\n\n  * 2 Tbsp cup cumin seeds (ground)\n\n  * 1 Tbsp aniseed (ground)\n\n  * 2 Tbsp cup paprika\n\n  * 1 Tbsp Turmeric\n\n  * 1 tsp clove (ground)\n\n  * 1 Bay leaf (ground)\n\n  * 4 curry leaves (optional)\n\n  \n\n### Method\n\n  1. Toast the ingredients that are whole or in seed form in a pan over medium heat. Be careful not to burn.\n\n  2. Grind the whole toasted ingredients into a fine powder using a coffee/spice grinder or mortar and pestle.\n\n  3. Mix all ingredients together. Store in an airtight container or freeze for later use.\n\n  \n\n_As an Amazon Associate I earn from qualifying purchases_\n\n  * Tried and Tested Recipes\n\n879 views1 comment\n\n3 likes. Post not marked as liked3\n\n## Recent Posts\n\nSee All\n\nMince / Ground Lamb and Potato Curry\n\n3990\n\n1 like. Post not marked as liked1\n\nMince Biryani\n\n8990\n\n4 likes. Post not marked as liked4\n\nCoconut Ice Clay Lamp / Diya\n\n680\n\n2 likes. Post not marked as liked2\n\n  *   * \n\n©2019 by Thanu's Tried and Tested.\n\nbottom of page\n\n",
    "links": "[]",
    "priceAndPlans": "Error: Timeout 30000ms exceeded. =========================== logs\n=========================== navigating to\n\"http://web.archive.org/web/20230606021338/https://www.thanustriedandtested.com/\",\nwaiting until \"load\"\n============================================================\n\n"
}