{
    "summary": "  * __Call\n    * Support\n    * Sales\n  * Login\n    * Bare Metal Cloud\n    * Channel Partners\n    * Billing Portal\n  * Partners\n  * Language\n    * English\n    * Spanish\n    * Spanish MX\n    * Portuguese\n    * Portuguese BR\n    * German\n    * Dutch\n    * French\n    * Italian\n\n__ Toggle navigation __\n\n  * Colocation\n    * Colocation  \nPremier Carrier Hotel\n\n    * Data Center as a Service  \nSolutions for Digital Transformation\n\n      * Data Center as a Service  \nOverview\n\n      * Hardware as a Service  \nFlexible Hardware Leasing\n\n      * Bare Metal Cloud  \nAPI-Driven Dedicated Servers\n\n      * Object Storage  \nS3 API Compatible Storage Service\n\n    * Meet-Me Room  \nThe Interconnectivity Hub\n\n      * Meet-Me Room  \nOverview\n\n      * AWS Direct Connect  \nDedicated Link to Amazon Cloud\n\n      * Google Cloud Interconnect  \nPrivate Connectivity to Google Cloud\n\n      * Megaport Cloud Router  \nSimplified Multi-Cloud Connections\n\n      * All Carriers  \nGlobal Interconnectivity Options\n\n    * Schedule a Tour  \nGuided Virtual Data Center Tour\n\n    * Data Center Locations  \nGlobal Data Center Footprint\n\n      * Data Center Locations  \nOverview\n\n      * Phoenix, AZ  \nThe Largest Fiber Backbone in the U.S.\n\n      * Ashburn, VA  \nThe Largest Fiber Backbone in the U.S.\n\n      * Atlanta, GA  \nA Top Market for Bandwidth Access\n\n      * Amsterdam, NL  \nThe Connectivity Hub of Europe\n\n      * Belgrade, RS  \nStrategic PoP in the Southeast Europe\n\n      * Singapore, SG  \nMost Neutral Business-Friendly Climate\n\n  * Bare Metal Cloud\n    * Platform  \nAPI-Driven Dedicated Servers\n\n      * Platform  \nOverview\n\n      * Infrastructure As Code  \nDevOps Integrations\n\n      * BMC vs. Dedicated Servers  \nChoose the Best Option\n\n      * Supermicro Servers  \nIndustry-Leading Hardware\n\n    * Pricing  \nInstance pricing and cost estimation\n\n      * Instance Pricing  \nSee All Configurations\n\n      * Pricing Calculator  \nGet an Estimate\n\n      * Network/IP Pricing  \nFlexible IP Pricing\n\n    * Kubernetes Solutions  \nStreamlined Kubernetes Management\n\n      * Rancher Deployment  \nOne-Click Kubernetes Deployment\n\n    * CPUs  \nNext Gen Intel Processors\n\n      * Intel Xeon E-2300  \nEntry-Level Servers\n\n      * 4th Gen Intel Xeon Scalable CPUs  \nBoost Data-Intensive Workloads\n\n      * HPE Ampere Altra Q80-30  \nHPE® ProLiant RL300 as a service\n\n    * Alliances  \nTechnology Partnerships\n\n      * Ecosystem  \nUnderlying Technologies\n\n      * NetrisOS  \nVPC networking on bare metal\n\n    * Storage Options  \nFlexible Storage Solutions\n\n      * Object Storage  \nS3-Compatible Storage Solution\n\n      * Network File Storage  \nAll-Flash Scale-Out Storage Resources\n\n  * Servers\n    * Dedicated Servers  \nSingle-Tenant Physical Machines\n\n      * Dedicated Servers vs. BMC  \nCompare Popular Platforms\n\n      * Dedicated Servers  \nOverview\n\n      * FlexServers  \nVertical CPU Scaling\n\n      * Intel Xeon-E Servers  \nIntel Xeon 2200 Microarchitecture\n\n      * GPU Servers  \nServers with NVIDIA Tesla GPUs\n\n      * Bare Metal Cloud  \nAutomated Server Provisioning\n\n    * Promotions  \nSee Available Discounts\n\n    * Buy Now  \nSee All Servers\n\n  * Cloud\n    * Managed Private Cloud (MPC)  \nHighly Customizable Cloud\n\n    * Data Security Cloud  \nSecure-By-Design Cloud\n\n    * Hybrid Cloud  \nMulti-Platform Environment\n\n    * Edge Computing  \nGlobally Distributed Servers\n\n    * Object Storage  \nS3 API Compatible Storage Service\n\n    * Bare Metal Cloud  \nAPI-Driven Dedicated Servers\n\n    * Alternative Cloud Provider  \nOvercome Public Cloud Limitations\n\n  * Backup & Restore\n    * Backup Solutions  \nVeeam-Powered Services\n\n    * Disaster Recovery  \nVMware, Veeam, Zerto\n\n    * Veeam Cloud Connect  \nBackup and Replication\n\n    * Managed Backup for Microsoft 365  \nVeeam-Powered Service\n\n  * Security\n    * Data Security Cloud  \nSecure-by-Design Cloud\n\n    * Encryption Management Platform (EMP)  \nCryptographic Key Management\n\n    * Confidential Computing  \nData-in-Use Encryption\n\n    * Ransomware Protection  \nData Protection and Availability\n\n    * DDoS Protection  \nNetwork Security Features\n\n  * Network\n    * Network Overview  \nGlobal Network Footprint\n\n    * Network Locations  \nU.S., Europe, APAC, LATAM\n\n    * Speed Test  \nDownload Speed Test\n\n  * LEARN\n    * Blog  \nIT Tips and Tricks\n\n    * Knowledge Base  \nTechnical Guides\n\n    * Resource Library  \nKnowledge Resources\n\n    * Glossary  \nphoenixNAP IT Glossary\n\n    * Events  \nLet’s Meet!\n\n    * Newsroom  \nMedia Library\n\n    * Developers  \nDevelopment Resources Portal\n\n    * APIs  \nAccess Our Public APIs\n\n    * GitHub  \nPublic Code Repositories\n\n__\n\n✕\n\n# GPU Dedicated Servers\n\nAccelerate your workload with the power of dedicated servers & NVIDIA Tesla\nGPUs.\n\nHarness the power of a modern deployment infrastructure leveraging the\nperformance of world-class GPUs. Alongside Intel, NVIDIA, and SuperMicro, we\nhave designed a cost-effective solution for parallel computing. Our design\nrivals any current system within the Artificial Intelligence, High-Performance\nComputing, Inference, and Big Data market space. Graphics Processing Units\nhave become a core piece of Infrastructure-as-a-Service deployments. Combined\nwith the raw processing power of Dedicated Servers, we have designed the most\ncomprehensive solution that you have been waiting for. Tap into the future of\ncomputing power today.\n\nORDER NOW CALL NOW\n\n## Accelerate your computing.  \nDominate your world.\n\n## The Next Generation of Processing Power\n\n### The ability to dream. The power to make it a reality.\n\nGraphics Processing Units (GPUs) are the front-runners to support today’s\ngrowing demand for infrastructure-parallel processing abilities. From\nArtificial Intelligence (AI), Machine Learning, Deep Learning, Big Data\nmanipulation, 3D rendering, and even streaming, the needs for high-performance\nGPUs is undeniable. These types of workloads tend to overwhelm general purpose\nCPUs and create cost-prohibitive deployment scenarios. GPUs shine with the\nability to harness multiple processing cores and scale to handle tremendous\namounts of simultaneous instructions.\n\n## Cutting Edge Technology\n\nAccelerate your workloads, break compute barriers and deal with any data\nprocessing roadblocks leveraging raw power of dedicated NVIDIA Tesla V100\nGPUs.\n\n## Scalable Workloads\n\nScale your deployments across multiple nodes with flexible 1x to 3x Tesla V100\nGPUs PCIe system, or 4x up to 8x Tesla V100 SXM2 interconnected with NVLink.\n\n## Control and Save Costs\n\nDeploying a GPU-supported infrastructure doesn’t need to break the bank. Save\non costs and control spending while maintaining access cutting-edge NVIDIA GPU\ntechnologies.\n\n## Power You Can Feel\n\n### All of the pieces you need. Together at last.\n\nLarge computational tasks of today are solved by software that is running on\ntop of the most robust NVIDIA Tesla Volta and Pascal GPU architectures. The\nNVIDIA CUDA software platform offers tools to support developers, scientists,\nengineers and analysts through its wide array of libraries. The platform\nprovides software libraries for Deep Learning (cuDNN, TensorRT, DeepStream\nSDK), Linear Algebra and Math (cuBLAS, CUDA Math Library, cuSPARSE, cuRAND,\ncuSOLVER, AmgX), Image and Video (cuFFT, NVIDIA Performance Primitives, NVIDIA\nCodec SDK), Parallel Algorithm Libraries (NCCL, nvGRAPH, Thrust) and many\nadditional partner libraries.\n\nWith such a vibrant software ecosystem, alongside regular improvements, and in\ncombination with the underlying power of Tesla Volta and Pascal GPU\narchitectures, the NVIDIA CUDA platform has become a core component of\ninfrastructure deployments. Such an implementation relies on parallel\ncomputing architectures to accomplish its computational goals.\n\n## The Best of Both Worlds\n\n### Dedicated server platforms with NVIDIA Tesla V100 GPU’s in your data\ncenter.\n\nThe phoenixNAP dedicated server platform alongside CUDA-enabled NVIDIA Tesla\nV100 GPUs provides you with direct access to many auxiliary cloud services.\nThese services can include and are not limited to globally scalable and\nsecurity-focused cloud services, hybrid block storage, fully S3 API compatible\nobject storage, colocation services, a global DDoS protected network and an\nextensive range of disaster recovery and backup services. At phoenixNAP, our\nIaaS offering supports a broad spectrum of industries and specific domains\nthat are heavily dependent on access to globally scalable, reliable, high-\nperformance and affordable infrastructure services.\n\n* * *\n\n\n\n  * Bioinformatics\n  * Computational Chemistry\n  * Computational Finance\n  * Machine Learning\n  * Data Science\n  * Medical Imaging\n\n* * *\n\n\n\n  * Computational Fluid Dynamics\n  * Computational Structural Mechanics\n  * Electric Design Automation\n  * Imaging and Computer Vision\n  * Numerical Analytics\n  * Weather and Climate\n\n## Access the Limitless Power of NVIDIA Tesla GPUs.\n\n## Data: The Answer You’ve Been Searching For\n\n### Harness the power of data. Accelerated computing with GPUs is the key.\n\n### Artificial Intelligence / Machine Learning / Deep Learning (AI/ML/DL)\n\nCompanies rely on artificial intelligence services to drive their competitive\nadvantage. The ability to leverage AI for predictions, classifications and\nanalytics make a significant difference for any business with access to large,\ncomplex and ever-growing data sources. Deep Learning training and inference is\nat the core of delivering such AI services. As Neural Networks become deeper\nand more complex they require more parallel-processing power, more memory\nbandwidth, and faster networks. These requirements are necessary to achieve\nreasonable training times along with fast-processing for inference of\nproduction workload deployments.\n\n### High-Performance Computing (HPC) / Big Data\n\nSolving complex computational problems in a short amount of time, as well as\ndealing with large-size data sets and extreme amounts of continuously growing\ndata, are challenges that are being tackled by parallel processing algorithms.\nData center deployments with high-end NVIDIA Tesla GPUs enable computational,\nstorage and network processing power to support such highly demanding\nworkloads. Access to thousands of cores from each GPU with high-capacity\nnetwork and high-IOPS (Input/Output Operations Per Second) storage allows for\nideal infrastructure builds for HPC and Big Data application deployments\nalike.\n\n### Virtual Desktop Infrastructure (VDI) / Streaming / Rendering\n\nUse cases that utilize a GPUs tremendous power and parallel processing include\nheavy rendering tasks, image manipulation, streaming for video and inference\npurposes, and the ability to provide secure, scalable anywhere/anytime access\nto applications, to name a few. These types of cloud deployments utilizing a\nGPU, combined with reliable network and fast NVMe/SSD storage, are able to\nprovide economical, high-performance and agile solutions for companies that\nare looking to leverage the latest technologies to achieve its business\nobjectives.\n\n## Artificial Intelligence\n\n### More Human Than Human.\n\nDeep Learning has become a true enabler of AI services; in fact, it is the key\ndriver behind today’s entire field of AI and its real-life practical\napplications. Machine Learning business utilization and its ability to support\nbusiness objectives have enabled AI services to take a seat at the company\nstrategic table. From life and health sciences, through engineering and\nfinancial modeling, to natural language processing and image recognition, the\nemployment of Deep Learning is growing exponentially each year. This growth in\napplications of AI services is primarily due to the infrastructure behind the\ncurtain and its utilization of parallel computing with increasingly more\nadvanced GPU technologies to enable such progress.\n\n* * *\n\n### Deep Learning Training\n\n\n\nDeep Learning Neural Networks are becoming continuously more complex. The\nnumber of layers and neurons in a Neural Network is growing significantly,\nwhich lowers productivity and increases costs. Deep Learning deployments\nleveraging GPUs drastically reduce the size of the hardware deployments,\nincrease scalability, dramatically reduce the training and ROI times and lower\nthe overall deployment TCO.\n\n* * *\n\n### Deep Learning Inference\n\n\n\nTrained Neural Networks are deployed for inference in production environments.\nTheir task is to recognize spoken words, images, predict patterns etc. Just\nlike during training, speed is of utmost importance especially when a workload\ndeals with “live predictions.” Besides processing speeds; throughput, latency,\nand network reliability also play a vital role. Deployment of GPUs in the\ncloud is the solution.\n\n## Access Massive GPU Processing Power Globally in the Cloud.\n\n## Future Technology Advancements\n\n### Design your future with Artificial Intelligence and Deep Learning.\n\nFor Deep Learning to take full advantage of the GPU hardware architecture and\nacceleration, there needs to be an “easy” way to allow algorithms to leverage,\nscale and consume underlying infrastructure. Deep Learning frameworks\nrepresent and combine such sets of tools, interfaces, and libraries, which\nallow data scientists, engineers, and developers to build, deploy and manage\ntheir training models and networks. They are the building blocks of modern\nDeep Learning deployments. Today, the most popular Deep Learning Frameworks\ninclude, but are not limited to Tensorflow, Keras, Caffe 2, Pytorch, Theano,\nChainer, CNTK, and MXNET. Each of these frameworks is built in a different\nmanner and serves different purposes.\n\n## Power Meets Performance\n\n### Industry titans unite. The possibilities are endless.\n\nAt phoenixNAP, our GPU-ready systems enable your business with a full Opex\naccess to the latest NVIDIA GPU architectures, from small deployments with\nPCIe interface from 1x to 3x Tesla V100. Build-your-own “DGX-1 like” systems\nwith 4x or 8x NVIDIA Tesla V100 with NVLink interconnection getting access to\na massive amount of deep learning compute power. With up to 128 GB HBM2, 40960\nCUDA cores and a whopping 1 PFLOP=1000 TFLOPS (tensor performance – mixed\nprecision FP16/FP32), or 125 TFLOPs (FP32 – single precision performance) of\ncomputational power supported by a reliable phoenixNAP 10Gbps network.\nCombined with latest Intel Xeon Scalable processors and massive amounts of\nDDR4 RAM, access to fast NVMe and SSD storage you will have a world-class\nparallel computing behemoth at your command without breaking the bank.\n\n## NVIDIA Tesla V100 (PCIe)\n\n  * NVIDIA Volta GPU architecture\n  * 14 TeraFLOPS single-precision performance\n  * 112 TeraFLOPS Tensor performance (mixed precision)\n  * 5120 CUDA cores\n  * 640 Tensor cores\n  * 16 GB HBM2 Memory\n  * Memory bandwidth 900 GB/s\n  * Interconnect bandwidth 32 GB/s (Bi-Directional)\n  * PCIe 3.0 interface\n\n## NVIDIA Tesla V100 (SXM2 – NVLink)\n\n  * NVIDIA Volta GPU architecture\n  * 15.7 TeraFLOPS single-precision performance\n  * 125 TeraFLOPS Tensor performance (mixed precision)\n  * 5120 CUDA cores\n  * 640 Tensor cores\n  * 16 GB HBM2 Memory\n  * Memory bandwidth 900 GB/s\n  * Interconnect bandwidth 300 GB/s (Bi-Directional)\n  * NVLink interface\n\n## Modern GPU Server Platforms Within Reach\n\n### Focus on your business goals. Leave the cloud services to us.\n\n## IaaS Platform Access\n\nGain access to phoenixNAP’s entire IaaS platform: dedicated servers, cloud\nsolutions, security services, hybrid block storage and fully S3 compatible\nobject storage to Disaster Recovery & Backup Services.\n\n## Dedicated GPUs\n\nDon’t settle for anything less than fully dedicated GPUs physically attached\nto your servers. No virtualization; no shared resources. Full access to\nmaximum NVIDIA Tesla GPU power and architectures.\n\n## No Upfront Investment\n\nAccess the most powerful GPU infrastructure with complete Capex avoidance, no\nupfront investments, and zero complications. Focus on developing your business\nand improving your bottom line.\n\n#### phoenixNAP Global IT Services. Reliability and a guaranteed peace of\nmind.\n\n* * *\n\n\n\n  * Global Locations throughout the United States, Europe, and Asia PAC\n  * Backup, Recovery and DRaaS Options\n  * Security Services and Compliance Focus\n  * Broad Cloud Services Portfolio\n\n* * *\n\n\n\n  * 24/7 Infrastructure Monitoring\n  * 100% Network Uptime Guarantee\n  * Industry-Leading SLA\n  * Colocation and Hardware Leasing Options\n\nStaying competitive in today’s market is not an easy task for any business.\nAccessing the newest technologies and contending in a global space\ntraditionally comes at a massive investment cost, but today it can be easily\navoided. Ability to leverage innovative computing infrastructure and solutions\nwith quick scalability, while competing on a global market will give an edge\nto any business. At phoenixNAP, we can help. We specialize in enabling\nbusinesses with global access through our strategic locations and bleeding-\nedge technologies while you operate locally and avoid capital investments.\nGlobal IT Services is what we do best: what is your specialty?\n\n## Supercharging Data Center Workloads\n\n### The power you need. The technology to make it possible.\n\nData centers are the foundation for cloud computing and its drive behind\nenabling business agility and accelerating time-to-market. Modern data center\nworkloads are extremely compute intensive, as they are required to manipulate\ntremendous amounts of data. Growing global markets and an increasingly more\nconnected world, demand more power, more speed and quicker response times. The\namount of data we produce continues to grow exponentially as well as the need\nfor its strategic use. The use cases for accelerated computing can be found in\nnearly all industries from artificial intelligence and scientific research to\nimage and video rendering. Dedicated servers with Graphics Processing Units\noffer the raw processing power to handle the most advanced workloads in the\ncloud today.\n\nColocation Phoenix Ashburn Amsterdam Atlanta Belgrade Singapore Shipping\nInstructions Promotions\n\nServers Dedicated Servers Database Servers Virtualization Servers High\nPerformance Computing (HPC) Servers Dedicated Streaming Servers Dedicated Game\nServers Dedicated Storage Servers SQL Server Hosting Dedicated Servers in\nAmsterdam Cloud Servers in Europe Big Memory Infrastructure Buy Now\n\nCloud Services\n\nData Security Cloud Managed Private Cloud Object Storage Solutions Disaster\nRecovery Web Hosting Reseller SaaS Hosting\n\nCompliance\n\nHIPAA Ready Hosting PCI Compliant Hosting Privacy Center Do not sell or share\nmy personal information\n\nNeeds\n\nDisaster Recovery Solutions High Availability Solutions Cloud Evaluation\n\nIndustries\n\nWeb Hosting Providers Legal MSPs & VARs Media Hosting Online Gaming SaaS\nHosting Solutions Ecommerce Hosting Solutions\n\nCompany\n\nAbout phoenixNAP IaaS Solutions Customer Experience Platform Schedule Virtual\nTour Open Source Community Resource Library\n\nConnect\n\nPress Events Careers Contact Us\n\n  * Blog\n  * Resources\n  * Knowledge Base\n  * IT Glossary\n  * GitHub\n  * RFP Template\n\n* * *\n\n  * __Live Chat\n  * __Get a Quote\n  * __Support |1-855-330-1509\n  * __Sales |1-877-588-5918\n\n  * __\n  * __\n  * __\n  * __\n  * __\n\n  * Contact Us\n  * Legal\n  * Privacy Policy\n  * Terms of Use\n  * DMCA\n  * GDPR\n  * Sitemap\n\n© 2023 Copyright phoenixNAP | Global IT Services. All Rights Reserved.\n\n__ Chat with us, powered by LiveChat\n\n",
    "links": "[{\"link\": \"https://phoenixnap.com/servers/gpu\", \"text\": \"\"}, {\"link\": \"https://phoenixnap.com/promotions\", \"text\": \"\"}, {\"link\": \"https://phoenixnap.com/blog\", \"text\": \"\"}, {\"link\": \"https://phoenixnap.com/kb\", \"text\": \"\"}, {\"link\": \"https://phoenixnap.com/company/resource-library\", \"text\": \"\"}, {\"link\": \"https://phoenixnap.com/glossary\", \"text\": \"\"}, {\"link\": \"https://phoenixnap.com/company/it-events\", \"text\": \"\"}, {\"link\": \"https://phoenixnap.com/company/press\", \"text\": \"\"}, {\"link\": \"https://phoenixnap.com/colocation\", \"text\": \"Colocation\"}, {\"link\": \"https://phoenixnap.com/colocation/phoenix\", \"text\": \"Phoenix\"}, {\"link\": \"https://phoenixnap.com/colocation/ashburn\", \"text\": \"Ashburn\"}, {\"link\": \"https://phoenixnap.com/colocation/amsterdam\", \"text\": \"Amsterdam\"}, {\"link\": \"https://phoenixnap.com/colocation/atlanta\", \"text\": \"Atlanta\"}, {\"link\": \"https://phoenixnap.com/colocation/belgrade\", \"text\": \"Belgrade\"}, {\"link\": \"https://phoenixnap.com/colocation/singapore\", \"text\": \"Singapore\"}, {\"link\": \"https://phoenixnap.com/colocation/shipping-instructions\", \"text\": \"Shipping Instructions\"}, {\"link\": \"https://phoenixnap.com/promotions\", \"text\": \"Promotions\"}, {\"link\": \"https://phoenixnap.com/servers/dedicated\", \"text\": \"Servers\"}, {\"link\": \"https://phoenixnap.com/servers/dedicated\", \"text\": \"Dedicated Servers\"}, {\"link\": \"https://phoenixnap.com/servers/database\", \"text\": \"Database Servers\"}, {\"link\": \"https://phoenixnap.com/servers/virtualization\", \"text\": \"Virtualization Servers\"}, {\"link\": \"https://phoenixnap.com/servers/high-performance-computing-hpc\", \"text\": \"High Performance Computing (HPC) Servers\"}, {\"link\": \"https://phoenixnap.com/servers/streaming\", \"text\": \"Dedicated Streaming Servers\"}, {\"link\": \"https://phoenixnap.com/servers/dedicated-game-servers\", \"text\": \"Dedicated Game Servers\"}, {\"link\": \"https://phoenixnap.com/servers/storage\", \"text\": \"Dedicated Storage Servers\"}, {\"link\": \"https://phoenixnap.com/servers/sql-server-hosting\", \"text\": \"SQL Server Hosting\"}, {\"link\": \"https://phoenixnap.com/dedicated-servers-amsterdam-netherlands\", \"text\": \"Dedicated Servers in Amsterdam\"}, {\"link\": \"https://phoenixnap.com/cloud-services/cloud-servers-europe\", \"text\": \"Cloud Servers in Europe\"}, {\"link\": \"https://phoenixnap.com/bare-metal-cloud/big-memory-infrastructure\", \"text\": \"Big Memory Infrastructure\"}, {\"link\": \"https://phoenixnap.com/security/data-security-cloud\", \"text\": \"Data Security Cloud\"}, {\"link\": \"https://phoenixnap.com/private\", \"text\": \"Managed Private Cloud\"}, {\"link\": \"https://phoenixnap.com/object-storage\", \"text\": \"Object Storage\"}, {\"link\": \"https://phoenixnap.com/infrastructure-solutions\", \"text\": \"Solutions\"}, {\"link\": \"https://phoenixnap.com/infrastructure-solutions/disaster-recovery-services\", \"text\": \"Disaster Recovery\"}, {\"link\": \"https://phoenixnap.com/reseller-hosting\", \"text\": \"Web Hosting Reseller\"}, {\"link\": \"https://phoenixnap.com/infrastructure-solutions/saas-hosting\", \"text\": \"SaaS Hosting\"}, {\"link\": \"https://phoenixnap.com/infrastructure-solutions/disaster-recovery-services\", \"text\": \"Disaster Recovery Solutions\"}, {\"link\": \"https://phoenixnap.com/infrastructure-solutions/high-availability-solutions\", \"text\": \"High Availability Solutions\"}, {\"link\": \"https://phoenixnap.com/offers/cloud-evaluation-demo\", \"text\": \"Cloud Evaluation\"}, {\"link\": \"https://phoenixnap.com/reseller-hosting\", \"text\": \"Web Hosting Providers\"}, {\"link\": \"https://phoenixnap.com/infrastructure-solutions/legal-it\", \"text\": \"Legal\"}, {\"link\": \"https://phoenixnap.com/infrastructure-solutions/it-partners\", \"text\": \"MSPs & VARs\"}, {\"link\": \"https://phoenixnap.com/infrastructure-solutions/media-hosting\", \"text\": \"Media Hosting\"}, {\"link\": \"https://phoenixnap.com/infrastructure-solutions/online-gaming\", \"text\": \"Online Gaming\"}, {\"link\": \"https://phoenixnap.com/infrastructure-solutions/saas-hosting\", \"text\": \"SaaS Hosting Solutions\"}, {\"link\": \"https://phoenixnap.com/infrastructure-solutions/ecommerce-hosting\", \"text\": \"Ecommerce Hosting Solutions\"}, {\"link\": \"https://phoenixnap.com/about\", \"text\": \"About phoenixNAP\"}, {\"link\": \"https://phoenixnap.com/company/iaas-provider\", \"text\": \"IaaS Solutions\"}, {\"link\": \"https://phoenixnap.com/company/customer-experience\", \"text\": \"Customer Experience\"}, {\"link\": \"https://phoenixnap.com/cloud-services/platform\", \"text\": \"Platform\"}, {\"link\": \"https://phoenixnap.com/phoenix-data-center-virtual-tour\", \"text\": \"Schedule Virtual Tour\"}, {\"link\": \"https://phoenixnap.com/company/open-source-community\", \"text\": \"Open Source Community\"}, {\"link\": \"https://phoenixnap.com/company/resource-library\", \"text\": \"Resource Library\"}, {\"link\": \"https://phoenixnap.com/company/press\", \"text\": \"Press\"}, {\"link\": \"https://phoenixnap.com/company/it-events\", \"text\": \"Events\"}, {\"link\": \"https://phoenixnap.com/contact-us\", \"text\": \"Contact Us\"}, {\"link\": \"https://phoenixnap.com/blog\", \"text\": \"Blog\"}, {\"link\": \"https://phoenixnap.com/company/it-resources\", \"text\": \"Resources\"}, {\"link\": \"https://phoenixnap.com/kb\", \"text\": \"Knowledge Base\"}, {\"link\": \"https://phoenixnap.com/glossary\", \"text\": \"IT Glossary\"}, {\"link\": \"https://phoenixnap.com/company/it-resources/data-center-rfp-template\", \"text\": \"RFP Template\"}, {\"link\": \"https://phoenixnap.com/contact-us\", \"text\": \"Contact Us\"}, {\"link\": \"https://phoenixnap.com/cs/legal/\", \"text\": \"Legal\"}, {\"link\": \"https://phoenixnap.com/infrastructure-solutions/legal-it/eu-u-s-data-privacy-framework-program-eu-u-s-dpf-compliant-privacy-policy\", \"text\": \"Privacy Policy\"}, {\"link\": \"https://phoenixnap.com/cs/legal/aup.html\", \"text\": \"Terms of Use\"}, {\"link\": \"https://phoenixnap.com/cs/legal/dmca.html\", \"text\": \"DMCA\"}, {\"link\": \"https://phoenixnap.com/gdpr\", \"text\": \"GDPR\"}, {\"link\": \"https://phoenixnap.com/sitemap\", \"text\": \"Sitemap\"}]",
    "priceAndPlans": "  * __Call\n    * Support\n    * Sales\n  * Login\n    * Bare Metal Cloud\n    * Channel Partners\n    * Billing Portal\n  * Partners\n  * Language\n    * English\n    * Spanish\n    * Spanish MX\n    * Portuguese\n    * Portuguese BR\n    * German\n    * Dutch\n    * French\n    * Italian\n\n__ Toggle navigation __\n\n  * Colocation\n    * Colocation  \nPremier Carrier Hotel\n\n    * Data Center as a Service  \nSolutions for Digital Transformation\n\n      * Data Center as a Service  \nOverview\n\n      * Hardware as a Service  \nFlexible Hardware Leasing\n\n      * Bare Metal Cloud  \nAPI-Driven Dedicated Servers\n\n      * Object Storage  \nS3 API Compatible Storage Service\n\n    * Meet-Me Room  \nThe Interconnectivity Hub\n\n      * Meet-Me Room  \nOverview\n\n      * AWS Direct Connect  \nDedicated Link to Amazon Cloud\n\n      * Google Cloud Interconnect  \nPrivate Connectivity to Google Cloud\n\n      * Megaport Cloud Router  \nSimplified Multi-Cloud Connections\n\n      * All Carriers  \nGlobal Interconnectivity Options\n\n    * Schedule a Tour  \nGuided Virtual Data Center Tour\n\n    * Data Center Locations  \nGlobal Data Center Footprint\n\n      * Data Center Locations  \nOverview\n\n      * Phoenix, AZ  \nThe Largest Fiber Backbone in the U.S.\n\n      * Ashburn, VA  \nThe Largest Fiber Backbone in the U.S.\n\n      * Atlanta, GA  \nA Top Market for Bandwidth Access\n\n      * Amsterdam, NL  \nThe Connectivity Hub of Europe\n\n      * Belgrade, RS  \nStrategic PoP in the Southeast Europe\n\n      * Singapore, SG  \nMost Neutral Business-Friendly Climate\n\n  * Bare Metal Cloud\n    * Platform  \nAPI-Driven Dedicated Servers\n\n      * Platform  \nOverview\n\n      * Infrastructure As Code  \nDevOps Integrations\n\n      * BMC vs. Dedicated Servers  \nChoose the Best Option\n\n      * Supermicro Servers  \nIndustry-Leading Hardware\n\n    * Pricing  \nInstance pricing and cost estimation\n\n      * Instance Pricing  \nSee All Configurations\n\n      * Pricing Calculator  \nGet an Estimate\n\n      * Network/IP Pricing  \nFlexible IP Pricing\n\n    * Kubernetes Solutions  \nStreamlined Kubernetes Management\n\n      * Rancher Deployment  \nOne-Click Kubernetes Deployment\n\n    * CPUs  \nNext Gen Intel Processors\n\n      * Intel Xeon E-2300  \nEntry-Level Servers\n\n      * 4th Gen Intel Xeon Scalable CPUs  \nBoost Data-Intensive Workloads\n\n      * HPE Ampere Altra Q80-30  \nHPE® ProLiant RL300 as a service\n\n    * Alliances  \nTechnology Partnerships\n\n      * Ecosystem  \nUnderlying Technologies\n\n      * NetrisOS  \nVPC networking on bare metal\n\n    * Storage Options  \nFlexible Storage Solutions\n\n      * Object Storage  \nS3-Compatible Storage Solution\n\n      * Network File Storage  \nAll-Flash Scale-Out Storage Resources\n\n  * Servers\n    * Dedicated Servers  \nSingle-Tenant Physical Machines\n\n      * Dedicated Servers vs. BMC  \nCompare Popular Platforms\n\n      * Dedicated Servers  \nOverview\n\n      * FlexServers  \nVertical CPU Scaling\n\n      * Intel Xeon-E Servers  \nIntel Xeon 2200 Microarchitecture\n\n      * GPU Servers  \nServers with NVIDIA Tesla GPUs\n\n      * Bare Metal Cloud  \nAutomated Server Provisioning\n\n    * Promotions  \nSee Available Discounts\n\n    * Buy Now  \nSee All Servers\n\n  * Cloud\n    * Managed Private Cloud (MPC)  \nHighly Customizable Cloud\n\n    * Data Security Cloud  \nSecure-By-Design Cloud\n\n    * Hybrid Cloud  \nMulti-Platform Environment\n\n    * Edge Computing  \nGlobally Distributed Servers\n\n    * Object Storage  \nS3 API Compatible Storage Service\n\n    * Bare Metal Cloud  \nAPI-Driven Dedicated Servers\n\n    * Alternative Cloud Provider  \nOvercome Public Cloud Limitations\n\n  * Backup & Restore\n    * Backup Solutions  \nVeeam-Powered Services\n\n    * Disaster Recovery  \nVMware, Veeam, Zerto\n\n    * Veeam Cloud Connect  \nBackup and Replication\n\n    * Managed Backup for Microsoft 365  \nVeeam-Powered Service\n\n  * Security\n    * Data Security Cloud  \nSecure-by-Design Cloud\n\n    * Encryption Management Platform (EMP)  \nCryptographic Key Management\n\n    * Confidential Computing  \nData-in-Use Encryption\n\n    * Ransomware Protection  \nData Protection and Availability\n\n    * DDoS Protection  \nNetwork Security Features\n\n  * Network\n    * Network Overview  \nGlobal Network Footprint\n\n    * Network Locations  \nU.S., Europe, APAC, LATAM\n\n    * Speed Test  \nDownload Speed Test\n\n  * LEARN\n    * Blog  \nIT Tips and Tricks\n\n    * Knowledge Base  \nTechnical Guides\n\n    * Resource Library  \nKnowledge Resources\n\n    * Glossary  \nphoenixNAP IT Glossary\n\n    * Events  \nLet’s Meet!\n\n    * Newsroom  \nMedia Library\n\n    * Developers  \nDevelopment Resources Portal\n\n    * APIs  \nAccess Our Public APIs\n\n    * GitHub  \nPublic Code Repositories\n\n__\n\n✕\n\n# GPU Dedicated Servers\n\nAccelerate your workload with the power of dedicated servers & NVIDIA Tesla\nGPUs.\n\nHarness the power of a modern deployment infrastructure leveraging the\nperformance of world-class GPUs. Alongside Intel, NVIDIA, and SuperMicro, we\nhave designed a cost-effective solution for parallel computing. Our design\nrivals any current system within the Artificial Intelligence, High-Performance\nComputing, Inference, and Big Data market space. Graphics Processing Units\nhave become a core piece of Infrastructure-as-a-Service deployments. Combined\nwith the raw processing power of Dedicated Servers, we have designed the most\ncomprehensive solution that you have been waiting for. Tap into the future of\ncomputing power today.\n\nORDER NOW CALL NOW\n\n## Accelerate your computing.  \nDominate your world.\n\n## The Next Generation of Processing Power\n\n### The ability to dream. The power to make it a reality.\n\nGraphics Processing Units (GPUs) are the front-runners to support today’s\ngrowing demand for infrastructure-parallel processing abilities. From\nArtificial Intelligence (AI), Machine Learning, Deep Learning, Big Data\nmanipulation, 3D rendering, and even streaming, the needs for high-performance\nGPUs is undeniable. These types of workloads tend to overwhelm general purpose\nCPUs and create cost-prohibitive deployment scenarios. GPUs shine with the\nability to harness multiple processing cores and scale to handle tremendous\namounts of simultaneous instructions.\n\n## Cutting Edge Technology\n\nAccelerate your workloads, break compute barriers and deal with any data\nprocessing roadblocks leveraging raw power of dedicated NVIDIA Tesla V100\nGPUs.\n\n## Scalable Workloads\n\nScale your deployments across multiple nodes with flexible 1x to 3x Tesla V100\nGPUs PCIe system, or 4x up to 8x Tesla V100 SXM2 interconnected with NVLink.\n\n## Control and Save Costs\n\nDeploying a GPU-supported infrastructure doesn’t need to break the bank. Save\non costs and control spending while maintaining access cutting-edge NVIDIA GPU\ntechnologies.\n\n## Power You Can Feel\n\n### All of the pieces you need. Together at last.\n\nLarge computational tasks of today are solved by software that is running on\ntop of the most robust NVIDIA Tesla Volta and Pascal GPU architectures. The\nNVIDIA CUDA software platform offers tools to support developers, scientists,\nengineers and analysts through its wide array of libraries. The platform\nprovides software libraries for Deep Learning (cuDNN, TensorRT, DeepStream\nSDK), Linear Algebra and Math (cuBLAS, CUDA Math Library, cuSPARSE, cuRAND,\ncuSOLVER, AmgX), Image and Video (cuFFT, NVIDIA Performance Primitives, NVIDIA\nCodec SDK), Parallel Algorithm Libraries (NCCL, nvGRAPH, Thrust) and many\nadditional partner libraries.\n\nWith such a vibrant software ecosystem, alongside regular improvements, and in\ncombination with the underlying power of Tesla Volta and Pascal GPU\narchitectures, the NVIDIA CUDA platform has become a core component of\ninfrastructure deployments. Such an implementation relies on parallel\ncomputing architectures to accomplish its computational goals.\n\n## The Best of Both Worlds\n\n### Dedicated server platforms with NVIDIA Tesla V100 GPU’s in your data\ncenter.\n\nThe phoenixNAP dedicated server platform alongside CUDA-enabled NVIDIA Tesla\nV100 GPUs provides you with direct access to many auxiliary cloud services.\nThese services can include and are not limited to globally scalable and\nsecurity-focused cloud services, hybrid block storage, fully S3 API compatible\nobject storage, colocation services, a global DDoS protected network and an\nextensive range of disaster recovery and backup services. At phoenixNAP, our\nIaaS offering supports a broad spectrum of industries and specific domains\nthat are heavily dependent on access to globally scalable, reliable, high-\nperformance and affordable infrastructure services.\n\n* * *\n\n\n\n  * Bioinformatics\n  * Computational Chemistry\n  * Computational Finance\n  * Machine Learning\n  * Data Science\n  * Medical Imaging\n\n* * *\n\n\n\n  * Computational Fluid Dynamics\n  * Computational Structural Mechanics\n  * Electric Design Automation\n  * Imaging and Computer Vision\n  * Numerical Analytics\n  * Weather and Climate\n\n## Access the Limitless Power of NVIDIA Tesla GPUs.\n\n## Data: The Answer You’ve Been Searching For\n\n### Harness the power of data. Accelerated computing with GPUs is the key.\n\n### Artificial Intelligence / Machine Learning / Deep Learning (AI/ML/DL)\n\nCompanies rely on artificial intelligence services to drive their competitive\nadvantage. The ability to leverage AI for predictions, classifications and\nanalytics make a significant difference for any business with access to large,\ncomplex and ever-growing data sources. Deep Learning training and inference is\nat the core of delivering such AI services. As Neural Networks become deeper\nand more complex they require more parallel-processing power, more memory\nbandwidth, and faster networks. These requirements are necessary to achieve\nreasonable training times along with fast-processing for inference of\nproduction workload deployments.\n\n### High-Performance Computing (HPC) / Big Data\n\nSolving complex computational problems in a short amount of time, as well as\ndealing with large-size data sets and extreme amounts of continuously growing\ndata, are challenges that are being tackled by parallel processing algorithms.\nData center deployments with high-end NVIDIA Tesla GPUs enable computational,\nstorage and network processing power to support such highly demanding\nworkloads. Access to thousands of cores from each GPU with high-capacity\nnetwork and high-IOPS (Input/Output Operations Per Second) storage allows for\nideal infrastructure builds for HPC and Big Data application deployments\nalike.\n\n### Virtual Desktop Infrastructure (VDI) / Streaming / Rendering\n\nUse cases that utilize a GPUs tremendous power and parallel processing include\nheavy rendering tasks, image manipulation, streaming for video and inference\npurposes, and the ability to provide secure, scalable anywhere/anytime access\nto applications, to name a few. These types of cloud deployments utilizing a\nGPU, combined with reliable network and fast NVMe/SSD storage, are able to\nprovide economical, high-performance and agile solutions for companies that\nare looking to leverage the latest technologies to achieve its business\nobjectives.\n\n## Artificial Intelligence\n\n### More Human Than Human.\n\nDeep Learning has become a true enabler of AI services; in fact, it is the key\ndriver behind today’s entire field of AI and its real-life practical\napplications. Machine Learning business utilization and its ability to support\nbusiness objectives have enabled AI services to take a seat at the company\nstrategic table. From life and health sciences, through engineering and\nfinancial modeling, to natural language processing and image recognition, the\nemployment of Deep Learning is growing exponentially each year. This growth in\napplications of AI services is primarily due to the infrastructure behind the\ncurtain and its utilization of parallel computing with increasingly more\nadvanced GPU technologies to enable such progress.\n\n* * *\n\n### Deep Learning Training\n\n\n\nDeep Learning Neural Networks are becoming continuously more complex. The\nnumber of layers and neurons in a Neural Network is growing significantly,\nwhich lowers productivity and increases costs. Deep Learning deployments\nleveraging GPUs drastically reduce the size of the hardware deployments,\nincrease scalability, dramatically reduce the training and ROI times and lower\nthe overall deployment TCO.\n\n* * *\n\n### Deep Learning Inference\n\n\n\nTrained Neural Networks are deployed for inference in production environments.\nTheir task is to recognize spoken words, images, predict patterns etc. Just\nlike during training, speed is of utmost importance especially when a workload\ndeals with “live predictions.” Besides processing speeds; throughput, latency,\nand network reliability also play a vital role. Deployment of GPUs in the\ncloud is the solution.\n\n## Access Massive GPU Processing Power Globally in the Cloud.\n\n## Future Technology Advancements\n\n### Design your future with Artificial Intelligence and Deep Learning.\n\nFor Deep Learning to take full advantage of the GPU hardware architecture and\nacceleration, there needs to be an “easy” way to allow algorithms to leverage,\nscale and consume underlying infrastructure. Deep Learning frameworks\nrepresent and combine such sets of tools, interfaces, and libraries, which\nallow data scientists, engineers, and developers to build, deploy and manage\ntheir training models and networks. They are the building blocks of modern\nDeep Learning deployments. Today, the most popular Deep Learning Frameworks\ninclude, but are not limited to Tensorflow, Keras, Caffe 2, Pytorch, Theano,\nChainer, CNTK, and MXNET. Each of these frameworks is built in a different\nmanner and serves different purposes.\n\n## Power Meets Performance\n\n### Industry titans unite. The possibilities are endless.\n\nAt phoenixNAP, our GPU-ready systems enable your business with a full Opex\naccess to the latest NVIDIA GPU architectures, from small deployments with\nPCIe interface from 1x to 3x Tesla V100. Build-your-own “DGX-1 like” systems\nwith 4x or 8x NVIDIA Tesla V100 with NVLink interconnection getting access to\na massive amount of deep learning compute power. With up to 128 GB HBM2, 40960\nCUDA cores and a whopping 1 PFLOP=1000 TFLOPS (tensor performance – mixed\nprecision FP16/FP32), or 125 TFLOPs (FP32 – single precision performance) of\ncomputational power supported by a reliable phoenixNAP 10Gbps network.\nCombined with latest Intel Xeon Scalable processors and massive amounts of\nDDR4 RAM, access to fast NVMe and SSD storage you will have a world-class\nparallel computing behemoth at your command without breaking the bank.\n\n## NVIDIA Tesla V100 (PCIe)\n\n  * NVIDIA Volta GPU architecture\n  * 14 TeraFLOPS single-precision performance\n  * 112 TeraFLOPS Tensor performance (mixed precision)\n  * 5120 CUDA cores\n  * 640 Tensor cores\n  * 16 GB HBM2 Memory\n  * Memory bandwidth 900 GB/s\n  * Interconnect bandwidth 32 GB/s (Bi-Directional)\n  * PCIe 3.0 interface\n\n## NVIDIA Tesla V100 (SXM2 – NVLink)\n\n  * NVIDIA Volta GPU architecture\n  * 15.7 TeraFLOPS single-precision performance\n  * 125 TeraFLOPS Tensor performance (mixed precision)\n  * 5120 CUDA cores\n  * 640 Tensor cores\n  * 16 GB HBM2 Memory\n  * Memory bandwidth 900 GB/s\n  * Interconnect bandwidth 300 GB/s (Bi-Directional)\n  * NVLink interface\n\n## Modern GPU Server Platforms Within Reach\n\n### Focus on your business goals. Leave the cloud services to us.\n\n## IaaS Platform Access\n\nGain access to phoenixNAP’s entire IaaS platform: dedicated servers, cloud\nsolutions, security services, hybrid block storage and fully S3 compatible\nobject storage to Disaster Recovery & Backup Services.\n\n## Dedicated GPUs\n\nDon’t settle for anything less than fully dedicated GPUs physically attached\nto your servers. No virtualization; no shared resources. Full access to\nmaximum NVIDIA Tesla GPU power and architectures.\n\n## No Upfront Investment\n\nAccess the most powerful GPU infrastructure with complete Capex avoidance, no\nupfront investments, and zero complications. Focus on developing your business\nand improving your bottom line.\n\n#### phoenixNAP Global IT Services. Reliability and a guaranteed peace of\nmind.\n\n* * *\n\n\n\n  * Global Locations throughout the United States, Europe, and Asia PAC\n  * Backup, Recovery and DRaaS Options\n  * Security Services and Compliance Focus\n  * Broad Cloud Services Portfolio\n\n* * *\n\n\n\n  * 24/7 Infrastructure Monitoring\n  * 100% Network Uptime Guarantee\n  * Industry-Leading SLA\n  * Colocation and Hardware Leasing Options\n\nStaying competitive in today’s market is not an easy task for any business.\nAccessing the newest technologies and contending in a global space\ntraditionally comes at a massive investment cost, but today it can be easily\navoided. Ability to leverage innovative computing infrastructure and solutions\nwith quick scalability, while competing on a global market will give an edge\nto any business. At phoenixNAP, we can help. We specialize in enabling\nbusinesses with global access through our strategic locations and bleeding-\nedge technologies while you operate locally and avoid capital investments.\nGlobal IT Services is what we do best: what is your specialty?\n\n## Supercharging Data Center Workloads\n\n### The power you need. The technology to make it possible.\n\nData centers are the foundation for cloud computing and its drive behind\nenabling business agility and accelerating time-to-market. Modern data center\nworkloads are extremely compute intensive, as they are required to manipulate\ntremendous amounts of data. Growing global markets and an increasingly more\nconnected world, demand more power, more speed and quicker response times. The\namount of data we produce continues to grow exponentially as well as the need\nfor its strategic use. The use cases for accelerated computing can be found in\nnearly all industries from artificial intelligence and scientific research to\nimage and video rendering. Dedicated servers with Graphics Processing Units\noffer the raw processing power to handle the most advanced workloads in the\ncloud today.\n\nColocation Phoenix Ashburn Amsterdam Atlanta Belgrade Singapore Shipping\nInstructions Promotions\n\nServers Dedicated Servers Database Servers Virtualization Servers High\nPerformance Computing (HPC) Servers Dedicated Streaming Servers Dedicated Game\nServers Dedicated Storage Servers SQL Server Hosting Dedicated Servers in\nAmsterdam Cloud Servers in Europe Big Memory Infrastructure Buy Now\n\nCloud Services\n\nData Security Cloud Managed Private Cloud Object Storage Solutions Disaster\nRecovery Web Hosting Reseller SaaS Hosting\n\nCompliance\n\nHIPAA Ready Hosting PCI Compliant Hosting Privacy Center Do not sell or share\nmy personal information\n\nNeeds\n\nDisaster Recovery Solutions High Availability Solutions Cloud Evaluation\n\nIndustries\n\nWeb Hosting Providers Legal MSPs & VARs Media Hosting Online Gaming SaaS\nHosting Solutions Ecommerce Hosting Solutions\n\nCompany\n\nAbout phoenixNAP IaaS Solutions Customer Experience Platform Schedule Virtual\nTour Open Source Community Resource Library\n\nConnect\n\nPress Events Careers Contact Us\n\n  * Blog\n  * Resources\n  * Knowledge Base\n  * IT Glossary\n  * GitHub\n  * RFP Template\n\n* * *\n\n  * __Live Chat\n  * __Get a Quote\n  * __Support |1-855-330-1509\n  * __Sales |1-877-588-5918\n\n  * __\n  * __\n  * __\n  * __\n  * __\n\n  * Contact Us\n  * Legal\n  * Privacy Policy\n  * Terms of Use\n  * DMCA\n  * GDPR\n  * Sitemap\n\n© 2023 Copyright phoenixNAP | Global IT Services. All Rights Reserved.\n\n__ Chat with us, powered by LiveChat\n\n"
}