{
    "summary": "Skip to Content\n\nChoose Your Region\n\nChoose Your Region\n\n  * Australia (English)\n  * Brasil (Português)\n  * China (简体中文)\n  * Deutschland (Deutsch)\n  * España (Español)\n  * France (Français)\n  * Hong Kong (English)\n  * India (English)\n  * Italia (Italiano)\n  * Latinoamérica (Español)\n  * Nederland (Nederlands)\n  * Singapore (English)\n  * Türkiye (Türkçe)\n  * United Kingdom (English)\n  * United States (English)\n  * 台灣 (繁體中文)\n  * 日本 (日本語)\n  * 대한민국 (한국어)\n\nBLOG Pure guarantees energy efficiency SLA with the greenest storage on Earth\n\nUS / EN\n\nProducts Solutions Services & Support Resources Company Partners\n\nCONTACT US\n\n  * Meet with an Expert CA,US\n  * Schedule a Demo\n  * Chat with Sales\n  * Sales (800) 976-6494\n\nCONTACT US\n\n  * Meet with an Expert CA,US\n  * Schedule a Demo\n  * Chat with Sales\n  * Sales (800) 976-6494\n\nAll-flash Storage Platforms\n\nUnified Block and File Storage\n\nEnterprise performance, reliability, and scale with **FlashArray™**\n\nUnstructured Data Storage\n\nFast file and object storage with **FlashBlade®**\n\nIntegrated Platforms\n\nHigh-performance, agility, and simplicity with **AIRI®** , and\n**FlashStack®**\n\nStorage Subscriptions\n\nFlexible non-disruptive storage with **Evergreen//One™** ,\n**Evergreen//Flex™** , and **Evergreen//Forever™**\n\nSoftware and Automation\n\nAgile Data Services\n\nWorkload mobility and security for unparalleled data storage with **Purity**\n\nCloud-native Data Platform\n\nBuild applications anywhere on Kubernetes clusters, containers, or databases\nwith **Portworx®**\n\nAIOps for Smart Storage\n\nData management and monitoring with **Pure1®**\n\nEnterprise Cloud Management\n\nRun enterprise apps with **Pure Cloud Block Store™** and **Azure VMware\nSolution**\n\nStorage-as-Code\n\nProvision, scale, and self-manage with **Pure Fusion™**\n\nDisaster-Recovery-as-a-Service\n\nOrchestrated recovery for VMware to AWS with **Pure Protect™ //DRaaS**\n\nGet the Report\n\nPure Storage is named A Leader in the 2023 Gartner® Magic Quadrant™ for\nDistributed File Services and Object Storage.\n\nApplications\n\nOracle\n\nMicrosoft\n\nSAP\n\nSee all\n\nAI and Data Analytics\n\nArtificial Intelligence\n\nData Warehouse and Streaming  \nAnalytics\n\nLog Analytics\n\nSee all\n\nCloud\n\nPrivate Cloud\n\nHybrid Cloud\n\nPublic Cloud\n\nAzure VMware Solution\n\nData Protection\n\nRansomware\n\nBackup and Recovery\n\nBusiness Continuity and Disaster Recovery\n\nIndustries\n\nHealthcare\n\nFinancial Services\n\nGovernment\n\nSee all\n\nInfrastructure\n\nVMware\n\nVDI\n\nContainers\n\nBare Metal as-a-Service\n\nStorage Subscriptions\n\nAll Evergreen Subscriptions\n\nFlexibility with **Evergreen//One™** , **Evergreen//Flex™** , and\n**Evergreen//Forever™**\n\nServices\n\nTechnical Services\n\nProfessional Services\n\nTraining and Education\n\nIT Professional Certifications\n\nSupport\n\nContact Support\n\nOpen a Case\n\nPure Community\n\nProduct Security\n\nUpskill You and Your Staff\n\nGrow with the Pure Performance, Education, and Knowledge (PEAK) program.\n\nExplore\n\nTake a Test Drive\n\nEvents and Webinars\n\nCustomer Stories\n\nPure Blog\n\nNewsroom\n\nLeadership\n\nInvestor Relations\n\nResource Center\n\nWhite Papers\n\n2 New\n\nE-books\n\nAnalyst Reports\n\nData Sheets\n\n3 New\n\nOn-demand Webinars\n\nVideos\n\nSolution Briefs\n\n1 New\n\nPure Knowledge\n\n7 New\n\nSee all\n\nConnect with Pure\n\nMeet with an Expert\n\nSchedule a Demo\n\nPure Advisor\n\nChat with Us\n\nCareers with Pure Storage\n\nWe're Hiring\n\nPure//Accelerate® 2023\n\nWatch our collection of keynote videos from Pure//Accelerate 2023 on-demand.\n\nCompany\n\nAbout Pure Storage\n\nCareers with Pure Storage\n\nESG Mission\n\nLeadership\n\nInvestor Relations\n\nESG Report 2023\n\nOur mission to empower innovators goes hand in hand with our commitment to\ndrive responsible business across our value chain.\n\nPure Partner Program\n\nReseller\n\nBecome a Partner\n\nTechnology Alliance Partners\n\nBecome a Partner\n\nManaged Service Providers\n\nBecome a Partner\n\nGlobal System Partners\n\nBecome a Partner\n\nPartner Certifications\n\nBecome a Partner\n\nPartner Portal Login\n\nFind a Pure Partner\n\nWork with Pure Storage and our partners to achieve results that were\npreviously unimaginable.\n\nMain Menu\n\nProducts\n\nSolutions\n\nServices & Support\n\nResources\n\nCompany\n\nPartners\n\nGARTNER REPORT Pure Storage is named A Leader again in the 2022 Gartner® Magic\nQuadrant™ for Distributed File Systems & Object Storage\n\nUS / EN\n\nChoose Your Region\n\nChoose Your Region\n\n  * Australia (English)\n  * Brasil (Português)\n  * China (简体中文)\n  * Deutschland (Deutsch)\n  * España (Español)\n  * France (Français)\n  * Hong Kong (English)\n  * India (English)\n  * Italia (Italiano)\n  * Latinoamérica (Español)\n  * Nederland (Nederlands)\n  * Singapore (English)\n  * Türkiye (Türkçe)\n  * United Kingdom (English)\n  * United States (English)\n  * 台灣 (繁體中文)\n  * 日本 (日本語)\n  * 대한민국 (한국어)\n\n  1. Pure Knowledge __\n  2. What Is a Dedicated GPU Server? \n\n# What Is a Dedicated GPU Server?\n\nA dedicated GPU server is a server with one or more graphics processing units\n(GPUs) that offers increased power and speed for running computationally\nintensive tasks, such as video rendering, data analytics, and machine\nlearning. Dedicated GPU servers may also have a specialized CPU and come with\nlarge amounts of RAM and storage.\n\nThe parallel architecture of a GPU, originally designed to handle graphics and\nvideo processing, allows a dedicated GPU server to manage multiple tasks\nsimultaneously at speeds beyond the abilities of a CPU-based server.\n\n### What Is a GPU Rack Server?  \n\nA GPU rack server is a server equipped with GPUs designed to fit into a server\nrack. A server rack is a rectangular framework with multiple mounting slots\ndesigned to hold rack servers and other networking components. Servers are\nstacked on top of each other to minimize the use of floor space and are slid\nin and out of the rack as necessary.\n\nA GPU rack server offers several advantages, including better space\nutilization, increased scalability, maximized airflow, and easier maintenance.\n\n### Reasons to Use a Dedicated GPU Server  \n\nGPUs are the throughput-optimized, specialized, counterparts to CPUs. Instead\nof having a handful of heavyweight cores with high clock speeds capable of\nperforming a wide variety of computational tasks, GPUs employ thousands of\nlightweight cores optimized to process the same operation in parallel (i.e.,\nSingle Instruction, Multiple Data [SIMD]).\n\nThese cores have instruction sets optimized for dimensional matrix arithmetic\nand floating point calculations, speeding up linear algebra. The end result is\na system optimized for parallel computing.\n\nReasons you might want to use a dedicated GPU server include:\n\n  * Big data analytics pipelines\n  * Streaming video\n  * Image processing\n  * 3D animations and simulations (e.g., the modeling of protein chain folding)\n  * Deep learning applications (e.g., speech recognition)\n  * Hash cracking (e.g., password recovery)\n  * Mining cryptocurrency\n\nIf you’ve got a single operation you need accelerated that can benefit from\nparallel execution across thousands of cores, a dedicated GPU server can help.  \n\n### Types of GPU Rack Servers\n\nGPU rack servers fit into rack servers or cabinets. Server racks and the\nequipment installed in them are measured in rack units, written as “U” or\nsometimes “RU.” A “U” describes the height of equipment (e.g., the height of a\nserver or the height and number of shelves in a server rack).\n\nOne U equals 1.75 inches, so the height of a 1U server would be 1.75 inches\nand a 2U server would be 3.5 inches. A 32U rack unit, for example, can hold 32\n1U servers, 4 8U servers, or 1 32U server.\n\nRead “A Definitive Guide to 19-Inch Server Rack Sizes” for more information\nabout rack sizing.\n\n#### Smaller Form Factors vs. Larger Form Factors\n\nThe primary differences between smaller and larger rack server form factors\nare their density and expandability.\n\n**1U & 2U GPU Rack Servers**\n\nSmaller form factors, such as 1U and 2U GPU rack servers, are designed with\nperformance density in mind but are less powerful than larger GPU server form\nfactors. They’re commonly used because of their lower costs and ability to\nsave server rack space.\n\n1U and 2U GPU rack servers are easy to maintain, highly portable, and easy to\nscale (you can scale performance by using several of them). A 1U server can\ntypically hold a CPU or two, several terabytes of memory, and multiple GPUs. A\n2U server at double the height of the 1U server will give you a little extra\nspace for computing power and storage.\n\nIn smaller form factor servers, GPUs are typically mounted horizontally\nbecause of space restrictions. There’s also less space for PCIe slots and\nstorage, though you can expand these using a PCIe expansion kit or JBOD\nenclosure.\n\n**8U & 16U GPU Rack Servers**\n\nLarger GPU rack servers such as 8U and 16U are geared toward workloads that\nrequire more extensive performance capabilities. They come with more room for\nstorage and additional expansion slots, enabling you to plug in additional\nPCIe cards to increase data processing performance. The additional space also\npromotes better air circulation to prevent overheating.\n\nIn a larger form factor, GPUs are installed vertically with extra room for\npower connections located at the top of the card rather than at the rear.\n\n### How to Size a Dedicated GPU Server\n\nWhen sizing a dedicated GPU server, you’ll need to consider the product\nfeatures you want, as well as your current and future business needs. The\noptimal server configuration depends on your target workloads, the specific\nuse cases of that server, and how fast you need it to be.\n\nDedicated GPU servers can be configured for specific target workloads, such as\nvideo rendering, deep learning training, inference, big data analytics, and\nhigh-performance computing (HPC). The optimal server configuration depends on\nyour target workloads, the specific use cases of that server, and how fast you\nneed it to be.\n\nGPUs use a lot of power and generate tons of heat. They’re larger than CPUs\nand need extra space for power connectors. The server chassis must not only be\nlarge enough to fit the amount of GPUs you want to use but also provide good\nair ventilation to prevent overheating and thermal throttling.\n\n### How Much Does a Dedicated GPU Server Cost?\n\nUnderstandably, costs will vary depending on whether you choose to build your\nown dedicated GPU server, rent a server, or use cloud-based services.\n\nIf you’ll be building your own server, you’ll need to consider the cost of the\nGPU as well as the power supply, chassis, specialized CPU, RAM, and storage.\nYou may also need to consider the costs that come with building on-premises\ndata centers, such as power, space, cooling, and maintenance costs.\n\nGPUs are classified on specializations, and prices vary depending on the use\ncase. For example, NVIDIA offers Tesla V100-based servers suitable for deep\nlearning and high-precision calculations. A top-rated GPU such as NVIDIA’s\nNvidia GTX Titan Z can cost around $3,000.\n\nIf you choose to go with a cloud platform, there are several cloud service\nproviders that offer dedicated GPU-powered server plans including the major\ncloud service providers like AWS V2 Cloud, Google Cloud Platform, and Azure.\nAWS, for example, offers on-demand pricing starting at $0.900 per hour for one\nGPU and four virtual cores.\n\n### GPU Rack Server: Purchase vs. Rent\n\nChoosing whether to purchase or rent comes down to several factors. Your\ncompany’s budget and potential use cases are the main ones.\n\nPurchasing a GPU rack server involves upfront costs. Top-rated GPUs for\nmachine learning workloads can come with a hefty price tag. Add this to the\nmaintenance, energy, and bandwidth costs of storing your GPU server on\npremises, and your initial investment costs could be astronomical.\n\nWith the pace of modern technological innovations, buying a GPU server comes\nwith the risk of it becoming obsolete before you can make a return on your\ninvestment. Updating the system will also incur additional costs.\n\nIf you work with large data sets and plan to deploy your models in a\nproduction environment, consider renting GPU infrastructure through a cloud\nservice provider. This subscription model allows you to pay by the hour or\nmonthly depending on the resources you use and scale up or down based on\ncurrent demands.\n\n### Get State-of-the-art AI Infrastructure with Pure Storage\n\nA dedicated GPU server offers several advantages over a CPU-based server,\nincluding higher performance, increased flexibility, and better utilization of\nCPU resources. Dedicated GPU servers can be purchased outright or rented from\na service provider.\n\nAIRI//S™ is a simple, highly scalable, flash-based AI infrastructure developed\nby Pure Storage® and NVIDIA. AIRI//S is powered by the latest NVIDIA DGX\nsystems with Pure Storage FlashBlade//S® storage, the Pure Storage Purity//FB\noperating system, and Pure1® cloud management.\n\nExperience new levels of AI success with Pure and AIRI//S.\n\n## Pure//Accelerate® 2023 Events\n\nJoin us for a Pure//Accelerate event happening in a city near you.\n\nLearn More\n\n### We Also Recommend...\n\nCheck Out Our Resource Center  Check Out Our Resource Center\n\n11/2023\n\nChang Gung Memorial Hospital Case Study\n\nTo speed up medical data analysis and medical research, the Center for AI in\nMedicine brought in Pure Storage to help improve performance and accelerate\ndata computing. Click to learn more.\n\nCase Study\n\n2 pages\n\n10/2023\n\nUnited Wholesale Mortgage\n\nUnited Wholesale Mortgage (UWM) is the #1 overall mortgage lender in the\nnation. Here’s why they turned to Pure Storage for their storage\ninfrastructure needs.\n\nCase Study\n\n3 pages\n\n01/2019\n\nThe Journey to AI Enabled SaaS\n\nAn AI Primer with Best Practices and Practical Implementation Ideas for SaaS\nProfessionals\n\nWhite Paper\n\n17 pages\n\nExplore Pure\n\nEvent Center\n\nFind upcoming events and webinars and search our catalog of on-demand content.\n\nBlog\n\nKeep up with Pure announcements, product updates, solution details, and\ntechnical guidance.\n\nResource Center\n\nAccess a complete library of analyst reports, white papers, ebooks, and more.\n\nCONTACT US\n\nContact PureInfo icon\n\nCalendar icon\n\nMeet with an Expert\n\nLet’s talk. Book a 1:1 meeting with one of our experts to discuss your\nspecific needs.\n\nSchedule a Meeting\n\nCA,US\n\nChat icon\n\nQuestions, Comments?\n\nHave a question or comment about Pure products or certifications?  We’re here\nto help.\n\nContact Us  Chat with Sales\n\nKey icon\n\nSchedule a Demo\n\nSchedule a live demo and see for yourself how Pure can help transform your\ndata into powerful outcomes.\n\nRequest a Demo\n\n**Call Sales:**   **800-976-6494**\n\n**Media** :  **pr@purestorage.com**\n\n\n\nPure Storage, Inc.  \n\n2555 Augustine Dr.\n\nSanta Clara, CA 95054\n\n**800-379-7873** (general info)\n\n**info@purestorage.com**\n\nCLOSE\n\nCloseClose X icon\n\nUncomplicate data storage, forever\n\nCompany Careers  Sustainability and Social Impact  Investor Relations\nLeadership  Locations\n\nProducts FlashArray  FlashBlade  Evergreen Subscriptions  Portworx\n\nPartners Partner Portal  Partner Certifications\n\nSolutions Applications  AI and Data Analytics  Cloud  Data Protection\nIndustries  Infrastructure\n\nResources Events and Webinars  Podcasts  Newsroom  Blog  Customer Stories\nCustomer Community  Validated Designs\n\nContact Us Schedule a Demo  Pure Advisor (Chat with Sales)  Book a Meeting\nCall Sales  Certifications\n\nUncomplicate data storage, forever\n\nJoin the Conversation\n\nFollow all official Pure Storage social channels\n\n© 2023 Pure Storage, Inc. All rights reserved. Privacy Website Terms Legal\nCookie Settings Do Not Sell or Share My Data\n\nCurrently reading\n\nBack to top\n\nYour Browser Is No Longer Supported!\n\nOlder browsers often represent security risks. In order to deliver the best\npossible experience when using our site, please update to any of these latest\nbrowsers.\n\nsafari\n\nchrome\n\nfirefox\n\nedge\n\n## This Site Uses Cookies\n\nBy clicking “Accept All Cookies”, you agree to the storing of cookies on your\ndevice to enhance site navigation, analyze site usage, and assist in our\nmarketing efforts. Read about our cookie policy\n\nAccept All Cookies\n\nCookies Settings\n\n## Privacy Preference Center\n\nWhen you visit any website, it may store or retrieve information on your\nbrowser, mostly in the form of cookies. This information might be about you,\nyour preferences or your device and is mostly used to make the site work as\nyou expect it to. The information does not usually directly identify you, but\nit can give you a more personalized web experience. Because we respect your\nright to privacy, you can choose not to allow some types of cookies. Click on\nthe different category headings to find out more and change our default\nsettings. However, blocking some types of cookies may impact your experience\nof the site and the services we are able to offer.  \nMore information\n\nAllow All\n\n###  Manage Consent Preferences\n\n#### Strictly Necessary Cookies\n\nAlways Active\n\nThese cookies are necessary for the website to function and cannot be switched\noff in our systems. They are usually only set in response to actions made by\nyou which amount to a request for services, such as setting your privacy\npreferences, logging in or filling in forms.    You can set your browser to\nblock or alert you about these cookies, but some parts of the site will not\nthen work. These cookies do not store any personally identifiable information.\n\n#### Performance Cookies\n\nPerformance Cookies\n\nThese cookies allow us to count visits and traffic sources so we can measure\nand improve the performance of our site. They help us to know which pages are\nthe most and least popular and see how visitors move around the site.    All\ninformation these cookies collect is aggregated and therefore anonymous. If\nyou do not allow these cookies we will not know when you have visited our\nsite, and will not be able to monitor its performance.\n\n#### Functional Cookies\n\nFunctional Cookies\n\nThese cookies enable the website to provide enhanced functionality and\npersonalisation. They may be set by us or by third party providers whose\nservices we have added to our pages.    If you do not allow these cookies then\nsome or all of these services may not function properly.\n\n#### Targeting Cookies\n\nTargeting Cookies\n\nThese cookies may be set through our site by our advertising partners. They\nmay be used by those companies to build a profile of your interests and show\nyou relevant adverts on other sites.    They do not store directly personal\ninformation, but are based on uniquely identifying your browser and internet\ndevice. If you do not allow these cookies, you will experience less targeted\nadvertising.\n\n#### Social Media Cookies\n\nSocial Media Cookies\n\nThese cookies are set by a range of social media services that we have added\nto the site to enable you to share our content with your friends and networks.\nThey are capable of tracking your browser across other sites and building up a\nprofile of your interests. This may impact the content and messages you see on\nother websites you visit.    If you do not allow these cookies you may not be\nable to use or see these sharing tools.\n\nBack Button\n\n### Cookie List\n\nSearch Icon\n\nFilter Icon\n\nClear\n\ncheckbox label label\n\nApply Cancel\n\nConsent Leg.Interest\n\ncheckbox label label\n\ncheckbox label label\n\ncheckbox label label\n\nReject All Confirm My Choices\n\n",
    "links": "[{\"link\": \"https://www.purestorage.com/knowledge/what-is-a-dedicated-gpu-server.html\", \"text\": \"\"}, {\"link\": \"https://www.purestorage.com/knowledge/what-is-a-dedicated-gpu-server.html\", \"text\": \"\"}]",
    "priceAndPlans": "Skip to Content\n\nChoose Your Region\n\nChoose Your Region\n\n  * Australia (English)\n  * Brasil (Português)\n  * China (简体中文)\n  * Deutschland (Deutsch)\n  * España (Español)\n  * France (Français)\n  * Hong Kong (English)\n  * India (English)\n  * Italia (Italiano)\n  * Latinoamérica (Español)\n  * Nederland (Nederlands)\n  * Singapore (English)\n  * Türkiye (Türkçe)\n  * United Kingdom (English)\n  * United States (English)\n  * 台灣 (繁體中文)\n  * 日本 (日本語)\n  * 대한민국 (한국어)\n\nBLOG Pure guarantees energy efficiency SLA with the greenest storage on Earth\n\nUS / EN\n\nProducts Solutions Services & Support Resources Company Partners\n\nCONTACT US\n\n  * Meet with an Expert CA,US\n  * Schedule a Demo\n  * Chat with Sales\n  * Sales (800) 976-6494\n\nCONTACT US\n\n  * Meet with an Expert CA,US\n  * Schedule a Demo\n  * Chat with Sales\n  * Sales (800) 976-6494\n\nAll-flash Storage Platforms\n\nUnified Block and File Storage\n\nEnterprise performance, reliability, and scale with **FlashArray™**\n\nUnstructured Data Storage\n\nFast file and object storage with **FlashBlade®**\n\nIntegrated Platforms\n\nHigh-performance, agility, and simplicity with **AIRI®** , and\n**FlashStack®**\n\nStorage Subscriptions\n\nFlexible non-disruptive storage with **Evergreen//One™** ,\n**Evergreen//Flex™** , and **Evergreen//Forever™**\n\nSoftware and Automation\n\nAgile Data Services\n\nWorkload mobility and security for unparalleled data storage with **Purity**\n\nCloud-native Data Platform\n\nBuild applications anywhere on Kubernetes clusters, containers, or databases\nwith **Portworx®**\n\nAIOps for Smart Storage\n\nData management and monitoring with **Pure1®**\n\nEnterprise Cloud Management\n\nRun enterprise apps with **Pure Cloud Block Store™** and **Azure VMware\nSolution**\n\nStorage-as-Code\n\nProvision, scale, and self-manage with **Pure Fusion™**\n\nDisaster-Recovery-as-a-Service\n\nOrchestrated recovery for VMware to AWS with **Pure Protect™ //DRaaS**\n\nGet the Report\n\nPure Storage is named A Leader in the 2023 Gartner® Magic Quadrant™ for\nDistributed File Services and Object Storage.\n\nApplications\n\nOracle\n\nMicrosoft\n\nSAP\n\nSee all\n\nAI and Data Analytics\n\nArtificial Intelligence\n\nData Warehouse and Streaming  \nAnalytics\n\nLog Analytics\n\nSee all\n\nCloud\n\nPrivate Cloud\n\nHybrid Cloud\n\nPublic Cloud\n\nAzure VMware Solution\n\nData Protection\n\nRansomware\n\nBackup and Recovery\n\nBusiness Continuity and Disaster Recovery\n\nIndustries\n\nHealthcare\n\nFinancial Services\n\nGovernment\n\nSee all\n\nInfrastructure\n\nVMware\n\nVDI\n\nContainers\n\nBare Metal as-a-Service\n\nStorage Subscriptions\n\nAll Evergreen Subscriptions\n\nFlexibility with **Evergreen//One™** , **Evergreen//Flex™** , and\n**Evergreen//Forever™**\n\nServices\n\nTechnical Services\n\nProfessional Services\n\nTraining and Education\n\nIT Professional Certifications\n\nSupport\n\nContact Support\n\nOpen a Case\n\nPure Community\n\nProduct Security\n\nUpskill You and Your Staff\n\nGrow with the Pure Performance, Education, and Knowledge (PEAK) program.\n\nExplore\n\nTake a Test Drive\n\nEvents and Webinars\n\nCustomer Stories\n\nPure Blog\n\nNewsroom\n\nLeadership\n\nInvestor Relations\n\nResource Center\n\nWhite Papers\n\n2 New\n\nE-books\n\nAnalyst Reports\n\nData Sheets\n\n3 New\n\nOn-demand Webinars\n\nVideos\n\nSolution Briefs\n\n1 New\n\nPure Knowledge\n\n7 New\n\nSee all\n\nConnect with Pure\n\nMeet with an Expert\n\nSchedule a Demo\n\nPure Advisor\n\nChat with Us\n\nCareers with Pure Storage\n\nWe're Hiring\n\nPure//Accelerate® 2023\n\nWatch our collection of keynote videos from Pure//Accelerate 2023 on-demand.\n\nCompany\n\nAbout Pure Storage\n\nCareers with Pure Storage\n\nESG Mission\n\nLeadership\n\nInvestor Relations\n\nESG Report 2023\n\nOur mission to empower innovators goes hand in hand with our commitment to\ndrive responsible business across our value chain.\n\nPure Partner Program\n\nReseller\n\nBecome a Partner\n\nTechnology Alliance Partners\n\nBecome a Partner\n\nManaged Service Providers\n\nBecome a Partner\n\nGlobal System Partners\n\nBecome a Partner\n\nPartner Certifications\n\nBecome a Partner\n\nPartner Portal Login\n\nFind a Pure Partner\n\nWork with Pure Storage and our partners to achieve results that were\npreviously unimaginable.\n\nMain Menu\n\nProducts\n\nSolutions\n\nServices & Support\n\nResources\n\nCompany\n\nPartners\n\n  1. Pure Knowledge __\n  2. Evergreen//One: How Much Does Pure Storage Cost? \n\n# What Is Evergreen//One?\n\nEvergreen//One™ is a storage-as-a-service (STaaS) platform that unifies on-\npremises and public-cloud storage resources into a single data storage\nsubscription delivering a true hybrid-cloud experience. An Evergreen//One\nsubscription includes:\n\n  * A simple subscription for your block, file, and object storage needs\n  * Access to Pure1® management tools for managing your hybrid-cloud environment from a single dashboard\n  * 100% consumption-based subscription model that allows you to pay only for what you use\n\nAt Pure Storage, we believe data storage should be simple, seamless, and\nsustainable. Evergreen//One is a unique subscription model fine-tuned to\ndeliver the operational and financial flexibility required to mitigate\nbusiness risk and deliver enterprise-grade storage services via a single\nsubscription. It’s backed by guaranteed SLAs, including:\n\n  * Unrivaled storage **performance** aligned with service tier\n  * 99.9999% **uptime** guarantee\n  * **Zero data loss** for data durability against loss or corruption\n  * 25% storage **capacity** buffer relative to usage\n  * **Zero planned downtime** for upgrades or maintenance \n  * **No data migrations** , eliminating forklift upgrades\n  * **Energy efficiency** measured by maximum number of watts per TiB\n  * **Ransomware recovery** add-on service that guarantees to ship clean arrays next business day with on-site professional services\n  * **Supply chain** optimizations ensure all Evergreen//One service infrastructure is deployed in 28 days or less after order is received.\n\nIn addition to backing our service with SLAs, Pure Storage will pay for your\npower and rack space when you purchase an Evergreen//One subscription. You can\nlower your data center costs and go green because Pure Storage is so energy\nefficient. We’ll help you achieve your sustainability goals—saving you money\nand our planet at the same time. Just ask about our Paid Power and Rack\nCommitment.\n\n## Reduce Risk with Evergreen//One™\n\nDowntime is not an option. Look to Pure to ensure you’re always ready to meet\ncapacity demands.\n\nExplore Evergreen//One\n\n### How Does Evergreen//One Work?\n\nPure provides customers with storage options and flexibility unmatched by any\nlegacy storage provider and on par with other top cloud providers in the\nindustry. With Evergreen//One, you get a fully flexible enterprise-grade\nstorage subscription service that unifies and accelerates data management\nacross on premises and the cloud. As a part of the service, you also get\naccess to the following:\n\n  * **Pure Cloud Block Store™:** This powerful cloud block storage integration tool allows you to manage your AWS and/or Azure cloud storage alongside FlashArray™ and FlashBlade®.\n  * **Bare Metal as-a-Service:** Get simple, on-demand full-stack—network, storage, compute—deployment and support from a single vendor, under one contract.\n  * **Pure1:** This AIOps storage management platform for orchestration, management, VM analytics, and AI predictive support gives you visibility and insight into all of your storage resources, both on premises and in the cloud.\n  * **Evergreen® architecture:** Seamlessly scale performance and storage capacity, with zero downtime or impact to your applications, to meet future data growth.\n\nPure1 automatically adds capacity when you exceed 80% of your allocation. When\nyou subscribe to Evergreen//One, the storage management platform maintains 25%\nor 100TiB headroom (at no extra cost) above your actual usage, making sure\nthat there is always elastic and available capacity when needed so you never\noutgrow your storage.\n\nTo start taking advantage of Evergreen//One and all that it offers, you just\nneed a one-year term of the listed minimum reserve commit and you’re ready to\nstart deploying a variety of block, file, and object storage services on\npremises and in the cloud.\n\n### How Much Does Pure’s Consumption-based Storage Cost?\n\nPure offers a simple and transparent pricing model based on flat $/GiB rates\nfor services. The table below breaks down the basic pricing structure for\nEvergreen//One:\n\n### Evergreen//One Catalog\n\nBenefit from customer-optimized performance and costs.\n\nEvergreen//One Catalog\n\n|\n\nBlock\n\n|\n\n|\n\n|  \n  \n---|---|---|---|---  \n  \n**Tiers**\n\n|\n\n**Ultra**\n\n|\n\n**Premium**\n\n|\n\n**Performance**\n\n|\n\n**Capacity**  \n  \n**Sample Use Cases**\n\n|\n\n**In-memory database  \nOracle  \nSAP HANA  \nTier 0 Database**\n\n|\n\n**VDI/virtualization  \nProduction database**\n\n|\n\n**Tier 1 workloads  \nVSI (VMs)  \nProduction database  \nContainers  \nDR to cloud**\n\n|\n\n**Tier 2 databases and VSI (VMs)  \nIoT, backup, and retention  \nSnapshots**  \n  \n**Relative Performance 1**\n\n|\n\n20x\n\n|\n\n10x\n\n|\n\n5x\n\n|\n\n1x  \n  \n**Minimum Commitment**\n\n|\n\n50 TiB\n\n|\n\n50 TiB\n\n|\n\n50 TiB\n\n|\n\n200 TiB  \n  \n**Starting MSRP per GiB/month 2**\n\n|\n\n$0.219\n\n|\n\n$0.111\n\n|\n\n$0.077\n\n|\n\n$0.042  \n  \n1 Relative performance in BlockIOPs or File/Object Throughput Detailed in KB\n\n2 MSRP based upon host written effective capacity. Rate is for 12-month term,\nminimum TiB Reserve Commit. Greater discounts apply for longer terms and\nhigher capacity.\n\nEvergreen//One Catalog\n\n|\n\nUnified Fast File and Object\n\n|\n\n|  \n  \n---|---|---|---  \n  \n**Tiers**\n\n|\n\n**Ultra**\n\n|\n\n**Premium**\n\n|\n\n**Performance**  \n  \n**Sample Use Cases**\n\n|\n\n**High performance computing  \nAI and ML  \nElectronic Design Automation (EDA)**\n\n|\n\n**High performance analytics  \nImaging data  \nRich media content**\n\n|\n\n**IoT data  \nRapid restore  \nRansomware recovery  \nArtifact repositories  \nSoftware development S-3 enabled apps**  \n  \n**Relative Performance 1**\n\n|\n\n6.5x\n\n|\n\n2.5x\n\n|\n\n1x  \n  \n**Minimum Commitment**\n\n|\n\n75 TiB\n\n|\n\n100 TiB\n\n|\n\n150 TiB  \n  \n**Starting MSRP per GiB / month 2**\n\n|\n\n$0.246\n\n|\n\n$0.154\n\n|\n\n$0.092  \n  \n1 Relative performance in BlockIOPs or File/Object Throughput Detailed in KB\n\n2 MSRP based upon host written effective capacity. Rate is for 12-month term,\nminimum TiB Reserve Commit. Greater discounts apply for longer terms and\nhigher capacity.\n\nEvergreen//One Catalog\n\n|\n\nUDR\n\n|  \n  \n---|---|---  \n  \n**Tiers**\n\n|\n\n**File & Object**\n\n|\n\n**Block & File**  \n  \n**Sample Use Cases**\n\n|\n\n**Information preservation  \nLong-term backup & retention  \nRegulatory, compliance, and business policy archiving  \nSpinning disk replacement**\n\n|\n\n**Picture archiving and communication systems (PACS)  \nSurveillance video footage  \nAnalytics and AI repositories  \nExploratory data analysis**  \n  \n**Minimum Performance**\n\n|\n\n0.5MB/s\n\n|\n\n0.5MB/s  \n  \n**Minimum Commitment**\n\n|\n\n1500 TiB\n\n|\n\n500 TiB  \n  \n**Minimum Term**\n\n|\n\n36 Months\n\n|\n\n36 Months  \n  \n**Starting MSRP per GiB / month**\n\n|\n\n$0.016\n\n|\n\n$0.018  \n  \n### Capacity-Optimized Block Storage\n\nSubscribe to Evergreen//One to access cost-effective, capacity-optimized block\nstorage for Tier 2 workloads, including archives for databases and virtual\nmachines, IoT capacity, test/dev environments, and snapshots. The starting\ncommitment for block storage is 200TiB for 12 months. Reduced rates are\navailable with a storage commitment of 400 or more TiB and/or a longer\ncontract term.\n\n### Performance-Optimized Block Storage\n\nSubscribe to Evergreen//One to access performance-optimized block storage for\nTier 0 and Tier 1 workloads, including hybrid-cloud and multicloud\nenvironments, containers, media libraries, and SQL/NoSQL databases.\n\nChoose from four performance tiers:\n\n  * Capacity (1x)\n  * Performance (5X)\n  * Premium (10X)\n  * Ultra (20X)\n\nThe starting commitment for capacity-optimized block storage is 200TiB for 12\nmonths. Reduced rates are available with a higher storage commitment and/or\nlonger contract terms.\n\n### Unified Fast File and Object Storage\n\nSubscribe to Evergreen//One to access unified fast file and object storage\n(UFFO) that scales out with your business needs. FlashBlade’s scale-out\nmetadata architecture can handle billions of files and objects for a wide\nvariety of applications, including AI, analytics, rapid restore, software\ndevelopment, and S3-enabled apps.\n\nChoose from three performance tiers:\n\n  * Performance (1X)\n  * Premium (2.5X)\n  * Ultra (6.5X)\n\nThe starting commitment for performance-optimized block storage is 75TiB for\n12 months. Reduced rates are available with a higher storage commitment and/or\nlonger contract terms.\n\n### Unified Data Repository Storage\n\nSubscribe to Evergreen//One to support long-term unified data repository (UDR)\nstorage that’s also cost-efficient. This tier is for customers who are\ninterested in use cases ranging from disk replacement, long-term backup and\nretention, regulatory compliance to analytics and AI repositories,\nsurveillance video footage, and picture archiving and communications systems\n(PACS).\n\nChoose from two performance tiers:\n\n  * File and Object\n  * Block and File\n\nThe starting commitment for file and object storage is 1,500TiBs for 36 months\nand 500TiBs for 36 months for block and file storage.\n\n### Flexible Pricing Options for Modern Data Storage Solutions\n\nAs data volumes increase and faster access is required, the challenge of\nmaintaining siloed data warehouses on premises while juggling multiple vendor-\nlocked SLAs in the cloud is not to be understated. Data storage doesn’t have\nto be complicated.\n\nFor organizations interested in Pure Storage’s financing solutions for smart\nasset management that supports the circular economy (i.e., one that\nprioritizes reuse over disposal), we help customers accelerate their\ntransition to STaaS and reuse products in a sustainable way. Learn more about\nthe variety of flexible funding solutions in our financing solution brief.\n\nContact us today to see how your organization can bridge the cloud divide with\na single subscription to Evergreen//One. Uncomplicate your data storage,\nforever.\n\nTo learn more about storage as a service, read the Storage as a Service for\nDummies e-book, visit the Evergreen//One web page, or chat with one of our\nrepresentatives in your area by calling +1 (800) 976-6494.\n\nEvergreen//One : Did You Know? (Video Series)\n\n6220444533001|6220444497001|6220448138001|6253098196001|6265831346001|6265831198001\nDid You Know: A Service-Based Storage Solution|Did You Know: No Forklift\nUpgrades|Did You Know: True On-Demand Storage|Pure as a Service - Pricing\nTransparency|Did You Know? - Seamless Data Mobility|Did You Know? - Financial\nand Operational Flex\n\n1  Pure as-a-Service™ was rebranded to Evergreen//One.\n\n## Pure//Accelerate® 2023 Events\n\nJoin us for a Pure//Accelerate event happening in a city near you.\n\nLearn More\n\n### We Also Recommend...\n\nCheck Out Our Resource Center  Check Out Our Resource Center\n\n11/2023\n\nModernizing Citizen Services for a Digital Society\n\nThis government agency achieved new levels of performance and availability\nwhile cutting its data center costs and footprint. Read the case study to\nlearn more.\n\nCase Study\n\n2 pages\n\n10/2023\n\nUnited Wholesale Mortgage\n\nUnited Wholesale Mortgage (UWM) is the #1 overall mortgage lender in the\nnation. Here’s why they turned to Pure Storage for their storage\ninfrastructure needs.\n\nCase Study\n\n3 pages\n\n07/2021\n\nHacker's Guide to Ransomware Mitigation and Recovery\n\nThe “Hacker's Guide to Ransomware Mitigation and Recovery” provides insight\nand tips to help you safeguard your data from ransomware.\n\nEbook\n\n17 pages\n\nExplore Pure\n\nEvent Center\n\nFind upcoming events and webinars and search our catalog of on-demand content.\n\nBlog\n\nKeep up with Pure announcements, product updates, solution details, and\ntechnical guidance.\n\nResource Center\n\nAccess a complete library of analyst reports, white papers, ebooks, and more.\n\nCONTACT US\n\nContact PureInfo icon\n\nCalendar icon\n\nMeet with an Expert\n\nLet’s talk. Book a 1:1 meeting with one of our experts to discuss your\nspecific needs.\n\nSchedule a Meeting\n\nCA,US\n\nChat icon\n\nQuestions, Comments?\n\nHave a question or comment about Pure products or certifications?  We’re here\nto help.\n\nContact Us  Chat with Sales\n\nKey icon\n\nSchedule a Demo\n\nSchedule a live demo and see for yourself how Pure can help transform your\ndata into powerful outcomes.\n\nRequest a Demo\n\n**Call Sales:**   **800-976-6494**\n\n**Media** :  **pr@purestorage.com**\n\n\n\nPure Storage, Inc.  \n\n2555 Augustine Dr.\n\nSanta Clara, CA 95054\n\n**800-379-7873** (general info)\n\n**info@purestorage.com**\n\nCLOSE\n\nCloseClose X icon\n\nUncomplicate data storage, forever\n\nCompany Careers  Sustainability and Social Impact  Investor Relations\nLeadership  Locations\n\nProducts FlashArray  FlashBlade  Evergreen Subscriptions  Portworx\n\nPartners Partner Portal  Partner Certifications\n\nSolutions Applications  AI and Data Analytics  Cloud  Data Protection\nIndustries  Infrastructure\n\nResources Events and Webinars  Podcasts  Newsroom  Blog  Customer Stories\nCustomer Community  Validated Designs\n\nContact Us Schedule a Demo  Pure Advisor (Chat with Sales)  Book a Meeting\nCall Sales  Certifications\n\nUncomplicate data storage, forever\n\nJoin the Conversation\n\nFollow all official Pure Storage social channels\n\n© 2023 Pure Storage, Inc. All rights reserved. Privacy Website Terms Legal\nCookie Settings Do Not Sell or Share My Data\n\nCurrently reading\n\nBack to top\n\nYour Browser Is No Longer Supported!\n\nOlder browsers often represent security risks. In order to deliver the best\npossible experience when using our site, please update to any of these latest\nbrowsers.\n\nsafari\n\nchrome\n\nfirefox\n\nedge\n\n"
}