{
    "summary": "  * Compliance\n  * Data quality\n\n  * Support\n  * Careers\n\nEnglish\n\n  * English\n\n  * Products\n    * Core platform\n      * FinScan Features\n      * Customer Screening\n      * Entity Screening\n      * Transaction Screening\n    * Modules\n      * Data Prep\n      * UBO Due Diligence\n      * ID Validation\n      * Risk Scoring\n      * Enhanced Due Diligence\n  * Industries\n    * Industries\n      * Financial Services\n      * Insurance\n      * Healthcare\n      * Credit Card Issuers\n  * AML Consulting\n  * Resources\n    * Resources\n      * Insights\n      * Case Studies\n      * News\n      * Events\n  * Company\n\nBook discovery call\n\nSearch\n\n  * Products\n    * Core platform\n      * FinScan Features\n      * Customer Screening\n      * Entity Screening\n      * Transaction Screening\n    * Modules\n      * Data Prep\n      * UBO Due Diligence\n      * ID Validation\n      * Risk Scoring\n      * Enhanced Due Diligence\n  * Industries\n    * Industries\n      * Financial Services\n      * Insurance\n      * Healthcare\n      * Credit Card Issuers\n  * AML Consulting\n  * Resources\n    * Gap\n      * Insights\n      * Case Studies\n      * News\n      * Events\n  * Company\n\n  * Support\n  * Careers\n  * LinkedIn\n\nEnglish\n\n  * English\n\nBook discovery call\n\nFollow FinScan\n\n#  A Step-by-Step Guide to Effective Sanctions Screening [2023 Guide]\n\nThis guide delves into all aspects of sanctions screening, including the\nregulatory landscape, the significance of sanctions screening, the\nrequirements and challenges involved, and best practices for implementing a\nsanctions screening program.\n\nAlexis Caulliez\n\nShare />\n\n#####  Table of contents\n\n###### What is sanctions screening?\n\n###### Why is sanctions screening required?\n\n###### Case studies of companies fined by regulatory authorities\n\n###### What are the sanctions screening requirements?\n\n###### Which sanctions lists should you screen against and where do you find\nthe data sources?\n\n###### Setting up a sanctions screening program\n\n###### Challenges to sanctions screening\n\n###### What is your best path forward?\n\nWith the increasing complexity and scope of international sanctions, companies\nneed to ensure they have effective sanctions screening processes in place to\navoid significant legal and financial repercussions related to money\nlaundering and terrorist financing.\n\nHowever, many businesses struggle with understanding the requirements and\nchallenges of managing sanctions screening and sanctions risk. With different\nsanctions lists to consider, varied regulations to comply with, and the\npotential for significant financial costs and penalties, businesses are in\nsearch of guidance to navigate this complex process.\n\nIn this article, we will provide a comprehensive guide to sanctions screening\nand best practices to ensure your business remains compliant. We will cover\nthe regulatory landscape, the importance of sanctions screening, the\nrequirements and challenges of sanctions screening, and best practices for\nimplementing a sanctions screening program. By the end of this article, you\nwill have a better understanding of how to effectively manage the complexities\nof sanctions screening and protect your business from financial crime.\n\n## What is sanctions screening?\n\nSanctions screening is the process of screening individuals and entities\nagainst lists of sanctioned parties. Sanctions lists are compiled and\nmaintained by governments and international organizations, such as the United\nStates’ Office of Foreign Assets Control (OFAC), the United Kingdom’s Office\nof Financial Sanctions Implementation (OFSI), the European Union’s\nConsolidated List of Person, Groups and Entities Subject to EU Financial\nSanctions, and the United Nations’ Security Council Consolidated List. These\nlists identify individuals, companies, and organizations that are subject to\nsanctions for a variety of reasons, including, among other things, involvement\nin war, money laundering, terrorism, narcotics trafficking, human rights\nabuses, and weapons proliferation.\n\n## Why is sanctions screening required?\n\nSanctions screening is a required control to prevent illicit transactions by\nprohibited entities or individuals seeking access to the financial system. It\nis required by law in many countries, including the United States, Canada, the\nUnited Kingdom, and the European Union to name a few. Failure to comply with\nsanctions regulations can result in significant financial, legal, and\nreputational risks for businesses. Penalties for non-compliance can include\nfines, and in the most severe cases can lead to loss of business licenses, and\neven criminal charges.\n\n## Case studies of companies fined by regulatory authorities\n\n **Microsoft** : In April 2023, Microsoft was fined $2,980,265.86 for\nexporting services and software from the United States to sanctioned\njurisdictions and Specially Designated Nationals (SDNs) in violation of OFAC’s\nCuba, Iran, Syria, and Ukraine/Russia-related sanctions program. By not\nidentifying end users, OFAC found Microsoft to have failed to prevent the use\nof it’s products by sanctioned parties. (Source OFAC: read more)\n\n**BitPay, Inc**.: In 2021, BitPay, Inc., a bitcoin payment processor based in\nthe United States, was fined $507,375 by OFAC for 2,102 apparent violations of\nmultiple sanctions programs. OFAC found that BitPay had processed digital\ncurrency transactions on behalf of individuals in sanctioned jurisdictions,\nincluding Cuba, North Korea, Iran, Sudan, and Syria, among others. (Source:\nOFAC – read more)\n\n**Standard Chartered Bank** : In 2019, the FCA fined Standard Chartered Bank\n£102,163,200 for failures in its anti-money laundering controls and sanctions\nscreening processes. The FCA found that Standard Chartered had failed to\nadequately identify and manage the risks associated with customers who may\nhave been involved in sanctioned countries, including Iran, Syria, and\nZimbabwe. (Source: FCA – read more)\n\n**Société Générale** : In 2018, Société Générale S.A. was fined $53,966,916 by\nOFAC for violating US sanctions against Cuba, Iran, and Sudan. OFAC found that\nSociété Générale had processed transactions on behalf of sanctioned parties,\nand had failed to implement adequate sanctions compliance policies and\nprocedures. (Source: OFAC – read more)\n\nThese examples highlight the importance of effective sanctions screening\nprocesses and the serious consequences of non-compliance with sanctions\nrequirements. Companies that operate in multiple jurisdictions need to ensure\nthat they have effective sanctions screening processes in place that address\nlocal and global regulations to avoid legal and financial repercussions.\n\n## What are the sanctions screening requirements?\n\nBusinesses are required to not conduct business with sanctioned individuals\nand entities. To do so, they are required to screen all customers, vendors,\nUBOs, employees and other entities that they do business with against certain\ngovernment-maintained sanctions lists depending on the jurisdiction in which\nthey operate. Sanctions screening, also referred to as name screening, should\nbe conducted during the know your customer (KYC) process and on a regular\nbasis and must be documented to ensure compliance.\n\nIn addition, businesses should also screen transactions for potential\nsanctions violations. This applies to financial transactions such as payments\nor loans, as well as non-financial transactions such as the exchange of goods\nor services. In addition to screening the sender and recipient of a\ntransaction, businesses must also screen any intermediaries involved in the\ntransaction to ensure that they are not subject to sanctions. This process is\nknown as transaction screening.\n\n## Which sanctions lists should you screen against and where do you find the\ndata sources?\n\nTo adhere to sanctions screening requirements, businesses must conduct\nscreenings against all pertinent global sanctions lists and watch lists in all\njurisdictions where they conduct operations. It’s essential to note that if a\nbusiness conducts transactions in US dollar, it falls under US jurisdiction,\nand thus must comply with US sanctions regulations. For example:\n\n  * In the United States, the primary sanctions list is the Specially Designated Nationals and Blocked Persons List (SDN) provided by the Office of Foreign Assets Control (OFAC). Other relevant lists include the U.S. Department of Commerce’s, Bureau of Industry and Security (BIS) Entity List (EL), Denied Persons List (DPL), and Unverified List (UVL).\n  * In the European Union, the primary list is the Consolidated List of Sanctions, maintained by the Directorate-General for Financial Stability, Financial Services and Capital Markets Union (DG FISMA).\n  * In the United Kingdom, the primary list is the Consolidated List of Financial Sanctions Targets, maintained by the Office of Financial Sanctions Implementation within HM treasury.\n  * In Canada, the primary list is the Consolidated Canadian Autonomous Sanctions List, published by the Government of Canada.\n\nIt is also recommended for businesses to screen against the United Nations\nSecurity Council Consolidated List and other lists relevant to their region or\nindustry.\n\nSanctions list data is typically available on government websites and from\ndata providers like Dow Jones and World-Check. It’s important to keep up to\ndate with changes to sanctions lists, as newly sanctioned entities are added\nand removed on a regular basis.\n\n## Setting up a sanctions screening program\n\nSetting up a sanctions screening program involves several steps, including:\n\n  1. **Determine your sanctions risks and obligations** : Identify the risk associated with your business and the sanctions lists relevant to your business based on the jurisdictions in which you operate. Get some guidance from industry experts.\n  2. **Choose sanctions screening software** : Select reliable and efficient AML sanction screening software that can handle all of your data and scale as your needs grow.\n  3. **Customize your sanctions compliance and screening program** : Customize your internal controls and procedures as well as your screening tools and configurations to effectively identify and manage sanctions risks.\n  4. **Integrate the software** : Integrate the sanctions screening software into your existing systems and workflows to ensure a smooth and efficient process.\n  5. **Train your staff** : Provide training to employees on how to use the screening software and to make sure they understand the importance of sanctions compliance.\n  6. **Regularly screen against sanctions lists** : Conduct sanctions screening during onboarding and on a regular basis for all customers, vendors, and other entities that your business interacts with.\n  7. **Keep up to date with changes** : Stay informed of any changes or updates to sanctions lists and adjust your screening program accordingly.\n  8. **Monitor and evaluate the effectiveness of the program** : Establish procedures for monitoring and evaluating the effectiveness of the program and ensure that your program is scalable and can adapt to changes in your business or the regulatory environment.\n\nIn addition, we suggest that you consider the Compliance Commitments Framework\nprovided by the Office of Foreign Assets Control (OFAC).\n\n## Challenges to sanctions screening\n\nSanctions screening can be a challenging process for businesses due to various\nfactors that can impact its effectiveness. Some common challenges include:\n\n  * **Data quality** : The quality of the data used in sanctions screening can impact the accuracy of results. Poor data quality can result in false negatives (missing a true hit) and false positives resulting in inefficiency and exposing the business to the risk of hefty fines.\n  * **Volume of data** : Businesses with large customer bases and high transaction volumes may find it challenging to process a significant amount of customer data quickly.\n  * **Keeping sanctions data up to date** : Sanctions lists are regularly updated, and businesses must keep their screening systems current to identify new risks.\n  * **Resources** : Establishing a comprehensive sanctions screening program requires a significant investment in terms of personnel, time, and money.\n  * **Keeping up with regulations** : Global sanctions regulations and requirements can vary across different jurisdictions making it challenging for businesses to stay up to date and avoid potential violations.\n\nAddressing these challenges requires financial institutions and other\nbusinesses to implement the appropriate tools and processes, such as high-\nquality data management, advanced screening algorithms, and regular updates to\nsanctions lists. Additionally, businesses need to establish clear compliance\nprocedures, including record-keeping, escalation workflows, and the use of\ncase management tools to ensure that sanctions screening processes are carried\nout effectively and efficiently.\n\n## What is your best path forward?\n\nImplementing an effective sanctions screening program is crucial for\nbusinesses to comply with regulations and avoid penalties. To ensure the\neffectiveness of their sanctions screening program, businesses can work with\nFinScan Consulting Service, which provides expert guidance to evaluate and\nimprove their sanctions screening existing program.\n\nAt FinScan, we are dedicated to providing cutting-edge sanctions screening\nsolutions tailored to our clients’ unique needs. With our powerful screening\nsoftware and extensive sanctions database, we can help your organization\nachieve regulatory compliance and peace of mind. Contact us today to learn\nmore about how we can help with your sanctions screening needs.\n\nX\n\nWebinar: Navigating AML Compliance: 2023 Recap and 2024 Outlook – December 6,\n2023 Register now  \n  \n---  \n  \n  * Products\n    * Core platform\n      * FinScan features\n      * Customer screening\n      * Entity screening\n      * Transaction screening\n    * Modules\n      * Data prep\n      * UBO due diligence\n      * ID validation\n      * Risk scoring\n      * Enhanced due diligence\n  * Industries\n    * Industries\n      * Financial services\n      * Insurance\n      * Healthcare\n      * Credit card issuers\n  * AML Consulting\n  * Resources\n    * Gap\n      * Insights\n      * Case studies\n      * News\n      * Events\n  * Company\n    * Gap\n    * Terms\n      * Gap\n        * Privacy policy\n        * Cookie policy\n        * Terms & conditions\n        * Email preferences\n\n  * Support\n  * Careers\n  * LinkedIn\n\nEnglish\n\n  * English\n\nAll content © 2023 Innovative Systems, Inc. All Rights Reserved\n\n##### Book discovery call\n\n",
    "links": "[{\"link\": \"https://finscan.com/\", \"text\": \"\"}, {\"link\": \"https://finscan.com/\", \"text\": \"\"}, {\"link\": \"https://www.linkedin.com/sharing/share-offsite/?url=https://finscan.com/insights/sanctions-screening/\", \"text\": \"\"}, {\"link\": \"https://twitter.com/share?text=A Step-by-Step Guide to Effective Sanctions Screening [2023 Guide]&url=https://finscan.com/insights/sanctions-screening/&via=wplogout\", \"text\": \"\"}, {\"link\": \"mailto:?subject=A Step-by-Step Guide to Effective Sanctions Screening [2023 Guide]&body=https://finscan.com/insights/sanctions-screening/\", \"text\": \"\"}]"
}