{
    "summary": "CASE STUDY\n\nHow a Nordic bank increased successful APP fraud reclaims from 10% to 80%\n\nDownload\n\n  *   * \n\nMission\n\nProducts\n\n  * Overview\n  * Salv Bridge\n  * Screening\n  * Monitoring\n  * Risk Scoring\n\nCompany\n\n  * About\n  * Careers\n  * Contact us\n\nInsights\n\n  * Blog\n  * Case studies\n  * Salv news\n  * Salv in media\n\nBook a demo\n\nscreening •  12 min read\n\n# The complete guide to sanctions screening\n\nTaavi Tamkivi\n\nFOUNDER, CEO, & PROFESSIONAL CRIME-FIGHTER\n\nIn 2022, governments around the world imposed unprecedented restrictions on\nRussia for invading Ukraine. This move is part of a broader pattern where\ninternational sanctions have become a more frequently used tool of foreign\npolicy. While the effect of these sanctions presents a topic for another\ndiscussion, there is a clear upward trend in sanctions against Iran, Belarus,\nMyanmar, and North Korea. In response to global security threats, major\nsanctioning jurisdictions have expanded their sanctions lists by fivefold and\nmore, with Canada reporting over 100% increase. As we move into 2024, with\nRussia as the most sanctioned country, governments are increasingly leveraging\nsanctions against human rights violators and global corruption, as data from\nCastellum.AI shows.\n\nThis trend presents a major challenge for regulated institutions as they try\nto stay on top of the evolving sanctions landscape and avoid costly\nviolations. In this dynamic setting, sanctions screening has become an\nessential part of compliance in many industry sectors. This guide will explore\nthe nuances of sanctions screening, giving you tools to identify potential\nchallenges and build an effective sanctions screening process.\n\n## What are sanctions?\n\nSanctions are penalties imposed on a country, government officials, companies,\nand private citizens, for breaches of international agreements. Sanctions seek\nto force a change in political behaviour through a series of restrictive\nmeasures but essentially serve to pressure the targeted entities to comply\nwith international laws. It is important to keep in mind that sanctions are\ntemporary by nature and can be lifted once a sanctioned entity complies with\nall international laws and regulations, achieving a desired political effect.\n\n## What is a sanctions list?\n\nSanctions lists essentially are the instructions for regulated institutions\nthat have a legal obligation to comply with sanctions screening requirements.\nThey can can be applied to individuals, countries, and legal entities\nresponsible for certain violations, including war crimes, terrorism, terrorist\nfinancing, drug trafficking, and proliferation of weapons of mass destruction.\nYou should know that although the sanctioning bodies try to coordinate their\nstrategy, their sanctions lists don’t always align.\n\nSome of the prominent sanctioning bodies include:\n\n**The United Nations(UN) Security Council**: Their sanctions have ranged from\ncomprehensive economic and trade sanctions to arms embargoes and travel bans,\nand are binding on all member states.\n\n**The Office of Foreign Assets Control (OFAC)**: OFAC administers and enforces\neconomic and trade sanctions against targeted foreign countries and regimes,\nwhich are applicable to all U.S. citizens and residents, as well as business\nentities, regardless of their location.\n\n**His Majesty’s Treasury (HMT)**: HMT governs the UK’s sanctions regime,\naffecting individuals and entities operating or carrying out activities within\nthe UK’s jurisdiction. This includes a consolidated list of persons and\norganisations that are subject to financial sanctions.\n\n**The European Union External Action Service (EU EEAS)**: EEAS sanctions aim\nto safeguard the EU’s values, fundamental interests and security in connection\nwith the Common Foreign and Security Policy (CFSP). Sanctions from the EU EEAS\nimpact all EU citizens and companies established within the EU member\ncountries.\n\n## Types of sanctions\n\nThe European Council defines sanctions as the measures designed to address\nconflicts and promote peace, democracy, and the rule of law. Restrictions can\nbe applied on different levels and include diplomatic sanctions and the\nsanctions that require a specific legal basis in the EU Treaties. There are\nseveral types of sanctions that stand out:\n\n  * **Diplomatic sanctions** can involve severing diplomatic ties or a collective recall of EU member states’ ambassadors from the targeted country.\n  * **Travel bans** on identified individuals, prohibiting their entry into the EU or restricting EU nationals to their country of citizenship.\n  * **Asset freezes** for identified individuals or entities.\n  * **Economic sanctions** that might include import/export bans, investment restrictions, or prohibitions on providing certain services in specific sectors.\n\n## Common sanctions risks to organisations\n\nFor most regulated institutions, compliance with sanctions is a major pain\npoint. It creates a tense, high-stakes environment, where every decision you\nmake can have a potentially devastating effect on your business and\noperations. Without a system in place for customer and transaction screening,\nyou put your company at greater risk of sanctions violations.\n\nFailure to comply with sanctions can negatively impact your relationships with\ncustomers, partners, and regulators, potentially leading to long-term\nrepercussions. For instance, in 2020, HSBC’s share price plummeted due to the\nallegations of money laundering, which resulted in a fine of £63.9m by the\nUK’s financial regulator. However, fines are not the only risk to your\nbusiness. Violating regulations, even unknowingly, can lead to a loss of\ntrust, harm your organisation’s reputation and credibility, and cost you\ncustomers in the long run.\n\nSanctions compliance is not just about checking boxes, targets, and numbers.\nYou should make sure that your customers are screened on a regular basis to\nmaintain compliance in the ever-changing sanctions landscape.\n\nAdvanced technology can greatly simplify your sanctions screening process.\nWith sanctions screening software, you will identify areas of potential\nconcern and make more informed decisions.\n\n## Sanctions screening components\n\nAt the start, you want to understand if the person or entity you are dealing\nwith is on any of the sanctions lists. There are two ways to approach this:\n\n### Name screening\n\nName screening incorporates screening against sanctions lists. As the name\nsuggests, it allows you to check individuals, businesses, including banks, and\ncounterparties against global sanctions lists.\n\n### Reference screening\n\nReference screening is another screening strategy that allows you to look for\npotential matches in banking payment reference texts.\n\nReference screening requires more work: the system automatically checks and\nverifies every element in the reference, and if there is more than one mention\nof the same name, the screening results in multiple matches.\n\n## What can you do with sanctions screening?\n\nAn effective sanctions screening system is cost-effective and easy to manage.\nIt helps you to reduce the friction for your customers by providing them with\na convenient and safe experience.\n\nYou can do much more with sanctions screening, though.\n\n### Reduce false positives\n\nIncorrect, duplicate, or incomplete data in sanctions screening can generate a\nlarge number of false positive alerts. The best way to manage your screening\noutcomes is to understand and structure your customer data.\n\nIt is possible to achieve greater efficiency by automatically resolving false\npositives in your screening process. We’ll talk more about that below.\n\n### Minimise manual workload\n\nGrowing workload is one of the biggest concerns for everyone in the compliance\nindustry right now. You may think that the easiest way to tackle this is to\ngrow your compliance team until the point it matches the workload. But that’s\nnot the only way.\n\nYou can effectively minimise the screening workload when you know exactly what\nyou have to screen against. By understanding the regulatory requirements\napplicable to your business, you can adjust your risk appetite and screen\nintelligently, without overcompensating for a lack of knowledge.\n\nA system that generates less false positives, has an intuitive interface, and\nis easy to manage can minimise manual effort and support your team to make a\nmore meaningful impact.\n\n### Manage operational costs\n\nHigh workload translates into higher costs for your business. Choosing in\nfavour of sanctions screening software rather than relying on in-house\nresources can help you to keep your team as small as possible, while taking\ncare of most, if not all, of your sanctions screening needs.\n\n### Improve employee & customer retention\n\nYour compliance agents don’t want to work on mundane, repetitive tasks.\nEnsuring a stable and efficient sanctions screening process will not only have\na direct effect on your customers, but also on your employees, their\nproductivity and efficiency at work.\n\nA sanctions screening system optimised for maximum efficiency will free up\nyour compliance team to focus on more meaningful, higher-level tasks.\n\n### Decrease the risk of sanctions violations\n\nThere are nearly 100 jurisdictions that have imposed sanctions to date, so\nkeeping abreast of what’s happening is a Herculean task. You need up-to-date\ndata, coupled with the right screening technology, to avoid fines and balance\nyour resources and spending.\n\nIntegration with Salv Bridge, a platform for collaborative investigations,\nallows you to send an RFI to a counterparty financial institution and gain\ninformation and insights crucial for resolving screening alerts. Learn how it\nbrings together fincrime investigation teams across large banking groups,\nfintechs, and VASPs.\n\n## A new approach to sanctions screening\n\nSalv introduces a user-centric, customisable approach to sanctions screening.\nWith Salv, you can screen both customers and transactions against sanctions,\nPEP, and adverse media lists, irrespective of the number and complexity of\ndata fields. You can access both customer and sanctions alerts in one page and\nresolve multiple alerts with a single decision.\n\nThere are additional features that you are unlikely to find in conventional\nsanctions screening software.\n\n### Consolidated view of global sanctions lists\n\nYou can set up and configure the screening process any way you want. A\nconsolidated view of global sanctions lists allows you to set up sanctions\nlists, person re-screening, fuzzy matching, and BIC length without the hassle\nof waiting to hear from your provider.\n\nAll sanctions lists in our system are configurable and can be switched on and\noff as desired, depending on your organisation’s jurisdiction and governing\nbodies. To give a few more examples, you can add or remove sanctions lists,\ncheck and uncheck screening parameters, tune prefixes, and play around with\nfuzzy thresholds for different screenings.\n\n### Dow Jones Sanctions Control & Ownership data\n\nAt Salv, we use Dow Jones Sanctions Control & Ownership data. Dow Jones\ncollects comprehensive ownership and control data available from public\nsources, such as company reports, including beneficial ownership information\nabout the subsidiaries.\n\n### Custom screening lists\n\nYou can add, remove, or edit your internal screening lists in the platform\nusing Salv’s advanced screening engine. Additionally, you can use API\nintegration to automatically synchronise your screening lists between your\nsystem and the Salv UI, eliminating the need for additional list management.\n\n### Screening alerts search engine\n\nTo relieve operational burden and make screening search lightning-fast, our\nproduct engineer Tarmo developed the screening alerts search engine that\nchanges everything. The screening alerts search engine works almost like a\nreal-time search: it simplifies the process of locating and accessing\nscreening alerts and frees up compliance agents to spend more time on\ninvestigating rather than reviewing.\n\nWe speed up alert handling time by automatically assigning alerts in the\nbackground. This way, available agents can quickly review the alerts and\ndecide whether further investigation is needed or if the alert doesn’t\nrepresent a concern. This feature alone allowed one of our biggest customers,\na leading banking service provider in Europe and the UK, to decrease alert\nhandling time by 3x.\n\n### Multifunctional UI\n\nLast but not least, Salv UI supports multiple flows and wraps around the core\nfeatures like a candy wrapper, offering both aesthetic appeal and functional\nease. It offers several viewing options: you can either use customer view or\nsanctions alerts view, so you can conveniently access and browse customer and\ntransaction data we have screened. According to our screening logic, one\ntransaction can generate multiple alerts. Alerts, in turn, can have multiple\nmatches as well. With Salv, you can locate all alerts quickly on one page,\noften using one view alone.\n\n## Sanctions screening process with Salv\n\nWe kickstart the process with data pre-processing. In order for sanctions\nscreening to work as intended, you should collect and hand over accurate and\nhigh-quality customer data. Depending on your organisation’s needs and\npreferences, we can process and screen reference and transactional data.\n\n### Step 1: Pre-processing\n\nDuring the pre-processing step, the data is converted to the same standardised\nformat: lower case Latin script. Then we remove the redundant data that comes\nas part of the payment scheme. After this initial step is done, it’s time for\nElasticsearch.\n\n### Step 2: Name matching\n\nWe use Elasticsearch to quickly search for name matches across all sanctions\nlists. With Elasticsearch, we can identify potential name matches and sanction\nhits and score them according to OFAC logic. It’s like looking up names in a\nphone book.\n\n### Step 3: Fuzzy matching\n\nWe use fuzzy logic to further narrow down screening results. Fuzzy matching\nallows us to identify all non-exact meaningful matches that contain sanctioned\npersons or entities. We generally use a fuzzy score from 0 to 100: a\nmeaningful match is assigned a score between 95 and 100.\n\n### Step 4: Goodlisting\n\nIt’s an additional step that allows us to remove repetitive alerts, meaning\nthat you will not get a new alert for the same person or transaction again,\nwhen exactly the same data fields are matched.\n\n### Step 5: Screening rules\n\nAt Salv, screening rules are used to automatically resolve false positive\nalerts. Our library contains dozens of pre-defined screening rules for person\nand transaction reference screening, transaction counterparty name screening,\nand transaction counterparty bank name or BIC code screening. You can change\nscreening rules or add new ones, and test them on historical data as an\nadditional safety measure. The whole process is clear, transparent, and fully\nauditable.\n\n### Step 6: Rescreening\n\nWith the unpredictability of new sanctions regimes, it’s important to be able\nto immediately identify and remove sanctioned subjects from your customer\nbase. We do that with the help of rescreening. Rescreening is an additional\nstep that helps us to make sure your business is not associated with any\nsanctioned persons or entities. We rescreen your entire customer base, or a\nportion of it, every morning, so you can sleep better and wake up when you\nwant.\n\n### Step 7: Screening exemption rules\n\nScreening exemption rules help you to exclude entities that you no longer need\nto screen, e.g., off-boarded customers. During the integration stage, you can\ntest different configurations on historical data and choose the one that best\nworks for you.\n\n## Challenges in sanctions screening process\n\nChallenges within your sanctions screening process depend on how often\nsanctions lists are updated and how soon your compliance team can adapt to the\nchanges. Your team must have access to the latest data, and make decisions\nquickly. But there are more challenges that can turn your sanctions screening\nprogramme into a living nightmare.\n\n### Growing number of false positive alerts\n\nYou may think that screening your entire customer base will give you a higher\ndegree of confidence in the results. But, quite the opposite, over-screening\ncan generate too many false positive alerts that will need to be reviewed\nseparately to confirm they are not sanctioned.\n\nNowadays, many, if not most, of your false positives can be resolved\nautomatically using sanctions screening software.\n\n### Rising operational costs\n\nYou need to have a clear understanding of who you want to screen and why.\nOver-screening creates higher operational costs, adding more burden and\ndemanding more time and effort from your compliance team. Every sanction check\nincreases the costs for the end users, which, in turn, creates more friction.\n\n### Customer friction vs. customer satisfaction\n\nCustomer friction is what ruins your customers’ experience with your business\nand takes away your opportunity to make a positive and lasting impact on your\ncustomers. Sometimes customer friction is something that just happens. But we\nknow what can make it much, much worse:\n\n✔️ Suspending your good customers’ transactions for sanction checks.\n\n✔️ Leaving your customers in the dark about what’s going on.\n\n✔️ Breaking hearts, not delivering on promises, missing deadlines.\n\nAs a result, you generate a lot of frustration and get some bad reviews (which\nwould definitely take you off Santa’s nice list). With every bad review, you\nhave to work harder. If you want your business to grow, you should prioritise\nyour customers’ safety and convenience, and create a seamless customer\nexperience.\n\n### Lack of cultural knowledge\n\nIn Estonia, alert hits between Estonian and Arabic names (Anu Tali vs. Abu\nTalib) are very common. Transliteration can be a big issue. Alert hits between\ncompany and personal names can create unnecessary confusion for compliance\nteams, unless your compliance agents are equipped with the knowledge,\nawareness, and understanding of different linguistic contexts.\n\nWithout a good cultural knowledge, your compliance team will struggle to\nproperly review and investigate screening alerts. The same goes for your\nsanctions screening system. You must put a great deal of effort into training\nthe model and improving the connections between the names and the screening\nlogic. The language training is based on semantics, it takes time to get\nthings right, so you should be prepared for a long slog.\n\nMany language technologies predominantly focus on English, but Salv is now\nincorporating Eastern European transliteration in conjunction with Dow Jones\ndata. This is crucial in the matching logic, especially when it comes to\nEastern European name matching.\n\nTo get the best results from sanctions screening, you have to use every tool\nat your disposal. Instead of hastily selecting software, carefully assess your\nrisks and consider all options.\n\n* * *\n\nAs we continue to enhance our screening capabilities and align them with the\nexpanding sanctions lists, criminals too continue to adapt and evolve.\nSanctions screening is not a magic bullet. Clearly, there is more we can do to\nstop suspicious actors from abusing our systems. Combined with the right\napproach to transaction monitoring, sanctions screening can act as the\nultimate shield against financial crime. It can completely transform your\ncompliance as well as the way you do business. No more sleepless nights\nworrying about things that are out of your control. We got you covered.\n\nDon’t wait until it’s too late: sanctions screening is something you can\nexplore already today. Have a taste of sanctions screening with Salv and get\neverything you need to ramp up your sanctions compliance.\n\nAutomate tedious screening tasks with Salv Screening\n\nLearn more\n\nTable of Contents\n\n  * What are sanctions?\n  * What is a sanctions list?\n  * Types of sanctions\n  * Common sanctions risks to organisations\n  * Sanctions screening components\n  * What can you do with sanctions screening?\n  * A new approach to sanctions screening\n  * Sanctions screening process with Salv\n  * Challenges in sanctions screening process\n\nShare this story\n\n×\n\nWe build security to our products and organisation from the start. We use\nsecurity best practices (incl. ISO 27001, CIS etc.) to ensure that our\nsecurity management system meets the highest standards.\n\nSalv has an ISO/IEC 27001: 2022 certificate, as well as ISAE 3000 compliant\nSOC 2 Type 2 report.\n\nStay Ahead of Fincrime\n\nWe'll keep you updated with latest industry insights\n\nWork email\n\nPlease enter a valid email address.\n\nBy signing up, you agree to receive the newsletters and confirm to have read\nour privacy notice available here\n\nProduct\n\n  * Salv Bridge\n  * Screening\n  * Monitoring\n  * Risk Scoring\n\nCompany\n\n  * About Salv\n  * Our mission\n  * Careers\n  * Contact us\n\nInsights\n\n  * Blog\n  * Case studies\n  * Salv news\n  * Salv in media\n\nFollow us\n\n  * \n\n  * Vulnerability Disclosure\n  * Privacy Notice\n  * Cookie Notice\n\n×\n\n",
    "links": "[{\"link\": \"https://salv.com/assets/files/Salv_case_study_APP_fraud_2023.pdf\", \"text\": \"Download\"}, {\"link\": \"https://salv.com/\", \"text\": \"\"}, {\"link\": \"https://salv.com/\", \"text\": \"\"}, {\"link\": \"https://salv.com/\", \"text\": \"\"}, {\"link\": \"https://salv.com/mission/\", \"text\": \"Mission\"}, {\"link\": \"https://salv.com/product/\", \"text\": \"\"}, {\"link\": \"https://salv.com/product/\", \"text\": \"Overview\"}, {\"link\": \"https://salv.com/product/salv-bridge\", \"text\": \"Salv Bridge\"}, {\"link\": \"https://salv.com/product/screening/\", \"text\": \"Screening\"}, {\"link\": \"https://salv.com/product/transaction-monitoring/\", \"text\": \"Monitoring\"}, {\"link\": \"https://salv.com/product/kyc-risk-scoring/\", \"text\": \"Risk Scoring\"}, {\"link\": \"https://salv.com/company/\", \"text\": \"\"}, {\"link\": \"https://salv.com/company/\", \"text\": \"About\"}, {\"link\": \"https://salv.com/careers/\", \"text\": \"Careers\"}, {\"link\": \"https://salv.com/contact/\", \"text\": \"Contact us\"}, {\"link\": \"https://salv.com/blog/\", \"text\": \"\"}, {\"link\": \"https://salv.com/blog/\", \"text\": \"Blog\"}, {\"link\": \"https://salv.com/case-studies/\", \"text\": \"Case studies\"}, {\"link\": \"https://salv.com/news/\", \"text\": \"Salv news\"}, {\"link\": \"https://salv.com/salv-in-media/\", \"text\": \"Salv in media\"}, {\"link\": \"https://salv.com/blog/tags/screening\", \"text\": \"screening\"}, {\"link\": \"https://salv.com/product/screening/\", \"text\": \"Learn more\"}, {\"link\": \"https://www.linkedin.com/shareArticle?mini=true&url=https://salv.com/blog/sanctions-screening-guide/&title=The complete guide to sanctions screening&summary=With sanctions screening, you can identify and mitigate sanctions exposure and support your compliance team.&source=The complete guide to sanctions screening\", \"text\": \"\"}, {\"link\": \"https://twitter.com/intent/tweet?text=The complete guide to sanctions screening&url=https://salv.com/blog/sanctions-screening-guide/\", \"text\": \"\"}, {\"link\": \"https://www.facebook.com/sharer/sharer.php?u=https://salv.com/blog/sanctions-screening-guide/\", \"text\": \"\"}, {\"link\": \"https://salv.com/privacy-policy\", \"text\": \"available here\"}, {\"link\": \"https://salv.com/product/salv-bridge/\", \"text\": \"Salv Bridge\"}, {\"link\": \"https://salv.com/product/screening/\", \"text\": \"Screening\"}, {\"link\": \"https://salv.com/product/transaction-monitoring/\", \"text\": \"Monitoring\"}, {\"link\": \"https://salv.com/product/kyc-risk-scoring/\", \"text\": \"Risk Scoring\"}, {\"link\": \"https://salv.com/company/\", \"text\": \"About Salv\"}, {\"link\": \"https://salv.com/mission/\", \"text\": \"Our mission\"}, {\"link\": \"https://salv.com/careers/\", \"text\": \"Careers\"}, {\"link\": \"https://salv.com/contact/\", \"text\": \"Contact us\"}, {\"link\": \"https://salv.com/blog/\", \"text\": \"Blog\"}, {\"link\": \"https://salv.com/case-studies/\", \"text\": \"Case studies\"}, {\"link\": \"https://salv.com/news/\", \"text\": \"Salv news\"}, {\"link\": \"https://salv.com/salv-in-media/\", \"text\": \"Salv in media\"}, {\"link\": \"https://salv.com/bug-bounty/\", \"text\": \"Vulnerability Disclosure\"}, {\"link\": \"https://salv.com/privacy-policy/\", \"text\": \"Privacy Notice\"}, {\"link\": \"https://salv.com/cookie-notice/\", \"text\": \"Cookie Notice\"}]"
}