{
    "summary": "  \n  \n  \n\n|\n\n\n\nSanctions List Search\n\n|  \n---|---|---  \n  \nSpecially Designated Nationals and Blocked Persons list (\"SDN List\") and all\nother sanctions lists administered by OFAC, including the Foreign Sanctions\nEvaders List, the Non-SDN Iran Sanctions Act List, the Sectoral Sanctions\nIdentifications List, the List of Foreign Financial Institutions Subject to\nCorrespondent Account or Payable-Through Account Sanctions and the Non-SDN\nPalestinian Legislative Council List. Given the number of lists that now\nreside in the Sanctions List Search tool, it is strongly recommended that\nusers pay close attention to the program codes associated with each returned\nrecord. These program codes indicate how a true hit on a returned value should\nbe treated. The Sanctions List Search tool uses approximate string matching to\nidentify possible matches between word or character strings as entered into\nSanctions List Search, and any name or name component as it appears on the SDN\nList and/or the various other sanctions lists. Sanctions List Search has a\nslider-bar that may be used to set a threshold (i.e., a confidence rating) for\nthe closeness of any potential match returned as a result of a user's search.\nSanctions List Search will detect certain misspellings or other incorrectly\nentered text, and will return near, or proximate, matches, based on the\nconfidence rating set by the user via the slider-bar. OFAC does not provide\nrecommendations with regard to the appropriateness of any specific confidence\nrating. Sanctions List Search is one tool offered to assist users in utilizing\nthe SDN List and/or the various other sanctions lists; use of Sanctions List\nSearch is not a substitute for undertaking appropriate due diligence. The use\nof Sanctions List Search does not limit any criminal or civil liability for\nany act undertaken as a result of, or in reliance on, such use.  \n---  \n  \nDownload the SDN List |  Sanctions List Search: Rules for use |  Visit The\nOFAC Website  \n  \nDownload the Consolidated Non-SDN List |  |  Program Code Key  \n  \nLookup\n\n  | Type: |  All Aircraft Entity Individual Vessel | Address: |  \n---|---|---|---|---  \n  | Name: |  | City: |  \n  | ID # / Digital Currency Address: |  | State/Province:* |  \n  | Program: |  All 561-Related BALKANS BALKANS-EO14033 BELARUS BELARUS-\nEO14038 BPI-RUSSIA-EO14024 BURMA-EO14014 CAATSA - IRAN CAATSA - RUSSIA CAR\nCMIC-EO13959 CUBA CYBER2 DARFUR DPRK DPRK2 DPRK3 DPRK4 DPRK-NKSPEA DRCONGO\nELECTION-EO13848 ETHIOPIA-EO14046 FSE-IR FTO GLOMAG HIFPAA HK-EO13936\nHOSTAGES-EO14078 HRIT-IR HRIT-SY IFCA IFSR ILLICIT-DRUGS-EO14059 IRAN IRAN-\nCON-ARMS-EO IRAN-EO13846 IRAN-EO13871 IRAN-EO13876 IRAN-EO13902 IRAN-HR IRAN-\nTRA IRAQ2 IRAQ3 IRGC ISA LEBANON LIBYA2 LIBYA3 MAGNIT MALI-EO13882 NICARAGUA\nNICARAGUA-NHRAA NPWMD NS-PLC PEESA-EO14039 RUSSIA-EO14024 RUSSIA-EO14065 SDGT\nSDNT SDNTK SOMALIA SOUTH SUDAN SSIDES SUDAN-EO14098 SYRIA SYRIA-CAESAR SYRIA-\nEO13894 TCO UKRAINE-EO13660 UKRAINE-EO13661 UKRAINE-EO13662 UKRAINE-EO13685\nVENEZUELA VENEZUELA-EO13850 VENEZUELA-EO13884 YEMEN ZIMBABWE |\n\nCountry:\n\nList:\n\n|\n\nAll Afghanistan Albania Algeria Angola Argentina Armenia Aruba Australia\nAustria Azerbaijan Bahamas, The Bahrain Bangladesh Barbados Belarus Belgium\nBelize Benin Bermuda Bolivia Bosnia and Herzegovina Brazil Brunei Bulgaria\nBurkina Faso Burma Cambodia Canada Cayman Islands Central African Republic\nChile China Colombia Comoros Congo, Democratic Republic of the Congo, Republic\nof the Costa Rica Cote d Ivoire Croatia Cuba Cyprus Czech Republic Denmark\nDjibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial\nGuinea Eritrea Estonia Ethiopia Finland France Georgia Germany Ghana Gibraltar\nGreece Guatemala Guernsey Guinea Guyana Haiti Honduras Hong Kong Hungary India\nIndonesia Iran Iraq Ireland Israel Italy Jamaica Japan Jersey Jordan\nKazakhstan Kenya Korea, North Korea, South Kosovo Kuwait Kyrgyzstan Laos\nLatvia Lebanon Liberia Libya Liechtenstein Luxembourg Macau Malaysia Maldives\nMali Malta Man, Isle of Marshall Islands Mauritania Mexico Moldova Monaco\nMongolia Montenegro Morocco Mozambique Namibia Netherlands Netherlands\nAntilles New Zealand Nicaragua Niger Nigeria North Macedonia, The Republic of\nNorway Oman Pakistan Palau Palestinian Panama Paraguay Peru Philippines Poland\nQatar Region: Commonwealth of Independent States Region: Crimea Region: Gaza\nRegion: Kafia Kingi Region: Northern Mali Region: West Bank Romania Russia\nRwanda Saint Kitts and Nevis Saint Vincent and the Grenadines Samoa San Marino\nSaudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Slovakia\nSlovenia Somalia South Africa South Sudan Spain Sri Lanka Sudan Sweden\nSwitzerland Syria Taiwan Tajikistan Tanzania Thailand The Gambia Trinidad and\nTobago Tunisia Turkey Turkmenistan Uganda Ukraine undetermined United Arab\nEmirates United Kingdom United States Uruguay Uzbekistan Vanuatu Venezuela\nVietnam Virgin Islands, British West Bank Yemen Zambia Zimbabwe\n\nAll Non-SDN SDN  \n  \n  | Minimum Name Score: |  |\n\n|  \n---|---  \n|  \n  \n  \n\nLookup Results:\n\nName |  Address |  Type |  Program(s) |  List |  Score  \n---|---|---|---|---|---  \n  \n* U.S. states are abbreviated on the SDN and Non-SDN lists. To search for a specific U.S. state, please use the two letter U.S. Postal Service abbreviation.  \n---  \n  \nSDN List last updated on: 12/1/2023 2:33:57 PM  \n---  \nNon-SDN List last updated on: 11/14/2023 7:46:10 AM  \n  \n\n\n",
    "links": "[]",
    "priceAndPlans": "  \n  \n  \n\n|\n\n\n\nSanctions List Search\n\n|  \n---|---|---  \n  \nSpecially Designated Nationals and Blocked Persons list (\"SDN List\") and all\nother sanctions lists administered by OFAC, including the Foreign Sanctions\nEvaders List, the Non-SDN Iran Sanctions Act List, the Sectoral Sanctions\nIdentifications List, the List of Foreign Financial Institutions Subject to\nCorrespondent Account or Payable-Through Account Sanctions and the Non-SDN\nPalestinian Legislative Council List. Given the number of lists that now\nreside in the Sanctions List Search tool, it is strongly recommended that\nusers pay close attention to the program codes associated with each returned\nrecord. These program codes indicate how a true hit on a returned value should\nbe treated. The Sanctions List Search tool uses approximate string matching to\nidentify possible matches between word or character strings as entered into\nSanctions List Search, and any name or name component as it appears on the SDN\nList and/or the various other sanctions lists. Sanctions List Search has a\nslider-bar that may be used to set a threshold (i.e., a confidence rating) for\nthe closeness of any potential match returned as a result of a user's search.\nSanctions List Search will detect certain misspellings or other incorrectly\nentered text, and will return near, or proximate, matches, based on the\nconfidence rating set by the user via the slider-bar. OFAC does not provide\nrecommendations with regard to the appropriateness of any specific confidence\nrating. Sanctions List Search is one tool offered to assist users in utilizing\nthe SDN List and/or the various other sanctions lists; use of Sanctions List\nSearch is not a substitute for undertaking appropriate due diligence. The use\nof Sanctions List Search does not limit any criminal or civil liability for\nany act undertaken as a result of, or in reliance on, such use.  \n---  \n  \nDownload the SDN List |  Sanctions List Search: Rules for use |  Visit The\nOFAC Website  \n  \nDownload the Consolidated Non-SDN List |  |  Program Code Key  \n  \nDetails:\n\nType: |  Entity |  List: |  Non-SDN  \n---|---|---|---  \nEntity Name: |  CHINA UNICOM (HONG KONG) LIMITED |  Program: |  CMIC-EO13959  \n|  |  Remarks: |  (Linked To: CHINA UNITED NETWORK COMMUNICATIONS GROUP CO.,\nLTD.)  \n  \n  \nIdentifications:\n\nType| ID#| Country| Issue Date| Expire Date  \n---|---|---|---|---  \nEquity Ticker| CHU US|  |  |  \nEquity Ticker| 762 HK|  |  |  \nIssuer Name| China Unicom (Hong Kong) Limited|  |  |  \nISIN| HK0000049939|  |  |  \nTarget Type| Public Company|  |  |  \nEffective Date (CMIC)| 02 Aug 2021|  |  |  \nPurchase/Sales For Divestment Date (CMIC)| 03 Jun 2022|  |  |  \nEquity Ticker| XCIA DE|  |  |  \nEquity Ticker| K3ID SG|  |  |  \nEquity Ticker| XCI DE|  |  |  \nISIN| US16945R1041|  |  |  \nListing Date (CMIC)| 03 Jun 2021|  |  |  \n  \n  \nAliases:\n\nType| Category| Name  \n---|---|---  \nf.k.a.| strong| CHINA UNICOM LIMITED  \n  \n  \nAddresses:\n\nAddress | City | State/Province | Postal Code | Country  \n---|---|---|---|---  \n75th Floor, The Center, 99 Queen's Road Central  |  Hong Kong  |  |  |  China  \n|  |  |  |  \n|  |  |  |  \n  \n  \n\nSDN List last updated on: 12/1/2023 2:33:57 PM  \n---  \nNon-SDN List last updated on: 11/14/2023 7:46:10 AM  \n  \n\n\n"
}