{
    "summary": "Skip to main content\n\nOfficial Website of the International Trade Administration   Here’s how you\nknow\n\n**Official websites use .gov**  \nA **.gov** website belongs to an official government organization in the\nUnited States.\n\n**Secure .gov websites use HTTPS**  \nA **lock** ( A locked padlock  ) or **https://** means you’ve safely connected\nto the .gov website. Share sensitive information only on official, secure\nwebsites.\n\n  * For U.S. Businesses\n    * Export Solutions\n      * Overview\n      * Virtual Services\n      * Learn How To Export\n      * Research Foreign Markets\n      * Network & Learn at Events\n      * Find Buyers & Partners\n      * Explore eCommerce Resources\n      * Obtain Financing\n      * Negotiate an Export Sale\n      * Navigate Shipping & Logistics\n      * Comply with U.S. and Foreign Export Regulations\n      * Perform Due Diligence \n      * Protect Intellectual Property\n      * Resolve Export Problems\n    * Research Center\n      * Overview\n      * Visual Data Center\n      * Research by Industry\n      * Research By Country\n      * Research By Region\n      * Trade Data and Analysis\n      * Top Markets\n      * Public APIs\n    * Regulations & Agreements\n      * Overview\n      * U.S. Export Regulations\n      * Foreign Regulations\n      * Trade Agreements\n    * Resolve a Trade Problem\n      * Overview\n      * Resolve a Foreign Trade Barrier\n      * U.S. Antidumping & Countervailing Duties\n      * Facing a Foreign Trade AD/CVD or Safeguard Investigation?\n      * Fight Unfair Foreign Trade Subsidies\n      * Industry Monitoring & Analysis\n      * Protect Your Intellectual Property\n      * Advocating for U.S. Business Abroad\n    * Attend an Event\n      * Overview\n      * Trade Event Search\n      * Network & Learn at Events\n      * Meet Buyers at Events \n      * Trade Missions\n      * Events by Industry\n      * Services for Trade Event Organizers\n      * Foreign Direct Investment Attraction Events\n    * News & Highlights\n      * Overview\n      * Press\n      * Blog\n      * ITA Success Stories\n    * Let Our Experts Help\n      * Overview\n      * Services for U.S. Companies New to Exporting\n      * Services for U.S. Companies Currently Exporting\n      * Services for Trade Event Organizers\n      * Services for U.S. Associations & EDOs\n      * Services for Diverse Companies\n      * Services for Rural Companies\n      * Foreign-Trade Zones\n      * Partner with ITA\n  * For International Businesses\n    * BuyUSA\n      * Overview\n      * Find a Supplier - Textiles & Apparel\n    * Invest in the USA\n      * Overview\n      * About Select USA\n      * Investors\n      * Economic Development Organizations (EDO)\n      * Service Providers\n      * Investment Events\n      * Investor Resources\n  * Contact Us\n  * About Us\n\n  * Search ITA\n\nSearch\n\nMenu\n\n  * Search ITA\n\nSearch\n\n  * For U.S. Businesses\n    * Export Solutions\n      * Overview\n      * Virtual Services\n      * Learn How To Export\n      * Research Foreign Markets\n      * Network & Learn at Events\n      * Find Buyers & Partners\n      * Explore eCommerce Resources\n      * Obtain Financing\n      * Negotiate an Export Sale\n      * Navigate Shipping & Logistics\n      * Comply with U.S. and Foreign Export Regulations\n      * Perform Due Diligence \n      * Protect Intellectual Property\n      * Resolve Export Problems\n    * Research Center\n      * Overview\n      * Visual Data Center\n      * Research by Industry\n      * Research By Country\n      * Research By Region\n      * Trade Data and Analysis\n      * Top Markets\n      * Public APIs\n    * Regulations & Agreements\n      * Overview\n      * U.S. Export Regulations\n      * Foreign Regulations\n      * Trade Agreements\n    * Resolve a Trade Problem\n      * Overview\n      * Resolve a Foreign Trade Barrier\n      * U.S. Antidumping & Countervailing Duties\n      * Facing a Foreign Trade AD/CVD or Safeguard Investigation?\n      * Fight Unfair Foreign Trade Subsidies\n      * Industry Monitoring & Analysis\n      * Protect Your Intellectual Property\n      * Advocating for U.S. Business Abroad\n    * Attend an Event\n      * Overview\n      * Trade Event Search\n      * Network & Learn at Events\n      * Meet Buyers at Events \n      * Trade Missions\n      * Events by Industry\n      * Services for Trade Event Organizers\n      * Foreign Direct Investment Attraction Events\n    * News & Highlights\n      * Overview\n      * Press\n      * Blog\n      * ITA Success Stories\n    * Let Our Experts Help\n      * Overview\n      * Services for U.S. Companies New to Exporting\n      * Services for U.S. Companies Currently Exporting\n      * Services for Trade Event Organizers\n      * Services for U.S. Associations & EDOs\n      * Services for Diverse Companies\n      * Services for Rural Companies\n      * Foreign-Trade Zones\n      * Partner with ITA\n  * For International Businesses\n    * BuyUSA\n      * Overview\n      * Find a Supplier - Textiles & Apparel\n    * Invest in the USA\n      * Overview\n      * About Select USA\n      * Investors\n      * Economic Development Organizations (EDO)\n      * Service Providers\n      * Investment Events\n      * Investor Resources\n  * Contact Us\n  * About Us\n\n  1. Home\n  2. Consolidated Screening List\n\nConsolidated Screening List\n\nScreen potential buyers and end-users to comply with U.S. Government\nregulations.\n\nFacebookTwitterLinkedInEmailCopy Link\n\n# Consolidated Screening List\n\nUse the Consolidated Screening List Search Engine.\n\nThe Consolidated Screening List (CSL) is a list of parties for which the\nUnited States Government maintains restrictions on certain exports, reexports,\nor transfers of items. Below, under “Tools” are links to the CSL search\nengine, downloadable CSL files, and the CSL Application Programming Interface\n(API), all consisting of the consolidation of multiple export screening lists\nof the Departments of Commerce, State, and Treasury.\n\nLearn more about recent Russia sanctions and other export control updates.\n\n### **Key Considerations:**\n\n  * These tools are a consolidation of multiple export screening lists of the Departments of Commerce, State, and the Treasury and may be used as an aid to industry in conducting electronic screens of potential parties to regulated transactions. \n  * In the event that a company, entity, or person on the list appears to match a party potentially involved in your export transaction, additional due diligence should be conducted before proceeding. \n  * There may be a strict export prohibition, requirement for seeking a license application, evaluation of the end-use or user to ensure it does not result in an activity prohibited by any U.S. export regulations, or other restriction. \n  * Prior to taking further action, to ensure full compliance with all of the terms and conditions of the restrictions placed on the parties on this list, the user must check the official publication of restricted parties in the Federal Register. They should also check the official lists of restricted parties maintained on the websites of the Departments of Commerce, State, and the Treasury. \n\nThe links below, under “Sources” will connect you to the specific webpage\nwhere additional information about how to use each specific list is contained.\nThese links are also embedded into the CSL search engine and CSL downloadable\nfiles. You will find them in the column “source_information_url” for each\nlisted entity.\n\n**Updates  **\n\nAll the tools are updated automatically every day at 5:00 AM EST/EDT. The CSL\npulls updates of the lists detailed below from each of the sourcing federal\nagencies. It is the responsibility of the federal agency to make available\nupdated file(s) in order for the CSL to be up-to-date.  \n  \nSIGN UP FOR EMAIL UPDATES TO THE CONSOLIDATED SCREENING LIST\n\n**Tools  **\n\n**CSL Search Engine**\n\nThe CSL Search Engine works with the CSL API to allow users to type in a name,\ncountry, or source agency in the search. (Best viewed in Chrome and Firefox).\n\nThe CSL search engine has “Fuzzy Name Search” capabilities, allowing a search\nwithout knowing the exact spelling of an entity’s name. In Fuzzy Name mode,\nthe CSL returns a “score” for results that exactly or nearly match the\nsearched name. This is particularly helpful when searching on CSL for names\nthat have been translated into English from non-Latin alphabet languages.\n\n**CSL Downloadable Files**\n\nIn the CSL downloadable files, there is a column which is titled “source.”\nThis column indicates which specific federal agency’s proscribed party\nscreening list is the source for each entry on the spreadsheet. Blank data\nfields in the CSL downloadable file are not applicable to the consolidated\nscreening list in the “source” column.\n\n  * Instructions for Downloading the Consolidated Screening List \n  * CSV Download \n  * TSV Download (ASCII encoded)   \n  * JSON                                                                                                                                                                                       \n\n**CSL Application Programming Interface (API)  **\n\nThe CSL API enables computers to freely access the CSL in an open, machine-\nreadable format. From this API, any company can build a search engine to\nquickly find names, aliases, and other screening information. The API has\n“Fuzzy Name Search” capabilities as well.  \n\nSee also: API Getting Started Guide\n\n### **Key Sources  **\n\n**Department of Commerce – Bureau of Industry and Security  **\n\n  * Denied Persons List \\- Individuals and entities that have been denied export privileges. Any dealings with a party on this list that would violate the terms of its denial order are prohibited. \n  * Unverified List - End-users who BIS has been unable to verify in prior transactions. The presence of a party on this list in a transaction is a “Red Flag” that should be resolved before proceeding with the transaction. \n  * Entity List - Parties whose presence in a transaction can trigger a license requirement supplemental to those elsewhere in the Export Administration Regulations (EAR). The list specifies the license requirements and policies that apply to each listed party. \n  * Military End User (MEU) List \\- Parties whose presence in a transaction as a party to the transaction triggers a license requirement for any item subject to the EAR listed in supplement no. 2 to part 744. No license exceptions are available for exports, reexports or transfers (in-country) to listed entities on the MEU List for items specified in supplement no. 2 to part 744, except license exceptions for items authorized under the provisions of License Exception GOV set forth in § 740.11(b)(2)(i) and (ii) of the EAR. The license application procedure and license review policy for entities specified in supplement no. 2 to part 744 is specified in § 744.21(d) and (e).\n\nContact the Bureau of Industry and Security.\n\n**Department of State – Bureau of International Security and Non-proliferation\n**\n\n  * Nonproliferation Sanctions \\- Parties that have been sanctioned under various statutes. The linked webpage is updated as appropriate, but the Federal Register is the only official and complete listing of nonproliferation sanctions determinations. \n\nContact the Bureau of International Security and Non-proliferation.\n\n**Department of State – Directorate of Defense Trade Controls  **\n\n  * AECA Debarred List – Entities and individuals prohibited from participating directly or indirectly in the export of defense articles, including technical data and defense services. Pursuant to the Arms Export Control Act (AECA) and the International Traffic in Arms Regulations (ITAR), the AECA Debarred List includes persons convicted in court of violating or conspiring to violate the AECA and subject to “statutory debarment” or persons established to have violated the AECA in an administrative proceeding and subject to “administrative debarment.” \n\nContact the Directorate of Defense Trade Controls.\n\n**Department of the Treasury – Office of Foreign Assets Control  **\n\n  * Specially Designated Nationals List ** ** \\- Parties who may be prohibited from export transactions based on OFAC’s regulations. The EAR requires a license for exports or reexports to any party in any entry on this list that contains any of the suffixes “SDGT,” “SDT,” “FTO,” “IRAQ2,” ”NPWMD” or “NS-PLC.” \n  * Foreign Sanctions Evaders List \\- Foreign individuals and entities determined to have violated, attempted to violate, conspired to violate, or caused a violation of U.S. sanctions on Syria or Iran, as well as foreign persons who have facilitated deceptive transactions for or on behalf of persons subject to U.S. Sanctions. Transactions by U.S. persons or within the United States involving Foreign Sanctions Evaders (FSEs) are prohibited. \n  * Sectoral Sanctions Identifications (SSI) List \\- Individuals operating in sectors of the Russian economy with whom U.S. persons are prohibited from transacting in, providing financing for, or dealing in debt with a maturity of longer than 90 days. \n  * Correspondent Account or Payable-Through Account Sanctions (CAPTA) List \\- Foreign Financial Institutions Subject to CAPTA. As of March 14, 2019, the List includes one foreign financial institution subject to correspondent or payable-through account sanctions. Prior to March 14, 2019, this entity was on OFAC’s Part 561 List.\n  * Non-SDN Menu-Based Sanctions List (NS-MBS List) \\- Persons subject to certain non-blocking menu-based sanctions that have been imposed under statutory or other authorities, including certain sanctions described in Section 235 of the Countering America’s Adversaries Through Sanctions Act (CAATSA), as implemented by Executive Order 13849, and the Ukraine Freedom Support Act of 2014, as amended by CAATSA. As of May 2021, the Non-SDN Menu-Based Sanctions List will also include entities identified for the Protecting Europe’s Energy Security Act of 2019 (PEESA) screening list. \n  * Non-SDN Chinese Military-Industrial Complex Companies (CMIC) (NS-CCMC) - This publication by the Department of the Treasury’s Office of Foreign Assets Control (OFAC) is designed as a reference tool that identifies persons subject to certain sanctions that have been imposed under statutory or other authorities, including certain sanctions described in Executive Order 13959, “Addressing the Threat from Securities Investments that Finance Communist Chinese Military Companies,” as amended by Executive Order 13974. OFAC has provided the following frequently asked questions (871, 872, 873, 874) that further explain the sanctions associated with the names on the NS-CCMC List. If you think that you have a true match with a name on this list you may contact OFAC for additional guidance.\n  * Palestinian Legislative Council List (PLC) - Section (b) of General License 4 issued pursuant to the Global Terrorism Sanctions Regulations (31 C.F.R. Part 594), the Terrorism Sanctions Regulations (31 C.F.R. Part 595), and the Foreign Terrorist Organizations Sanctions Regulations (31 C.F.R. Part 597) authorizes U.S. financial institutions to reject transactions with members of the Palestinian Legislative Council (PLC) who were elected to the PLC on the party slate of Hamas, or any other Foreign Terrorist Organization (FTO), Specially Designated Terrorist (SDT), or Specially Designated Global Terrorist (SDGT), provided that any such individuals are not named on OFAC’s list of Specially Designated Nationals and Blocked Persons (SDN List).\n\nContact the Office of Foreign Assets Control.\n\n  * **Notes**  \n  * The CAPTA List is intended to include foreign financial institutions subject to correspondent or payable-through account sanctions pursuant to sanctions authorities including the Ukraine Freedom Support Act of 2014, as amended by the Countering America’s Adversaries Through Sanctions Act; the North Korea Sanctions Regulations, 31 C.F.R. part 510; the Iran Freedom and Counter-Proliferation Act of 2012; the Iranian Financial Sanctions Regulations, 31 C.F.R. Part 561; the Hizballah Financial Sanctions Regulations, 31 C.F.R. Part 566; and Executive Order 13846. The CAPTA List also will specify the specific prohibition or strict condition(s) to which the foreign financial institutions are subject. These listings only contain those that mention “directive 2.”\n  * The Palestinian Legislative Council (PLC) List is now a part of the Specially Designated Nationals List with the suffice “NS-PLC.”\n  * We optimized our duplicate algorithm so that full names and aliases do not appear twice.\n\n## Footer\n\n  * For U.S. Businesses\n    * Export Solutions\n    * Research Center\n    * Regulations & Agreements\n    * Resolve a Trade Problem\n    * Attend an Event\n    * News & Highlights\n    * Let Our Experts Help\n  * For International Businesses\n    * Buy From the USA\n    * Invest in the USA\n  * About Us\n    * Contact Us\n    * Careers\n    * Data & API\n    * Site Map\n\n**International Trade Administration  \nU.S. Department of Commerce**  \n1401 Constitution Ave NW  \nWashington, DC 20230\n\n**Connect With ITA**\n\n  * Twitter\n\n  * Facebook\n\n  * YouTube\n\n  * LinkedIn\n\nThe  **International Trade Administration** ,  **U.S. Department of\nCommerce,** manages this global trade site to provide access to ITA\ninformation on promoting trade and investment, strengthening the\ncompetitiveness of U.S. industry, and ensuring fair trade and compliance with\ntrade laws and agreements. External links to other Internet sites should not\nbe construed as an endorsement of the views or privacy policies contained\ntherein. This site contains PDF documents. A  **PDF reader**  is available\nfrom Adobe Systems Incorporated.\n\nUSA.gov | FOIA | Privacy Program | EEO Policy | Disclaimer | Information\nQuality Guidelines | Accessibility\n\n✓\n\nThanks for sharing!\n\nAddToAny\n\nMore…\n\n",
    "links": "[{\"link\": \"https://www.trade.gov/\", \"text\": \"\"}, {\"link\": \"https://www.trade.gov/export-solutions\", \"text\": \"Overview\"}, {\"link\": \"https://www.trade.gov/virtual-services\", \"text\": \"Virtual Services\"}, {\"link\": \"https://www.trade.gov/learn-how-export\", \"text\": \"Learn How To Export\"}, {\"link\": \"https://www.trade.gov/international-market-research\", \"text\": \"Research Foreign Markets\"}, {\"link\": \"https://www.trade.gov/network-and-learn-events\", \"text\": \"Network & Learn at Events\"}, {\"link\": \"https://www.trade.gov/find-buyers-and-partners\", \"text\": \"Find Buyers & Partners\"}, {\"link\": \"https://www.trade.gov/ecommerce\", \"text\": \"Explore eCommerce Resources\"}, {\"link\": \"https://www.trade.gov/finance\", \"text\": \"Obtain Financing\"}, {\"link\": \"https://www.trade.gov/negotiate-export-sale\", \"text\": \"Negotiate an Export Sale\"}, {\"link\": \"https://www.trade.gov/navigate-shipping-and-logistics\", \"text\": \"Navigate Shipping & Logistics\"}, {\"link\": \"https://www.trade.gov/comply-us-and-foreign-regulations\", \"text\": \"Comply with U.S. and Foreign Export Regulations\"}, {\"link\": \"https://www.trade.gov/perform-due-diligence\", \"text\": \"Perform Due Diligence \"}, {\"link\": \"https://www.trade.gov/protect-intellectual-property\", \"text\": \"Protect Intellectual Property\"}, {\"link\": \"https://www.trade.gov/resolve-trade-problem\", \"text\": \"Resolve Export Problems\"}, {\"link\": \"https://www.trade.gov/research-center\", \"text\": \"Overview\"}, {\"link\": \"https://www.trade.gov/visual-data-center\", \"text\": \"Visual Data Center\"}, {\"link\": \"https://www.trade.gov/industries\", \"text\": \"Research by Industry\"}, {\"link\": \"https://www.trade.gov/research-country\", \"text\": \"Research By Country\"}, {\"link\": \"https://www.trade.gov/research-region\", \"text\": \"Research By Region\"}, {\"link\": \"https://www.trade.gov/trade-data-analysis\", \"text\": \"Trade Data and Analysis\"}, {\"link\": \"https://www.trade.gov/top-export-market-rankings\", \"text\": \"Top Markets\"}, {\"link\": \"https://www.trade.gov/regulations\", \"text\": \"Overview\"}, {\"link\": \"https://www.trade.gov/us-export-regulations-0\", \"text\": \"U.S. Export Regulations\"}, {\"link\": \"https://www.trade.gov/foreign-regulations\", \"text\": \"Foreign Regulations\"}, {\"link\": \"https://www.trade.gov/trade-agreements\", \"text\": \"Trade Agreements\"}, {\"link\": \"https://www.trade.gov/resolve-trade-problem\", \"text\": \"Overview\"}, {\"link\": \"https://www.trade.gov/resolve-foreign-trade-barrier\", \"text\": \"Resolve a Foreign Trade Barrier\"}, {\"link\": \"https://www.trade.gov/us-antidumping-and-countervailing-duties\", \"text\": \"U.S. Antidumping & Countervailing Duties\"}, {\"link\": \"https://www.trade.gov/foreign-adcvd-or-safeguard-investigation\", \"text\": \"Facing a Foreign Trade AD/CVD or Safeguard Investigation?\"}, {\"link\": \"https://www.trade.gov/fight-unfair-foreign-trade-subsidies\", \"text\": \"Fight Unfair Foreign Trade Subsidies\"}, {\"link\": \"https://www.trade.gov/imau\", \"text\": \"Industry Monitoring & Analysis\"}, {\"link\": \"https://www.trade.gov/advocacy\", \"text\": \"Advocating for U.S. Business Abroad\"}, {\"link\": \"https://www.trade.gov/attend-event\", \"text\": \"Overview\"}, {\"link\": \"https://www.trade.gov/network-and-learn-events\", \"text\": \"Network & Learn at Events\"}, {\"link\": \"https://www.trade.gov/meet-buyers-events\", \"text\": \"Meet Buyers at Events \"}, {\"link\": \"https://www.trade.gov/trade-missions\", \"text\": \"Trade Missions\"}, {\"link\": \"https://www.trade.gov/tepp\", \"text\": \"Services for Trade Event Organizers\"}, {\"link\": \"https://www.trade.gov/news-and-highlights\", \"text\": \"Overview\"}, {\"link\": \"https://www.trade.gov/office-public-affairs\", \"text\": \"Press\"}, {\"link\": \"https://www.trade.gov/tradeology-official-ita-blog\", \"text\": \"Blog\"}, {\"link\": \"https://www.trade.gov/success-story-search\", \"text\": \"ITA Success Stories\"}, {\"link\": \"https://www.trade.gov/let-our-experts-help-0\", \"text\": \"Overview\"}, {\"link\": \"https://www.trade.gov/introductory-services-exporters-plan-and-assess\", \"text\": \"Services for U.S. Companies New to Exporting\"}, {\"link\": \"https://www.trade.gov/services-current-exporters\", \"text\": \"Services for U.S. Companies Currently Exporting\"}, {\"link\": \"https://www.trade.gov/tepp\", \"text\": \"Services for Trade Event Organizers\"}, {\"link\": \"https://www.trade.gov/let-our-experts-help\", \"text\": \"Services for U.S. Associations & EDOs\"}, {\"link\": \"https://www.trade.gov/global-diversity-export-initiative\", \"text\": \"Services for Diverse Companies\"}, {\"link\": \"https://www.trade.gov/rural\", \"text\": \"Services for Rural Companies\"}, {\"link\": \"https://www.trade.gov/foreign-trade-zones-board\", \"text\": \"Foreign-Trade Zones\"}, {\"link\": \"https://www.trade.gov/partner-ita\", \"text\": \"Partner with ITA\"}, {\"link\": \"https://www.trade.gov/contact-us\", \"text\": \"\"}, {\"link\": \"https://www.trade.gov/about-us\", \"text\": \"\"}, {\"link\": \"https://www.trade.gov/export-solutions\", \"text\": \"Overview\"}, {\"link\": \"https://www.trade.gov/virtual-services\", \"text\": \"Virtual Services\"}, {\"link\": \"https://www.trade.gov/learn-how-export\", \"text\": \"Learn How To Export\"}, {\"link\": \"https://www.trade.gov/international-market-research\", \"text\": \"Research Foreign Markets\"}, {\"link\": \"https://www.trade.gov/network-and-learn-events\", \"text\": \"Network & Learn at Events\"}, {\"link\": \"https://www.trade.gov/find-buyers-and-partners\", \"text\": \"Find Buyers & Partners\"}, {\"link\": \"https://www.trade.gov/ecommerce\", \"text\": \"Explore eCommerce Resources\"}, {\"link\": \"https://www.trade.gov/finance\", \"text\": \"Obtain Financing\"}, {\"link\": \"https://www.trade.gov/negotiate-export-sale\", \"text\": \"Negotiate an Export Sale\"}, {\"link\": \"https://www.trade.gov/navigate-shipping-and-logistics\", \"text\": \"Navigate Shipping & Logistics\"}, {\"link\": \"https://www.trade.gov/comply-us-and-foreign-regulations\", \"text\": \"Comply with U.S. and Foreign Export Regulations\"}, {\"link\": \"https://www.trade.gov/perform-due-diligence\", \"text\": \"Perform Due Diligence \"}, {\"link\": \"https://www.trade.gov/protect-intellectual-property\", \"text\": \"Protect Intellectual Property\"}, {\"link\": \"https://www.trade.gov/resolve-trade-problem\", \"text\": \"Resolve Export Problems\"}, {\"link\": \"https://www.trade.gov/research-center\", \"text\": \"Overview\"}, {\"link\": \"https://www.trade.gov/visual-data-center\", \"text\": \"Visual Data Center\"}, {\"link\": \"https://www.trade.gov/industries\", \"text\": \"Research by Industry\"}, {\"link\": \"https://www.trade.gov/research-country\", \"text\": \"Research By Country\"}, {\"link\": \"https://www.trade.gov/research-region\", \"text\": \"Research By Region\"}, {\"link\": \"https://www.trade.gov/trade-data-analysis\", \"text\": \"Trade Data and Analysis\"}, {\"link\": \"https://www.trade.gov/top-export-market-rankings\", \"text\": \"Top Markets\"}, {\"link\": \"https://www.trade.gov/regulations\", \"text\": \"Overview\"}, {\"link\": \"https://www.trade.gov/us-export-regulations-0\", \"text\": \"U.S. Export Regulations\"}, {\"link\": \"https://www.trade.gov/foreign-regulations\", \"text\": \"Foreign Regulations\"}, {\"link\": \"https://www.trade.gov/trade-agreements\", \"text\": \"Trade Agreements\"}, {\"link\": \"https://www.trade.gov/resolve-trade-problem\", \"text\": \"Overview\"}, {\"link\": \"https://www.trade.gov/resolve-foreign-trade-barrier\", \"text\": \"Resolve a Foreign Trade Barrier\"}, {\"link\": \"https://www.trade.gov/us-antidumping-and-countervailing-duties\", \"text\": \"U.S. Antidumping & Countervailing Duties\"}, {\"link\": \"https://www.trade.gov/foreign-adcvd-or-safeguard-investigation\", \"text\": \"Facing a Foreign Trade AD/CVD or Safeguard Investigation?\"}, {\"link\": \"https://www.trade.gov/fight-unfair-foreign-trade-subsidies\", \"text\": \"Fight Unfair Foreign Trade Subsidies\"}, {\"link\": \"https://www.trade.gov/imau\", \"text\": \"Industry Monitoring & Analysis\"}, {\"link\": \"https://www.trade.gov/advocacy\", \"text\": \"Advocating for U.S. Business Abroad\"}, {\"link\": \"https://www.trade.gov/attend-event\", \"text\": \"Overview\"}, {\"link\": \"https://www.trade.gov/network-and-learn-events\", \"text\": \"Network & Learn at Events\"}, {\"link\": \"https://www.trade.gov/meet-buyers-events\", \"text\": \"Meet Buyers at Events \"}, {\"link\": \"https://www.trade.gov/trade-missions\", \"text\": \"Trade Missions\"}, {\"link\": \"https://www.trade.gov/tepp\", \"text\": \"Services for Trade Event Organizers\"}, {\"link\": \"https://www.trade.gov/news-and-highlights\", \"text\": \"Overview\"}, {\"link\": \"https://www.trade.gov/office-public-affairs\", \"text\": \"Press\"}, {\"link\": \"https://www.trade.gov/tradeology-official-ita-blog\", \"text\": \"Blog\"}, {\"link\": \"https://www.trade.gov/success-story-search\", \"text\": \"ITA Success Stories\"}, {\"link\": \"https://www.trade.gov/let-our-experts-help-0\", \"text\": \"Overview\"}, {\"link\": \"https://www.trade.gov/introductory-services-exporters-plan-and-assess\", \"text\": \"Services for U.S. Companies New to Exporting\"}, {\"link\": \"https://www.trade.gov/services-current-exporters\", \"text\": \"Services for U.S. Companies Currently Exporting\"}, {\"link\": \"https://www.trade.gov/tepp\", \"text\": \"Services for Trade Event Organizers\"}, {\"link\": \"https://www.trade.gov/let-our-experts-help\", \"text\": \"Services for U.S. Associations & EDOs\"}, {\"link\": \"https://www.trade.gov/global-diversity-export-initiative\", \"text\": \"Services for Diverse Companies\"}, {\"link\": \"https://www.trade.gov/rural\", \"text\": \"Services for Rural Companies\"}, {\"link\": \"https://www.trade.gov/foreign-trade-zones-board\", \"text\": \"Foreign-Trade Zones\"}, {\"link\": \"https://www.trade.gov/partner-ita\", \"text\": \"Partner with ITA\"}, {\"link\": \"https://www.trade.gov/contact-us\", \"text\": \"\"}, {\"link\": \"https://www.trade.gov/about-us\", \"text\": \"\"}, {\"link\": \"https://www.trade.gov/\", \"text\": \"Home\"}, {\"link\": \"https://www.trade.gov/#facebook\", \"text\": \"\"}, {\"link\": \"https://www.trade.gov/#twitter\", \"text\": \"\"}, {\"link\": \"https://www.trade.gov/#linkedin\", \"text\": \"\"}, {\"link\": \"https://www.trade.gov/#email\", \"text\": \"\"}, {\"link\": \"https://www.trade.gov/#copy_link\", \"text\": \"\"}, {\"link\": \"https://www.trade.gov/export-solutions\", \"text\": \"Export Solutions\"}, {\"link\": \"https://www.trade.gov/research-center\", \"text\": \"Research Center\"}, {\"link\": \"https://www.trade.gov/regulations\", \"text\": \"Regulations & Agreements\"}, {\"link\": \"https://www.trade.gov/resolve-trade-problem\", \"text\": \"Resolve a Trade Problem\"}, {\"link\": \"https://www.trade.gov/attend-event\", \"text\": \"Attend an Event\"}, {\"link\": \"https://www.trade.gov/news-and-highlights\", \"text\": \"News & Highlights\"}, {\"link\": \"https://www.trade.gov/let-our-experts-help-0\", \"text\": \"Let Our Experts Help\"}, {\"link\": \"https://www.trade.gov/selectusa-home\", \"text\": \"Invest in the USA\"}, {\"link\": \"https://www.trade.gov/careers\", \"text\": \"Careers\"}, {\"link\": \"https://www.trade.gov/node/14423\", \"text\": \"Accessibility\"}]",
    "priceAndPlans": "Error: Timeout 30000ms exceeded. =========================== logs\n=========================== navigating to\n\"http://web.archive.org/web/20231201105032/https://www.trade.gov/\", waiting\nuntil \"load\" ============================================================\n\n"
}