{
    "summary": "Skip to content\n\nTry for free\n\n  * Products\n    * KNOW YOUR CUSTOMER\n      * Identity VerificationFull-stack identity verification service\n\n      * NFC VerificationNFC chip-based identity verification\n\n      * AML ScreeningSanctions, PEPs & Watchlists to monitor your customers\n\n      * Know Your BusinessBusiness verification solution with everything you ever need in one API\n\n    * FRAUD PREVENTION\n      * Address VerificationReview documents with manual supervision\n\n      * Phone VerificationDeep phone number check & validation\n\n      * Fraud ScoringAssess the risk score of your customer\n\n      * Proxy DetectionFilter customer’s IP to improve transparency\n\n    * BY INDUSTRY\n      * Fintech\n      * Blockchain & Cryptocurrency\n      * Proxy Networks\n      * Gaming\n      * Transportation & Sharing Economy\n      * Streaming Platforms\n  * Pricing\n  * Developers\n  * Resources\n    * INFORMATION\n      * Blog\n      * Security and Compliance\n      * Supported Documents\n    * GET TO KNOW US\n      * About us\n      * Customers\n      * Partner program\n  * Log in\n  * Talk to Sales\n  * Try for free\n\nBlog\n\nApril 6, 2023\n\n# The Ultimate Guide For a Successful Sanctions Screening Process In 2023\n\nSanctions refer to penalties or punishments imposed due to violating a law,\nrule, or order. That’s why associating with a sanctioned business is not only\ndangerous reputation-wise but also illegal. To prevent such consequences,\nsanctions screening helps identify and manage risks and stops the business\nfrom being exposed to unwanted criminal activity.\n\nGabija Stankevičiūtė\n\nIt can be challenging to keep up with sanctions lists that are expanding\ndaily. On top of that, sanctions are published by various issuing bodies that\ndon’t always align. So that leaves businesses questioning the broadening\ndefinition of what sanctions screening actually is and how to make it\neffective.\n\nTo overcome interpretation, management, manual data reviewing, and other\nchallenges, our guide on sanctions screening offers some valuable intel on how\nto maintain Anti-Money Laundering (AML) compliance and conduct efficient\nsanctions checks.\n\n## What Is a Sanctions List?\n\nA sanction list is a compiled record list of individual sanctions that can be\napplied to individuals, companies, groups, countries, or states. If these\nentities are involved or suspected to be in illegal activity, they are put on\nsanctions lists.\n\nGovernments and international bodies, for instance, the European Union,\nallocate them to fight financial crime and maintain political diplomacy. For\nexample, in the United States, sanctions lists are managed by different\ngovernment bodies, including the Office of Financial Assets Control (OFAC),\nthe Department of State, and others.\n\n## What Is Sanctions Screening in AML?\n\nSanctions screening is a process that helps businesses comply with regulations\nrelated to AML and KYC. For example, it’s illegal for US citizens and\ncompanies to engage in business dealings with a sanctioned entity.\n\n**Remember that sanctions screening has its limitations and should be part of\na larger AML program within any company.  **\n\nSanctions screening is a crucial due diligence procedure in various industries\nsuch as fintech, gaming, and others. Its purpose is to prevent legal,\nreputational, and financial damage caused by noncompliance and involvement in\nillegal trade operations, money laundering, terrorist financing, and similar\nactivities.\n\n## What Are the Types of Sanctions Screening?\n\nTypically, companies use two main screening controls:\n\n  * **Customer screening** is designed to detect sanctioned individuals, entities, or organizations during the onboarding process and other stages of the customer relationship.\n  * **Transaction screening** is programmed to spot transactions that are linked to sanctions on individuals, entities, and organizations. \n\nDespite that, sanctions are complex and come in different forms. While\neconomic embargoes ban all transactions and activities involving a specific\ncountry, list-based or smart sanctions target specific individuals, entities,\nand organizations.\n\nIn contrast, secondary sanctions target third-party actors that engage in\nbusiness with a specific regime, person, or organization. For instance, some\nUkraine-related programs focus on Russia’s financial and energy sectors. This\nimplies that entities not on a sanctions list but connected with a sanctioned\nentity can pose a risk to the related business.\n\n## Who Can Impose Sanctions?\n\nVarious entities, including governments, international organizations, and\nregulatory bodies, can impose sanctions:\n\n  * **Governments.** They can impose sanctions on other countries or specific individuals or entities within those countries, often for national security or foreign policy reasons. \n  * **International organizations**. For example, the United Nations can also impose sanctions as a means of promoting international peace and security.\n  * **Regulatory bodies**. They include financial watchdogs or law enforcement agencies that can impose sanctions on individuals or entities for violating laws or regulations related to financial crimes and illegal activities.\n\nFor example, OFAC can impose sanctions on specific individuals or geographic\nregions. These sanctions can include restrictions on trade, travel, or\nfinancial transactions, among other things.\n\nCurrently, another infamous example of sanctions is the EU’s imposed sanctions\nagainst Russia in response to the war and aggression against Ukraine.\n\n## How Does Sanctions Screening Work?\n\nSanctions screening compares the company’s collected data, such as user\ninformation or information about business partners, with the data on sanctions\nlists to flag and detect any signs of coincidence with sanctioned parties.\nTypically, if that happens, the sanctioned entity is marked for further\nanalysis.\n\nA sanctions check can be done in different ways. One way is to **manually**\nenter a name into an online search tool. Another way is to check a customer\ndatabase for any sanctions alerts **automatically**. To clarify with an\nexample, it’s possible to screen customer and stakeholder databases at regular\nintervals automatically.\n\n## Why Do You Need Sanctions Checks?\n\nThe key question to consider is whether sanctions screening would be\nbeneficial for your business. Smaller organizations with limited funding may\nnot see the need since they have fewer customers and partners to monitor.\n\nOn the other hand, larger multinational companies face greater challenges in\noverseeing all their business partners and transactions. In such cases,\nimplementing sanctions screening would be a smart move. This helps companies\ncomply with regulations and prevent any unwanted business relationships.\n\n## What Is the Purpose of Sanctions Screening?\n\nOne of the main purposes for companies to implement sanctions screening is to\ncomply with local or international jurisdictions and minimize potential risks\nby detecting suspicious counterparties before starting a business\nrelationship.\n\nOrganizations also use sanctions screening as one of the steps in a larger\nrisk-based approach strategy. That’s why sanctions checks are closely tied\nwith Know Your Customer (KYC), Anti-money Laundering (AML), and Countering\nFinancing Terrorism (CFT) procedures.\n\nSanctions screening helps organizations avoid costly fines, reputational\ndamage, and legal issues. Look at **other benefits** that come with sanctions\nchecks:\n\n  * **Fraud detection**. Sanctions screening can help detect fraudulent transactions by cross-referencing sanctions lists. In some cases, companies may use private blacklists that contain sanctioned beneficiaries suspected of fraud.\n  * **Financial insurance**. Sanctions can lead companies to financial risks, especially when their business partners or customers are unexpectedly sanctioned. Using sanctions screening can significantly reduce these risks and helps organizations avoid doing business with sanctioned parties. \n  * **Regulatory compliance**. To maintain compliance, some regulated entities and financial institutions must conduct sanctions screening. The regulations depend on the jurisdiction in which the organization operates. Failure to comply with these regulations can result in significant penalties or fines. \n\n## When Should Companies Conduct Sanctions Screening to Ensure Compliance?\n\nAfter conducting an initial risk assessment, sanctions screening should be a\npriority when onboarding a new customer or third party. Additionally, to\nremain compliant with the constantly evolving sanctions landscape,\norganizations should regularly screen sanctions lists and their existing\ncustomers or third parties.\n\nHowever, this can be a challenging task, especially when dealing with high\ntransaction volumes. To ensure compliance with sanctions requirements,\ncompanies must find ways to overcome these challenges and implement effective\nsanctions screening measures.\n\n## How to Identify Relevant Sanctioning Bodies for Businesses?\n\nTo avoid potential issues, it’s essential to stay up-to-date with the latest\nsanctions and implement effective screening controls.\n\nHere are the primary sanctions lists categorized by relevant sanctioning\nbodies and the countries, territories, partnerships, alliances, and currencies\nthey operate within:\n\n  * **The OFAC Sanctions List**. OFAC applies to all US citizens and corporate entities incorporated in the US. Additionally, it applies to any entity that trades in US dollars, US goods and components, or has a US parent or affiliate.\n\nCheck the sanctions screening OFAC search tool here.\n\n  * **The EU Consolidated List of Sanctions**. It applies to all citizens and corporate entities that are established in a member state and are overseen by the EU Council.\n\nFind the list of persons, groups, and entities subject to EU sanctions here.\n\n  * **The HM Treasury Sanctions List**. It applies to all individuals and legal entities that operate or conduct business activities within the United Kingdom, including UK nationals and legal entities established under UK law. It is enforced and overseen by the Office for Financial Sanctions Implementation (OFSI).\n\nCheck the UK Sanctions list here.\n\n  * **The UN Sanctions list**. This sanctions list overseen by the UN Council applies to all countries that are members of the United Nations.\n\nFind the UN sanctions list search here.\n\nTo mitigate the risk of conducting business with prohibited parties, companies\nalso often have their **internal lists** , which can be:\n\n  * **Whitelists** are made up of trusted parties that have already undergone KYC, such as suppliers or business partners. \n  * **Blacklists** are compromised entities that companies wish to avoid doing business with, such as fraudulent names, employees, accounts, or any other parties suspected of engaging in illicit activities.\n\n## What Are the Challenges of Sanctions Screening?\n\nScreening for sanctions may sound straightforward, but it’s actually a\nchallenging process that involves several differentiating factors. These\ninclude various cultures, languages, acronyms, and aliases across different\njurisdictions. On top of that, organizations are facing more sophisticated\nsanctions evasion techniques, including the use of virtual assets.\n\nFurthermore, Western nations are pushing to expand sanctions to cover a\nbroader range of issues, such as human rights violations and cyberattacks. All\nof this is happening in the context of a rapidly changing geopolitical\nenvironment, which is making it increasingly difficult for organizations to\nmeet their sanctions obligations.\n\nOther common challenges businesses face are mainly related to manual sanctions\nscreening:\n\n  * **Lengthy processes.** Screening large volumes of data manually is often insufficient, making it hard to keep up with the amount of data that needs to be screened or entered manually.\n  * **Human errors.** Flaws in screening can occur due to typos, especially for foreign entities. Additionally, incomplete, inaccurate, or outdated customer data may result in missed sanctioned individuals. Different writing systems or naming conventions, including names written in Chinese characters, Cyrillic script, or Arabic script, can make sanctions screening more complex.\n  * **False positives**. Businesses often face false positive results or duplicates when they don’t have an effective sanctions screening system in place. For example, if a compliance officer is confident that the match is a false positive, they may whitelist the person’s name to avoid future matches. \n\nWith these factors considered, companies require trustworthy sanctions\nscreening partners who employ modern AI technology to tackle and handle these\nchallenges.\n\n## How to Build a Successful Sanctions Screening Process?\n\nSanction screening systems often fail or perform poorly due to the lack of\ndata quality. Therefore, companies **must ensure that their KYC data is\ncollected and reviewed** to prevent generating a high number of false\npositives and to avoid missing any sanctioned entities during the screening\nprocess.\n\nTo ensure effective sanctions screening, organizations **must conduct regular\nand automated screening** of their customers, suppliers, and transactions.\nThis process should take place at the start of new relationships to verify the\nlegitimacy of the relationship, followed by a regular screening at regular\nintervals or upon events like regulatory changes.\n\nTo conclude, here are the five most important sanctions screening practices in\nbrief:\n\n  * Make sure to comply with the sanctions screening regulations enforced in your jurisdictions by checking them.\n  * Regularly perform sanctions screening to ensure that you are aware of the most recent updates, including newly added sanctioned parties.\n  * Ensure that the format of your data matches the format of the sanctions screening lists. This can help reduce the number of false positives that you have to analyze.\n  * Make sure to review any flagged screening results and take further necessary actions to comply with sanctions regulations.\n  * Use automated tools for sanctions screening to ensure that screening occurs regularly. This helps avoid the need for manual data entry and reduces the time needed for analyzing screening results.\n\n## iDenfy’s Automated Sanctions Screening Software\n\nTo eliminate the hassle around sanctions checks, iDenfy offers a fully\nautomated AML Screening solution with built-in sanctions screening checks. It\nenables companies to regularly screen against multiple global sanctions and\nwatchlists, including additional protection measures, such as PEP screening.\n\nContact us for more details or get a free demo to see the sanctions screening\nsoftware in action.\n\nGabija Stankevičiūtė\n\nGabija’s a consistent writer for the blog and the first ever in-house\ncopywriter at iDenfy, who joined the startup in 2021. With a background in\njournalism, she was always keen on technology. From employer branding posts to\nproduct updates, she covers all things related to the startup and its\ninnovations.\n\nBlog\n\nNovember 30, 2023\n\n####  KYC for Forex Trading: Importance and Challenges\n\nAn increasing number of individuals engage in forex trading on a daily basis,\ndrawn by the potential to earn a consistent income. Despite the ongoing high\nliquidity and global market volatility, forex trading volumes have steadily\nrisen over the years. However, the industry isn’t immune to illegal\nactivities, such as money laundering and ATO fraud. These illicit actions have\nexposed the sector’s previously perceived anonymity, highlighting the\nassociated risks. We talk more about KYC compliance and how identity\nverification can help prevent forex fraud.\n\nGabija Stankevičiūtė\n\nBlog Regulations by Country\n\nNovember 29, 2023\n\n####  AML Compliance in Spain\n\nAML compliance penalties have made many breaking stories in the news this\nyear, with some European financial institutions making the cut. As these non-\ncompliance fines sometimes reach millions, many countries, including Spain,\nhave increased their focus on strengthening AML measures. Read more to learn\nhow to achieve AML compliance in Spain and fight financial crime more\neffectively.\n\nGabija Stankevičiūtė\n\nBlog\n\nNovember 27, 2023\n\n####  Age Gating vs Age Verification: Protecting Minors Online\n\n“Are you over 21 years of age?” isn’t the most secure age gating method out\nthere today. In other words, age gating refers to an online practice where\nusers are asked to provide their birthdate, select their age, or confirm that\nthey meet the legal age requirement to access age-restricted content. To\nminimize the chances of minors bypassing such age gates, more businesses use\nAI-powered age verification systems instead. Read more.\n\nGabija Stankevičiūtė\n\nAll iDenfy’s products are protected with the number one cyber insurance\npackage and the Technology Errors & Omissions insurance.\n\nProducts\n\n  * KNOW YOUR CUSTOMER\n    * Identity Verification\n    * AML Compliance\n    * Business Verification\n    * NFC verification\n  * FRAUD PREVENTION\n    * Phone Number Verification\n    * Proxy Detection\n    * Proof of Address Verification\n    * Customer’s Risk Score Verification\n\nSupported Industries\n\n  * Fintech\n  * Cryptocurrency & Blockchain\n  * Proxy Networks\n  * Gaming\n  * Online Gambling\n  * Digital Wallets\n  * Transportation\n  * Streaming\n\nResources\n\n  * Blog\n  * Newsroom\n  * Roadmap\n  * Supported Documents\n  * Security and Compliance\n  * WordPress Integration\n  * WooCommerce integration\n  * Help Center\n\nCompany\n\n  * About us\n  * Customers\n  * Careers\n  * Partner program\n  * Cyber Insurance\n  * Contact us\n\nTrademark registration number: 018171228. ISO 27001 certificate number TIC\n1512120135\n\nAll Rights Reserved © iDenfyTM 2023\n\n  * Service status\n  * Privacy policy\n  * Cookie policy\n\nGo to mobile version\n\n",
    "links": "[{\"link\": \"https://www.idenfy.com/blog/sanctions-screening-guide/amp/\", \"text\": \"\\n\\t\\t\\t\\tGo to mobile version\\t\\t\\t\"}]",
    "priceAndPlans": "Error: Timeout 30000ms exceeded. =========================== logs\n=========================== navigating to\n\"http://web.archive.org/web/20231123152454/https://www.idenfy.com/\", waiting\nuntil \"load\" ============================================================\n\n"
}