{
    "summary": "Skip Navigation\n\n  * LSEG\n\n  * Data & Analytics\n\n  * FTSE Russell\n\n  * London Stock Exchange\n\n  * FX\n\n  * LCH\n\n  * Risk Intelligence\n\nOur businesses\n\nRisk Intelligence\n\n  * LSEG\n  * Data & Analytics\n  * FTSE Russell\n  * London Stock Exchange\n  * FX\n  * LCH\n  * Risk Intelligence\n\n  * Your Industry\n\nYour Industry\n\n### CHOOSE YOUR SECTOR\n\n    * Corporates\n    * Designated Non-Financial Businesses and Professions\n    * Digitally Native Financial Institutions\n\n    * Governments, Central Banks and Regulators\n    * Financial Institutions\n\n  * Solutions\n\nSolutions\n\n### SCREENING\n\n    * World-Check Database Simplify your customer and third-party screening process with quality data coverage.\n    * World-Check One Our purpose-built automated screening software combined with our proprietary World-Check data.\n    * Managed Services Screen large batches of your customers or third parties.\n\n### DUE DILIGENCE\n\n    * Due Diligence Reports Advanced background and integrity checks of customers, vendors or business interests.\n    * Due Diligence Centre Our enterprise supply chain management solution.\n\n### ACCOUNT VERIFICATION\n\n    * Account Verification Solutions Verify and authenticate customer and business accounts in real-time. (USA only).\n\n### IDENTITY VERIFICATION\n\n    * Identity Verification Solutions Gain authoritative data on individuals and entities.\n\n### ONBOARDING\n\n    * Digital Onboarding A simple, cost-effective and easy-to-deploy digital onboarding application.\n\n  * Insights\n\nInsights\n\n  1. LSEG Risk Intelligence\n  2. Financial crime\n  3. Sanctions screening\n\nYour browser does not support the video tag.\n\nFINANCIAL CRIME\n\n# Sanctions screening\n\nAccess quality, relevant risk intelligence sanctions-screening data to help\nyou meet your regulatory obligations quickly and efficiently.\n\nRequest details\n\nOverview\n\n  1. Overview\n  2. What is sanctions screening?\n  3. Our solution\n  4. Benefits\n\nRequest details\n\n**Sanctions are protective restrictive measures, such as an asset freeze or\nblock, investment or travel ban, financial sanctions, arms and trade\nembargoes.**\n\nThere are varying sanctions types including: explicit sanctions, where the\nsubject is named; narrative or implicit sanctions, which don’t specifically\nname an individual or company but extend to entities covered by a narrative\nstatement on a sanctions programme due to their connections to the main\nsanctioned entity; and sectoral sanctions. Sanctions can be applied against\nbut not limited to a country, entity, individual, organisation and vessel.  \n\nSanctions are our highest priority and receive dedicated attention, major\nsanctions lists (OFAC, EU, UN) are monitored and covered on a 24/7/365 basis.\nWe have 500+ researchers situated in 240 countries and territories on five\ncontinents, 90+% speaking two or more languages. There are currently 57,000+\nactive sanctions records across 300+ sanction programmes as part of the World-\nCheck sanctions-screening coverage.\n\nWe monitor 10,000+ global information resource lists, 900+ sanction,\nregulatory, law enforcement lists and 5,900+ official/government sites and we\nadd 50,000+ new records monthly.\n\n##  What is sanctions screening?\n\nSanction compliance poses a challenge to organisations as not only is it an\never-changing landscape, but there is no finite sanctions list to follow and\norganisations must nevertheless ensure that they do not transact with any\nblocked entity.\n\nScreening for sanctions risk is a mandatory requirement for regulated entities\nacross all sectors and is a critical step in the know your customer or KYC\nprocess. Moreover, penalties for breaching sanctions can be severe. In 2021\nthe US Treasury Office of Foreign Assets Control meted out fines amounting to\nover US $20 million, 10 of the 20 penalties were levied at corporates. In 2020\nthe penalties amounted to US $23 million and only two were financial\ninstitutions.\n\nEnsuring your organisation has a robust sanctions-screening programme in place\nis essential. Access to comprehensive and accurate sanctions risk data is\ntherefore critical.\n\nOur solution\n\n##  Need help to comply with the stringent sanction regulations?\n\nOur suite of solutions provide everything you need to help you stay compliant\nin an evolving sanctions landscape. Access accurate sanctions data, view\ndetailed insights and background check reports, and stay up to date on any\nchanges with our monitoring capabilities.\n\n  * LSEG World-Check\n  * LSEG Due Diligence Reports\n  * Managed Services\n\nWorld-Check sanctions-screening data contains comprehensive coverage of all\nknown sanction bodies and includes 300+ sanction programmes.\n\n  * Access accurate data, quality data - our specialist research unit monitors major sanction lists 24/7, 365 days of the year. On an annual basis our sanctions processes undergo ISAE 3000 design-effectiveness certification.\n  * Significantly reduce your sanctions-screening workload, as our records are deduplicated - each subject has a unique record.  All information by the sanction issuers are available on that record, together with official sources for verification, reducing the number of records needing to be screened.\n  * Filter keyworded records easily and choose which records to screen against to match your own risk-based approach, policies, procedures and regulations for sanction compliance.\n  * Tackle the challenges of complying with narrative, implicit and sectoral sanctions when there is no finite sanctions list to follow. We have applied significant further qualitative research to uncover those entities and individuals who fall within the scope of these sanctions.\n\nTo fully understand your exposure to indirect sanctions you need to go one\nstep further and uncover in-depth ownership structures of entities and/or ​the\nsource of wealth of certain individuals.\n\n  * Get detailed insights and background checks on any business or entity with a range of due diligence reports.\n  * Designed to provide deep intelligence and tailored to your use-case and situation - whether you require quick, affordable data-driven reports that deliver essential information on more entities, or detailed integrity and advanced background on known high-risk customers, vendors or business interests.\n  * We leverage our unrivalled propriety and partner data, and global network of human expertise to provide deep insight that can help you pinpoint risk and provide protection from potential regulatory, reputational and financial damage.\n\nOur Managed Services team can help you to stay on top of any profile changes\nand avoid backlogs with ongoing monitoring.\n\n  * Reduce your compliance burden and maximise existing resources by outsourcing ongoing monitoring to our Managed Screening Service team.\n  * Our team can help you screen large batches of your third parties and customers against World-Check database covering Sanctions, Politically Exposed Persons (PEPs), State-Owned/State-Controlled Entities, Law Enforcement and Regulatory Enforcement lists. If we have identified newly arisen issues, our team will then escalate this to you.\n  * This cost-effective solution will allow you to reduce false positives and identify changes in risk levels in the face of the rapidly changing sanctions landscape.\n\nBenefits\n\n##  Why we are trusted worldwide\n\nDiscover the benefits of working with us for your sanctions compliance.\n\n###  **Reliable intelligence**\n\nWe follow the most stringent guidelines for research methodology and inclusion\ncriteria – applying rigorous quality control.\n\n###  **Up-to-date information**\n\nWith research centers on all five continents, we provide around-the-clock\nmonitoring of sanction lists, regulatory and enforcement lists, as well as\nthousands of reliable media sources, so you have accurate and up-to-date\ninformation.\n\nuser-interface/large/target\n\n###  **Targeted screening**\n\nHundreds of specific keywords for our data help you filter and drill down for\nfocused screening and reduce false positives.\n\nConnect with our specialists\n\nOur specialists will tailor a sanctions screening solution to help solve your\nspecific needs.\n\nRequest details\n\n##  Request details\n\n  * Email sales\n  * Call sales\n\n###  Email your local sales team\n\nFirst name\n\nEnter first name\n\nLast name\n\nEnter last name\n\nEmail address\n\nEnter a valid email address\n\nPhone number\n\nPlease enter a valid phone number\n\n(numerals only; no dashes)\n\nSelect oneAland IslandsAlbaniaAlgeriaAmerican\nSamoaAndorraAngolaAnguillaAntarcticaAntigua and BarbudaArgentina\nArmeniaArubaAustralia\nAustriaAzerbaijanBahamasBahrainBangladeshBarbadosBelgiumBelizeBeninBermudaBhutanBoliviaBosnia\nand HerzegovinaBotswanaBouvet IslandBrazilBritish Indian Ocean TerritoryBrunei\nDarussalamBulgariaBurkina FasoBurundiCambodiaCameroonCanadaCape VerdeCayman\nIslandsChadChileChinaChristmas IslandCocos (Keeling)\nIslandsColombiaComorosCongoCongo, The Democratic Republic of theCook\nIslandsCosta RicaCote D'IvoireCroatiaCyprusCzech\nRepublicDenmarkDjiboutiDominicaDominican RepublicEcuadorEgyptEl\nSalvadorEquatorial GuineaEritreaEstoniaEthiopia Falkland Islands\n(Malvinas)Faroe IslandsFijiFinlandFranceFrench GuianaFrench PolynesiaFrench\nSouthern\nTerritoriesGabonGambiaGeorgiaGermanyGhanaGibraltarGreeceGreenlandGrenadaGuadeloupeGuamGuatemalaGuineaGuinea-\nBissauGuernseyGuyanaHeard and McDonald IslandsHoly See (Vatican City State)\nHondurasHong KongHungaryIcelandIndiaIndonesiaIrelandIsle of\nManIsraelItalyJamaica JapanJerseyJordanKazakhstanKenyaKiribatiKorea, Republic\nofKuwaitKyrgyzstanLao People's Democratic\nRepLatviaLebanonLesothoLiberiaLiechtensteinLithuaniaLuxembourgMacauMadagascarMalawiMalaysiaMaldivesMaltaMarshall\nIslandsMartiniqueMauritaniaMauritiusMayotteMexicoMicronesia, Federated\nStatesMoldova, Republic ofMonaco\nMongoliaMontenegroMontserratMoroccoMozambiqueNamibiaNauruNepalNetherlandsNetherlands\nAntillesNew CaledoniaNew ZealandNigerNigeriaNiueNorfolk IslandNorthern Mariana\nIslands NorwayOmanPakistanPalauPalestinian Territory, OccupiedPanamaPapua New\nGuineaParaguayPeruPhilippinesPitcairnPolandPortugalPuerto RicoQatarRepublic of\nNorth MacedoniaReunionRomaniaRwandaSaint HelenaSaint Kitts and NevisSaint\nLuciaSaint MartinSaint Pierre and MiquelonSamoaSan MarinoSao Tome and\nPrincipeSaudi ArabiaSenegalSerbiaSeychellesSierra\nLeoneSingaporeSlovakiaSloveniaSolomon IslandsSouth AfricaSpainSri LankaSth\nGeorgia & Sth Sandwich IsSt Vincent and the Grenadines SurinameSvalbard and\nJan MayenSwazilandSwedenSwitzerlandTaiwanTajikistan Tanzania, United Republic\nofThailandTimor-LesteTogoTokelauTongaTrinidad and\nTobagoTunisiaTurkeyTurkmenistanTurks and Caicos IslandsTuvaluUgandaUnited Arab\nEmiratesUnited KingdomUnited StatesUruguayUS Minor Outlying\nIslandsUzbekistanVanuatuVietnamVirgin Islands (British)Virgin Islands\n(U.S.)Wallis and Futuna IslandsWestern SaharaZambiaCountry/territory\n\nSelect a country\n\nCity(optional)\n\nCompany\n\nEnter company name\n\nJob title\n\nEnter a job title\n\nArea of interest: Help us connect you to the right expert(optional)\n\nBy submitting this form, you agree to your personal data being shared within\nthe London Stock Exchange Group of companies (LSEG) for the purpose of\nreceiving communications via post, phone and electronic means from LSEG about\nevent, resources, products, and/or services.\n\nAccept terms()\n\nFor more information on how LSEG uses your data, see our Privacy Statement.\nYou can adjust your preferences at any time through the preference link in any\nelectronic communication that you receive from us.\n\nSubmit\n\n###  Call your local sales team\n\n#### **Americas**\n\nAll countries (toll free): +1 800 427 7570  \nBrazil: +55 11 47009629  \nArgentina: +54 11 53546700  \nChile: +56 2 24838932  \nMexico: +52 55 80005740  \nColombia: +57 1 4419404\n\n#### **Europe, Middle East, Africa**\n\nEurope: +442045302020  \nAfrica: +27 11 775 3188  \nMiddle East & North Africa: 800035704182\n\n#### **Asia Pacific (Sub-Regional)**\n\nAustralia & Pacific Islands: +612 8066 2494  \nChina mainland: +86 10 6627 1095  \nHong Kong & Macau: +852 3077 5499  \nIndia, Bangladesh, Nepal, Maldives & Sri Lanka:  \n+91 22 6180 7525  \nIndonesia: +622150960350  \nJapan: +813 6743 6515  \nKorea: +822 3478 4303  \nMalaysia & Brunei: +603 7 724 0502  \nNew Zealand: +64 9913 6203  \nPhilippines: 180 089 094 050 (Globe) or  \n180 014 410 639 (PLDT)  \nSingapore and all non-listed ASEAN Countries:  \n+65 6415 5484  \nTaiwan: +886 2 7734 4677  \nThailand & Laos: +662 844 9576\n\n###  Help & Support\n\n####  Already a customer?\n\nGet help through MyAccount\n\nexternal\n\n###  **Office locations**\n\n####  Contact LSEG near you\n\nFind your nearest LSEG office\n\narrow-right\n\nSearch\n\n0 results found\n\n  * ## Risk Intelligence\n\n    * Discover Risk Intelligence \n    * Contact sales \n\n  * ## Connect with us\n\n    * LinkedIn \n\n  * ## Languages\n\n    * English \n    * 日本語 – 日本 \n    * 简体中文 – 中国 \n\n  * ## Corporate\n\n    * Who we are \n    * Careers \n    * Media Centre \n    * Investor Relations \n    * Office locations \n    * Security Centre \n\n  * Privacy & Cookie Statement\n  * Cookies settings\n  * Sitemap\n  * Disclaimer\n  * Accessibility\n  * Whistleblowing\n  * UK Bribery Act\n  * Modern Slavery Act\n\n## Our use of cookies\n\nLSEG websites use cookies and similar technologies for various purposes\nincluding functionality, performance, targeting, social media, and for the\nproper functioning of websites. The cookies and similar technologies may\ninclude those deployed by third parties for providing services to us and they\nmay use the same to improve, enhance, and deliver their services to all of\ntheir customers. To access a list of the websites covered by this banner\nreview the cookie settings. You can change your preferences at any time\nthrough our Cookie Settings tool. Please read our Privacy Statement and Cookie\nPolicy\n\nCookies settings Reject all Accept all cookies\n\n## Privacy Preference Center\n\nWhen you visit this website, information may be stored or retrieved on or from\nyour browser, mostly in the form of or through cookies (e.g., first-party and\nthird-party) and similar technologies (e.g., local storage, web beacons, etc.)\n(\"cookies\"). This information might be about you, your preferences and/or your\ndevice. All references to \"Services\" refers to our products, services,\nwebsites, digital properties, platforms, software and applications (including\nmobile applications).  \n  \nBecause we respect your right to privacy, you can choose not to allow some\ntypes of cookies. You can use the features in this preference center to block\nor allow these types of cookies. Toggle \"on\" to allow cookies and toggle \"off\"\nto block specific categories of cookies. For your reference, if the toggle is\nblue, then you have allowed cookies and if the toggle is gray, then you have\nblocked cookies. Blocking some types of cookies may impact your experience\nwith the site and the services we are able to offer. A preference cookie will\nbe set, which will contain your preferences of blocking or allowing cookies.  \n  \nPlease note that if you clear your cookies, the preference cookie will be\ndeleted and this will clear your preferences. When you re-enter or re-access\nour services (e.g. websites), you will be presented with the option to accept\nall cookies. When presented with the option to accept all cookies, if you want\nto allow or block certain categories of cookies, you will have to access the\ncookie preference center/cookies settings again to exercise your choice. If\nyou accept all cookies, then all cookies will deploy.  \n****  \nPrivacy Statement and Cookie Statement\n\nAllow all\n\n###  Manage Consent Preferences\n\n#### Strictly Necessary Cookies\n\nAlways Active\n\nThese cookies are necessary for websites to function and cannot be switched\noff through the cookie preference center. They are usually only set in\nresponse to actions made by you which amount to a request for services, such\nas setting your privacy preferences, logging in or filling in forms.\n\nCookies Details‎\n\n#### Performance Cookies\n\nPerformance Cookies\n\nThese cookies collect information, including analytics, about how you use our\nServices. Information collected includes, for example, the Internet browsers\nand operating systems used, the domain name of the website previously visited,\nthe number of visits, average duration of visit, actions taken and pages\nviewed. These cookies may be used to record or track your interaction and/or\nuse of our web and/or mobile sites, platforms and/or digital properties.\nPerformance cookies help us measure the activity on our Services, create\nreports and statistics about the performance of our Services, improve the\nuser-friendliness of the Services and improve the quality of our Services.\nThese types of cookies typically stay active on your computer until they are\ndeleted or until the cookie expires (if applicable).\n\nCookies Details‎\n\n#### Functional Cookies\n\nFunctional Cookies\n\nThese cookies allow the website to remember information about you (e.g., your\nusername or ID) and the choices you make (e.g., your language preference, or\nthe area or region you are in) and provide enhanced, more personalized\nfeatures or content to you. These cookies can also be used to remember changes\nyou have made to text size, fonts, and other customizable parts of web pages.\nThey may also be used to provide Services you have asked for, such as watching\na video or commenting on a blog. If you do not allow these cookies or if you\ntoggle these cookies off, then some or all of these Services may not function\nproperly. These cookies cannot track your browsing activity on other websites.\n\nCookies Details‎\n\n#### Targeting Cookies\n\nTargeting Cookies\n\nThese cookies track browsing habits (on and off of our websites and digital\nproperties) and are used to deliver targeted (interest-based) advertising.\nThey are also used to limit the number of times you see an ad and to measure\nthe effectiveness of advertising campaigns. They remember that you have\nvisited a website and this information may be shared with other organizations,\nsuch as advertisers and our advertising partners, who might use it with\ninformation about how you use other websites, including identifying shared\ninterests and behaviors across groups of users who visit our (and other)\nwebsites. In connection with these types of cookies, your activity may be\ntracked or monitored using identifiers (e.g., a cookie ID, other unique\nidentification numbers). These types of cookies will typically stay on your\ncomputer until they are deleted or until they expire (if applicable).\n\nCookies Details‎\n\nBack Button\n\n### Cookie List\n\nSearch Icon\n\nFilter Icon\n\nClear\n\ncheckbox label label\n\nApply Cancel\n\nConsent Leg.Interest\n\ncheckbox label label\n\ncheckbox label label\n\ncheckbox label label\n\nReject all Confirm my choices\n\n",
    "links": "[{\"link\": \"https://www.lseg.com/en/risk-intelligence/corporates\", \"text\": \"\"}, {\"link\": \"https://www.lseg.com/en/risk-intelligence/designated-non-financial-businesses-and-professions\", \"text\": \"\"}, {\"link\": \"https://www.lseg.com/en/risk-intelligence/digitally-native-financial-institutions\", \"text\": \"\"}, {\"link\": \"https://www.lseg.com/en/risk-intelligence/governments-central-banks-and-regulators\", \"text\": \"\"}, {\"link\": \"https://www.lseg.com/en/risk-intelligence/financial-institutions\", \"text\": \"\"}, {\"link\": \"https://www.lseg.com/en/risk-intelligence/screening-solutions/world-check-kyc-screening\", \"text\": \"\"}, {\"link\": \"https://www.lseg.com/en/risk-intelligence/screening-solutions/world-check-kyc-screening/one-kyc-verification\", \"text\": \"\"}, {\"link\": \"https://www.lseg.com/en/risk-intelligence/screening-solutions/world-check-kyc-screening/managed-services\", \"text\": \"\"}, {\"link\": \"https://www.lseg.com/en/risk-intelligence/due-diligence-services/reports\", \"text\": \"\"}, {\"link\": \"https://www.lseg.com/en/risk-intelligence/due-diligence-services/centre\", \"text\": \"\"}, {\"link\": \"https://www.lseg.com/en/risk-intelligence/account-verification-solutions\", \"text\": \"\"}, {\"link\": \"https://www.lseg.com/en/risk-intelligence/identity-verification-solutions\", \"text\": \"\"}, {\"link\": \"https://www.lseg.com/en/risk-intelligence/digital-customer-onboarding\", \"text\": \"\"}, {\"link\": \"https://www.lseg.com/en/policies/privacy-and-cookie-statement\", \"text\": \"Privacy Statement\"}, {\"link\": \"https://www.lseg.com/en/locations\", \"text\": \"\"}, {\"link\": \"https://www.lseg.com/en/risk-intelligence\", \"text\": \"\\n                        \\n                  \\t  \\t Discover Risk Intelligence\\n                    \"}, {\"link\": \"https://www.lseg.com/en/risk-intelligence/contact-sales\", \"text\": \"\\n                        \\n                  \\t  \\t Contact sales\\n                    \"}, {\"link\": \"https://www.lseg.com/en/risk-intelligence\", \"text\": \"\\n                        \\n                  \\t  \\t English\\n                    \"}, {\"link\": \"https://www.lseg.com/ja\", \"text\": \"\\n                        \\n                  \\t  \\t 日本語 – 日本\\n                    \"}, {\"link\": \"https://www.lseg.com/en/about-us\", \"text\": \"\\n                        \\n                  \\t  \\t Who we are\\n                    \"}, {\"link\": \"https://www.lseg.com/en/careers\", \"text\": \"\\n                        \\n                  \\t  \\t Careers\\n                    \"}, {\"link\": \"https://www.lseg.com/en/media-centre\", \"text\": \"\\n                        \\n                  \\t  \\t Media Centre\\n                    \"}, {\"link\": \"https://www.lseg.com/en/investor-relations\", \"text\": \"\\n                        \\n                  \\t  \\t Investor Relations\\n                    \"}, {\"link\": \"https://www.lseg.com/en/locations\", \"text\": \"\\n                        \\n                  \\t  \\t Office locations\\n                    \"}, {\"link\": \"https://www.lseg.com/en/investor-relations/share-fraud-warning\", \"text\": \"\\n                        \\n                  \\t  \\t Security Centre\\n                    \"}, {\"link\": \"https://www.lseg.com/content/lseg/en_us.html\", \"text\": \"\"}, {\"link\": \"https://www.lseg.com/en/policies/privacy-and-cookie-statement\", \"text\": \"Privacy & Cookie Statement\"}, {\"link\": \"https://www.lseg.com/en/sitemap\", \"text\": \"Sitemap\"}, {\"link\": \"https://www.lseg.com/en/policies/website-disclaimer\", \"text\": \"Disclaimer\"}, {\"link\": \"https://www.lseg.com/en/policies/accessibility-statement\", \"text\": \"Accessibility\"}, {\"link\": \"https://www.lseg.com/en/policies/whistleblowing\", \"text\": \"Whistleblowing\"}, {\"link\": \"https://www.lseg.com/en/policies/uk-bribery-act\", \"text\": \"UK Bribery Act\"}, {\"link\": \"https://www.lseg.com/en/policies/modern-slavery-act-statement\", \"text\": \"Modern Slavery Act\"}]"
}