{
    "summary": "Skip to content\n\n  * Industries\n    * Critical Infrastructure\n    * Financial Institutions\n    * Federal Public Sector\n    * Corporations\n    * Defense Industrial Base (DIB)\n    * FinTechs\n    * Residence & Citizenship Programs\n    * visibility-hidden\n  * Products\n    * SOLUTIONS\n      * Third Party Risk Management\n      * Due Diligence\n      * Supply Chain Management\n      * Supply Chain Risk Management\n      * visibility-hidden\n    * PRODUCTS\n      * The 1Exiger PlatformOne platform with end-to-end visibility\n      * Supply Chain ExplorerSingle-Click Due Diligence\n      * DDIQAward-Winning AI-Powered Research Engine for Due Diligence\n      * SDX – Supply Chain VisibilityItem-level Visibility for Multi-tier Supply Chains\n      * DDIQ AnalyticsOrganize, Scrutinize, Visualize & Operationalize Risk Information\n      * Insight 3PMRisk Management Workflow Technology for Onboarding\n      * Part Attribute CharacterizationDocumentation of Part, Process and Material Characteristics\n      * ExploreRxAutomated Mapping of Drugs and Ingredients\n      * ScreenIQSanctions Screening & Adverse Media Monitoring Technology\n      * visibility-hidden\n      * Ion ChannelSoftware Supply Chain Risk Management\n  * Company\n    * Our Story\n    * Media Mentions\n    * Join The Team\n    * visibility-hidden\n    * Our People\n    * Press Releases\n    * visibility-hidden\n    * visibility-hidden\n    * Management Team\n  * Perspectives\n  * Contact Us\n\nMenu\n\n  * Industries\n    * Critical Infrastructure\n    * Financial Institutions\n    * Federal Public Sector\n    * Corporations\n    * Defense Industrial Base (DIB)\n    * FinTechs\n    * Residence & Citizenship Programs\n    * visibility-hidden\n  * Products\n    * SOLUTIONS\n      * Third Party Risk Management\n      * Due Diligence\n      * Supply Chain Management\n      * Supply Chain Risk Management\n      * visibility-hidden\n    * PRODUCTS\n      * The 1Exiger PlatformOne platform with end-to-end visibility\n      * Supply Chain ExplorerSingle-Click Due Diligence\n      * DDIQAward-Winning AI-Powered Research Engine for Due Diligence\n      * SDX – Supply Chain VisibilityItem-level Visibility for Multi-tier Supply Chains\n      * DDIQ AnalyticsOrganize, Scrutinize, Visualize & Operationalize Risk Information\n      * Insight 3PMRisk Management Workflow Technology for Onboarding\n      * Part Attribute CharacterizationDocumentation of Part, Process and Material Characteristics\n      * ExploreRxAutomated Mapping of Drugs and Ingredients\n      * ScreenIQSanctions Screening & Adverse Media Monitoring Technology\n      * visibility-hidden\n      * Ion ChannelSoftware Supply Chain Risk Management\n  * Company\n    * Our Story\n    * Media Mentions\n    * Join The Team\n    * visibility-hidden\n    * Our People\n    * Press Releases\n    * visibility-hidden\n    * visibility-hidden\n    * Management Team\n  * Perspectives\n  * Contact Us\n\n__ Request a demo\n\n  * Industries\n    * Critical Infrastructure\n    * Financial Institutions\n    * Federal Public Sector\n    * Corporations\n    * Defense Industrial Base (DIB)\n    * FinTechs\n    * Residence & Citizenship Programs\n    * visibility-hidden\n  * Products\n    * SOLUTIONS\n      * Third Party Risk Management\n      * Due Diligence\n      * Supply Chain Management\n      * Supply Chain Risk Management\n      * visibility-hidden\n    * PRODUCTS\n      * The 1Exiger PlatformOne platform with end-to-end visibility\n      * Supply Chain ExplorerSingle-Click Due Diligence\n      * DDIQAward-Winning AI-Powered Research Engine for Due Diligence\n      * SDX – Supply Chain VisibilityItem-level Visibility for Multi-tier Supply Chains\n      * DDIQ AnalyticsOrganize, Scrutinize, Visualize & Operationalize Risk Information\n      * Insight 3PMRisk Management Workflow Technology for Onboarding\n      * Part Attribute CharacterizationDocumentation of Part, Process and Material Characteristics\n      * ExploreRxAutomated Mapping of Drugs and Ingredients\n      * ScreenIQSanctions Screening & Adverse Media Monitoring Technology\n      * visibility-hidden\n      * Ion ChannelSoftware Supply Chain Risk Management\n  * Company\n    * Our Story\n    * Media Mentions\n    * Join The Team\n    * visibility-hidden\n    * Our People\n    * Press Releases\n    * visibility-hidden\n    * visibility-hidden\n    * Management Team\n  * Perspectives\n  * Contact Us\n\nMenu\n\n  * Industries\n    * Critical Infrastructure\n    * Financial Institutions\n    * Federal Public Sector\n    * Corporations\n    * Defense Industrial Base (DIB)\n    * FinTechs\n    * Residence & Citizenship Programs\n    * visibility-hidden\n  * Products\n    * SOLUTIONS\n      * Third Party Risk Management\n      * Due Diligence\n      * Supply Chain Management\n      * Supply Chain Risk Management\n      * visibility-hidden\n    * PRODUCTS\n      * The 1Exiger PlatformOne platform with end-to-end visibility\n      * Supply Chain ExplorerSingle-Click Due Diligence\n      * DDIQAward-Winning AI-Powered Research Engine for Due Diligence\n      * SDX – Supply Chain VisibilityItem-level Visibility for Multi-tier Supply Chains\n      * DDIQ AnalyticsOrganize, Scrutinize, Visualize & Operationalize Risk Information\n      * Insight 3PMRisk Management Workflow Technology for Onboarding\n      * Part Attribute CharacterizationDocumentation of Part, Process and Material Characteristics\n      * ExploreRxAutomated Mapping of Drugs and Ingredients\n      * ScreenIQSanctions Screening & Adverse Media Monitoring Technology\n      * visibility-hidden\n      * Ion ChannelSoftware Supply Chain Risk Management\n  * Company\n    * Our Story\n    * Media Mentions\n    * Join The Team\n    * visibility-hidden\n    * Our People\n    * Press Releases\n    * visibility-hidden\n    * visibility-hidden\n    * Management Team\n  * Perspectives\n  * Contact Us\n\n__ Request a demo\n\n  * __\n  * __\n  * __\n\n  * __\n  * __\n  * __\n\n# The Ultimate Guide to the Sanctions Screening Process￼\n\n  * July 18, 2022 \n\nArticle\n\n## What Are Sanctions?\n\nSanctions are a type of economic pressure used by governments and\ninternational bodies to protect security interests and international law\nagainst aggressive actions or threats to international peace and security.\n\nSanctions can be imposed for various reasons, including anti-money laundering\n(AML) reasons, financial crimes, human rights violations, terrorism, invasion,\nand proliferation of weapons of mass destruction.\n\nSanctions can take many forms but typically involve limiting or banning trade\nwith a country or entity.\n\nSanctions can significantly impact businesses, especially those that rely\nheavily on international trade. They can disrupt supply chains and make it\ndifficult—or impossible—to do business with certain countries.\n\nGeopolitical risk is growing in many parts of the world, and the current food\ncrisis is likely to worsen things. Sanctions will become increasingly common\nto influence behavior and resolve conflicts.\n\nThis article will discuss various sanctions lists and their potential impact\non business, examples of sanctions lists, and how to implement an effective\nsanctions screening process.\n\n### What Is a Sanctions List?\n\nThe word “sanctions” can have different meanings. In business, sanctions\nusually refer to economic and regulatory penalties imposed by one country on\nanother for geopolitical reasons.\n\nA sanctions list is a collection of individuals, businesses, and countries\nsubject to economic sanctions. Sanctions lists are maintained by governments\nand international organizations such as the United Nations (UN) and the\nEuropean Union (EU).\n\nEconomic sanctions are trade restrictions imposed by one country on another.\nThe purpose of economic sanctions is to change the behavior of the target\ncountry. For instance, the European Union has banned all oil imports from\nRussia as punishment for its invasion of Ukraine.\n\nThere are three main types of economic sanctions:\n\n  * An **embargo** is a complete ban on trade with a country. It is the most severe type of economic sanction.\n\n  * **Trade restrictions** are less severe than an embargo, but they still limit the amount or type of trade that can be done with a country.\n\n  * **Financial sanctions** are measures that limit or prohibit financial transactions with a country. Economic sanctions can include freezing bank accounts, banning investment, and blocking access to the international financial system.\n\n## Why Complying with Sanctions Lists Is Important\n\nAll businesses are responsible for sanctions screening and ensuring their\ncompliance, and choosing not to do so can be costly. For example, BNP Paribas,\nFrance’s largest bank, was fined $9 billion for violating US sanctions against\nIran, Sudan, and Cuba.\n\nComplying with sanctions lists is essential because it helps ensure that\nbusinesses and legal entities are not inadvertently doing business with\nentities or individuals sanctioned by the government.\n\nScreening against sanctions lists is a complex process, but several screening\nsolutions can help automate the process. Exiger’s ScreenIQ offers sanctions\nscreening and adverse media monitoring technology that is proven to make life\neasier for risk management and compliance teams worldwide.\n\nBy complying with global sanctions lists, businesses can help protect\nthemselves from costly fines and reputational damage.\n\n## 4 Examples of Sanctions Lists\n\nHere are some examples of sanctions lists:\n\n  * **HM Treasury Sanctions List** **.** The HM Treasury Sanctions List is a list of individuals, groups, and entities subject to financial sanctions in the United Kingdom. The sanctions target those involved in terrorist activity, proliferating weapons of mass destruction, or violating human rights.\n\n  * **EU Consolidated List of Sanctions** **.** The EU Consolidated List of Sanctions is a list of individuals, groups, and entities subject to financial sanctions by the European Union. The sanctions target those involved in terrorist activity, proliferating weapons of mass destruction, or violating human rights.\n\n  * **OFAC Sanctions List** **.** The OFAC Sanctions List is a list of individuals, groups, and entities subject to financial sanctions by the US Department of Treasury’s Office of Foreign Assets Control. The sanctions target those involved in terrorist activity, proliferating weapons of mass destruction, or violating human rights.\n\n  * **UN Sanctions List** **.** The UN Sanctions List is a list of individuals, groups, and entities subject to financial sanctions by the United Nations Security Council. The sanctions target those involved in terrorist activity, proliferating weapons of mass destruction, or violating human rights.\n\n## How to Implement an Effective Sanctions Screening Process\n\nSanctions constantly evolve, and keeping up with the latest changes can be\ndifficult. Ensuring compliance with sanctions is a complex and critical\nchallenge for organizations.\n\nImplementing an effective sanctions screening process can help your\norganization avoid running afoul of sanctions and facing severe penalties.\n\n### 1\\. Determine High-risk Operations\n\nPerform due diligence and consider all aspects of your organization’s business\nwhen performing a high-risk assessment.\n\n  * Know your customer and look at your customer data, supply chain, and financial transactions. Screen all parties involved in a transaction, including the payee, the payer, and any third parties. \n\n_Supply Chain Explorer rapidly surfaces, understands, and mitigates critical\nthreats to your entire supplier ecosystem—down to the Nth tier—with just one\nclick._ _Request free, comprehensive trial today_ _._\n\n  * Check for matches against known sanctions lists and watchlists. You may need to check several different sanctions lists, including the OFAC Specially Designated Nationals and Blocked Person List, the EU Consolidated List of Persons, Groups, and Entities Subject to EU Financial Sanctions, and the UN Consolidated Sanctions List.\n  * Perform a transaction screening. Look at the type of transaction, the country or region involved, and the parties involved. For example, transaction monitoring involving Iran or North Korea is considered high risk.\n  * Identify potential matches and investigate further. If you find a possible match, you’ll need to dive deeper and determine whether it’s an actual match. This can be done by looking at additional information, such as the date of birth or address.\n  * Take action if necessary. If you determine that a transaction does violate sanctions, you’ll need to take appropriate action. This may involve stopping the transaction, notifying the relevant authorities, or taking other steps.\n\n### 2\\. Prioritize Data Organization\n\nRegarding sanctions screening, one of the most important things you can do is\nprioritize data organization. A well-organized screening system for storing\nand accessing your data will make screening for potential matches against\nsanctions lists much more effortless.\n\nThere are a few different ways to go about organizing your data:\n\n  * Create a central database with various criteria to search. \n  * Maintain separate files for each data type, such as customer names, addresses, and ID numbers. \n  * Make sure you have a transparent system for labeling and storing data. This will make it easier to find specific information when you need it.\n  * Keep track of where your data comes from. This will help you determine its accuracy and trustworthiness.\n  * Be sure to regularly back up your data. This will protect you in case of a power outage or other technical issues.\n  * Identify key sanctions data sources.\n  * Detail further critical points to this part of the process.\n\nWhichever method you choose, it’s essential to have a system that can be\neasily updated and accessed by all members of your screening team.\n\n### 3\\. Prioritize Relevant Data Elements\n\nAs you develop your screening process and identify screening requirements, it\nwill be essential to prioritize relevant data elements. This will help you\nfocus on the information that is most likely to be associated with sanctioned\nindividuals and entities and ensure that your process is as efficient as\npossible.\n\nThere are a few factors to consider when determining which data elements to\nprioritize:\n\n  * **The type of data you have available.** Some data will be more beneficial than others in identifying sanctioned individuals and entities. For example, birthdates and addresses are more helpful than middle names or nicknames.\n  *  **How likely the data is to change.** Sanctioned individuals and entities often change their names or contact information to avoid detection. As a result, data that is less likely to change, such as date of birth, is more valuable than data that is more likely to change, such as address.\n  *  **How specific the data is.** The more detailed the information is, the easier it will be to match it to records in sanctions lists. For example, a full name is more specific than the last name, and a complete address is more detailed than a city.\n\nOnce you have considered these factors, you can prioritize the data elements\nthat are most relevant to your organization, and that will be most effective\nin identifying sanctioned individuals and entities.\n\n### 4\\. Set Up Screening Intervals\n\nWhile it is essential to have an effective sanctions screening process in\nplace, it is also critical to ensure that screening intervals are set up\ncorrectly. Screening intervals should be based on various factors, including\nthe type of sanction being screened for, the country or region involved, and\nthe level of risk associated with the transaction.\n\nWhen setting up screening intervals, financial institutions should consider\nthe following:\n\n  * **The type of sanction being screened for.** Sanctions can be divided into two broad categories: primary and secondary. Primary sanctions are imposed by a country or regional body on another country or entity and typically target key industries or sectors. A government or regional body sets secondary sanctions on entities doing business with a country or entity already subject to primary sanctions.\n  *  **The country or region involved.** Sanction regimes can vary significantly from one country or region to another. For example, European Union sanctions typically target specific sectors, while US sanctions often target individuals and entities.\n  *  **The level of risk associated with the transaction.** Transactions involving high-risk countries or regions or conducted in high-risk industries or sectors may require more frequent screening.\n\nFinancial institutions should also remember that sanctions regimes can change\nrapidly and that new sanctions may be imposed with little or no notice. As a\nresult, it is crucial to have a process in place for reviewing and updating\nscreening intervals on an ongoing basis.\n\n### 5\\. Check Compliance Against Relevant Sanctions Lists\n\nAs part of an effective sanctions screening process, it is crucial to check\nfinancial crime compliance against relevant sanctions lists. This will help\nensure that your organization is not doing business with individuals or\nentities subject to economic sanctions.\n\n_Read Exiger’s white paper “_ _Corporations and Sanctions Compliance:\nNavigating through a Minefield_ _” to learn more._\n\nYou may need to check many different sanctions lists, depending on your\nbusiness and operations. The most common ones are the US Treasury Department’s\nOffice of Foreign Assets Control (OFAC) list, the European Union’s\nconsolidated sanctions list, and the United Nations Security Council sanctions\nlist.\n\nChecking compliance against these lists can be a complex and time-consuming\nprocess, so it is vital to have a robust system and employee onboarding to do\nthis effectively.\n\nOne way to streamline the process is to use a sanctions screening solution. A\nsanctions screening software can help you quickly and accurately check\ncompliance against multiple sanctions lists and other critical data sets such\nas Politically Exposed Persons (PEP) lists.\n\nSanctions/PEP screening is essential to compliance with economic sanctions and\nother measures. By checking compliance against relevant sanctions lists, you\ncan help ensure that your organization is not doing business with individuals\nor entities subject to these measures.\n\n## Boost Your Sanctions Screening with Exiger\n\nSanctions lists can have a significant impact on business. It is vital to\nensure your company has an effective sanctions screening process in place to\navoid potential penalties and fines.\n\nExiger’s screening tools and team of experts can help your business build its\nsanctions screening capabilities. We offer a range of services, including\ntraining, software, and consulting that will help you stay ahead of the curve\nregarding compliance with sanction regulations.  \nContact us today to learn how we can help you protect your business from the\nrisks associated with doing business with sanctioned entities.\n\n### Don’t play guess who. Mitigate your risk today:\n\n## For more on Exiger’s Sanctions Response:\n\nCompanies and Sanctions Compliance: Navigating Through a Minefield\n\nRead White Paper\n\nFinancial Sanctions Evasion Typologies: Russian Elites And Enablers\n\nView Client Alert\n\nNever the Same: Business After the War In Ukraine\n\nTune In\n\n    \n    \n    our blog\n\n## Perspectives\n\nSEE ALL\n\nArticle\n\n  * November 27, 2023 \n\nExecutive Action on Supply Chain Resilience Should Use Data to Reduce Risk and\nStrengthen Economy\n\n__\n\nArticle\n\n  * November 20, 2023 \n\nUnderstanding Carbon Emissions Risks Across the Supply Chain\n\n__\n\nKey Takeways\n\n  * November 15, 2023 \n\nU.S. Automakers, Forced Labor Concerns, and the Path to an Affordable\nElectrified Future\n\n__\n\n###### Industries\n\n  * Critical Infrastructure\n  * Financial Institutions\n  * Federal Public Sector\n  * Corporations\n  * Defense Industrial Base\n  * FinTechs\n  * Residence & Citizenship Programs\n\n###### Solutions\n\n  * Third Party Risk Management\n  * Supply Chain Management\n  * Supply Chain Risk Management\n  * Advisory Solutions\n  * Due Diligence\n\n###### Products\n\n  * Supply Chain Explorer\n  * SDX Supply Chain Visibility\n  * Insight 3PM\n  * DDIQ Analytics\n  * DDIQ\n  * ScreenIQ\n  * Part Attribute Characterization\n  * ExploreRx\n  * Ion Channel\n\n###### Company\n\n  * Our Story\n  * Media Mentions\n  * Press Releases\n  * Management Team\n  * Our People\n  * Join the Team\n\ncontact us\n\njoin the team\n\n© 2023\n\nPrivacy and Legal Center\n\nLinkedin\n\n## Demo The  \nExiger Platform\n\nFirst Name*\n\nLast Name*\n\nBusiness Email*\n\nCompany Name*\n\nPhone Number*\n\nCountry/Region*\n\nPlease SelectAfghanistanAlbaniaAlgeriaAmerican\nSamoaAndorraAngolaAnguillaAntigua &\nBarbudaArgentinaArmeniaArubaAustraliaAustriaAzerbaijanBahamasBahrainBangladeshBarbadosBelarusBelgiumBelizeBeninBermudaBhutanBoliviaBosnia\n& HerzegovinaBotswanaBrazilBritish Virgin Is.BruneiBulgariaBurkina\nFasoBurmaBurundiCambodiaCameroonCanadaCape VerdeCayman IslandsCentral African\nRep.ChadChileChinaColombiaComorosCook IslandsCosta RicaCote\nd'IvoireCroatiaCubaCyprusCzech RepublicDenmarkDjiboutiDominicaDominican\nRepublicEast TimorEcuadorEgyptEl SalvadorEquatorial\nGuineaEritreaEstoniaEthiopiaFaroe IslandsFijiFinlandFranceFrench GuianaFrench\nPolynesiaGabonGambiaGeorgiaGermanyGhanaGibraltarGreeceGreenlandGrenadaGuadeloupeGuamGuatemalaGuernseyGuineaGuinea-\nBissauGuyanaHaitiHondurasHong\nKongHungaryIcelandIndiaIndonesiaIranIraqIrelandIsle of\nManIsraelItalyJamaicaJapanJerseyJordanKazakhstanKenyaKiribatiKuwaitKyrgyzstanLaosLatviaLebanonLesothoLiberiaLibyaLiechtensteinLithuaniaLuxembourgMacauMacedoniaMadagascarMalawiMalaysiaMaldivesMaliMaltaMarshall\nIslandsMartiniqueMauritaniaMauritiusMayotteMexicoMicronesiaMoldovaMonacoMongoliaMontserratMoroccoMozambiqueN.\nMariana IslandsNamibiaNauruNepalNetherlandsNetherlands AntillesNew\nCaledoniaNew ZealandNicaraguaNigerNigeriaNorth\nKoreaNorwayOmanPakistanPalauPanamaPapua New\nGuineaParaguayPeruPhilippinesPolandPortugalPuerto RicoQatarRepublic of\nCongoReunionRomaniaRussiaRwandaSaint HelenaSaint Kitts & NevisSaint LuciaSaint\nVincent and the GrenadinesSamoaSan MarinoSao Tome & PrincipeSaudi\nArabiaSenegalSerbiaSeychellesSierra LeoneSingaporeSlovakiaSloveniaSolomon\nIslandsSomaliaSouth AfricaSouth KoreaSpainSri LankaSt Pierre &\nMiquelonSudanSurinameSwazilandSwedenSwitzerlandSyriaTaiwanTajikistanTanzaniaThailandTogoTongaTrinidad\n& TobagoTunisiaTurkeyTurkmenistanTurks & Caicos Is.TuvaluUgandaUkraineUnited\nArab EmiratesUnited KingdomUnited\nStatesUruguayUzbekistanVanuatuVenezuelaVietnamVirgin IslandsWallis and\nFutunaWestern SaharaYemenZambiaZimbabweGaza StripWest BankTurks & Caicos\nIsRepublic of Conga\n\nutm_campaign\n\nutm_content\n\nutm_medium\n\nutm_source\n\nutm_campaign_group\n\nutm_term\n\nSF Persona\n\nBy clicking the submit button and sharing my information, I agree to the\nPrivacy Notice and to be contacted about Exiger products and services.\n\nWe are using cookies to give you the best experience on our website.\n\nYou can find out more about which cookies we are using or switch them off in\nsettings.\n\nAccept\n\nClose GDPR Cookie Settings\n\n  * Privacy Overview\n  * Essential Cookies\n  * Analytics Cookies\n  * Marketing & Advertising\n\nPowered by  GDPR Cookie Compliance\n\nPrivacy Overview\n\nThis website uses cookies so that we can provide you with the best user\nexperience possible. Cookie information is stored in your browser and performs\nfunctions such as recognising you when you return to our website and helping\nour team to understand which sections of the website you find most interesting\nand useful.\n\nEssential Cookies\n\nStrictly Necessary Cookie should be enabled at all times so that we can save\nyour preferences for cookie settings.\n\nEnable or Disable Cookies\n\nIf you disable this cookie, we will not be able to save your preferences. This\nmeans that every time you visit this website you will need to enable or\ndisable cookies again.\n\nAnalytics Cookies\n\nThis website uses Google Analytics to collect anonymous information such as\nthe number of visitors to the site, and the most popular pages. This website\nalso uses Google Tag Manager to aid in tracking understanding user web\nactivity\n\nKeeping these cookies enabled helps us to improve our website.\n\nEnable or Disable Cookies\n\nPlease enable Strictly Necessary Cookies first so that we can save your\npreferences!\n\nMarketing & Advertising\n\nThis website uses additional tags to aid in marketing, advertising and sales.\n\nEnable or Disable Cookies\n\nPlease enable Strictly Necessary Cookies first so that we can save your\npreferences!\n\nEnable All Save Settings\n\n",
    "links": "[{\"link\": \"https://www.exiger.com/professionals\", \"text\": \"Our People\"}, {\"link\": \"https://www.exiger.com/professionals\", \"text\": \"Our People\"}, {\"link\": \"https://www.exiger.com/professionals\", \"text\": \"Our People\"}, {\"link\": \"https://www.exiger.com/professionals\", \"text\": \"Our People\"}, {\"link\": \"https://www.exiger.com/perspectives/\", \"text\": \"\"}, {\"link\": \"https://www.exiger.com/industries/financial-institutions\", \"text\": \"\"}, {\"link\": \"https://www.exiger.com/industries/public-sector/\", \"text\": \"\"}, {\"link\": \"https://www.exiger.com/industries/corporations\", \"text\": \"\"}, {\"link\": \"https://www.exiger.com/industries/fintechs/\", \"text\": \"\"}, {\"link\": \"https://www.exiger.com/supply-chain-management-software/\", \"text\": \"\"}, {\"link\": \"https://www.exiger.com/advisory/\", \"text\": \"\"}, {\"link\": \"https://www.exiger.com/products/ddiq/\", \"text\": \"\"}, {\"link\": \"https://www.exiger.com/products/supply-chain-explorer/\", \"text\": \"\"}, {\"link\": \"https://www.exiger.com/products/insight-3pm/\", \"text\": \"\"}, {\"link\": \"https://www.exiger.com/products/ddiq-analytics/\", \"text\": \"\"}, {\"link\": \"https://www.exiger.com/products/ddiq/\", \"text\": \"\"}, {\"link\": \"https://www.exiger.com/products/screeniq/\", \"text\": \"\"}, {\"link\": \"https://www.exiger.com/products/ion-channel/\", \"text\": \"\"}, {\"link\": \"https://www.exiger.com/about/\", \"text\": \"\"}, {\"link\": \"https://www.exiger.com/news/\", \"text\": \"\"}, {\"link\": \"https://www.exiger.com/press-release/\", \"text\": \"\"}, {\"link\": \"https://www.exiger.com/management-team/\", \"text\": \"\"}, {\"link\": \"https://www.exiger.com/professionals/\", \"text\": \"\"}, {\"link\": \"https://www.exiger.com/careers/\", \"text\": \"\"}, {\"link\": \"https://www.exiger.com/contact-us/\", \"text\": \"\"}, {\"link\": \"https://www.exiger.com/careers/\", \"text\": \"\"}, {\"link\": \"https://www.exiger.com/privacy-and-legal-center/\", \"text\": \"\"}]"
}