{
    "summary": "Powered by Cookiebot\n\n  * Consent\n  * Details\n  * [#IABV2SETTINGS#]\n  * About\n\n## This website uses cookies\n\nThis website uses cookies to improve your experience, tailor content to your\npreferences, and analyze performance and traffic on our website. We share\ninformation about use of our site with our social media, advertising and\nanalytics partners.\n\nConsent Selection\n\nNecessary\n\nPreferences\n\nStatistics\n\nMarketing\n\nShow details\n\n  * Necessary  11\n\nNecessary cookies help make a website usable by enabling basic functions like\npage navigation and access to secure areas of the website. The website cannot\nfunction properly without these cookies.\n\n    * Cookiebot\n\n2\n\nLearn more about this provider\n\n1.gifUsed to count the number of sessions to the website, necessary for\noptimizing CMP product delivery.\n\n**Expiry** : Session **Type** : Pixel\n\nCookieConsentStores the user's cookie consent state for the current domain\n\n **Expiry** : 1 year **Type** : HTTP\n\n    * Google\n\n3\n\nLearn more about this provider\n\ntest_cookieUsed to check if the user's browser supports cookies.\n\n **Expiry** : 1 day **Type** : HTTP\n\nrc::aThis cookie is used to distinguish between humans and bots. This is\nbeneficial for the website, in order to make valid reports on the use of their\nwebsite.\n\n **Expiry** : Persistent **Type** : HTML\n\nrc::cThis cookie is used to distinguish between humans and bots.\n\n**Expiry** : Session **Type** : HTML\n\n    * Hubspot\n\n2\n\nLearn more about this provider\n\n__cf_bmThis cookie is used to distinguish between humans and bots. This is\nbeneficial for the website, in order to make valid reports on the use of their\nwebsite.\n\n **Expiry** : 1 day **Type** : HTTP\n\n_cfuvidThis cookie is a part of the services provided by Cloudflare -\nIncluding load-balancing, deliverance of website content and serving DNS\nconnection for website operators.\n\n**Expiry** : Session **Type** : HTTP\n\n    * LinkedIn\n\n2\n\nLearn more about this provider\n\nli_gcStores the user's cookie consent state for the current domain\n\n **Expiry** : 180 days **Type** : HTTP\n\nbscookieThis cookie is used to identify the visitor through an application.\nThis allows the visitor to login to a website through their LinkedIn\napplication for example.\n\n **Expiry** : 1 year **Type** : HTTP\n\n    * YouTube\n\n1\n\nLearn more about this provider\n\nCONSENTUsed to detect if the visitor has accepted the marketing category in\nthe cookie banner. This cookie is necessary for GDPR-compliance of the\nwebsite.\n\n**Expiry** : 2 years **Type** : HTTP\n\n    * cdn.complycube.com\n\n1\n\nelementorUsed in context with the website's WordPress theme. The cookie allows\nthe website owner to implement or change the website's content in real-time.\n\n **Expiry** : Persistent **Type** : HTML\n\n  * Preferences  1\n\nPreference cookies enable a website to remember information that changes the\nway the website behaves or looks, like your preferred language or the region\nthat you are in.\n\n    * LinkedIn\n\n1\n\nLearn more about this provider\n\nlidcRegisters which server-cluster is serving the visitor. This is used in\ncontext with load balancing, in order to optimize user experience.\n\n**Expiry** : 1 day **Type** : HTTP\n\n  * Statistics  10\n\nStatistic cookies help website owners to understand how visitors interact with\nwebsites by collecting and reporting information anonymously.\n\n    * Google\n\n3\n\nLearn more about this provider\n\n_gaRegisters a unique ID that is used to generate statistical data on how the\nvisitor uses the website.\n\n **Expiry** : 2 years **Type** : HTTP\n\n_ga_#Used by Google Analytics to collect data on the number of times a user\nhas visited the website as well as dates for the first and most recent visit.\n\n**Expiry** : 2 years **Type** : HTTP\n\ntdRegisters statistical data on users' behaviour on the website. Used for\ninternal analytics by the website operator.\n\n**Expiry** : Session **Type** : Pixel\n\n    * Hubspot\n\n4\n\nLearn more about this provider\n\n__hsscIdentifies if the cookie data needs to be updated in the visitor's\nbrowser.\n\n **Expiry** : 1 day **Type** : HTTP\n\n__hssrcUsed to recognise the visitor's browser upon reentry on the website.\n\n **Expiry** : Session **Type** : HTTP\n\n__hstcSets a unique ID for the session. This allows the website to obtain data\non visitor behaviour for statistical purposes.\n\n **Expiry** : 180 days **Type** : HTTP\n\nhubspotutkSets a unique ID for the session. This allows the website to obtain\ndata on visitor behaviour for statistical purposes.\n\n **Expiry** : 180 days **Type** : HTTP\n\n    * LinkedIn\n\n1\n\nLearn more about this provider\n\nAnalyticsSyncHistoryUsed in connection with data-synchronization with third-\nparty analysis service.\n\n**Expiry** : 30 days **Type** : HTTP\n\n    * demo.arcade.software\n\n2\n\najs_anonymous_idThis cookie is used to identify a specific visitor - this\ninformation is used to identify the number of specific visitors on a website.\n\n **Expiry** : 1 year **Type** : HTTP\n\najs_anonymous_idThis cookie is used to count how many times a website has been\nvisited by different visitors - this is done by assigning the visitor an ID,\nso the visitor does not get registered twice.\n\n **Expiry** : Persistent **Type** : HTML\n\n  * Marketing  34\n\nMarketing cookies are used to track visitors across websites. The intention is\nto display ads that are relevant and engaging for the individual user and\nthereby more valuable for publishers and third party advertisers.\n\n    * Google\n\n6\n\nLearn more about this provider\n\n_gcl_auUsed by Google AdSense for experimenting with advertisement efficiency\nacross websites using their services.\n\n**Expiry** : 3 months **Type** : HTTP\n\nIDEUsed by Google DoubleClick to register and report the website user's\nactions after viewing or clicking one of the advertiser's ads with the purpose\nof measuring the efficacy of an ad and to present targeted ads to the user.\n\n **Expiry** : 1 year **Type** : HTTP\n\npagead/landingCollects data on visitor behaviour from multiple websites, in\norder to present more relevant advertisement - This also allows the website to\nlimit the number of times that they are shown the same advertisement.\n\n**Expiry** : Session **Type** : Pixel\n\nads/ga-audiencesUsed by Google AdWords to re-engage visitors that are likely\nto convert to customers based on the visitor's online behaviour across\nwebsites.\n\n **Expiry** : Session **Type** : Pixel\n\npagead/1p-conversion/#/Pending\n\n **Expiry** : Session **Type** : Pixel\n\npagead/1p-user-list/#Tracks if the user has shown interest in specific\nproducts or events across multiple websites and detects how the user navigates\nbetween sites. This is used for measurement of advertisement efforts and\nfacilitates payment of referral-fees between websites.\n\n **Expiry** : Session **Type** : Pixel\n\n    * Hubspot\n\n1\n\nLearn more about this provider\n\n__ptq.gifSends data to the marketing platform Hubspot about the visitor's\ndevice and behaviour. Tracks the visitor across devices and marketing\nchannels.\n\n **Expiry** : Session **Type** : Pixel\n\n    * LinkedIn\n\n3\n\nLearn more about this provider\n\nbcookieUsed by the social networking service, LinkedIn, for tracking the use\nof embedded services.\n\n **Expiry** : 1 year **Type** : HTTP\n\nli_sugrCollects data on user behaviour and interaction in order to optimize\nthe website and make advertisement on the website more relevant.\n\n**Expiry** : 3 months **Type** : HTTP\n\nUserMatchHistoryEnsures visitor browsing-security by preventing cross-site\nrequest forgery. This cookie is essential for the security of the website and\nvisitor.\n\n**Expiry** : 30 days **Type** : HTTP\n\n    * YouTube\n\n20\n\nLearn more about this provider\n\nLAST_RESULT_ENTRY_KEYUsed to track user’s interaction with embedded content.\n\n **Expiry** : Session **Type** : HTTP\n\nLogsDatabaseV2:V#||LogsRequestsStorePending\n\n **Expiry** : Persistent **Type** : IDB\n\nnextIdUsed to track user’s interaction with embedded content.\n\n **Expiry** : Session **Type** : HTTP\n\nremote_sidNecessary for the implementation and functionality of YouTube video-\ncontent on the website.\n\n**Expiry** : Session **Type** : HTTP\n\nrequestsUsed to track user’s interaction with embedded content.\n\n **Expiry** : Session **Type** : HTTP\n\nServiceWorkerLogsDatabase#SWHealthLogNecessary for the implementation and\nfunctionality of YouTube video-content on the website.\n\n**Expiry** : Persistent **Type** : IDB\n\nTESTCOOKIESENABLEDUsed to track user’s interaction with embedded content.\n\n **Expiry** : 1 day **Type** : HTTP\n\nVISITOR_INFO1_LIVETries to estimate the users' bandwidth on pages with\nintegrated YouTube videos.\n\n **Expiry** : 180 days **Type** : HTTP\n\nVISITOR_PRIVACY_METADATAStores the user's cookie consent state for the current\ndomain\n\n **Expiry** : 180 days **Type** : HTTP\n\nYSCRegisters a unique ID to keep statistics of what videos from YouTube the\nuser has seen.\n\n **Expiry** : Session **Type** : HTTP\n\nyt.innertube::nextIdRegisters a unique ID to keep statistics of what videos\nfrom YouTube the user has seen.\n\n **Expiry** : Persistent **Type** : HTML\n\nytidb::LAST_RESULT_ENTRY_KEYUsed to track user’s interaction with embedded\ncontent.\n\n **Expiry** : Persistent **Type** : HTML\n\nYtIdbMeta#databasesUsed to track user’s interaction with embedded content.\n\n **Expiry** : Persistent **Type** : IDB\n\nyt-remote-cast-availableStores the user's video player preferences using\nembedded YouTube video\n\n **Expiry** : Session **Type** : HTML\n\nyt-remote-cast-installedStores the user's video player preferences using\nembedded YouTube video\n\n **Expiry** : Session **Type** : HTML\n\nyt-remote-connected-devicesStores the user's video player preferences using\nembedded YouTube video\n\n **Expiry** : Persistent **Type** : HTML\n\nyt-remote-device-idStores the user's video player preferences using embedded\nYouTube video\n\n **Expiry** : Persistent **Type** : HTML\n\nyt-remote-fast-check-periodStores the user's video player preferences using\nembedded YouTube video\n\n **Expiry** : Session **Type** : HTML\n\nyt-remote-session-appStores the user's video player preferences using embedded\nYouTube video\n\n **Expiry** : Session **Type** : HTML\n\nyt-remote-session-nameStores the user's video player preferences using\nembedded YouTube video\n\n **Expiry** : Session **Type** : HTML\n\n    * demo.arcade.software\n\n4\n\n__tld__ [x2]Used to track visitors on multiple websites, in order to present\nrelevant advertisement based on the visitor's preferences.\n\n**Expiry** : Session **Type** : HTTP\n\najs_user_idThis cookie is used to collect data on the visitor's behavior on\nthe website - this information can be used to assign the visitor to a visitor\nsegment, based on common preferences.\n\n **Expiry** : Session **Type** : HTTP\n\najs_user_idCollects data on visitors' preferences and behaviour on the website\n- This information is used make content and advertisement more relevant to the\nspecific visitor.\n\n**Expiry** : Persistent **Type** : HTML\n\n  * Unclassified 1\n\nUnclassified cookies are cookies that we are in the process of classifying,\ntogether with the providers of individual cookies.\n\n    * demo.arcade.software\n\n1\n\nsentry-offline#queuePending\n\n **Expiry** : Persistent **Type** : IDB\n\nCross-domain consent[#BULK_CONSENT_DOMAINS_COUNT#] [#BULK_CONSENT_TITLE#]\n\nList of domains your consent applies to: [#BULK_CONSENT_DOMAINS#]\n\nCookie declaration last updated on 12/4/23 by Cookiebot\n\n## [#IABV2_TITLE#]\n\n[#IABV2_BODY_INTRO#]\n\n[#IABV2_BODY_LEGITIMATE_INTEREST_INTRO#]\n\n[#IABV2_BODY_PREFERENCE_INTRO#]\n\n[#IABV2_LABEL_PURPOSES#]\n\n[#IABV2_BODY_PURPOSES_INTRO#]\n\n[#IABV2_BODY_PURPOSES#]\n\n[#IABV2_LABEL_FEATURES#]\n\n[#IABV2_BODY_FEATURES_INTRO#]\n\n[#IABV2_BODY_FEATURES#]\n\n[#IABV2_LABEL_PARTNERS#]\n\n[#IABV2_BODY_PARTNERS_INTRO#]\n\n[#IABV2_BODY_PARTNERS#]\n\nCookies are small text files that can be used by websites to make a user's\nexperience more efficient.  \n  \nThe law states that we can store cookies on your device if they are strictly\nnecessary for the operation of this site. For all other types of cookies we\nneed your permission.  \n  \nThis site uses different types of cookies. Some cookies are placed by third\nparty services that appear on our pages.  \n  \nYou can at any time change or withdraw your consent from the Cookie\nDeclaration on our website.  \n  \nLearn more about who we are, how you can contact us and how we process\npersonal data in our Privacy Policy.  \n  \nPlease state your consent ID and date when you contact us regarding your\nconsent.\n\nDo not sell or share my personal information\n\nDeny Allow selection Customize\n\nAllow all\n\nPowered by Cookiebot by Usercentrics\n\nSkip to content\n\nShape\n\n  * Solutions __\n\n##### AML screening\n\nSanctions & PEP screening  \nReduce sanctions and political exposure risk\n\nAdverse media checks  \nMinimize reputational risk to your business\n\nWatchlist screening  \nCheck customers against black and grey lists\n\nContinuous monitoring  \nStay tuned with real-time screening updates\n\n##### Identity assurance\n\nDocument verification  \nAuthenticate identity documents effortlessly\n\nBiometric verification  \nCheck document ownership with biometrics\n\nAge Estimation  \nStreamline your age-restricted offerings\n\nAddress verification  \nConfirm customer addresses seamlessly\n\nMulti-bureau checks  \nValidate customer details using trusted sources\n\n##### Due diligencE\n\nKnow your customer  \nDeter fraudsters with smart KYC checks\n\nCustomer due diligence  \nComplete customer due diligence with ease\n\nRisk scoring  \nConduct risk analysis on your customers\n\nAnti-money laundering  \nRobust AML solutions to satisfy regulators\n\nCase management  \nManage cases effortlessly via no-code solutions\n\nView all solutions\n\n  * Use cases __\n\n##### By Process\n\nCustomer onboarding  \nMake user onboarding fast and frictionless\n\nAge verification  \nVerify users’ age to protect the vulnerable\n\nFraud prevention  \nStop fraud before it happens\n\nOngoing due diligence  \nKeep up with your AML monitoring duties\n\nKnow your business  \nPerform due diligence on businesses with ease\n\n##### by Industry\n\nFinancial services  \nStreamline your AML and KYC processes\n\nTelcoms  \nVerify SIM holders in line with registration rules\n\nCrypto  \nMeet KYC requirements and reduce friction\n\nPayments  \nEstablish trust to facilitate transactions\n\nFinTech  \nBuild compelling low-friction customer journeys\n\n##### by Profession\n\nMLROs  \nEmpower MLROs with adequate AML controls\n\nCompliance managers  \nDesign and deliver risk-based AML procedures\n\nOnboarding specialists  \nOnboard customers faster than ever before\n\nFraud analysts  \nDetect, monitor, and report money laundering\n\nProduct managers  \nBuild compliance-by-design into products\n\nView all use cases\n\n  * Resources __\n\n##### Learn\n\nBlog  \nGet the latest insights in the AML, KYC, and identity verification space\n\n##### Help\n\nFAQs  \nGet answers to frequently asked questions\n\n##### Support\n\nHelp center  \nSubmit a ticket and our team will swiftly assist you\n\n  * Developers __\n\n##### Get started\n\nDocumentation  \nExplore how to get started with ComplyCube\n\nWeb SDK  \nLeverage our cross-device JavaScript SDK\n\nMobile SDKs  \nUse our native mobile SDKs in your apps\n\nHosted verification page  \nEffortlessly deploy our hosted solution\n\nCodeless solution  \nGet started without writing a single line of code\n\n##### API Guides\n\nPerform AML screenings  \nEasily integrate our extensive screening check\n\nCheck ID documents  \nVerify identity documents with one API call\n\nVerify customer identities  \nCheck user presence with our biometric checks\n\nPerform Proof of Address checks  \nValidate information on PoA documents\n\nRun a multi-bureau check  \nCorroborate client data with trust sources\n\n##### Reference\n\nFull API reference  \nCheck out our comprehensive API reference\n\nAPI status  \nGet updates on our service health and status\n\nAPI changelog  \nOur log for API changes and new functionality\n\nIntegration checklist  \nChecklist for a smooth transition to Live\n\nSupport  \nGet help with your technical issues\n\n  * Pricing\n  * Company __\n\n##### Our Company\n\nAbout us  \nLearn about ComplyCube’s mission\n\nCareers  \nHelp us make the world a better and safe place\n\n##### Under the Spotlight\n\nPress  \nMedia coverage about us\n\nContact us  \nGet in touch if you have queries\n\n##### Partner with us\n\nPartner program  \nHelp us spread trust and stop fraud everywhere\n\nStartup program  \nJumpstart your onboarding process\n\nX\n\nLogin\n\nSign up\n\n# What is Sanctions Screening?\n\nSanctions Screening is an Anti-Money Laundering (AML) and Counter-Terrorist\nFinancing (CTF) control used to detect, prevent, and disrupt financial crime.\nRegulated businesses must conduct sanctions risk screening as a mandatory\npractice for effective sanctions compliance. This step is a crucial component\nof the Know Your Customer (KYC) process, which ensures thorough due diligence\nand risk mitigation.\n\nAs the sanctions landscape is ever-changing, understanding operational and\nregulatory implications is of paramount importance. This comprehensive guide\naims to provide practical insights into sanctions, the governing bodies that\nenforce them, and the sanctions screening solutions available.\n\n##  **What are Sanctions?**\n\nSanctions are tools used by countries or international organizations to impose\nrestrictions on certain activities or relations with specific regions,\nentities, or individuals. They are typically employed to address threats to\nnational security or international peace, human rights abuses, and prohibit\nillicit activity. Sanctions can take various forms, such as financial\nrestrictions, trade embargoes, and travel bans.\n\nSome of the most prominent governing and sanctioning bodies include:\n\n  *  **United Nations** (UN): The sanctions apply to all UN nation-states, encompassing a wide range of restrictions and measures.\n  *  **Office of Foreign Assets Control** (OFAC): OFAC’s sanctions extend to all US citizens, individuals, and institutions conducting business within or connected to the United States and those engaged in transactions using US currency.\n  *  **European Union External Action Service** (EU EEAS): The EU EEAS sanctions affect all EU citizens and legal entities established within any of the member states.\n  *  **His Majesty’s Treasury** (HMT): This body oversees the United Kingdom sanctions list, which is applicable to individuals and legal entities working or conducting activities within the territory and under UK law. The Office for Financial Sanctions Implementation (OFSI) enforces these sanctions.\n\n## What is a Sanctions List?\n\nA sanctions list is a publicly available document issued by national or\ninternational authorities such as the ones mentioned above. It is updated\nregularly and contains relevant details of individuals, entities, territories,\nor countries subject to economic or legal restrictions.\n\nIndividuals or parties identified on these sanctions lists may be denied\naccess to financial systems, restricted from trade, or subject to other\nlimitations as part of punitive or preventive measures.\n\n## Types of Sanctions\n\nSanctions compliance is not merely a legal obligation. It plays a crucial role\nin maintaining a secure and trustworthy business environment and prevents the\nfacilitation of illegal activities such as terrorism financing, money\nlaundering, and other financial crimes.\n\nRestrictions can be applied on different levels:\n\n  *  **Explicit sanctions** name the subject directly, be it an individual, entity, or country.\n  *  **Narrative or implicit sanctions** don’t specifically name an individual or an entity. Instead, the narrative implicitly covers them due to their connections to a named sanctioned body or sector.\n\nFrom an economic perspective, sanctions can materialize into:\n\n  *  **Comprehensive sanctions:** imposing restrictions on all transactions with a specific country. Some examples include Iran, Cuba, and Sudan.\n  *  **Targeted sanctions:** limiting transactions with specific individuals, entities, or individuals listed on the Specially Designated Nationals and Blocked Persons (SDN) list maintained by OFAC. Russia is a prime example.\n  *  **Sectoral sanctions:** designed to hinder the future development of specific sectors within an economy by prohibiting a specific subset of financial transactions related to those sectors.\n\n## How does Sanctions Screening Work?\n\nSanctions screening is a critical component of an effective AML/CTF program.\nIt involves checking an organization’s existing and potential customers,\npartners, and transactions against global sanctions lists to identify\nfinancial risks and ensure compliance with international regulations. The\nprocess typically involves six key steps:\n\n### Step 1: Collect\n\nThe first step involves collecting necessary data that will be checked against\na sanctions list. This typically includes information about customers,\npotential business partners, and transactions. The data collected may include\nnames, addresses, dates of birth, nationality, and other pertinent details.\n\n### Step 2: Validate\n\nOnce the data is collected, it’s important to corroborate the information to\nensure its accuracy. This step often involves cross-checking the data against\nother sources, such as ID documents, company registers, or third-party data\nproviders. The goal here is to ensure the integrity of the data before it is\nused in the sanctions screening process.\n\n### Step 3: Screen\n\nAfter the data has been collected and corroborated, it’s time for the actual\nscreening. Using sanctions screening technology, the collected data is matched\nagainst global sanctions lists, which include individuals, organizations, or\ncountries that are embargoed or sanctioned by regulatory bodies.\n\n### Step 4: Investigate\n\nIf a potential match is identified during the sanctions screening process, it\ntriggers an investigation. The analysis aims to confirm or reject the\npotential matches upon enriching the client data and cross-checking the\ndetails. This step confirms whether the alerts were false positives or true\nmatches.\n\n### Step 5: Report\n\nReporting is the final and optional step in the sanctions screening process,\nactivated only if a true match is found. The institution must file the\nSuspicious Activity Report (SAR) to the relevant authority following the\nproper protocols, as failing to report a match can lead to severe penalties.\n\n### Step 6: Monitor\n\nAn essential, often overlooked step in the process is continuous monitoring.\nRegulations and sanctions lists are dynamic. Continuous monitoring can be done\nin real-time or periodically to ascertain compliance with ongoing due\ndiligence obligations.\n\n## When Should Sanctions Screening be Performed to Ensure Compliance?\n\nSanctions screening should be performed at several key stages to maintain\ncompliance. The initial screening has to take place when onboarding a new\nclient or partner. Before engaging in business transactions, financial\ninstitutions or businesses must verify the identities of their clients or\npartners against relevant sanctions lists. This step ensures that the entity\nor person is not barred from engaging in certain activities.\n\nHowever, performing sanctions screening and risk assessments only at the start\nof a business relationship is insufficient. It should happen regularly\nthroughout the customer relationship lifecycle. This is because sanctions\nstatuses can change over time. A customer who was not a sanctioned party\nduring onboarding or initial risk assessment might become one later.\n\n### Case Study 1: Rusal\n\nA notable example of how changes in sanctions lists can impact businesses is\nthe case of Rusal. This major aluminum producer was added to the US Department\nof Treasury’s Office of Foreign Assets Control (OFAC) list in April 2018 due\nto its association with Russian oligarch Oleg Deripaska.\n\nThe abrupt addition had a significant effect on global aluminum markets.\nCorporate entities around the world, involved in ongoing or future contracts\nwith Rusal found themselves needing to halt all trading activities\nimmediately. This step was necessary to comply with the new sanctions and\navoid potential fines, highlighting the importance of regular monitoring of\nsanctions lists.\n\nThe company was later delisted in early 2019 when its founder, entrepreneur\nOleg Deripaska, consented to forfeit control, lifting sanctions from the\naluminum manufacturing company. This case reaffirms that continuous monitoring\nis vital in ensuring adherence to the ever-changing sanctions landscape.\n\n## Identifying Politically Exposed Persons (PEPs) and Their Role in Sanctions\nScreening\n\nPolitically exposed persons (PEPs) are high-risk individuals who hold a\nprominent public role or have a close association with such individuals. Due\nto their position and influence, PEPs pose a higher risk of being involved in\nbribery, corruption, money laundering, and other financial crimes.\n\nIdentifying and conducting enhanced due diligence on a politically exposed\nperson is critical to an effective sanctions screening process. Organizations\nshould have robust PEP screening controls in place to mitigate associated\nrisks. These controls should include regularly checking customer data against\nPEPs lists and transactional screening to identify suspicious activities.\n\nYou can learn more here: What is a Politically Exposed Person (PEP)?\n\n### Case Study 2: Isabel dos Santos & PwC\n\nFor instance, in 2018, Isabel dos Santos, the daughter of Angola’s former\npresident and identified as a Politically Exposed Person (PEP), came under\nscrutiny when leaked documents suggested she exploited family connections and\npublic funds to build her $2 billion fortune. Her PEP status made her high\nrisk for banks and other institutions due to the increased chance of potential\ninvolvement in bribery or corruption.\n\nPwC, a renowned global accounting firm, found itself in hot water over its\ninvolvement with Isabel dos Santos and her financial misconduct. During the\ntime under criminal investigation, PwC had been auditing Sonangol’s books,\nAngola’s state-owned oil company.\n\nHowever, the firm’s dual role as an advisor on a significant restructure for\nSonangol has been criticized for presenting a potential conflict of interest.\nThe auditing and advisory work by PwC took place while dos Santos, who had\nalready been identified as a PEP, served as the chair of Sonangol.\n\nDos Santos was relieved from her role shortly after her father’s retirement,\nand the new management at Sonangol subsequently terminated PwC’s contract\nearly, replacing it with KMPG. This case highlights the considerable risks and\npotential complications firms can face when dealing with PEPs.\n\n## The Impact of Adverse Media on Sanctions Screening\n\nAdverse media, also known as negative news, refers to information from various\nmedia sources that indicate potential sanctions risks associated with certain\ncustomers or business partners. It is a crucial component of an effective\nsanctions screening program as it can provide early warning signs of possible\nsanctions.\n\nFor instance, news about a customer’s involvement in illegal activities,\nassociation with sanctioned parties, or changes in their political or business\nstatus can indicate probable threats.\n\nAdverse media screening should be performed regularly and at various stages of\nthe customer relationship lifecycle. Organizations should leverage advanced\ntechnologies such as artificial intelligence and natural language processing\nto automate and enhance this process.\n\n## Suspicious Activity Reports (SARs)\n\nSuspicious Activity Reports (SARs) are crucial in sanctions screening,\nproviding financial institutions with a means to report potential illicit\nactivities. When transactions raise suspicions of violations, institutions\nfile SARs with competent authorities. These reports facilitate investigations\nby law enforcement agencies, enabling them to take necessary actions.\n\n> According to Financial Crimes Enforcement Network (FinCEN), financial\n> institutions in the US are experiencing a significant surge in the\n> submission of Suspicious Activity Reports (SARs). In 2022, the total number\n> of SARs filed exceeded 3.6 million, marking a substantial 57% increase\n> compared to pre-pandemic levels in 2019.\n\nSARs contribute to the collective fight against money laundering, helping\nprotect the integrity of the financial system. Financial institutions avoid\nenforcement actions and assist regulatory organizations and law enforcement\nagencies in their mission by detecting and reporting suspicious activities.\n\n##  **Consequences of a Sanctions Breach**\n\nFailure to comply with AML regulations and sanctions screening requirements\ncan have severe consequences, including punitive fines, criminal proceedings,\ndamaged reputation, and sanctioning.\n\nFor instance, breaches of financial sanctions in the UK are criminal offenses\npunishable by up to 7 years in prison and monetary fines levied on individuals\nand businesses found in breach. Similarly, the US Treasury Department’s Office\nof Foreign Assets Control (OFAC) considers sanctions violations a grave threat\nto national security and foreign relations. Consequently, offenders face\nmonetary fines of up to several million dollars and prison time of up to 30\nyears.\n\n> Several firms were heavily fined for OFAC breaches, in some cases exceeding\n> $1 billion. These include ZTE, Standard Chartered, BNP Paribas, Crédit\n> Agricole, Société Générale, and UniCredit.\n\nAll these consequences can seriously damage an institution’s reputation,\ncredibility, and performance. Becoming a sanctioned entity can be even more\ndamaging, as it significantly hinders, if not halts, an institution’s ability\nto conduct global business and access international markets and capital. In\nsome instances, these consequences led to a sanctioned institution’s complete\ninability to continue operations and, ultimately, its demise.\n\nIn summary, sanctions breaches constitute serious offenses and thus have a\nsevere impact. Therefore, institutions must efficiently screen customers\nagainst relevant sanctions lists. However, as sanction lists are constantly\nupdated, it is crucial to ensure that sanctions screening processes keep up\nwith changes while avoiding inefficiencies and reducing false positives.\n\n##  **What are the Challenges Facing Sanctions Screening?**\n\nSanction Screening has never been as challenging as it is today due to several\nfactors, including:\n\n  * Sanction lists are evolving rapidly in nature (e.g., narrative sanctions) and breadth (e.g., US technology export controls).\n  * Increase in the complexity of restrictive and punitive sanction measures and screening regulations.\n  * Sanction Screening has to account for association risk, which may not be immediately apparent. For instance, the Patriot Act forbids US corporations from supplying ‘financial assistance’ to organizations accused of terrorism.\n  * Multiple sanctioning bodies have different standards and agendas that do not align, leading to inconsistent economic sanctions.\n\n> According to the data company Refinitiv, as of early 2020, there were more\n> than 34,000 explicit sanctions across more than 280 sanction programs, with\n> an increase of 62% since September 2017.\n\n##  **The Importance of Choosing the Right AML/KYC Customer and Sanctions\nScreening Partner**\n\nDespite the inherent challenges of Customer Screening, the right AML/KYC\npartner can help you implement a robust and cost-effective solution, as\noutlined below.\n\n###  **Single Customer View**\n\nSanctions Screening is only as effective as the input data used to screen the\nentity or individual at hand. Therefore, it is recommended to leverage a\nsolution that will help you streamline data collection processes and provide\nyou with a single customer view that is aggregated, consistent, and holistic.\n\n###  **Comprehensive Data Coverage**\n\nScreening activities should build on thoroughly studied and regularly revised\nglobal risk information that includes the current PEP and sanctions lists,\nunfavorable media, and compliance reports from around the world.\n\n###  **Smart Screening**\n\nNumerous vendors market fuzzy name matching as a silver bullet for state-of-\nthe-art sanctions screening. However, fuzzy name matching should not be solely\nrelied upon. It does indeed account for misspellings and minor variations.\n\nHowever, it does not deal well with **_phonetic similarity,_**\n**_transliterations_** _,_ ** _linguistic_** **_variations_** _,_ ** _non-\nLatin scripts, patronymics, honorifics, titles, or out-of-order names_ ,** to\nenumerate a few of the aspects of a reliable screening engine needs to take\ninto account. ComplyCube offers a comprehensive sanction screening solution.\n\n###  **Risk-based Approach**\n\nRisk-based approach (RBA) is a comprehensive sanctions screening solution\nshould manage several sanctions lists and allow custom thresholds and\ninclusion/exclusion rules to enable AML officers to adapt the screening\ncapability to the organization’s risk perception and policies.\n\nYou can learn more about the topic here: What is a Risk-Based Approach (RBA)?\n\n###  **Case Management**\n\nAML case management, combined with monitoring and alerts, enables analysts to\ninvestigate suspicious activity and quickly mitigate financial crime risk\neffectively. A robust Case Management solution should also provide a fully\nintegrated experience with rich contextualized data, such as a detailed match\nbreakdown, and thus help investigators organize, prioritize, manage\ninvestigations, and easily discount false positives – all while creating a\npermanent audit trail for regulatory review.\n\n###  **Ongoing Due Diligence**\n\nDepending on the customer and your risk mitigation strategy, you may need to\ninclude sanctions screening monitoring and alerts. Many AML/KYC vendors can\ncheck customers in bulk via running batches. However, that is a cumbersome and\nreactive process unsuitable for the new digital age. On the other hand, mature\nKYC providers will offer ongoing monitoring to support the shift from the\ntraditional tick-the-box approach to real-time, ongoing, and proactive\ncustomer due diligence.\n\n## Why is Sanctions Screening Important for Financial Institutions?\n\nIn the ever-evolving world of finance, sanctions screening has emerged as a\nnon-negotiable requirement. At its core, it represents an integral part of the\nfinancial sanctions implementation mechanism used globally. This process is\ncritical to ensure that entities like banks and other financial institutions\ndo not engage in business transactions with individuals, organizations, or\ncountries that are on global sanctions lists.\n\nFinancial institutions worldwide implemented robust sanctions screening\nsoftware to aid their compliance efforts. The importance of sanctions\nscreening within the financial industry cannot be overstated. It’s a crucial\nmeasure to mitigate the risk of engaging with sanctioned entities and to\nprevent money laundering.\n\nAs OFAC’s enforcement penalties hit new records year after year, the cost of\nnon-compliance has never been higher. As such, financial services companies\nshould continually refine their sanctions screening processes and stay ahead\nof evolving global sanctions landscapes to effectively navigate this complex\nregulatory environment.\n\n## Conclusion\n\nSanctions screening serves as an indispensable component in maintaining a\ncompliant and secure financial environment. By vigilantly cross-checking\ncustomer data against sanctions lists provided by regulatory bodies such as\nthe United Nations and the European Union, businesses can prevent transactions\nwith sanctioned parties. This proactive stance strengthens Anti-money\nLaundering (AML) efforts and contributes to the broader global initiative to\nprevent financial crime.\n\nThe world of sanctions and Anti-money Laundering compliance is continually\nevolving, and maintaining an up-to-date sanctions list at the heart of your\nscreening processes is essential to navigating this complex landscape\neffectively. Choosing the right AML/KYC and sanctions screening partner, such\nas ComplyCube, can also provide significant benefits.\n\n **Explore our global PEP and Sanctions screening** **solution** **  to learn\nmore about our platform!**\n\nTable of contents\n\nAdd a header to begin generating the table of contents\n\n### More posts\n\n  * Guides\n\n### A Robust Guide to Proof of Address Checks (PoA)\n\n  * icon-tag Identity Verification\n\nProof of Address (POA) checks are a vital part of the Know Your Customer (KYC)\nprocess alongside Proof of Identity (PoI). They are typically used to\nauthenticate the stated residence of an individual adding an extra layer of\nassurance....\n\n  * Read more \n\n  * Product\n\n### ComplyCube Unveils no-ID AI Age Estimation Solution\n\n  * icon-tag Announcements\n\nTapping into advanced biometric technology, ComplyCube's age estimation tool\ncan swiftly show reliable age estimations in seconds using just one selfie.\nThe AI-powered solution is bias-tested and actively checks for liveness....\n\n  * Read more \n\n  * Guides\n\n### What is eKYC (electronic Know Your Customer)?\n\n  * icon-tag Know Your Customer\n\nThe increasing frequency of digital interactions calls for a reliable online\nidentity verification process. This requirement has given rise to eKYC, a\nprocess that's quickly becoming the gold standard for digital identity\nassurance....\n\n  * Read more \n\nSee all resources\n\n## Ready to get started?  \nCreate an account or get in touch.\n\n  * Easy to integrate\n  * Global coverage\n  * Complete solution\n\nStart now\n\nContact us\n\nFacebook Icon icon-facebook Linkedin Icon icon-linkedin Twitter Icon icon-\ntwitter Medium Icon icon-medium\n\nSolutions\n\n  * AML screening\n  * Identity assurance\n  * Due diligence\n\n  * AML screening\n  * Identity assurance\n  * Due diligence\n\nUse cases\n\n  * By process\n  * By industry\n  * By profession\n\n  * By process\n  * By industry\n  * By profession\n\nResources\n\n  * Blog\n  * Help center\n  * FAQs\n\n  * Blog\n  * Help center\n  * FAQs\n\nDevelopers\n\n  * Quick guides\n  * API reference\n  * Service status\n\n  * Quick guides\n  * API reference\n  * Service status\n\nCompany\n\n  * About\n  * Pricing\n  * Careers\n  * Contact\n  * Partners\n  * Startups\n\n  * About\n  * Pricing\n  * Careers\n  * Contact\n  * Partners\n  * Startups\n\nLegal\n\n  * Privacy policy\n  * Cookie policy\n  * Terms of service\n\n  * Privacy policy\n  * Cookie policy\n  * Terms of service\n\nCookie settings\n\n© 2023 ComplyCube | All rights reserved\n\nEnglish (UK)\n\nEnglish (UK)  Deutsch  Français  Español  Italiano  简体中文  العربية\n\n",
    "links": "[{\"link\": \"https://www.complycube.com/solutions/global-screening/sanctions-pep-screening/\", \"text\": \"Sanctions & PEP screening\"}, {\"link\": \"https://www.complycube.com/solutions/global-screening/adverse-media-checks/\", \"text\": \"Adverse media checks\"}, {\"link\": \"https://www.complycube.com/solutions/global-screening/watchlist-screening/\", \"text\": \"Watchlist screening\"}, {\"link\": \"https://www.complycube.com/solutions/global-screening/continuous-monitoring/\", \"text\": \"Continuous monitoring\"}, {\"link\": \"https://www.complycube.com/solutions/identity-assurance/document-verification/\", \"text\": \"Document verification\"}, {\"link\": \"https://www.complycube.com/solutions/identity-assurance/biometric-verification/\", \"text\": \"Biometric verification\"}, {\"link\": \"https://www.complycube.com/solutions/identity-assurance/address-verification/\", \"text\": \"Address verification\"}, {\"link\": \"https://www.complycube.com/solutions/identity-assurance/multi-bureau-checks/\", \"text\": \"Multi-bureau checks\"}, {\"link\": \"https://www.complycube.com/solutions/due-diligence-compliance/know-your-customer/\", \"text\": \"Know your customer\"}, {\"link\": \"https://www.complycube.com/solutions/due-diligence-compliance/customer-due-diligence/\", \"text\": \"Customer due diligence\"}, {\"link\": \"https://www.complycube.com/solutions/due-diligence-compliance/risk-scoring/\", \"text\": \"Risk scoring\"}, {\"link\": \"https://www.complycube.com/solutions/due-diligence-compliance/anti-money-laundering/\", \"text\": \"Anti-money laundering\"}, {\"link\": \"https://www.complycube.com/solutions/due-diligence-compliance/case-management/\", \"text\": \"Case management\"}, {\"link\": \"https://www.complycube.com/use-cases/process/customer-onboarding/\", \"text\": \"Customer onboarding\"}, {\"link\": \"https://www.complycube.com/use-cases/process/age-verification/\", \"text\": \"Age verification\"}, {\"link\": \"https://www.complycube.com/use-cases/process/fraud-prevention/\", \"text\": \"Fraud prevention\"}, {\"link\": \"https://www.complycube.com/use-cases/process/ongoing-due-diligence/\", \"text\": \"Ongoing due diligence\"}, {\"link\": \"https://www.complycube.com/use-cases/process/know-your-business/\", \"text\": \"Know your business\"}, {\"link\": \"https://www.complycube.com/use-cases/industry/financial-services/\", \"text\": \"Financial services\"}, {\"link\": \"https://www.complycube.com/use-cases/industry/telcoms/\", \"text\": \"Telcoms\"}, {\"link\": \"https://www.complycube.com/use-cases/industry/crypto/\", \"text\": \"Crypto\"}, {\"link\": \"https://www.complycube.com/use-cases/industry/payments/\", \"text\": \"Payments\"}, {\"link\": \"https://www.complycube.com/use-cases/industry/payments/\", \"text\": \"\"}, {\"link\": \"https://www.complycube.com/use-cases/industry/fintech/\", \"text\": \"FinTech\"}, {\"link\": \"https://www.complycube.com/use-cases/profession/money-laundering-officers/\", \"text\": \"MLROs\"}, {\"link\": \"https://www.complycube.com/use-cases/profession/compliance-managers/\", \"text\": \"Compliance managers\"}, {\"link\": \"https://www.complycube.com/use-cases/profession/customer-onboarding-specialists/\", \"text\": \"Onboarding specialists\"}, {\"link\": \"https://www.complycube.com/use-cases/profession/fraud-analysts/\", \"text\": \"Fraud analysts\"}, {\"link\": \"https://www.complycube.com/use-cases/profession/product-managers/\", \"text\": \"Product managers\"}, {\"link\": \"https://www.complycube.com/resources/blog/\", \"text\": \"Blog\"}, {\"link\": \"https://www.complycube.com/uploads/2022/03/icon-about.svg\", \"text\": \"\"}, {\"link\": \"https://www.complycube.com/company/about-us/\", \"text\": \"About us\"}, {\"link\": \"https://www.complycube.com/company/careers/\", \"text\": \"Careers\"}, {\"link\": \"https://www.complycube.com/company/press/\", \"text\": \"Press\"}, {\"link\": \"https://www.complycube.com/contact/\", \"text\": \"Contact us\"}, {\"link\": \"https://www.complycube.com/company/partner-program/\", \"text\": \"Partner program\"}]",
    "priceAndPlans": "We will keep fighting for all libraries - stand with us!\n\nInternet Archive logo A line drawing of the Internet Archive headquarters\nbuilding façade.\n\nDonate icon An illustration of a heart shape \"Donate to the archive\" Search\nicon An illustration of a magnifying glass.\n\nSearch icon An illustration of a magnifying glass.\n\nUpload icon An illustration of a horizontal line over an up pointing arrow.\nUpload\n\nUser icon An illustration of a person's head and chest. Sign up | Log in\n\nWeb icon An illustration of a computer application window Wayback Machine\nTexts icon An illustration of an open book. Books Video icon An illustration\nof two cells of a film strip. Video Audio icon An illustration of an audio\nspeaker. Audio Software icon An illustration of a 3.5\" floppy disk. Software\nImages icon An illustration of two photographs. Images Donate icon An\nillustration of a heart shape Donate Ellipses icon An illustration of text\nellipses. More\n\nHamburger icon An icon used to represent a menu that can be toggled by\ninteracting with this icon.\n\n### Internet Archive Audio\n\nLive Music Archive Librivox Free Audio\n\n#### Featured\n\n  * All Audio\n  * This Just In\n  * Grateful Dead\n  * Netlabels\n  * Old Time Radio\n  * 78 RPMs and Cylinder Recordings\n\n#### Top\n\n  * Audio Books & Poetry\n  * Computers, Technology and Science\n  * Music, Arts & Culture\n  * News & Public Affairs\n  * Spirituality & Religion\n  * Podcasts\n  * Radio News Archive\n\n### Images\n\nMetropolitan Museum Cleveland Museum of Art\n\n#### Featured\n\n  * All Images\n  * This Just In\n  * Flickr Commons\n  * Occupy Wall Street Flickr\n  * Cover Art\n  * USGS Maps\n\n#### Top\n\n  * NASA Images\n  * Solar System Collection\n  * Ames Research Center\n\n### Software\n\nInternet Arcade Console Living Room\n\n#### Featured\n\n  * All Software\n  * This Just In\n  * Old School Emulation\n  * MS-DOS Games\n  * Historical Software\n  * Classic PC Games\n  * Software Library\n\n#### Top\n\n  * Kodi Archive and Support File\n  * Vintage Software\n  * APK\n  * MS-DOS\n  * CD-ROM Software\n  * CD-ROM Software Library\n  * Software Sites\n  * Tucows Software Library\n  * Shareware CD-ROMs\n  * Software Capsules Compilation\n  * CD-ROM Images\n  * ZX Spectrum\n  * DOOM Level CD\n\n### Books\n\nBooks to Borrow Open Library\n\n#### Featured\n\n  * All Books\n  * All Texts\n  * This Just In\n  * Smithsonian Libraries\n  * FEDLINK (US)\n  * Genealogy\n  * Lincoln Collection\n\n#### Top\n\n  * American Libraries\n  * Canadian Libraries\n  * Universal Library\n  * Project Gutenberg\n  * Children's Library\n  * Biodiversity Heritage Library\n  * Books by Language\n  * Additional Collections\n\n### Video\n\nTV News Understanding 9/11\n\n#### Featured\n\n  * All Video\n  * This Just In\n  * Prelinger Archives\n  * Democracy Now!\n  * Occupy Wall Street\n  * TV NSA Clip Library\n\n#### Top\n\n  * Animation & Cartoons\n  * Arts & Music\n  * Computers & Technology\n  * Cultural & Academic Films\n  * Ephemeral Films\n  * Movies\n  * News & Public Affairs\n  * Spirituality & Religion\n  * Sports Videos\n  * Television\n  * Videogame Videos\n  * Vlogs\n  * Youth Media\n\nSearch the history of over 867 billion web pages on the Internet.\n\nSearch the Wayback Machine\n\nSearch icon An illustration of a magnifying glass.\n\n#### Mobile Apps\n\n  * Wayback Machine (iOS)\n  * Wayback Machine (Android)\n\n#### Browser Extensions\n\n  * Chrome\n  * Firefox\n  * Safari\n  * Edge\n\n#### Archive-It Subscription\n\n  * Explore the Collections\n  * Learn More\n  * Build Collections\n\n### Save Page Now\n\nCapture a web page as it appears now for use as a trusted citation in the\nfuture.\n\nPlease enter a valid web address\n\n  * About\n  * Blog\n  * Projects\n  * Help\n  * Donate\n  * Contact\n  * Jobs\n  * Volunteer\n  * People\n\n  * Sign up for free\n  * Log in\n\nSearch metadata  Search text contents  Search TV news captions  Search radio\ntranscripts  Search archived web sites  Advanced Search\n\n  * About\n  * Blog\n  * Projects\n  * Help\n  * Donate Donate icon An illustration of a heart shape\n  * Contact\n  * Jobs\n  * Volunteer\n  * People\n\nDONATE\n\nLatest Show All\n\n## Hrm.\n\nThe Wayback Machine has not archived that URL.\n\nThis page is not available on the web\n\nbecause page does not exist\n\nClick here to search for all archived pages under https://www.complycube.com/.\n\nThe Wayback Machine requires your browser to support JavaScript, please email\ninfo@archive.org  \nif you have any questions about this.\n\nThe Wayback Machine is an initiative of the Internet Archive, a 501(c)(3) non-\nprofit, building a digital library of Internet sites and other cultural\nartifacts in digital form.  \nOther projects include Open Library & archive-it.org.\n\nYour use of the Wayback Machine is subject to the Internet Archive's Terms of\nUse.\n\n"
}