{
    "summary": "# Home\n\n__\n\nScopri TraDetector PRO Il percorso più completo in Italia per  \nla gestione del denaro\n\n###### ATTENZIONE  \nA partire da Settembre 2022, il Master in Finanza Personale è parte di\nTraDetector PRO (Piano MASTER).  \nScopri di più\n\nMaster in Finanza Personale\n\n## Master in Finanza Personale\n\n## Il percorso più completo in Italia per la gestione del denaro\n\nImpara a costruire, investire e proteggere il tuo Capitale e ottieni l’unica\nCertificazione del settore riconosciuta sia dal Ministero dell’Istruzione che\ndal Ministero dello Sviluppo Economico.\n\nmaurizio porcu\n\n26\\. Giugno, 2020.\n\nVerificata\n\nHo iniziato con i corsi e, piano piano, li sto completando tutti. Grazie alla\nchiarezza espositiva e alla disponibilità di Gianluca, è un costante confronto\ndi crescita personale e professionale-  \nSeguo due dei portafogli e le soddisfazioni non mancano.  \nSenso pratico e scelte ponderate. Credo si possa riassumere in queste poche\nparole, lo spirito di Tradetector\n\nAndrea Del Zompo\n\n17\\. Giugno, 2020.\n\nVerificata\n\nSeguo questi ragazzi da qualche mese, sono abbonato e seguo il loro percorso\nAcademy. Sono molto soddisfatto e posso affermare la serietà, la bravura e la\ncompetenza di Gianluca Sidoti.  \nConsigliatissimo!!\n\nAntonio Greco\n\n14\\. Giugno, 2020.\n\nVerificata\n\nHo completato 3 corsi con Gianluca Sidoti partendo da zero conoscenze in\nmateria. Devo dire che le spiegazioni sono molto ben strutturate e facili da\ncapire, percui mi sento di consigliare vivamente i suoi corsi per iniziare a\ncapire gli argomenti trattati. Complimenti per la semplicità e la chiarezza di\nesposizione\n\nfrancesco\n\n13\\. Giugno, 2020.\n\nVerificata\n\nGianluca è molto bravo ad esporre. Rende cose complesse da capire facili da\ncomprendere. Molto bravo\n\nMario Arcidiacono\n\n13\\. Giugno, 2020.\n\nVerificata\n\nContenuti ben strutturati e ottimi per iniziare ad operare in un settore molto\nprofittevole ed importante nella vita di ogni lavoratore, professionista,\nmeglio ancora investitore.  \nQuesta originale e importante missione di “iniziazione della futura categoria\ndi “investitori”” viene ben declinata dalla passione e dedizione di tutto il\nTeam e del suo Founder Ginaluca Sidoti.  \nCon sincerità e stima.  \nMario Arcidiacono\n\nFazzi Federico\n\n13\\. Giugno, 2020.\n\nVerificata\n\nFormazione semplice, chiara, approfondita e professionale, per crescere in\nconsapevolezza sui temi della finanza e degli investimenti.\n\nAndrea\n\n13\\. Giugno, 2020.\n\nVerificata\n\nI corsi di Tradetector sono validissimi come qualità prezzo!  \nnon dimentichiamo il canale telegram, Facebook e il loro sito tutto\ncompletamente gratuito.  \nattualmente la borsa e di nuovo in calo, per via del COVID 19 – quindi\novviamente chi è entrato al mercato prima dei ribassi come il sottoscritto e\nin perdita! e non si può ovviamente dare la colpa a Gianluca e al suo staff.  \nBisogna solo pazientare le soddisfazioni arriveranno.\n\nAndy Peter Paul\n\n13\\. Giugno, 2020.\n\nVerificata\n\nMi sono trovato molto bene con GIanluca Sidoti… ragazzo in gambissima con il\nquale il confronto è sempre un aumentare in conoscenze tecniche e fondamentali\nper chi opera nei mercati… grazie Gianluca, spero in una cospicua\ncollaborazione insieme… in giro per il mondo!\n\nGiuseppe cinnirella\n\n13\\. Giugno, 2020.\n\nVerificata\n\nHo comprato 3 corsi da TraDetector uno più efficace dell’altro, sono spiegati\nmolto chiaramente e sono contenuti di altissimo valore.  \nPer chi si avvicina al mondo del trading sono indispensabili, ovviamente poi\nbisogna continuare a studiare ed approfondire comunque li consiglio a tutti\n\n__\n\n## Oltre 170 ore\n\nDi contenuti video, audio, manuali, dispense, eserciziari e tutorial a tua\ndisposizione.\n\n__\n\n## Accesso a vita\n\nNessun abbonamento. Avrai accesso ai contenuti sempre aggiornati da qualsiasi\ndispositivo.\n\n__\n\n## Certificazione\n\nL’unico percorso di formazione finanziaria in Italia che rilascia un attestato\nal superamento dell’Esame finale.\n\n__\n\n## Supporto h24\n\nAvrai il numero privato di Gianluca Sidoti e dei Manager di TraDetector per\nchiarire ogni tuo dubbio.\n\n## IL MASTER IN FINANZA PERSONALE È  \nIL PERCORSO  PIÙ CONCRETO IN ITALIA PER OTTIMIZZARE  \nI TUOI RISPARMI\n\nSvilupperai competenze analitiche per gestire al meglio il tuo patrimonio:\ndalle tecniche di Risparmio alla Pianificazione Patrimoniale,\ndall’Investimento al Trading, dalla metodologia Goal-Based Investing al Wealth\nManagement, dalla creazione di Rendite Passive all’ottimizzazione del Piano\nPrevidenziale e Assicurativo.\n\nScarica la lista dei corsi inclusi\n\n## SEI APPENA ENTRATO NEL MONDO DEL LAVORO\n\nSe sei uno studente, un neolaureato, un neoassunto o un giovane imprenditore\nimparerai come:\n\nCrearti delle seconde entrate economiche\n\nProteggere il tuo futuro\n\nSfruttare i Mercati Finanziari\n\nInvestire con profitto in qualunque situazione macroeconomica\n\n## SEI UN DIPENDENTE, UN PROFESSIONISTA O UN IMPRENDITORE\n\nSe sei un lavoratore dipendente, un libero professionista o un imprenditore,\nimparerai come proteggere il tuo Patrimonio e la tua Famiglia dagli\nimprevisti. Scoprirai come:\n\nCrearti un Piano di Investimento a basso rischio\n\nPianificare il Piano Pensione\n\n## SEI UN PROFESSIONISTA DELLA FINANZA\n\nSe sei un Consulente o un Educatore Finanziario o lavori nel settore\naccrescendo e migliorando le tue competenze utilizzando i più innovativi\nstrumenti e modelli finanziari per la tua attività.\n\nAggiornamento sulle tendenze del mercato\n\nModelli finanziari sempre nuovi\n\n## SEI UN PENSIONATO O STAI PER ANDARE IN PENSIONE\n\nAndare in pensione vuol dire iniziare finalmente a “vivere di rendita”\nriscattando i contributi versati durante gli anni lavorativi ma al giorno\nd’oggi la cifra che ti spetta potrebbe non bastarti.\n\nQuesto Master ti spiega come:\n\nCrearti un’entrata extra a basso rischio\n\nUtilizzare il potere dell'interesse composto (e non solo!)\n\n### I CONTENUTI DEL PERCORSO\n\nIntroduzione\n\nTrading e Investimenti (Parte1)\n\nTrading e Investimenti (Parte2)\n\nBusiness 2.0 e Rendite Passive (Parte1)\n\nBusiness 2.0 e Rendite Passive (Parte2)\n\nBonus e risorse aggiuntive\n\nIntroduzione\n\n**Introduzione all’Economia e alla Finanza.**\n\nLa prima parte del percorso contiene un’introduzione completa al vasto mondo\ndell’economia, della finanza, della gestione e della pianificazione\npatrimoniale.\n\nTrading e Investimenti (Parte1)\n\n**Aspetti del Trading e della Speculazione.**\n\nUn’intera sezione dedicata a tutti gli strumenti di investimento a\ndisposizione del risparmiatore italiano come azioni, materie prime, etf,\nopzioni derivati e molto altro.\n\nTrading e Investimenti (Parte2)\n\n**Aspetti del Trading e della Speculazione.**\n\nUn’intera sezione dedicata a tutti gli strumenti di investimento a\ndisposizione del risparmiatore italiano come azioni, materie prime, etf,\nopzioni derivati e molto altro.\n\nBusiness 2.0 e Rendite Passive (Parte1)\n\n**Come Crearsi delle Rendite Automatiche.**\n\nPoter disporre di una seconda entrata mensile – dal Network Marketing\nall’Immobiliare, dal Crowdfunding alle aziende automatiche – essendo\nessenziale al giorno d’oggi non farsi cogliere impreparati dagli imprevisti\ndella vita.\n\nBusiness 2.0 e Rendite Passive (Parte2)\n\n**Come Crearsi delle Rendite Automatiche.**\n\nPoter disporre di una seconda entrata mensile – dal Network Marketing\nall’Immobiliare, dal Crowdfunding alle aziende automatiche – essendo\nessenziale al giorno d’oggi non farsi cogliere impreparati dagli imprevisti\ndella vita.\n\nBonus e risorse aggiuntive\n\n**Bonus e risorse aggiuntive.**\n\nOltre 30 strategie di Trading e di Investimento da replicare immediatamente\nsul tuo Conto, i nostri Portafogli modello divisi per obiettivi d’investimento\ne tante risorse per semplificare la tua vita finanziaria, oltre al Modulo di\nsupporto al superamento dell’esame OCF.\n\nScarica la lista dei corsi inclusi\n\n### A chi non è rivolto questo percorso\n\n  * __ Per chi sta cercando un modo per fare soldi facili e veloci con trucchetti e magie\n\n  * __ Per chi pensa che il trading e l’investimento sia un’alternativa al lavorare per iniziare a fare i primi soldi\n\n  * __ Per chi NON ha soldi. Dovete andare a lavorare. Non so chi vi ha messo in testa che si può investire sui mercati finanziari anche senza soldi (vostri o di qualcun altro). Non è possibile\n\n  * __ Per chi cerca rendimenti sicuri, lineari e garantiti. Mi dispiace ma il mondo degli investimenti non ha mai funzionato e non funzionerà mai così. Finché continuerai a pensarla così ti sconsiglio di comprare il corso, investire non fa per te\n\n### A chi è rivolto questo percorso\n\n  * __ A persone con un capitale a disposizione. Se hai un capitale a disposizione e vuoi capire come gestirlo al meglio\n\n  * __ A persone con un risparmio mensile. Se hai una buona capacità di risparmio mensile e vuoi capire cosa farne.\n\n  * __ A chi ha capito che non esistono rendimenti sicuri e garantiti. A lungo termine il mercato cresce sempre ma in modo non lineare. Conoscere i corretti strumenti finanziari per ogni condizione economica è essenziale.\n\n  * __ Ai giovani che vogliono costruirsi un buon capitale per investire.  Se hai deciso di iniziare ad investire per il tuo futuro e quello della tua famiglia\n\n  * __ A chi da degli obiettivi finanziari da raggiungere. 1.000.000€ per vivere di rendita, 100.000€ per gli studi all'estero di tuo figlio, 100.000€ per avviare la tua Startup, acquistare la macchina, una casa ecc.\n\n  * __ A chi vuole capire come gestire i propri soldi in sicurezza. Sapere come assicurarsi per mettere al sicuro la propria famiglia in caso di brutti imprevisti, quanti soldi lasciare liquidi per le emergenze e quanti, come, dove e quando investirne\n\n### Entra nel campo dell'Educazione Patrimoniale.  \nLavora con noi!\n\n#### Per aiutare gli italiani a migliorare il loro rapporto col denaro, il\nrisparmio e gli investimenti, stiamo costruendo il più grande Network di\nEducatori Finanziari e Patrimoniali.  \nSiamo alla costante ricerca di professionisti da formare e con cui\ncollaborare.  \n**E i tuoi primi clienti te li forniremo noi!**\n\n### Il Master in Finanza Personale  \nè disponibile su qualsiasi dispositivo\n\n#### Una volta iscritto avrai accesso immediato a tutti i Corsi del Master e\npotrai consultarli h24, 7 giorni su 7, da qualsiasi dispositivo: pc, tablet e\nsmartphone.\n\n#### Una volta iscritto avrai accesso immediato a tutti i Corsi del Master e\npotrai consultarli h24, 7 giorni su 7, da qualsiasi dispositivo: pc, tablet e\nsmartphone.\n\n### Non sono un formatore, sono uno che ha studiato tanto ed ha realizzato\ntanto\n\n__\n\nGianluca Sidoti, classe 1991, è un imprenditore, investitore, trader e\nConsulente Finanziario Indipendente. Laureato in Economia e Commercio a Roma,\nin International Business a Londra, in International Finance a Boston e con un\nMaster in Analisi Tecnica dei Mercati Finanziari a Milano, nel 2020 ha\nottenuto la certificazione internazionale Practitioner dalla Society of NLP™.\nE’ il fondatore di TraDetector e Master Trainer della relativa Academy, prima\ne unica scuola di specializzazione certificata in Italia su Trading e\nInvestimenti Finanziari. E’ autore di OverPerform, il libro italiano più letto\nsu Warren Buffett e il Value Investing e con oltre 20.000 studenti attivi è\nconsiderato l’autore italiano di maggior successo su Udemy. Vive e lavora tra\nMilano, Londra, Dubai e la sua amata Riviera Adriatica.\n\n__\n\n## CERTIFICAZIONE RICONOSCIUTA\n\nAl termine del Percorso potrai richiedere l’ **Attestato di Certificazione**\nin conformità alle direttive **ISO 9001**.\n\nPer il rilascio del Certificato è necessario il superamento di un esame\nscritto/orale che si svolge ogni 6 mesi a Milano e Roma (o, se necessario, in\nversione “a distanza” tramite software proprietario).\n\n### Il Master in Finanza Personale è ora parte di TraDetector PRO\n\n__\n\n## PERSONAL\n\nIdeale per singoli investitori, risparmiatori e nuclei familiari\n\n  * __ **Oltre 170 ore di formazione  \nOltre 35 Percorsi  \nOltre 600 Video Lezioni**  \nDispense e Manuali scaricabili\n\n  * __ Assistenza e Supporto Prioritari  \nAggiornamenti Inclusi a vita\n\n  * __ 1 Account\n\n  * __ Accesso all'Esame Finale\n\n  * __ Supporto al superamento dell'Esame OCF per diventare Consulente Finanziario Indipendente\n\ndiventa pro\n\n__\n\n## ENTERPRISE\n\nIdeale per imprese (come formazione professionale)\n\n  * __ Oltre 170 ore di formazione  \nOltre 35 Percorsi  \nOltre 600 Video Lezioni  \nDispense e Manuali scaricabili\n\n  * __ Assistenza e Supporto Prioritari  \nAggiornamenti Inclusi a vita\n\n  * __ 5 Account\n\n  * __ 5 Accessi all'Esame Finale\n\n  * __ Supporto al superamento dell'Esame OCF per diventare Consulente Finanziario Indipendente\n\ndiventa pro\n\n__\n\n## JUNIOR*\n\nSe hai meno di 30 anni hai il diritto* di accedere alla Borsa di Studio “\n**Hungry4Finance** ”\n\n  * __ Oltre 170 ore di formazione  \nOltre 35 Percorsi  \nOltre 600 Video Lezioni  \nDispense e Manuali scaricabili\n\n  * __ Assistenza e Supporto Prioritari  \nAggiornamenti Inclusi a vita\n\n  * __ 1 Account\n\n  * __ Accesso all'Esame Finale\n\n  * __ Supporto al superamento dell'Esame OCF per diventare Consulente Finanziario Indipendente\n\ndiventa pro\n\n#### Il Master in Finanza Personale è deducibile al 100% come Corso di\nFormazione Professionale, come previsto dalla Legge 81 del 22/05/2017\n\n#### *la Borsa di Studio “Hungry4Finance” è un’iniziativa di TraDetector,\nvalida fino ad esaurimento posti e soggetta a condizioni. Per entrare in\ngraduatoria, invia una mail a info@tradetector.com allegando un tuo documento\nd’identità e una lettera motivazionale (parlaci di te e del perché pensi che\nquesto percorso faccia al caso tuo).\n\n### Perchè scegliere il Master in Finanza Personale\n\n__\n\n## Accreditamento\n\nIl Master in Finanza Personale di TraDetector è l’unico percorso digitale in\nItalia accreditato dal Ministero dell’Istruzione (deducibilità per aziende e\nspendibilità curriculare per privati)\n\n__\n\n## Contenuti\n\nIl Master in Finanza Personale di TraDetector è il percorso più completo al\nmondo in Finanza Personale. Nelle oltre 150 ore di formazione trovi tutto\nquello che ti serve per creare, gestire e proteggere il tuo Patrimonio\n\n__\n\n## Supporto\n\nIl Master in Finanza Personale di TraDetector offre supporto e l’assistenza\ndiretta con Gianluca Sidoti per chiarire eventuali dubbi, fissare Call\nd’approfondimento e proporre idee di intervento\n\n### Un solo motivo per acquistare il percorso\n\n#### Ecco cosa posso dirti\n\n“Gianluca, dammi un solo motivo per iscrivermi al Master in Finanza\nPersonale!”  \nQuesta frase significa tanto, soprattutto nell’epoca in cui viviamo.  \nSiamo talmente sopraffatti dalle offerte, dai contenuti e dalle infinite\npossibilità che non sappiamo più cosa fare o cosa scegliere.\n\n **Come possiamo decidere cosa fare della nostra vita se non riusciamo a\nscegliere quale film o serie tv guardare su Netflix, Prime, NowTv o altri?**  \nDico davvero, non è mai esistita un’epoca come questa dove persone, prodotti e\ncontenuti lottano per la nostra attenzione.  \nSiamo letteralmente “bombardati”!\n\n **La sfida dell’individuo moderno è quella di riuscire a resistere a tutto\nquesto e far sì che l’infinita opportunità non diventi carnefice della propria\nlibertà.**  \nQuesta è l’epoca dove il risparmiatore deve passare a un livello di attenzione\ne consapevolezza maggiore verso le proprie scelte d’investimento.  \nQualche anno fa ho creato TraDetector per offrire una maggiore concretezza nel\npanorama dell’alfabetizzazione italiana. Ho creato una realtà di riferimento\nper traders e investitori, ma sentivo che mancava qualcosa. Mancava un\nprodotto adatto a tutti i risparmiatori. Tu, io, i tuoi genitori, i tuoi\nfigli, tua moglie, tuo marito… siamo tutti risparmiatori.  \nTutti abbiamo del denaro da parte. Tutti lavoriamo per portarci a casa uno\nstipendio per vivere. Ma per gestire il nostro risparmio abbiamo bisogno di\nuna guida efficace. Un sistema concreto che ci mostri la strada corretta.  \nE allora mi sono chiesto: “quanto sarebbe bello se qualcuno creasse una\npiattaforma, un’ecosistema, che spingesse il prossimo a dedicare quanto più\ntempo possibile al miglioramento del suo benessere finanziario?\n\n **Così abbiamo creato una piattaforma che potesse essere il campo base\ndell’Everest professionale di qualsiasi risparmiatore.**  \nUn luogo in cui potersi formare a 360°, parlare con esperti del settore e\nottenere una contaminazione positiva lontano da inutili distrazioni.  \nUna piattaforma indipendente, costruita sulle esigenze del risparmiatore\nmedio, ma in grado di renderti autonomo – e consapevole – delle scelte di\ninvestimento migliori per te e la tua famiglia.  \nÈ così che è nato il Master in Finanza Personale, e in questa storia credo che\ntu possa trovare un’ottima risposta alla tua domanda.”  \nUn abbraccio,  \n **Gianluca**\n\n### Le vostre domande frequenti\n\n#### Non trovi risposta alla tua domanda o hai bisogno di aiuto ?  \n**Scrivi nella live chat!**\n\n____ Cosa vuol dire “Corso Accreditato”?\n\nIl Master in Finanza Personale è l’unico percorso in Italia accreditato presso\nl’Ente Italiano di Accreditamento Accredia (www.accredia.it). Questo vuol dire\nche, se sei un’azienda, il percorso vale come Corso di Formazione per i tuoi\ncollaboratori, mentre se sei un privato, puoi utilizzarlo a fini di curriculum\no come personale bagaglio di competenze in ambito finanziario.\n\n____ Da quali e quanti dispositivi posso studiare il Materiale?\n\nA seconda del Piano scelto (il Personal offre 1 Account, l’Enterprise fino a\n5), potrai studiare il materiale online su Pc, tablet e smartphone.  \nPer controllare gli accessi utilizziamo dei software in grado di fornirci dati\ne statistiche di ogni tipo per ogni utente. Se notiamo attività sospetta (più\ndi 1 persona collegata contemporaneamente nel caso del Piano Personal, diversi\nindirizzi geografici di accesso ecc.) saremo costretti ad agire per via\nlegale.\n\n____ Su che genere di prodotti mi consiglierete di investire?\n\nSu tutti. Si, hai capito bene, questo percorso è completo proprio perché\nparliamo di qualsiasi Asset Finanziario, Assicurativo e Immobiliare: Polizze,\nAzioni, Valute, ETF, Futures, Derivati (Opzioni, Certificati, Covered\nWarrant…), Criptovalute, Immobili ecc.\n\n____ Non ho grande dimestichezza con banche ed home banking, ho paura di non\nriuscire ad applicare praticamente i consigli di investimento. Come posso\nfare?\n\nNon devi preoccuparti di questo. Il corso contiene anche guide pratiche e\ntutorial per guidarti passo dopo passo in ciò che devi fare.  \nSe comunque dovessi riscontrare difficoltà, Gianluca Sidoti e i Manager di\nTraDetector saranno sempre a tua disposizione per guidarti e chiarire ogni tuo\ndubbio.  \nSe neanche questo dovesse bastare e vuoi operare con il tuo consulente allo\nsportello di banca, ti daremo indicazioni precise di ciò che devi chiedere e\ndi come comportarti quando cercherà di farti cambiare idea e proverà a\nvenderti altri prodotti spazzatura.\n\n____ Cosa avviene dopo il pagamento?\n\nNon appena effettuato il pagamento riceverai una mail di conferma\nall’indirizzo comunicato in fase di iscrizione. Entro 24 ore riceverai le\ncredenziali di accesso alla tua Area Riservata e una breve guida sull’utilizzo\ndella stessa.  \nAvrai accesso immediato a TUTTO il Materiale, quindi potrai consultare\nliberamente le sezioni del Corso (anche se ti consigliamo caldamente di\nseguire l’ordine delle lezioni!)\n\n____ Posso ricevere fattura?\n\nAssolutamente si. Entro 30 giorni dall’acquisto, invia una mail a\ninfo@tradetector.com con i dati aziendali per l’intestazione della fattura.\n\n____ Dove trovo qualche recensione verificata?\n\nTi basta cercare “TraDetector” o “Gianluca Sidoti” su Google. Non abbiamo\nnulla da nascondere e siamo ben lieti se fai qualche ricerca su di noi. In\naggiunta, ti consiglio di dare un’occhiata alle recensioni su Udemy (oltre\n8000 studenti si sono formati con noi: https://www.udemy.com/user/gianluca-\nsidoti/) e su TrustPilot\n(https://it.trustpilot.com/review/www.tradetector.com)\n\n____ Non ho tempo, il Master ha una scadenza?\n\nUna volta iscritto, avrai accesso a vita a tutti i contenuti, inclusi\neventuali aggiornamenti futuri. Inoltre, puoi partecipare all’esame finale\nquando vuoi, quante volte vuoi, finchè non lo superi.\n\n____ Come è strutturato il Master?\n\nIl Master in Finanza Personale prevede 3 Parti: una prima parte di\nPianificazione Patrimoniale e introduzione alla Finanza, all’Investimento e\nall’Economia, una seconda parte dedicata all’investimento, al trading e alla\nspeculazione finanziaria e una terza parte dedicata alla creazione di Rendita\nAutomatiche e Passive.  \nOgni Parte è suddivisa in Moduli, a seconda dell’argomento trattato. Ogni\nModulo è a sua volta diviso in Lezioni di massimo 1 ora ognuna, per un monte\nore totale di oltre 150 ore.  \nPotrai studiare direttamente online, oppure scaricare tutto il materiale:\nvideo, audio, PDF, eserciziari, fogli di calcolo ecc.\n\n____ Va bene anche se non conosco nulla di Finanza e Investimenti?\n\nSì, perché da un punto di vista di strategia di investimento completa (che è\nciò che otterrai col corso) non esiste niente del genere.  \nDi conseguenza, siete tutti a zero. E il corso serve proprio per accompagnarti\ndalla A alla Z.  \nCome sempre non userò termini complessi e farò del mio meglio affinché il\ncorso sia di semplice comprensione ed applicazione per chiunque.  \nNON è un corso pensato per esperti o addetti ai lavori. L’ho pensato e\nrealizzato pensando a risparmiatori ed investitori privati.\n\n____ Il corso parla solo di una strategia generale o mi verrà detto anche\nprecisamente su cosa dovrò investire?\n\nLa strategia è la parte più importante ed il principale fattore critico di\nsuccesso della tua vita finanziaria.  \nUna volta definita la strategia, per ogni Asset Finanziario che studieremo, ti\nindicherò esattamente quali prodotti finanziari acquistare con tanto di codice\nISIN (il codice univoco di riconoscimento di ogni strumento finanziario), in\nmodo che tu possa fare l’investimento giusto senza la possibilità di\nsbagliarti.\n\n____ Come si svolge l’esame?\n\nL’esame scritto, in presenza, si svolge 2 volte l’anno, indicativamente ogni 6\nmesi, in un Centro Congressi a Milano (ti verrà comunicato al momento\ndell’iscrizione).  \nLa partecipazione all’esame finale è valida per l’ottenimento del Certificato,\nma è facoltativa: puoi anche frequentare il Corso e decidere di non fare\nl’esame.  \nNB: l’esame prevede un contributo di iscrizione extra pari a 200€ a persona\nche comprende i costi di affitto dell’aula, il personale e il materiale di\nsupporto, e include il pernottamento in Hotel la sera prima dell’esame.\n\n____ Come posso pagare?\n\nPuoi pagare con carta di credito o Paypal direttamente dal sito. In\nalternativa, puoi richiedere il pagamento tramite bonifico; scrivici in chat o\na info@tradetector.com per richiedere i dati bancari.\n\n____ È possibile pagare a rate?\n\nAssolutamente si. Il pagamento a rate prevede però un supplemento di circa il\n10% rispetto al costo una tantum. Scrivici in chat o a info@tradetector.com\nper avere un preventivo.\n\n____ Esiste una garanzia soddisfatto o rimborsato?\n\nAnche in questo caso la risposta è un bel si! In Italia la legge prevede – PER\nQUALSIASI PRODOTTO O SERVIZIO – una garanzia di recesso di 14 giorni. E noi\nnon siamo da meno. Anzi, ti invito a diffidare da chi non ti offre questa\ngaranzia, perché non rispetta la legge! Quindi se per qualsiasi motivo non sei\nsoddisfatto o ci hai ripensato, ti basta scrivere a info@tradetector.com entro\n14 giorni dall’acquisto per richiedere il rimborso dell’intero importo.\n\n____ Come faccio a contattarvi?\n\nHai diversi modi per tenerti in contatto con noi: via Chat Facebook (in basso\na destra), via mail a info@tradetector.com, tramite il Numero Verde 800 034\n435 o prenotando una Call DA QUI.\n\n### Sei pronto a imparare i segreti della gestione del denaro?\n\n#### Ti aspetto all'interno del Master in Finanza Personale!\n\nScopri il percorso adatto a te\n\n#### AIEP - Associazione Italiana Educatori Patrimoniali\n\nFacebook-f __ Telegram __ Youtube __\n\n### Recapiti aziendali\n\n© 2020 Gold Click Web Agency\n\nQuesto sito utilizza i cookie per migliorare la tua esperienza.Cookie\nsettingsAccetta\n\nPrivacy & Cookies Policy\n\nChiudi\n\n#### Privacy Overview\n\nThis website uses cookies to improve your experience while you navigate\nthrough the website. Out of these cookies, the cookies that are categorized as\nnecessary are stored on your browser as they are essential for the working of\nbasic functionalities...\n\nNecessary\n\nNecessary\n\nSempre abilitato\n\nNecessary cookies are absolutely essential for the website to function\nproperly. This category only includes cookies that ensures basic\nfunctionalities and security features of the website. These cookies do not\nstore any personal information.\n\nNon-necessary\n\nNon-necessary\n\nAny cookies that may not be particularly necessary for the website to function\nand is used specifically to collect user personal data via analytics, ads,\nother embedded contents are termed as non-necessary cookies. It is mandatory\nto procure user consent prior to running these cookies on your website.\n\nACCETTA E SALVA\n\n",
    "links": "[]"
}