{
    "summary": "# Imparalafinanza – progetto di Educazione Finanziaria\n\n## imparalafinanza.it è un progetto di Educazione Finanziaria curato dal\nLaboratorio di Finanza Quantitativa Nicola Bruti Liberati del Dipartimento di\nMatematica del Politecnico di Milano\n\nMenu\n\n  * Impara la Finanza\n    * Mutui\n    * TAN e TAEG\n    * Tassi e Usura\n    * Tassi di Interesse e Capitalizzazione\n    * Obbligazioni\n    * Frontiera dei portafogli\n    * Quiz\n  * Iniziative\n    * Scuole Secondarie di Primo Grado\n    * Scuole Secondarie di Secondo Grado\n    * Caccia al Tesoro\n    * MOOC\n  * Redazione\n  * Contatti\n\n\n\nM\n\n# MOOC\n\n7/Nov/2023\n\nI Mooc “Finanza per tutti” e “Moneta e Pagamenti online” , in italiano, sono\nattivi sulla piattaforma www.pok.polimi.it.  I MOOC (Massive Open Online\nCourse) sono dei corsi online gratuiti pensati per una formazione a distanza\nche coinvolge un numero elevato di utenti.\n\nLa finanza è ormai parte integrante della vita quotidiana. L’apertura di un\nconto corrente, decidere come investire i propri risparmi, la necessità di\nchiedere un prestito o un finanziamento… Lo scopo del Mooc “ **Finanza per\ntutti** ” è quello di fornire tutti gli strumenti necessari per affrontare\nqueste (e altre) scelte, avendo ben chiari quali sono i possibili rischi e le\ninsidie che ci si può trovare a fronteggiare. Il corso è stato realizzato da\nPolitecnico di Milano in collaborazione con Altroconsumo.\n\nIn collaborazione con Banca d’Italia è stato poi sviluppato il Mooc “ **Moneta\ne Pagamenti online** “. L’obiettivo del corso è quello di presentare le\ncaratteristiche tecnologiche, i benefici, i costi e i rischi degli strumenti\ndi pagamento (moneta e elettronici), con particolare attenzione alle frodi.  \n\n\n\nLo scorrere del tempo e gli interessi: le leggi di capitalizzazione (Emilio\nBarucci)\n\nMercati finanziari, Azioni (Emilio Barucci)\n\nObbligazioni e rating (Emilio Barucci)\n\nDalla teoria alla pratica: gli errori più comuni (Emilio Barucci)\n\nRischio di tasso (Daniele Marazzina)\n\nPerché i fondi pensione sono utili (Pietro Cazzaniga)\n\n_Il progetto Edufin@Polimi è realizzato all’interno del progetto MUSA –\nMultilayered Urban Sustainability Action, finanziato dall’Unione Europea –\nNextGenerationE, PNRR Missione 4 Componente 2 Linea di Investimento 1.5:\nCreazione e rafforzamento degli “ecosistemi dell’innovazione”, costruzione di\n“leader territoriali di R &S”_\n\nFacebookXCondividi\n\n### Mappa delle scuole visitate\n\n### News\n\nN\n\nCriptovalute – Percorso Scuole Secondarie di Primo e Secondo Grado\n\nN\n\nMoneta, Pagamenti e Frodi – Percorso Scuole Secondarie di Primo e Secondo\nGrado\n\nN\n\nUn altro anno scolastico si è concluso…\n\nTutte le news\n\nLo scorrere del tempo e gli interessi: le leggi di capitalizzazione (Emilio\nBarucci)\n\nMercati finanziari, Azioni (Emilio Barucci)\n\nObbligazioni e rating (Emilio Barucci)\n\n© 2017-2023 www.imparalafinanza.it  -   Cookie-Policy  -  Privacy-Policy  \n---  \n  \nQuesto sito utilizza cookie tecnici e di profilazione, propri e di terze\nparti, per garantire la corretta navigazione, analizzare il traffico e\nmisurare l'efficacia delle attività di comunicazione.\n\nAccetta TuttiRifiuta tuttiGestione dei cookie\n\nCookie-Policy Privacy-Policy\n\nManage consent\n\nChiudi\n\n#### Panoramica sui Cookie\n\nQuesto sito Web utilizza i cookie per migliorarne l'esperienza di navigazione.\nI cookie classificati come necessari, sono essenziali alle funzioni di base\nsito e vengono sempre memorizzati nel tuo browser. I cookie di terze parti,\nche ci aiutano ad a...\n\nNecessary\n\nNecessary\n\nSempre abilitato\n\nNecessary cookies are absolutely essential for the website to function\nproperly. These cookies ensure basic functionalities and security features of\nthe website, anonymously. Cookie| Durata| Descrizione  \n---|---|---  \ncookielawinfo-checkbox-analytics| 1 year| Cookie tecnico impostato dal plugin\nGDPR Cookie Consent che viene utilizzato per registrare il consenso\ndell'utente per i cookie nella categoria \"Analitici\".  \ncookielawinfo-checkbox-necessary| 1 year| Cookie tecnico impostato dal plugin\nGDPR Cookie Consent che viene utilizzato per registrare il consenso\ndell'utente ai cookie.  \nCookieLawInfoConsent| 1 year| Cookie tecnico impostato dal plugin GDPR Cookie\nConsent per salvare le scelte si/no dell'utente per ciascuna categoria.  \nviewed_cookie_policy| 1 year| Cookie tecnico impostato dal plugin GDPR Cookie\nConsent che registra lo stato del pulsante predefinito della categoria\ncorrispondente.  \n  \nAnalytics\n\nAnalytics\n\nAnalytical cookies are used to understand how visitors interact with the\nwebsite. These cookies help provide information on metrics the number of\nvisitors, bounce rate, traffic source, etc. Cookie| Durata| Descrizione  \n---|---|---  \n_pk_id.5y0477nq1v.4e06| 1 year 27 days| Cookie analitico impostato da Matomo e\nutilizzato per memorizzare alcuni dettagli sull'utente come l'ID univoco del\nvisitatore  \n_pk_ses.5y0477nq1v.4e06| 30 minutes| Cookie analitico impostato da Matomo di\nbreve durata e utilizzato per memorizzare temporaneamente i dati della visita  \n  \nACCETTA E SALVA\n\nPowered by\n\n✓\n\nGrazie per la condivisione!\n\nAddToAny\n\nDi più…\n\n",
    "links": "[{\"link\": \"https://www.imparalafinanza.it/mooc/\", \"text\": \"MOOC\"}, {\"link\": \"https://www.imparalafinanza.it/#facebook\", \"text\": \"\"}, {\"link\": \"https://www.imparalafinanza.it/#x\", \"text\": \"\"}, {\"link\": \"https://www.imparalafinanza.it/map\", \"text\": \"\"}]"
}