{
    "summary": "Contenuto principale della pagina Menu di navigazione Modulo di ricerca su\nuniPi Modulo di ricerca su uniPi\n\n# www.unipi.it\n\nInserisci parola da ricercare Cerca Cerca\n\nIT EN ES PT\n\n  * Ateneo\n  * Studenti\n  * Ricerca\n  * Internazionale\n  * Territorio/Imprese\n  * Personale\n  * IT EN ES PT\n\nInserisci parola da ricercare Cerca Cerca\n\nYou are here:Home/Corsi di Laurea/Università di Pisa: corso di laurea in\nBANCA, FINANZA E MERCATI FINANZIARI\n\n  * Offerta didattica\n  * Iscrizione e segreterie\n  * Servizi e orientamento\n  * Internazionale\n  * Tirocini e Career Service\n  * Vivere l'università\n\n#  BANCA, FINANZA E MERCATI FINANZIARI\n\nCorso di laurea\n\n  * Descrizione\n  * Piano di studi\n  * Sbocchi professionali\n  * Iscrizioni\n\n## Piano di Studi\n\n  \n\n### Primo anno\n\n  * Economia aziendale I (12 cfu) \n\n    * Il Corso ha l'obiettivo di fornire le conoscenze fondamentali dell'Economia Aziendale e della Ragioneria. Oggetto del corso è l’azienda nei suoi elementi costitutivi, nelle sue condizioni di funzionamento, nei fenomeni che la interessano e nelle sue caratteristiche evolutive, con l’obiettivo di sviluppare nello studente un’adeguata capacità di analisi del sistema d'azienda grazie all’apprendimento dei principi e dei modelli concettuali economico-aziendali nonché dei metodi e dei sistemi contabili.   \n  \nAl termine del corso lo studente avrà acquisito le capacità di analizzare ed\ninterpretare le condizioni di equilibrio economico, finanziario e patrimoniale\ne sviluppato le abilità per gestire dal punto di vista concettuale e tecnico\nle rilevazioni in contabilità generale.  \n\nProgramma di esame\n\n  * Statistica (9 cfu) \n\n    * Il corso ha come oggetto i metodi di base per la descrizione e l’esplorazione statistica dei dati, le nozioni elementari di calcolo delle probabilità, e gli strumenti di base dell''inferenza statistica. L’obiettivo formativo principale del corso è illustrare i principi fondamentali della statistica descrittiva e della statistica inferenziale fornendo competenze di base e perseguendo due finalità. La prima finalità è quella di trasmettere l’importanza del contributo della statistica all’analisi quantitativa dei fenomeni economici e sociali. La seconda finalità è quella di mettere gli studenti in grado di svolgere autonomamente semplici analisi quantitative di tali fenomeni utilizzando i tipi di dati più comunemente disponibili. Le competenze attese riguardano la capacità di utilizzare i principali metodi della statistica descrittiva (rappresentazione grafica e tabellare, e calcolo di statistiche fondamentali quali medie, indici di variabilità, indici di associazione, regressione lineare semplice) e dell’inferenza classica (campionamento, distribuzione normale , calcolo di stime puntuale e per intervallo, verifica di ipotesi). Esse in dettaglio sono:   \n  \n1.spiegare, applicare ed interpretare le principali statistiche descrittive;  \n  \n2.leggere e analizzare rappresentazioni grafiche e tabelle di contingenza  \n  \n3.spiegare, applicare ed interpretare i principali metodi statistici\ninferenziali;  \n  \nGli obiettivi del corso saranno raggiunti attraverso lezioni frontali,\nesercitazioni in Aula ed esercitazioni con i tutor.  \n\nProgramma di esame\n\n  * Economia politica I (12 cfu) \n\n    * Il corso intende fornire agli studenti i principi e gli strumenti che la moderna teoria microeconomica mette a disposizione per rappresentare, interpretare, prevedere e possibilmente guidare i principali fenomeni microeconomici. I contenuti e le tecniche appresi nel corso permetteranno allo studente di affrontare in modo rigoroso e critico problemi rilevanti nelle società contemporanee quali il comportamento individuale di consumatori e imprese in contesti di mercato, l’efficienza produttiva, la formulazione delle strategie individuali e gli equilibri strategici, le risposte agli incentivi individuali e di gruppo, il disegno dei contratti, il ruolo dei diversi contesti istituzionali di mercato nella determinazione degli esiti aggregati, il benessere sociale, la regolamentazione dei mercati, l’efficienza del sistema di mercato nella distribuzione dei beni e dei fattori produttivi, i fallimenti del mercato e l’intervento pubblico in economia.  \nIl corso è composto di lezioni ed esercitazioni nelle quali sono presentati e\ndiscussi esempi specifici cui applicare quanto appreso durante le lezioni.  \n\nProgramma di esame\n\n  * Test Abilità Informatiche (3 cfu) \n\n    * Acquisizione di abilità informatiche certificate mediante il superamento di uno dei moduli da 3 CFU offerti dall'Università di Pisa nell'ambito del progetto SAI@UNIPI. In alternativa, vengono riconosciute per 3 CFU le seguenti certificazioni:  \nECDL Core Full  \nECDL Core Start  \nIC3 Standard  \nIC3 Plus  \nMOS Master  \nEipass  \nEipass Basic  \nEipass Progressive  \nA tal fine, è necessario presentare presso la Segreteria Studenti\nl'attestato/diploma originale della certificazione conseguita, ovvero una\nfotocopia dello stesso purchè accompagnato da dichiarazione di autenticità.  \n  \n\nProgramma di esame\n\n  * Matematica generale (12 cfu) \n\n    * il Corso si propone di fornire le conoscenze matematiche di base e le tecniche di calcolo più idonee ad affrontare in modo adeguato le discipline delle quattro aree disciplinari del Corso di Laurea.  \n  \nAlla fine del corso, lo studente dovrà aver acquisito una buona padronanza\ndegli strumenti matematici presentati, sia dal punto di vista teorico sia dal\npunto di vista pratico, competenza che gli sarà di ausilio nella comprensione\ned assimilazione dei successivi insegnamenti presenti nel corso di studio, con\nparticolare riferimento a quelli di area economica, aziendale e finanziaria.  \n  \nLe conoscenze e competenze acquisite permetteranno allo studente di risolvere\nin autonomia esercizi relativi agli argomenti del corso, di effettuare calcoli\ncon precisione ed accuratezza, di saper enunciare e dimostrare i teoremi\npresentati durante il corso, di applicare le conoscenze teoriche nello\nsvolgimento degli esercizi, di individuare e comprendere gli aspetti\nmatematici sottostanti i modelli economici.  \n\nProgramma di esame\n\n  * 9 cfu a scelta nel gruppo GR1: Rosa lingue straniere \n\n    * Un insegnamento a scelta tra: Lingua inglese Lingua francese Lingua spagnola Lingua tedesca \n    * Lingua Spagnola (9 cfu)\n\n      * Obiettivo del corso è l’acquisizione del lessico, della morfologia e delle strutture grammaticali di base della lingua spagnola nella sua variante peninsulare. Lo studente, alla fine del corso, avrà acquisito attraverso un metodo funzionale-comunicativo le 4 abilità (comprensione orale, comprensione scritta, espressione orale, espressione scritta) a livello B1  \n\nProgramma di esame\n\n    * Lingua Inglese (9 cfu)\n\n      * Obiettivo principale del corso è quello di fornire agli studenti gli strumenti comunicativi e il vocabolario specialistico di ambito economico e professionale. Il corso prevede il consolidamento della produzione scritta attraverso stesure di e-mail e lettere pertinenti all'ambito professionale, e permette di sviluppare la sicurezza e le competenze linguistiche necessarie per avere successo nel lavoro a livello internazionale. Il corso consiste in lezioni frontali ed esercitazioni durante le quali vengono esercitate le quattro abilità di base a livello comparabile al B2 del QCER. Nello specifico, attraverso la lettura di testi specialistici, il corso mira all’acquisizione del lessico e delle funzioni comunicative del linguaggio specialistico e al consolidamento delle strutture morfosintattiche della lingua inglese.  \n\nProgramma di esame\n\n    * Lingua Tedesca (9 cfu)\n\n      * Il corso intende fornire agli studenti una conoscenza della lingua tedesca a vari livelli (grammatica, sintassi, morfologia, costituzione testuale, linguaggio specifico dell’economia), anche in ottica contrastiva tedesco-italiana. Lo studio linguistico è corredato da esercitazioni per l’apprendimento strumentale delle quattro competenze fondamentali (comprendere, parlare, leggere, scrivere), con obiettivo finale il raggiungimento del livello B1(principianti) e B2 (progrediti) delle direttive europee. Propedeuticità: nessuna.  \n\nProgramma di esame\n\n    * Lingua Francese (9 cfu)\n\n      * Il corso intende consolidare le competenze scritta e orale, sia a livello di produzione che di comprensione della lingua francese a scopi specifici, vale a dire la lingua dell’economia e del mondo del lavoro, attraverso testi attuali di uso comune. Le esercitazioni permettono ai frequentanti di prepararsi per le varie certificazioni di lingua francese.  \n\nProgramma di esame\n\n### Secondo anno\n\n  * Matematica finanziaria (6 cfu) \n\n    * Il Corso intende fornire la conoscenza delle leggi che regolano lo scambio fra importi monetari, del meccanismo che regola e determina la struttura dei tassi di interesse, dei metodi e modelli di valutazione di titoli ed operazioni finanziarie. Al termine del corso lo studente saprà calcolare il prezzo di non arbitraggio di uno strumento finanziario, calcolare il tasso interno di rendimento di un'operazione finanziaria, costruire la struttura per scadenza dei tassi di mercato a pronti e a termine, valutare il rischio di tasso derivante da un'operazione finanziaria, costruire strategie di immunizzazione finanziaria, costruire strategie di investimento attraverso opzioni finanziarie.  \n\nProgramma di esame\n\n  * Economia aziendale II (9 cfu) \n\n    * Mediante questo corso gli studenti acquisiranno le conoscenze di base necessarie per la costruzione e l’interpretazione del bilancio di esercizio secondo il Codice Civile e per il controllo della gestione aziendale.   \n  \nPer rispondere a tale obiettivo, il corso in primo luogo esamina il bilancio\ndi esercizio redatto secondo la normativa civilistica, i relativi principi\ncontabili nazionali che integrano tale normativa ed i fondamenti dell'analisi\ndi bilancio. Successivamente il corso affronta lo studio dei tratti principali\ndei processi di programmazione e controllo e dei principali strumenti per il\ncontrollo della gestione aziendale.  \n\nProgramma di esame\n\n  * Economia politica II (9 cfu) \n\n    * L'obiettivo del corso consiste nel fornire una visione di insieme delle principali tematiche e problematiche macroeconomiche moderne. Vengono analizzati il funzionamento del mercato dei beni, dei mercati finanziari e del mercato del lavoro, e le loro interconnessioni per comprendere le determinanti dell’evoluzione della produzione, del livello dei prezzi, della disoccupazione, dei tassi d’interesse e dei tassi di cambio nel breve, medio e lungo periodo. Al termine del corso gli studenti saranno in grado di comprendere le principali determinanti di fenomeni macroeconomici, quali la crescita, le fluttuazioni cicliche, la disoccupazione e l'inflazione, nonché il ruolo della politica economica (con particolare riferimento alla politica monetaria e fiscale) in contesti di economie chiuse e aperte. Inoltre, saranno in grado di valutare le conseguenze delle diverse opzioni di politica economica a disposizione di governi e banche centrali e di comprendere e analizzare articoli di quotidiani, riviste o stampa specializzata relativi ad aspetti macroeconomici.  \n\nProgramma di esame\n\n  * Istituzioni di diritto privato (6 cfu) \n\n    * Il corso ha per oggetto lo studio sistematico degli istituti del diritto privato, effettuato con riferimento alle norme costituzionali, al codice civile e alle principali leggi ad esso complementari e con attenzione alle più significative ed aggiornate esperienze giurisprudenziali.   \nIl corso si propone di fornire agli studenti la comprensione e l'uso del\nlinguaggio giuridico, la capacità di consultare e di utilizzare testi\nnormativi, nonché la capacità di riconoscere l'esistenza di un problema\ngiuridico e di individuare gli strumenti per la sua soluzione  \n\nProgramma di esame\n\n  * Economia monetaria (6 cfu) \n\n    * Obiettivo del corso è quello di fornire conoscenze relative all’evoluzione storica della moneta, le visioni teoriche delle varie scuole di pensiero economico ed il ruolo delle attuali forme di moneta nei moderni sistemi economici approfondendo i nessi tra le politiche monetarie e l’andamento delle variabili finanziarie e reali sia in un contesto nazionale (prima parte) che internazionale (seconda parte).  \n\nProgramma di esame\n\n  * 18 cfu a scelta nel gruppo GR2: attività formative caratterizzanti aziendali II anno \n\n    * Un insegnamento a scelta tra: Economia degli intermediari finanziari Economia del mercato mobiliare Tecnica delle assicurazioni GRUPPO CARATTERIZZANTE AMBITO AZIENDALE\n    * Economia del mercato mobiliare (9 cfu)\n\n      * Il corso tratta gli aspetti strutturali e funzionali del mercato mobiliare italiano alla luce della recente evoluzione normativa intervenuta in materia, anche in ambito comunitario.  \n\nProgramma di esame\n\n    * Tecnica delle assicurazioni (9 cfu)\n\n      * Il corso, partendo dall'identificazione e classificazione dei diversi rischi, è finalizzato allo studio delle principali tecniche assicurative atte al loro fronteggiamento, sia nel ramo vita che nel ramo danni, con l’intento di formare figure qualificate ad operare in compagnie di assicurazione, in banche, nonché nell’area finanziaria e assicurativa di aziende di varie dimensioni. Apprendimento in termini di conoscenza Il corso è volto a fornire conoscenze in tema di gestione dell'impresa assicurativa nelle sue molteplici declinazioni. Il corso intende formare figure qualificate ad operare nel settore finanziario e assicurativo in particolare  \n\nProgramma di esame\n\n    * Economia degli intermediari finanziari (9 cfu)\n\n      * Il corso focalizza gli intermediari finanziari mediante l’analisi di filoni teorici, natura, caratteristiche e funzioni, efficienza e concorrenza, tecnologia, innovazione finanziaria e securitisation, principi gestionali negli intermediari finanziari (bancari, mobiliari e assicurativi) e, nel contempo, i mercati finanziari (monetari, obbligazionari, azionari e dei derivati) e gli strumenti finanziari. Il corso considera altresì problematiche e riflessi della subprime financial crisis negli Stati Uniti, in Europa e nel mondo. Il corso fornisce solide conoscenze teoriche e gestionali e, quindi, preparazione e competenze spendibili essenzialmente presso banche commerciali, fondi comuni di investimento mobiliare e imprese di assicurazione di un moderno sistema finanziario di paesi a economia di mercato.  \n\nProgramma di esame\n\n  * 6 cfu a scelta nel gruppo GR6 - Rosa materie caratterizzanti ambito giuridico II anno \n\n    * GR6 - Rosa materie caratterizzanti ambito giuridico II anno\n    * Diritto tributario (6 cfu)\n\n      * Al termine del corso lo studente avrà acquisito conoscenze di carattere istituzionale'della'materia tributaria, che spaziano dal sistema delle fonti alle dinamiche attuative del rapporto obbligatorio d'imposta (con particolare riferimento agli schemi dichiarativi'e di verifica e alle forme di amministrazione partecipata), alle procedure di riscossione, al sistema sanzionatorio, fino ai mezzi di tutela processuale ed extra-processuale delle istituzioni giuridiche soggettive che vengono in rilievo nella materia. Lo studente sarà in grado di svolgere una ricerca e una analisi delle fonti, della dottrina e della giurisprudenza relativa al diritto tributario, intraprendere analisi critiche ed acquisire strumenti per il costante aggiornamento nella materia. Lo studente potrà acquisire capacità di inquadramento critico e metodologico della materia anche al fine di risolvere casi concreti.  \n\nProgramma di esame\n\n    * Diritto dell'economia (6 cfu)\n\n      * Il corso si propone di fornire agli studenti una conoscenza specialistica della regolazione amministrativa dei mercati, anche affrontando la disamina di regolazioni di settore. Le lezioni hanno dunque ad oggetto l’analisi delle norme e degli istituti giuridici mediante i quali l’ordinamento nazionale, spesso in attuazione di norme europee, detta regole a governo e disciplina di determinati mercati, allo scopo di superarne o prevenirne gli eventuali fallimenti (c.d. regolazione di attività economiche).  \n\nProgramma di esame\n\n    * Diritto dell'unione europea (6 cfu)\n\n      * Al termine del corso lo studente avrà acquisito conoscenze relative alla struttura ed al funzionamento dell'Unione europea ed in particolare degli aspetti istituzionali dell'Unione stessa, con un'attenzione specifica alle fonti del diritto EU e dei loro effetti sulle legislazioni degli Stati membri e ai rapporti fra ordinamenti.  \n\nProgramma di esame\n\n### Terzo anno\n\n  * Diritto commerciale (9 cfu) \n\n    * Il corso ha ad oggetto lo studio dell’impresa nelle sue varie articolazioni e forme di svolgimento. In particolare, vengono trattate, in forma diffusa, le varie tipologie di società, così da consentire allo studente l’acquisizione di conoscenze di base idonee per lo svolgimento delle varie attività che potrà svolgere dopo la laurea (consulente aziendale; amministratore; sindaco; revisore contabile.  \n\nProgramma di esame\n\n  * Attività formative a libera scelta (12 cfu) \n\n    * Lo studente nell'ambito delle attività formative a libera scelta può scegliere tra sostenere uno o piu' esami. Sono riconoscibili automaticamente nei 12 crediti a libera scelta:  \n• le attività formative delle rose del corso di laurea non già sostenute e gli\nesami di tutti i corsi di laurea triennali afferenti al Dipartimento di\nEconomia e Management dell’università di Pisa, purchè non palesino una\nripetizione di programma con insegnamenti già sostenuti.  \n• 6 crediti per attività di stage (per le regole di effettuazione degli stage\ne di riconoscimento dei relativi crediti si rimanda alla sezione del sito del\nDipartimento di Economia e Management).  \nLaddove lo studente volesse far riconoscere attività formative non comprese\ntra quelle di cui sopra, dovrà farne preventiva richiesta al Corso di laurea\ncompilando l'apposto modulo a disposizione presso la Segreteria Studenti.\nSuccessivamente la Commissione Piani di Studio e Pratiche Studenti del corso\ndi laurea valuterà la coerenza culturale delle scelte prospettate e istruirà\nla pratica per l'approvazione del Consiglio di corso di laurea.  \nNelle attività a scelta libera dello studente, non sono inseribili attività\nformative presenti nei Regolamenti dei corsi di laurea magistrali.  \n  \n\nProgramma di esame\n\n  * Prova finale (3 cfu) \n\n    * La prova finale consiste nella stesura di un elaborato scritto e ha lo scopo di verificare il grado di autonomia dello studente nell'elaborazione delle conoscenze acquisite durante il percorso di studi. L'argomento della prova finale deve essere concordato con un docente (docente referente) e può riferirsi ad una delle seguenti tipologie: un problema di attualità, un argomento affrontato nel corso della carriera universitaria, ovvero un'esperienza maturata in un periodo di tirocinio svolto presso enti/istituti di ricerca, aziende/amministrazioni/organizzazioni pubbliche o private.  \n  \n  \n  \nAlla prova finale per il conseguimento del titolo sono riservati 3 CFU.  \nLo studente può scegliere il docente referente solo dopo aver maturato 130\nCFU, utilizzando il portale http://didatticaeco.ec.unipi.it. Può essere\ndocente referente uno dei docenti con cui lo studente ha sostenuto un esame\ntra quelli presenti nel proprio piano di studi. Nella stesura dell'elaborato,\nlo studente sarà guidato dal docente referente che dovrà fornirgli le\nindicazioni utili circa la metodologia, indirizzarlo nella ricerca\nbibliografica e supportarlo in caso di difficoltà.  \nL’elaborato finale è costituito da un documento di tipo dattiloscritto in\nformato di stampa (lunghezza massima 75.000 caratteri, spazi esclusi),\ncorredato di una presentazione di sintesi (max. 5 slides) e di una\ndichiarazione di autenticità e originalità del lavoro, sottoscritta dallo\nstudente. Lo studente può concordare con il docente referente di redigere\nl’elaborato e le slides in lingua inglese.  \nTutti i documenti che costituiscono l’elaborato finale devono essere caricati\ndallo studente sul portale http://didatticaeco.ec.unipi.it; dopo che lo\nstudente ha conseguito 177 CFU ed ha caricato i documenti elaborati per la\nprova finale, una commissione costituita dal docente referente e da un altro\ndocente del CdS procede alla valutazione della prova.  \nAi fini della valutazione sono tenuti in considerazione i seguenti criteri:  \n-capacità di applicare correttamente le competenze e le conoscenze acquisite nel Corso di Laurea;  \n-grado di autonomia dello studente nella redazione dell’elaborato;  \n-accuratezza e pertinenza della sezione riferimenti bibliografici;  \n-chiarezza e correttezza espositiva;  \n-coerenza nello sviluppo degli argomenti;  \n-capacità di recepimento delle indicazioni fornite dal docente.   \nIl voto della prova finale viene espresso dalla commissione giudicatrice in\ntrentesimi e tradotto in un punteggio, da 0,5 a 2, secondo lo schema seguente:  \n18-20 = 0,5  \n21-23= 1  \n24-27=1,5  \n28-30=2  \nIl voto della prova finale concorre alla determinazione del voto di laurea\n(vedasi sezione “Modalità determinazione voto di Laurea”).  \nNon è prevista la discussione dell’elaborato.  \n\nProgramma di esame\n\n  * Finanza aziendale (9 cfu) \n\n    * Il corso si pone l’obiettivo di introdurre gli studenti alla gestione della finanza aziendale, affrontando i principali temi della corporate finance: l’analisi finanziaria in ottica di gestione del rischio, la valutazione degli investimenti sia di lungo termine che relativamente al working capital, la politica dei finanziamenti per la scelta della struttura finanziaria e la politica dei dividendi con l’ottica dei responsabili finanziari.   \n  \nAl termine del corso lo studente saprà interpretare un bilancio sotto la\nprospettiva dell'analisi del rischio, sarà in grado di effettuare la\nvalutazione degli investimenti in condizione di certezza ed incertezza, potrà\nvalutare le implicazioni delle politiche di gestione dei capitale circolante\ned avrà gli strumenti per analizzare gli effetti delle politiche di\nfinanziamento sul processo di creazione di valore.  \n  \n  \n\nProgramma di esame\n\n  * Economia dei mercati finanziari (9 cfu) \n\n    * Al termine del corso lo studente avrà acquisito conoscenze in merito agli strumenti e alle metodologie più utilizzate nello studio dei mercati finanziari.  \n\nProgramma di esame\n\n  * Economia e tecnica bancaria (9 cfu) \n\n    * Il corso si propone di fornire allo studente le conoscenze di base dell’economia delle banche.   \nRientrano, quale parte integrante del corso, anche le conoscenze sulla\npolitica monetaria e dell’eurosistema e quelle sulle metodologie di calcolo\nper il controllo dei rischi finanziari. Sotto il profilo gestionale, l’analisi\ndell’evoluzione del rapporto banca-impresa e le forme tecniche tradizionali\nper il soddisfacimento delle occorrenze finanziarie di queste ultime.  \n\nProgramma di esame\n\n  * 12 cfu a scelta nel gruppo GR3 -Attività formative Affini III anno \n\n    * 12 CFU a scelta tra: Storia delle teorie monetarie, bancarie e finanziarie Storia e politica monetaria Economia monetaria internazionale Diritto privato dell'economia e dell'azienda, Tecnica di borsa \n    * Storia e politica monetaria (6 cfu)\n\n      * Il corso intende fornire una panoramica sulla formazione e lo sviluppo di sistemi creditizi complessi, sulla natura e sui cambiamenti della moneta e del sistema dei pagamenti, sull’evoluzione delle banche centrali, sulla finanza d’impresa e sul suo ruolo nei processi d’industrializzazione. Una particolare attenzione è rivolta alle funzioni della politica monetaria per il modo in cui essa si è declinata nelle diverse fasi storiche e nei principali paesi industriali. Alla fine del corso, gli studenti saranno in grado di comprendere e analizzare criticamente i diversi temi della storia e politica monetaria.  \n\nProgramma di esame\n\n    * Economia monetaria internazionale (6 cfu)\n\n      * L’obiettivo del corso consiste nel far conoscere agli studenti i principi fondamentali dell’economia monetaria internazionale. In particolare, lo studente dovrà conoscere i diversi concetti di tassi di cambio e i principali modelli usati per spiegare la loro determinazione, il ruolo svolto dalla Bilancia dei pagamenti, la condizione di parità dei poteri di acquisto e la essenziale equazione di arbitraggio sui tassi di interesse.  \n\nProgramma di esame\n\n    * Tecnica di borsa (6 cfu)\n\n      * Il corso si propone di fornire una preparazione adeguata circa l'operatività degli attuali mercati borsistici, approfondendo l'analisi dei loro tratti funzionali. A tal fine, nel corso vengono analizzate sia le modalità di contrattazione sui mercati gestiti da Borsa Italaina SpA, sia i caratteri peculiari degli strumenti finanziari in detti mercati scambiati. Vengono altresì esaminate le principali operazioni in essi eseguite (come IPO, OPA ed aumenti di capitale), con particolare riguardo ai relativi profili operativi  \n\nProgramma di esame\n\n    * Diritto privato dell'economia e dell'azienda (6 cfu)\n\n      * Scopo del corso è quello di fornire una più approfondita conoscenza di alcuni aspetti del fenomeno del sovraindebitamento. Verranno'preliminarmente prese in considerazione le principali differenze di trattamento tra insolvenza civile e insolvenza commerciale, per poi passare al piano più specifico dell'analisi del fenomeno del sovraindebitamento (anche in chiave Behavioural Economics)'e delle strategie - preventive e successive - di gestione del fenomeno.'Il quadro sarà arricchito sia dalla considerazione delle scelte degli altri ordinamenti, sia dall'approfondimento della disciplina italiana (l. 3/2012, decreto ristori, codice della crisi d'impresa e dell'insolvenza). Sarà oggetto di attenzione anche la giurisprudenza in materia. A conclusione del corso, lo/la studente dovrà avere acquisito una puntuale conoscenza delle normative esaminate ed essere in grado di coglierne il significato in relazione alla rispettiva finalità, nonché di valutarne le conseguenze applicative.  \n\nProgramma di esame\n\n    * Storia delle teorie monetarie, bancarie e finanziarie (6 cfu)\n\n      * Il corso ricostruisce la genesi delle principali teorie monetarie e bancarie a partire dalla critica di Hume al sistema bullionista-mercantilista, passando attraverso i dibattiti britannici della prima metà del XIX secolo, continuando con le teorie neoclassiche di Wicksell, Fisher, Marshall per concludersi alle soglie della rivoluzione keynesiana. In modo particolare il corso si articolerà su alcune chiavi di lettura principali: il dibattito teorico sul gold standard; l’emergere del ruolo delle banche centrali e delle differenze nell'analisi teorica fra moneta e credito (concentrando l'attenzione in modo particolare sui contributi di Thornton e Bagehot) ; la neutralità della moneta e il suo rapporto con il ciclo economico. Il corso si propone di fornire nello stesso tempo un quadro sintetico dello sviluppo delle teorie monetarie e bancarie e una visione critica di tale processo, in correlazione con le trasformazioni del sistema economico internazionale.  \n\nProgramma di esame\n\nServizi on line per studenti\n\nLOGINREGISTRATI\n\n\n\n### Info\n\n  * **Presidente del Corso di Laurea**\n  * Maria Cristina Quirici\n  *  **Email:** maria.cristina.quirici@unipi.it\n  * **Referente didattico**\n  * Unità Didattica-dem   \nDipartimento di Economia e management - Via C. Ridolfi, 10 - 56124 Pisa  \n **Tel.** 050 2216371-269-412  \n **Email:** didatticaeconomia@ec.unipi.it  \n**Orario di ricevimento:**  \nPer gli orari di ricevimento consulta le pagine web del sito www.ec.unipi.it o\nscrivi a didatticaeconomia@ec.unipi.it  \n **Note:**  \nPer informazioni sulla Didattica e sull’Offerta Formativa del Dipartimento\npuoi contattare l’Unità Didattica scrivendo all’indirizzo email:\ndidatticaeconomia@ec.unipi.it o collegandoti, tramite la piattaforma Microsoft\nTeams, al seguente link: https://bit.ly/3aYBE2x oppure rivolgendoti allo\nSportello Orientamento nei giorni e agli orari indicati su questa\npagina:https://www.ec.unipi.it/ripresa-attivita-sportello-orientamento/\n\n  * **Orario delle lezioni**  \nConsulta l'orario\n\n  * Seguici su\n  *   *   *   *   * \n\n\n\n  * Università di Pisa\n  * Lungarno Pacinotti 43\n  * 56126 Pisa\n  * P.I. 00286820501\n  * C.F. 80003670504\n\n\n\n  * Centralino\n  * Tel +39 050 221 2111\n  * Fax +39 050 40834\n  * Numero Verde Studenti 800018600\n\n  * Posta Elettronica Certificata Ateneo\n\n\n\n  * Contatti\n  * Unimap - Cerca Persone\n  * Crediti\n  * Privacy Policy\n  * Note legali\n  * Elenco siti tematici\n\n\n\n  * Urp\n  * Accessibilità\n  * Amministrazione trasparente\n  * Atti di notifica\n  * Albo ufficiale\n  * Codice etico\n\nQuesto sito utilizza solo cookie tecnici, propri e di terze parti, per il\ncorretto funzionamento delle pagine web e per il miglioramento dei servizi. Se\nvuoi saperne di più, consulta l'informativa\n\nOk\n\n",
    "links": "[{\"link\": \"https://www.unipi.it/index.php/studenti\", \"text\": \"\"}, {\"link\": \"https://www.unipi.it/\", \"text\": \"IT\"}, {\"link\": \"https://www.unipi.it/index.php/english\", \"text\": \"EN\"}, {\"link\": \"https://www.unipi.it/index.php/espanol\", \"text\": \"ES\"}, {\"link\": \"https://www.unipi.it/index.php/ateneo\", \"text\": \"Ateneo\"}, {\"link\": \"https://www.unipi.it/index.php/studenti\", \"text\": \"Studenti\"}, {\"link\": \"https://www.unipi.it/index.php/ricerca\", \"text\": \"Ricerca\"}, {\"link\": \"https://www.unipi.it/index.php/internazionale\", \"text\": \"Internazionale\"}, {\"link\": \"https://www.unipi.it/index.php/territorio-imprese\", \"text\": \"Territorio/Imprese\"}, {\"link\": \"https://www.unipi.it/index.php/personale\", \"text\": \"Personale\"}, {\"link\": \"https://www.unipi.it/\", \"text\": \"IT\"}, {\"link\": \"https://www.unipi.it/index.php/english\", \"text\": \"EN\"}, {\"link\": \"https://www.unipi.it/index.php/espanol\", \"text\": \"ES\"}, {\"link\": \"https://www.unipi.it/index.php/lauree\", \"text\": \"Corsi di Laurea\"}, {\"link\": \"https://www.unipi.it/index.php/offerta\", \"text\": \"Offerta didattica\"}, {\"link\": \"https://www.unipi.it/index.php/iscrizione-e-segreterie\", \"text\": \"Iscrizione e segreterie\"}, {\"link\": \"https://www.unipi.it/index.php/servizi-e-orientamento\", \"text\": \"Servizi e orientamento\"}, {\"link\": \"https://www.unipi.it/index.php/internazionalestudenti\", \"text\": \"Internazionale\"}, {\"link\": \"https://www.unipi.it/index.php/tirocini-e-job-placement\", \"text\": \"Tirocini e Career Service\"}, {\"link\": \"https://www.unipi.it/index.php/vivere-l-universita\", \"text\": \"Vivere l'università\"}, {\"link\": \"https://www.unipi.it/index.php/lauree/corso/10445\", \"text\": \"Descrizione\"}, {\"link\": \"https://www.unipi.it/index.php/lauree/sbocchi/10445\", \"text\": \"Sbocchi professionali\"}, {\"link\": \"https://www.unipi.it/index.php/documenti/item/3361\", \"text\": \"\"}, {\"link\": \"https://www.unipi.it/index.php/documenti-ateneo/item/267-contatti\", \"text\": \"Contatti\"}, {\"link\": \"https://www.unipi.it/index.php/documenti-ateneo/item/265-credits\", \"text\": \"Crediti\"}, {\"link\": \"https://www.unipi.it/index.php/documenti-ateneo/item/12721\", \"text\": \"Privacy Policy\"}, {\"link\": \"https://www.unipi.it/index.php/note-legali\", \"text\": \"Note legali\"}, {\"link\": \"https://www.unipi.it/index.php/documenti-ateneo/item/3606-elenco-dei-siti-tematici\", \"text\": \"Elenco siti tematici\"}, {\"link\": \"https://www.unipi.it/index.php/urp\", \"text\": \"Urp\"}, {\"link\": \"https://www.unipi.it/index.php/documenti-ateneo/item/14764\", \"text\": \"Accessibilità\"}, {\"link\": \"https://www.unipi.it/index.php/amministrazione/itemlist/category/341-amministrazione-trasparente\", \"text\": \"Amministrazione trasparente\"}, {\"link\": \"https://www.unipi.it/index.php/atti-di-notifica\", \"text\": \"Atti di notifica\"}, {\"link\": \"https://www.unipi.it/index.php/statuto-regolamenti/item/1973-codice-etico-della-comunità-accademica\", \"text\": \"Codice etico\"}, {\"link\": \"https://www.unipi.it/index.php/documenti-ateneo/item/12721\", \"text\": \"consulta l'informativa\"}]"
}