{
    "summary": "Skip to main content\n\nUSD  Choose your currency. Your current currency is U.S. Dollar\n\nChoose your language. Your current language is English (US)\n\n##  Select your language\n\n###  Suggested for you\n\n    * English (UK) \n\n    * Español \n\n    * 简体中文 \n\n    * Русский \n\n    * 日本語 \n\n###  All languages\n\n  * English (UK) \n\n  * English (US) \n\n  * Deutsch \n\n  * Nederlands \n\n  * Français \n\n  * Español \n\n  * Español (AR) \n\n  * Español (MX) \n\n  * Català \n\n  * Italiano \n\n  * Português (PT) \n\n  * Português (BR) \n\n  * Norsk \n\n  * Suomi \n\n  * Svenska \n\n  * Dansk \n\n  * Čeština \n\n  * Magyar \n\n  * Română \n\n  * 日本語 \n\n  * 简体中文 \n\n  * 繁體中文 \n\n  * Polski \n\n  * Ελληνικά \n\n  * Русский \n\n  * Türkçe \n\n  * Български \n\n  * العربية \n\n  * 한국어 \n\n  * עברית \n\n  * Latviski \n\n  * Українська \n\n  * Bahasa Indonesia \n\n  * Bahasa Malaysia \n\n  * ภาษาไทย \n\n  * Eesti \n\n  * Hrvatski \n\n  * Lietuvių \n\n  * Slovenčina \n\n  * Srpski \n\n  * Slovenščina \n\n  * Tiếng Việt \n\n  * Filipino \n\n  * Íslenska \n\nGet help with your reservation\n\nList your property\n\nRegister\n\nSign in\n\n  * Stays \n  * Flights \n  * Flight + Hotel \n  * Car rentals \n  * Attractions \n  * Airport taxis \n\n#  Search hotels in Santo Stefano di Sessanio\n\n##  Enter your dates to see the latest prices and deals for Santo Stefano di\nSessanio hotels\n\nType your destination\n\n  *   *   *   *   * \n\nError:  Enter a destination to start searching.\n\n_+_\n\nCheck-in month  __\n\nJanuary 2024February 2024March 2024April 2024May 2024June 2024July 2024August\n2024September 2024October 2024November 2024December 2024January 2025February\n2025March 2025April 2025\n\nCheck-in day  __\n\nCheck-in\n\n__\n\n_+_\n\nCheck-out month  __\n\nJanuary 2024February 2024March 2024April 2024May 2024June 2024July 2024August\n2024September 2024October 2024November 2024December 2024January 2025February\n2025March 2025April 2025\n\nCheck-out day  __\n\nCheck-out\n\n__\n\n  * Calendar\n  * I'm flexible\n\nJanuary 2024\n\nSu| Mo| Tu| We| Th| Fr| Sa  \n---|---|---|---|---|---|---  \n|  1 |  2 |  3 |  4 |  5 |  6  \n7 |  8 |  9 |  10 |  11 |  12 |  13  \n14 |  15 |  16 |  17 |  18 |  19 |  20  \n21 |  22 |  23 |  24 |  25 |  26 |  27  \n28 |  29 |  30 |  31 | | |  \n  \nFebruary 2024\n\nSu| Mo| Tu| We| Th| Fr| Sa  \n---|---|---|---|---|---|---  \n| | |  |  1 |  2 |  3  \n4 |  5 |  6 |  7 |  8 |  9 |  10  \n11 |  12 |  13 |  14 |  15 |  16 |  17  \n18 |  19 |  20 |  21 |  22 |  23 |  24  \n25 |  26 |  27 |  28 |  29 | |  \n  \n  * Exact dates\n\n  * 1 day\n\n  * 2 days\n\n  * 3 days\n\n  * 7 days\n\n**How long do you want to stay?**\n\nA weekend A week A month Other\n\nnight\n\nFrom Monday From Tuesday From Wednesday From Thursday From Friday From\nSaturday From Sunday\n\n**When do you want to go?**\n\nSelect up to 3 months\n\n  * Jan\n\n2024\n\n  * Feb\n\n2024\n\n  * Mar\n\n2024\n\n  * Apr\n\n2024\n\n  * May\n\n2024\n\n  * Jun\n\n2024\n\n  * Jul\n\n2024\n\n  * Aug\n\n2024\n\n  * Sep\n\n2024\n\n  * Oct\n\n2024\n\n  * Nov\n\n2024\n\n  * Dec\n\n2024\n\nSelect dates\n\nRooms and occupancy 2 adults  ·  0 children  ·  1 room\n\nAdults\n\n- 2 +\n\nChildren\n\n- 0 +\n\nRooms\n\n- 1 +\n\nSearch\n\nI'm traveling for work\n\n  1. Home \n\n  2. Hotels \n\n  3. Italy \n\n  4. Abruzzo \n\n  5. Santo Stefano di Sessanio \n\nHelp us make your next trip even better\n\nTake survey  Dismiss\n\nShow hotels on map\n\n### Filter by:\n\n* * *\n\n#### Star Rating\n\n5 stars 4 stars 3 stars 2 stars 1 star\n\n#### Review Score\n\nWonderful: 9+ Very Good: 8+ Good: 7+ Pleasant: 6+\n\nSanto Stefano di Sessanio – 17 hotels and places to stay\n\nOur Top Picks Lowest Price First Star rating and price Top Reviewed\n\nSee the latest prices and deals by choosing your dates. Choose dates\n\n###  Sextantio Albergo Diffuso\n\nHotel in Santo Stefano di Sessanio\n\nSextantio Albergo Diffuso offers unique accommodations in the fortified\nmedieval village of Santo Stefano di Sessanio, deep in the Abruzzo hillside,\nat an altitude of 4,100 ft.\n\nOlga Israel\n\nVery special and unusual place to stay, very friendly staff.\n\nShow more Show less\n\n9\n\nWonderful\n\n408 reviews\n\nCheck availability\n\n###  Convento di San Colombo  _ _\n\nHotel in Santo Stefano di Sessanio\n\nLocated in Barisciano in the Abruzzo Region, 9.9 mi from L’Aquila, Convento di\nSan Colombo is set in its garden and it features a children's playground and\nviews of the mountain.\n\nTatiana Canada\n\nAbsolutely unique property with a lot of history. Beautiful view from the\nwindow. Very quiet place. Good size room. Very friendly staff. Definitely\nrecommend this place.\n\nShow more Show less\n\n9\n\nWonderful\n\n527 reviews\n\nCheck availability\n\n###  La Casa Sù Le Dimore Del Borgo\n\nSanto Stefano di Sessanio\n\nSet in the small village of Santo Stefano di Sessanio, La Casa Sù Le Dimore\nDel Borgo is inside Abruzzo's Gran Sasso National Park.\n\nRob United States of America\n\nThe personal check in with excellent local information. The suite was high\nquality. The food from Hectore’s farm was a nice touch.\n\nShow more Show less\n\n9.2\n\nWonderful\n\n614 reviews\n\nPrice from\n\n$98\n\nper night\n\nCheck availability\n\n###  Residenza La Torre\n\nSanto Stefano di Sessanio\n\nSurrounded by nature, Residenza La Torre offers self-catering apartments in\nGran Sasso e Monti della Laga National Park. Apartments feature a fully\nequipped kitchenette.\n\nErie United States of America\n\nVery spacious, all the modern comforts within medieval stone walls.\n\nShow more Show less\n\n9\n\nWonderful\n\n265 reviews\n\nPrice from\n\n$106\n\nper night\n\nCheck availability\n\n###  Residence Belvedere\n\nSanto Stefano di Sessanio\n\nSet in Santo Stefano di Sessanio, Residence Belvedere features accommodations\nwith free WiFi and seating area.\n\nAngela United Kingdom\n\nEverything. The apartment was just lovely, clean, well equipped. The view from\nthe balcony was breathtaking. The owner helped me so much as I had brought the\nwrong phone charger with me, and he drove 45mins to bring me a new one, it was\nso appreciated, and very kind, because I don't know how my holiday would have\ncontinued without it, as there are no electrical shops near. Thankyou again.\n\nShow more Show less\n\n8.8\n\nExcellent\n\n409 reviews\n\nPrice from\n\n$76\n\nper night\n\nCheck availability\n\n###  Dimora Sessanio\n\nSanto Stefano di Sessanio\n\nDimora Sessanio is a sustainable bed and breakfast in Santo Stefano di\nSessanio, 5.2 miles from Rocca Calascio Fortress.\n\nEdward United States of America\n\nHistoric home, beautifully updated and tastefully furnished with a great blend\nof the old and the new. Breakfast was superb, especially the fresh eggs from\ntheir farm.\n\nShow more Show less\n\n9.4\n\nWonderful\n\n235 reviews\n\nPrice from\n\n$130\n\nper night\n\nCheck availability\n\n###  La Locanda sul Lago\n\nSanto Stefano di Sessanio\n\nSet in its large garden and surrounded by the Abruzzo countryside, La Locanda\nsul Lago offers free Wi-Fi throughout and rooms with attached bathroom.\n\nPaul United Kingdom\n\nPeaceful location. Friendly staff. Amazing local food at the restaurant.\n\nShow more Show less\n\n8.4\n\nVery Good\n\n251 reviews\n\nPrice from\n\n$104\n\nper night\n\nCheck availability\n\n###  Casa Antica\n\nSanto Stefano di Sessanio\n\nCasa Antica enjoys a location in Santo Stefano di Sessanio, 5.2 miles from\nRocca Calascio Fortress and 14 miles from Campo Imperatore.\n\nGabriel Malta\n\nLovely apartment in a great location two mins walk away from Santo Stefano\ncentre but with the benefit of being able to park your car right outside.\nStunning terrace/view\n\nShow more Show less\n\n8.8\n\nExcellent\n\n106 reviews\n\nPrice from\n\n$119\n\nper night\n\nCheck availability\n\n###  Residence Villa Valsi\n\nSanto Stefano di Sessanio\n\nResidence Villa Valsi offers a shared garden and rustic-style apartments with\na balcony or a terrace in a quiet area of Santo Stefano di Sessanio. WiFi is\nfree in the entire building.\n\nJaime United States of America\n\nRita was outstanding very helpful and communication with her was very easy.\nhelped me to plan my trip going above and beyond my expectations. thanks for\nthe experience\n\nShow more Show less\n\n9.2\n\nWonderful\n\n138 reviews\n\nCheck availability\n\n###  La Dote\n\nSanto Stefano di Sessanio\n\nLa Dote offers accommodations in Santo Stefano di Sessanio, 28 miles from\nCampo Felice (Rocca di Cambio).\n\nBlueberrymuffintravel United Kingdom\n\nThe location was extradorinaiy. It was located in a village, behind the snow\nmountain. The host was very kind and offered us a very warm hospitality. The\nroom was excellent - mini fridge with milk, juice, and water. Cookies, coffee,\nmuffin - they were all free. The heater was fine. The TV was big. The bed was\ncomfortable and lovely. The bathroom was well-equipped with shampoo, shower\ngel, conditioner, ladies' wash, hairdryer, and make up remover. The Christmas\ndecoration was beautiful inside the room. We would love to visit the place\nagain if opportunity arises.\n\nShow more Show less\n\n8.7\n\nExcellent\n\n218 reviews\n\nCheck availability\n\nSee all 11 hotels in Santo Stefano di Sessanio\n\nSubscribe to receive premium deals\n\nPrices drop the second you sign up!\n\nSign me up!\n\n## What Guests Said About Santo Stefano di Sessanio:\n\n  * 10\n\n### We expected luxury in a uniquely rustic environment and we...\n\nWe expected luxury in a uniquely rustic environment and we weren’t\ndisappointed. The view from our room window was stunning as was the view from\nthe restaurant terrace. Candle light created a warm atmosphere. But the\nhighlight was the quality of the service. A positive culture which was\ncontagious amongst the guests. Thanks to all. We ate at ala Locanda each night\nand were very happy with the diversity and quality of the menu. We hiked to\nRocca Calascio, drove to the observatory and walked, had lunch at the refuge\non Campo Imperatore where we BBQed our meat bought from the refuge. On the way\nback to Rome we visiting L’Aquila, the sophisticated capital of the region.\n\nShow more\n\nStephanie\n\nAustralia\n\n  * 10\n\n### It's a jewel!\n\nIt's a jewel! Shame that it is dominated by three cranes at the moment as they\nare rebuilding the medicean tower, distroyed by the 2009 earthquake (yes, very\nslow activity!) Go to the nearby Rocca Calascia, parking nearby is limited so\nbetter to go before 11am; the walk to the castle is rocky but worthwhile.\nFantastic views of the mountain range around and the valleys around. Book a\nrestaurant for the evening as they get quite busy in Santo Stefano. We ate at\nthe Bettola di Geppetto in the centre of the village and the Locanda del\nPalazzo at the bottom, just outside the village, both very good and with\ncharacter.\n\nShow more\n\nMarina\n\nUnited Kingdom\n\n  * 10\n\n### A lovely hill town.\n\nA lovely hill town. Much, much better signage---and---signage placement--- is\nneeded for everything! Even with \"directions\" from 3 different people we\ncouldn't find the trail head for the hiking path from Santo Stefano to the\nRocca Calascio. Also, it was very difficult to find the reception for our\nhotel because of the lack of clear and well-placed signs. Don't let that\ndiscourage you from visiting---just keep it in mind. It is a bit of a\nchallenge. But, Santo Stefano is worth the visit.\n\nShow more\n\nDavid\n\nUnited States of America\n\n  * 8.0\n\n### Our hosts were lovely and were willing to help with anything...\n\nOur hosts were lovely and were willing to help with anything we needed. Lucca\ntook time to explain the history of the palazzo as well as the area. All of\nthe breakfast items were sourced from their own properties or locally. This\narea is authentic and spectacularly beautiful. Rocca Calascio is worth the\nhike.\n\nShow more\n\nCarmine\n\nUnited States of America\n\n  * 10\n\n### The hamlet is tiny, only 67 permanent residents and so well...\n\nThe hamlet is tiny, only 67 permanent residents and so well preserved it feels\nlike going back in time. There are only a few restaurants but all offer home\nmade, local food. I loved the fact that it is surrounded only by mountains and\nthere are no other modern buildings for miles. Truly a great find in a wild\nand still under rated of Italy.\n\nShow more\n\nBrunella\n\nHong Kong\n\n## Explore guest reviews of hotels in Santo Stefano di Sessanio\n\nSee all\n\n  * ### Convento di San Colombo\n\nSanto Stefano di Sessanio\n\n9.0\n\nWonderful · 527 reviews\n\nThe convento di san colombo is a beautiful hotel where you can find quietness,\na lovely room and a beautiful outside space with a beautiful view. Overall the\nperfect environment to relax. The hotel restaurant is highly recommended,\nreasonably priced and also offers vegetarian options. The staff is very\nfriendly and welcoming. Also they were extremely helpful when we had troubles\nwith our car as they managed the communication in italian for us. They even\nwent ahead and organized a place for us where we got the car fixed easily and\nfast.\n\nShow more\n\nFabi\n\nGermany\n\n  * ### La Dote\n\nSanto Stefano di Sessanio\n\n8.7\n\nExcellent · 218 reviews\n\nThe location of B&B La Dote is perfect! You have a very nice view from the\nbalcony and there is just silence during the night. The property provides\neverything you might need during vacation, and there are some goodies for\nbreakfast and also very good coffee that you can enjoy also outside. The owner\nwas very flexible and helpful: she came to pick us up at Bivio di Barisciano\n(around 10 km to Santo Stefano di Sessanio) because there are no buses on\nSunday that bring you up to the village. We will be back for sure!🙂\n\nShow more\n\nZsanett\n\nRomania\n\n  * ### La Casa Sù Le Dimore Del Borgo\n\nSanto Stefano di Sessanio\n\nFrom $103.09 per night\n\n9.2\n\nWonderful · 614 reviews\n\nThe property is a renovated farm. We had a living room/ kitchen and good\nbathroom. The bed was very comfortable and warm, the breakfast nice with home\nmade yoghurt and cakes. The bedroom was in the loft with rather steep stairs.\nThis was fine for us but could be a problem for less agile people, especially\nif they need to get down to the bathroom at night. The welcome was friendly,\nparking on site great. Santo Stefano di Sessanio a great little place to enjoy\nis right next door.\n\nShow more\n\nHelke\n\nAustralia\n\n  * ### Residenza La Torre\n\nSanto Stefano di Sessanio\n\nFrom $156.26 per night\n\n9.0\n\nWonderful · 265 reviews\n\nThe location of the hotel is very special, though it would be good to have\nviews/ more information about outside areas prior to booking, as this would\nhave effected our choice of room. The village is pretty and interesting and we\nenjoyed being able to go hiking in the park without needing to use the car.\nThe room was very well equipped, also with a good kitchen area, making it easy\nto cater for ourselves when we chose, though restaurants locally are limited.\n\nShow more\n\nTessa\n\nUnited Kingdom\n\n  * ### Convento di San Colombo\n\nSanto Stefano di Sessanio\n\n9.0\n\nWonderful · 527 reviews\n\nLocation is just above the village and not too far from the Campo Imperatore\nfrom where you can make wonderful hikes. We took inclusive dinner and dinner\nwas exactly as it should be, fresh, tasteful and good portions. The place is\nvery calm and away from busy streets. Also close by are the wonderful places\nSanto Stefano di Sessanio, Calascio and Castel del Monte. certainly a good\nspot to explore Campo and south of it.\n\nShow more\n\nFilip\n\nBelgium\n\n  * ### Sextantio Albergo Diffuso\n\nSanto Stefano di Sessanio\n\n9.0\n\nWonderful · 408 reviews\n\nAn incredible charming historical hotel in the most charming medieval\nborghetto. It really feels as if we were back in time. The medieval decoration\nof the hotel really sets up an incredible ambiance of those times. The cantina\nis a must see and experience an aperitivo. The staff is very friendly and\nalways with a genuine smile. We had an amazing, relaxed time.\n\nShow more\n\nP\n\nPedro\n\nSwitzerland\n\n  * ### Sextantio Albergo Diffuso\n\nSanto Stefano di Sessanio\n\n9.0\n\nWonderful · 408 reviews\n\nWhat a unique hotel high up in the mountains in a 16th century abandoned\nvillage. The floors and ceilings are original with comfortable beds made of\nwool. Modern bathrooms though. Lovely soap and oil in the bathroom. Staff were\nfantastic. The restaurant was rustic. We also enjoyed the extra activity of\ntruffle hunting. The separate bar was also excellent\n\nShow more\n\nDavid\n\nAustralia\n\n  * ### Sextantio Albergo Diffuso\n\nSanto Stefano di Sessanio\n\n9.0\n\nWonderful · 408 reviews\n\nThis place was beautiful! Fireplace in shared room was cozy. The candles added\na luxurious nod to the simple yet elegant atmosphere. Very quiet and peaceful.\nThe hotel provided special surprises for our four-legged family member. The\nproximity to a hiking trail was an unexpected bonus! We even flew a kite from\nthe breezy hillside.\n\nShow more\n\nluckytraveller\n\nGermany\n\n  * ### Sextantio Albergo Diffuso\n\nSanto Stefano di Sessanio\n\n9.0\n\nWonderful · 408 reviews\n\nIt is a unique property comprised of various buildings in this historic,\nmedieval, I believe, hill settlement. The spaces are unique and I appreciate\nthat the hotel is breathing life into a place which may have fell into disuse\npreviously. The staff is very professional and friendly as well.\n\nShow more\n\nAndrew\n\nUnited States of America\n\n  * ### Convento di San Colombo\n\nSanto Stefano di Sessanio\n\n9.0\n\nWonderful · 527 reviews\n\nWhen I travel, the two most important things for me are cleanliness and the\nbed. This hotel is impeccably clean and the bed is super comfortable! And it’s\nsooo quiet. Tea room was appreciated.\n\nShow more\n\nKATRIN\n\nItaly\n\n  * ### Convento di San Colombo\n\nSanto Stefano di Sessanio\n\n9.0\n\nWonderful · 527 reviews\n\nBeautiful location, gorgeous dining and chapel rooms, warm welcome with\nspecial attention for our honeymoon, and one of the most delicious dinners\nwe've had in our road trip through Italy.\n\nShow more\n\nA\n\nAlexandra\n\nBelgium\n\n  * ### Dimora Sessanio\n\nSanto Stefano di Sessanio\n\n9.4\n\nWonderful · 235 reviews\n\nbeautifully kept old mansion house in the middle-age village of Santo Stefano\ndi Sessanio. Frescoed ceiling and wonderful breakfast\n\nEnrico\n\nLuxembourg\n\n  * ### Sextantio Albergo Diffuso\n\nSanto Stefano di Sessanio\n\n9.0\n\nWonderful · 408 reviews\n\nA marvelous experience. Staying at this hotel is a trip in of itself. The\nrestaurant for dinner is a must do not miss it.\n\nM\n\nMaria\n\nCosta Rica\n\n  * ### Casa Ladyhawke\n\nSanto Stefano di Sessanio\n\n8.8\n\nExcellent · 52 reviews\n\nVery nice and spacious apartment in the historic village of Santo Stefano di\nSessanio. Perfect position and nice staff!\n\nFrancesco\n\nItaly\n\n  * ### Cuore Nero Food and Relax\n\nSanto Stefano di Sessanio\n\n8.4\n\nVery Good · 11 reviews\n\nGreat location. We love Abruzzo. Or favorite place in Italy\n\nDaniel\n\nUnited States of America\n\n  * ### Sextantio Albergo Diffuso\n\nSanto Stefano di Sessanio\n\n9.0\n\nWonderful · 408 reviews\n\nEverything! The hotel is just beautiful!\n\nM\n\nMaria Jesus\n\nBelgium\n\n## Research, refine, and make plans for your whole trip\n\nWhen to visit Italy\n\nEvents, prices, the weather – everything you need to know about the best time\nto visit Italy.\n\nHotels in Gran Sasso\n\nExtend your search and explore the surrounding area.\n\nHotels in Abruzzo\n\nExtend your search and explore the surrounding area.\n\nB&Bs in Santo Stefano di Sessanio\n\nMore great accommodation options for your trip.\n\nHotels in Italy\n\nPack a bigger bag and see more of the country.\n\nHotels in LʼAquila\n\nFind more hotels in a city close to LʼAquila.\n\nHotels in Teramo\n\nFlexible on where to stay? Look up hotels in nearby Teramo, not too far from\nSanto Stefano di Sessanio.\n\nHotels in Rome\n\nDiscover another destination in Italy.\n\nHotels in Milan\n\nDiscover another destination in Italy.\n\nHotels near Abruzzo Airport\n\nPerfect for a late arrival or early departure.\n\nHotels near Marmore Falls\n\nHotels close to a popular local landmark.\n\nHotels near Campo Imperatore\n\nHotels close to a popular local landmark.\n\nHotels in Matera\n\nWant to extend your trip or just browsing? Try Matera, also popular with our\nguests!\n\nHotels in Sulmona\n\nTry another destination popular with our guests.\n\nList your property\n\n  * Mobile version\n  * Your account \n  * Make changes online to your booking \n  * Customer Service Help \n  * Become an affiliate \n  * Booking.com for Business \n\n  * Countries \n  * Regions \n  * Cities \n  * Districts \n  * Airports \n  * Hotels \n  * Places of interest \n\n  * Homes \n  * Apartments \n  * Resorts \n  * Villas \n  * Hostels \n  * B&Bs \n  * Guest houses \n\n  * Unique places to stay \n  *   * Reviews \n  * Discover monthly stays \n  * Unpacked: Travel articles \n  * Seasonal and holiday deals \n  * Traveller Review Awards \n\n  * Car rental \n  * Flight finder \n  * Restaurant reservations \n  * Booking.com for Travel Agents \n\n  * Coronavirus (COVID-19) FAQs \n  * About Booking.com\n  * Customer Service Help \n  * Partner help \n  * Careers \n  * Sustainability \n  * Press Center \n  * Safety Resource Center \n  * Investor relations \n  * Terms & Conditions \n  * Partner dispute \n  * How We Work \n  * Privacy & cookie statement \n  * MSA statement \n  * Corporate contact \n  * Content guidelines and reporting \n\nExtranet Log-in\n\nCopyright © 1996–2024 Booking.com™. All rights reserved.\n\n\n\nBooking.com is part of Booking Holdings Inc., the world leader in online\ntravel and related services.\n\n  *   *   *   *   *   * \n\nStart of dialog content\n\n## Verified reviews from real guests.\n\nWe have more than 70 million property reviews, all from **real, verified\nguests**.\n\n## How does it work?\n\n  * 1\n\n### It starts with a booking\n\nIt starts with a booking\n\nThe only way to leave a review is to first make a booking. That's how we know\nour reviews come from real guests who have stayed at the property.\n\n  *   * 2\n\n### Followed by a trip\n\nFollowed by a trip\n\nWhen guests stay at the property, they check out how quiet the room is, how\nfriendly the staff is, and more.\n\n  *   * 3\n\n### And finally, a review\n\nAnd finally, a review\n\nAfter their trip, guests tell us about their stay. We check for naughty words\nand verify the authenticity of all guest reviews before adding them to our\nsite.\n\nIf you booked through us and want to leave a review, please sign in first.\n\nSign in and leave a review\n\nEnd of dialog content\n\nCheck-in date\n\nCheck-out date\n\n« »\n\nSu | Mo | Tu | We | Th | Fr | Sa  \n---|---|---|---|---|---|---  \n |  |  |  |  |  |  \n |  |  |  |  |  |  \n |  |  |  |  |  |  \n |  |  |  |  |  |  \n |  |  |  |  |  |  \n |  |  |  |  |  |  \nClose calendar\n\n####  Save big in Santo Stefano di Sessanio\n\nGet exclusive Booker deals by email\n\n  *   * \n\nFor a limited time only\n\nError: Please enter a valid email address.\n\nError: Oops! An error has occurred.\n\n####  Awesome! You're now subscribed\n\n  \nSoon you'll receive news about top-rated hotels, irresistible deals and\nexciting destinations!\n\nSign in to continue\n\nSign in to your account\n\nor use one of these options\n\nDon't have an account yet? Create your account\n\n1885460,1890130,1894860,1896690,1904420,BPHAfaAIUQRTKeeZYKMXC|1,1904420|3,1894860|4,1894860|1,1904420|5,BPHAfaAIUQRTKeeZYKMXC|2\n\n",
    "links": "[{\"link\": \"https://www.booking.com/city/it/santo-stefano-di-sessanio.en-gb.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/city/it/santo-stefano-di-sessanio.es.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/city/it/santo-stefano-di-sessanio.zh-cn.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/city/it/santo-stefano-di-sessanio.ru.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/city/it/santo-stefano-di-sessanio.ja.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/city/it/santo-stefano-di-sessanio.en-gb.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/city/it/santo-stefano-di-sessanio.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/city/it/santo-stefano-di-sessanio.de.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/city/it/santo-stefano-di-sessanio.nl.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/city/it/santo-stefano-di-sessanio.fr.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/city/it/santo-stefano-di-sessanio.es.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/city/it/santo-stefano-di-sessanio.es-ar.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/city/it/santo-stefano-di-sessanio.es-mx.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/city/it/santo-stefano-di-sessanio.ca.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/city/it/santo-stefano-di-sessanio.it.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/city/it/santo-stefano-di-sessanio.pt-pt.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/city/it/santo-stefano-di-sessanio.pt-br.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/city/it/santo-stefano-di-sessanio.no.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/city/it/santo-stefano-di-sessanio.fi.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/city/it/santo-stefano-di-sessanio.sv.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/city/it/santo-stefano-di-sessanio.da.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/city/it/santo-stefano-di-sessanio.cs.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/city/it/santo-stefano-di-sessanio.hu.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/city/it/santo-stefano-di-sessanio.ro.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/city/it/santo-stefano-di-sessanio.ja.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/city/it/santo-stefano-di-sessanio.zh-cn.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/city/it/santo-stefano-di-sessanio.zh-tw.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/city/it/santo-stefano-di-sessanio.pl.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/city/it/santo-stefano-di-sessanio.el.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/city/it/santo-stefano-di-sessanio.ru.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/city/it/santo-stefano-di-sessanio.tr.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/city/it/santo-stefano-di-sessanio.bg.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/city/it/santo-stefano-di-sessanio.ar.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/city/it/santo-stefano-di-sessanio.ko.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/city/it/santo-stefano-di-sessanio.he.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/city/it/santo-stefano-di-sessanio.lv.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/city/it/santo-stefano-di-sessanio.uk.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/city/it/santo-stefano-di-sessanio.id.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/city/it/santo-stefano-di-sessanio.ms.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/city/it/santo-stefano-di-sessanio.th.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/city/it/santo-stefano-di-sessanio.et.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/city/it/santo-stefano-di-sessanio.hr.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/city/it/santo-stefano-di-sessanio.lt.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/city/it/santo-stefano-di-sessanio.sk.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/city/it/santo-stefano-di-sessanio.sr.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/city/it/santo-stefano-di-sessanio.sl.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/city/it/santo-stefano-di-sessanio.vi.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/city/it/santo-stefano-di-sessanio.tl.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/city/it/santo-stefano-di-sessanio.is.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/index.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/flights/index.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/cars/index.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/attractions/index.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/taxi/index.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/index.html\", \"text\": \"\\nHome\\n\"}, {\"link\": \"https://www.booking.com/hotel/index.html\", \"text\": \"\\nHotels\\n\"}, {\"link\": \"https://www.booking.com/country/it.html\", \"text\": \"\\nItaly\\n\"}, {\"link\": \"https://www.booking.com/region/it/abruzzo.html\", \"text\": \"\\nAbruzzo\\n\"}, {\"link\": \"https://www.booking.com/city/it/santo-stefano-di-sessanio.html\", \"text\": \"\\nSanto Stefano di Sessanio\\n\"}, {\"link\": \"https://www.booking.com/searchresults.html?dest_id=-128873&dest_type=city&;map=1\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/searchresults.html?dest_id=-128873&dest_type=city&\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/hotel/it/sextantio-albergo-diffuso.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/searchresults.html?dest_id=-128873&dest_type=city&\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/searchresults.html?dest_id=-128873&dest_type=city&\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/hotel/it/convento-di-san-colombo.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/searchresults.html?dest_id=-128873&dest_type=city&\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/searchresults.html?dest_id=-128873&dest_type=city&\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/hotel/it/la-casa-sa1-le-dimore-del-borgo.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/searchresults.html?dest_id=-128873&dest_type=city&\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/searchresults.html?dest_id=-128873&dest_type=city&\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/hotel/it/residenza-la-torre.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/searchresults.html?dest_id=-128873&dest_type=city&\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/searchresults.html?dest_id=-128873&dest_type=city&\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/hotel/it/residence-belvedere-santo-stefano-di-sessanio.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/searchresults.html?dest_id=-128873&dest_type=city&\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/searchresults.html?dest_id=-128873&dest_type=city&\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/hotel/it/dimora-sessanio.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/searchresults.html?dest_id=-128873&dest_type=city&\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/searchresults.html?dest_id=-128873&dest_type=city&\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/hotel/it/la-locanda-sul-lago.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/searchresults.html?dest_id=-128873&dest_type=city&\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/searchresults.html?dest_id=-128873&dest_type=city&\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/hotel/it/casa-antica-santo-stefano-di-sessanio.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/searchresults.html?dest_id=-128873&dest_type=city&\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/searchresults.html?dest_id=-128873&dest_type=city&\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/hotel/it/residence-villa-valsi.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/searchresults.html?dest_id=-128873&dest_type=city&\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/searchresults.html?dest_id=-128873&dest_type=city&\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/hotel/it/b-amp-b-la-dote.html\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/searchresults.html?dest_id=-128873&dest_type=city&\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/searchresults.html?city=-128873&\", \"text\": \"\"}, {\"link\": \"https://www.booking.com/city/it/santo-stefano-di-sessanio.html\", \"text\": \"Mobile version\"}, {\"link\": \"https://www.booking.com/destination/city/it/santo-stefano-di-sessanio.html\", \"text\": \"\\n\"}]"
}