{
    "summary": "Français\n\n  * Our philosophy\n  * Boutique hotels and B&B\n    * ABRUZZO - MOLISE\n    * CAMPANIA\n    * EMILIA-ROMAGNA\n    * LAZIO\n    * MARCHE\n    * UMBRIA\n    * PUGLIA - BASILICATA\n    * SARDINIA\n    * SICILY\n  * Villas and rentals\n    * CAMPANIA\n    * LOMBARDY\n    * UMBRIA\n    * SARDINIA\n    * SICILY\n    * TUSCANY\n  * Tailor-made tours\n    * TAILOR-MADE CIRCUITS\n    * EXCURSIONS AND ACTIVITIES\n  * Destinations\n    * CAMPANIA\n    * EMILIA-ROMAGNA\n    * LAZIO\n    * MARCHE\n    * UMBRIA\n    * PUGLIA\n    * SARDINIA\n    * SICILY\n  * Contact\n\n  *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   * \n\nCall us  \n+33 3 66 72 26 31\n\n> ## A luxuriously revisited return to the past for travelers seeking calm and\n> a change of scenery\n\nDescription Location Fares Restaurant Feedback\n\n# Albergo diffuso Santo Stefano di Sessanio - Ref: SXT\n\n##  A country road winds its way up through beautiful hillside landscapes and\nleads you to the fortified village of Santo Stefano di Sessanio. Located in\nthe moutains of Abruzzo at 1250m above sea level, inside the Gran Sasso and\nMonti delle Laga national park, this medieval town is a classic example of an\nItalian medieval hill town with perimeter walls encircling houses and squares.  \nThe \"Albergo diffuso\" is a culturally historical project which breathes life\ninto the forgotten places and people of Abruzzo while preserving the historic\ncharacter of the buildings and retaining its soul. Over 10 years of study and\nresearch have been necessary to bring back to life the customs of the\ninhabitants, their culinary habits, their crafts and to recreate a true life\nexperience of living there hundreds years ago. The result is of unmatched\nbeauty, an unforgettable experience for the traveler.  \nThis boutique hotel is unique in its kind with 28 rooms spread over different\nhouses of the town restored with the utmost care using materials salvaged from\nthis century-old place, from the ground to furniture and textiles, authentic\nitems from the Abruzzo Mountains. Antique furniture, traditional handcrafts\nperfectly combined with design elements are reflected in the decoration of\neach room: natural colours, woolen mattresses, dim light, handmade bedspreads\nwoven on traditional looms.  \nThe spacious and comfortable rooms are equipped with private bathroom (bath or\nshower), quality bedding, fire place, hairdryer, underfloor heating.\nTraditional liquors and mineral water are complimentary. This boutique hotel\noffers you an intimate and exclusive stay to experience the traditions and\nspirit of ancient rural life without renouncing to comfort and high quality\nstandards. Each room shares a living/dining room with other rooms of the\nbuilding.  \nA delicious buffet breakfast is served in the dining room of one of the houses\nin the village. Fresh products and local producers are a must. An address to\ndiscover all year round offering an original and high quality alternative to\nstaying in a traditional hotel.  \nThe hotel enjoys a perfect location to discover the national park of Gran\nsasso, its historic, cultural and archeological heritage, its biodiversity and\nunspoiled nature, its handcrafts and enogastronomic traditions. Many\nactivities are organised on site. With a noble and well defined heritage, the\nvillage of Santo Stefano offers a pleasant atmosphere and spectacular views on\nthe contrasting landscapes of Gran Sasso.\n\n###  Key facts\n\nAbsolute peace • Comfort • Regional cuisine • Unique concept • All year round\nactivities • Panoramic views over the mountains and valleys •\n\nDo you want to book this accommodation or get more information?  \nContact us\n\nCATEGORY:  \nAlbergo diffuso\n\nACCESS:  \nRome - 228km  \nPescara - 84km  \n×\n\nSPOKEN LANGUAGES:  \n\nINCLUDED SERVICES:\n\nEXTRA SERVICES:\n\nACTIVITIES:  \n\n  * Bread making\n  * Oeno-bike tour in english\n  * Weaving lessons\n  * Canoeing on the Tirino\n  * Hiking\n  * Herbal tea lounge\n\n##  TAILOR MADE PROPOSALS\n\n###  You want to stay in this hotel and add other stops to visit the region of\nAbruzzo or explore other regions of Italy?  \nContact us for a tailor-made proposal.\n\nREQUEST A TAILORMADE ITINERARY __+33 3 66 72 26 31\n\n## Hote-Italia is an agency specializing in central and southern Italy.\n\n### For over 10 years we've been traveling in Italy to find unique and\ncharming lodgings, meet their owners, enjoy a great hospitality and visit each\nregion to propose you the best itineraries. Our customers are sure to come\nback not only with a memorable souvenir but also with and an enriching\ncultural experience.\n\n### LOCATION\n\n###  VISITS\n\nHiking or skiing in the Gran Sasso National Park • 9km Rocca Calascio fortress\n• 26km Cistercian abbey of S.Felice d´Ocre • 26km Abbey of Bominaco • 28km\nl´Aquila • the medieval boroughs of the land of the barons •\n\n### Restaurant\n\nAuthentic and rustic\n\nThe restaurant located in one of the houses in the village is dominated by two\nlarge stone arches and a central fireplace. The interior is primitive, minimal\nwith antique dark wooden, furniture. All fodd is based on what should have\nbeen available and eaten back then. Native, locally grown crops are used to\nrecreate original recipes from Abruzzo.\n\n### FARES 2024 AND BOOKING\n\nOPEN FROM 01/01/2024 TO 31/12/2024\n\nDouble classic\n\n150€ to 290€/per night\n\nbreakfast included\n\nDouble superior\n\n200€ to 390€/per night\n\nbreakfast included\n\nSuite × 2\n\n260€ to 650€/per night\n\nbreakfast included\n\nExecutive Suite × 4\n\n310€ to 850€/per night\n\nbreakfast included\n\nGeneral information\n\nIndicative prices calculated on a 2 person basis unless otherwise stated\n\nHighest rates are intended for peak season periods\n\nWe advise you to book in advance your dinner at the restaurant la Locanda\nsotto gli Archi. This booking can be done directly with the hotel\n\n### CUSTOMERS FEEDBACK\n\n  *   *   *   * \n\n> _ F_\n>\n> Francois, Besançon\n>\n> Superbe et conforme à notre imaginaire tout à été parfait le choix des deux\n> hôtels si différents a été parfait.\n>\n> June 2023\n\n> _ M_\n>\n> Michel, Ivry sur Seine\n>\n> Hotel extrêmement agréable, à la configuration originale (chambres,\n> restaurant, bar et réception de l'hôtel éparpillés dans divers bâtiments du\n> village). Restaurant de l'hôtel de très bonne qualité.\n>\n> August 2022\n\n> _ O_\n>\n> Odile, Lille\n>\n> EXTRAORDINAIRE - Une restauration des maisons fidèle à l'esprit de la région\n> et intelligente. Avez-vous apprécié nos conseils pour le choix des hôtels\n> réservés? : Merci à HOTE ITALIA de me faire découvrir l'Italie de cette\n> manière. Je réserve les yeux fermés tant j'ai pu apprécier votre bon goût,\n> votre sérieux, votre honnêteté. J'ai découvert les Abruzzes grâce à vous !\n> Les paysages sont magnifiques les villages de montagne, les lacs, la\n> floraison, des endroits qui respirent la sérénité... et l'hôtel une\n> MERVEILLE.... Le petit déjeuner composé de pain frais, de confiture faite\n> maison, de miel, de fromage de montagne, les pâtisseries différentes chaque\n> matin.... Votre collaboration avec les propriétaires qui est perceptible est\n> un atout certain. Un GRAND MERCI et à très bientôt.\n>\n> May 2016\n\n> _ V_\n>\n> Virginie, Marcq en Baroeul\n>\n> Nous avons beaucoup apprécié \"ce retour en arrière\"allié à un confort\n> actuel, la restauration de cet hébergement est tout-à-fait réussie dans un\n> cadre exceptionnel de sérénité. Une mention particulière pour la qualité du\n> petit déjeuner, ainsi que pour les produits de toilette faits artisanalement\n> que l'on peut retrouver dans la boutique. Avez-vous apprécié nos conseils\n> pour le choix des hôtels réservés? : Nous avons été particulièrement\n> sensibles à la disponibilité de Blandine qui a répondu à toutes nos\n> interrogations.\n>\n> May 2016\n\n##  WHAT TO DO IN ABRUZZO?\n\nDiscover all activities and excursions in Abruzzo\n\n##  USEFUL INFORMATION\n\nFind information, hint and tips for your journey in Abruzzo\n\n## WHY BOOK WITH HOTE ITALIA?\n\n__\n\nHand-picked selection\n\n## We have visited every single place\n\nWe have personally visited every single hotel listed to make sure that they\nfully meet our criterias of charm, authenticity, comfort and sustainable\ntourism.\n\nRead more about our philosophy...\n\n__\n\nTailor-made itineraries\n\n## We offer a personalized service\n\nWhatever your budget and your wishes, we create tailormade itineraries you\nwouldn’t have thought of. Plus we optimize your trip so that you travel with a\nfree mind, have time for the unpredictable and enjoy every moment of your\nstay.\n\n__\n\nA singular experience\n\n## We propose a different way of travel\n\nYour experience of slow travel starts in our hotels. The only way for us to\nunderstand your expectations and wishes is to have a word with you.\n\n__\n\nBooking service\n\n## We save your time\n\nWe manage everything for you and alleviate the overwhelming hassles associated\nwith itinerary preparations and availability of the hotels.\n\nHOTE-ITALIA\n\nAbout us\n\nContact us\n\nREGIONS\n\nAbruzzo - Molise\n\nCampania\n\nEmilia-romagna\n\nLazio\n\nMarche\n\nUmbria\n\nPuglia - Basilicata\n\nSardinia\n\nSicily\n\nNEWSLETTER Subscribe to our newsletter to receive our travel inspirations\n\n|\n\n|\n\n|  \n  \n---|---|---|---  \n  \nSOCIAL\n\nCONTACTS\n\n**Telephone :** +33 3 66 72 26 31\n\n**E-mail :** info@hote-italia.com\n\n* * *\n\nBooking fees |  Legal information | Terms and conditions  | Copyright ® 2024\nHote Italia\n\n",
    "links": "[]"
}