{
    "summary": "## Menu\n\nCall us on 1 800 464 2040\n\nJoin the Club Sign in\n\n  *     * Hotels\n    * Villas\n    * Offers\n    * Honeymoons\n    * Inspiration\n    * Destinations\n    * Family\n    * Editorial\n    * Gift shop\n\nSearch\n\nCheck-in\n\nCheck-out\n\nAdults\n\nChild\n\nSearch\n\nAbruzzo, Italy\n\n# Sextantio Albergo Diffuso\n\nPrice per night from$306.78\n\n### Price information\n\nIf you haven’t entered any dates, the rate shown is provided directly by the\nhotel and represents the cheapest double room (including tax) available in the\nnext 60 days.\n\nPrices have been converted from the hotel’s local currency (EUR281.82), via\nopenexchangerates.org, using today’s exchange rate.\n\nPhotos\n\n  * Overview \n  * Photos \n  * Location \n  * Reviews \n  * Get a room \n\nStyle\n\nFortress conversion\n\nSetting\n\nScattered around Santo Stefano\n\nExplore\n\nMore hotels in Abruzzo More hotels in Italy\n\n**Sextantio Albergo Diffuso** is a brand new boutique concept: bits of the\nhotel are spread around a micro-village in the Italian Apennines. It’s a\nthrow-back to the Middle Ages, with craftwork made by villagers, restoration-\nrevived traditions and rustic simplicity maintaining the hilly hamlet’s\nmediaeval charm, but with modern luxury seamlessly incorporated.\n\n\n\n## Smith Extra\n\nGet this when you book through us:\n\nLocal liquors and cookies and snowshoe hire; members staying three nights or\nmore also get a herbal-tea tasting and several on-site discounts\n\n## Facilities\n\nPhotos\n\n## Need to know\n\n### Rooms\n\n27, including seven suites.\n\n### Check–Out\n\n11am, but flexible if there’s availability. Earliest check-in, 3pm.\n\n### Prices\n\nDouble rooms from £265.56 (€310), including tax at 10 per cent.\n\n### More details\n\nRates include Continental breakfast.\n\n### Also\n\nStake out the library: a place of wooden beams and painted ceilings, where you\ncan browse the odd ancient tome over afternoon tea.\n\n### At the hotel\n\nLibrary, free WiFi throughout. In rooms: minibar and artisan bath products.\n\n### Our favourite rooms\n\nPalazzo delle Logge overlooks the village square and the Medici gate. For\nviews out to the Apennines from the lounge and balcony, pick Casa sulle\nBotteghe. All the dimly lit and atmospheric rooms are minimalist and\nmediaeval, with working fireplaces, stone walls and wooden doors. The beds are\nhigh enough to fit a chamber pot beneath (there are real flushing toilets in\neach bedroom now) and have hand-stuffed woollen mattresses.\n\n### Packing tips\n\nDante and Petrarch verses to recite when the mediaeval mood takes over;\nmountain-friendly shoes and layers.\n\n### Also\n\nFor the less mobile, some of this rustic site's cobbled steps and grassy\nslopes might be tricky to navigate.\n\n### Pet‐friendly\n\nPets are allowed at no extra cost. Just let the hotel know when booking. See\nmore pet-friendly hotels in Abruzzo.\n\n### Children\n\nCots and extra beds are provided free. Babysitting with a local nanny costs\n€15 an hour (give a day’s notice).\n\n## Food and Drink\n\nPhotos\n\n### Top Table\n\nClose to the huge fireplace when the mountain temperature drops.\n\n### Dress Code\n\nHumble hemp and cotton to match the ancient earthen surroundings.\n\n### Hotel restaurant\n\nThe hotel's private dining room, Locanda Sotto gli Archi, serves Abruzzese\ncuisine in a rustic 16th-century building. Lunch and dinner must be arranged\nwith the hotel in advance, but it's worth thinking ahead if you want to try\ntheir traditional antipasti such as pork liver salami, prosciutto and the\nfreshest ricotta. The speciality pasta of the area is also rustled up in the\nkitchens: strips of chitarrini are made using a guitar-shaped tool to shape\nthe pasta sheets. A breakfast spread of home-made pastries, tarts and cakes is\nlaid out in the bar every morning.\n\n### Hotel bar\n\nHead to La Cantinone in the cosy wine cellar for aperitifs and antipasti. If\nthe local red doesn’t take your fancy, the digestifs will: try the bitter\nherb-based genziana, or the sweet cherry ratafia. There’s also the\nLiquorificio, where a selection of local liqueurs are offered, as well as\nbenches with digestifs dotted around the communal areas.\n\n### Last orders\n\nBreakfast from 8am until 10.30am. Lunch and dinner are available in the\nhotel's private dining room, but must be arranged in advance with the hotel.\nThe bar shuts at 11pm.\n\n### Room service\n\nNone.\n\n## Location\n\nPhotos\n\n##### Address\n\nSextantio Albergo Diffuso\n\nVia Principe Umberto\n\nSanto Stefano di Sessanio\n\n67020\n\nItaly\n\n### Planes\n\nThe nearest airport is Rome Ciampino, reached from the UK with Ryanair\n(www.ryanair.com). The hotel is around 120km away, roughly an hour and a half\nby car. The drive from Fuimicino should take around two hours.\n\n### Trains\n\nThe closest rail station is 25km away in L’Aquila. From here Trenitalia\n(www.trenitalia.com) operates services to other cities in Italy, via a change\nin Terni.\n\n### Automobiles\n\nSextantio Albergo Diffuso is in the middle of the Gran Sasso and Monti della\nLaga National Park, a 90-minute north-east drive from Rome. There’s free\nparking at the hotel.\n\n### Other\n\nThe hotel particularly recommend arriving by bus from Rome's Tiburtina\nstation.\n\n### Worth getting out of bed for\n\nThe hotel has a guide on hand to take guests birdwatching in the national\npark, with sightings of hawks, eagles and buzzards on offer. Bread-making\nclasses are available on demand; participants can learn how to use a wood-\nburning oven from the 16th century to make crisp pizza bases and fresh bread.\nThere are also classes revealing the secrets of Abruzzese cuisine.\n\n### Local restaurants\n\nTry **Tra le Braccia di Morfeo** (+39 (0)862 899110) for traditional dishes\nmade with regional ingredients in a setting that’s half-restaurant, half-\ngallery (with local craftwork for sale). **La Locanda sul Lago** (+39 (0)862\n899019; www.lalocandasullago.it) is a small inn at the bottom of the village,\nwith views of the lake and Santo Stefano and hearty mountain food, such as the\nregion’s classic lentil soup and lamb reared on a nearby plateau.\n\n## Reviews\n\nPhotos\n\n## Anonymous review\n\n### By Dan Vernon, Bafta bagger\n\nTwo or three times a month I create a romantic meal for Mrs Smith – a few\ncandles, a more-than-decent bottle of wine, and the best I can muster in the\nkitchen. It’s a way of shrugging off our day-to-day familiarity – but it has\nnever worked this well before. As I arrange the _culatello di Zibello_ on a\nplatter, Mrs Smith stands close, clutching her glass with a mischievous grin.\n‘Now, tell me,’ she says, once we’re seated and clinking glasses to our\nimpending trip. ‘What’s this Tantric sex hotel you’re taking me to?’\n\n‘Oh, it’s a surprise darling,’ I mutter. Taking a long sip of wine, I begin\nrummaging through my mind – in much the same way one tears up a hotel room\nwhen a passport goes missing – trying to work out where she might have got\nthis idea. Ah, it’s the name: Sextantio Albergo Diffuso. The hotel is in Santo\nStefano di Sessanio, a 16th-century village some 4,000 feet up in the\nmountains of Abruzzo. (Sextantio is in fact the Latin name for Sessanio.) This\neyrie is only 65 miles or so from Rome, but having departed the city late in\nthe afternoon – just in time to get caught up in rush hour – we arrive well\nafter 10pm, and we despair of finding a bite to eat. The only sign of life in\nthe village – a tight cluster of mediaeval houses crowned with a chess-rook\ntower – is a candlelit window. Peering in, we find ourselves greeted by a\nwaiter, the very charismatic Massimo, who has stayed up to welcome us with\nopen arms.\n\nUsing my feeble Italian, I order a snack. Next thing, a seemingly never-ending\nprocession of dishes is coming our way from the kitchen – seven courses in\nall. We weren’t that hungry, but how can I tactfully stem this flood of food?\nRemember the Monty Python sketch where John Cleese is a chef so offended he\nwhips out a machete while the maître d’ impales himself on the client’s fork?\nClearly the smartest thing to do is to keep on eating: why ruin dinner?\n\nAs for Mrs Smith, so far, so good. She is transported by the mediaeval dining\nroom, which has stout timbers crisscrossing the ceiling, thick, half-wagon-\nwheel arches, and a fireplace a man could stand in. (These, I think, are the\nmissing ingredients back home.) The wine is from a vineyard dating back to\nRoman times, and the food is so fresh it is practically still growing on our\nplates. The repast induces a glow that is further fanned by our bedroom, a\n12th-century stone grotto with a few mod cons, among them heated floorboards\nand a luxurious Philippe Starck bath. ‘And there’s not even a TV to break the\nspell,’ says Mrs Smith.\n\nIn Italian, albergo diffuso means a hotel that is scattered among a number of\nbuildings. In Sextantio’s case, the hotel rooms are individual houses, but\nthere’s more to it than that: the owner of the hotel, the Sextantio Company,\nhas more or less adopted Santo Stefano di Sessanio as an archaeological\nproject.\n\nAt one time, Santo Stefano was so prosperous from the wool trade that it\nprovided a quarter of the revenue of the Kingdom of the Two Sicilies. But when\nentrepreneur turned hotelier Daniele Kihlgren first came here, the village’s\npopulation was down to 70, its infrastructure crumbling fast. Kihlgren’s motto\nis ‘development without construction’, which means turning traditional houses\ninto accommodation without tarting them up, but also avoiding the sort of\nreverence for the past that would turn them into period sets. No luxury hotel\nguest really wants to go back to the 16th century, hence the Starck tub – an\ninspired touch. Kihlgren has also restored some of the public buildings and\nfurnished them in period style, and has concluded an agreement with the local\ncouncil to preserve the surrounding countryside against villa construction –\nwhich he calls an Italian first.\n\nBreakfast is served in the erstwhile house of the shepherd master, where we\nfind a table laid as though for a royal banquet: fresh ricotta and pecorino\ncheese, prosciutto, chorizo, homebaked cakes and frittata, with a roaring\nfireplace the perfect backdrop. Our days are happily spent getting lost in the\nvillage’s maze of alleys and walking through the _Campo Imperatore_ (alpine\nmeadows), where the only thing that breaks the silence is a cowbell or two.\nThere are a few small shops that sell local products: mountain cheese, massive\nloaves, salami, little jars of wild saffron, jam, honey and local liqueurs of\nplums and berries. At the tisaneria we sample infusions of blueberry and\nsaffron and nibble on lacy biscuits made in a waffle iron.\n\nDinner the second evening is at the inexpensive, family-run Tra le Braccia di\nMorfeo, where you can’t go wrong. The bruschetta in particular is in a league\nof its own. Ever tried mincing garlic and celery with olive oil, then\nspreading it on toast? I hate celery but this dish changed my mind – a\ndefinite contender for the menu back at Casa Smith. Mrs Smith is so enchanted\nwith the atmosphere that she forgets about the Tantra. Instead, she adopts a\nnew mantra: ‘When are we going back?’\n\n\n\n## You’ll also find Sextantio Albergo Diffuso in:\n\n  * Budget boutique hotels \n  * The best gourmet getaways \n  * Luxury dog & pet-friendly hotels \n  * Luxury countryside & rural retreat hotels \n\nPrice per night from $306.78\n\nBook now\n\nCall a Smith travel specialist on 1 800 464 2040\n\n  *   \nHere for  \nyou\n\n  *   \nSmith extras  \non arrival\n\n  *   \nBest-price  \nguarantee\n\n  *   \nPersonally  \nApproved hotels\n\n  *   \nExclusive  \noffers\n\n  *   \nNew finds  \nevery month\n\nAbout us\n\n  * Who we are\n  * Why book with us?\n  * Best-price guarantee\n  * Reviews from our members\n  * Sustainability\n  * Our in-house travel team\n  * Our jetsetting reviewers\n  * Contact us\n\nMr & Mrs Smith collections\n\n  * Beach hotels\n  * Spa hotels\n  * City break hotels\n  * Honeymoon hotels\n  * Child-friendly hotels\n  * Hotels with swimming pools\n  * Ski hotels\n  * Pet-friendly hotels\n\nOur top countries\n\n  * England\n  * Morocco\n  * Spain\n  * US\n  * Italy\n  * France\n  * Portugal\n  * Greece\n\nTop destinations\n\n  * Barcelona\n  * Southern France\n  * London\n  * Paris\n  * Tuscany\n  * New York\n  * The Cotswolds\n  * Marrakech\n\n  * Legal\n  * FAQs\n  * Press\n  * Agents\n  * Careers\n  * Gift cards\n\n\n\n  *   *   *   *   * \n\n© 2024 Smith Global Ltd – Boutique and luxury hotels and villas\n\n\n\n",
    "links": "[{\"link\": \"https://www.mrandmrssmith.com/\", \"text\": \"\"}, {\"link\": \"https://www.mrandmrssmith.com/basket\", \"text\": \"\"}, {\"link\": \"https://www.mrandmrssmith.com/luxury-hotels/sextantio-albergo-diffuso?s%5Btags%5D=hotel.name%3Asextantio-albergo-diffuso&s%5Bsort_field%5D=price&s%5Bsort_direction%5D=asc#property-overview\", \"text\": \"\\nOverview\\n\"}, {\"link\": \"https://www.mrandmrssmith.com/luxury-hotels/sextantio-albergo-diffuso?s%5Btags%5D=hotel.name%3Asextantio-albergo-diffuso&s%5Bsort_field%5D=price&s%5Bsort_direction%5D=asc#property-location\", \"text\": \"\\nLocation\\n\"}, {\"link\": \"https://www.mrandmrssmith.com/luxury-hotels/sextantio-albergo-diffuso?s%5Btags%5D=hotel.name%3Asextantio-albergo-diffuso&s%5Bsort_field%5D=price&s%5Bsort_direction%5D=asc#property-reviews\", \"text\": \"\\nReviews\\n\"}, {\"link\": \"https://www.mrandmrssmith.com/luxury-hotels/sextantio-albergo-diffuso/rooms?s%5Btags%5D=hotel.name%3Asextantio-albergo-diffuso&s%5Bsort_field%5D=price&s%5Bsort_direction%5D=asc#hotelroom-list-rooms-container\", \"text\": \"\\nGet a room\\n\"}, {\"link\": \"https://www.mrandmrssmith.com/luxury-hotels/sextantio-albergo-diffuso/rooms?s%5Btags%5D=hotel.name%3Asextantio-albergo-diffuso&s%5Bsort_field%5D=price&s%5Bsort_direction%5D=asc#hotelroom-list-rooms-container\", \"text\": \"Book now\"}, {\"link\": \"https://www.mrandmrssmith.com/our-travel-team\", \"text\": \"\"}, {\"link\": \"https://www.mrandmrssmith.com/search/best-free-smith-extras/hotels\", \"text\": \"\"}, {\"link\": \"https://www.mrandmrssmith.com/price-match\", \"text\": \"\"}, {\"link\": \"https://www.mrandmrssmith.com/about\", \"text\": \"\"}, {\"link\": \"https://www.mrandmrssmith.com/luxury-hotel-deals/best-exclusive-offers\", \"text\": \"\"}, {\"link\": \"https://www.mrandmrssmith.com/collections/new-hotels/hotels\", \"text\": \"\"}, {\"link\": \"https://www.mrandmrssmith.com/us/us/us/us/us/travel-team\", \"text\": \"Our in-house travel team\"}, {\"link\": \"https://www.mrandmrssmith.com/us/us/us/us/us/our-reviewers\", \"text\": \"Our jetsetting reviewers\"}, {\"link\": \"https://www.mrandmrssmith.com/us/us/us/us/us/contact\", \"text\": \"Contact us\"}]"
}