{
    "summary": "\n\n  * Apple\n  *     * Store\n\n    * Mac\n\n    * iPad\n\n    * iPhone\n\n    * Watch\n\n    * AirPods\n\n    * TV & Home\n\n    * Entertainment\n\n    * Accessories\n\n    * Support\n\n  *   * 0+\n\n\n\nApp Store Preview\n\nOpen the Mac App Store to buy and download apps.\n\n#  SHEIN - Shopping Online  12+\n\n##  Save money. Live in style!\n\n##  ROADGET BUSINESS PTE. LTD.\n\n###  Designed for iPad\n\n  * #1 in Shopping \n  *     * 4.6 • 1.1M Ratings\n\n  *     * Free\n\n## Screenshots\n\n  * iPad \n  * iPhone \n\n  *   *   *   *   *   *   *   * \n\n## Description\n\nEverything you love, now at your fingertips!\n\n  \n\nSHEIN is a fun and ultra-affordable online shopping platform. From fashion\napparel to home, beauty, accessories, shoes and pet, plus electronics, tools,\noffice and more, SHEIN is dedicated to meet all your needs in life. We'll keep\nyou in the loop with push notifications about new drops and more. You can also\nengage with other SHEIN lovers and in real time. With free shippings and free\nreturns policy, hope you have a pleasant journey in SHEIN!\n\n  \n\nInspire yourself with SHEIN right now!\n\n  \n\nSave you more\n\n\\- Get an extra 20% off on your first order\n\n\\- Free shipping & free returns (*conditions apply)\n\n\\- Daily Flash Sales: Score up to 80% off for countless items\n\n  \n\nWide selections\n\n\\- Fun, easy shopping with wide selections\n\n\\- Browse by New Arrivals, Trends, Category, Best Sellers and more\n\n  \n\nConsiderate services\n\n\\- Get first access to sale alerts and promotional discounts\n\n\\- Now accepting PayPal and major Credit Cards\n\n\\- Style now, pay later! Choose Afterpay to pay in 4 interest-free payments.\n\n\\- 24/7 Customer Service and Live Chat available\n\n  \n  \n\nContact us:\n\nURL: us.shein.com\n\nFacebook: www.facebook.com/sheinus/\n\nInstagram: www.instagram.com/shein_us/\n\nEmail: dispute@shein.com\n\nmore\n\n## What’s New\n\nVersion History\n\nMar 21, 2024\n\nVersion 10.6.6\n\nRecent updates:\n\n  \n\n1\\. We've fixed some issues and made performance improvements to provide you\nwith a better experience.\n\n  \n\n2\\. More surprises are waiting for you to explore on the SHEIN App!\n\n##  Ratings and Reviews\n\nSee All\n\n4.6 out of 5\n\n1.1M Ratings\n\n1.1M Ratings\n\nJuicy_Jen_916  ,  10/31/2022\n\n###  Absolutely Love SHEIN!!! I Highly recommend!\n\n> My 1st order I was a little skeptical that the quality would be very good\n> because the prices are almost too good to be true! But I figured it wasn’t\n> much money so if the clothes were bad quality I wasn’t loosing much. Then my\n> 1st order came and I was SHOCKED! The quality was WAY better than I\n> expected! I have continued to get many things from them and never once have\n> I gotten anything of bad quality. Every order has been exactly what was\n> pictured! I ended up getting my wedding dress from them! I was on a very\n> short time frame, and couldn’t get one sent from anyone but then in time. I\n> was still a bit worried cause hey, this is a dress for my wedding, not just\n> regular clothes. I payed a little (not much) extra for faster shipping and\n> it came, exactly as pictured, early and really good quality! Sense then I\n> have been hooked! I am always impressed with the quality, prices and short\n> time it takes to come! If you haven’t tried them, you deff should give them\n> a shot! Another thing I like is on almost all the clothes, people leave\n> reviews at them bottom, and most of the time they will take pictures with\n> the reviews. That way you get a better idea of what the clothes look like\n> and what they look like on other people, not just models. That always is\n> helpful in helping me make a decision! I Highly recommend SHEIN and LOVE\n> this app!\n>\n> more\n\nkaayyy23  ,  12/26/2022\n\n###  absolutely obsessed\n\n> i have been buying clothes from SheIn for almost 2 yrs now and out of the\n> 75+ items i've purchased i've only ever had sizing issues once & tbh once i\n> looked back at the size chart it was totally my mistake anyway lol. i had a\n> friend take all my measurements one day and the reality of shopping with\n> exact measurements so easily visible is delightful! the quality of the\n> clothes has shocked me - i used to buy $25+ tshirts from other retailers &\n> have had better luck with SheIn's $8 shirts lasting longer and holding up\n> better in the wash ! i have IBS and my weight always fluctuates & ilove the\n> fact that this sites clothes are so affordable because i'm able to stay\n> stylish at all my weights without breaking my pockets! i recently (finally)\n> gained 15lbs after YEARS of not being able to gain weight & replaced sooooo\n> many clothes in my wardrobe with SheIn ! my bf loves them & always\n> compliments my outfits & i've even had strangers compliment them too ! my\n> fav retailer hands down !!! the ONLY thing icould complain about is their\n> return policy - they only allow you free return for your first return and\n> any return after that they will deduct about $12 from the total spent on\n> that item & give you the difference as a credit or refund. again - with the\n> accuracy of the sizing chart , i've almost never had to return anything but\n> do wish it was free returns no matter what\n>\n> more\n\nvinarris  ,  01/05/2021\n\n###  LEGIT\n\n> 100% legit site for fashionable affordable clothing. I’ve been purchasing\n> for the last 2 years or more now with at least 20 + items each purchase and\n> have never been cheated or disappointed. Customer service has always been\n> above and beyond for me, they always get back to me and never had an issue\n> with returning items that didn’t fit (if they’re eligible for return, not\n> everything is but they tell you before checkout what isn’t) my closet is\n> about 85% SHEIN clothing and shoes and the rest mall bought clothing. I\n> prefer SHEIN over anything lately. Quality is usually amazing but be sure to\n> read reviews and picture reviews before purchasing. Once I found my size in\n> SHEIN it’s made shopping easier with less returns. Returns for US are free\n> (at least I’ve never paid for any) so that’s another plus. They’re usually\n> fast with shipping but with COVID I’ve been getting them like 3-4 weeks\n> later. Which is understandable given what’s going on. But once things are\n> back to normal it’s usually 1-2 weeks. I’ve only ever had 2 packages lost in\n> the mail due to COVID which they happily replaced, no problem and sent out\n> new for me. I did eventually end up getting the first “lost” packages\n> though. You never know until you give it a try for yourself. I’m definitely\n> glad I did. They except PAYPAL which is much more comforting when you’re a\n> new buyer, since they cover you. I love this app/store. 10+ stars.\n> Seriously.\n>\n> more\n\n##  Events\n\n###  HAPPENING NOW\n\nSPECIAL EVENT\n\n#SHEIN SS24\n\n##  App Privacy\n\nSee Details\n\nThe developer, ROADGET BUSINESS PTE. LTD., indicated that the app’s privacy\npractices may include handling of data as described below. For more\ninformation, see the developer’s privacy policy.\n\n### Data Used to Track You\n\nThe following data may be used to track you across apps and websites owned by\nother companies:\n\n  * Identifiers\n\n### Data Linked to You\n\nThe following data may be collected and linked to your identity:\n\n  * Purchases\n  * Financial Info\n  * Contact Info\n  * Identifiers\n  * Usage Data\n\n### Data Not Linked to You\n\nThe following data may be collected but it is not linked to your identity:\n\n  * Search History\n  * Usage Data\n  * Diagnostics\n\nPrivacy practices may vary, for example, based on the features you use or your\nage. Learn More\n\n## Information\n\nSeller\n\n     ROADGET BUSINESS PTE. LTD. \n\nSize\n\n    189.1 MB\n\nCategory\n\n     Shopping \n\nCompatibility\n\n    \n\niPhone\n\n    Requires iOS 12.2 or later. \n\niPad\n\n    Requires iPadOS 12.2 or later. \n\niPod touch\n\n    Requires iOS 12.2 or later. \n\nMac\n\n    Requires macOS 11.0 or later and a Mac with Apple M1 chip or later. \n\nApple Vision\n\n    Requires visionOS 1.0 or later. \n\nLanguages\n\n    \n\nEnglish, Arabic, Czech, Dutch, French, German, Greek, Hebrew, Indonesian,\nItalian, Japanese, Korean, Polish, Portuguese, Russian, Spanish, Swedish,\nThai, Traditional Chinese, Turkish, Vietnamese\n\nmore\n\nAge Rating\n\n     12+ Infrequent/Mild Profanity or Crude Humor Infrequent/Mild Sexual Content and Nudity\n\nCopyright\n\n    © SHEIN\n\nPrice\n\n    Free\n\n  * Developer Website \n  * App Support \n  * Privacy Policy \n\n  * Developer Website \n  * App Support \n  * Privacy Policy \n\n## Supports\n\n  * ###  Wallet \n\n####\n\nGet all of your passes, tickets, cards, and more in one place.\n\n##  More By This Developer\n\nROMWE - Ultimate Cyber Mall\n\nShopping\n\n##  You Might Also Like\n\nSee All\n\nFashion Nova\n\nShopping\n\nLovelyWholesale-Shopping\n\nShopping\n\nForever 21\n\nShopping\n\nCIDER - Clothing & Fashion\n\nShopping\n\nChic Me - Chic in command\n\nShopping\n\nRainbow Shops\n\nShopping\n\nMore ways to shop: Find an Apple Store or other retailer near you. Or call\n1-800-MY-APPLE.\n\nChoose your country or region\n\nCopyright © 2024 Apple Inc. All rights reserved.\n\n  * Privacy Policy\n  * Terms of Use\n  * Sales and Refunds\n  * Legal\n  * Site Map\n\n",
    "links": "[{\"link\": \"https://apps.apple.com/us/app/shein-shopping-online/id878577184?platform=ipad\", \"text\": \"\\n                  iPad\\n                \"}, {\"link\": \"https://apps.apple.com/us/app/shein-shopping-online/id878577184?platform=iphone\", \"text\": \"\\n                  iPhone\\n                \"}, {\"link\": \"https://apps.apple.com/us/app/shein-shopping-online/id878577184?see-all=reviews\", \"text\": \"\\n     See All\\n   \"}, {\"link\": \"https://apps.apple.com/us/app/shein-shopping-online/id878577184?eventid=6478861148\", \"text\": \"\"}, {\"link\": \"https://apps.apple.com/us/app/shein-shopping-online/id878577184?see-all=customers-also-bought-apps\", \"text\": \"\\n     See All\\n   \"}]"
}