{
    "summary": "Skip to main content\n\nAn official website of the United States government\n\nHere’s how you know\n\nHere's how you know\n\n**The .gov means it’s official.**  \nFederal government websites often end in .gov or .mil. Before sharing\nsensitive information, make sure you’re on a federal government site.\n\n**The site is secure.**  \nThe **https://** ensures that you are connecting to the official website and\nthat any information you provide is encrypted and transmitted securely.\n\n  * Español\n\n  * Report Fraud\n  * Read Consumer Alerts\n  * Get Consumer Alerts\n  * Visit ftc.gov\n\n_ _\n\nMenu\n\n## CFG: Main Menu Mega\n\n  * Show/hide Shopping and Donating menu items\n\n## Shopping and Donating\n\nMake smart shopping decisions, know your rights, and solve problems when you\nshop or donate to charity.\n\nView Shopping and Donating\n\n## Video\n\n## Topics\n\n## Topics\n\n    * Shopping\n    * For the Home\n    * Health\n    * Funerals\n    * Buying and Owning a Car\n    * Donating to Charity\n\n## Consumer Alerts\n\n###  Refunds for Benefytt customers who paid for health plans and products\n\nMarch 18, 2024\n\nGema de las Heras\n\nDid you pay Benefytt, which also did business as “MyBenefitsKeeper,” for a\nhealth plan or product that didn’t deliver the comprehensive insurance\ncoverage the company promised? You might be getting some of your money back.\n\nView all Consumer Alerts\n\nGet Consumer Alerts\n\n  * Show/hide Credit, Loans, and Debt menu items\n\n## Credit, Loans, and Debt\n\nLearn about getting and using credit, borrowing money, and managing debt.\n\nView Credit, Loans, and Debt\n\n## Video\n\n## Topics\n\n## Topics\n\n    * Credit and Debt\n    * Loans and Mortgages\n\n## Consumer Alerts\n\n###  Paycheck Protection Program lender pays the price for lying about loan\nprocessing times\n\nMarch 18, 2024\n\nColleen Tressler\n\nDelays in processing loans needed by small businesses in an emergency — like\nthe pandemic — can leave them struggling to stay open. And deceiving consumers\nabout these delays violates the law. The FTC says that's what happened when\nsmall businesses applied for emergency Paycheck Protection Program loans from\nBiz2Credit Inc.\n\nView all Consumer Alerts\n\nGet Consumer Alerts\n\n  * Show/hide Jobs and Making Money menu items\n\n## Jobs and Making Money\n\nWhat to know when you're looking for a job or more education, or considering a\nmoney-making opportunity or investment.\n\nView Jobs and Making Money\n\n## Video\n\n## Topics\n\n## Topics\n\n    * Money-Making Opportunities and Investments\n    * Jobs\n    * Education and Training\n\n## Consumer Alerts\n\n###  Job scams targeting college students are getting personal\n\nDecember 27, 2023\n\nLesley Fair\n\nIf you’ll be seeing college-age relatives over the holidays, warn them about a\nvariation on the “job interview” scam that students looking for summer or\npermanent employment have reported to us.\n\nView all Consumer Alerts\n\nGet Consumer Alerts\n\n  * Show/hide Unwanted Calls, Emails, and Texts menu items\n\n## Unwanted Calls, Emails, and Texts\n\nWhat to do about unwanted calls, emails, and text messages that can be\nannoying, might be illegal, and are probably scams.\n\nView Unwanted Calls, Emails, and Texts\n\n## Video\n\n## Topics\n\n## Topics\n\n    * Unwanted Calls\n    * Unwanted Emails, Texts, and Mail\n\n## Consumer Alerts\n\n###  Fake shipping notification emails and text messages: What you need to\nknow this holiday season\n\nDecember 14, 2023\n\nAlvaro Puig\n\nWhen you order something online, you might get several emails or text messages\nabout your order: Confirming your order. Telling you it shipped. Saying it's\nout for delivery. Notifying you about delivery. Did you know that scammers\nsend fake package shipment and delivery notifications to try to steal people's\npersonal information — not just at the holidays, but all year long? Here's\nwhat you need to know to protect yourself from these scams.\n\nView all Consumer Alerts\n\nGet Consumer Alerts\n\n  * Show/hide Identity Theft and Online Security menu items\n\n## Identity Theft and Online Security\n\nHow to protect your personal information and privacy, stay safe online, and\nhelp your kids do the same.\n\nView Identity Theft and Online Security\n\n## Video\n\n## Topics\n\n## Topics\n\n    * Identity Theft\n    * Online Privacy and Security\n    * Protecting Kids Online\n\n## Consumer Alerts\n\n###  Fake shipping notification emails and text messages: What you need to\nknow this holiday season\n\nDecember 14, 2023\n\nAlvaro Puig\n\nWhen you order something online, you might get several emails or text messages\nabout your order: Confirming your order. Telling you it shipped. Saying it's\nout for delivery. Notifying you about delivery. Did you know that scammers\nsend fake package shipment and delivery notifications to try to steal people's\npersonal information — not just at the holidays, but all year long? Here's\nwhat you need to know to protect yourself from these scams.\n\nView all Consumer Alerts\n\nGet Consumer Alerts\n\n  * Scams\n  * Search Show/hide Search menu items\n\nItems per page\n\n20 50 100\n\nFilters\n\nFulltext search\n\n  * Español\n\n  * Report Fraud\n  * Read Consumer Alerts\n  * Get Consumer Alerts\n  * Visit ftc.gov\n\n## CFG: Main Navigation\n\n  * Shopping and Donating Show/hide Shopping and Donating menu items\n    * Shopping\n    * For the Home\n    * Health\n    * Funerals\n    * Buying and Owning a Car\n    * Donating to Charity\n  * Credit, Loans, and Debt Show/hide Credit, Loans, and Debt menu items\n    * Credit and Debt\n    * Loans and Mortgages\n  * Jobs and Making Money Show/hide Jobs and Making Money menu items\n    * Money-Making Opportunities and Investments\n    * Jobs\n    * Education and Training\n  * Unwanted Calls, Emails, and Texts Show/hide Unwanted Calls, Emails, and Texts menu items\n    * Unwanted Calls\n    * Unwanted Emails, Texts, and Mail\n  * Identity Theft and Online Security Show/hide Identity Theft and Online Security menu items\n    * Identity Theft\n    * Online Privacy and Security\n    * Protecting Kids Online\n  * Scams Show/hide Scams menu items\n    * Gift Card Scams\n    * Government and Business Impersonators\n    * Phone Scams\n    * Romance Scams\n    * Scams Against Immigrants\n    * Scams Against Older Adults\n    * Scams Against Small Businesses\n    * Wire Transfer Scams\n\nItems per page\n\n20 50 100\n\nFilters\n\nFulltext search\n\n## Breadcrumb\n\n  1. Home\n  2. Articles\n\nVea esta página en español\n\nArticle\n\n# Online Shopping\n\nBefore you buy something online, shop around and check out sellers and\nproducts. Also, keep records of purchases, like receipts and emails, to make\nsure you’re able to hold a seller to its promises.\n\n  * Learn About Sellers and Products\n  * Comparison Shopping\n  * Delivery, Return, and Refund Policies\n  * Pay by Credit Card When Possible\n  * Keep Records\n  * Know What Personal Information the Site or App Collects\n  * Report Problems\n\n## Learn About Sellers and Products\n\n### Read reviews with a critical eye\n\nExpert reviews from trusted websites are a good place to get information about\nwhat to buy and who to hire. Focus on sites you trust that offer impartial\nreviews from real experts.\n\nRead customer reviews about a company or product from a wide variety of review\nand retailer sites, search engines, app stores, and social media platforms.\nCheck several sources and consider where a review is posted, who wrote the\nreview, and the reviewer’s history. And don’t rely on star ratings alone\nbecause some reviews and ratings are fake or misleading. Fake reviews can be\npositive or negative. Not all fake positive reviews are five stars. Some\ndishonest competitors place fake negative reviews. Also, it’s not always clear\nif a reviewer got something, like a free product, in exchange for writing a\nreview. Some — but not all — websites will place a label or badge next to the\nreview when they know that the reviewer got an incentive.\n\n### Find out other people’s experiences\n\nSearch online for the product or company name, plus the words “complaint” or\n“scam.” See what other people are saying about their experience.\n\n## Comparison Shopping\n\nTo comparison shop for a product, make notes of the item’s manufacturer or\nmodel number, plus details like size, color, or shipping fees. Use the\ninformation to check comparison shopping sites that list retail stores and\nonline sellers that have the item. Some sites let you sign up to get price\nalerts when prices change.\n\nNot all comparison shopping sites are the same. Sometimes manufacturers set up\nsites to promote their own products. Or some companies run sites that only\nlist or rank products if sellers pay them. Focus on comparison shopping sites\nthat are well known and trustworthy.\n\n### How to comparison shop\n\n  * Learn the total cost of the product, including shipping, handling, delivery, taxes, or other fees.\n  * Read the terms of the advertised “deal.” For example, will you have to buy unwanted products to get the advertised “low price”?\n  * Read the entire product description, including the fine print. Words like \"refurbished,\" \"vintage,\" or \"close-out\" could mean a product is in less-than-perfect condition. If expensive brand-name items are offered for bargain prices, they could be counterfeit or stolen.\n  * See if a seller has a price-matching policy that guarantees it will match competitors’ prices and match its own in-store price to its online prices. Contact a seller if you want to request a match. Some sellers match or even go lower than their own online prices or a competitor’s prices.\n\nFind out if you’ll be able to get a credit or refund if the item you buy today\ngoes on sale next week. What records or receipts will you need?\n\n## Delivery, Return, and Refund Policies\n\n### Read the seller’s information about shipping and delivery\n\nAn FTC rule requires sellers to ship items as they promised in their ads. If a\nseller doesn’t promise a time, it has to ship your order within 30 days after\nit gets your name, address, and payment, or permission to charge your account.\nMany sites offer tracking options that let you see exactly where your purchase\nis and estimate when you’ll get it. If you pay by credit card but don’t get\nthe item, dispute the charge.\n\n### Check the seller’s refund policies\n\nThe site must say whether you’re able to return the item for a full refund.\nBefore you return an item, find out\n\n  * who pays the shipping costs for returns?\n  * how many days do you have to return the item?\n  * will you have to pay restocking fees?\n\n### Check refund policies for sale items\n\nIf you buy things on sale, doublecheck the return policies. Sellers often have\ndifferent refund and return policies for sale items, especially clearance\nmerchandise.\n\n## Pay by Credit Card When Possible\n\nPaying by credit card best protects you and your money in case of a scam, or\nif something else goes wrong. Make sure the websites where you enter payment\ninformation use encryption to protect your information during your\ntransaction. Look for https at the beginning of the URL. The ‘s’ after http\nmeans the site is encrypted — but it doesn’t mean it’s a legitimate site.\nScammers know how to encrypt sites, too.\n\nIf you pay by credit card and are charged twice for the same item, are billed\nfor merchandise you never got, or get the wrong item or a defective item,\nyou’ll be able to dispute the charge. In those situations, ask your credit\ncard company to temporarily withhold payment while it investigates. To take\nadvantage of this right, call immediately and send a letter to your credit\ncard company that reaches the company within 60 days of the day the company\nmailed you the first bill showing the error.\n\n> **Never  **buy anything from online sellers that insist you can only pay\n> with gift cards, by wire transfers through companies like Western Union or\n> MoneyGram, with a payment app, or with cryptocurrency. Scammers will often\n> ask you to pay in a way that makes it hard for you to get your money back.\n> Find out what to do if you sent money to a scammer.\n\n## Keep Records\n\nWhen you buy something online, be sure to keep information about\n\n  * the company name and website\n  * what you ordered, the date you ordered it, and what you paid\n  * the seller’s return policy\n  * the company’s promise to ship, and the date it made the promise\n  * all email, text, and other communication you have with the company\n  * your credit card or bank account statements that show how you paid\n\n## Know What Personal Information the Site or App Collects\n\nWebsites and shopping apps often ask for personal information like your name,\nmailing address, phone number, and email. They also may collect information\nabout the things you buy, including how much you paid, along with when, where,\nand how you paid. They may sell the information to other companies, like data\nbrokers, who may combine it other personal data to develop a detailed profile\nabout you and sell it to other businesses.\n\nMany shopping apps rely on location data. For example, some apps collect\ninformation about your location to tell you whether an item is available at a\nstore near you. If you don’t want the app to track your location, use your\nphone’s privacy settings to control whether the app collects your location.\n\nBefore you use an app or website, also make sure you’re okay with how your\ninformation is used, shared, and protected. If you’re not, consider going to a\ndifferent website or look for another app.\n\nTo find out what personal information a website or an app collects, look at\nthe privacy policy, User Agreement, or Terms of Service. Look for information\nabout what the app developer will do with your data and how it will keep it\nsecure.\n\n## Report Problems\n\nIf you have a problem when you shop online, try to work it out directly with\nthe seller or site owner. If that doesn't work, tell the FTC at\nReportFraud.ftc.gov.\n\nSearch Terms\n\nonline security\n\nsaving money\n\nshopping\n\nTopics\n\nShopping and Donating\n\nShopping\n\nSeptember 2022\n\nReturn to top\n\n_ _\n\nMenu\n\n## CFG: Footer Menu\n\n  * Feature Pages\n  * Articles\n  * Consumer Alerts\n  * Videos\n\n## CFG: Footer Menu Right\n\n  * Report Fraud\n  * Get Consumer Alerts\n\n## CFG: Footer\n\n  * ftc.gov\n  * About Us\n  * Contact Us\n  * Privacy and Notices\n  * FOIA\n  * Office of Inspector General\n\n(link is external)\n\n(link is external)\n\n(link is external)\n\n✓\n\nThanks for sharing!\n\nAddToAny\n\nMore…\n\n",
    "links": "[{\"link\": \"https://consumer.ftc.gov/shopping-and-donating\", \"text\": \"View Shopping and Donating\"}, {\"link\": \"https://consumer.ftc.gov/consumer-alerts\", \"text\": \"View all Consumer Alerts\"}, {\"link\": \"https://consumer.ftc.gov/credit-loans-and-debt\", \"text\": \"View Credit, Loans, and Debt\"}, {\"link\": \"https://consumer.ftc.gov/consumer-alerts\", \"text\": \"View all Consumer Alerts\"}, {\"link\": \"https://consumer.ftc.gov/jobs-and-making-money\", \"text\": \"View Jobs and Making Money\"}, {\"link\": \"https://consumer.ftc.gov/consumer-alerts\", \"text\": \"View all Consumer Alerts\"}, {\"link\": \"https://consumer.ftc.gov/unwanted-calls-emails-and-texts\", \"text\": \"View Unwanted Calls, Emails, and Texts\"}, {\"link\": \"https://consumer.ftc.gov/consumer-alerts\", \"text\": \"View all Consumer Alerts\"}, {\"link\": \"https://consumer.ftc.gov/identity-theft-and-online-security\", \"text\": \"View Identity Theft and Online Security\"}, {\"link\": \"https://consumer.ftc.gov/consumer-alerts\", \"text\": \"View all Consumer Alerts\"}, {\"link\": \"https://consumer.ftc.gov/search\", \"text\": \"Search\"}, {\"link\": \"https://consumer.ftc.gov/identity-theft-online-security\", \"text\": \"\"}, {\"link\": \"https://consumer.ftc.gov/government-business-impersonators\", \"text\": \"\"}, {\"link\": \"https://consumer.ftc.gov/#facebook\", \"text\": \"\"}, {\"link\": \"https://consumer.ftc.gov/#twitter\", \"text\": \"\"}, {\"link\": \"https://consumer.ftc.gov/#linkedin\", \"text\": \"\"}, {\"link\": \"https://consumer.ftc.gov/about-us\", \"text\": \"About Us\"}, {\"link\": \"https://consumer.ftc.gov/news-events/stay-connected#RSS\", \"text\": \"\"}]"
}