{
    "summary": "  * Skip to primary navigation\n  * Skip to main content\n  * Skip to footer\n\nCROOKS LAW\n\n  * Home\n  * Attorneys Submenu\n    * Attorney Robyn J. De Vos\n    * Attorney David G. Casey\n    * Attorney Kristen E. Lonergan\n    * Attorney Tara M. Guelzow\n  * About Us\n  * Practice Areas Submenu\n    * Business Law\n    * Civil Litigation\n    * Criminal Defense\n    * Estate Planning & Probate\n    * Family & Divorce Law\n    * Personal Injury\n    * Real Estate\n  * Blog\n  * Testimonials\n  * Contact\n\n## Personal Injury\n\nRequest a Consultation\n\n**If you have been injured in an accident in Marathon County or elsewhere in\nNorth Central Wisconsin, our attorneys can help you seek rightful compensation\nfor your medical bill and other losses. Contact us today for a free\nconsultation.**\n\n## Dedicated Wausau, WI Personal Injury Attorneys\n\nA serious accident can change your life in an instant. From medical bills and\nthe interference with your daily routine to the long-term physical and\nemotional effects, accident-related injuries can touch almost every aspect of\nyour life. If you are suffering and someone else is to blame, you deserve to\nbe compensated for your losses.\n\nWe provide experienced and aggressive legal representation for accident\nvictims in Marathon County and throughout North Central Wisconsin. If you have\nbeen injured in an accident caused by someone else’s negligence, our attorneys\ncan help you fight to recover maximum compensation for your losses. The\ninsurance companies put their interests first and have defense lawyers who\nwill be fighting to make sure that you receive as little as possible. To\nprotect yourself, you need a trusted advocate on your side.\n\n## Cases We Handle\n\nOur attorneys represent clients who have suffered injuries in all types of\naccidents in North Central Wisconsin. The types of personal injury cases that\nwe handle include, **but are not limited to:**\n\n  * Auto accidents (including distracted driving and drunk driving collisions)\n  * Slips and falls\n  * Dog bites\n  * Medical mistakes\n\n## Compensation Available to Personal Injury Victims in Wisconsin\n\nDepending on the extent of your injuries, you could be entitled to significant\nfinancial compensation, as a result of your accident. Many people do not\nrealize the full extent of their losses, and they unfortunately end up bearing\nthe financial burden, as well as the physical and emotional tolls of someone\nelse’s mistake.\n\nIf you were injured in an accident where someone else was fully or partially\nat-fault, we may be able to help you recover financial compensation for your:\n\n  * Medical bills\n  * Future medical, therapy and rehabilitation costs\n  * Lost income and lost future earning capacity\n  * Pain and suffering\n  * Emotional distress\n  * Loss of enjoyment of life\n  * Loss of spousal relations, support, care, and companionship\n\nWhen you contact us about your case, we will conduct a thorough investigation\nin order to determine the full extent of your losses so that we can seek the\nlargest possible settlement. If a fair settlement isn’t on the table, we will\ngo to court to protect your legal rights.\n\n## Steps to Take After an Accident\n\nThere are a number of important steps that individuals should take after being\ninjured in an accident. When you contact us, our attorneys will walk you\nthrough everything that you need to do, in order to preserve your claim for\ncompensation.\n\nAfter an accident in North Central Wisconsin, you should:\n\n### 1\\. Seek prompt medical attention.\n\nSee a doctor, even if you think that you feel fine. Many accident victims do\nnot experience symptoms immediately, and seeking prompt medical attention will\nbe important to your personal injury claim.\n\n### 2\\. Take photos.\n\nIf you are able, take photos of everything possible. This includes the\nlocation where you were injured, vehicle damage (in the case of a car\naccident), damage to your clothes, and your physical injuries.\n\n### 3\\. Talk to witnesses.\n\nTry to collect contact information from any witnesses at the scene of the\naccident. These individuals may be able to provide important information to\nassist in your claim for compensation.\n\n### 4\\. Write down everything that you remember.\n\nWrite down everything that you can remember. No detail is too small, and\ntaking notes now can help you remember what happened, should you need to\ntestify in the future.\n\n### 5\\. Avoid giving statements to the insurance companies.\n\nThe insurance companies will most likely ask you to make recorded statements.\nYou want to avoid doing so until you speak with an attorney.\n\n## No Fee Unless You Win\n\nOur attorneys handle personal injury cases on a contingency-fee basis. This\nmeans that you do not pay any legal fees, unless we help you secure financial\ncompensation. We are confident in our abilities, and won’t waste your time (or\ntake your money) if we don’t believe that you have a case. To find out if you\nhave a claim for compensation, request a free consultation today.\n\n## Schedule Your Free Consultation at Crooks Law Today\n\nIf you would like to speak with an attorney about your accident, call (715)\n842-2291 or request a free consultation online. We look forward to speaking\nwith you about your case.\n\n## Kristen E. Lonergan\n\nAttorney\n\nLearn more about Kristen\n\n* * *\n\n## Footer\n\nWe aim to deliver effective,  \nhigh-quality legal services in  \nan efficient, personable, and reliable manner.\n\nCROOKS LAW FIRM S.C.  \n531 Washington Street  \nWausau, Wisconsin 54403  \nPhone: 1-715-842-2291\n\nCopyright © 2024 · Crooks Law Firm S.C. · Log in\n\nRequest Consultation\n\nName\n\nFirst\n\nEmail\n\nPhone\n\nMessage\n\n×\n\nNotifications\n\n",
    "links": "[{\"link\": \"https://crooks-law.com/personal-injury/\", \"text\": \"Personal Injury\"}, {\"link\": \"https://crooks-law.com/contact\", \"text\": \"Request a Consultation\"}]"
}