{
    "summary": "×\n\n# Do You Need Immediate Assistance?\n\nAttorney Myska responds quickly to all emails for assistance. If you are\nuncertain of what your next step should be, contact us and we can walk you\nthrough it.\n\nREACH OUT NOW\n\n####  CALL US FOR A FREE CONSULTATION\n\n##### 715.842.2281    |   TOLL FREE: 800.452.8580\n\n\n\n  * Home\n  * About\n  * Our Team\n    * Jerome A. Maeder\n    * Bradley D. Myska\n    * Benjamin C Welch\n    * Alanie\n    * Kristen\n    * Ashlee\n    * McKinze\n  * Practice Areas\n  * FAQ\n  * Maeder Messages\n  * Contact Us\n\n  * Home\n  * About\n  * Our Team\n    * Jerome A. Maeder\n    * Bradley D. Myska\n    * Benjamin C Welch\n    * Alanie\n    * Kristen\n    * Ashlee\n    * McKinze\n  * Practice Areas\n  * FAQ\n  * Maeder Messages\n  * Contact Us\n\n> # Expert Personal Injury Attorney Law Firm in the Wausau Area\n\nThe Maeder Law firm has been running a successful law firm from the same\nWausau location for over 50 years, our lawyers have handled thousands of\ncases. We know what it takes to get full value for your injuries. The\ninsurance companies know we come prepared and won’t agree to a lowball\nsettlement.\n\nSCHEDULE YOUR FREE CONSULTATION\n\n# lawyers for the injured\n\n#### Practice Areas\n\nOur law firm will fight to get you and your family the maximum compensation\npossible.\n\nLearn More >>\n\n#### Why Use us?\n\nWe’re experienced with all types of injury cases and aren’t intimidated by\nanyone.\n\nLearn More >>\n\n#### Hire the right lawyer\n\nIf you don’t win we don’t get paid.\n\nLearn More >>\n\n## Get the legal help you deserve\n\n### from a top ranked attorney\n\n#### Have you been involved in an accident or suffering because of the\nnegligence or careless actions of someone else?\n\nThe experienced and highly acclaimed Wisconsin personal injury attorneys at\nJerome A. Maeder S.C. law firm will address your legal needs as they would for\ntheir own family — with the passion and dedication it takes to help rebuild\nyour life.\n\nWhen you’ve suffered a life-changing accident or injury, you need an accident\nattorney who will aggressively push for the justice you deserve. You deserve\nthe justice of a complete and full-financial recovery for your injuries and we\nwill make every effort to provide the high-quality legal counsel that you\nneed. You and your legal case will be handled with compassion, attention, and\nurgency. We will get to know you and your story, and treat you like family.\nYou are not passed over to some paralegal representative like most mega-office\nlaw firms. Instead, our attorneys work directly with you personally; handling\nyour case personally.\n\nDon’t settle for less. Get the experienced and highly acclaimed personal\ninjury attorneys from Jerome A. Maeder S.C. working on your behalf. To\nschedule an appointment to discuss your accident or injury, call us today.\nThe initial consultation is free.\n\nCall 715-842-2281\n\n# Our lawyers are commited to you\n\nThere are three basic commitments for how we serve our clients\n\n## 1\n\n#### Protection\n\nIt is our mission to protect you and your loved one’s legal rights.\n\n## 2\n\n#### Commitment\n\nWe are committed to keeping you informed about the progress and status of your\ncase.\n\n## 3\n\n#### Dedication\n\nWe work solely on a contingent fee basis, and we only get paid when we recover\nmoney on your behalf. If we do not recover a settlement or successful verdict\nfor you, you owe us nothing.\n\n# OUR FEATURED LEGAL SERVICES\n\n**Learn More >>**\n\n## Truck Accidents\n\nThe Maeder Legal Team has handled hundreds of truck accidents over the years\nin many different states.\n\n## Car Accidents\n\nCar accident damages can have a much greater impact on your life than just the\ndamage done to the vehicle, especially if the insurance company finds you to\nbe at fault. Get the firepower of our legal team on your side.\n\n## worker's compensation\n\nWork injuries have a major impact on our lives and the ability to provide for\nour families. This area of the law is confusing and the insurance company is\nnot going to look out for your best interest. Lost wages, medical expenses,\nand worries over the future are difficult problems that you do not want to\nface alone. We have successfully handled thousands of work injury claims and\nwe are ready to help you.\n\n## dog bites\n\nWisconsin’s law of ‘strict liability’ for dog bites is not as straightforward\nas it seems. It burdens the responisibility of ‘contributotry negligence’ on\nthe injured person.\n\n## Slip, Trip, or Fall Down Accidents\n\nSlip, trip, and fall down accidents are some of the most difficult cases to\nhandle. The insurance company will blame you for the accident. Many law firms\nrefuse to handle these difficult cases. The Maeder Legal Team routinely\nhandles these cases and we are successful in recovering for our clients.\n\n## Motorcycle Accidents\n\nWe are riders and we know the risks. At the Firm we have a saying “Motorcycle\nriders should have equal rights on the highway, the Maeder Legal Team makes\nsure they have equal rights in the courtroom.”\n\n## Other Negligent Claims\n\nThese claims are all based on poor design or defective manufacturing. We hold\nthe manufacturers, distributors, and dealers of these products responsible for\nany damages they may have caused.\n\n## Shaping Wisconsin Law\n\nOne way to objectively measure a law firm’s actual trial experience is to\ncheck the number of appellate decisions it has been involved in over the\nyears.\n\n## Construction Site Accidents\n\nInjuries that occur on construction sites are often complex and can involve\nnumerous contractors, who may all bear a share of the blame. Our firm has\nsuccessfully handled many local construction site accident cases.\n\n## Farm Accidents\n\nFarming is a way of life in Wisconsin. Each year there are numerous hard-\nworking people who are significantly injured and even killed in farming\naccidents. We will help get you the compensation you are entitled to from\ninjuries caused by a farm accident.\n\n## Boating Accidents\n\nWe all love spending time on the water, but this activity can also be\ndangerous if boaters do not follow safety guidelines. We know the laws\ngoverning water-related recreational activities and we will make sure you get\nfully compensated for your claim.\n\n## Snowmobile/ATV Accidents\n\nSome of the same rules of the road that apply to motor vehicles also apply to\nthe use of these trails. Injuries can occur when the rules are not followed.\nIf you are injured in such an accident, you are entitled to compensation.\n\n## Brain Injuries\n\nThe devastating impact of head injuries have made headlines in recent years.\nHowever, it is not just those in athletics or the military who are affected,\nbut anybody who has sustained head trauma can have tremendous life-altering\nconsequences. Contact our office to be sure that you are compensated.\n\n## Products Liability\n\nEvery year many people are severely injured due to dangerous and defective\nproducts. The Maeder Legal Team has successfully pursued the manufacturers of\nproducts that cause injuries.\n\n## Social Security Disability\n\nThe Maeder Legal Team will navigate the process and obtain the evidence\nnecessary to effectively represent you in front of the Social Security\nAdministration.\n\n## Spinal Injuries\n\nInjuries to your neck and back can be devastating, both in the need for\nextensive and costly treatment and also to your ability to work. The Maeder\nLegal Team is experienced in handling these complex spinal injury cases and in\nprotecting you and your family.\n\n## Wrongful Death\n\nMany lives are needlessly lost each year as the result of accidents that occur\nin our workplaces, recreation areas, and on our highways. The Maeder Legal\nTeam will hold the responsible parties accountable and get you the\ncompensation you deserve in this time of grief and loss.\n\n# What our clients have to say\n\n“When my 8-year-old daughter and I were injured in a car accident, we called\nthe Maeder Law Firm right away. They treated us like family and took away the\nstress of dealing with the insurance company. The Maeder legal team delivered\non their promise to protect our family.” - Lacie\n\n“As a lifetime farmer, I feared I was about to lose everything as a result of\nthe severities of the accident. Brad Myska of the Maeder Law firm told me\n‘worry about getting better’ he would take care of the legal details. The\nMaeder legal team delivered on their promise. They are the lawyers for the\ninjured.” - Ronald\n\n“Shortly after losing both of my parents, I was involved in a terrible car\naccident - one that left me seriously injured and in desperate need of help.\nBrad Myska of the Maeder law firm stepped in and he took care of me. The\nMaeder legal team got me every penny I was entitled to and they treated me\nlike a member of their own family when I needed someone to lean on the most.”\n- Jacob\n\n“I fought for my country in Vietnam. When I was injured in a car accident, I\nneeded someone who would fight for me. The Maeder Law firm never quit\nfighting. They didn’t leave a dime on the table. They’re like the guys in my\nsquad, they covered my back.” - Tom\n\n“I was seriously injured in an accident. Because the dump truck blew the tire\nbefore the collision, the adjuster said he wouldn’t give me a dime. I hired\nthe Maeder Team. Brad Myska proved that the dump truck driver was at fault,\nand I recovered big time. He had my back all the way.” - James\n\n“I had a terrible injury from an auto accident. Everybody said it was my\nfault, but Brad Myska tried my case, the jury believed me. Brad Myska helped\nme when no one else would.” - Jean\n\n“I suffered a severe work injury which required surgery and my partner was in\na horrible car accident and lost her job because of the injuries. We hired the\nMaeder Law firm and attorney Ben Welch stood up for our family when we needed\nit the most.” - Larry\n\n“As a member of the US military, I command hard work, respect, and integrity\nfrom myself. Brad Myska with the Maeder legal team, delivered in handling my\npersonal injury case. The Maeder legal team is top-notch. Hire Maeder Law firm\nfor top results.” - David\n\n“My prior attorney suggested to me that the accident was my fault. I was hit\nas a pedestrian in the school parking lot and it was on surveillance. I then\nhired Brad Myska and the Maeder law firm. He completely stood up for me,\nmaking sure the insurance company paid in full.” - Natasha\n\n“I was badly injured in an auto accident and two law firms told me I had no\ncase. I hired the Maeder law firm and they sued the insurance company, I\nreceived a large settlement. My advice is to get Bradly Myska. He will fight\nand you will win.” - Sherri\n\nPreviousNext\n\n12345678910\n\n## QUICK LINKS\n\n  * Home\n  * About\n  * Our Team\n  * Practice Areas\n  * FAQ\n  * Maeder Messages\n  * Shaping Wisconsin Law\n  * Our No Cost Pledge\n  * Contact Us\n\n## PRACTICE AREAS\n\n  * Truck Accidents\n  * Car Accidents\n  * Worker's Compensation\n  * Dog Bites\n  * Fall Down Accidents\n  * Motorcycle Accidents\n  * Const. Site Accidents\n  * Farm Accidents\n  * Boating Accidents\n  * Snowmobile/ATV Accidents\n  * Brain Injuries\n  * Products Liability\n  * SS Disability\n  * Spinal Injuries\n  * Wrongful Death\n  * Other Negligent Claims\n\n## Contact Us\n\n  * Tel: 715.842.2281\n  * Toll-Free: 800.452.8580\n  * Fax: 715.842.1046\n\n**Address**  \nP.O. Box 1626  \n602 Jackson St  \nWausau, WI 54403\n\n## No Cost Pledge\n\nOur \"no cost guarantee\" means that you can hire the best and recover the\nmaximum amount that the law will allow. If you are not satisfied with your\ncurrent representation, it is easier to change lawyers than you think. Give us\na call and get an immediate response.\n\nCopyright © 2024 Maeder Law | Designed by **MWC Advertising**\n\n",
    "links": "[{\"link\": \"https://maederlaw.com/contact-us/\", \"text\": \"REACH OUT NOW\"}, {\"link\": \"https://maederlaw.com/\", \"text\": \"\"}, {\"link\": \"https://maederlaw.com/\", \"text\": \"Home\"}, {\"link\": \"https://maederlaw.com/about/\", \"text\": \"About\"}, {\"link\": \"https://maederlaw.com/our-team/\", \"text\": \"Our Team\"}, {\"link\": \"https://maederlaw.com/our-team/jerome-a-maeder/\", \"text\": \"Jerome A. Maeder\"}, {\"link\": \"https://maederlaw.com/our-team/bradley-d-myska/\", \"text\": \"Bradley D. Myska\"}, {\"link\": \"https://maederlaw.com/our-team/benjamin-c-welch/\", \"text\": \"Benjamin C Welch\"}, {\"link\": \"https://maederlaw.com/our-team/alanie/\", \"text\": \"Alanie\"}, {\"link\": \"https://maederlaw.com/our-team/kristen/\", \"text\": \"Kristen\"}, {\"link\": \"https://maederlaw.com/our-team/ashlee/\", \"text\": \"Ashlee\"}, {\"link\": \"https://maederlaw.com/our-team/mckinze/\", \"text\": \"McKinze\"}, {\"link\": \"https://maederlaw.com/practice-areas/\", \"text\": \"Practice Areas\"}, {\"link\": \"https://maederlaw.com/faq/\", \"text\": \"FAQ\"}, {\"link\": \"https://maederlaw.com/maeder-messages/\", \"text\": \"Maeder Messages\"}, {\"link\": \"https://maederlaw.com/contact-us/\", \"text\": \"Contact Us\"}, {\"link\": \"https://maederlaw.com/\", \"text\": \"Home\"}, {\"link\": \"https://maederlaw.com/about/\", \"text\": \"About\"}, {\"link\": \"https://maederlaw.com/our-team/\", \"text\": \"Our Team\"}, {\"link\": \"https://maederlaw.com/our-team/jerome-a-maeder/\", \"text\": \"Jerome A. Maeder\"}, {\"link\": \"https://maederlaw.com/our-team/bradley-d-myska/\", \"text\": \"Bradley D. Myska\"}, {\"link\": \"https://maederlaw.com/our-team/benjamin-c-welch/\", \"text\": \"Benjamin C Welch\"}, {\"link\": \"https://maederlaw.com/our-team/alanie/\", \"text\": \"Alanie\"}, {\"link\": \"https://maederlaw.com/our-team/kristen/\", \"text\": \"Kristen\"}, {\"link\": \"https://maederlaw.com/our-team/ashlee/\", \"text\": \"Ashlee\"}, {\"link\": \"https://maederlaw.com/our-team/mckinze/\", \"text\": \"McKinze\"}, {\"link\": \"https://maederlaw.com/practice-areas/\", \"text\": \"Practice Areas\"}, {\"link\": \"https://maederlaw.com/faq/\", \"text\": \"FAQ\"}, {\"link\": \"https://maederlaw.com/maeder-messages/\", \"text\": \"Maeder Messages\"}, {\"link\": \"https://maederlaw.com/contact-us/\", \"text\": \"Contact Us\"}, {\"link\": \"https://maederlaw.com/contact-us/\", \"text\": \"SCHEDULE YOUR FREE CONSULTATION\"}, {\"link\": \"https://maederlaw.com/\", \"text\": \"Home\"}, {\"link\": \"https://maederlaw.com/about/\", \"text\": \"About\"}, {\"link\": \"https://maederlaw.com/our-team/\", \"text\": \"Our Team\"}, {\"link\": \"https://maederlaw.com/practice-areas/\", \"text\": \"Practice Areas\"}, {\"link\": \"https://maederlaw.com/faq/\", \"text\": \"FAQ\"}, {\"link\": \"https://maederlaw.com/maeder-messages/\", \"text\": \"Maeder Messages\"}, {\"link\": \"https://maederlaw.com/shaping-wisconsin-law/\", \"text\": \"Shaping Wisconsin Law\"}, {\"link\": \"https://maederlaw.com/no-cost-pledge/\", \"text\": \"Our No Cost Pledge\"}, {\"link\": \"https://maederlaw.com/contact-us/\", \"text\": \"Contact Us\"}, {\"link\": \"https://maederlaw.com/truck-accidents/\", \"text\": \"Truck Accidents\"}, {\"link\": \"https://maederlaw.com/car-accidents/\", \"text\": \"Car Accidents\"}, {\"link\": \"https://maederlaw.com/workers-compensation/\", \"text\": \"Worker's Compensation\"}, {\"link\": \"https://maederlaw.com/dog-bites/\", \"text\": \"Dog Bites\"}, {\"link\": \"https://maederlaw.com/fall-down-accidents/\", \"text\": \"Fall Down Accidents\"}, {\"link\": \"https://maederlaw.com/motorcycle-accidents/\", \"text\": \"Motorcycle Accidents\"}, {\"link\": \"https://maederlaw.com/construction-site-accidents/\", \"text\": \"Const. Site Accidents\"}, {\"link\": \"https://maederlaw.com/farm-accidents/\", \"text\": \"Farm Accidents\"}, {\"link\": \"https://maederlaw.com/boating-accidents/\", \"text\": \"Boating Accidents\"}, {\"link\": \"https://maederlaw.com/snowmobile-atv-accidents/\", \"text\": \"Snowmobile/ATV Accidents\"}, {\"link\": \"https://maederlaw.com/brain-injuries/\", \"text\": \"Brain Injuries\"}, {\"link\": \"https://maederlaw.com/products-liability/\", \"text\": \"Products Liability\"}, {\"link\": \"https://maederlaw.com/social-security-disability/\", \"text\": \"SS Disability\"}, {\"link\": \"https://maederlaw.com/spinal-injuries/\", \"text\": \"Spinal Injuries\"}, {\"link\": \"https://maederlaw.com/wrongful-death/\", \"text\": \"Wrongful Death\"}, {\"link\": \"https://maederlaw.com/other-negligent-claims/\", \"text\": \"Other Negligent Claims\"}]"
}