{
    "summary": "Skip to content\n\nAward-Winning Personal Injury Lawyers\n\nFree Consultations | Calls Answered 24/7  1-855-NICOLET\n\n__\n\n  * About\n    * Injured? Get Nicolet.\n    * The Nicolet Law Story\n    * Attorneys\n    * Blog\n    * Podcasts\n    * Community Involvement\n    * The Flannel Lawyer\n    * The Midwest Motorcycle Lawyers\n    * Legal Personal Injury Glossary\n    * Careers\n    * Scholarship\n    * Referrals\n  * Wisconsin Injury\n    * Wisconsin Car Accident Attorney\n    * Wisconsin Truck Accident Attorney\n    * Wisconsin Motorcycle Accident Attorney\n    * Wisconsin Motor Vehicle Accident Attorney\n    * Wisconsin Workers' Compensation Attorney\n    * Wisconsin Defective Product Liability Attorney\n    * Wisconsin Dog Bite Attorney\n    * Wisconsin Wrongful Death Attorney\n  * Minnesota Injury\n    * Minnesota Car Accident Attorney\n    * Minnesota Truck Accident Attorney\n    * Minnesota Motorcycle Accident Attorney\n    * Minnesota Motor Vehicle Accident Attorney\n    * Minnesota Defective Product Liability Attorney\n    * Minnesota Dog Bite Attorney\n    * Minnesota Wrongful Death Attorney\n  * North Dakota Injury\n    * North Dakota Car Accident Attorney\n    * North Dakota Dog Bite Attorney\n    * North Dakota Motorcycle Accident Attorney\n    * North Dakota Truck Accident Attorney\n  * Results\n    * Personal Injury Stories\n    * Workers’ Compensation Stories\n    * Testimonials\n  * Locations\n    * Minnesota\n      * Duluth\n      * Hibbing\n      * Minneapolis\n      * Rochester\n      * Roseville\n      * St. Paul\n      * Woodbury\n    * North Dakota\n      * Fargo\n      * Williston\n      * Bismarck\n      * Minot\n    * Wisconsin\n      * Eau Claire\n      * Green Bay\n      * Hudson\n      * La Crosse\n      * Madison\n      * Milwaukee\n      * New Richmond\n      * Rice Lake\n      * River Falls\n      * Superior\n      * Wausau\n  * Contact\n  * Search\n\nFree Case Evaluation\n\n#  Wausau Personal Injury Lawyers\n\nHome > Wausau Personal Injury Lawyers\n\n## Wausau Personal Injury Lawyer\n\n**_“It all happened in the blink of an eye.”_**\n\nIt’s a cliché but it has remained part of our vernacular because it is true;\nlife truly can change – or even end – in the blink of an eye. This happens\nevery day when people are involved in motor vehicle accidents, injured in\nfalls or hurt at work. Accidents happen quickly, but the damage can be long-\nlasting in the form of lost earnings, crushing medical expenses, pain, and\nstress. People who have been hurt as a result of someone else’s negligence\nshould not have to bear that burden.\n\nDid you suffer serious injuries in an accident due to another party’s\nnegligence somewhere in Wausau? You may find yourself living with lifelong\nconsequences and a great deal of financial strain, especially as your medical\nbills start to mount. A personal injury claim can help you recover some of the\nfunds you need to help rebuild your life or help pay for those mounting bills.\n\nA  **Wausau personal injury lawyer**  can help you better understand your\nlegal right to compensation. Contact Nicolet Law Accident & Injury Lawyers\ntoday for a free consultation.\n\n## What You Need to Know About Nicolet Law\n\nNicolet Law Accident & Injury Lawyers is a regional firm known as a premier\nresource for those facing financial distress following a personal injury. With\n15 team members in nine locations throughout Wisconsin and Minnesota, we\ncombine the resources and convenience of a large regional firm with the\npersonalized service that you expect from a local attorney in Wausau.\n\nWhether a from slip and fall, car accident, or other source of injury, we know\nhow to handle complicated personal injury cases, and we know that each client\nis different and deserves a custom-tailored case plan. We know that if you’re\ninjured, facing financial difficulty, or lost a loved one, you should only\nhave to think about getting better, and being there for your family. We take\ncare of all the complexities of a Wausau personal injury claim, so you can\nfocus on your life and your loved ones.\n\n### Injured in Wausau? Get Nicolet.\n\nFree Case Evaluation\n\nDarian T.\n\n\"My car accident happened dec 8, 2022. I was rear-ended, and left with an\ninjury to my left hand. I saw Nicolet Laws advertisement while driving. So I\nlooked them up and called in. I had the pleasure to speak with Ryan Muir, who\nwas super professional and explained everything down to the t. I couldn’t be\nmore happy with how everything played out, even when we were looking at 2 plus\nyears of even reaching a settlement agreement, I was ready for the long. Ryan\nstayed on top of everything and we closed out the settlement around the 1 year\nmark. My advice to anyone looking for representation from a car accident is to\ngo with Nicolet Law. Those guys and gals are amazing, thank you.\"\n\n__________\n\nMorgan A.\n\n\"Lindsay gave the best, consistent communication through the whole process and\nmade it clear that my voice was respected and I was in good hands. At the end\nof the day, I had final say on the action taken, and with her help I feel\nsupported and more hopeful. Great experience with her from start to\nfinish!!!!\"\n\n__________\n\n## We Make People Whole After Terrible Accidents\n\n_click to enlarge_\n\nThe dedicated Wausau personal injury attorneys at Nicolet Law Office boast\ndecades of combined experience representing injured clients. We’ve recovered\nover $34 million in compensation for our clients, and look forward to the\nchance to see how we can help you and your loved ones.\n\nSome of our past clients include:\n\n  * **A woman who slipped on ice outside a gas station turned to Nicolet Law Office for help.**  We found that not only had the gas station failed to remove or remedy the icy conditions, but it had also violated a safety standard requiring vehicle stops to not be placed in pedestrian walkways. We made sure our client got the settlement she deserved, but also partnered with a local attorney to craft a special needs trust that would allow the client to receive a large settlement while also maintaining her SSI benefits.\n  * **A client was seriously injured by a co-worker who was driving recklessly.**  Drawing on his understanding of personal injury law, attorney Russell Nicolet recovered the client the full policy limit ($250,000) from the insurance carrier. We prevented the client’s workers’ compensation carrier to take more than a small portion of the settlement. This left plenty of compensation to help our client recover and move forward in life.\n  * **A woman hit by a vehicle while crossing the street at a crosswalk was offered a measly settlement that did not even cover her medical bills or wage loss.**  After choosing us to represent her, the insurance company ended up paying the client’s medical bills, wage loss, and she got significant money in her pocket for her pain-and-suffering.\n\nWhile no attorney can guarantee the results in any particular case, rest\nassured that the passionate team at Nicolet Law Office draws on our deep well\nof experience to pursue the best possible outcome in every client’s claim. For\nmore examples of our past success, consider some more of our past case\nresults.\n\n## Wausau Personal Injury Claims: The Basics\n\n<iframe width=\"200\" height=\"113\" src=\"https://www.youtube.com/embed/Rp0OjuN--\nCM?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-\nwrite; encrypted-media; gyroscope; picture-in-picture; web-share\"\nreferrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen\ntitle=\"Wisconsin Personal Injury Claims in 10 Steps | Nicolet Law\"></iframe>\n\n __\n\nAny time another party caused your injuries due to negligence, you may have\nthe right to file a personal injury claim.\n\nNicolet Law Firm has handled many types of personal injury claims in the past,\nincluding:\n\n  * **Motor-vehicle accident claims.  **From accidents with big trucks to accidents with the driver of a personal vehicle, or even motorcycles, ATVs, and snowmobiles, and vehicle accidents can leave you with substantial, long-term injuries.\n  * **Burn injuries.  **Not only do burns cause immense physical pain, they can leave the victim with lifelong scarring and disfigurement.\n  * **Dog bites.  **If another person’s dog attacks you, you may end up with severe lacerations, crushing damage, and a high risk of infection.\n  * **Nursing home abuse.  **Nursing home negligence and abuse impact all too many seniors across the country each year, leading to a substantial decline in overall health.\n  * **Slip and fall accidents.  **A slip and fall accident often occurs in the blink of an eye, when you least expect it, and can result in spinal cord injuries, traumatic brain injury, and more.\n  * **Wrongful death accidents**.\n  * Drunk driving accidents.\n\n## Common Injuries\n\n<iframe width=\"200\" height=\"113\" src=\"https://www.youtube.com/embed/oxJmA0--\nj7o?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-\nwrite; encrypted-media; gyroscope; picture-in-picture; web-share\"\nreferrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen\ntitle=\"Wisconsin Car Accident Claims in 10 Steps | Nicolet Law\"></iframe>\n\n __\n\nWhile any type of injury may give you grounds for a personal injury claim,\ncommon injuries we’ve encountered in Wausau may include catastrophic injuries\nincluding:\n\n  * Severe lacerations\n  * Traumatic brain injuries\n  * Spinal cord injuries\n  * Amputations\n  * Broken bones, especially multiple broken bones\n\nConsult an experienced Wausau personal injury attorney today to learn more\nabout what compensation you can seek following severe injuries.\n\n## A Wausau Personal Injury Lawyer Can Help\n\nIf you suffered severe injuries in an accident in Wausau due to the negligence\nof another party, an experienced personal injury attorney can help you seek\nthe compensation you deserve for those injuries.\n\nOur experienced personal injury attorneys can:\n\n  * Seek evidence related to your claim\n  * Help build your case\n  * Negotiate with the insurance company on your behalf\n  * Provide you with a strong look at the compensation you really deserve\n  * Present your claim in court, if needed\n\nStart with your free consultation today.\n\n<iframe width=\"200\" height=\"113\"\nsrc=\"https://www.youtube.com/embed/HjPVrq6eOz0?feature=oembed\" frameborder=\"0\"\nallow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope;\npicture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-\norigin\" allowfullscreen title=\"Why Nicolet Law Should Be Your First Choice |\nNicolet Law Office\"></iframe>\n\n __\n\n## The Liable Party in a Personal Injury Claim\n\nAs your attorney begins the process of filing a personal injury claim on your\nbehalf, he or she must first identify the party that caused your injuries.\n\nYou must prove that the party liable for your accident:\n\n  * Bore a duty of care to you at the time of the accident\n  * Violated that duty of care to you\n  * Caused your injuries through that violation\n\nYour attorney may look at all the evidence related to your claim, including\nwhat events led up to your accident, what injuries you suffered, and how those\ninjuries have impacted your life.\n\n## Claiming Compensation for an Injury\n\nMany victims want to know: “How much compensation can I claim after a serious\naccident in Wausau?”\n\nIf another party caused your injuries, several elements might influence your\nclaim.\n\n  * **Who caused your accident?  **In many cases, the liable party will carry an insurance policy that will provide compensation for your injuries. The terms of that policy may limit the compensation you can receive for your accident. For example, many Wausau drivers carry only minimum liability insurance. Other parties, on the other hand, frequently carry higher-value policies that can provide additional compensation for the injuries you suffered.\n\n  * **How much did your medical bills cost?  **Often, the insurance company will base the compensation you receive from your accident on the amount of your medical bills. Severe injuries, like spinal cord injuries and amputations, can lead to substantial, often ongoing medical expenses. More minor injuries like broken bones may carry a hefty initial price tag, but may not cost as much in the long run.\n  * **How much time did you miss at work?  **For many victims of Wausau accidents, lost wages can cause just as much financial devastation as increasing medical expenses. You may have to miss work, not just in the immediate aftermath of your accident, but as you attend follow-up appointments or go to physical therapy.\n\nSome injuries may limit your ability to perform your usual job duties. You may\nneed to drop to part-time work temporarily, work from home on a limited basis,\nor change your hours to reflect your new limitations. Worse, some injuries can\ncause permanent disability that makes it impossible for you to return to work.\n\nYour attorney will help evaluate these key categories and help you determine\nhow much compensation you should expect. An attorney cannot provide you with a\npromise about how much compensation you will ultimately receive, but can give\nyou a better idea of how much compensation to expect in a personal injury\nclaim.\n\nAn attorney can also help you determine how to add in pain and suffering\nexperienced as a result of your injuries, including both physical pain and\nemotional anguish related to your accident.\n\n## Wausau Personal Injury FAQ\n\nIf you have questions that pertain to your individual personal injury claim,\ncontact our experienced Wausau personal injury attorneys as soon as possible\nto learn more. On the other hand, if you still want to get a better idea of\nwhat a personal injury claim might look like, take a look at the frequently\nasked questions below.\n\n### Can I file more than one Wausau personal injury claim for the same\naccident?\n\nIn general, you can file only a single personal injury claim against the party\nthat caused your accident. However, if more than one party contributed to your\naccident, you can file a claim against each liable party.\n\nSuppose, for example, that you suffered injuries in a car accident with a\npizza delivery driver on a snowy day. Most local businesses closed down, but\nthe restaurant chose to stay open. On investigation, your attorney discovers\nthat the driver’s manager pressured him heavily to come into work, even\nthreatening him with the loss of his job if he failed to come in despite the\nbad weather.\n\nWhile the pizza delivery driver in that scenario bears liability for his\nactions behind the wheel, including the actions that led to the accident, the\nrestaurant may also bear liability for the accident. An attorney can help you\ndetermine how to file a claim and who bears the majority of the liability for\nthe accident.\n\n### Who pays my medical bills while I manage a Wausau personal injury claim?\n\nThe party that caused your accident may bear liability for many of your\nmedical bills, but will not have to pay your medical care providers directly.\nInstead, the liable party, or that party’s insurance company, will issue a\npayment to you. You can then use the funds from your settlement or award to\ntake care of your medical bills.\n\nIn the meantime, you can use your medical insurance to cover many of the\nexpenses associated with your personal injury claim. Medical insurance can\nalso prove vital in paying for your long-term medical expenses following\nsevere injuries.\n\n### The liable party’s insurance company called me. Do I have to talk to them?\n\nYou may, at some point, need to make a statement about the events that led to\nthe accident. However, you should talk to an experienced personal injury\nattorney before talking to the insurance company, if possible. In many cases,\nthe insurance company will try to limit the compensation it has to offer for\nyour injuries by providing you with a low initial settlement offer.\n\nIf you accept that offer, the insurance company need no longer make any\nfurther payment to you, which means you may not get the funds you really need\nfor your personal injury claim.\n\n###  I did not realize I suffered serious injuries immediately after the\naccident, but rather discovered them later. Can I still file a Wausau personal\ninjury claim?\n\nYes. You have the right to file a personal injury claim any time another\nparty’s actions cause severe injuries, even if you did not realize the full\nextent of your injuries immediately after your accident. However, it can prove\nmore difficult to show exactly when your injuries occurred if you do not seek\nmedical attention immediately after the accident.\n\nThe insurance company or the representatives of the liable party may try to\nprove that your injuries occurred at another time or that you did not suffer\nsuch severe injuries during the accident itself. Talk to an attorney to learn\nmore about how to proceed with your claim when serious injuries crop up well\nafter the initial accident.\n\n### Someone committed an act of negligence that could have resulted in serious\ninjuries, but I escaped with only minor injuries: a few bumps and scrapes. Do\nI still have grounds for a Wausau personal injury claim?\n\nIn some cases, you may note a severe act of negligence on the part of someone\nwho bears a duty of care to you, but escape with relatively minor injuries.\nSuppose, for example, that you notice a wet floor, but walk around it instead\nof slipping and falling. While the institution may have violated its duty of\ncare to you, you may not have grounds for a personal injury claim because you\ndid not suffer injury. Likewise, if you notice a speeding driver, but suffer\nno injury due to that driver’s actions, you cannot file a personal injury\nclaim.\n\nIn some cases, you may, however, suffer severe property damage due to that\nnegligence, even if you do not personally suffer serious injuries. You may,\ntherefore, have grounds for a property damage claim, even if you did not\nsuffer injury personally.\n\n### Will I have to go to court over my Wausau personal injury claim?\n\nThe majority of personal injury claims settle out of court. Going to court\noften substantially increases the cost associated with the claim for both\nsides, and most often, the insurance company will try to settle out of court\nif possible. Sometimes, however, you may have to take your claim to court to\nreceive the full compensation you deserve.\n\nMost often, personal injury claims go to court if you have to ask for a large\nsettlement or award due to the extent of your injuries, or if liability gets\ncalled into question and you need to prove exactly how your accident occurred.\n\nHaving an experienced Wausau personal injury attorney on your side can prove\nvital if you have to take your claim to court. An attorney can present a\ncompelling case for you, build evidence against the liable party, and help\nfight on your behalf.\n\n### What should I do if I suffer severe injuries due to someone else’s\nnegligence?\n\nThe steps you take immediately after a serious accident can help protect you\nand your finances. First, make medical attention your top priority. A doctor’s\nexam can help you fully understand the injuries you suffered and increase the\nodds that you will make a full recovery. Many injuries may worsen quickly if\nnot treated.\n\nNext, make sure you report the accident. In a car accident, that might mean\nfiling a report with the police. If you suffer an injury at work, that may\nmean going through the system put in place by your employer. Finally, make\nsure you contact a personal injury attorney as soon as possible. An attorney\ncan help guide you through your personal injury claim and keep your rights at\nthe forefront as you seek compensation.\n\n## Call Our Wausau Personal Injury Attorneys Today\n\n<iframe width=\"200\" height=\"113\" src=\"https://www.youtube.com/embed/Lee9XlR-\nCjA?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-\nwrite; encrypted-media; gyroscope; picture-in-picture; web-share\"\nreferrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen title=\"Wausau\n| Wisconsin Personal Injury Lawyers | Nicolet Law Office\"></iframe>\n\n __\n\nWith 20 team members in nine locations throughout Wisconsin and Minnesota, the\nWausau personal injury lawyers at Nicolet Law Office strive to be more than\njust legal professionals in the communities we serve. As members of the Wausau\ncommunity, we ensure that when an injured person hires Nicolet Law, they\naren’t just treated as just another case file: They are family, and we aspire\nto achieve the best outcome possible.\n\nIf you need help after suffering a personal injury somewhere in Wausau, our\npassionate Wausau personal injury lawyers can help. For a free case\nevaluation, contact us online or by calling **(715) 716-5092**.\n\n**Wausau Office**  \n408 3rd Street  \nSuite 303  \nWausau, WI 54403  \nPhone: 715-226-6288\n\n### Meet Our Attorneys\n\n#### Adam L. Nicolet\n\nManaging Attorney\n\nView Profile\n\n#### Russell D. Nicolet\n\nTrial Attorney and President\n\nView Profile\n\n#### Benjamin J. Nicolet\n\nOf Counsel Attorney\n\nView Profile\n\n#### Ashley Rossman\n\nPersonal Injury Attorney\n\nView Profile\n\n#### Mike J. Ingvaldson\n\nPersonal Injury Attorney\n\nView Profile\n\n#### Braxton Phillips\n\nPersonal Injury Attorney\n\nView Profile\n\n#### Drew Epperly\n\nManaging Attorney, North Dakota\n\nView Profile\n\n#### Jordan T. Miller\n\nWork Injury Attorney\n\nView Profile\n\n#### Jessica A. Swain\n\nManaging Attorney, Wisconsin\n\nView Profile\n\n#### Keaton Ostir\n\nPersonal Injury Attorney\n\nView Profile\n\n#### Lindsay Lien\n\nInjury and Food Safety Attorney\n\nView Profile\n\n#### Nicholas M. Angel\n\nPersonal Injury Attorney\n\nView Profile\n\n#### Ryan T. Muir\n\nPersonal Injury Attorney\n\nView Profile\n\n#### John M. Spiten\n\nManaging Attorney, Minnesota\n\nView Profile\n\n#### C. Anthony Gutta III\n\nPersonal Injury Attorney\n\nView Profile\n\n#### Megan Zabkowicz\n\nPersonal Injury Attorney\n\nView Profile\n\n#### Arianna Meehleib\n\nPersonal Injury Attorney\n\nView Profile\n\n#### William Waltenberger\n\nManaging Attorney, Bilingual Practice\n\nView Profile\n\n#### Contact Nicolet Law Office Today!\n\nName\n\nFirst\n\nUntitled\n\nEmail(Required)\n\nPhone\n\nHow did you hear about us?(Required)\n\nHow did you hear about us? *BillboardEmailGoogle AdsGoogle\nSearchRadioReferralSocial MediaTelevisionWord of MouthOther\n\nOther\n\nMessage\n\nConsent\n\nI have read the disclaimer and privacy policy.\n\nDisclaimer | Privacy Policy\n\nName\n\nThis field is for validation purposes and should be left unchanged.\n\nGet a Free Case Evaluation\n\nΔ\n\n#### Be Kind. Do Good.\n\nTable Of Contents\n\n  * Wausau Personal Injury Lawyer\n  * What You Need to Know About Nicolet Law\n  * We Make People Whole After Terrible Accidents\n  * Wausau Personal Injury Claims: The Basics\n  * Common Injuries\n  * A Wausau Personal Injury Lawyer Can Help\n  * The Liable Party in a Personal Injury Claim\n  * Claiming Compensation for an Injury\n  * Wausau Personal Injury FAQ\n  * Call Our Wausau Personal Injury Attorneys Today\n\n### Recent Wins\n\n### $2,620,571\n\n##### Jury Verdict\n\nFor a client injured at a retail store in Minnesota\n\nORIGINAL OFFER\n\n#### $0\n\n#### Legal Services & Resources\n\n  * ##### Wausau ATV/Snowmobile Accident Lawyer\n\n  * ##### Wausau Auto Accident Attorneys\n\n  * ##### Wausau Catastrophic Injury Lawyer\n\n  * ##### Wausau Commercial Vehicle Accident Attorneys\n\n  * ##### Wausau Disability Benefits Attorneys\n\n  * ##### Wausau Drunk Driving Accident Lawyer\n\n  * ##### Wausau Motorcycle Accident Lawyers\n\n  * ##### Wausau Premises Liability Lawyers\n\n  * ##### Wausau Slip And Fall Injury Attorneys\n\n  * ##### Wausau Traumatic Brain Injury Lawyers\n\n  * ##### Wausau Work Injury Attorneys\n\n  * ##### Wausau Wrongful Death Lawyers\n\n### Client Testimonials\n\n<iframe width=\"200\" height=\"113\"\nsrc=\"https://www.youtube.com/embed/Dq7RBxl7RlM?feature=oembed\" frameborder=\"0\"\nallow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope;\npicture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-\norigin\" allowfullscreen title=\"Richard&#39;s Personal Injury Testimonial |\nNicolet Law\"></iframe>\n\n__\n\nDarian T.\n\n\"My car accident happened dec 8, 2022. I was rear-ended, and left with an\ninjury to my left hand. I saw Nicolet Laws advertisement while driving. So I\nlooked them up and called in. I had the pleasure to speak with Ryan Muir, who\nwas super professional and explained everything down to the t. I couldn’t be\nmore happy with how everything played out, even when we were looking at 2 plus\nyears of even reaching a settlement agreement, I was ready for the long. Ryan\nstayed on top of everything and we closed out the settlement around the 1 year\nmark. My advice to anyone looking for representation from a car accident is to\ngo with Nicolet Law. Those guys and gals are amazing, thank you.\"\n\n__________\n\nMorgan A.\n\n\"Lindsay gave the best, consistent communication through the whole process and\nmade it clear that my voice was respected and I was in good hands. At the end\nof the day, I had final say on the action taken, and with her help I feel\nsupported and more hopeful. Great experience with her from start to\nfinish!!!!\"\n\n__________\n\nDeanna S.\n\n\"Russell Nicolet represented me for a personal injury case. He was kind,\ncompassionate, and professional. He made my concerns his concerns. He was\nquick to respond to my calls and emails. He kept me up to date on the progress\nof the case. Every interaction with Russel and his staff was a positive\nexperience. If you are looking for a personal injury attorney, I highly\nrecommend Russell, or his colleagues at Nicolet Law.\"\n\n__________\n\n## Contact Us\n\nCalls Answered 24/7\n\n###### Toll Free\n\n1-855-NICOLET\n\nGet a Free Case Evaluation\n\n## Our Office Location Areas:\n\n\n\n#### Duluth\n\n#### Bismarck\n\n#### Des Moines\n\n#### Eau Claire\n\n#### Fargo\n\n#### Green Bay\n\n#### Hibbing\n\n#### Hudson\n\n#### La Crosse\n\n#### Madison\n\n#### Milwaukee\n\n#### Minneapolis\n\n#### Minot\n\n#### New Richmond\n\n#### Rice Lake\n\n#### River Falls\n\n#### Rochester\n\n#### Roseville\n\n#### St. Paul\n\n#### Superior\n\n#### Wausau\n\n#### Williston\n\n#### Woodbury\n\n\n\nGet a Free Case Evaluation\n\n### Award-Winning Personal Injury Lawyers\n\n### Locations In Wisconsin, Minnesota, And North Dakota To Serve You\n\n##### WISCONSIN LOCATIONS:\n\nMadison Office\n\n345 W. Washington Ave #309  \nMadison, WI 53703\n\n(608) 467-0429\n\nMap & Directions\n\nMilwaukee Office\n\n241 N Broadway #302  \nMilwaukee, WI 53202\n\n(414) 260-2220\n\nMap & Directions\n\nGreen Bay Office\n\n2300 Riverside Dr Suite 105  \nGreen Bay, WI 54301\n\n(920) 668-2102\n\nMap & Directions\n\nLa Crosse Office\n\n205 5th Ave S Suite 209  \nLa Crosse, WI 54601\n\n(608) 655-6850\n\nMap & Directions\n\nEau Claire Office\n\n402 Graham Ave Suite 305  \nEau Claire, WI 54701\n\n(715) 322-3900\n\nMap & Directions\n\nHudson Office\n\n517 2nd St Unit #205  \nHudson, WI 54016\n\n(715) 304-0222\n\nMap & Directions\n\nNew Richmond Office\n\n1500 Madison Ave Suite 220  \nNew Richmond, WI 54017\n\n(715) 260-4764\n\nMap & Directions\n\nRice Lake Office\n\n337 N Main St  \nRice Lake, WI 54868\n\n(715) 500-4406\n\nMap & Directions\n\nSuperior Office\n\n1200 Tower Ave  \nSuperior, WI 54880\n\n(715) 333-3117\n\nMap & Directions\n\nWausau Office\n\n408 N 3rd Street Suite 303  \nWausau, WI 54403\n\n(715) 322-3994\n\nMap & Directions\n\nRiver Falls Office\n\n215 S 2nd St #20  \nRiver Falls, WI 54022\n\n(715) 333-3220\n\nMap & Directions\n\n\n\n##### MINNESOTA LOCATIONS:\n\nDuluth Office\n\n306 W Superior St Suite #606  \nDuluth, MN 55802\n\n(218) 460-5863\n\nMap & Directions\n\nRochester Office\n\n218 1st Ave SW Suite 1  \nRochester, MN 55901\n\n(507) 577-5411\n\nMap & Directions\n\nSt. Paul Office\n\n379 Wabasha St N, Suite 710  \nSt. Paul, MN 55102\n\n(651) 237-4258\n\nMap & Directions\n\nWoodbury Office\n\n724 Bielenberg Dr Suite 126  \nWoodbury, MN 55125\n\n(651) 376-3365\n\nMap & Directions\n\nHibbing Office\n\n302 E Howard St Suite 123  \nHibbing, MN 55746\n\n(218) 306-2745\n\nMap & Directions\n\nMinneapolis Office\n\n43 SE Main Street, Suite #500  \nMinneapolis, MN 55414\n\n(612) 888-8258\n\nMap & Directions\n\nRoseville Office\n\n1700 S Hwy 36 Service Dr #220  \nRoseville, MN 55113\n\n1-855-642-6538\n\nMap & Directions\n\n\n\n##### NORTH DAKOTA LOCATIONS:\n\nMinot Office\n\n 21 Main Street S Suite 205  \nMinot, ND 58701\n\n(701) 425-0984\n\nMap & Directions\n\nBismarck Office\n\n1925 Lovett Avenue Suite #1  \nBismarck , ND 58504\n\n(701) 970-2284\n\nMap & Directions\n\nWilliston Office\n\n125 Main Street Unit 216  \nWilliston, ND 58801\n\n(701) 707-0712\n\nMap & Directions\n\nFargo Office\n\n1630 1st Ave N Suite B  \nFargo, ND 58102\n\n(701) 970-2185\n\nMap & Directions\n\n__\n\n__\n\n__\n\n__\n\n__\n\n__\n\n© 2024 Nicolet Law Accident & Injury Lawyers All Rights Reserved   |\nDisclaimer   |   Privacy Policy   |   Sitemap\n\n__Search\n\n__\n\n",
    "links": "[{\"link\": \"https://nicoletlaw.com/contact/\", \"text\": \"Free Consultations\"}, {\"link\": \"https://nicoletlaw.com/\", \"text\": \"\"}, {\"link\": \"https://nicoletlaw.com/wisconsin-personal-injury-lawyer/\", \"text\": \"Wisconsin Injury\"}, {\"link\": \"https://nicoletlaw.com/wisconsin-car-accident-lawyer/\", \"text\": \"Wisconsin Car Accident Attorney\"}, {\"link\": \"https://nicoletlaw.com/wisconsin-truck-accident-lawyer/\", \"text\": \"Wisconsin Truck Accident Attorney\"}, {\"link\": \"https://nicoletlaw.com/wisconsin-motorcycle-accident-lawyer/\", \"text\": \"Wisconsin Motorcycle Accident Attorney\"}, {\"link\": \"https://nicoletlaw.com/wisconsin-motor-vehicle-accident-lawyer/\", \"text\": \"Wisconsin Motor Vehicle Accident Attorney\"}, {\"link\": \"https://nicoletlaw.com/wisconsin-workers-compensation-lawyer/\", \"text\": \"Wisconsin Workers' Compensation Attorney\"}, {\"link\": \"https://nicoletlaw.com/wisconsin-defective-product-liability-lawyer/\", \"text\": \"Wisconsin Defective Product Liability Attorney\"}, {\"link\": \"https://nicoletlaw.com/minnesota-personal-injury-lawyer/\", \"text\": \"Minnesota Injury\"}, {\"link\": \"https://nicoletlaw.com/minnesota-car-accident-lawyer/\", \"text\": \"Minnesota Car Accident Attorney\"}, {\"link\": \"https://nicoletlaw.com/minnesota-truck-accident-lawyer/\", \"text\": \"Minnesota Truck Accident Attorney\"}, {\"link\": \"https://nicoletlaw.com/minnesota-motorcycle-accident-lawyer/\", \"text\": \"Minnesota Motorcycle Accident Attorney\"}, {\"link\": \"https://nicoletlaw.com/minnesota-motor-vehicle-accident-lawyer/\", \"text\": \"Minnesota Motor Vehicle Accident Attorney\"}, {\"link\": \"https://nicoletlaw.com/minnesota-defective-product-liability-lawyer/\", \"text\": \"Minnesota Defective Product Liability Attorney\"}, {\"link\": \"https://nicoletlaw.com/wausau-personal-injury-lawyer/\", \"text\": \"Wausau\"}, {\"link\": \"https://nicoletlaw.com/contact/\", \"text\": \"Free Case Evaluation\"}, {\"link\": \"https://nicoletlaw.com/contact/\", \"text\": \"Free Case Evaluation\"}, {\"link\": \"https://nicoletlaw.com/disclaimer/\", \"text\": \"Disclaimer\"}, {\"link\": \"https://nicoletlaw.com/privacy/\", \"text\": \"Privacy Policy\"}, {\"link\": \"https://nicoletlaw.com/contact/\", \"text\": \"Get a Free Case Evaluation\"}, {\"link\": \"https://nicoletlaw.com/wausau-personal-injury-lawyer/\", \"text\": \"Wausau\"}, {\"link\": \"https://nicoletlaw.com/contact/\", \"text\": \"Get a Free Case Evaluation\"}, {\"link\": \"https://nicoletlaw.com/wausau-personal-injury-lawyer/\", \"text\": \"Wausau Office\"}, {\"link\": \"https://nicoletlaw.com/disclaimer/\", \"text\": \"Disclaimer\"}, {\"link\": \"https://nicoletlaw.com/privacy/\", \"text\": \"Privacy Policy\"}, {\"link\": \"https://nicoletlaw.com/site-map/\", \"text\": \"Sitemap\"}]"
}