{
    "summary": "__ __ __ __ __ Español\n\n__\n\n1-800-800-5678\n\nALWAYS OPEN - Available 24/7/365\n\n__\n\n  * Home\n  * Who We Are ____\n    * About Our Firm\n    * Our Team\n    * Community Involvement\n    * Careers\n    * Press Room / Firm News\n  * What We Do ____\n    * Wisconsin ____\n      * Car Accident Lawyer\n      * Motorcycle Accident Lawyer\n      * Truck Accident Lawyer\n      * Slip and Fall Lawyer\n      * Negligent Security Lawyer\n      * Dog Bite Lawyer\n      * Drug Injury Lawyer\n      * Wrongful Death Lawyer\n      * Police Brutality Lawyer\n    * Illinois ____\n      * Car Accident Lawyer\n      * Motorcycle Accident Lawyer\n      * Truck Accident Lawyer\n      * Slip and Fall Lawyer\n      * Negligent Security Lawyer\n      * Dog Bite Lawyer\n      * Drug Injury Lawyer\n      * Wrongful Death Lawyer\n      * Police Brutality Lawyer\n    * Iowa ____\n      * Car Accident Lawyer\n      * Motorcycle Accident Lawyer\n      * Truck Accident Lawyer\n      * Slip and Fall Lawyer\n      * Negligent Security Lawyer\n      * Dog Bite Lawyer\n      * Drug Injury Lawyer\n      * Wrongful Death Lawyer\n      * Police Brutality Lawyer\n      * Workers' Compensation Lawyer\n  * Results ____\n    * Case Results\n    * Testimonials\n    * Awards\n  * Resource Center ____\n    * FAQs\n    * Videos\n    * Library Articles\n    * Podcast\n    * Newsletters ____\n      * Our Firm Newsletters\n      * Our Rider Newsletters\n    * Promotions ____\n      * Top Offers & Contests\n      * Free Accident Guides\n      * Bumper Stickers\n      * Cards\n      * Brochures\n      * Spanish Materials\n      * Events\n  * Locations ____\n    * Milwaukee\n    * Appleton\n    * Green Bay\n    * Madison\n    * Wausau\n    * Bloomington\n    * Gurnee\n    * Rockford\n    * Cedar Rapids\n    * Des Moines\n    * Davenport\n  * Contact\n  * __ __ __ __ __\n\n  * Home\n  * Offices\n  * Wausau, WI\n\n__\n\n# Wausau Personal Injury Lawyer\n\n#### Receive Fair Compensation\n\nFirst Name *\n\nLast Name *\n\nPhone *\n\nEmail *\n\nTell Us More *\n\nPlease sign me up for your ENewsletter\n\nGet My Free Case Evaluation Now\n\nProtected By Google reCAPTCHAPrivacy \\- Terms\n\n  * Hupy and Abraham, S.C.\n  * 505 S 24th Ave #300  \nWausau, WI 54401\n\n  * Get Directions +\n  * Available 24/7/365\n\n  * Phone: 715-298-4400\n  * Toll Free: 800-800-5678\n  * Fax: 715-298-4405\n\nCall 24/7/365 - We'll Come to You!\n\nHupy and Abraham S.C.’s Wausau personal injury law office is located at 505 S\n24th Ave, near Stewart Avenue. Our Wausau personal injury attorney helps\nindividuals and families after car accidents, motorcycle crashes, truck\nwrecks, dog bites, slip and falls, wrongful deaths, and other accidents in\nWausau and throughout Wisconsin. To schedule a free consultation, call our\noffice at **715-298-4400**  or fill out a form and we will promptly contact\nyou.\n\n## Wausau Personal Injury Lawyer Helping Clients Make Fair Recoveries\n\nOver the past half-century, our legal team helped more than 70,000 clients\nrecover more than $1 billion for their injuries. We continue to do this\nimportant work from our office in the Galleria building in Wausau. From here,\nwe represent clients in Wausau and the surrounding communities, including but\nnot limited to Weston, Schofield, Marshfield, Antigo, Rhinelander, Stevens\nPoint, Wisconsin Rapids, Plover, Lacrosse, Eau Claire, Hudson, Superior, and\nAshland.\n\nOur firm has a national reputation for excellence. Our lawyers are recognized\nas Top 100 Trial Lawyers by the National Trial Lawyers, and our firm has been\nvoted best personal injury law firm in the Wisconsin Law Journal’s Reader\nRankings, year after year.\n\nInsurers know that we fight hard for each and every client and that if a fair\nsettlement can’t be reached that we will protect our clients in court.\n\nWe are ready to use our experience and passion for the law to help you get the\nrecovery that you deserve. Contact us by phone at 715-298-4400, online chat,\nor fill out our contact form today to have us contact you. Our office is\nalways open to take your call or online contact, and our Wausau office is open\nfor walk-ins from 8 a.m. to 5 p.m., Monday through Friday. Contact us today to\nschedule a _free consultation_ , which we can do in person, by phone, or by\nvideo conference.\n\n## Frequently Asked Questions\n\n### What Does an Injury Attorney Do?\n\nA Wausau personal injury lawyer provides legal representation to victims of\naccidents involving negligence or other wrongful acts. The team at Hupy and\nAbraham can handle a wide variety of cases in Wisconsin and represent victims\nwho were involved in the following types of accidents:\n\n  * Car or truck accidents\n  * Motorcycle accidents\n  * Dog bites\n  * Negligent security incidents\n  * Nursing home negligence or abuse\n  * Slip and fall accidents\n  * Drug or medical device injuries\n  * Police brutality\n\nIf your loved one was killed due to another person’s negligence or act of\nviolence, a personal injury lawyer can help you file a wrongful death claim to\nrecover the damages you deserve after your loved one’s untimely death.\n\n### How Can a Personal Injury Attorney in Wausau Help You?\n\nA personal injury attorney in Wausau, WI, will remove the stress of a lawsuit\nso you can focus on recovering from your injuries or loss. This can be done by\ndoing the following to help with your case:\n\n  * Keeping your legal rights protected and advising you throughout your case.\n  * Filing your personal injury claim properly and within the necessary timeframe.\n  * Collecting and preserving evidence that can be used to support your case. This may include eyewitness testimony, video or photos of the accident scene, copies of medical and police reports, and anything else that can prove another party was negligent and caused your injury.\n  * Placing a value on your case by calculating your losses and determining what damages you are entitled to receive.\n  * Negotiating with insurance companies, so you are not forced into accepting a settlement for less than your claim is worth.\n  * Representing you in court if your claim is not settled with the insurance company. A skilled personal injury lawyer will fight to ensure you get a positive outcome for your case.\n\n### When to Hire a Wausau Personal Injury Lawyer?\n\nIt is important to hire an experienced injury lawyer as soon as possible after\nbeing injured in an accident or incident involving negligence or wrongful\nacts. A personal injury lawyer will be able to review your case and advise you\non the best course of action. They can also begin gathering evidence and\nmedical records from doctors to help strengthen your case. An injury lawyer\ncan also represent you throughout the process of negotiating with insurance\ncompanies, making sure that you get full compensation for your losses.\n\nThere is a statute of limitations in Wisconsin for filing a personal injury\nlawsuit. The statute of limitations to file a personal injury claim in\nWisconsin is three years from the date of the accident. If you do not file\nyour claim within this timeframe, your claim may be dismissed, and you will\nnot be able to pursue damages. Hiring a personal injury lawyer will ensure\nthat your claim is filed before the statute of limitations expires.\n\n### How to Find the Best Personal Injury Lawyer in Wausau?\n\nWhen looking for a personal injury lawyer in Wausau, WI, make sure to do your\nresearch. Check online reviews and ask friends or family members who have been\nin similar situations for recommendations. It is also important to look for an\ninjury lawyer with experience handling cases like yours. You may also want to\nconsider using a lawyer you know personally or have used for another case in\nthe past.\n\nYou can consider the following factors to help narrow down your choices for\nthe best personal injury lawyer for your case:\n\n  * Reviewing a lawyer’s case results can give insight into what types of personal injury settlements other clients have been awarded and how many cases a specific lawyer or firm has won.\n  * Past client testimonials can show the satisfaction other clients have with the firm and its lawyers.\n  * Awards and accolades can give you valuable information on how the lawyer or law firm rates in the local community and the types of recognition they have received. The lawyers at Hupy and Abraham have been voted best and rated best by their clients and community.\n\nWhen you have narrowed down your list of potential lawyers, set up\nconsultations with each lawyer to get a better feel for what Wausau personal\ninjury you would like to represent your case.\n\n### What Percentage Does a PI Lawyer Take?\n\nPersonal injury lawyers typically take a contingency fee, meaning they do not\nget paid until after the case has been settled or won in court. The percentage\nof the fee depends on the lawyer, so it’s essential to do your research and\nfind out what types of fees they charge.\n\nMost personal injury lawyers work on a contingency fee basis, meaning their\nfee is based on a percentage of your final settlement or amount received in\ncourt. Generally speaking, these fees range depending on the lawyer, the\ncomplexity of the case, and other factors. It’s important to make sure that\nyou understand exactly how much your lawyer will be charging before signing\nany contracts. You should also be aware that there may be additional costs\ninvolved if the case goes to trial.\n\n### What to Ask a Personal Injury Lawyer During a Consult\n\nIf you’ve been injured in an accident, it’s important that you know what\nquestions to ask when speaking with an experienced Wausau personal injury\nlawyer. A successful consultation will give you the information and support\nyou need to make the best decision for your case.\n\nWhen consulting with an injury lawyer, there are several important questions\nto ask. The answers to your questions can help you make your final decision on\nwhether they are the right lawyer for your personal injury case. Some\nquestions to ask may include the following:\n\n  * How many years have you been practicing in this field?\n  * Have you handled cases similar to mine before?\n  * What results have you achieved in similar personal injury cases?\n  * What do you think my case is worth?\n  * What type of evidence would be needed for my case?\n  * Do you see any challenges or downfalls with my case?\n  * Who would be my point of contact if I have questions or need updates during the duration of my case?\n  * How fast do you respond if I have questions?\n  * What are your preferred means of communication with your clients?\n  * What time do I have to file a personal injury lawsuit in Wisconsin?\n  * What are your legal fees? Do you work on a contingency?\n  * Are you prepared to represent me if my personal injury case goes to trial?\n\nFiling a personal injury claim can be stressful, so it is important that you\nfeel comfortable with the lawyer representing you throughout the process.\nAsking these questions during your initial consultation is essential for\nmaking sure that your case is handled properly and efficiently and that any\ncosts associated with it are clearly outlined from the start. If there are\ndoubts at your consultation about whether the lawyer is a good fit for your\ncase, they may not be the right choice for you.\n\nPersonal Injury+ Car Accidents+ Motorcycle Accidents+ Truck Accidents+ Slip\nand Fall+ Negligent Security+ Dog Bites+ Pharmaceutical Class Action+ Wrongful\nDeath+ Police Brutality+ Servicios en Español+ See All+\n\nWhat We Do\n\n## Our Areas of Expertise\n\nOur personal injury lawyers are experienced in helping people who have been\nhurt in all kinds of accidents throughout Wisconsin.\n\nContact Us\n\nWho We Are\n\n## Our Personal Injury Lawyers\n\nOur award winning law firm consist of over 25 highly rated personal injury\nlawyers and 175 support staff. See why the attorneys at Hupy and Abraham are\nVoted Best, Rated Best year after year.\n\nView All Attorneys and Staff\n\n⭐⭐⭐⭐⭐ \"After not getting anywhere dealing with the at fault drivers insurance\ncompany, I decided to consult with an attorney and chose Hupy and Abraham\nbased on their television commercials. That was the best thing I could ever\nhave done!...They got a much larger settlement than I would ever have got on\nmy own. And I didn't have to deal with anyone else or worry about the medical\nbills, they did that all for me.\" Julie S.\n\nOnline Reviews\n\n## Reviews From Clients in Wausau\n\nWe’ve spent the last five decades delivering measurable results and providing\noutstanding customer service to our clients.\n\nMore than $1 BILLION collected for thousands of satisfied clients. Committed\nto the community for more than 50 Years.\n\n$100,000  HUPY AND ABRAHAM GETS TWO INSURANCE COMPANIES TO PAY $125,000\n$125,000 FOR INJURED PASSENGER AFTER OTHER DRIVER FAILS TO YIELD $250,000\n$250,000 FOR CLIENT AFTER REJECTING LOW INSURANCE OFFER\n\nRESULTS\n\n## Our Personal Injury Attorneys Have Recovered Over $1 Billion for Our\nClients\n\nOur car accident lawyers are committed to getting top-dollar settlements for\nevery client we represent. Here, you can read about our most recent car\naccident and personal injury cases in Wisconsin, Illinois, and Iowa.\n\nDriving Directions\n\n## Directions to our Personal Injury Law Firm in Wausau, Wisconsin\n\n### From the North (Merrill, Woodruff):\n\n  * Take **Hwy 51/I-39 South.**\n  * Take **Exit 192-Stewart Avenue/WI- 52.**\n  * Turn **left** onto **Stewart Avenue/WI- 52.**\n  * Turn **right** onto **S. 18th Avenue** (second light).\n  * Turn **right** onto **Stewart Avenue** (first light).\n  * Turn **left** onto **S. 24th Avenue** (second light by Applebee’s).\n  * Turn **left** into the **second driveway.**\n  * Office is in the Galleria Building (building 505), ahead on the **left.**\n  *  **Suite 102** in located on the first floor on the right.\n\n### From the South (Mosinee, Stevens Point):\n\n  * Take **Hwy 51/I-39 North.**\n  * Take **Exit 191B-Sherman Street.**\n  * Continue **straight** onto **24th Avenue** (at lights at bottom of ramp).\n  * Turn **right** into the driveway **after** Hampton Inn.\n  * Office is in the Galleria Building (building 505), ahead on the **left.**\n  *  **Suite 102** in located on the first floor on the right.\n\n### From the West (Stanley, Chippewa Falls):\n\n  * Take **WI-29 East.**\n  * Take **Exit** **164A** - **Stewart** **Avenue** toward **WI-52.**\n  * Turn **right** onto **Stewart Avenue** (at light).\n  * Turn **right** onto **S. 24th Avenue** (second light by Applebee’s).\n  * Turn **left** into the **second driveway.**\n  * Office is in the Galleria Building (building 505), ahead on the **left.**\n  *  **Suite 102** in located on the first floor on the right.\n\n### From the East (Shawano, Pulaski):\n\n  * Drive on **Hwy 29 West.**\n  * Continue to **Hwy 51/I-39 North.**\n  * Take **Exit 191B-Sherman Street.**\n  * Continue **straight** onto **24th Avenue** (at lights at bottom of ramp).\n  * Turn **right** into the driveway **after** Hampton Inn.\n  * Office is in the Galleria Building (building 505), ahead on the **left.**\n  *  **Suite 102** in located on the first floor on the right.\n\n## Helpful Videos\n\nWatch All\n\nHupy and Abraham, S.C. - Office Spotlight - Wausau\n\nToriano Called Hupy and Abraham, S.C. After His Motorcycle Accident and Got a\nBIG Win\n\nQ and Abraham - How Much Is My Personal Injury Case Worth? | Hupy and Abraham,\nS.C.\n\nDoug Ross - Attorney at Hupy and Abraham, S.C.\n\nAfter Another Personal Injury Lawyer Couldn't Get the Job Done, Judy Called\nHupy and Abraham, S.C.\n\nWhat You Should NEVER Say to the Insurance Company After An Accident\n\n#### Receive Fair Compensation\n\nFirst Name *\n\nLast Name *\n\nPhone *\n\nEmail *\n\nTell Us More *\n\nPlease sign me up for your ENewsletter\n\nGet My Free Case Evaluation Now\n\nProtected By Google reCAPTCHAPrivacy \\- Terms\n\nContact our Personal Injury Lawyers\n\n## If You Can't Come To Our Office, We Will Come To You!\n\nLocations\n\n### Wisconsin\n\n### Illinois\n\n### Iowa\n\nHupy and Abraham, S.C. 111 E Kilbourn Ave #1100  \nMilwaukee, WI 53202  Phone: 414-223-4800 Toll Free: 1-800-800-5678 Fax:\n414-271-3374 Office Hours: Available 24/7/365 Office Info Get Directions Hupy\nand Abraham, S.C. 3945 W College Ave  \nAppleton, WI 54914  Phone: 920-882-8382 Toll Free: 1-800-800-5678 Fax:\n920-750-5397 Office Hours: Available 24/7/365 Office Info Get Directions Hupy\nand Abraham, S.C. 2830 Ramada Way #100  \nGreen Bay, WI 54304  Phone: 920-593-5050 Toll Free: 800-800-5678 Fax:\n920-593-5055 Office Hours: Available 24/7/365 Office Info Get Directions Hupy\nand Abraham, S.C. 3001 W Beltline Hwy, Suite 204  \nMadison, WI 53713  Phone: 608-277-7777 Toll Free: 888-277-4879 Fax:\n608-274-1848 Office Hours: Available 24/7/365 Office Info Get Directions Hupy\nand Abraham, S.C. 505 S 24th Ave #300  \nWausau, WI 54401  Phone: 715-298-4400 Toll Free: 800-800-5678 Fax:\n715-298-4405 Office Hours: Available 24/7/365 Office Info Get Directions Hupy\nand Abraham 3801 General Electric Rd #3  \nBloomington, IL 61704  Phone: 309-827-4800 Toll Free: 866-532-4800 Fax:\n309-827-6525 Office Hours: Available 24/7/365 Office Info Get Directions Hupy\nand Abraham 6475 Washington St #105  \nGurnee, IL 60031  Phone: 847-625-5500 Toll Free: 866-625-2299 Fax:\n847-625-6318 Office Hours: Available 24/7/365 Office Info Get Directions Hupy\nand Abraham 6952 Rote Rd #200  \nRockford, IL 61107  Phone: 815-877-3900 Toll Free: 800-390-6350 Fax:\n815-282-8174 Office Hours: Available 24/7/365 Office Info Get Directions Hupy\nand Abraham, S.C., P.C. 1233 1st Ave SE Suite C  \nCedar Rapids, IA 52402  Phone: 319-731-9009 Toll Free: 888-807-2752 Fax:\n515-777-3399 Office Hours: Available 24/7/365 Office Info Get Directions Hupy\nand Abraham, S.C., P.C. 1089 Jordan Creek Pkwy  \nSuite 265  \nWest Des Moines, IA 50266  Phone: 515-984-0091 Toll Free: 888-807-2752 Fax:\n515-777-3399 Office Hours: Available 24/7/365 Office Info Get Directions Hupy\nand Abraham, S.C., P.C. 2020 Kimberly Rd, Suite B  \nDavenport, IA 52807  Phone: 563-275-6892 Toll Free: 888-807-2752 Fax:\n563-359-0592 Office Hours: Available 24/7/365 Office Info Get Directions\n\nConnect With Us\n\n__ __ __ __ __\n\nSign Up For Our Newsletter\n\nRequest a Donation Careers\n\n©2024 Hupy and Abraham, S.C., All Rights Reserved, Reproduced with Permission\nPrivacy Policy Site Map DSS Login\n\nWebsite Built by  Foster Web Marketing Website Powered By  Dynamic Self-\nSyndication (DSS™)\n\nScroll to Top\n\n",
    "links": "[{\"link\": \"https://www.hupy.com/\", \"text\": \"\"}, {\"link\": \"https://www.hupy.com/reports/abogados-de-lesiones-personales.cfm\", \"text\": \"Español\"}, {\"link\": \"https://www.hupy.com/\", \"text\": \"Home\"}, {\"link\": \"https://www.hupy.com/bio.cfm\", \"text\": \"\"}, {\"link\": \"https://www.hupy.com/aboutus.cfm\", \"text\": \"About Our Firm\"}, {\"link\": \"https://www.hupy.com/bio.cfm\", \"text\": \"Our Team\"}, {\"link\": \"https://www.hupy.com/library/contributing-to-the-community/\", \"text\": \"Community Involvement\"}, {\"link\": \"https://www.hupy.com/library/career-opportunities.cfm\", \"text\": \"Careers\"}, {\"link\": \"https://www.hupy.com/library/press-room.cfm\", \"text\": \"Press Room / Firm News\"}, {\"link\": \"https://www.hupy.com/practice_areas/\", \"text\": \"\"}, {\"link\": \"https://www.hupy.com/practice_areas/wisconsin-personal-injury-lawyers.cfm\", \"text\": \"\"}, {\"link\": \"https://www.hupy.com/practice_areas/wisconsin-car-accident-lawyers.cfm\", \"text\": \"Car Accident Lawyer\"}, {\"link\": \"https://www.hupy.com/practice_areas/motorcycle-accident-lawyers-wisconsin.cfm\", \"text\": \"Motorcycle Accident Lawyer\"}, {\"link\": \"https://www.hupy.com/practice_areas/wisconsin-truck-accident-attorneys.cfm\", \"text\": \"Truck Accident Lawyer\"}, {\"link\": \"https://www.hupy.com/practice_areas/wisconsin-slip-and-fall-lawyers.cfm\", \"text\": \"Slip and Fall Lawyer\"}, {\"link\": \"https://www.hupy.com/practice_areas/wisconsin-negligent-security-lawyers.cfm\", \"text\": \"Negligent Security Lawyer\"}, {\"link\": \"https://www.hupy.com/practice_areas/wisconsin-dog-bite-lawyers.cfm\", \"text\": \"Dog Bite Lawyer\"}, {\"link\": \"https://www.hupy.com/practice_areas/wisconsin-drug-injury-pharmaceutical-lawyers.cfm\", \"text\": \"Drug Injury Lawyer\"}, {\"link\": \"https://www.hupy.com/practice_areas/wisconsin-wrongful-death-lawyers.cfm\", \"text\": \"Wrongful Death Lawyer\"}, {\"link\": \"https://www.hupy.com/practice_areas/wisconsin-police-brutality-lawyers.cfm\", \"text\": \"Police Brutality Lawyer\"}, {\"link\": \"https://www.hupy.com/practice_areas/illinois-personal-injury-lawyers.cfm\", \"text\": \"\"}, {\"link\": \"https://www.hupy.com/practice_areas/illinois-car-accident-lawyers.cfm\", \"text\": \"Car Accident Lawyer\"}, {\"link\": \"https://www.hupy.com/practice_areas/illinois-motorcycle-accident-lawyers.cfm\", \"text\": \"Motorcycle Accident Lawyer\"}, {\"link\": \"https://www.hupy.com/practice_areas/illinois-truck-accident-lawyers.cfm\", \"text\": \"Truck Accident Lawyer\"}, {\"link\": \"https://www.hupy.com/practice_areas/illinois-slip-and-fall-lawyers.cfm\", \"text\": \"Slip and Fall Lawyer\"}, {\"link\": \"https://www.hupy.com/practice_areas/illinois-negligent-security-claims-lawyers.cfm\", \"text\": \"Negligent Security Lawyer\"}, {\"link\": \"https://www.hupy.com/practice_areas/illinois-dog-bite-lawyers.cfm\", \"text\": \"Dog Bite Lawyer\"}, {\"link\": \"https://www.hupy.com/practice_areas/illinois-drug-injury-lawyers.cfm\", \"text\": \"Drug Injury Lawyer\"}, {\"link\": \"https://www.hupy.com/practice_areas/illinois-wrongful-death-lawyers.cfm\", \"text\": \"Wrongful Death Lawyer\"}, {\"link\": \"https://www.hupy.com/practice_areas/illinois-police-brutality-attorneys.cfm\", \"text\": \"Police Brutality Lawyer\"}, {\"link\": \"https://www.hupy.com/practice_areas/iowa-personal-injury-lawyers.cfm\", \"text\": \"\"}, {\"link\": \"https://www.hupy.com/practice_areas/iowa-car-accident-lawyers.cfm\", \"text\": \"Car Accident Lawyer\"}, {\"link\": \"https://www.hupy.com/practice_areas/iowa-motorcycle-accident-injury-lawyers.cfm\", \"text\": \"Motorcycle Accident Lawyer\"}, {\"link\": \"https://www.hupy.com/practice_areas/iowa-truck-accident-attorneys.cfm\", \"text\": \"Truck Accident Lawyer\"}, {\"link\": \"https://www.hupy.com/practice_areas/iowa-slip-and-fall-lawyers.cfm\", \"text\": \"Slip and Fall Lawyer\"}, {\"link\": \"https://www.hupy.com/practice_areas/iowa-negligent-security-lawyers.cfm\", \"text\": \"Negligent Security Lawyer\"}, {\"link\": \"https://www.hupy.com/practice_areas/iowa-dog-bite-lawyer.cfm\", \"text\": \"Dog Bite Lawyer\"}, {\"link\": \"https://www.hupy.com/practice_areas/iowa-pharmaceutical-drug-injury-lawyers.cfm\", \"text\": \"Drug Injury Lawyer\"}, {\"link\": \"https://www.hupy.com/practice_areas/iowa-wrongful-death-lawyers.cfm\", \"text\": \"Wrongful Death Lawyer\"}, {\"link\": \"https://www.hupy.com/practice_areas/iowa-police-brutality-lawyers.cfm\", \"text\": \"Police Brutality Lawyer\"}, {\"link\": \"https://www.hupy.com/practice_areas/iowa-workers-compensation-attorneys.cfm\", \"text\": \"Workers' Compensation Lawyer\"}, {\"link\": \"https://www.hupy.com/case-results.cfm\", \"text\": \"\"}, {\"link\": \"https://www.hupy.com/case-results.cfm\", \"text\": \"Case Results\"}, {\"link\": \"https://www.hupy.com/testimonials.cfm\", \"text\": \"Testimonials\"}, {\"link\": \"https://www.hupy.com/library/awards-and-accolades.cfm\", \"text\": \"Awards\"}, {\"link\": \"https://www.hupy.com/reports/personal-injury-resource-center.cfm\", \"text\": \"\"}, {\"link\": \"https://www.hupy.com/faq.cfm\", \"text\": \"FAQs\"}, {\"link\": \"https://www.hupy.com/video/\", \"text\": \"Videos\"}, {\"link\": \"https://www.hupy.com/library/\", \"text\": \"Library Articles\"}, {\"link\": \"https://www.hupy.com/news.cfm\", \"text\": \"\"}, {\"link\": \"https://www.hupy.com/library/firm-newsletters/\", \"text\": \"Our Firm Newsletters\"}, {\"link\": \"https://www.hupy.com/library/rider-resources/\", \"text\": \"Our Rider Newsletters\"}, {\"link\": \"https://www.hupy.com/reports/\", \"text\": \"\"}, {\"link\": \"https://www.hupy.com/reports/#top-offers\", \"text\": \"Top Offers & Contests\"}, {\"link\": \"https://www.hupy.com/reports/#wisconsin-car-accidents\", \"text\": \"Free Accident Guides\"}, {\"link\": \"https://www.hupy.com/reports/#bumper-stickers\", \"text\": \"Bumper Stickers\"}, {\"link\": \"https://www.hupy.com/reports/#cards\", \"text\": \"Cards\"}, {\"link\": \"https://www.hupy.com/reports/#brochures\", \"text\": \"Brochures\"}, {\"link\": \"https://www.hupy.com/reports/#spanish-materials\", \"text\": \"Spanish Materials\"}, {\"link\": \"https://www.hupy.com/library/calendar.cfm\", \"text\": \"Events\"}, {\"link\": \"https://www.hupy.com/contact.cfm\", \"text\": \"\"}, {\"link\": \"https://www.hupy.com/offices/milwaukee-personal-injury-attorneys.cfm\", \"text\": \"Milwaukee\"}, {\"link\": \"https://www.hupy.com/offices/appleton-wi-accident-lawyers.cfm\", \"text\": \"Appleton\"}, {\"link\": \"https://www.hupy.com/offices/green-bay--wisconsin-office.cfm\", \"text\": \"Green Bay\"}, {\"link\": \"https://www.hupy.com/offices/madison-wi-personal-injury-lawyers.cfm\", \"text\": \"Madison\"}, {\"link\": \"https://www.hupy.com/offices/wausau-personal-injury-attorneys.cfm\", \"text\": \"Wausau\"}, {\"link\": \"https://www.hupy.com/offices/personal-injury-attorneys-bloomington-il.cfm\", \"text\": \"Bloomington\"}, {\"link\": \"https://www.hupy.com/offices/gurnee-accident-attorneys.cfm\", \"text\": \"Gurnee\"}, {\"link\": \"https://www.hupy.com/offices/personal-injury-attorney-rockford-il.cfm\", \"text\": \"Rockford\"}, {\"link\": \"https://www.hupy.com/offices/cedar-rapids-personal-injury-attorney.cfm\", \"text\": \"Cedar Rapids\"}, {\"link\": \"https://www.hupy.com/offices/des-moines--iowa-auto-accident-attorney.cfm\", \"text\": \"Des Moines\"}, {\"link\": \"https://www.hupy.com/offices/personal-injury-attorneys-in-quad-cities-ia.cfm\", \"text\": \"Davenport\"}, {\"link\": \"https://www.hupy.com/contact.cfm\", \"text\": \"Contact\"}, {\"link\": \"https://www.hupy.com/\", \"text\": \"Home\"}, {\"link\": \"https://www.hupy.com/contact.cfm\", \"text\": \"Offices\"}, {\"link\": \"https://www.hupy.com/practice_areas/wisconsin-dog-bite-lawyers.cfm\", \"text\": \"dog bites\"}, {\"link\": \"https://www.hupy.com/faqs/milwaukee-attorney-explains-the-wi-statute-of-limitations.cfm\", \"text\": \"statute of limitations\"}, {\"link\": \"https://www.hupy.com/library/awards-and-accolades.cfm\", \"text\": \"Awards and accolades\"}, {\"link\": \"https://www.hupy.com/practice_areas/wisconsin-personal-injury-lawyers.cfm\", \"text\": \"\"}, {\"link\": \"https://www.hupy.com/practice_areas/wisconsin-car-accident-lawyers.cfm\", \"text\": \"\"}, {\"link\": \"https://www.hupy.com/practice_areas/motorcycle-accident-lawyers-wisconsin.cfm\", \"text\": \"\"}, {\"link\": \"https://www.hupy.com/practice_areas/wisconsin-truck-accident-attorneys.cfm\", \"text\": \"\"}, {\"link\": \"https://www.hupy.com/practice_areas/wisconsin-slip-and-fall-lawyers.cfm\", \"text\": \"\"}, {\"link\": \"https://www.hupy.com/practice_areas/wisconsin-negligent-security-lawyers.cfm\", \"text\": \"\"}, {\"link\": \"https://www.hupy.com/practice_areas/wisconsin-dog-bite-lawyers.cfm\", \"text\": \"\"}, {\"link\": \"https://www.hupy.com/practice_areas/wisconsin-drug-injury-pharmaceutical-lawyers.cfm\", \"text\": \"\"}, {\"link\": \"https://www.hupy.com/practice_areas/wisconsin-wrongful-death-lawyers.cfm\", \"text\": \"\"}, {\"link\": \"https://www.hupy.com/practice_areas/wisconsin-police-brutality-lawyers.cfm\", \"text\": \"\"}, {\"link\": \"https://www.hupy.com/reports/abogados-de-lesiones-personales.cfm\", \"text\": \"\"}, {\"link\": \"https://www.hupy.com/practice_areas/\", \"text\": \"\"}, {\"link\": \"https://www.hupy.com/contact.cfm\", \"text\": \"Contact Us\"}, {\"link\": \"https://www.hupy.com/bio.cfm\", \"text\": \"View All Attorneys and Staff\"}, {\"link\": \"https://www.hupy.com/case_results/hupy-and-abraham-gets-two-insurance-companies-to-pay.cfm\", \"text\": \"\"}, {\"link\": \"https://www.hupy.com/case_results/-125-000-for-injured-passenger-after-other-driver-fails-to-yield.cfm\", \"text\": \"\"}, {\"link\": \"https://www.hupy.com/case_results/-250-000-for-client-after-rejecting-low-insurance-offer.cfm\", \"text\": \"\"}, {\"link\": \"https://www.hupy.com/video/\", \"text\": \"Watch All\"}, {\"link\": \"https://www.hupy.com/offices/milwaukee-personal-injury-attorneys.cfm\", \"text\": \"Office Info\"}, {\"link\": \"https://www.hupy.com/offices/appleton-wi-accident-lawyers.cfm\", \"text\": \"Office Info\"}, {\"link\": \"https://www.hupy.com/offices/green-bay--wisconsin-office.cfm\", \"text\": \"Office Info\"}, {\"link\": \"https://www.hupy.com/offices/madison-wi-personal-injury-lawyers.cfm\", \"text\": \"Office Info\"}, {\"link\": \"https://www.hupy.com/offices/wausau-personal-injury-attorneys.cfm\", \"text\": \"Office Info\"}, {\"link\": \"https://www.hupy.com/offices/personal-injury-attorneys-bloomington-il.cfm\", \"text\": \"Office Info\"}, {\"link\": \"https://www.hupy.com/offices/gurnee-accident-attorneys.cfm\", \"text\": \"Office Info\"}, {\"link\": \"https://www.hupy.com/offices/personal-injury-attorney-rockford-il.cfm\", \"text\": \"Office Info\"}, {\"link\": \"https://www.hupy.com/offices/cedar-rapids-personal-injury-attorney.cfm\", \"text\": \"Office Info\"}, {\"link\": \"https://www.hupy.com/offices/des-moines-personal-injury-lawyer.cfm\", \"text\": \"Office Info\"}, {\"link\": \"https://www.hupy.com/offices/personal-injury-attorneys-in-quad-cities-ia.cfm\", \"text\": \"Office Info\"}, {\"link\": \"https://www.hupy.com/email-newsletter-sign-up-form/\", \"text\": \"Sign Up For Our Newsletter\"}, {\"link\": \"https://www.hupy.com/reports/donation-request.cfm\", \"text\": \"Request a Donation\"}, {\"link\": \"https://www.hupy.com/library/career-opportunities.cfm\", \"text\": \"Careers\"}, {\"link\": \"https://www.hupy.com/privacy.cfm\", \"text\": \"Privacy Policy\"}, {\"link\": \"https://www.hupy.com/sitemap.cfm\", \"text\": \"Site Map\"}]"
}