{
    "summary": "Skip to Content\n\n  * Testimonials\n  * Case Results\n  * Blog\n  * Contact Us\n\nCall Us Today! 715-402-4343\n\n  * Home\n  * About\n\n    * Our Video Center\n\n  * Our Attorneys\n\n    * Steven B. Goff\n    * Dean R. Rohde\n    * Tracy N. Tool\n    * Robert A. Parsons\n    * Brian F. Laule\n    * Cristina M. Wirth\n    * Martha H. Heidt\n    * Nicole R. Wells\n\n  * Practice Areas\n\n    * ATV Accidents\n    * Bicycle & Pedestrian Accidents\n    * Birth Injuries\n    * Boating Accidents\n    * Bus Accidents\n    * Catastrophic Injuries\n      * Amputation Injuries\n      * Back Injuries\n      * Brain Injuries\n      * Eye Injuries\n      * Head Injuries\n      * Knee Injuries\n      * Neck Injuries\n      * Shoulder Injuries\n      * Soft Tissue Injuries\n    * Car Accidents\n      * Distracted Driving Accidents\n      * Drunk Driving Accidents\n    * Construction Accidents\n    * Defective Products\n    * Dog Bites\n    * Farm Accidents\n    * Jet Ski Accidents\n    * Motorcycle Accidents\n    * Nursing Home Neglect\n    * Plane Crash Accidents\n    * RV Accidents\n    * Slip & Fall\n    * Snowmobile Accidents\n    * Truck Accidents\n    * Workplace Injuries\n    * Wrongful Death\n\n  * Locations We Serve\n\n    * Eau Claire\n    * La Crosse\n    * River Falls\n    * Wausau\n    * Minneapolis/St. Paul\n    * Duluth/Superior\n\n  * _Close_\n\n  * Home\n  * About\n    * Main Menu\n    * Our Video Center\n  * Our Attorneys\n    * Main Menu\n    * Steven B. Goff\n    * Dean R. Rohde\n    * Tracy N. Tool\n    * Robert A. Parsons\n    * Brian F. Laule\n    * Cristina M. Wirth\n    * Martha H. Heidt\n    * Nicole R. Wells\n  * Practice Areas\n    * Main Menu\n    * ATV Accidents\n    * Bicycle & Pedestrian Accidents\n    * Birth Injuries\n    * Boating Accidents\n    * Bus Accidents\n    * Catastrophic Injuries\n      * Amputation Injuries\n      * Back Injuries\n      * Brain Injuries\n      * Eye Injuries\n      * Head Injuries\n      * Knee Injuries\n      * Neck Injuries\n      * Shoulder Injuries\n      * Soft Tissue Injuries\n    * Car Accidents\n      * Distracted Driving Accidents\n      * Drunk Driving Accidents\n    * Construction Accidents\n    * Defective Products\n    * Dog Bites\n    * Farm Accidents\n    * Jet Ski Accidents\n    * Motorcycle Accidents\n    * Nursing Home Neglect\n    * Plane Crash Accidents\n    * RV Accidents\n    * Slip & Fall\n    * Snowmobile Accidents\n    * Truck Accidents\n    * Workplace Injuries\n    * Wrongful Death\n  * Locations We Serve\n    * Main Menu\n    * Eau Claire\n    * La Crosse\n    * River Falls\n    * Wausau\n    * Minneapolis/St. Paul\n    * Duluth/Superior\n\n  * Testimonials\n  * Case Results\n  * Blog\n  * Contact Us\n\n  * Contact Us \n  * Call Us Today! \n\n**Follow Us**\n\n  *   * LinkedIn\n  * \n\nFree & Confidential Consultation\n\nTop\n\n**_Have You Been Injured in Wausau?_ We Get Results **\n\n####  **We’re Ready to Help** Contact Us Today\n\nAt Bye, Goff & Rohde we offer free and confidential consultations.\n\n  * *First Name\n\nPlease enter your first name.\n\n  * *Last Name\n\nPlease enter your last name.\n\n  * *Phone\n\nPlease enter your phone number.\n\nThis isn't a valid phone number.\n\n  * *Email\n\nPlease enter your email address.\n\nThis isn't a valid email address.\n\n  * *Are you a new client? Yes, I am a potential new client No, I'm a current existing client I'm neither.\n\nPlease make a selection.\n\n  * ZJTVQM\n\nPlease enter the captcha code above:\n\n  * *How can we help you?\n\nPlease enter a message.\n\nSend Message\n\n# Wausau Personal Injury Attorneys\n\nAt Bye, Goff & Rohde, our Wausau personal injury lawyers are experienced and\npassionate advocates for injured clients. You deserve an attorney who is\npersistent and willing to go the extra mile to work toward a fair outcome on\nyour behalf. Where other attorneys look to settle quickly and move on, Bye,\nGoff & Rohde has developed a reputation for being willing to go to trial if\nthat's what it takes to get you an equitable outcome.\n\n* * *\n\n **Give us a call at (715) 402-4343 to schedule your free consultation\ntoday.**\n\n* * *\n\n## What Is Personal Injury?\n\n\"Personal injury\" is a legal term that refers to physical, emotional, or\npsychological harm inflicted upon an individual as a result of the negligent\nor intentional acts of another person or entity. Examples of personal injury\ninclude car accidents, slip and falls, product liability, wrongful death, and\nmore.\n\nRegardless of the cause of your injury, you may be entitled to financial\ncompensation for medical expenses, pain and suffering, and more. This includes\nmoney for medical bills, lost wages, and losses such as pain and suffering. In\nsome cases, punitive damages may also be awarded if the defendant's conduct\nwas incredibly reckless or malicious; however, this is very rare.\n\nTo receive compensation for a personal injury claim, it must be proven that\nanother party's negligence caused an accident or incident resulting in bodily\nharm. Negligence can take many forms, including distracted driving, failure to\nwarn consumers about potential dangers from products on the market, and more.\nTo maximize any potential compensation, it is crucial to consult with a\nknowledgeable personal injury attorney who can help assess any potential\nclaims and guide you through this difficult time.\n\n## Types of Cases We Handle\n\nWe pride ourselves on our versatility and make a point to offer committed and\nreliable legal representation in as many areas of personal injury law as\npossible.\n\n **Some of the cases we handle include the following:**\n\n  *  **Vehicle Accidents:** Whether it's a car accident, truck accident, or motorcycle accident, we can help you pursue damages for your physical and emotional injuries. \n  *  **Slip and Fall Accidents** **:** If you are injured due to hazardous conditions on someone else's property (a business or residence), you may be able to recover compensation for your medical bills, lost wages, and pain and suffering. \n  *  **Product Liability:** Injuries caused by dangerous products should be taken very seriously. Product liability cases involve faulty design, manufacturing defects, and failure to provide adequate warnings or instructions regarding the product's use. \n  *  **Wrongful Death** **:** The death of a loved one due to another person's negligence or intentional act can be devastating. We can help surviving family members seek compensation for their loss. \n\nPlease get in touch with us if your injury or situation is not mentioned in\nthe list above. We would be happy to discuss your case and determine whether\nor not one of our Wausau personal injury lawyers can represent you.\n\n## What Damages Can I Recover in My Personal Injury Case?\n\nWhen it comes to personal injury cases, the potential damages available to an\ninjured person can vary greatly depending on the specifics of the case.\nGenerally speaking, three main types of damages are commonly sought in a\npersonal injury claim: special damages, general damages, and punitive damages.\n\n  *  **Special damages** refer to a financial loss suffered due to an injury caused by the negligent or wrongful act of another. Special damages are intended to compensate an injured party for losses that can be objectively quantified, such as lost wages and medical expenses. They may also include compensation for anticipated future losses, such as lost earning capacity or diminished quality of life. The goal of awarding special damages is to place the injured party in the same financial position they would have been in had the injury not occurred. \n  *  **General damages** are damages that are not related to the financial impact of an injury. These damages are awarded to compensate a plaintiff for pain and suffering, loss of enjoyment of life, emotional distress, loss of consortium, mental anguish, and other non-monetary losses. General damages vary from case to case based on the severity and duration of the injury, as well as the personal experiences of the plaintiff. For instance, in cases involving paralysis or amputation, long-term physical effects may result in high general damages awards.\n  *  **Punitive damages** serve a different purpose than general and special damages— they are awarded to punish a wrongdoer for especially egregious behavior and act as a deterrent against similar conduct in the future. Punitive damages can be granted if it is determined that the defendant acted with malice or intent to harm another individual; however, these are awarded very rarely. \n\nOverall, when considering these various forms of recovery, it is essential to\nremember that each case is unique and will require careful consideration when\ndetermining which type(s) of compensation may be available. We can help guide\nyou through this process and advise you on your best course of action.\n\n* * *\n\n **If you have suffered an injury due to someone else's carelessness, call us\nat (715) 402-4343 or** **contact us** **online for a free consultation.**\n\n* * *\n\n  * **$6.0 Million** _Drunk Driving Accident_\n\n  * **$2.4 Million** _Distracted Driving Accident_\n\n  * **$2.3 Million** _Spinal Cord Injury_\n\n  * **$2.17 Million** _Tractor-Trailer Accident_\n\n  * **$2.0 Million** _Burn Injury_\n\n##### Wausau Personal Injury Lawyers\n\n  * Car Accidents\n  * Slip & Fall\n  * Wrongful Death\n  * Truck Accidents\n  * Motorcycle Accidents\n\nA personal injury lawyer can help win your case by providing a wealth of\nexperience and knowledge in personal injury law. We can provide valuable\ninsight into the laws pertaining to accidents and will build a compelling\nlegal argument on your behalf. Our lawyers will identify potential sources of\nevidence, such as witness testimony, medical records, photographs, and other\ndocuments that can be used to strengthen your case.\n\nAdditionally, we are knowledgeable about filing procedures and deadlines for\npaperwork, which is essential for ensuring that your case is adequately\npresented in court. Moreover, we will negotiate with insurance companies in\npursuit of an appropriate settlement for you.\n\nUltimately, having an experienced personal injury attorney on your side\nensures that all aspects of your case are addressed effectively.\n\n## How Much Does a Personal Injury Lawyer Cost?\n\nThe cost of a personal injury lawyer can vary depending on the case's\ncomplexity and other factors. Generally, fees for these types of cases are\nbased on contingency. This means that the lawyer will only be paid if they\nrecover compensation on behalf of their client.\n\nThe fee amount is usually decided as a percentage of the overall settlement or\naward obtained in the case. This differs from hourly billing, which would\nrequire the client to pay for all costs related to the case regardless of its\noutcome. We will not collect payment unless your claim is successful.\n\n## How Much Is My Case Worth?\n\nThe value of a personal injury case is highly dependent on the details of the\nincident and the resulting damages you suffered. Factors such as the extent of\nphysical or emotional harm, lost wages, medical expenses, and even intangible\nlosses such as pain and suffering must all be considered when determining the\nworth of a personal injury case.   **To determine the value of your case, we\nwill conduct an assessment based on factors such as:  **\n\n  * The type and severity of your injuries\n  * How much money you have spent (or are likely to spend) on medical bills \n  * Whether you can continue working after the accident \n  * Any permanent disabilities you may have suffered\n  * How much income has been lost due to missed work\n  * The amount of compensation offered by insurance companies \n  * If punitive damages might be awarded in addition to any compensatory damages \n\nWe can help you understand what types of compensation you may be entitled to\nfor your injuries and losses and advise you on whether it is wise to accept\nany offers from insurance companies before filing a lawsuit. Additionally, we\nwill explain all legal options available to pursue fair compensation for your\npain and suffering.\n\n## Process When Hiring a Wausau Personal Injury Attorney\n\nThe law is broad and complex. It is our job to make the legal process easier\nfor you while communicating with you every step of the way. After an accident,\nyou are going through a lot while trying to put together the pieces. Allow our\nWausau personal injury lawyers, with over 180 years of experience, to work for\nYOU. We are committed to representing our Wausau neighbors in personal injury\ncases. Call our office for a free, no-obligation consultation and talk to\nsomeone who can make a difference.\n\n **Common Types of Accidents:**\n\n  * Car Accident\n  * Truck Accident\n  * Bicycle & Pedestrian Accident\n  * Motorcycle Accident\n\n **Common Types of Personal Injury Claims:**\n\n  * Dog Bite\n  * Slip & Fall\n  * Brain Injury\n\nHear From Our Past Client's Real Clients. Real Stories.\n\n> **\"Thank You Brian Laule!\"**\n>\n> Brian is a very knowledgeable attorney, who pays very close attention to\n> detail. He presents himself in a very sure manner. He made sure that my\n> questions were answered and that I knew and understood what to expect\n> throughout the entire process.\n>\n> **\\- Diane**\n\nRead More Testimonials\n\n}\">\n\n## What Our Clients Are Saying\n\n **The Definition of Professional:  **Attorney Dean Rohde helped with my\nhusband's personal injury lawsuit, and for the whole 3 years, Dean and his\nteam were the definition of professionalism. I couldn't imagine going through\nthis alone. Dean made this horrible period in our life way easier than I could\never imagine it being. We received far more in compensation than other firms\nsaid was possible. We are exceedingly glad that we chose Bye, Goff & Rohde to\nrepresent our family in this dark hour. -Jessica\n\n **I Knew I Was in Good Hands:  **The first time I visited their office I knew\nI was in good hands and was going to get the support I needed moving forward.\nAttorney Steve Goff and his staff helped me through a painful and emotional 3+\nyears in many ways. They were very diligent with all communications, they\npromptly and respectfully answered any questions or confusions that came up\nfor me. I would most definitely recommend Steve Goff and Bye, Goff & Rohde to\nanyone out there who finds themselves in a situation where they need help.\n-MaryJo\n\n  * **Focused on Your Success**\n\nOur team is not afraid to take your case to trial if that is what your case\nrequires.\n\n  * **Innovative Legal Strategies**\n\nAt Bye, Goff & Rohde you get a full team of attorneys dedicated to setting\nboth you and your case up for success.\n\n  * **Experienced Legal Counsel**\n\nOur team has nearly 410 years of combined experience. We have what it takes to\nget the best possible result.\n\n####  **Work With Bye, Goff & Rohde ** Don't Face This Alone\n\nIf you or a loved one has been injured, contact our dedicated and experienced\nteam for the justice you deserve.\n\n  * *First Name\n\nPlease enter your first name.\n\n  * *Last Name\n\nPlease enter your last name.\n\n  * *Phone\n\nPlease enter your phone number.\n\nThis isn't a valid phone number.\n\n  * *Email\n\nPlease enter your email address.\n\nThis isn't a valid email address.\n\n  * *Are you a new client? Yes, I am a potential new client No, I'm a current existing client I'm neither.\n\nPlease make a selection.\n\n  * ZJTVQM\n\nPlease enter the captcha code above:\n\n  * *How can we help you?\n\nPlease enter a message.\n\nSend Message\n\n## Convenient Office Location\n\nWausau, Wisconsin, is a beautiful community close to our Eau Claire,\nWisconsin, office. If you or a loved one has been injured, contact our Wausau\npersonal injury lawyers 24/7 at  **(715) 402-4343**. Our attorneys will walk\nalongside you and do what it takes for you to move forward with your recovery\nwhile fighting for the compensation you deserve.\n\n## Your Wisconsin Personal Injury Law Firm Since 1974\n\nBye, Goff & Rohde has been helping injured people since 1974. Our passion lies\nin delivering justice to the people of Wisconsin who have been injured due to\nanother party's negligence. We will do everything we can to support you and\nyour case with the respect, dignity, and attention you deserve.\n\nServing Wisconsin & Minnesota\n\n715-402-4343\n\n**Links**\n\n  * Home\n  * About\n  * Practice Areas\n  * Testimonials\n  * Case Results\n  * Contact Us\n\n**Locations**\n\n  * **Eau Claire** 310 Pinnacle Way, Suite 302  \nEau Claire, WI 54701  (534) 202-5404  \nMap & Directions\n\n  * **La Crosse** 201 Main Street  \nSuite #1005  \nLa Crosse, WI 54601  (608) 602-7272  \nMap & Directions\n\n  * **River Falls** 258 Riverside Dr.  \nRiver Falls, WI 54022  (715) 202-5699  \nMap & Directions\n\n  * **Mailing Address** PO Box 167  \nRiver Falls, WI 54022  Map & Directions\n\n**Follow Us**\n\n  *   * LinkedIn\n  * \n\n© 2024 All Rights Reserved.\n\n  * _Site Map_\n  * _Privacy Policy_\n\n",
    "links": "[{\"link\": \"https://www.byegoff.com/\", \"text\": \"\"}, {\"link\": \"https://www.byegoff.com/testimonials/\", \"text\": \"Testimonials\"}, {\"link\": \"https://www.byegoff.com/case-results/\", \"text\": \"Case Results\"}, {\"link\": \"https://www.byegoff.com/blog/\", \"text\": \"Blog\"}, {\"link\": \"https://www.byegoff.com/contact-us/\", \"text\": \"Contact Us\"}, {\"link\": \"https://www.byegoff.com/\", \"text\": \"Home\"}, {\"link\": \"https://www.byegoff.com/about/\", \"text\": \"About\"}, {\"link\": \"https://www.byegoff.com/video-center/\", \"text\": \"Our Video Center\"}, {\"link\": \"https://www.byegoff.com/our-attorneys/\", \"text\": \"Our Attorneys\"}, {\"link\": \"https://www.byegoff.com/our-attorneys/steven-b-goff/\", \"text\": \"Steven B. Goff\"}, {\"link\": \"https://www.byegoff.com/our-attorneys/dean-r-rohde/\", \"text\": \"Dean R. Rohde\"}, {\"link\": \"https://www.byegoff.com/our-attorneys/tracy-n-tool/\", \"text\": \"Tracy N. Tool\"}, {\"link\": \"https://www.byegoff.com/our-attorneys/robert-a-parsons/\", \"text\": \"Robert A. Parsons\"}, {\"link\": \"https://www.byegoff.com/our-attorneys/brian-f-laule/\", \"text\": \"Brian F. Laule\"}, {\"link\": \"https://www.byegoff.com/our-attorneys/cristina-m-wirth/\", \"text\": \"Cristina M. Wirth\"}, {\"link\": \"https://www.byegoff.com/our-attorneys/martha-h-heidt/\", \"text\": \"Martha H. Heidt\"}, {\"link\": \"https://www.byegoff.com/our-attorneys/nicole-r-wells/\", \"text\": \"Nicole R. Wells\"}, {\"link\": \"https://www.byegoff.com/practice-areas/\", \"text\": \"Practice Areas\"}, {\"link\": \"https://www.byegoff.com/practice-areas/atv-accidents/\", \"text\": \"ATV Accidents\"}, {\"link\": \"https://www.byegoff.com/practice-areas/bicycle-pedestrian-accidents/\", \"text\": \"Bicycle & Pedestrian Accidents\"}, {\"link\": \"https://www.byegoff.com/practice-areas/birth-injuries/\", \"text\": \"Birth Injuries\"}, {\"link\": \"https://www.byegoff.com/practice-areas/boating-accidents/\", \"text\": \"Boating Accidents\"}, {\"link\": \"https://www.byegoff.com/practice-areas/bus-accidents/\", \"text\": \"Bus Accidents\"}, {\"link\": \"https://www.byegoff.com/practice-areas/amputation-injuries/\", \"text\": \"Amputation Injuries\"}, {\"link\": \"https://www.byegoff.com/practice-areas/back-injuries/\", \"text\": \"Back Injuries\"}, {\"link\": \"https://www.byegoff.com/practice-areas/brain-injuries/\", \"text\": \"Brain Injuries\"}, {\"link\": \"https://www.byegoff.com/practice-areas/eye-injuries/\", \"text\": \"Eye Injuries\"}, {\"link\": \"https://www.byegoff.com/practice-areas/head-injuries/\", \"text\": \"Head Injuries\"}, {\"link\": \"https://www.byegoff.com/practice-areas/knee-injuries/\", \"text\": \"Knee Injuries\"}, {\"link\": \"https://www.byegoff.com/practice-areas/neck-injuries/\", \"text\": \"Neck Injuries\"}, {\"link\": \"https://www.byegoff.com/practice-areas/shoulder-injuries/\", \"text\": \"Shoulder Injuries\"}, {\"link\": \"https://www.byegoff.com/practice-areas/soft-tissue-injuries/\", \"text\": \"Soft Tissue Injuries\"}, {\"link\": \"https://www.byegoff.com/practice-areas/car-accidents/\", \"text\": \"Car Accidents\"}, {\"link\": \"https://www.byegoff.com/practice-areas/distracted-driving-accidents/\", \"text\": \"Distracted Driving Accidents\"}, {\"link\": \"https://www.byegoff.com/practice-areas/drunk-driving-accidents/\", \"text\": \"Drunk Driving Accidents\"}, {\"link\": \"https://www.byegoff.com/practice-areas/construction-accidents/\", \"text\": \"Construction Accidents\"}, {\"link\": \"https://www.byegoff.com/practice-areas/defective-products/\", \"text\": \"Defective Products\"}, {\"link\": \"https://www.byegoff.com/practice-areas/dog-bites/\", \"text\": \"Dog Bites\"}, {\"link\": \"https://www.byegoff.com/practice-areas/farm-accidents/\", \"text\": \"Farm Accidents\"}, {\"link\": \"https://www.byegoff.com/practice-areas/jet-ski-accidents/\", \"text\": \"Jet Ski Accidents\"}, {\"link\": \"https://www.byegoff.com/practice-areas/motorcycle-accidents/\", \"text\": \"Motorcycle Accidents\"}, {\"link\": \"https://www.byegoff.com/practice-areas/nursing-home-neglect/\", \"text\": \"Nursing Home Neglect\"}, {\"link\": \"https://www.byegoff.com/practice-areas/plane-crash-accidents/\", \"text\": \"Plane Crash Accidents\"}, {\"link\": \"https://www.byegoff.com/practice-areas/rv-accidents/\", \"text\": \"RV Accidents\"}, {\"link\": \"https://www.byegoff.com/practice-areas/slip-fall/\", \"text\": \"Slip & Fall\"}, {\"link\": \"https://www.byegoff.com/practice-areas/snowmobile-accidents/\", \"text\": \"Snowmobile Accidents\"}, {\"link\": \"https://www.byegoff.com/practice-areas/truck-accidents/\", \"text\": \"Truck Accidents\"}, {\"link\": \"https://www.byegoff.com/practice-areas/workplace-injuries/\", \"text\": \"Workplace Injuries\"}, {\"link\": \"https://www.byegoff.com/practice-areas/wrongful-death/\", \"text\": \"Wrongful Death\"}, {\"link\": \"https://www.byegoff.com/locations-we-serve/\", \"text\": \"Locations We Serve\"}, {\"link\": \"https://www.byegoff.com/eau-claire-personal-injury-attorneys/\", \"text\": \"Eau Claire\"}, {\"link\": \"https://www.byegoff.com/la-crosse-personal-injury-lawyers/\", \"text\": \"La Crosse\"}, {\"link\": \"https://www.byegoff.com/river-falls-personal-injury-attorneys/\", \"text\": \"River Falls\"}, {\"link\": \"https://www.byegoff.com/wausau-personal-injury-lawyers/\", \"text\": \"Wausau\"}, {\"link\": \"https://www.byegoff.com/minneapolis-personal-injury-lawyers/\", \"text\": \"Minneapolis/St. Paul\"}, {\"link\": \"https://www.byegoff.com/duluth-personal-injury-lawyers/\", \"text\": \"Duluth/Superior\"}, {\"link\": \"https://www.byegoff.com/\", \"text\": \"Home\"}, {\"link\": \"https://www.byegoff.com/about/\", \"text\": \"About\"}, {\"link\": \"https://www.byegoff.com/video-center/\", \"text\": \"Our Video Center\"}, {\"link\": \"https://www.byegoff.com/our-attorneys/\", \"text\": \"Our Attorneys\"}, {\"link\": \"https://www.byegoff.com/our-attorneys/steven-b-goff/\", \"text\": \"Steven B. Goff\"}, {\"link\": \"https://www.byegoff.com/our-attorneys/dean-r-rohde/\", \"text\": \"Dean R. Rohde\"}, {\"link\": \"https://www.byegoff.com/our-attorneys/tracy-n-tool/\", \"text\": \"Tracy N. Tool\"}, {\"link\": \"https://www.byegoff.com/our-attorneys/robert-a-parsons/\", \"text\": \"Robert A. Parsons\"}, {\"link\": \"https://www.byegoff.com/our-attorneys/brian-f-laule/\", \"text\": \"Brian F. Laule\"}, {\"link\": \"https://www.byegoff.com/our-attorneys/cristina-m-wirth/\", \"text\": \"Cristina M. Wirth\"}, {\"link\": \"https://www.byegoff.com/our-attorneys/martha-h-heidt/\", \"text\": \"Martha H. Heidt\"}, {\"link\": \"https://www.byegoff.com/our-attorneys/nicole-r-wells/\", \"text\": \"Nicole R. Wells\"}, {\"link\": \"https://www.byegoff.com/practice-areas/\", \"text\": \"Practice Areas\"}, {\"link\": \"https://www.byegoff.com/practice-areas/atv-accidents/\", \"text\": \"ATV Accidents\"}, {\"link\": \"https://www.byegoff.com/practice-areas/bicycle-pedestrian-accidents/\", \"text\": \"Bicycle & Pedestrian Accidents\"}, {\"link\": \"https://www.byegoff.com/practice-areas/birth-injuries/\", \"text\": \"Birth Injuries\"}, {\"link\": \"https://www.byegoff.com/practice-areas/boating-accidents/\", \"text\": \"Boating Accidents\"}, {\"link\": \"https://www.byegoff.com/practice-areas/bus-accidents/\", \"text\": \"Bus Accidents\"}, {\"link\": \"https://www.byegoff.com/practice-areas/amputation-injuries/\", \"text\": \"Amputation Injuries\"}, {\"link\": \"https://www.byegoff.com/practice-areas/back-injuries/\", \"text\": \"Back Injuries\"}, {\"link\": \"https://www.byegoff.com/practice-areas/brain-injuries/\", \"text\": \"Brain Injuries\"}, {\"link\": \"https://www.byegoff.com/practice-areas/eye-injuries/\", \"text\": \"Eye Injuries\"}, {\"link\": \"https://www.byegoff.com/practice-areas/head-injuries/\", \"text\": \"Head Injuries\"}, {\"link\": \"https://www.byegoff.com/practice-areas/knee-injuries/\", \"text\": \"Knee Injuries\"}, {\"link\": \"https://www.byegoff.com/practice-areas/neck-injuries/\", \"text\": \"Neck Injuries\"}, {\"link\": \"https://www.byegoff.com/practice-areas/shoulder-injuries/\", \"text\": \"Shoulder Injuries\"}, {\"link\": \"https://www.byegoff.com/practice-areas/soft-tissue-injuries/\", \"text\": \"Soft Tissue Injuries\"}, {\"link\": \"https://www.byegoff.com/practice-areas/car-accidents/\", \"text\": \"Car Accidents\"}, {\"link\": \"https://www.byegoff.com/practice-areas/distracted-driving-accidents/\", \"text\": \"Distracted Driving Accidents\"}, {\"link\": \"https://www.byegoff.com/practice-areas/drunk-driving-accidents/\", \"text\": \"Drunk Driving Accidents\"}, {\"link\": \"https://www.byegoff.com/practice-areas/construction-accidents/\", \"text\": \"Construction Accidents\"}, {\"link\": \"https://www.byegoff.com/practice-areas/defective-products/\", \"text\": \"Defective Products\"}, {\"link\": \"https://www.byegoff.com/practice-areas/dog-bites/\", \"text\": \"Dog Bites\"}, {\"link\": \"https://www.byegoff.com/practice-areas/farm-accidents/\", \"text\": \"Farm Accidents\"}, {\"link\": \"https://www.byegoff.com/practice-areas/jet-ski-accidents/\", \"text\": \"Jet Ski Accidents\"}, {\"link\": \"https://www.byegoff.com/practice-areas/motorcycle-accidents/\", \"text\": \"Motorcycle Accidents\"}, {\"link\": \"https://www.byegoff.com/practice-areas/nursing-home-neglect/\", \"text\": \"Nursing Home Neglect\"}, {\"link\": \"https://www.byegoff.com/practice-areas/plane-crash-accidents/\", \"text\": \"Plane Crash Accidents\"}, {\"link\": \"https://www.byegoff.com/practice-areas/rv-accidents/\", \"text\": \"RV Accidents\"}, {\"link\": \"https://www.byegoff.com/practice-areas/slip-fall/\", \"text\": \"Slip & Fall\"}, {\"link\": \"https://www.byegoff.com/practice-areas/snowmobile-accidents/\", \"text\": \"Snowmobile Accidents\"}, {\"link\": \"https://www.byegoff.com/practice-areas/truck-accidents/\", \"text\": \"Truck Accidents\"}, {\"link\": \"https://www.byegoff.com/practice-areas/workplace-injuries/\", \"text\": \"Workplace Injuries\"}, {\"link\": \"https://www.byegoff.com/practice-areas/wrongful-death/\", \"text\": \"Wrongful Death\"}, {\"link\": \"https://www.byegoff.com/locations-we-serve/\", \"text\": \"Locations We Serve\"}, {\"link\": \"https://www.byegoff.com/eau-claire-personal-injury-attorneys/\", \"text\": \"Eau Claire\"}, {\"link\": \"https://www.byegoff.com/la-crosse-personal-injury-lawyers/\", \"text\": \"La Crosse\"}, {\"link\": \"https://www.byegoff.com/river-falls-personal-injury-attorneys/\", \"text\": \"River Falls\"}, {\"link\": \"https://www.byegoff.com/wausau-personal-injury-lawyers/\", \"text\": \"Wausau\"}, {\"link\": \"https://www.byegoff.com/minneapolis-personal-injury-lawyers/\", \"text\": \"Minneapolis/St. Paul\"}, {\"link\": \"https://www.byegoff.com/duluth-personal-injury-lawyers/\", \"text\": \"Duluth/Superior\"}, {\"link\": \"https://www.byegoff.com/testimonials/\", \"text\": \"Testimonials\"}, {\"link\": \"https://www.byegoff.com/case-results/\", \"text\": \"Case Results\"}, {\"link\": \"https://www.byegoff.com/blog/\", \"text\": \"Blog\"}, {\"link\": \"https://www.byegoff.com/contact-us/\", \"text\": \"Contact Us\"}, {\"link\": \"https://www.byegoff.com/contact-us/\", \"text\": \"\"}, {\"link\": \"https://www.byegoff.com/contact-us/\", \"text\": \"\"}, {\"link\": \"https://www.byegoff.com/our-attorneys/\", \"text\": \"personal injury lawyers\"}, {\"link\": \"https://www.byegoff.com/wausau-personal-injury-lawyers/car-accidents/\", \"text\": \"car accident\"}, {\"link\": \"https://www.byegoff.com/wausau-personal-injury-lawyers/truck-accidents/\", \"text\": \"truck accident\"}, {\"link\": \"https://www.byegoff.com/wausau-personal-injury-lawyers/motorcycle-accidents/\", \"text\": \"motorcycle accident\"}, {\"link\": \"https://www.byegoff.com/wausau-personal-injury-lawyers/slip-fall/\", \"text\": \"Slip and Fall Accidents\"}, {\"link\": \"https://www.byegoff.com/wausau-personal-injury-lawyers/wrongful-death/\", \"text\": \"Wrongful Death\"}, {\"link\": \"https://www.byegoff.com/contact-us/\", \"text\": \"contact us\"}, {\"link\": \"https://www.byegoff.com/wausau-personal-injury-lawyers/\", \"text\": \"\"}, {\"link\": \"https://www.byegoff.com/wausau-personal-injury-lawyers/car-accidents/\", \"text\": \"\"}, {\"link\": \"https://www.byegoff.com/wausau-personal-injury-lawyers/slip-fall/\", \"text\": \"\"}, {\"link\": \"https://www.byegoff.com/wausau-personal-injury-lawyers/wrongful-death/\", \"text\": \"\"}, {\"link\": \"https://www.byegoff.com/wausau-personal-injury-lawyers/truck-accidents/\", \"text\": \"\"}, {\"link\": \"https://www.byegoff.com/wausau-personal-injury-lawyers/motorcycle-accidents/\", \"text\": \"\"}, {\"link\": \"https://www.byegoff.com/wausau-personal-injury-lawyers/car-accidents/\", \"text\": \"Car Accident\"}, {\"link\": \"https://www.byegoff.com/wausau-personal-injury-lawyers/truck-accidents/\", \"text\": \"Truck Accident\"}, {\"link\": \"https://www.byegoff.com/wausau-personal-injury-lawyers/motorcycle-accidents/\", \"text\": \"Motorcycle Accident\"}, {\"link\": \"https://www.byegoff.com/wausau-personal-injury-lawyers/slip-fall/\", \"text\": \"Slip & Fall\"}, {\"link\": \"https://www.byegoff.com/testimonials/\", \"text\": \"\"}, {\"link\": \"https://www.byegoff.com/contact-us/\", \"text\": \"contact our Wausau personal injury lawyers\"}, {\"link\": \"https://www.byegoff.com/\", \"text\": \"\"}, {\"link\": \"https://www.byegoff.com/\", \"text\": \"Home\"}, {\"link\": \"https://www.byegoff.com/about/\", \"text\": \"About\"}, {\"link\": \"https://www.byegoff.com/practice-areas/\", \"text\": \"Practice Areas\"}, {\"link\": \"https://www.byegoff.com/testimonials/\", \"text\": \"Testimonials\"}, {\"link\": \"https://www.byegoff.com/case-results/\", \"text\": \"Case Results\"}, {\"link\": \"https://www.byegoff.com/contact-us/\", \"text\": \"Contact Us\"}, {\"link\": \"https://www.byegoff.com/site-map/\", \"text\": \"Site Map\"}, {\"link\": \"https://www.byegoff.com/privacy-policy/\", \"text\": \"Privacy Policy\"}]"
}