{
    "summary": "__414-257-2667\n\n  * About\n    * Worker’s Compensation Travel Schedule\n  * Attorneys\n    * Michael Gillick\n    * Patrick Gillick (Retired)\n    * Charles Graf\n    * George F. Graf (Retired)\n    * Dennis Wicht\n  * Areas of Practice\n    * Worker’s Compensation\n  * Faqs\n  * Testimonials\n  * Blog\n    * Wisconsin Workers’ Comp News\n  * Contact\n\n# Wausau Worker’s Compensation Attorneys\n\n**_Our Wausau Worker’s Compensation Attorneys Fight for the Rights of Injured\nWorkers in Wausau and Throughout Marathon County_**\n\nLocated in the North-Central part of the state, Wausau is divided in the\nmiddle by the Wisconsin River. Following the end of the Vietnam War, the city\nbecame home to many Hmong refugees fleeing Southeast Asia. Originally founded\nbased largely on the lumber trade due to its favorable spot along the\nWisconsin River, Wausau now has a diverse, developed economy, with large\nemployers such as Liberty Mutual present in the city.\n\nAt Gillick, Wicht, Gillick & Graf, our Wausau worker’s compensation attorneys\nhave the professional skills and legal knowledge to protect the rights of\npeople who were hurt on the job. If you or someone you know was injured while\nworking in Wausau, please do not hesitate to reach out to our Wisconsin\nworker’s comp lawyers for a free, fully confidential initial case evaluation.\nWe will help you maximize your financial compensation.\n\n## What to Know About Worker’s Compensation Protections in Wausau, Wisconsin\n\nBeing injured on the job can lead to a compounding series of events that place\nyou in a mountain of debt. A serious injury can have you out of work for\nmonths, not to mention the healthcare costs associated with treatment and\nrecovery. If you have been injured at your place of work in Wausau, Wisconsin,\nit is possible that you may be entitled to worker’s compensation for your\nlosses.\n\nFortunately, the Wisconsin worker’s comp laws provide some much-needed legal\nprotection. At Gillick, Wicht, Gillick & Graf, our Wausau worker’s\ncompensation attorneys can help you make sure that your claim is accepted and\nappeal if it is not. Here are some key things to know about your rights:\n\n  1. **Most Employees in Wausau are Covered By Worker’s Comp:** An injury can occur at any time, regardless of your financial state. Several laws protect injured workers at the state and federal levels. Both private and public-sector employers are required to compensate injured workers. In fact, around 98 percent of workers statewide are covered. Yet many workers have their claims shorted or unfairly denied without the aid of an experienced attorney to negotiate on their behalf.\n  2. **You Can File for Benefits for Medical Coverage and Wage Replacement:** Wisconsin worker’s compensation laws protect the majority of workers in the state suffering from a wide variety of injuries and illnesses, including — but not limited to — injuries that cause temporary or permanent disability. Although nearly all workers in the state are eligible for benefits, many are unaware that these benefits are available to them. Notably, you should receive benefits for all medical care related to your workplace accident. Among other things, this includes emergency room bills, visits to the doctor, other medical costs, and rehabilitative care.\n  3. **A Worker’s Comp Claim is Not Based on Fault:** There is a high probability that your employer is responsible for covering most of the damages associated with a workplace injury. You are not required to prove “negligence” or “fault” in order to bring a successful worker’s comp claim. Under Wisconsin’s Worker’s Compensation Act, almost all employers must legally have insurance available in the event on-duty workers become injured. If you need to file a claim or have had a worker’s comp claim denied, our dedicated attorneys are ready to take your case so that you can focus on your rehabilitation.\n  4. **Unfair Denials Happen—Legal Representation is Available:** Sadly, some qualified applicants struggle to get their worker’s comp benefits. At Gillick, Wicht, Gillick & Graf, we understand that if you are suffering from a workplace injury, you may be concerned with how you will recover and pay for these unexpected expenses. It is our job as worker’s compensation attorneys to help you recover your losses through the various statutes that protect your rights. If your worker’s comp claim was denied, you can appeal. Our Wausau, WI worker’s comp appeal lawyers are standing by, ready to help you take action to get justice and the maximum available financial benefits.\n\n## Why Work With the Wausau Worker’s Comp Lawyers at Gillick, Wicht, Gillick &\nGraf\n\nWorker’s compensation claims are complex. It is easy to feel stressed and\noverwhelmed by the process. Do not suffer from a workplace injury without the\ncompensation you deserve. At Gillick, Wicht, Gillick & Graf, it is our duty to\nrepresent you and protect your rights in worker’s compensation and employment\nlaw matters. Among other things, our Wausau, WI worker’s compensation lawyers\nare prepared to:\n\n  * Answer questions and explain the process during a free case evaluation.\n  * Handle all of the paperwork that you need to file to get benefits.\n  * Go as far as needed to maximize your financial support. This includes filing an appeal.\n\nWe know how to get results. Our dedicated team of worker’s comp attorneys in\nWausau has helped injured workers receive what they are legally entitled to by\nlaw to cover lost wages, medical bills, and permanent partial disability. We\nhave represented Wausau workers for over 65 years as the “injured worker’s law\nfirm.” When you seek legal representation with us, you do not pay any legal\nfees until we win a just settlement for you! Call 414-257-2667 to begin the\nclaims process today.\n\n## Frequent Questions for Work Injury Lawyers in Wausau\n\nYou have a claim if you suffered a loss because of a job-related injury. This\nmeans that to get worker’s compensation, you have to show three things: Read\nMore\n\n## Get Help From a Wausau, WI Worker’s Comp Attorneys\n\nAt Gillick, Wicht, Gillick & Graf, our Wausau worker’s compensation lawyers\nare proud to provide the highest level of legal representation to our clients.\nOur legal team knows how to get workers justice. If you or your family member\nwas hurt at work, we are more than ready to help. Call us now or connect with\none of our Wausau worker’s comp attorneys directly through our website to set\nup your free, strictly confidential consultation. We provide workers’ comp\nservices throughout Marathon County, including in Wausau, Abbotsford,\nMarshfield, and Schofield.\n\n### Contact Gillick Wicht Gillick & Graf No Fee Unless We Win\n\nlabel  \n\nlabel  \n\nlabel  \n\n  \nPlease leave this field empty.  \n\n### Our Office Location:\n\n**Address:** 155 S. Executive Drive Suite 212 Brookfield, WI 53005\n\n**Phone :** 414-257-2667\n\n______\n\n  * Home\n  * About\n  * Faq’s\n  * Testimonials\n  * Blog\n  * Contact\n\nGillick, Wicht, Gillick & Graf is a Wisconsin Workers Compensation Law Firm\nlocated in Milwaukee and representing injured workers throughout all of\nWisconsin including but not limited to Appleton, Beloit, Brookfield, Fon du\nLac, Fox Valley, Franklin, Green Bay, Greenfield, Janesville, Kenosha,\nMadison, Manitowoc, Menomonee Falls, New Berlin, Oshkosh, Racine, Sheboygan,\nWaukesha, Wausau, Wauwatosa, West Allis and Wisconsin Rapids.\n\n© 2024 by Gillick, Wicht, Gillick & Graf. All rights reserved.\n\n  * In The News\n  * Disclaimer\n  * Privacy Policy\n  * Terms of Service\n  * Sitemap\n\nPowered by:\n\n### Contact Gillick Wicht Gillick & Graf No Fee Unless We Win\n\nlabel  \n\nlabel  \n\nlabel  \n\n  \nPlease leave this field empty.  \n\n",
    "links": "[{\"link\": \"https://www.gillickwicht.com/wausau-workers-compensation-attorneys.shtml/\", \"text\": \"Wausau\"}]"
}