{
    "summary": "Skip to content\n\n  * Home\n  * Product\n    * 👉 Identity Solutions\n      * Aadhaar Verification\n      * PAN Card Verification\n    * 👉 Financial Solutions\n      * UPI Verification API\n      * Bank Account Verification API\n      * IFSC Code Validation API\n    * 👉 Business Solutions\n      * GST Verification API\n      * Udyam Aadhaar Verification\n    * 👉 OCR Solution\n      * Voter Card OCR\n      * PAN Card OCR\n      * Aadhaar OCR\n      * Driving License OCR\n      * Bank Cheque OCR\n  * Resources\n    * Industry Insights\n    * API Docs\n  * Pricing\n  * Contact\n\n____ Menu\n\n  * Home\n  * Product\n    * 👉 Identity Solutions\n      * Aadhaar Verification\n      * PAN Card Verification\n    * 👉 Financial Solutions\n      * UPI Verification API\n      * Bank Account Verification API\n      * IFSC Code Validation API\n    * 👉 Business Solutions\n      * GST Verification API\n      * Udyam Aadhaar Verification\n    * 👉 OCR Solution\n      * Voter Card OCR\n      * PAN Card OCR\n      * Aadhaar OCR\n      * Driving License OCR\n      * Bank Cheque OCR\n  * Resources\n    * Industry Insights\n    * API Docs\n  * Pricing\n  * Contact\n\n# Best Choice: Identity Verification API Provider\n\nProtect your business from fraud with our robust identity verification API.\n\nOur online identity verification APIs verify your customer’s identity in real-\ntime so you can be sure they are who they say they are.\n\n## Trusted By The Best\n\n## What is Identity Verification API?\n\nAn Identity Verification API helps businesses verify the identity of their\ncustomers or users. It can be used to check government-issued ID documents,\nsuch as passports or driver’s licenses or aadhaar cards or PAN cards, etc.\n\n## What are the benefits of Identity Verification APIs?\n\n  * __ Instant Verification\n  * __ Built for Onboarding at Scale\n  * __ AI-Powered Verification Checks\n  * __ High Accuracy\n\nRequest Demo\n\n## Why only Deepvue.tech?\n\nUse before you pay, believe what we say\n\n### Highest  \nAvailability\n\n99.9% Uptime\n\n### Fastest  \nAccount Access\n\nZero Set-Up Fee\n\n### Simplest  \nAPI Integrations\n\nGo live in 1 hour\n\n### Easiest  \nAPI Playground\n\nTest & Integrate in a jiffy\n\n### Best  \nSupport\n\n24x7 Engineering Support\n\n### Get access to Simplest Identity Verification API.  \nSign-up Now, and go live in 1 hour!\n\nSign-up Now\n\n## Types of Individual Verification APIs\n\nIncorporating identity check API in your application enhances the speed and\nefficiency of the verification process. Deepvue has various APIs specifically\ntailored for verifying different identification documents.\n\n### Aadhaar Card Verification\n\nThe UIDAI in India gives a unique identification (Aadhaar) to all Indian\nresidents. They also provide online authentication to verify the identity of\nAadhaar number holders.\n\nThe Aadhaar Verification API uses OCR technology to extract full name,\naddress, mobile number, and other biometric information for verifying an\nindividual’s identity.\n\n__ Explore Aadhaar Verification\n\n### PAN Card Verification\n\nA PAN Card is a required government ID for financial transactions. It helps\ndetermine an individual’s tax liability and reduces tax evasion.\n\nThe PAN Verification API uses information like name, father’s name, date of\nbirth, and photo from the front page of the PAN card to validate it with the\nIncome Tax Department database.\n\n__ Explore PAN Verification API\n\n### Voter ID Card Verification\n\nThe Voter ID Card is issued by the Election Commission of India to adult\ncitizens who are 18 years old and above. It is used to confirm the identity,\nage, and address of individuals.\n\nThe Voter ID Card Verification API uses OCR technology to extract personal\ndetails from uploaded or scanned ID cards, such as name, father’s name,\naddress, date of birth (DoB), and EPIC number. These details are then verified\nagainst the government database maintained by election commissions.\n\n__ Explore Voter ID Verification API\n\n### Driving License Verification\n\nDL verification is a process used to check if a driving license is real or\nfake. It involves confirming the driver’s name, address, age, date of birth,\nand father’s name to verify their identity.\n\nThe driving license API uses OCR technology to extract information from a\nlicense and compare it with pre-validated data or a government database like\nPriwahan Sewa. It also checks the vehicle registration number, owner, and\nmanufacturer using the RC verification API. This helps ensure that the license\nand vehicle are legitimate.\n\n__ Explore Drivers License Verification API\n\n### Bank Account Verification\n\nVerify bank account using the account number and IFSC code to confirm user\nauthenticity and account status (active or dormant). This helps identify\ngenuine individuals or merchants, distinguishing them from fake ones.\n\nThe Bank Account Verification API employs the penny drop verification method.\nIt involves a transaction of Rs.1 to the user’s account, which is then used to\nauthenticate the beneficiary. This process ensures real-time verification of\naccount information, minimizing transaction failures, reversals, identity\nfraud, and theft. Additionally, the API enables bulk verification of bank\naccounts by uploading an Excel/CSV file, enhancing operational efficiency.\n\n__ Explore Bank Account Verification API\n\n### UPI Verification\n\nThe Unified Payment Interface (UPI) is a payment system introduced by the\nNational Payment Corporation of India (NPCI). When registering for UPI, bank\naccount holders receive a unique virtual payment address (VPA).\n\nThe UPI Verification API is used to verify the VPA and instantly provides the\nbank account holder’s name as registered in the bank. This allows for\ncomparison with the identity details provided in the application form to\nvalidate customers.\n\n__ Explore UPI Verification API\n\n### Passport Verification\n\nA passport is a common identification document used to confirm a person’s\nidentity. Passport verification is helpful for businesses working with\ncustomers or partners from other countries.\n\nThe verification process uses OCR technology to extract personal details and\ncompares them with the government database. This ensures that the individual\nhas a valid passport and is legitimate.\n\n__ Explore Passport Verification API\n\n### Connect with us to get started with real-time verification\n\nGet Started\n\n## ID Verification APIs – Process Flow\n\nAPI integrations have different process flows for document verification. The\nsteps followed for each ID verification API depend on the type of document\nbeing verified. Both individual and business APIs use either data-centric or\ndocument-centric methods for extracting KYC information from specified ID\nproofs. When images of ID proofs are required, the data is extracted using AI-\npowered OCR technology. Data-centric documents are verified using pre-\nvalidated resources.\n\n##### 1\\. Upload or Enter Details\n\nYou can upload an ID image or simply input the user's ID number and make\nstraightforward requests using our API.\n\n##### 2\\. Data Extraction & Verification\n\nOur system automatically extracts and verifies vital information with\ngovernment and IT databases.\n\n##### 3\\. Receive JSON Response\n\nYou will receive a JSON format response containing extracted data recorded in\nthe right field.\n\n### Ready to Streamline your Verification Journey?\n\nGet Started\n\n## Who can use Deepvue's ID card verification API?\n\nExplore the wide variety of industries where you can use our API for identity\nverification.\n\n### Financial Services & Fintechs\n\n### Background Verification Agencies\n\n### NBFCs & Lending Businesses\n\n### Fantasy & Online Gaming\n\n### Insurance & IT/ITeS\n\n## Got questions?  \nTake a look at our FAQs below and get answers.\n\n____ What different documents can I verify with your API?\n\nYou can verify different individual identity documents such as Aadhaar crad,\nPAN card, Voter ID card, Driving License and Passport.\n\n____ How can your ID verification APIs help me?\n\nDeepvueTech’s verification API can help you in preventing fraud and scams on\nyour application by matching every ID card with government databases. Our API\nprovides 100% legitimate responses that match government records, so you can\nbe confident that your users are who they say they are.\n\n____ Is your Identity Verification API prone to errors?\n\nNo, our APIs are 100% safe to use and error-free. We check the details of ID\ncards directly from governments database, so there is no room for any errors.\n\n____ Which programming languages are supported by your ID verification APIs?\n\nOur APIs can be integrated with any language that supports web services, such\nas Java, Python, PHP, Node.js, etc. It’s a one-time process and end-to-end\nsecure, and you will get response information in JSON format.\n\n____ How much time does it take to verify an ID card?\n\nDeepvue Identity verification APIs are designed to verify identity within\nseconds.\n\n## Explore Other Soultions\n\nLooking to embed other financial APIs in your product? Just sit back and\nrelax.\n\n###  Business Solution\n\nVerify beneficiary accounts for 600+ banks including public, private, rural,\nand co-operative banks.\n\nExplore Now\n\n###  Financial Solution\n\nInstantly verify Aadhaar of individuals during KYC and receive their Name,\nDob, Gender, and full address.\n\nExplore Now\n\nDeepvue.tech provides APIs that help businesses perform Automated KYC,\nEnhanced Due Diligence Checks, and Risk-Based Underwriting.\n\n### Products\n\n  * Identity Verification\n  * Business Verification\n  * Financial Verification\n  * Retailer Tech\n\n### Quick Links\n\n  * Blogs\n  * Developers\n  * Privacy Policy\n  * Terms of service\n\n### Let's connect\n\n  * __ Linkedin\n  * __ Angel\n  * __ Business & Partnership\n  * __ Support & Payment Related\n\n© 2023 Deepvue.tech. All right reserved\n\nBuilding with ♥ in India\n\n",
    "links": "[{\"link\": \"https://deepvue.tech/identity-verification/\", \"text\": \"\"}]",
    "priceAndPlans": "Skip to content\n\n  * Home\n  * Product\n    * 👉 Identity Solutions\n      * Aadhaar Verification\n      * PAN Card Verification\n    * 👉 Financial Solutions\n      * UPI Verification API\n      * Bank Account Verification API\n      * IFSC Code Validation API\n    * 👉 Business Solutions\n      * GST Verification API\n      * Udyam Aadhaar Verification\n    * 👉 OCR Solution\n      * Voter Card OCR\n      * PAN Card OCR\n      * Aadhaar OCR\n      * Driving License OCR\n      * Bank Cheque OCR\n  * Resources\n    * Industry Insights\n    * API Docs\n  * Pricing\n  * Contact\n\n____ Menu\n\n  * Home\n  * Product\n    * 👉 Identity Solutions\n      * Aadhaar Verification\n      * PAN Card Verification\n    * 👉 Financial Solutions\n      * UPI Verification API\n      * Bank Account Verification API\n      * IFSC Code Validation API\n    * 👉 Business Solutions\n      * GST Verification API\n      * Udyam Aadhaar Verification\n    * 👉 OCR Solution\n      * Voter Card OCR\n      * PAN Card OCR\n      * Aadhaar OCR\n      * Driving License OCR\n      * Bank Cheque OCR\n  * Resources\n    * Industry Insights\n    * API Docs\n  * Pricing\n  * Contact\n\n#  Building financial blocks for Fintechs  Lenders  NBFCs  Marketplaces  Neo\nBanks\n\n## Platform that helps in creating seamless customer journeys, performing\nEnhanced Due Diligence Checks, and doing Risk-Based Underwriting.\n\nBook a Demo\n\n## Popular Blocks for fintechs & lenders\n\n## Identity Solutions\n\nDigital Identity Verification & KYC Solutions\n\n__ Explore\n\n## Financial Solutions\n\nBanking & Financial Verification Suite\n\n__ Explore\n\n## Business Solutions\n\nAutomate Business Verification Workflows\n\n__ Explore\n\n## Retailer Tech\n\nDigitize Small & Medium Business KYC\n\n__ Explore\n\n## How To Get Started?\n\n##### Book a Demo\n\nJust book a demo, provide a few basic details, and we can offer you the best\nsolution and price guarantee\n\n##### Integrate Solution into your app\n\nOur solutions are easy to integrate, with detailed documentation and dedicated\nintegration engineers to get you up and running in hours, not days.\n\n##### Go live!\n\nOur systems and dedicated engineers will keep an eye on things and help you\nevery step of the way to ensure nothing is overlooked. So you can focus on\nwhat matters: your business.\n\n### Build your digital customer journeys and launch your digital products 10X\nfaster.\n\nBook a Demo\n\n## Identity Verification Suite\n\nThese APIs can verify individuals in real time for KYC, loan disbursals,\ninvestments, and payments. This way, you can be sure that you’re dealing with\nthe right person every time.\n\n## Aadhaar Verification API\n\nAPI allows you to verify and authenticate your user identity using the Aadhaar\noffline verification process.\n\n__ Get Started\n\n## PAN Card Verification API\n\nAPI allows you to quickly and easily verify user identities with authoritative\nsources like NSDL.\n\n__ Get Started\n\n## ID Card OCR API\n\nID Card OCR API allows you to quickly and easily convert your physical ID card\ninto a digital equivalent.\n\n__ Get Started\n\n##  Financial Verification Suite\n\nThese APIs can help you verify financial information for various use cases,\nlike loan disbursements, investments, and payments. This way, you can ensure\nyou get the most accurate and up-to-date information.\n\n## Bank Account Verification API\n\nAPI enables you to quickly verify a customer’s bank account number and name\nagainst bank records.\n\n__ Get API Access\n\n## UPI Verification API\n\nAPI allows you to validate a given UPI ID before processing a transaction, to\nprevent fraud and false transactions.\n\n__ Get API Access\n\n## Bank Cheque OCR API\n\nAPI allows you to automate cheque processing by digitizing physical checks,\nreducing time, and improving accuracy.\n\n__ Get API Access\n\n##  Business Verification Suite\n\nThese APIs can help you verify business information for various use cases,\nlike loan disbursements, investments, and payments. This way, you can ensure\nyou get the most accurate and up-to-date information.\n\n## GST Verification API\n\nAPI allows you to verify and search for GST-registered businesses so that you\ncan do onboarding and due diligence smoothly.\n\n__ Read More\n\n## GST Taxpayer API\n\nAPIs that mirror the GST Portal can be integrated into your workflow to\nstreamline GST compliance and due diligence.\n\n__ Read More\n\n## Udyam Verification API\n\nAPI allows you to quickly and easily digitize KYC for MSME businesses, making\nonboarding customers easier and faster.\n\n__ Read More\n\n## Ready to supercharge your business?\n\n__\n\nYou can launch your financial products in days with our easy-to-use APIs,\nSDKs, or ready-to-use code. With a range of flexible solutions, you can pick\nthe option that best suits your needs.\n\nBook a Demo\n\nDeepvue.tech provides APIs that help businesses perform Automated KYC,\nEnhanced Due Diligence Checks, and Risk-Based Underwriting.\n\n### Products\n\n  * Identity Verification\n  * Business Verification\n  * Financial Verification\n  * Retailer Tech\n\n### Quick Links\n\n  * Blogs\n  * Developers\n  * Privacy Policy\n  * Terms of service\n\n### Let's connect\n\n  * __ Linkedin\n  * __ Angel\n  * __ Business & Partnership\n  * __ Support & Payment Related\n\n© 2023 Deepvue.tech. All right reserved\n\nBuilding with ♥ in India\n\n"
}