{
    "summary": "View in English\n\n  * Global Nav Open Menu Global Nav Close Menu\n  * Apple Developer\n\nSearch\n\nCancel\n\n  * Apple Developer\n  * News\n  * Discover\n  * Design\n  * Develop\n  * Distribute\n  * Support\n  * Account\n  * \n\nCancel\n\nOnly search within “”\n\n### Quick Links\n\n  * Downloads\n  * Documentation\n  * Videos\n  * Forums\n  * Xcode\n\n5 Quick Links\n\n##  Wallet\n\nOpen Menu Close Menu\n\n  * Overview\n  * What’s new\n  * Get Started\n  * Add to Apple Wallet Guidelines\n  * Resources\n\n# Get started with the Verify with Wallet API\n\nApps that require age or identity verification can use the Verify with Wallet\nAPI to quickly and securely verify a person’s information using their digital\ndriver’s license or state ID stored in Apple Wallet.\n\n## Overview\n\n### Streamline your verification process\n\nVerify with Wallet lets people share information from their ID card in Apple\nWallet for an easier and faster verification experience within your app.\nInstead of requiring cumbersome activities, such as scanning documents or\ntaking selfies, apps can reduce friction and abandonment by letting people\ncomplete verification with a simple one-tap experience.\n\n### Verified and authenticated identity data\n\nIdentity information that your app gets via Verify with Wallet has been\nverified by the state issuing authority. In order to add an ID card to Apple\nWallet, the user must prove ownership of a valid driver’s license or state ID\ncard. During this proofing process, the issuing authority confirms that the\nuser’s driver’s license or state ID card is authentic and belongs to that\nuser.\n\nAdditionally, in order to present their ID information to your app, the user\nneeds to authenticate with the same Face ID or Touch ID that they used to add\nthe ID card to Apple Wallet.\n\n### Privacy preserving\n\nWhen you integrate with Verify with Wallet, you provide full transparency into\nthe identity information your app requests and for how long. Your app will be\nentitled to request only the specific data required to complete the\ntransaction. This prevents users from having to overshare their identity\ninformation. Furthermore, neither the state issuing authority nor Apple can\nsee when and where a user shares their license or ID.\n\n## Requirements and availability\n\nVerify with Wallet requires iPhone 8 or later running iOS 16 or later.\n\nThe Verify with Wallet API requires Xcode 14 or later.\n\nID cards in Wallet are currently supported in Arizona, Colorado, Georgia, and\nMaryland in the United States.\n\nEligible categories:\n\n  * Air Travel\n  * Car Rental\n  * Financial Services\n  * Government Services\n  * Healthcare\n  * Alcohol Purchase (Order Ahead and Delivery)\n\nTo express interest in additional categories for future consideration, please\ndescribe how you’d like to use the Verify with Wallet API in the entitlement\nrequest form.\n\n## Request the entitlement\n\nIf you’d like to use the Verify with Wallet API, you’ll need to have an\nentitlement assigned to your developer account. Account Holders in the Apple\nDeveloper Program can submit an entitlement request for the Verify with Wallet\nAPI. Requests are granted per bundle ID (the app’s unique identifier) and\nassigned entitlements can only be used with the single binary associated with\nthe bundle ID.  \n  \n\nIn order to be eligible, your app must:\n\n  * Be in one of the following categories: Air Travel, Car Rental, Financial Services, Government Services, Healthcare, or Alcohol Purchase (Order Ahead and Delivery).\n  * Already require an equivalent age or identity verification process for each user who obtains the same goods or services for the relevant jurisdiction.\n  * Be subject to a legal requirement in each jurisdiction where Verify with Wallet will be used to verify a user’s age or identity in connection with providing certain goods or services.\n\n### Information you’ll need to provide\n\n  1. #### App information\n\n    * App name\n    * Bundle ID (the app’s unique identifier)\n    * App Store or TestFlight URL\n    * App Clip App ID (if applicable)\n    * Description of the good or service being offered through your app that requires age or identity verification\n    * Legal requirements for the jurisdictions that require age or identity verification\n    * Screenshots of your existing identity or age verification process for one of the jurisdictions where you plan to use the Verify with Wallet API\n  2. #### Legal information\n\nWhen you select the data type your app requires for the purposes of age or\nidentity verification, you’ll need to cite the specific legal requirement\n(federal, state, and/or local) for each data request. The following data types\nare available in the Verify with Wallet API.\n\n**Age verification data:**\n\n    * Age Over XX Flag\n    * Age in Years\n    * Issuing Authority\n    * ID Photo\n\n**Identity verification data:**\n\n    * Given Name\n    * Family Name\n    * Address\n    * Date of Birth\n    * Document Number\n    * Document Issue Date\n    * Document Expiration Date\n    * Driving Privileges\n  3. #### Usage information\n\n    * Describe the good or service being offered through your app that requires age or identity verification.\n    * If your app needs to verify a user’s age or identity to offer certain goods or services in specific geographic locations, please list those locations and the applicable law (city, county, state, and federal) for each location listed.\n    * Upload screenshots of your app’s existing age or identity verification process.\n    * Does your existing age or identity verification process apply to all users in every jurisdiction in which you verify and are required to verify identity or age?\n  4. #### Data processing information\n\n    * What data elements does your existing age or identity verification process collect, and how are those data elements verified?\n    * Will the requested data elements be processed (used, stored, or disclosed) in a manner different than the data elements you collect through your existing verification process?\n    * Are you required to retain any data elements after the verification process is completed?\n    * Will any of the data elements be processed by a third party (service provider, affiliates, non-affiliated entities)?\n    * If available, you may optionally provide the URL link to your app’s data retention policy, and the data retention policy for each third party that will retain any data elements.\n\n### When to resubmit a request\n\nIf your app was assigned an entitlement, you’ll need to update Apple on any\nexpanded use of the Verify with Wallet API. This includes any of the following\nscenarios:\n\n  * You expand verification to additional geographic locations subject to legal requirements.\n  * You expand verification to additional groups of users who are subject to legal requirements.\n  * You expand verification to additional categories of goods or services that are subject to legal requirements.\n  * You need access to additional data elements due to legal requirements.\n\n## Implement the API\n\nOnce you receive the Verify with Wallet API entitlement, you can invoke the\nVerify with Wallet API in the PassKit framework and specify the information\nyou’re requesting. To offer a consistent experience across apps, the API\nprovides a set of buttons you can use in your app when you need to ask for\nidentity or age verification. Tapping a button displays a sheet that describes\nyour request and lets people agree to share their information or cancel. If\nthey agree, your app will receive an encrypted response which it passes to\nyour server for decryption and verification.\n\n#### Documentation, videos, and resources\n\n  * IDs in Apple Wallet: privacy and security overview\n  * Human Interface Guidelines: Identity verification\n  * Requesting identity data from a Wallet pass\n  * Verifying Wallet identity requests\n  * What’s new in Wallet and Apple Pay\n  * Sample data and simulator keys\n  * Wallet and Apple mDL Developer Integrator profile\n  * Developer forums\n  * Feedback Assistant\n\n#### Issuing authority certificates\n\nIn order to verify a payload from a user’s state issuing authority, you’ll\nneed to download and use its IACA certificate from their website.\n\n  * IACA certificate for Arizona\n  * IACA certificate for Colorado\n  * IACA certificate for Georgia\n  * IACA certificate for Maryland \n\n## Frequently asked questions\n\n### Using the API\n\n#### Once I’ve been granted the entitlement, how do I set up my developer\naccount and Xcode project?\n\nIn the \"Certificates, Identifiers, & Profiles\" section of the Apple Developer\nwebsite:\n\n  1. Create a merchant ID. If you already have a merchant ID you use for Apple Pay, you can reuse it here.\n  2. Create an \"Identity Access Certificate\" for your merchant ID. This will show up in the \"Identity\" tab in the \"Edit or Configure a Merchant ID\" page. \n    1. Note that the private key of the encryption certificate will be used by your server to decrypt the encryptedData returned from the API.\n  3. Add the \"In App Identity Presentment\" capability to your App ID. This will appear in the \"Additional Capabilities\" tab of the \"Edit your App ID Configuration\" page.\n  4. Add the 'In App Identity Presentment Merchant IDs' capability to your App ID and select the associated Merchant IDs.\n  5. Generate a new provisioning profile with these changes.\n\nYou'll also need to manually configure your app's entitlements plist file.\n\n##### Entitlement #1:\n\n    \n    \n    \"com.apple.developer.in-app-identity-presentment\": {\n        \"document-types\": [\n            \"us-drivers-license\"\n        ],\n        \"elements\": [\n            \"given-name\",\n            \"family-name\",\n            \"portrait\",\n            \"address\",\n            \"issuing-authority\",\n            \"document-expiration-date\",\n           \t\"document-number\",\n            \"driving-privileges\",\n            \"age\",\n            \"date-of-birth\"\n        ]\n    },\n\nFilter the list of entitlements to just the ones you requested through the\nentitlement request.\n\n##### Entitlement #2:\n\n    \n    \n    \"com.apple.developer.in-app-identity-presentment.merchant-identifiers\": [\n        “your-merchant-id-goes-here”\n    ]\n\nNote that you must add this entitlement even if you're using the same merchant\nID for Apple Pay. Apple Pay's com.apple.developer.in-app-payments entitlement\nis NOT recognized for identity verification.\n\n#### Can the Verify with Wallet API be used from a web browser?\n\nNo. The Verify with Wallet API is not currently supported by browsers.\nHowever, the World Wide Web Consortium (W3C) is developing a standard for\nonline presentment.\n\nFor browser-based online presentment, we intend to support the mDoc request\nAPI as developed in the W3C, pending its final definition, in a way that also\nenables presentment of conforming identity credentials from third party\napplications that meet appropriate privacy and security guidelines.\n\n#### How can I test my use of the API?\n\nThere are several ways to test your use of the API:\n\n  * **Using the iOS simulator.** The simulator comes preloaded with mock mobile driver’s license data you can use to test your integration with the API. For details on the keys and other resources needed to validate responses from the simulator’s mock data, download the Sample data and simulator keys bundle.\n  * **On an iOS device.** When you install the Wallet and Apple mDL Developer Integrator profile, the API will return mock data containing a real device signature but no issuer signature.\n  * **Test sample.** The Sample data and simulator keys bundle contains a sample response with all of the keys and certificates needed to validate it. Use this to test your response validation logic.\n\n### Elements\n\n#### What is the difference between the ISO 18013-5 and AAMVA namespaces?\n\nIn the ISO 18013-5 specification supports namespaces that allow different sets\nof elements to coexist within an identity document. ISO 18013-5 defines a set\nof standard elements within the org.iso.18013.5.1 namespace. The American\nAssociation of Motor Vehicle Administrators (AAMVA) defines its own namespace\ncontaining additional information specific to US driver’s licenses.\n\nFor more information about the namespaces and elements supported by Verify\nwith Wallet, see the  PKIdentityDriversLicenseDescriptor documentation.\n\n#### What does the address field consist of? Is it possible to get city,\nstate, and zip code as well?\n\nYes. The “address” element in the request provides the street address, city,\nstate, country and zip code.\n\n#### What's the difference between age and age threshold?\n\nAge is the user’s age in years. Age threshold is a boolean indicating whether\nthe user is above a certain age. For example, if the user is 42 years old:\n\n  * Age would return 42\n  * AgeThresholdElementWithAge:18 would return true\n  * AgeThresholdElementWithAge:65 would return false\n\nIf you only need to verify whether the user is above or below a certain age,\nyou should use an age threshold element as it is the most privacy preserving\napproach.\n\n#### What does issuing authority refer to? Is it is the name of the state\nissuing the license or ID?\n\nThis corresponds to the “issuing authority”, “issuing jurisdiction”, “issuing\ncountry” and “un distinguishing sign” elements described in the ISO 18013-5\nspecification.\n\n#### What is the structure of the name elements?\n\nThe API defines two name elements: given name and family name. These\ncorrespond to the “given_name” and ”family_name“ elements defined in the ISO\n18013-5 specification. When available, requesting given name will also return\nthe ”given_name_truncation“, ”aka_given_name“, ”name_suffix“, and ”aka_suffix“\nelements from the AAMVA namespace. Likewise, when available, requesting family\nname will also return the ”family_name_truncation“ and ”aka_family_name“\nelements from the AAMVA namespace.\n\nThe ISO 18013-5 specification does not include an element for middle name(s).\nGenerally, middle names are included with the given name field, but that’s\nultimately at the discretion of each issuer.\n\n#### Is it possible to verify whether a driver’s license is a compliant REAL\nID?\n\nREAL ID status is not available through the API.\n\n#### Does Apple Wallet also allow for non-standard Driver's Licenses (DLs)\nsuch as probationary and provisional DLs? If so, what's the best way for us to\ndifferentiate between different kinds of DLs?\n\nIf provided by the issuer, these license types would be part of the driving\nprivileges structure. This structure is defined in section 7.2.4 of ISO\n18103-5. (see https://www.iso.org/standard/69084.html)\n\nFor US driver’s licenses, AAMVA has their own variant called “domestic driving\nprivileges” that will also be returned if available (see page 19:\nhttps://www.aamva.org/getmedia/c4fe2a21-91ff-449d-9df3-5a7e33cf3a8e/mDL-\nImplementation-Guidelines-1-0_2021.pdf)\n\n### Response format\n\n#### Where is the session transcript used?\n\nWhile decrypting the response, you will construct a session transcript object.\nThe session transcript is used as the “info” parameter during HPKE decryption,\nand is used again while verifying the device signature as defined in ISO\n18013-5. See Verifying Wallet Identity Requests for more details.\n\n#### What is an IACA certificate? Which IACA certificates should I support?\n\nThe IACA (issuing authority certificate authority) certificate is the root of\ntrust used to verify that an identity document was created by a valid issuer,\nsuch as a state’s Department of Motor Vehicles.\n\nThe IACA certificates used by the Verify with Wallet API are listed above. In\norder to authenticate information returned from IDs in Wallet, your server\nwill need to trust these IACA certificates.\n\n#### Why must I verify the response on my server?\n\nVerifying the response on a server is necessary in order to ensure that the\nidentity document was created by a valid issuer and was presented from the\ncorrect device. Skipping verification or performing the verification within\nyour app leaves you vulnerable to identity documents tampered with by\nmalicious users.\n\n#### How do I know which issuer issued the identity document?\n\nYou can obtain the issuer (such as a state’s Department of Motor Vehicles)\nthat issued a given identity document by requesting the issuing authority\nelement. Alternatively, you can identify the issuer through the IACA\ncertificate corresponding to the identity document’s signing certificate.\n\n## Developer Footer\n\nApple\n\n  1. Developer\n  2. Apple Wallet\n  3. Get started with the Verify with Wallet API\n\n### Platforms\n\nOpen Menu Close Menu\n\n  * iOS\n  * iPadOS\n  * macOS\n  * tvOS\n  * visionOS\n  * watchOS\n\n### Tools\n\nOpen Menu Close Menu\n\n  * Swift\n  * SwiftUI\n  * Swift Playgrounds\n  * TestFlight\n  * Xcode\n  * Xcode Cloud\n  * SF Symbols\n\n### Topics & Technologies\n\nOpen Menu Close Menu\n\n  * Accessibility\n  * Accessories\n  * App Extensions\n  * App Store\n  * Audio & Video\n  * Augmented Reality\n  * Business\n  * Design\n  * Distribution\n  * Education\n  * Fonts\n  * Games\n  * Health & Fitness\n  * In-App Purchase\n  * Localization\n  * Maps & Location\n  * Machine Learning\n  * Open Source\n  * Security\n  * Safari & Web\n\n### Resources\n\nOpen Menu Close Menu\n\n  * Documentation\n  * Curriculum\n  * Downloads\n  * Forums\n  * Videos\n\n### Support\n\nOpen Menu Close Menu\n\n  * Support Articles\n  * Contact Us\n  * Bug Reporting\n  * System Status\n\n### Account\n\nOpen Menu Close Menu\n\n  * Apple Developer\n  * App Store Connect\n  * Certificates, IDs, & Profiles\n  * Feedback Assistant\n\n### Programs\n\nOpen Menu Close Menu\n\n  * Apple Developer Program\n  * Apple Developer Enterprise Program\n  * App Store Small Business Program\n  * MFi Program\n  * News Partner Program\n  * Video Partner Program\n  * Security Bounty Program\n  * Security Research Device Program\n\n### Events\n\nOpen Menu Close Menu\n\n  * Meet with Apple Experts\n  * App Accelerators\n  * App Store Awards\n  * Apple Design Awards\n  * Apple Developer Academies\n  * Entrepreneur Camp\n  * WWDC\n\nGet the Apple Developer app.\n\nLight\n\nDark\n\nAuto\n\nCopyright © 2023 Apple Inc. All rights reserved.\n\nTerms of Use Privacy Policy Agreements and Guidelines\n\n",
    "links": "[{\"link\": \"https://developer.apple.com/\", \"text\": \"\"}, {\"link\": \"https://developer.apple.com/search/\", \"text\": \"\"}, {\"link\": \"https://developer.apple.com/\", \"text\": \"\"}, {\"link\": \"https://developer.apple.com/news/\", \"text\": \"\"}, {\"link\": \"https://developer.apple.com/discover/\", \"text\": \"\"}, {\"link\": \"https://developer.apple.com/design/\", \"text\": \"\"}, {\"link\": \"https://developer.apple.com/develop/\", \"text\": \"\"}, {\"link\": \"https://developer.apple.com/distribute/\", \"text\": \"\"}, {\"link\": \"https://developer.apple.com/support/\", \"text\": \"\"}, {\"link\": \"https://developer.apple.com/account/\", \"text\": \"\"}, {\"link\": \"https://developer.apple.com/search/\", \"text\": \"\"}, {\"link\": \"https://developer.apple.com/download/\", \"text\": \"Downloads\"}, {\"link\": \"https://developer.apple.com/documentation/\", \"text\": \"Documentation\"}, {\"link\": \"https://developer.apple.com/videos/\", \"text\": \"Videos\"}, {\"link\": \"https://developer.apple.com/forums/\", \"text\": \"Forums\"}, {\"link\": \"https://developer.apple.com/xcode/\", \"text\": \"Xcode\"}, {\"link\": \"https://developer.apple.com/wallet/\", \"text\": \"Wallet\"}, {\"link\": \"https://developer.apple.com/wallet/\", \"text\": \"Overview\"}, {\"link\": \"https://developer.apple.com/wallet/whats-new/\", \"text\": \"What’s new\"}, {\"link\": \"https://developer.apple.com/wallet/get-started/\", \"text\": \"Get Started\"}, {\"link\": \"https://developer.apple.com/wallet/add-to-apple-wallet-guidelines/\", \"text\": \"Add to Apple Wallet Guidelines\"}, {\"link\": \"https://developer.apple.com/wallet/resources/\", \"text\": \"Resources\"}, {\"link\": \"https://developer.apple.com/contact/request/verify-with-wallet/\", \"text\": \"entitlement request form\"}, {\"link\": \"https://developer.apple.com/contact/request/verify-with-wallet/\", \"text\": \"submit an entitlement request\"}, {\"link\": \"https://developer.apple.com/design/human-interface-guidelines/technologies/wallet/#identity-verification\", \"text\": \"Human Interface Guidelines: Identity verification\"}, {\"link\": \"https://developer.apple.com/documentation/passkit/wallet/requesting_identity_data_from_a_wallet_pass/\", \"text\": \"Requesting identity data from a Wallet pass\"}, {\"link\": \"https://developer.apple.com/documentation/passkit/wallet/verifying_wallet_identity_requests/\", \"text\": \"Verifying Wallet identity requests\"}, {\"link\": \"https://developer.apple.com/videos/play/wwdc2022-10041/?time=1359\", \"text\": \"\"}, {\"link\": \"https://developer.apple.com/sample-code/wallet/identity_verification_sample.zip\", \"text\": \"Sample data and simulator keys\"}, {\"link\": \"https://developer.apple.com/bug-reporting/profiles-and-logs/?name=wallet\", \"text\": \"Wallet and Apple mDL Developer Integrator profile\"}, {\"link\": \"https://developer.apple.com/forums/tags/wallet/\", \"text\": \"Developer forums\"}, {\"link\": \"https://developer.apple.com/sample-code/wallet/identity_verification_sample.zip\", \"text\": \"Sample data and simulator keys\"}, {\"link\": \"https://developer.apple.com/bug-reporting/profiles-and-logs/?name=wallet\", \"text\": \"Wallet and Apple mDL Developer Integrator profile\"}, {\"link\": \"https://developer.apple.com/sample-code/wallet/identity_verification_sample.zip\", \"text\": \"Sample data and simulator keys\"}, {\"link\": \"https://developer.apple.com/documentation/passkit/pkidentitydriverslicensedescriptor\", \"text\": \" PKIdentityDriversLicenseDescriptor\"}, {\"link\": \"https://developer.apple.com/documentation/passkit/wallet/verifying_wallet_identity_requests\", \"text\": \"Verifying Wallet Identity Requests\"}, {\"link\": \"https://developer.apple.com/\", \"text\": \"Developer\"}, {\"link\": \"https://developer.apple.com/wallet/\", \"text\": \"Apple Wallet\"}, {\"link\": \"https://developer.apple.com/ios/\", \"text\": \"iOS\"}, {\"link\": \"https://developer.apple.com/ipados/\", \"text\": \"iPadOS\"}, {\"link\": \"https://developer.apple.com/macos/\", \"text\": \"macOS\"}, {\"link\": \"https://developer.apple.com/tvos/\", \"text\": \"tvOS\"}, {\"link\": \"https://developer.apple.com/visionos/\", \"text\": \"visionOS\"}, {\"link\": \"https://developer.apple.com/watchos/\", \"text\": \"watchOS\"}, {\"link\": \"https://developer.apple.com/swift/\", \"text\": \"Swift\"}, {\"link\": \"https://developer.apple.com/swiftui/\", \"text\": \"SwiftUI\"}, {\"link\": \"https://developer.apple.com/swift-playgrounds/\", \"text\": \"Swift Playgrounds\"}, {\"link\": \"https://developer.apple.com/testflight/\", \"text\": \"TestFlight\"}, {\"link\": \"https://developer.apple.com/xcode/\", \"text\": \"Xcode\"}, {\"link\": \"https://developer.apple.com/xcode-cloud/\", \"text\": \"Xcode Cloud\"}, {\"link\": \"https://developer.apple.com/sf-symbols/\", \"text\": \"SF Symbols\"}, {\"link\": \"https://developer.apple.com/accessibility/\", \"text\": \"Accessibility\"}, {\"link\": \"https://developer.apple.com/accessories/\", \"text\": \"Accessories\"}, {\"link\": \"https://developer.apple.com/app-extensions/\", \"text\": \"App Extensions\"}, {\"link\": \"https://developer.apple.com/app-store/\", \"text\": \"App Store\"}, {\"link\": \"https://developer.apple.com/audio/\", \"text\": \"Audio & Video\"}, {\"link\": \"https://developer.apple.com/augmented-reality/\", \"text\": \"Augmented Reality\"}, {\"link\": \"https://developer.apple.com/business/\", \"text\": \"Business\"}, {\"link\": \"https://developer.apple.com/design/\", \"text\": \"Design\"}, {\"link\": \"https://developer.apple.com/distribute/\", \"text\": \"Distribution\"}, {\"link\": \"https://developer.apple.com/education/\", \"text\": \"Education\"}, {\"link\": \"https://developer.apple.com/fonts/\", \"text\": \"Fonts\"}, {\"link\": \"https://developer.apple.com/games/\", \"text\": \"Games\"}, {\"link\": \"https://developer.apple.com/health-fitness/\", \"text\": \"Health & Fitness\"}, {\"link\": \"https://developer.apple.com/in-app-purchase/\", \"text\": \"In-App Purchase\"}, {\"link\": \"https://developer.apple.com/localization/\", \"text\": \"Localization\"}, {\"link\": \"https://developer.apple.com/maps/\", \"text\": \"Maps & Location\"}, {\"link\": \"https://developer.apple.com/machine-learning/\", \"text\": \"Machine Learning\"}, {\"link\": \"https://developer.apple.com/security/\", \"text\": \"Security\"}, {\"link\": \"https://developer.apple.com/safari/\", \"text\": \"Safari & Web\"}, {\"link\": \"https://developer.apple.com/documentation/\", \"text\": \"Documentation\"}, {\"link\": \"https://developer.apple.com/learn/curriculum/\", \"text\": \"Curriculum\"}, {\"link\": \"https://developer.apple.com/download/\", \"text\": \"Downloads\"}, {\"link\": \"https://developer.apple.com/forums/\", \"text\": \"Forums\"}, {\"link\": \"https://developer.apple.com/videos/\", \"text\": \"Videos\"}, {\"link\": \"https://developer.apple.com/support/articles/\", \"text\": \"Support Articles\"}, {\"link\": \"https://developer.apple.com/contact/\", \"text\": \"Contact Us\"}, {\"link\": \"https://developer.apple.com/bug-reporting/\", \"text\": \"Bug Reporting\"}, {\"link\": \"https://developer.apple.com/system-status/\", \"text\": \"System Status\"}, {\"link\": \"https://developer.apple.com/account/\", \"text\": \"Apple Developer\"}, {\"link\": \"https://developer.apple.com/account/ios/certificate/\", \"text\": \"Certificates, IDs, & Profiles\"}, {\"link\": \"https://developer.apple.com/programs/\", \"text\": \"Apple Developer Program\"}, {\"link\": \"https://developer.apple.com/programs/enterprise/\", \"text\": \"Apple Developer Enterprise Program\"}, {\"link\": \"https://developer.apple.com/app-store/small-business-program/\", \"text\": \"App Store Small Business Program\"}, {\"link\": \"https://developer.apple.com/programs/news-partner/\", \"text\": \"News Partner Program\"}, {\"link\": \"https://developer.apple.com/programs/video-partner/\", \"text\": \"Video Partner Program\"}, {\"link\": \"https://developer.apple.com/security-bounty/\", \"text\": \"Security Bounty Program\"}, {\"link\": \"https://developer.apple.com/programs/security-research-device/\", \"text\": \"Security Research Device Program\"}, {\"link\": \"https://developer.apple.com/events/\", \"text\": \"Meet with Apple Experts\"}, {\"link\": \"https://developer.apple.com/accelerator/\", \"text\": \"App Accelerators\"}, {\"link\": \"https://developer.apple.com/app-store/app-store-awards/\", \"text\": \"App Store Awards\"}, {\"link\": \"https://developer.apple.com/design/awards/\", \"text\": \"Apple Design Awards\"}, {\"link\": \"https://developer.apple.com/learn/experts/#academies\", \"text\": \"Apple Developer Academies\"}, {\"link\": \"https://developer.apple.com/entrepreneur-camp/\", \"text\": \"Entrepreneur Camp\"}, {\"link\": \"https://developer.apple.com/wwdc/\", \"text\": \"WWDC\"}, {\"link\": \"https://developer.apple.com/support/terms/\", \"text\": \"Agreements and Guidelines\"}]",
    "priceAndPlans": "[object Module]\n\nSkip Navigation\n\n  * Global Nav Open MenuGlobal Nav Close Menu\n  * Apple Developer\n\nSearch Developer\n\nCancel\n\n  * Apple Developer\n  * News\n  * Discover\n  * Design\n  * Develop\n  * Distribute\n  * Support\n  * Account\n  * \n\nCancel\n\nOnly search within “”\n\n### Quick Links\n\n5 Quick Links\n\nLight\n\nDark\n\nAuto\n\nApple\n\n  1. Developer\n  2. Documentation \n\n###  Platforms\n\nToggle Menu\n\n  * iOS\n  * iPadOS\n  * macOS\n  * tvOS\n  * visionOS\n  * watchOS\n\n###  Tools\n\nToggle Menu\n\n  * Swift\n  * SwiftUI\n  * Swift Playgrounds\n  * TestFlight\n  * Xcode\n  * Xcode Cloud\n  * SF Symbols\n\n###  Topics & Technologies\n\nToggle Menu\n\n  * Accessibility\n  * Accessories\n  * App Extension\n  * App Store\n  * Audio & Video\n  * Augmented Reality\n  * Business\n  * Design\n  * Distribution\n  * Education\n  * Fonts\n  * Games\n  * Health & Fitness\n  * In-App Purchase\n  * Localization\n  * Maps & Location\n  * Machine Learning\n  * Security\n  * Safari & Web\n\n###  Resources\n\nToggle Menu\n\n  *   * Documentation\n  * Curriculum\n  * Downloads\n  * Forums\n  * Videos\n\n###  Support\n\nToggle Menu\n\n  * Support Articles\n  * Contact Us\n  * Bug Reporting\n  * System Status\n\n###  Account\n\nToggle Menu\n\n  * Apple Developer\n  * App Store Connect\n  * Certificates, IDs, & Profiles\n  * Feedback Assistant\n\n###  Programs\n\nToggle Menu\n\n  * Apple Developer Program\n  * Apple Developer Enterprise Program\n  * App Store Small Business Program\n  * MFi Program\n  * News Partner Program\n  * Video Partner Program\n  * Security Bounty Program\n  * Security Research Device Program\n\n###  Events\n\nToggle Menu\n\n  * Events Overview\n  * App Accelerators\n  * App Store Awards\n  * Apple Design Awards\n  * Apple Developer Academies\n  * Entrepreneur Camp\n  * WWDC\n\nTo view the latest developer news, visit  News and Updates .\n\nLight\n\nDark\n\nAuto\n\nCopyright © 2023 Apple Inc. All rights reserved.\n\nTerms of Use  Privacy Policy  Agreements and Guidelines\n\n"
}