{
    "summary": "  * English\n    * Español \n    * Italiano \n    * Français \n  * Take a tour\n  * Blog\n  * Support\n  * Sign in\n\n  * Our solutions \n    * All\n    *       * The Real Identity Platform Build trust with your customers using a flexible, end-to-end identity verification platform.\n\n        * The Real Identity Platform\n        * Take a tour\n        * Book a meeting\n        * Try for free\n        * All products\n      * Airside Mobile Verify once, share anywhere.\n\n    *       * Onfido Studio Orchestrate verifications and signals into easy-to-manage workflows.\n\n      * Onfido Atlas™ Get fair, fast, and accurate results with AI.\n\n      * Smart Capture SDK Integrate an exceptional capture experience.\n\n      * Verification Suite Access a library of verifications and fraud signals.\n\n        * Verification Suite\n        * Document verification\n        * Biometric verification\n        * Data verification\n        * Fraud detection\n  * Challenges we solve\n    * All\n    * Challenges\n      * All\n      * Customer acquisitionDrive growth using automated onboarding.\n      * Global complianceNavigate regulatory compliance in each region.\n      * Cost of customer acquisitionAutomate onboarding processes to reduce costs.\n      * Fraud preventionPrevent fraud to protect your business and customers.\n      * Customer use cases\n    * Use cases\n      * All\n      * KYCNavigate know your customer compliance.\n      * Identity verificationCreate confidence in user identity.\n      * Driver registrationMeet regulatory needs and protect your fleet.\n      * User onboardingAutomate onboarding and maximize conversion.\n      * Age verificationVerify a customer’s legal age.\n    * Related content\n      * All\n      * EU KYC requirements guide\n      * Guide to digital identity verification\n      * Identity fraud report\n  * Industries\n    * All\n    * Industries\n      * All\n      * Industries we partner with\n      * Financial servicesAutomate onboarding, prevent fraud, and navigate KYC.\n      * GamingSeamlessly onboard players and meet KYC requirements.\n      * HealthcareKnow your patient using digital verification.\n      * Sharing economyProtect your platform, reputation, and users.\n      * Retail & eCommercePrevent account takeover and chargeback fraud.\n      * TelecommunicationsMeet regulatory requirements and stop fraud.\n      * TransportVerify renters, drivers, and riders.\n    * Financial services in depth\n      * All\n      * Enhance customer engagement with digital banking\n      * Identity verification for traditional banks\n      * Onboarding for digital-first banks\n      * KYC for remittance services\n      * eKYC for lending services\n  * Our company\n    * All\n    * About Onfido\n      * All\n      * Supported documents\n      * About Onfido\n      * Partners\n      * Leadership\n      * Certifications\n    * Learn more\n      * All\n      * Why Onfido?\n      * Press\n      * Careers\n    * Featured partnership\n      * All\n      * SalesforceLearn how our partnership embeds identity verification directly in Salesforce.\nLatest customer story\n\n      * All\n      * LemonwayLearn how Lemonway has doubled its number of validated wallets and accounts.\n  * Resources\n    * All\n    * Resources\n      * All\n      * BlogRead about all things digital identity.\n      * Customer storiesLearn how businesses succeed with Onfido.\n      * Reports & whitepapersGet in-depth research, insights, and guidance.\n      * VideosWatch expert webinars and videos.\n    * For developersEverything you need to get started with Onfido.\n      * All\n      * Developer hub\n      * API reference\n      * Release notes\nSupport\n\n      * All\n      * Knowledgebase\n      * Customer success & professional services\n\n  * Get in touch Try for free\n\nKYC  AML  Supported documents  All products  Interactive tour  ROI calculator\nFraud report  Financial services\n\nClose\n\nBack to resources\n\n# Complete guide to ID verification: services, apps, and APIs\n\nOctober 12, 2023\n\n**Lubna Takruri**\n\nSenior Content Marketing Manager\n\n## What is ID verification?\n\nID verification is the process of confirming an individual’s identity. It's a\ncrucial step in customer onboarding for various sectors, including finance,\ntravel, mobility, and online marketplaces. This guide aims to provide a\ncomprehensive overview of ID verification, focusing on services, apps, and\nAPIs that make this process seamless and secure.\n\n## ID verification as a service\n\nID verification as a service is a cloud-based solution that allows businesses\nto integrate identity verification into their existing systems. This service\nis often provided by specialized ID verification companies that offer various\nsolutions like document verification, biometric analysis, and data\nverification.\n\n### Benefits of using ID verification as a service\n\n  * Scalability — the ability to meet varying levels of demand faster than internal teams can scale.\n  * Cost-effectiveness — ID verification as a service is typically AI-powered, so can provide lower-priced checks than manual teams.\n  * Compliance with regulations — ID verification as a service companies should seek certifications that enable them to meet varying regulations. For example, Onfido is ETSI TS 119 461 certified. \n\n## ID verification API\n\nWhether building a solution in-house or leveraging off-the-shelf SDKs,\nbusinesses will need to connect to an ID verification API to effectively\ningest and act on the results of identity verification. Onfido’s API is based\non REST principles, using HTTP response codes and verbs, and token-based\nauthentication to give businesses the tools they need to automate complex\nlogic. Onfido’s API can generate SDK tokens, create applicants for identity\nverification checks, create and retrieve Onfido Studio workflow runs, and much\nmore.\n\n## How to choose the right ID verification API\n\nChoosing the right ID verification API for your business is a critical\ndecision that can significantly impact your operations. There are several\nfactors to consider, including reliability, speed, and security features.\nBelow, we delve into each of these aspects to help you make an informed\nchoice.\n\n### Reliability\n\nWhen it comes to ID verification, reliability is paramount – every moment you\nare unable to retrieve and act on verification results is a moment you are\nlosing potential customers. You need an API that is both dependably available\nand reliably delivering accurate performance. Here are some questions to\nconsider:\n\n  * Does the API have a high uptime, ensuring it's available when you need it?\n  * Are there any backup systems in place to ensure continuous service?\n  * What is the error rate, and how does the API handle errors?\n\nIt's advisable to look for APIs that offer at least 99.9% uptime and have\nrobust error-handling mechanisms. Reading reviews and asking for\nrecommendations can also provide insights into the API's reliability, as can\nchecking a dedicated status page such as Onfido’s.\n\n### Speed\n\nSpeed is another crucial factor, especially for businesses that require real-\ntime verification. Slow verification processes can lead to user frustration\nand abandoned transactions. Consider the following:\n\n  * What is the average response time of the API?\n  * Does the API support batch processing for bulk verifications?\n  * Are there any rate limits, and if so, do they meet your business needs?\n\nChoose an API that offers low-latency responses and can handle the volume of\nverifications you expect to conduct. If your business operates globally, also\ncheck if the API has multiple data centers to ensure fast response times\nworldwide.\n\n### Security features\n\nSecurity should never be compromised, especially when dealing with sensitive\npersonal information. Here's what to look for:\n\n  * Does the API use strong encryption methods for data transmission?\n  * Does the provider test their security in-house and externally through bug bounties?\n  * Does the API provider comply with relevant regulations, such as GDPR or CCPA?\n\nEnsure the API you choose uses industry-standard encryption protocols and\noffers secure authentication methods like API keys or OAuth. Compliance with\ndata protection regulations is also a must to avoid legal complications. For\nexample, Onfido is ISO 27001 and SOC 2 Type 2 compliant.\n\nBy carefully evaluating these factors, you can choose an ID verification API\nthat aligns with your business needs and offers a secure, fast, and reliable\nservice.\n\n## ID verification app\n\nMobile apps for ID verification are gaining traction for their convenience,\nuser-friendly interfaces, and the ability to perform checks on the go. These\napps, like Onfido’s Smart Capture, utilize the smartphone's camera and other\nbuilt-in features to scan documents, capture biometric data, and provide real-\ntime results. Below, we explore some of the popular features in ID\nverification apps and why they matter.\n\n### Document scanning\n\nOne of the primary features of ID verification apps is document verification.\nThis feature allows users to capture images of identification documents like\npassports, driver's licenses, and social security cards. Here are some points\nto consider:\n\n  * Does the app offer auto-capture capabilities to ensure high-quality scans?\n  * Can it recognize and extract information from various types of documents?\n  * Is the scanning process quick and straightforward?\n\nLook for apps that offer intelligent document recognition and can\nautomatically capture the document when it's in focus. This ensures that the\nscans are clear and readable, which is crucial for accurate verification.\n\n### Biometric capture\n\nFace recognition adds an extra layer of security by matching the user's face\nwith the photo on their identification document. This biometric verification\nis particularly useful for confirming that the person providing the ID is its\nlegitimate owner. Consider the following:\n\n  * Does the app offer liveness detection to prevent spoofing?\n  * How accurate is the face matching algorithm?\n  * Is the process quick and non-intrusive for the user?\n\nChoose an app that offers advanced liveness detection features, such as\nrequiring the user to blink or turn their heads, to ensure that the face being\nscanned is that of a live person. The face matching algorithm should also be\nhighly accurate to prevent false positives or negatives.\n\n### Fast results\n\nThe ability to provide real-time results is a significant advantage,\nespecially for businesses that require immediate verification. Here's what to\nlook for:\n\n  * How quickly does the app return verification results?\n  * Does it offer a summary of the verification checks performed?\n  * Can the results be integrated into your existing systems?\n\nAn ideal ID verification app should quickly provide results, complete with a\nsummary of the checks performed and their outcomes. If you're using the app\nfor business purposes, ensure that it can integrate with your existing systems\nfor a seamless user experience.\n\nBy focusing on these key features, you can choose an ID verification app that\nnot only meets your needs but also provides a secure, fast, and user-friendly\nexperience.\n\n## Choosing the right ID verification service\n\nThe ID verification market is crowded with various companies offering a range\nof solutions, from APIs and apps to cloud-based services. While the core\nfunction remains the same—verifying identities—what sets these companies apart\nare the unique features they offer. Below, we delve into some of these top\nfeatures that make certain companies stand out in the ID verification\nindustry.\n\n### Global support\n\nOne of the key features to look for is the ability to support multiple types\nof identification documents around the world, so your business can seamlessly\nexpand.\n\n  * Does the company offer a wide range of document support?\n  * Can it handle documents in multiple languages?\n\nCompanies that offer multi-document support are generally more versatile and\ncan cater to a broader audience, making them ideal choices for businesses with\nglobal operations.\n\n### Advanced biometric analysis\n\nBiometric verification is becoming increasingly important in identity\nverification. This involves using facial recognition, fingerprint scanning,\nand sometimes even iris scanning.\n\n  * Does the company offer advanced biometric features?\n  * How secure and accurate are these biometric methods?\n\nCompanies that offer robust biometric analysis are generally considered more\nsecure and are better at preventing fraud. Onfido Motion is a-next generation\nbiometric liveness solution delivering seamless, secure, and inclusive\ncustomer verification. With a simple head-turn capture, businesses can\nautomate customer onboarding and assess more customers, more quickly and\nefficiently while significantly reducing their fraud exposure.\n\n### Certifications\n\nCertifications that enable the ID verification provider to operate and be\naccepted by regulators are important for regulated industries like financial\nservices, transportation, and gambling. When choosing a vendor it’s important\nto assess:\n\n  * Does the company adhere to international compliance standards?\n  * Do they offer features that help your business stay compliant?\n\n### User experience\n\nThe ease with which end-users can go through the verification process is also\na significant factor. A complicated or time-consuming process can deter users.\n\n  * Is the user interface intuitive?\n  * Does the company offer a seamless verification experience across multiple platforms?\n\nA focus on user experience often translates to higher conversion rates and\ncustomer satisfaction.\n\n### Scalability\n\nAs your business grows, your ID verification needs will also expand. The\nability to scale is a crucial feature.\n\n  * Can the service handle a growing number of verifications?\n  * Is it easy to integrate additional features or services?\n\nCompanies that offer scalable solutions can adapt to your growing needs,\nproviding long-term value.\n\nBy considering these top features, you can make an informed decision when\nchoosing an ID verification company that aligns with your business needs and\noffers a secure, efficient, and compliant service.\n\nWant to learn more about digital identity verification?\n\nDownload our report to discover how the identity verification landscape has\nshifted, what technologies are coming, and best practices for building\nworkflows and assessing vendors.\n\nGet the report\n\n## What is an online ID verification service?\n\nSimply put, Online ID verification services are web-based solutions that allow\nfor the verification of identities over the internet. Once performed face-to-\nface, ID verification is now overwhelmingly conducted remotely — these\nservices are used by regulated industries conducing KYC.\n\n### Advantages of online ID verification\n\n  * Accessibility — verification can be conducted at anytime, from anywhere. Potential customers do not need to travel to stores or branches to be verified.\n  * Speed — verification can be completed online in seconds, and result in faster access to products and services.\n  * Global reach — online ID verification services can accurately process thousands of global identity documents, something that’s not feasible for in-store staff. \n\n## Verifiying ID: The final word\n\nID verification is an essential process for businesses that need to confirm\nthe identity of their customers or users. With various services, apps, and\nAPIs available, choosing the right solution can be overwhelming. This guide\naims to provide a comprehensive overview to help you make an informed\ndecision.\n\nAt Onfido, we provide scalable and agile identity verification solutions\ndesigned to meet the specific requirements of businesses in various industries\nall over the world. Our Real Identity Platform offers a suite of verification\nchecks to meet your needs, which can be orchestrated in our no-code workflow\nbuilder, Onfido Studio.\n\nReady to make ID verification simple?\n\nThe Real Identity Platform is trusted by over 1,100 businesses to verify their\ncustomers. Get in touch to learn more, or take our interactive tour to see\nit’s capabilities and try out our workflow builder.\n\nTake our interactive tour\n\n##### About the author\n\nLubna Takruri is a Senior Content Marketing Manager at Onfido. Her background\nas a storyteller spans journalism and television production around the world.\nShe enjoys weaving impactful narratives for brands and communities, focusing\non AI and technological advancements. She has worked for CNBC, the Associated\nPress, and contributed to many global outlets and organizations. Lubna speaks\nfluent Arabic and has a Masters degree from UC Berkeley.\n\nWhat's new?\n\nDiscover more identity insights and resources\n\nAll resources\n\nBlog\n\nOnPolicy | November 2023\n\nBlog\n\nHow deepfakes are challenging identity verification\n\nBlog\n\nWhat are the pros and cons of KYC in crypto?\n\n##  Ready to get started?\n\nOur identity experts are available to talk through your requirements, answer\nquestions, and set up a demo.\n\nContact us  Take a tour\n\n**Onfido uses 256-bit SSL encryption 100% of the time on every device.**\n\nOnfido is SOC 2 Type II compliant.\n\nOnfido has been certified by BSI to ISO 27001 under certificate number IS\n660122.\n\n* * *\n\n  * Solutions\n    * Real Identity Platform\n    * Verification Suite\n    * Onfido Studio\n    * Onfido Atlas\n    * Smart Capture SDK\n  * Challenges we solve\n    * Compliance\n    * Customer acquisition\n    * Reducing cost of acquisition\n    * Fraud prevention\n  * Industries\n    * Financial services\n    * Gaming\n    * Healthcare\n    * Marketplaces & communities\n    * Retail & eCommerce\n    * Telecommunications\n    * Transport\n  * Our company\n    * About Onfido\n    * Why Onfido?\n    * Onfido partners\n    * Certifications\n    * Leadership\n    * Press\n    * Contact us\n    * Airside\n  * Resources\n    * Blog\n    * Supported documents\n    * Developer hub\n    * API reference\n    * Release notes\n    * Support\n    * Sign in\n\nFollow us\n\nBack to top\n\n* * *\n\n© Onfido, 2023. All rights reserved.  \nCompany registration number: 07479524.\n\n  * Service status\n  * Privacy Policy\n  * Website and B2B Privacy Policy\n  * Security and Compliance\n  * Cookie and SDK Policy\n  * Terms of Use\n  * Anti Modern Slavery Statement\n  * Responsible Security Bug Disclosure Policy\n\nCookie Preferences Cookie Preferences Cookie Preferences Cookie Preferences\n\n  \nWe care about your privacy! This website uses cookies to improve your\nexperience, tailor content to your preferences, and analyze performance and\ntraffic on our website. We share information about use of our site with our\nsocial media, advertising and analytics partners. Cookie Policy\n\nSettings Accept\n\nYour Opt Out Preference Signal is Honored\n\n## Privacy Preference Center\n\nWhen you visit any website, it may store or retrieve information on your\nbrowser, mostly in the form of cookies. This information might be about you,\nyour preferences or your device and is mostly used to make the site work as\nyou expect it to. The information does not usually directly identify you, but\nit can give you a more personalized web experience. Because we respect your\nright to privacy, you can choose not to allow some types of cookies. Click on\nthe different category headings to find out more and change our default\nsettings. However, blocking some types of cookies may impact your experience\nof the site and the services we are able to offer.\n\nAllow All\n\n###  Manage Consent Preferences\n\n#### Strictly Necessary Cookies\n\nAlways Active\n\nThese cookies are necessary for the website to function and cannot be switched\noff in our systems. They are usually only set in response to actions made by\nyou which amount to a request for services, such as setting your privacy\npreferences, logging in or filling in forms. You can set your browser to block\nor alert you about these cookies, but some parts of the site will not then\nwork.\n\n#### Performance Cookies\n\nPerformance Cookies\n\nThese cookies allow us to count visits and traffic sources so we can measure\nand improve the performance of our site. They help us to know which pages are\nthe most and least popular and see how visitors move around the site. All\ninformation these cookies collect is aggregated and therefore anonymous. If\nyou do not allow these cookies we will not know when you have visited our\nsite, and will not be able to monitor its performance.\n\n#### Functional Cookies\n\nFunctional Cookies\n\nThese cookies enable the website to provide enhanced functionality and\npersonalisation. They may be set by us or by third party providers whose\nservices we have added to our pages. If you do not allow these cookies then\nsome or all of these services may not function properly.\n\n#### Targeting Cookies\n\nTargeting Cookies\n\nThese cookies may be set through our website by our third party advertising\npartners. They may be used by those companies to build a profile of your\ninterests and to better reach you with personalised ads and content, both on\nour own website and third-party websites, apps, and other online services\n(“Services”). Advertising cookies enable the third party ad companies to track\nyour visits to the Services, to better understand your preferences and\ninterests in order to provide you more relevant ads on behalf of us and other\ncompanies. If you do not allow Targeting Cookies, you will still see ads\nonline but they may be less relevant to you.\n\nBack Button\n\n### Cookie List\n\nSearch Icon\n\nFilter Icon\n\nClear\n\ncheckbox label label\n\nApply Cancel\n\nConsent Leg.Interest\n\ncheckbox label label\n\ncheckbox label label\n\ncheckbox label label\n\nReject All Confirm My Choices\n\n",
    "links": "[{\"link\": \"https://onfido.com/blog/complete-guide-to-id-verification/\", \"text\": \"\"}]",
    "priceAndPlans": "  * English\n    * Español \n    * Italiano \n    * Français \n  * Take a tour\n  * Blog\n  * Support\n  * Sign in\n\n  * Our solutions \n    * All\n    *       * The Real Identity Platform Build trust with your customers using a flexible, end-to-end identity verification platform.\n\n        * The Real Identity Platform\n        * Take a tour\n        * Book a meeting\n        * Try for free\n        * All products\n      * Airside Mobile Verify once, share anywhere.\n\n    *       * Onfido Studio Orchestrate verifications and signals into easy-to-manage workflows.\n\n      * Onfido Atlas™ Get fair, fast, and accurate results with AI.\n\n      * Smart Capture SDK Integrate an exceptional capture experience.\n\n      * Verification Suite Access a library of verifications and fraud signals.\n\n        * Verification Suite\n        * Document verification\n        * Biometric verification\n        * Data verification\n        * Fraud detection\n  * Challenges we solve\n    * All\n    * Challenges\n      * All\n      * Customer acquisitionDrive growth using automated onboarding.\n      * Global complianceNavigate regulatory compliance in each region.\n      * Cost of customer acquisitionAutomate onboarding processes to reduce costs.\n      * Fraud preventionPrevent fraud to protect your business and customers.\n      * Customer use cases\n    * Use cases\n      * All\n      * KYCNavigate know your customer compliance.\n      * Identity verificationCreate confidence in user identity.\n      * Driver registrationMeet regulatory needs and protect your fleet.\n      * User onboardingAutomate onboarding and maximize conversion.\n      * Age verificationVerify a customer’s legal age.\n    * Related content\n      * All\n      * EU KYC requirements guide\n      * Guide to digital identity verification\n      * Identity fraud report\n  * Industries\n    * All\n    * Industries\n      * All\n      * Industries we partner with\n      * Financial servicesAutomate onboarding, prevent fraud, and navigate KYC.\n      * GamingSeamlessly onboard players and meet KYC requirements.\n      * HealthcareKnow your patient using digital verification.\n      * Sharing economyProtect your platform, reputation, and users.\n      * Retail & eCommercePrevent account takeover and chargeback fraud.\n      * TelecommunicationsMeet regulatory requirements and stop fraud.\n      * TransportVerify renters, drivers, and riders.\n    * Financial services in depth\n      * All\n      * Enhance customer engagement with digital banking\n      * Identity verification for traditional banks\n      * Onboarding for digital-first banks\n      * KYC for remittance services\n      * eKYC for lending services\n  * Our company\n    * All\n    * About Onfido\n      * All\n      * Supported documents\n      * About Onfido\n      * Partners\n      * Leadership\n      * Certifications\n    * Learn more\n      * All\n      * Why Onfido?\n      * Press\n      * Careers\n    * Featured partnership\n      * All\n      * SalesforceLearn how our partnership embeds identity verification directly in Salesforce.\nLatest customer story\n\n      * All\n      * LemonwayLearn how Lemonway has doubled its number of validated wallets and accounts.\n  * Resources\n    * All\n    * Resources\n      * All\n      * BlogRead about all things digital identity.\n      * Customer storiesLearn how businesses succeed with Onfido.\n      * Reports & whitepapersGet in-depth research, insights, and guidance.\n      * VideosWatch expert webinars and videos.\n    * For developersEverything you need to get started with Onfido.\n      * All\n      * Developer hub\n      * API reference\n      * Release notes\nSupport\n\n      * All\n      * Knowledgebase\n      * Customer success & professional services\n\n  * Get in touch Try for free\n\nKYC  AML  Supported documents  All products  Interactive tour  ROI calculator\nFraud report  Financial services\n\nClose\n\nComing soon… Identity Fraud Report 2024 | Pre-register to receive a copy the\nmoment it’s released.\n\nPre-register\n\nComing soon… Identity Fraud Report 2024 | Pre-register to receive a copy the\nmoment it’s released.\n\nPre-register\n\n#  Digital identity  \nmade simple\n\nCreate trust at onboarding and beyond with a complete, AI-powered digital\nidentity solution built to help you know your customers online.  Automation\nallows you to acquire new customers and reduce costs while meeting global KYC\nand AML compliance.\n\nGet in touch  See how it works\n\nLiminal and Onfido discuss best practices for account opening: user\nexperience, fraud prevention, and regulatory compliance.  Register now\n\n#  Digital identity  \nmade simple\n\nCreate trust at onboarding and beyond with a complete, AI-powered digital\nidentity solution built to help you know your customers online.  Automation\nallows you to acquire new customers and reduce costs while meeting global KYC\nand AML compliance.\n\nGet in touch  See how it works\n\nLiminal and Onfido discuss best practices for account opening: user\nexperience, fraud prevention, and regulatory compliance.  Register now\n\nTrusted by 1000+ global businesses\n\nPrevious\n\nNext\n\n##  How can Onfido  \nhelp your business?\n\n##  **Onboard more customers**\n\nMake a great first impression using our Smart Capture SDK with automated\nidentity verification powered by Atlas™ AI.\n\nDrive growth\n\n##  **Navigate compliance**\n\nSatisfy global and local regulatory compliance, including KYC, AML, and age\nverification requirements.\n\nMeet compliance\n\n##  **Prevent advanced fraud**\n\nStop identity fraud using award-winning document and biometric verifications,\ndata sources, and passive fraud detection signals.\n\nPrevent fraud\n\n##  **Reduce cost and complexity**\n\nAutomate onboarding to reduce the cost of customer acquisition. It’s easy to\norchestrate journeys that make verification simple.\n\nReduce costs\n\nOur solution\n\n##  The Real Identity Platform\n\nPut digital trust at the core of every customer interaction. Powered by fast,\nfair, and accurate AI, the Real Identity Platform brings together a global\nsuite of identity verifications and signals into an easy-to-use orchestration\nstudio.\n\nExplore the platform\n\n###  Verification Suite\n\nVerify customer identities using a library of award-winning document and\nbiometric verifications, trusted data sources, and passive fraud signals.\n\nDocument Verification  Biometric Verification  Data Verification  Fraud\nDetection\n\nExplore Verification Suite\n\n###  Onfido Studio\n\nOrchestrate digital identity verification and fraud prevention journeys that\npresent the right verifications at the right moments — no code required.\n\nExplore Onfido Studio\n\n###  Atlas™ AI\n\nAutomate onboarding, KYC compliance, and identity verification with the power\nof Onfido Atlas™, our award-winning AI technology developed in-house over 10\nyears.\n\nExplore Onfido Atlas™\n\n###  Smart Capture SDK\n\nDeliver an exceptional, bias-free identity verification experience for your\ncustomers using Onfido Smart Capture, our easy-to-integrate SDK built with\naccessibility in mind.\n\nExplore Smart Capture\n\n##  Real Identity Platform tour\n\nTake a tour\n\nProduct innovation\n\n##  Multi-layer fraud detection\n\nPrevent large-scale fraud attacks with a multi-layer approach to fraud\ndetection. Now available as part of the Onfido Real Identity Platform, Repeat\nAttempts flags when users submit a previously seen identity document — even if\nit’s been altered to contain different data. Known Faces alerts when a face\nhas been seen before. Device Intelligence recognizes risky IP addresses, bots,\ndevice integrity and geolocation. Together, these solutions add extra layers\nof fraud protection with no additional user friction.\n\nSee our latest product innovations\n\nDeveloper resources\n\n##  Built by developers for developers\n\nTake advantage of detailed documentation, product guides, API libraries, and\nreference materials that help you get up and running with ease.\n\n### Developer Hub\n\nGet everything you need to configure and integrate with the Onfido Real\nIdentity Platform.\n\nExplore resources\n\n### API reference\n\nMake integration quick and efficient using our comprehensive technical\nreference guides.\n\nGet documentation\n\n### Professional Services\n\nOur integration and success teams’ mission is to deliver maximum value for our\ncustomer.\n\nLearn more\n\n##  Recognized as a leader\n\nWith more than a decade of identity verification, fraud detection, and AI\ndevelopment experience, Onfido is recognized as a global technology leader\nproviding automated digital identity and authentication solutions.\n\n### Leading Vendor: Account Opening Financial Services\n\nLiminal Link Index 2023\n\nRead report\n\n### Best AI product in FinTech\n\nCogX 2022\n\nLearn more\n\n### Identity Verification Leader\n\nG2 Fall 2023\n\nLearn more\n\n### Identity Verification Momentum Leader\n\nG2 Fall 2023\n\nLearn more\n\n### Biometric Authentication Leader\n\nG2 Fall 2023\n\nLearn more\n\n### Anti-money Laundering Leader\n\nG2 Fall 2023\n\nLearn more\n\n### Europe Fraud Detection Leader\n\nG2 Fall 2023\n\nLearn more\n\n### Users Love Us\n\nG2\n\nLearn more\n\n### Company of the Year Award for Identity Verification Solutions\n\nFrost & Sullivan, 2023\n\nLearn more\n\n### Security Orchestration Solution of the Year\n\nCyberSecurity Breakthrough Award 2022\n\n### Best Innovation in Computer Vision\n\nCogX 2023\n\n## We required a quick, tactical solution that did not involve expensive IT\nengineering costs. Onfido Studio was perfect as it was an ‘off-the-shelf’\nproduct that we could plug into our application process but without\nintegrating it fully into our mainframe systems.\n\n###  Darren Prescott, Senior Manager Current Accounts & Credit Cards, The Co-\nOperative Bank\n\n## Partnering with Onfido has helped us deliver a premium onboarding\nexperience for new customers while enabling us to meet strict KYC\nrequirements. The sheer scale of Onfido’s identity verification has\naccelerated our strategic growth targets, supporting over 40,000 identity\nchecks daily.\n\n###  Hasan Luongo, VP of Global Marketing, Chipper Cash\n\nRead the Chipper Cash story\n\n## We want to give every customer a quick set-up, a smooth experience, and\npowerful credit access. That starts at onboarding — with Onfido, we have a\nfast, accurate, and human-less way to verify our customers, enabling our\ncompliance at scale.\n\n###  Eric Suen, Vice President of Technology, DBS\n\nRead the DBS Bank story\n\n## With Onfido Studio, Access Group is creating a superior user journey,\nmodifying the way candidates can prove their identity digitally. We went to\nfull production in just four weeks, providing over 3,000 identity verification\nchecks for Right to Work screenings in the two weeks that followed, with the\nagility of Studio to scale our operation.\n\n###  Colin Whipp, Head of Account Management, The Access Group\n\nRead The Access Group story\n\n## We're pleased to be part of this new approach, powering background checks\nand screening thanks to our partnership with Onfido. By providing the highest\nlevels of identity proofing, applicants are able to prove their status and\nmanage onboarding processes wherever they are and at a time to suit them. The\ndays of photocopying and in-person manual review are now in the past.\n\n###  Callum Murray, CEO, Amiqus\n\nRead the press release\n\nView all customer stories\n\nWhat’s new?\n\n##  Keep up to date with identity insights and resources\n\nAll resources\n\nOnPolicy | November 2023\n\nWelcome to the return of Onfido’s Policy Corner, your regular briefing on key\nglobal policy updates from the world of digital identity, regulatory\ncompliance, AI,…\n\nRead more\n\nHow deepfakes are challenging identity verification\n\nThe digital realm is witnessing a burgeoning threat to identity verification\nprocesses in the form of deepfakes. Until recently, deepfakes were more rare\ndue to…\n\nRead more\n\nWhat are the pros and cons of KYC in crypto?\n\nCryptocurrency is an industry that has captivated people for over a decade –\nthe burgeoning digital currency has revolutionized how we perceive and\ninteract with…\n\nRead more\n\nCrypto KYC requirements\n\nCryptocurrency is an exciting frontier with great potential to reshape the\ntraditional financial ecosystem. The possibility for substantial growth has\ncaptured the attention of investors…\n\nRead more\n\nWhich crypto exchanges use KYC?\n\nKYC (know your customer) verification for crypto exchanges typically involves\nusers submitting personal information, like their name, date of birth,\naddress, and a selfie or…\n\nRead more\n\nHow do you get KYC on crypto?\n\nWhile know your customer (KYC) requirements typically arise in the context of\nbanks and other financial institutions, they also can apply to cryptocurrency\nexchanges. What…\n\nRead more\n\n##  Ready to get started?\n\nOur identity experts are available to talk through your requirements, answer\nquestions, and set up a demo.\n\nContact us  Try for free\n\n**Onfido uses 256-bit SSL encryption 100% of the time on every device.**\n\nOnfido is SOC 2 Type II compliant.\n\nOnfido has been certified by BSI to ISO 27001 under certificate number IS\n660122.\n\n* * *\n\n  * Solutions\n    * Real Identity Platform\n    * Verification Suite\n    * Onfido Studio\n    * Onfido Atlas\n    * Smart Capture SDK\n  * Challenges we solve\n    * Compliance\n    * Customer acquisition\n    * Reducing cost of acquisition\n    * Fraud prevention\n  * Industries\n    * Financial services\n    * Gaming\n    * Healthcare\n    * Marketplaces & communities\n    * Retail & eCommerce\n    * Telecommunications\n    * Transport\n  * Our company\n    * About Onfido\n    * Why Onfido?\n    * Onfido partners\n    * Certifications\n    * Leadership\n    * Press\n    * Contact us\n    * Airside\n  * Resources\n    * Blog\n    * Supported documents\n    * Developer hub\n    * API reference\n    * Release notes\n    * Support\n    * Sign in\n\nFollow us\n\nBack to top\n\n* * *\n\n© Onfido, 2023. All rights reserved.  \nCompany registration number: 07479524.\n\n  * Service status\n  * Privacy Policy\n  * Website and B2B Privacy Policy\n  * Security and Compliance\n  * Cookie and SDK Policy\n  * Terms of Use\n  * Anti Modern Slavery Statement\n  * Responsible Security Bug Disclosure Policy\n\nCookie Preferences Cookie Preferences Cookie Preferences Cookie Preferences\n\n  \nWe care about your privacy! This website uses cookies to improve your\nexperience, tailor content to your preferences, and analyze performance and\ntraffic on our website. We share information about use of our site with our\nsocial media, advertising and analytics partners. Cookie Policy\n\nSettings Accept\n\nYour Opt Out Preference Signal is Honored\n\n## Privacy Preference Center\n\nWhen you visit any website, it may store or retrieve information on your\nbrowser, mostly in the form of cookies. This information might be about you,\nyour preferences or your device and is mostly used to make the site work as\nyou expect it to. The information does not usually directly identify you, but\nit can give you a more personalized web experience. Because we respect your\nright to privacy, you can choose not to allow some types of cookies. Click on\nthe different category headings to find out more and change our default\nsettings. However, blocking some types of cookies may impact your experience\nof the site and the services we are able to offer.\n\nAllow All\n\n###  Manage Consent Preferences\n\n#### Strictly Necessary Cookies\n\nAlways Active\n\nThese cookies are necessary for the website to function and cannot be switched\noff in our systems. They are usually only set in response to actions made by\nyou which amount to a request for services, such as setting your privacy\npreferences, logging in or filling in forms. You can set your browser to block\nor alert you about these cookies, but some parts of the site will not then\nwork.\n\n#### Performance Cookies\n\nPerformance Cookies\n\nThese cookies allow us to count visits and traffic sources so we can measure\nand improve the performance of our site. They help us to know which pages are\nthe most and least popular and see how visitors move around the site. All\ninformation these cookies collect is aggregated and therefore anonymous. If\nyou do not allow these cookies we will not know when you have visited our\nsite, and will not be able to monitor its performance.\n\n#### Functional Cookies\n\nFunctional Cookies\n\nThese cookies enable the website to provide enhanced functionality and\npersonalisation. They may be set by us or by third party providers whose\nservices we have added to our pages. If you do not allow these cookies then\nsome or all of these services may not function properly.\n\n#### Targeting Cookies\n\nTargeting Cookies\n\nThese cookies may be set through our website by our third party advertising\npartners. They may be used by those companies to build a profile of your\ninterests and to better reach you with personalised ads and content, both on\nour own website and third-party websites, apps, and other online services\n(“Services”). Advertising cookies enable the third party ad companies to track\nyour visits to the Services, to better understand your preferences and\ninterests in order to provide you more relevant ads on behalf of us and other\ncompanies. If you do not allow Targeting Cookies, you will still see ads\nonline but they may be less relevant to you.\n\nBack Button\n\n### Cookie List\n\nSearch Icon\n\nFilter Icon\n\nClear\n\ncheckbox label label\n\nApply Cancel\n\nConsent Leg.Interest\n\ncheckbox label label\n\ncheckbox label label\n\ncheckbox label label\n\nReject All Confirm My Choices\n\n"
}