{
    "summary": "Powered by Cookiebot\n\n  * Consentimiento\n  * Detalles\n  * [#IABV2SETTINGS#]\n  * Acerca de las cookies\n\n## Esta página web usa cookies\n\nLas cookies de este sitio web se usan para personalizar el contenido y los\nanuncios, ofrecer funciones de redes sociales y analizar el tráfico. Además,\ncompartimos información sobre el uso que haga del sitio web con nuestros\npartners de redes sociales, publicidad y análisis web, quienes pueden\ncombinarla con otra información que les haya proporcionado o que hayan\nrecopilado a partir del uso que haya hecho de sus servicios.\n\nConsent Selection\n\nNecesario\n\nPreferencias\n\nEstadística\n\nMarketing\n\nMostrar detalles\n\n  * Necesario  18\n\nLas cookies necesarias ayudan a hacer una página web utilizable activando\nfunciones básicas como la navegación en la página y el acceso a áreas seguras\nde la página web. La página web no puede funcionar adecuadamente sin estas\ncookies.\n\n    * Cookiebot\n\n1\n\nMás información sobre este proveedor\n\nCookieConsentAlmacena el estado de consentimiento de cookies del usuario para\nel dominio actual\n\n **Caducidad** : 1 año **Tipo** : HTTP\n\n    * Google\n\n6\n\nMás información sobre este proveedor\n\ntest_cookieUtilizada para comprobar si el navegador del usuario admite\ncookies.\n\n **Caducidad** : 1 día **Tipo** : HTTP\n\n_GRECAPTCHAEsta cookie se utiliza para distinguir entre humanos y bots. Esto\nes beneficioso para la web con el objeto de elaborar informes válidos sobre el\nuso de su web.\n\n **Caducidad** : 180 días **Tipo** : HTTP\n\nrc::aEsta cookie se utiliza para distinguir entre humanos y bots. Esto es\nbeneficioso para la web con el objeto de elaborar informes válidos sobre el\nuso de su web.\n\n **Caducidad** : Persistent **Tipo** : HTML\n\nrc::bEsta cookie se utiliza para distinguir entre humanos y bots.\n\n **Caducidad** : Session **Tipo** : HTML\n\nrc::cEsta cookie se utiliza para distinguir entre humanos y bots.\n\n **Caducidad** : Session **Tipo** : HTML\n\nrc::fEsta cookie se utiliza para distinguir entre humanos y bots.\n\n **Caducidad** : Persistent **Tipo** : HTML\n\n    * Hubspot\n\n3\n\nMás información sobre este proveedor\n\nrc::d-15#Esta cookie se utiliza para distinguir entre humanos y bots.\n\n **Caducidad** : Persistent **Tipo** : HTML\n\n__cfruidEsta cookie es una parte de los servicios provistos por Cloudflare –\nIncluyendo el equilibrio de carga, entrega del contenido de la web y conexión\nal servidor DNS para operadores de la web.\n\n **Caducidad** : Session **Tipo** : HTTP\n\n__cf_bmEsta cookie se utiliza para distinguir entre humanos y bots. Esto es\nbeneficioso para la web con el objeto de elaborar informes válidos sobre el\nuso de su web.\n\n **Caducidad** : 1 día **Tipo** : HTTP\n\n    * LinkedIn\n\n2\n\nMás información sobre este proveedor\n\nli_gcAlmacena el estado de consentimiento de cookies del usuario para el\ndominio actual\n\n **Caducidad** : 180 días **Tipo** : HTTP\n\nbscookieEsta cookie se utiliza para identificar al visitante a través de la\naplicación. Esto le permite acceder a una página web a través de su aplicación\nde LinkedIn, por ejemplo.\n\n **Caducidad** : 1 año **Tipo** : HTTP\n\n    * YouTube\n\n2\n\nMás información sobre este proveedor\n\nCONSENT [x2]Utilizada para detectar si el visitante ha aceptado la categoría\nde marketing en el banner de cookies. Esta cookie es necesaria para que la web\ncumpla con el RGPD.\n\n **Caducidad** : 2 años **Tipo** : HTTP\n\n    * nr-data.net  \nwww.linkedin.com  \n\n2\n\nJSESSIONID [x2]Conserva los estados de los usuarios en todas las peticiones de\nla página.\n\n **Caducidad** : Session **Tipo** : HTTP\n\n    * veridas.com\n\n2\n\nelementorUtilizada en relación al tema de Wordpress de la web. La cookie\npermite al propietario de la web implementar o cambiar el contenido de la web\nen tiempo real.\n\n **Caducidad** : Persistent **Tipo** : HTML\n\nPHPSESSIDConserva los estados de los usuarios en todas las peticiones de la\npágina.\n\n **Caducidad** : Session **Tipo** : HTTP\n\n  * Preferencias  6\n\nLas cookies de preferencias permiten a la página web recordar información que\ncambia la forma en que la página se comporta o el aspecto que tiene, como su\nidioma preferido o la región en la que usted se encuentra.\n\n    * LinkedIn\n\n3\n\nMás información sobre este proveedor\n\nlangNecesaria para el mantenimiento de los ajustes de idioma a través de\npáginas dentro de la web.\n\n **Caducidad** : Session **Tipo** : HTTP\n\nlidcRegistra que grupo de servidores está sirviendo al visitante. Esto se\nutiliza en relación con el equilibrio de carga para optimizar la experiencia\ndel usuario.\n\n **Caducidad** : 1 día **Tipo** : HTTP\n\nli_alertsSe emplea para determinar dónde y cuándo ciertos pop-ups en la página\nweb deben presentarse al usuario y recordar si este los ha cerrado, para\nevitar que aparezcan repetidamente.\n\n **Caducidad** : 1 año **Tipo** : HTTP\n\n    * Personio\n\n1\n\nMás información sobre este proveedor\n\nlocaleLa cookie determina el idioma preferido y la configuración de país del\nvisitante - Esto permite a la web mostrar contenido más relevante para esa\nregión e idioma.\n\n **Caducidad** : Session **Tipo** : HTTP\n\n    * veridas.com\n\n2\n\nloglevelMantiene la configuración y los datos de salida cuando se emplea la\nDeveloper Tools Console en la sesión actual.\n\n **Caducidad** : Persistent **Tipo** : HTML\n\nHappyLocalTimeZoneRegistra la zona horaria del usuario.\n\n **Caducidad** : Session **Tipo** : HTTP\n\n  * Estadística  31\n\nLas cookies estadísticas ayudan a los propietarios de páginas web a comprender\ncómo interactúan los visitantes con las páginas web reuniendo y proporcionando\ninformación de forma anónima.\n\n    * Google\n\n5\n\nMás información sobre este proveedor\n\n_gaRegistra una identificación única que se utiliza para generar datos\nestadísticos acerca de cómo utiliza el visitante el sitio web.\n\n **Caducidad** : 2 años **Tipo** : HTTP\n\n_ga_#Recopila datos sobre el número de veces que un usuario ha visitado el\nsitio web además de las fechas de la primera visita y de la más reciente.\nUtilizada por Google Analytics.\n\n **Caducidad** : 2 años **Tipo** : HTTP\n\n_gatUtilizado por Google Analytics para controlar la tasa de peticiones\n\n **Caducidad** : 1 día **Tipo** : HTTP\n\n_gidRegistra una identificación única que se utiliza para generar datos\nestadísticos acerca de cómo utiliza el visitante el sitio web.\n\n **Caducidad** : 1 día **Tipo** : HTTP\n\ntdRegistra datos estadísticos del comportamiento del visitante en la web. Esto\nse utiliza para análisis internos por el operador de la web.\n\n **Caducidad** : Session **Tipo** : Pixel\n\n    * Hotjar\n\n10\n\nMás información sobre este proveedor\n\n_hjRecordingEnabledRecoge datos relacionadas con la navegación y el\ncomportamiento del usuario - Esto se usa para recopilar informes estadísticos\ny mapas térmicos para el propietario de la web.\n\n**Caducidad** : Session **Tipo** : HTML\n\n_hjRecordingLastActivityEstablece un identificador para la sesión. Esto\npermite a la web obtener datos del comportamiento del visitante con propósitos\nestadísticos.\n\n **Caducidad** : Session **Tipo** : HTML\n\nhjActiveViewportIdsEsta cookie tiene una cadena de ID en la sesión en curso.\nContiene datos no personales sobre las subpáginas a las que accede el\nvisitante. Esta información sirve para mejorar la experiencia del visitante.\n\n **Caducidad** : Persistent **Tipo** : HTML\n\nhjViewportIdGuarda el tamaño de pantalla del usuario para ajustar el tamaño de\nlas imágenes del sitio web.\n\n **Caducidad** : Session **Tipo** : HTML\n\n_hjAbsoluteSessionInProgressEsta cookie se utiliza para contar las veces que\nun sitio web ha sido visitado por diferentes visitantes. Esto se consigue\nasignando un ID aleatorio al visitante, para evitar el registro doble del\nvisitante.\n\n **Caducidad** : 1 día **Tipo** : HTTP\n\n_hjCookieTestRecoge datos relacionadas con la navegación y el comportamiento\ndel usuario - Esto se usa para recopilar informes estadísticos y mapas\ntérmicos para el propietario de la web.\n\n**Caducidad** : Session **Tipo** : HTTP\n\n_hjFirstSeenEsta cookie se utiliza para determinar si el visitante ha visitado\nel sitio web con anterioridad o si se trata de un nuevo visitante.\n\n **Caducidad** : 1 día **Tipo** : HTTP\n\n_hjIncludedInSessionSample_#Recopila estadísticas sobre las visitas del\nusuario al sitio web, como el número de visitas, el tiempo medio pasado en el\nsitio web y qué páginas se han leído.\n\n **Caducidad** : 1 día **Tipo** : HTTP\n\n_hjSession_#Recopila estadísticas sobre las visitas del usuario al sitio web,\ncomo el número de visitas, el tiempo medio pasado en el sitio web y qué\npáginas se han leído.\n\n **Caducidad** : 1 día **Tipo** : HTTP\n\n_hjSessionUser_#Recopila estadísticas sobre las visitas del usuario al sitio\nweb, como el número de visitas, el tiempo medio pasado en el sitio web y qué\npáginas se han leído.\n\n **Caducidad** : 1 año **Tipo** : HTTP\n\n    * Hubspot\n\n4\n\nMás información sobre este proveedor\n\n__hsscIdentifica si los datos del navegador necesitan ser actualizados.\n\n **Caducidad** : 1 día **Tipo** : HTTP\n\n__hssrcUtilizada para reconocer el navegador del visitante en su reentrada en\nla web.\n\n **Caducidad** : Session **Tipo** : HTTP\n\n__hstcEstablece un identificador para la sesión. Esto permite a la web obtener\ndatos del comportamiento del visitante con propósitos estadísticos.\n\n **Caducidad** : 180 días **Tipo** : HTTP\n\nhubspotutkEstablece un identificador para la sesión. Esto permite a la web\nobtener datos del comportamiento del visitante con propósitos estadísticos.\n\n **Caducidad** : 180 días **Tipo** : HTTP\n\n    * LinkedIn\n\n1\n\nMás información sobre este proveedor\n\nAnalyticsSyncHistorySe utiliza en relación con la sincronización de datos con\nel servicio de análisis de terceras partes.\n\n **Caducidad** : 30 días **Tipo** : HTTP\n\n    * Microsoft\n\n5\n\nMás información sobre este proveedor\n\nc.gifRecoge datos relacionadas con la navegación y el comportamiento del\nusuario - Esto se usa para recopilar informes estadísticos y mapas térmicos\npara el propietario de la web.\n\n**Caducidad** : Session **Tipo** : Pixel\n\n_clckRecoge datos relacionadas con la navegación y el comportamiento del\nusuario - Esto se usa para recopilar informes estadísticos y mapas térmicos\npara el propietario de la web.\n\n**Caducidad** : 1 año **Tipo** : HTTP\n\n_clskRegistra datos estadísticos del comportamiento del visitante en la web.\nEsto se utiliza para análisis internos por el operador de la web.\n\n **Caducidad** : 1 día **Tipo** : HTTP\n\n_cltkRegistra datos estadísticos del comportamiento del visitante en la web.\nEsto se utiliza para análisis internos por el operador de la web.\n\n **Caducidad** : Session **Tipo** : HTML\n\nCLIDPendiente\n\n **Caducidad** : 1 año **Tipo** : HTTP\n\n    * Twitter Inc.\n\n1\n\nMás información sobre este proveedor\n\npersonalization_idEstablecida por Twitter - La cookie permite al visitante\ncompartir contenido de la web en su perfil de Twitter.\n\n **Caducidad** : 400 días **Tipo** : HTTP\n\n    * YouTube\n\n2\n\nMás información sobre este proveedor\n\nyt-player-headers-readable [x2]Utilizada para determinar la calidad óptima del\nvideo basada en el dispositivo del visitante y en los ajustes de la red.\n\n **Caducidad** : Persistent **Tipo** : HTML\n\n    * embed-cdn.spotifycdn.com\n\n1\n\nsentryReplaySessionRegistra datos del comportamiento del visitante en la web.\nEsto se utiliza para el análisis interno y la optimización de la web.\n\n **Caducidad** : Session **Tipo** : HTML\n\n    * veridas.com\n\n2\n\nifso_last_viewedContiene datos de los últimos productos vistos por el\nvisitante. Se utilizan para estadísticas internas del operador de la web.\n\n **Caducidad** : Session **Tipo** : HTTP\n\nifso_visit_countsAlmacena datos del tiempo pasado en la web y en sus\nsubpáginas durante la sesión actual.\n\n **Caducidad** : 1 año **Tipo** : HTTP\n\n  * Marketing  59\n\nLas cookies de marketing se utilizan para rastrear a los visitantes en las\npáginas web. La intención es mostrar anuncios relevantes y atractivos para el\nusuario individual, y por lo tanto, más valiosos para los editores y terceros\nanunciantes.\n\n    * Google\n\n6\n\nMás información sobre este proveedor\n\nIDEUtilizada por Google DoubleClick para registrar e informar sobre las\nacciones del usuario en el sitio web tras visualizar o hacer clic en uno de\nlos anuncios del anunciante con el propósito de medir la eficacia de un\nanuncio y presentar anuncios específicos para el usuario.\n\n **Caducidad** : 1 año **Tipo** : HTTP\n\npagead/landing [x2]Recoge información del comportamiento del usuario en\ndiferentes webs para mostrar publicidad más relevante - También le permite a\nla web limitar el número de veces que el usuario está expuesto a un mismo\nanuncio.\n\n **Caducidad** : Session **Tipo** : Pixel\n\nads/ga-audiencesUtilizada por Google AdWords para reconectar con visitantes\nque tienen posibilidades de convertirse en clientes, se basa en el\ncomportamiento online del cliente a través de las webs.\n\n **Caducidad** : Session **Tipo** : Pixel\n\npagead/1p-user-list/#Utilizada para rastrear si el visitante ha mostrado un\ninterés específico em productos o eventos a través de múltiples webs y\ndetectar como el visitante navega entre webs - Esto se utiliza para la medida\nde los esfuerzos publicitarios y facilitar la tasa de emisión entre sitios.\n\n **Caducidad** : Session **Tipo** : Pixel\n\n_gcl_auUtilizada por Google AdSense para experimentar con la eficiencia\npublicitaria a través de las webs usando sus servicios.\n\n **Caducidad** : 3 meses **Tipo** : HTTP\n\n    * Hubspot\n\n2\n\nMás información sobre este proveedor\n\n__ptq.gifSends data to the marketing platform Hubspot about the visitor's\ndevice and behaviour. Tracks the visitor across devices and marketing\nchannels.\n\n **Caducidad** : Session **Tipo** : Pixel\n\nhs.superstore.laboratory#defaultPendiente\n\n **Caducidad** : Persistent **Tipo** : IDB\n\n    * LinkedIn\n\n3\n\nMás información sobre este proveedor\n\nbcookieUtilizada por el servicio de networking social LinkedIn para rastrear\nel uso de servicios incrustados.\n\n **Caducidad** : 1 año **Tipo** : HTTP\n\nli_sugrRecoge datos sobre el comportamiento y la interacción de los visitantes\n- Esto se utiliza para optimizar la web y hacer más relevante la publicidad en\nla misma.\n\n **Caducidad** : 3 meses **Tipo** : HTTP\n\nUserMatchHistoryAsegura la seguridad de navegación del visitante previniendo\nla falsificación de petición en sitios cruzados. Esta cookie es esencial para\nla seguridad de la web y del visitante.\n\n **Caducidad** : 30 días **Tipo** : HTTP\n\n    * Microsoft\n\n7\n\nMás información sobre este proveedor\n\nMR [x2]Pendiente\n\n **Caducidad** : 7 días **Tipo** : HTTP\n\nMUID [x2]Pendiente\n\n **Caducidad** : 1 año **Tipo** : HTTP\n\nSRM_BPendiente\n\n **Caducidad** : 1 año **Tipo** : HTTP\n\nANONCHKPendiente\n\n **Caducidad** : 1 día **Tipo** : HTTP\n\nSMPendiente\n\n **Caducidad** : Session **Tipo** : HTTP\n\n    * Spotify\n\n2\n\nMás información sobre este proveedor\n\nsp_landingUtilizada para implementar contenido de audio de Spotify en la web.\nTambién puede ser utilizada para registrar la interacción del visitante y\npreferencias en relación con el contenido de audio – Esto puede servir para\npropósitos de marketing y estadísticas.\n\n **Caducidad** : 400 días **Tipo** : HTTP\n\nsp_tUtilizada para implementar contenido de audio de Spotify en la web.\nTambién puede ser utilizada para registrar la interacción del visitante y\npreferencias en relación con el contenido de audio – Esto puede servir para\npropósitos de marketing y estadísticas.\n\n **Caducidad** : 400 días **Tipo** : HTTP\n\n    * Twitter Inc.\n\n6\n\nMás información sobre este proveedor\n\n1/i/adsct [x2]Recoge datos sobre el comportamiento y la interacción de los\nvisitantes - Esto se utiliza para optimizar la web y hacer más relevante la\npublicidad en la misma.\n\n **Caducidad** : Session **Tipo** : Pixel\n\nmuc_adsRecoge datos sobre el comportamiento y la interacción de los visitantes\n- Esto se utiliza para optimizar la web y hacer más relevante la publicidad en\nla misma.\n\n **Caducidad** : 400 días **Tipo** : HTTP\n\nguest_idRecopila datos relacionados con las visitas del usuario al sitio web,\ncomo el número de visitas, el tiempo medio pasado en el sitio web y qué\npáginas han sido cargadas, con el propósito de personalizar y mejorar el\nservicio de Twitter.\n\n **Caducidad** : 400 días **Tipo** : HTTP\n\nguest_id_adsRecoge información del comportamiento del visitante múltiples\nwebs. Esta información se usa en la web para optimizar la relevancia de la\npublicidad.\n\n **Caducidad** : 400 días **Tipo** : HTTP\n\nguest_id_marketingRecoge información del comportamiento del visitante\nmúltiples webs. Esta información se usa en la web para optimizar la relevancia\nde la publicidad.\n\n **Caducidad** : 400 días **Tipo** : HTTP\n\n    * YouTube\n\n31\n\nMás información sobre este proveedor\n\nLAST_RESULT_ENTRY_KEY [x2]Se usa para rastrear la interacción del usuario con\nel contenido integrado.\n\n**Caducidad** : Session **Tipo** : HTTP\n\nnextId [x2]Se usa para rastrear la interacción del usuario con el contenido\nintegrado.\n\n**Caducidad** : Session **Tipo** : HTTP\n\nrequests [x2]Se usa para rastrear la interacción del usuario con el contenido\nintegrado.\n\n**Caducidad** : Session **Tipo** : HTTP\n\nTESTCOOKIESENABLED [x2]Se usa para rastrear la interacción del usuario con el\ncontenido integrado.\n\n**Caducidad** : 1 día **Tipo** : HTTP\n\nyt.innertube::nextId [x2]Registra una identificación única para mantener\nestadísticas de qué vídeos de YouTube ha visto el usuario.\n\n **Caducidad** : Persistent **Tipo** : HTML\n\nyt.innertube::requests [x2]Registra una identificación única para mantener\nestadísticas de qué vídeos de YouTube ha visto el usuario.\n\n **Caducidad** : Persistent **Tipo** : HTML\n\nYtIdbMeta#databases [x2]Se usa para rastrear la interacción del usuario con el\ncontenido integrado.\n\n**Caducidad** : Persistent **Tipo** : IDB\n\n-39059c28fee2d28Pendiente\n\n **Caducidad** : Session **Tipo** : HTML\n\n-45696c622513463ePendiente\n\n **Caducidad** : Session **Tipo** : HTML\n\n-4f93bfd57620993Pendiente\n\n **Caducidad** : Session **Tipo** : HTML\n\niU5q-!O9@$Pendiente\n\n **Caducidad** : Session **Tipo** : HTML\n\nLogsDatabaseV2:V#||LogsRequestsStorePendiente\n\n **Caducidad** : Persistent **Tipo** : IDB\n\nremote_sidNecesaria para la implementación y funcionabilidad del contenido de\nvideo de YouTube en la web.\n\n **Caducidad** : Session **Tipo** : HTTP\n\nServiceWorkerLogsDatabase#SWHealthLogNecesaria para la implementación y\nfuncionabilidad del contenido de video de YouTube en la web.\n\n **Caducidad** : Persistent **Tipo** : IDB\n\nVISITOR_INFO1_LIVEIntenta calcular el ancho de banda del usuario en páginas\ncon vídeos de YouTube integrados.\n\n **Caducidad** : 180 días **Tipo** : HTTP\n\nVISITOR_PRIVACY_METADATAPendiente\n\n **Caducidad** : 180 días **Tipo** : HTTP\n\nYSCRegistra una identificación única para mantener estadísticas de qué vídeos\nde YouTube ha visto el usuario.\n\n **Caducidad** : Session **Tipo** : HTTP\n\nyt-remote-cast-availableRegistra las preferencias del reproductor de vídeo del\nusuario al ver vídeos incrustados de YouTube\n\n **Caducidad** : Session **Tipo** : HTML\n\nyt-remote-cast-installedRegistra las preferencias del reproductor de vídeo del\nusuario al ver vídeos incrustados de YouTube\n\n **Caducidad** : Session **Tipo** : HTML\n\nyt-remote-connected-devicesRegistra las preferencias del reproductor de vídeo\ndel usuario al ver vídeos incrustados de YouTube\n\n **Caducidad** : Persistent **Tipo** : HTML\n\nyt-remote-device-idRegistra las preferencias del reproductor de vídeo del\nusuario al ver vídeos incrustados de YouTube\n\n **Caducidad** : Persistent **Tipo** : HTML\n\nyt-remote-fast-check-periodRegistra las preferencias del reproductor de vídeo\ndel usuario al ver vídeos incrustados de YouTube\n\n **Caducidad** : Session **Tipo** : HTML\n\nyt-remote-session-appRegistra las preferencias del reproductor de vídeo del\nusuario al ver vídeos incrustados de YouTube\n\n **Caducidad** : Session **Tipo** : HTML\n\nyt-remote-session-nameRegistra las preferencias del reproductor de vídeo del\nusuario al ver vídeos incrustados de YouTube\n\n **Caducidad** : Session **Tipo** : HTML\n\n    * veridas.com  \nyoutube.com  \n\n2\n\nytidb::LAST_RESULT_ENTRY_KEY [x2]Se usa para rastrear la interacción del\nusuario con el contenido integrado.\n\n**Caducidad** : Persistent **Tipo** : HTML\n\n  * No clasificados 4\n\nLas cookies no clasificadas son cookies para las que todavía estamos en\nproceso de clasificar, junto con los proveedores de cookies individuales.\n\n    * veridas.com\n\n4\n\nApbyPIxcemnBGtVPendiente\n\n **Caducidad** : 1 día **Tipo** : HTTP\n\njitovqXpGBnhJPendiente\n\n **Caducidad** : 1 día **Tipo** : HTTP\n\nVtsQNvYPendiente\n\n **Caducidad** : 1 día **Tipo** : HTTP\n\nwgDSTvbFPendiente\n\n **Caducidad** : 1 día **Tipo** : HTTP\n\nConsentimiento entre dominios[#BULK_CONSENT_DOMAINS_COUNT#]\n[#BULK_CONSENT_TITLE#]\n\nLista de dominios a los que se aplica tu consentimiento:\n[#BULK_CONSENT_DOMAINS#]\n\nDeclaración de cookies actualizada por última vez el 10/21/23 por Cookiebot\n\n## [#IABV2_TITLE#]\n\n[#IABV2_BODY_INTRO#]\n\n[#IABV2_BODY_LEGITIMATE_INTEREST_INTRO#]\n\n[#IABV2_BODY_PREFERENCE_INTRO#]\n\n[#IABV2_LABEL_PURPOSES#]\n\n[#IABV2_BODY_PURPOSES_INTRO#]\n\n[#IABV2_BODY_PURPOSES#]\n\n[#IABV2_LABEL_FEATURES#]\n\n[#IABV2_BODY_FEATURES_INTRO#]\n\n[#IABV2_BODY_FEATURES#]\n\n[#IABV2_LABEL_PARTNERS#]\n\n[#IABV2_BODY_PARTNERS_INTRO#]\n\n[#IABV2_BODY_PARTNERS#]\n\nLas cookies son pequeños archivos de texto que las páginas web pueden utilizar\npara hacer más eficiente la experiencia del usuario.  \n  \nLa ley afirma que podemos almacenar cookies en su dispositivo si son\nestrictamente necesarias para el funcionamiento de esta página. Para todos los\ndemás tipos de cookies necesitamos su permiso.  \n  \nEsta página utiliza tipos diferentes de cookies. Algunas cookies son colocadas\npor servicios de terceros que aparecen en nuestras páginas.\n\nNo vender ni compartir mi información personal\n\nDenegar Permitir la selección Personalizar\n\nPermitir todas\n\nPowered by Cookiebot by Usercentrics\n\nSkip to content\n\n  * Solutions \n\n  * Industries \n\n  * Use Cases \n\n  * Pricing \n\n  * Resources \n\n  * About \n\n/Verify\n\n  * Identity Verification Platform\n  * Age Verification\n\n/Authenticate\n\n  * Facial Access Control\n  * Face Biometric Authentication\n  * Voice Biometric Authentication\n\n  * Financial Services\n  * Insurance\n  * Telcos & Utilities\n  * iGaming\n  * Casinos & Betting Shops\n  * Stadiums & Events\n  * Sport Clubs & Fitness Centers\n  * Public Security\n\n/Identity Verification\n\n  * Customer Onboarding\n  * ID Document Verification\n\n/Face Authentication\n\n  * Physical Access Control\n  * Time & Attendance\n  * Visitor Management System\n\n/Voice authentication\n\n  * Contact Center Authentication\n\n/Insights\n\n  * Success Stories\n  * Blog\n  * Multimedia\n  * Academy\n  * Newsroom\n\n/Compliance\n\n  * Data Protection\n  * Regulations & Certifications\n\n/Developers\n\n  * Product Documentation Hub\n  * APIs\n  * SDKs\n\n  * About us\n  * Careers\n  * Partners\n  * Events\n  * Contact\n\nTry a demo\n\n  * English\n    * Español\n\nHome / Resources / **APIs**\n\n# Identity verification and document verification APIs\n\nWe develop Artificial Intelligence APIs for digital identity verification 100%\nproprietary and available in the cloud.\n\nProduct documentation hub\n\n# Best in-house Identity Verification  \nand User Authentication APIs\n\n## Vali-das\n\n### Orchestrating ID verification API\n\nValidas is a REST API that manages the requests made to the other APIs that\nmake up the onboarding process. It is also responsible for retrieving all the\nresults and data that these microservices generate and making them available\nthrough its API, facilitating the onboarding process.\n\n**\\+ Info**\n\n## XpressID\n\n### Plug&Play Onboarding API\n\n**XpressID** is a standard identity verification service designed for quick\nand easy integration into a web environment. In addition to an onboarding\nprocess with document verification and facial biometrics + proof of life\nmatching, XpressID offers the optional video call service.\n\n**\\+ Info**\n\n## das-Face\n\n### Facial recognition API\n\n**das-Face** is a REST API that compares two facial images and gives a\nsimilarity score to determine if they are the same person. The main functions\nit can perform are verification (1:1), identification (1:N), clustering (M:N),\nand proof of life or anti-fraud.\n\n**\\+ Info**\n\n## das-Face QR\n\n### Biometric QR generation API\n\n**das-Face QR** is a service based on a patented technology that allows the\nauthentication of a person through their facial biometrics.  The biometric\nverification process is performed as a comparison between a facial image and\nan abstract representation of the person’s face stored on a biometric\ncredential.\n\n**\\+ Info**\n\n## das-Peak\n\n### Voice biometrics API\n\n**das-Peak** is a REST API that compares two pieces of audio and determines if\nthey correspond to the same person. The system only needs 3 seconds of audio\nto make the comparison, in any language and with any phrase. This biometrics\nengine has been recognized as one of the best in the world in different global\nrankings.\n\n**\\+ Info**\n\n## Access our Documentation Hub and get started with Veridas ID verification\nAPIs\n\nOur APIs are available in the cloud and allow you to build a flow that is\nuniquely tailored to your needs.\n\n **> Modular integration:** Choose your own flow and combine our facial\nrecognition and document verification APIs through a single orchestrator API.\n\n **> Plug&Play integration**: With XpressID you can integrate a complete\nonboarding flow in 2 weeks.\n\nFind out more about our biometrics APIs in the Product  Documentation Hub.\n\nProduct documentation hub\n\n## Why use an identity verification API?\n\n**Remote Identity Verification is a key process** for any company that has\n**online interactions** with its customers.\n\nIdentity Verification APIs allow you to **verify the identity of your\ncustomers online** , at any moment, with no need for human interaction.\n\nVeridas develops **100% in-house ID verification APIs** that allow for\ndocument verification, facial recognition, and voice recognition.\n\nThese biometric APIs powered by Artificial Intelligence are ranked among the\nbest in the world by the National Institute of Standards and Technology\n(NIST).\n\nTry a demo\n\n## Why choose our document verification API?\n\nOur document verification API verifies the authenticity of identity documents\nfrom a wide document coverage.\n\n **More than 30 Artificial Intelligence algorithms** are launched on a single\ndocument to **verify its authenticity**. Our engine extracts the **full OCR**\nof the document and carries out advanced document **anti-fraud measures** such\nas material authenticity, document integrity, photo replacements, or NFC chip\nreading.\n\nTry a demo\n\n/Let’s talk!\n\nTalk to our identity verification team and find out what our solutions can do\nfor you:\n\n/Certified technology\n\n## About\n\n  * About us\n  * Careers\n  * Partners\n  * Events\n  * Contact\n\n## Solutions\n\n## Verify\n\n  * Identity Verification Platform\n  * Age Verification\n\n## Authenticate\n\n  * Facial Access Control\n  * Face authentication\n  * Voice authentication\n\n## Industries\n\n  * Financial Services\n  * Insurance\n  * Telcos & Utilities\n  * iGaming\n  * Casinos & Betting Shops\n  * Stadiums & Events\n  * Sport Clubs & Fitness Centers\n  * Public Security\n\n## Use cases\n\n## Identity Verification\n\n  * Customer Onboarding\n  * ID Document Verification\n\n## Face Authentication\n\n  * Physical Access Control\n  * Time & Attendance\n  * Visitor Management System\n\n## Voice authentication\n\n  * Contact Center Authentication\n\n## Resources\n\n## Insights\n\n  * Success Stories\n  * Blog\n  * Multimedia\n  * Academy\n  * Newsroom\n\n## Compliance\n\n  * Data Protection\n  * Regulations & Certifications\n\n## Developers\n\n  * Product Documentation Hub\n  * APIs\n  * SDKs\n\n## Partners\n\nBecome part of our network and add the best verification solution on the\nmarket to your product catalog.\n\nBecome a partner\n\nMore info\n\n## Find us worlwide\n\n  * Spain\n  * United States\n  * Mexico\n  * United Kingdom\n\n## Gartner peer-insights\n\nRead reviews\n\n## Follow us\n\n© VERIDAS 2023. All rights reserved.\n\nPrivacy Policy and Legal Notice  |  Cookies Policy  |  Information Security\nPolicy  | Quality Policy | Subsidies and grants\n\nen | es\n\n  * Solutions /Verify\n    * Identity Verification Platform\n    * Age Verification\n/Authenticate\n\n    * Facial Access Control\n    * Face authentication\n    * Voice authentication\n  * Industries\n    * Financial Services\n    * Insurance\n    * Telcos & Utilities\n    * iGaming\n    * Casinos & Betting Shops\n    * Stadiums & Events\n    * Sport Clubs & Fitness Centers\n    * Public Security\n  * Use Cases\n    * /Identity Verification\n      * Customer Onboarding\n      * ID Document Verification\n    * /Face Authentication\n      * Physical Access Control\n      * Time & Attendance\n      * Visitor Management System\n    * /Voice authentication\n      * Contact Center Authentication\nPricing\n\n  * Resources /Insights\n    * Success Stories\n    * Blog\n    * Multimedia\n    * Academy\n    * Newsroom\n/Compliance\n\n    * Data Protection\n    * Regulation & Certifications\n/Developers\n\n    * Product Documentation Hub\n    * APIs\n    * SDKs\n  * About\n    * About us\n    * Careers\n    * Partners\n    * Events\n    * Contact\n\nTry a demo\n\nPopup title\n\nLorem ipsum dolor sit amet, consectetur adipiscing elit. Ut elit tellus,\nluctus nec ullamcorper mattis, pulvinar dapibus leo.\n\n",
    "links": "[{\"link\": \"https://veridas.com/en/apis/\", \"text\": \"\"}, {\"link\": \"https://veridas.com/en/casinos-betting-shops/\", \"text\": \"\"}, {\"link\": \"https://veridas.com/en/apis/\", \"text\": \"\"}, {\"link\": \"https://veridas.com/en/partners\", \"text\": \"\"}, {\"link\": \"https://veridas.com/en/partners\", \"text\": \"\"}, {\"link\": \"https://veridas.com/en/privacy-policy\", \"text\": \"Privacy Policy and Legal Notice\"}, {\"link\": \"https://veridas.com/en/cookies-policy\", \"text\": \"Cookies Policy\"}, {\"link\": \"https://veridas.com/en/information-security-policy\", \"text\": \"Information Security Policy\"}, {\"link\": \"https://veridas.com/en/subsidies-and-grants/\", \"text\": \"Subsidies and grants\"}, {\"link\": \"https://veridas.com/en/apis/\", \"text\": \"en\"}, {\"link\": \"https://veridas.com/en/apis/\", \"text\": \"APIs\"}]",
    "priceAndPlans": "Powered by Cookiebot\n\n  * Consentimiento\n  * Detalles\n  * [#IABV2SETTINGS#]\n  * Acerca de las cookies\n\n## Esta página web usa cookies\n\nLas cookies de este sitio web se usan para personalizar el contenido y los\nanuncios, ofrecer funciones de redes sociales y analizar el tráfico. Además,\ncompartimos información sobre el uso que haga del sitio web con nuestros\npartners de redes sociales, publicidad y análisis web, quienes pueden\ncombinarla con otra información que les haya proporcionado o que hayan\nrecopilado a partir del uso que haya hecho de sus servicios.\n\nConsent Selection\n\nNecesario\n\nPreferencias\n\nEstadística\n\nMarketing\n\nMostrar detalles\n\n  * Necesario  18\n\nLas cookies necesarias ayudan a hacer una página web utilizable activando\nfunciones básicas como la navegación en la página y el acceso a áreas seguras\nde la página web. La página web no puede funcionar adecuadamente sin estas\ncookies.\n\n    * Cookiebot\n\n1\n\nMás información sobre este proveedor\n\nCookieConsentAlmacena el estado de consentimiento de cookies del usuario para\nel dominio actual\n\n **Caducidad** : 1 año **Tipo** : HTTP\n\n    * Google\n\n6\n\nMás información sobre este proveedor\n\ntest_cookieUtilizada para comprobar si el navegador del usuario admite\ncookies.\n\n **Caducidad** : 1 día **Tipo** : HTTP\n\n_GRECAPTCHAEsta cookie se utiliza para distinguir entre humanos y bots. Esto\nes beneficioso para la web con el objeto de elaborar informes válidos sobre el\nuso de su web.\n\n **Caducidad** : 180 días **Tipo** : HTTP\n\nrc::aEsta cookie se utiliza para distinguir entre humanos y bots. Esto es\nbeneficioso para la web con el objeto de elaborar informes válidos sobre el\nuso de su web.\n\n **Caducidad** : Persistent **Tipo** : HTML\n\nrc::bEsta cookie se utiliza para distinguir entre humanos y bots.\n\n **Caducidad** : Session **Tipo** : HTML\n\nrc::cEsta cookie se utiliza para distinguir entre humanos y bots.\n\n **Caducidad** : Session **Tipo** : HTML\n\nrc::fEsta cookie se utiliza para distinguir entre humanos y bots.\n\n **Caducidad** : Persistent **Tipo** : HTML\n\n    * Hubspot\n\n3\n\nMás información sobre este proveedor\n\nrc::d-15#Esta cookie se utiliza para distinguir entre humanos y bots.\n\n **Caducidad** : Persistent **Tipo** : HTML\n\n__cfruidEsta cookie es una parte de los servicios provistos por Cloudflare –\nIncluyendo el equilibrio de carga, entrega del contenido de la web y conexión\nal servidor DNS para operadores de la web.\n\n **Caducidad** : Session **Tipo** : HTTP\n\n__cf_bmEsta cookie se utiliza para distinguir entre humanos y bots. Esto es\nbeneficioso para la web con el objeto de elaborar informes válidos sobre el\nuso de su web.\n\n **Caducidad** : 1 día **Tipo** : HTTP\n\n    * LinkedIn\n\n2\n\nMás información sobre este proveedor\n\nli_gcAlmacena el estado de consentimiento de cookies del usuario para el\ndominio actual\n\n **Caducidad** : 180 días **Tipo** : HTTP\n\nbscookieEsta cookie se utiliza para identificar al visitante a través de la\naplicación. Esto le permite acceder a una página web a través de su aplicación\nde LinkedIn, por ejemplo.\n\n **Caducidad** : 1 año **Tipo** : HTTP\n\n    * YouTube\n\n2\n\nMás información sobre este proveedor\n\nCONSENT [x2]Utilizada para detectar si el visitante ha aceptado la categoría\nde marketing en el banner de cookies. Esta cookie es necesaria para que la web\ncumpla con el RGPD.\n\n **Caducidad** : 2 años **Tipo** : HTTP\n\n    * nr-data.net  \nwww.linkedin.com  \n\n2\n\nJSESSIONID [x2]Conserva los estados de los usuarios en todas las peticiones de\nla página.\n\n **Caducidad** : Session **Tipo** : HTTP\n\n    * veridas.com\n\n2\n\nelementorUtilizada en relación al tema de Wordpress de la web. La cookie\npermite al propietario de la web implementar o cambiar el contenido de la web\nen tiempo real.\n\n **Caducidad** : Persistent **Tipo** : HTML\n\nPHPSESSIDConserva los estados de los usuarios en todas las peticiones de la\npágina.\n\n **Caducidad** : Session **Tipo** : HTTP\n\n  * Preferencias  6\n\nLas cookies de preferencias permiten a la página web recordar información que\ncambia la forma en que la página se comporta o el aspecto que tiene, como su\nidioma preferido o la región en la que usted se encuentra.\n\n    * LinkedIn\n\n3\n\nMás información sobre este proveedor\n\nlangNecesaria para el mantenimiento de los ajustes de idioma a través de\npáginas dentro de la web.\n\n **Caducidad** : Session **Tipo** : HTTP\n\nlidcRegistra que grupo de servidores está sirviendo al visitante. Esto se\nutiliza en relación con el equilibrio de carga para optimizar la experiencia\ndel usuario.\n\n **Caducidad** : 1 día **Tipo** : HTTP\n\nli_alertsSe emplea para determinar dónde y cuándo ciertos pop-ups en la página\nweb deben presentarse al usuario y recordar si este los ha cerrado, para\nevitar que aparezcan repetidamente.\n\n **Caducidad** : 1 año **Tipo** : HTTP\n\n    * Personio\n\n1\n\nMás información sobre este proveedor\n\nlocaleLa cookie determina el idioma preferido y la configuración de país del\nvisitante - Esto permite a la web mostrar contenido más relevante para esa\nregión e idioma.\n\n **Caducidad** : Session **Tipo** : HTTP\n\n    * veridas.com\n\n2\n\nloglevelMantiene la configuración y los datos de salida cuando se emplea la\nDeveloper Tools Console en la sesión actual.\n\n **Caducidad** : Persistent **Tipo** : HTML\n\nHappyLocalTimeZoneRegistra la zona horaria del usuario.\n\n **Caducidad** : Session **Tipo** : HTTP\n\n  * Estadística  31\n\nLas cookies estadísticas ayudan a los propietarios de páginas web a comprender\ncómo interactúan los visitantes con las páginas web reuniendo y proporcionando\ninformación de forma anónima.\n\n    * Google\n\n5\n\nMás información sobre este proveedor\n\n_gaRegistra una identificación única que se utiliza para generar datos\nestadísticos acerca de cómo utiliza el visitante el sitio web.\n\n **Caducidad** : 2 años **Tipo** : HTTP\n\n_ga_#Recopila datos sobre el número de veces que un usuario ha visitado el\nsitio web además de las fechas de la primera visita y de la más reciente.\nUtilizada por Google Analytics.\n\n **Caducidad** : 2 años **Tipo** : HTTP\n\n_gatUtilizado por Google Analytics para controlar la tasa de peticiones\n\n **Caducidad** : 1 día **Tipo** : HTTP\n\n_gidRegistra una identificación única que se utiliza para generar datos\nestadísticos acerca de cómo utiliza el visitante el sitio web.\n\n **Caducidad** : 1 día **Tipo** : HTTP\n\ntdRegistra datos estadísticos del comportamiento del visitante en la web. Esto\nse utiliza para análisis internos por el operador de la web.\n\n **Caducidad** : Session **Tipo** : Pixel\n\n    * Hotjar\n\n10\n\nMás información sobre este proveedor\n\n_hjRecordingEnabledRecoge datos relacionadas con la navegación y el\ncomportamiento del usuario - Esto se usa para recopilar informes estadísticos\ny mapas térmicos para el propietario de la web.\n\n**Caducidad** : Session **Tipo** : HTML\n\n_hjRecordingLastActivityEstablece un identificador para la sesión. Esto\npermite a la web obtener datos del comportamiento del visitante con propósitos\nestadísticos.\n\n **Caducidad** : Session **Tipo** : HTML\n\nhjActiveViewportIdsEsta cookie tiene una cadena de ID en la sesión en curso.\nContiene datos no personales sobre las subpáginas a las que accede el\nvisitante. Esta información sirve para mejorar la experiencia del visitante.\n\n **Caducidad** : Persistent **Tipo** : HTML\n\nhjViewportIdGuarda el tamaño de pantalla del usuario para ajustar el tamaño de\nlas imágenes del sitio web.\n\n **Caducidad** : Session **Tipo** : HTML\n\n_hjAbsoluteSessionInProgressEsta cookie se utiliza para contar las veces que\nun sitio web ha sido visitado por diferentes visitantes. Esto se consigue\nasignando un ID aleatorio al visitante, para evitar el registro doble del\nvisitante.\n\n **Caducidad** : 1 día **Tipo** : HTTP\n\n_hjCookieTestRecoge datos relacionadas con la navegación y el comportamiento\ndel usuario - Esto se usa para recopilar informes estadísticos y mapas\ntérmicos para el propietario de la web.\n\n**Caducidad** : Session **Tipo** : HTTP\n\n_hjFirstSeenEsta cookie se utiliza para determinar si el visitante ha visitado\nel sitio web con anterioridad o si se trata de un nuevo visitante.\n\n **Caducidad** : 1 día **Tipo** : HTTP\n\n_hjIncludedInSessionSample_#Recopila estadísticas sobre las visitas del\nusuario al sitio web, como el número de visitas, el tiempo medio pasado en el\nsitio web y qué páginas se han leído.\n\n **Caducidad** : 1 día **Tipo** : HTTP\n\n_hjSession_#Recopila estadísticas sobre las visitas del usuario al sitio web,\ncomo el número de visitas, el tiempo medio pasado en el sitio web y qué\npáginas se han leído.\n\n **Caducidad** : 1 día **Tipo** : HTTP\n\n_hjSessionUser_#Recopila estadísticas sobre las visitas del usuario al sitio\nweb, como el número de visitas, el tiempo medio pasado en el sitio web y qué\npáginas se han leído.\n\n **Caducidad** : 1 año **Tipo** : HTTP\n\n    * Hubspot\n\n4\n\nMás información sobre este proveedor\n\n__hsscIdentifica si los datos del navegador necesitan ser actualizados.\n\n **Caducidad** : 1 día **Tipo** : HTTP\n\n__hssrcUtilizada para reconocer el navegador del visitante en su reentrada en\nla web.\n\n **Caducidad** : Session **Tipo** : HTTP\n\n__hstcEstablece un identificador para la sesión. Esto permite a la web obtener\ndatos del comportamiento del visitante con propósitos estadísticos.\n\n **Caducidad** : 180 días **Tipo** : HTTP\n\nhubspotutkEstablece un identificador para la sesión. Esto permite a la web\nobtener datos del comportamiento del visitante con propósitos estadísticos.\n\n **Caducidad** : 180 días **Tipo** : HTTP\n\n    * LinkedIn\n\n1\n\nMás información sobre este proveedor\n\nAnalyticsSyncHistorySe utiliza en relación con la sincronización de datos con\nel servicio de análisis de terceras partes.\n\n **Caducidad** : 30 días **Tipo** : HTTP\n\n    * Microsoft\n\n5\n\nMás información sobre este proveedor\n\nc.gifRecoge datos relacionadas con la navegación y el comportamiento del\nusuario - Esto se usa para recopilar informes estadísticos y mapas térmicos\npara el propietario de la web.\n\n**Caducidad** : Session **Tipo** : Pixel\n\n_clckRecoge datos relacionadas con la navegación y el comportamiento del\nusuario - Esto se usa para recopilar informes estadísticos y mapas térmicos\npara el propietario de la web.\n\n**Caducidad** : 1 año **Tipo** : HTTP\n\n_clskRegistra datos estadísticos del comportamiento del visitante en la web.\nEsto se utiliza para análisis internos por el operador de la web.\n\n **Caducidad** : 1 día **Tipo** : HTTP\n\n_cltkRegistra datos estadísticos del comportamiento del visitante en la web.\nEsto se utiliza para análisis internos por el operador de la web.\n\n **Caducidad** : Session **Tipo** : HTML\n\nCLIDPendiente\n\n **Caducidad** : 1 año **Tipo** : HTTP\n\n    * Twitter Inc.\n\n1\n\nMás información sobre este proveedor\n\npersonalization_idEstablecida por Twitter - La cookie permite al visitante\ncompartir contenido de la web en su perfil de Twitter.\n\n **Caducidad** : 400 días **Tipo** : HTTP\n\n    * YouTube\n\n2\n\nMás información sobre este proveedor\n\nyt-player-headers-readable [x2]Utilizada para determinar la calidad óptima del\nvideo basada en el dispositivo del visitante y en los ajustes de la red.\n\n **Caducidad** : Persistent **Tipo** : HTML\n\n    * embed-cdn.spotifycdn.com\n\n1\n\nsentryReplaySessionRegistra datos del comportamiento del visitante en la web.\nEsto se utiliza para el análisis interno y la optimización de la web.\n\n **Caducidad** : Session **Tipo** : HTML\n\n    * veridas.com\n\n2\n\nifso_last_viewedContiene datos de los últimos productos vistos por el\nvisitante. Se utilizan para estadísticas internas del operador de la web.\n\n **Caducidad** : Session **Tipo** : HTTP\n\nifso_visit_countsAlmacena datos del tiempo pasado en la web y en sus\nsubpáginas durante la sesión actual.\n\n **Caducidad** : 1 año **Tipo** : HTTP\n\n  * Marketing  59\n\nLas cookies de marketing se utilizan para rastrear a los visitantes en las\npáginas web. La intención es mostrar anuncios relevantes y atractivos para el\nusuario individual, y por lo tanto, más valiosos para los editores y terceros\nanunciantes.\n\n    * Google\n\n6\n\nMás información sobre este proveedor\n\nIDEUtilizada por Google DoubleClick para registrar e informar sobre las\nacciones del usuario en el sitio web tras visualizar o hacer clic en uno de\nlos anuncios del anunciante con el propósito de medir la eficacia de un\nanuncio y presentar anuncios específicos para el usuario.\n\n **Caducidad** : 1 año **Tipo** : HTTP\n\npagead/landing [x2]Recoge información del comportamiento del usuario en\ndiferentes webs para mostrar publicidad más relevante - También le permite a\nla web limitar el número de veces que el usuario está expuesto a un mismo\nanuncio.\n\n **Caducidad** : Session **Tipo** : Pixel\n\nads/ga-audiencesUtilizada por Google AdWords para reconectar con visitantes\nque tienen posibilidades de convertirse en clientes, se basa en el\ncomportamiento online del cliente a través de las webs.\n\n **Caducidad** : Session **Tipo** : Pixel\n\npagead/1p-user-list/#Utilizada para rastrear si el visitante ha mostrado un\ninterés específico em productos o eventos a través de múltiples webs y\ndetectar como el visitante navega entre webs - Esto se utiliza para la medida\nde los esfuerzos publicitarios y facilitar la tasa de emisión entre sitios.\n\n **Caducidad** : Session **Tipo** : Pixel\n\n_gcl_auUtilizada por Google AdSense para experimentar con la eficiencia\npublicitaria a través de las webs usando sus servicios.\n\n **Caducidad** : 3 meses **Tipo** : HTTP\n\n    * Hubspot\n\n2\n\nMás información sobre este proveedor\n\n__ptq.gifSends data to the marketing platform Hubspot about the visitor's\ndevice and behaviour. Tracks the visitor across devices and marketing\nchannels.\n\n **Caducidad** : Session **Tipo** : Pixel\n\nhs.superstore.laboratory#defaultPendiente\n\n **Caducidad** : Persistent **Tipo** : IDB\n\n    * LinkedIn\n\n3\n\nMás información sobre este proveedor\n\nbcookieUtilizada por el servicio de networking social LinkedIn para rastrear\nel uso de servicios incrustados.\n\n **Caducidad** : 1 año **Tipo** : HTTP\n\nli_sugrRecoge datos sobre el comportamiento y la interacción de los visitantes\n- Esto se utiliza para optimizar la web y hacer más relevante la publicidad en\nla misma.\n\n **Caducidad** : 3 meses **Tipo** : HTTP\n\nUserMatchHistoryAsegura la seguridad de navegación del visitante previniendo\nla falsificación de petición en sitios cruzados. Esta cookie es esencial para\nla seguridad de la web y del visitante.\n\n **Caducidad** : 30 días **Tipo** : HTTP\n\n    * Microsoft\n\n7\n\nMás información sobre este proveedor\n\nMR [x2]Pendiente\n\n **Caducidad** : 7 días **Tipo** : HTTP\n\nMUID [x2]Pendiente\n\n **Caducidad** : 1 año **Tipo** : HTTP\n\nSRM_BPendiente\n\n **Caducidad** : 1 año **Tipo** : HTTP\n\nANONCHKPendiente\n\n **Caducidad** : 1 día **Tipo** : HTTP\n\nSMPendiente\n\n **Caducidad** : Session **Tipo** : HTTP\n\n    * Spotify\n\n2\n\nMás información sobre este proveedor\n\nsp_landingUtilizada para implementar contenido de audio de Spotify en la web.\nTambién puede ser utilizada para registrar la interacción del visitante y\npreferencias en relación con el contenido de audio – Esto puede servir para\npropósitos de marketing y estadísticas.\n\n **Caducidad** : 400 días **Tipo** : HTTP\n\nsp_tUtilizada para implementar contenido de audio de Spotify en la web.\nTambién puede ser utilizada para registrar la interacción del visitante y\npreferencias en relación con el contenido de audio – Esto puede servir para\npropósitos de marketing y estadísticas.\n\n **Caducidad** : 400 días **Tipo** : HTTP\n\n    * Twitter Inc.\n\n6\n\nMás información sobre este proveedor\n\n1/i/adsct [x2]Recoge datos sobre el comportamiento y la interacción de los\nvisitantes - Esto se utiliza para optimizar la web y hacer más relevante la\npublicidad en la misma.\n\n **Caducidad** : Session **Tipo** : Pixel\n\nmuc_adsRecoge datos sobre el comportamiento y la interacción de los visitantes\n- Esto se utiliza para optimizar la web y hacer más relevante la publicidad en\nla misma.\n\n **Caducidad** : 400 días **Tipo** : HTTP\n\nguest_idRecopila datos relacionados con las visitas del usuario al sitio web,\ncomo el número de visitas, el tiempo medio pasado en el sitio web y qué\npáginas han sido cargadas, con el propósito de personalizar y mejorar el\nservicio de Twitter.\n\n **Caducidad** : 400 días **Tipo** : HTTP\n\nguest_id_adsRecoge información del comportamiento del visitante múltiples\nwebs. Esta información se usa en la web para optimizar la relevancia de la\npublicidad.\n\n **Caducidad** : 400 días **Tipo** : HTTP\n\nguest_id_marketingRecoge información del comportamiento del visitante\nmúltiples webs. Esta información se usa en la web para optimizar la relevancia\nde la publicidad.\n\n **Caducidad** : 400 días **Tipo** : HTTP\n\n    * YouTube\n\n31\n\nMás información sobre este proveedor\n\nLAST_RESULT_ENTRY_KEY [x2]Se usa para rastrear la interacción del usuario con\nel contenido integrado.\n\n**Caducidad** : Session **Tipo** : HTTP\n\nnextId [x2]Se usa para rastrear la interacción del usuario con el contenido\nintegrado.\n\n**Caducidad** : Session **Tipo** : HTTP\n\nrequests [x2]Se usa para rastrear la interacción del usuario con el contenido\nintegrado.\n\n**Caducidad** : Session **Tipo** : HTTP\n\nTESTCOOKIESENABLED [x2]Se usa para rastrear la interacción del usuario con el\ncontenido integrado.\n\n**Caducidad** : 1 día **Tipo** : HTTP\n\nyt.innertube::nextId [x2]Registra una identificación única para mantener\nestadísticas de qué vídeos de YouTube ha visto el usuario.\n\n **Caducidad** : Persistent **Tipo** : HTML\n\nyt.innertube::requests [x2]Registra una identificación única para mantener\nestadísticas de qué vídeos de YouTube ha visto el usuario.\n\n **Caducidad** : Persistent **Tipo** : HTML\n\nYtIdbMeta#databases [x2]Se usa para rastrear la interacción del usuario con el\ncontenido integrado.\n\n**Caducidad** : Persistent **Tipo** : IDB\n\n-39059c28fee2d28Pendiente\n\n **Caducidad** : Session **Tipo** : HTML\n\n-45696c622513463ePendiente\n\n **Caducidad** : Session **Tipo** : HTML\n\n-4f93bfd57620993Pendiente\n\n **Caducidad** : Session **Tipo** : HTML\n\niU5q-!O9@$Pendiente\n\n **Caducidad** : Session **Tipo** : HTML\n\nLogsDatabaseV2:V#||LogsRequestsStorePendiente\n\n **Caducidad** : Persistent **Tipo** : IDB\n\nremote_sidNecesaria para la implementación y funcionabilidad del contenido de\nvideo de YouTube en la web.\n\n **Caducidad** : Session **Tipo** : HTTP\n\nServiceWorkerLogsDatabase#SWHealthLogNecesaria para la implementación y\nfuncionabilidad del contenido de video de YouTube en la web.\n\n **Caducidad** : Persistent **Tipo** : IDB\n\nVISITOR_INFO1_LIVEIntenta calcular el ancho de banda del usuario en páginas\ncon vídeos de YouTube integrados.\n\n **Caducidad** : 180 días **Tipo** : HTTP\n\nVISITOR_PRIVACY_METADATAPendiente\n\n **Caducidad** : 180 días **Tipo** : HTTP\n\nYSCRegistra una identificación única para mantener estadísticas de qué vídeos\nde YouTube ha visto el usuario.\n\n **Caducidad** : Session **Tipo** : HTTP\n\nyt-remote-cast-availableRegistra las preferencias del reproductor de vídeo del\nusuario al ver vídeos incrustados de YouTube\n\n **Caducidad** : Session **Tipo** : HTML\n\nyt-remote-cast-installedRegistra las preferencias del reproductor de vídeo del\nusuario al ver vídeos incrustados de YouTube\n\n **Caducidad** : Session **Tipo** : HTML\n\nyt-remote-connected-devicesRegistra las preferencias del reproductor de vídeo\ndel usuario al ver vídeos incrustados de YouTube\n\n **Caducidad** : Persistent **Tipo** : HTML\n\nyt-remote-device-idRegistra las preferencias del reproductor de vídeo del\nusuario al ver vídeos incrustados de YouTube\n\n **Caducidad** : Persistent **Tipo** : HTML\n\nyt-remote-fast-check-periodRegistra las preferencias del reproductor de vídeo\ndel usuario al ver vídeos incrustados de YouTube\n\n **Caducidad** : Session **Tipo** : HTML\n\nyt-remote-session-appRegistra las preferencias del reproductor de vídeo del\nusuario al ver vídeos incrustados de YouTube\n\n **Caducidad** : Session **Tipo** : HTML\n\nyt-remote-session-nameRegistra las preferencias del reproductor de vídeo del\nusuario al ver vídeos incrustados de YouTube\n\n **Caducidad** : Session **Tipo** : HTML\n\n    * veridas.com  \nyoutube.com  \n\n2\n\nytidb::LAST_RESULT_ENTRY_KEY [x2]Se usa para rastrear la interacción del\nusuario con el contenido integrado.\n\n**Caducidad** : Persistent **Tipo** : HTML\n\n  * No clasificados 4\n\nLas cookies no clasificadas son cookies para las que todavía estamos en\nproceso de clasificar, junto con los proveedores de cookies individuales.\n\n    * veridas.com\n\n4\n\nApbyPIxcemnBGtVPendiente\n\n **Caducidad** : 1 día **Tipo** : HTTP\n\njitovqXpGBnhJPendiente\n\n **Caducidad** : 1 día **Tipo** : HTTP\n\nVtsQNvYPendiente\n\n **Caducidad** : 1 día **Tipo** : HTTP\n\nwgDSTvbFPendiente\n\n **Caducidad** : 1 día **Tipo** : HTTP\n\nConsentimiento entre dominios[#BULK_CONSENT_DOMAINS_COUNT#]\n[#BULK_CONSENT_TITLE#]\n\nLista de dominios a los que se aplica tu consentimiento:\n[#BULK_CONSENT_DOMAINS#]\n\nDeclaración de cookies actualizada por última vez el 10/21/23 por Cookiebot\n\n## [#IABV2_TITLE#]\n\n[#IABV2_BODY_INTRO#]\n\n[#IABV2_BODY_LEGITIMATE_INTEREST_INTRO#]\n\n[#IABV2_BODY_PREFERENCE_INTRO#]\n\n[#IABV2_LABEL_PURPOSES#]\n\n[#IABV2_BODY_PURPOSES_INTRO#]\n\n[#IABV2_BODY_PURPOSES#]\n\n[#IABV2_LABEL_FEATURES#]\n\n[#IABV2_BODY_FEATURES_INTRO#]\n\n[#IABV2_BODY_FEATURES#]\n\n[#IABV2_LABEL_PARTNERS#]\n\n[#IABV2_BODY_PARTNERS_INTRO#]\n\n[#IABV2_BODY_PARTNERS#]\n\nLas cookies son pequeños archivos de texto que las páginas web pueden utilizar\npara hacer más eficiente la experiencia del usuario.  \n  \nLa ley afirma que podemos almacenar cookies en su dispositivo si son\nestrictamente necesarias para el funcionamiento de esta página. Para todos los\ndemás tipos de cookies necesitamos su permiso.  \n  \nEsta página utiliza tipos diferentes de cookies. Algunas cookies son colocadas\npor servicios de terceros que aparecen en nuestras páginas.\n\nNo vender ni compartir mi información personal\n\nDenegar Permitir la selección Personalizar\n\nPermitir todas\n\nPowered by Cookiebot by Usercentrics\n\nSkip to content\n\n  * Solutions \n\n  * Industries \n\n  * Use Cases \n\n  * Pricing \n\n  * Resources \n\n  * About \n\n/Verify\n\n  * Identity Verification Platform\n  * Age Verification\n\n/Authenticate\n\n  * Facial Access Control\n  * Face Biometric Authentication\n  * Voice Biometric Authentication\n\n  * Financial Services\n  * Insurance\n  * Telcos & Utilities\n  * iGaming\n  * Casinos & Betting Shops\n  * Stadiums & Events\n  * Sport Clubs & Fitness Centers\n  * Public Security\n\n/Identity Verification\n\n  * Customer Onboarding\n  * ID Document Verification\n\n/Face Authentication\n\n  * Physical Access Control\n  * Time & Attendance\n  * Visitor Management System\n\n/Voice authentication\n\n  * Contact Center Authentication\n\n/Insights\n\n  * Success Stories\n  * Blog\n  * Multimedia\n  * Academy\n  * Newsroom\n\n/Compliance\n\n  * Data Protection\n  * Regulations & Certifications\n\n/Developers\n\n  * Product Documentation Hub\n  * APIs\n  * SDKs\n\n  * About us\n  * Careers\n  * Partners\n  * Events\n  * Contact\n\nTry a demo\n\n  * English\n    * Español\n\nHome / Resources / **APIs**\n\n# Identity verification and document verification APIs\n\nWe develop Artificial Intelligence APIs for digital identity verification 100%\nproprietary and available in the cloud.\n\nProduct documentation hub\n\n# Best in-house Identity Verification  \nand User Authentication APIs\n\n## Vali-das\n\n### Orchestrating ID verification API\n\nValidas is a REST API that manages the requests made to the other APIs that\nmake up the onboarding process. It is also responsible for retrieving all the\nresults and data that these microservices generate and making them available\nthrough its API, facilitating the onboarding process.\n\n**\\+ Info**\n\n## XpressID\n\n### Plug&Play Onboarding API\n\n**XpressID** is a standard identity verification service designed for quick\nand easy integration into a web environment. In addition to an onboarding\nprocess with document verification and facial biometrics + proof of life\nmatching, XpressID offers the optional video call service.\n\n**\\+ Info**\n\n## das-Face\n\n### Facial recognition API\n\n**das-Face** is a REST API that compares two facial images and gives a\nsimilarity score to determine if they are the same person. The main functions\nit can perform are verification (1:1), identification (1:N), clustering (M:N),\nand proof of life or anti-fraud.\n\n**\\+ Info**\n\n## das-Face QR\n\n### Biometric QR generation API\n\n**das-Face QR** is a service based on a patented technology that allows the\nauthentication of a person through their facial biometrics.  The biometric\nverification process is performed as a comparison between a facial image and\nan abstract representation of the person’s face stored on a biometric\ncredential.\n\n**\\+ Info**\n\n## das-Peak\n\n### Voice biometrics API\n\n**das-Peak** is a REST API that compares two pieces of audio and determines if\nthey correspond to the same person. The system only needs 3 seconds of audio\nto make the comparison, in any language and with any phrase. This biometrics\nengine has been recognized as one of the best in the world in different global\nrankings.\n\n**\\+ Info**\n\n## Access our Documentation Hub and get started with Veridas ID verification\nAPIs\n\nOur APIs are available in the cloud and allow you to build a flow that is\nuniquely tailored to your needs.\n\n **> Modular integration:** Choose your own flow and combine our facial\nrecognition and document verification APIs through a single orchestrator API.\n\n **> Plug&Play integration**: With XpressID you can integrate a complete\nonboarding flow in 2 weeks.\n\nFind out more about our biometrics APIs in the Product  Documentation Hub.\n\nProduct documentation hub\n\n## Why use an identity verification API?\n\n**Remote Identity Verification is a key process** for any company that has\n**online interactions** with its customers.\n\nIdentity Verification APIs allow you to **verify the identity of your\ncustomers online** , at any moment, with no need for human interaction.\n\nVeridas develops **100% in-house ID verification APIs** that allow for\ndocument verification, facial recognition, and voice recognition.\n\nThese biometric APIs powered by Artificial Intelligence are ranked among the\nbest in the world by the National Institute of Standards and Technology\n(NIST).\n\nTry a demo\n\n## Why choose our document verification API?\n\nOur document verification API verifies the authenticity of identity documents\nfrom a wide document coverage.\n\n **More than 30 Artificial Intelligence algorithms** are launched on a single\ndocument to **verify its authenticity**. Our engine extracts the **full OCR**\nof the document and carries out advanced document **anti-fraud measures** such\nas material authenticity, document integrity, photo replacements, or NFC chip\nreading.\n\nTry a demo\n\n/Let’s talk!\n\nTalk to our identity verification team and find out what our solutions can do\nfor you:\n\n/Certified technology\n\n## About\n\n  * About us\n  * Careers\n  * Partners\n  * Events\n  * Contact\n\n## Solutions\n\n## Verify\n\n  * Identity Verification Platform\n  * Age Verification\n\n## Authenticate\n\n  * Facial Access Control\n  * Face authentication\n  * Voice authentication\n\n## Industries\n\n  * Financial Services\n  * Insurance\n  * Telcos & Utilities\n  * iGaming\n  * Casinos & Betting Shops\n  * Stadiums & Events\n  * Sport Clubs & Fitness Centers\n  * Public Security\n\n## Use cases\n\n## Identity Verification\n\n  * Customer Onboarding\n  * ID Document Verification\n\n## Face Authentication\n\n  * Physical Access Control\n  * Time & Attendance\n  * Visitor Management System\n\n## Voice authentication\n\n  * Contact Center Authentication\n\n## Resources\n\n## Insights\n\n  * Success Stories\n  * Blog\n  * Multimedia\n  * Academy\n  * Newsroom\n\n## Compliance\n\n  * Data Protection\n  * Regulations & Certifications\n\n## Developers\n\n  * Product Documentation Hub\n  * APIs\n  * SDKs\n\n## Partners\n\nBecome part of our network and add the best verification solution on the\nmarket to your product catalog.\n\nBecome a partner\n\nMore info\n\n## Find us worlwide\n\n  * Spain\n  * United States\n  * Mexico\n  * United Kingdom\n\n## Gartner peer-insights\n\nRead reviews\n\n## Follow us\n\n© VERIDAS 2023. All rights reserved.\n\nPrivacy Policy and Legal Notice  |  Cookies Policy  |  Information Security\nPolicy  | Quality Policy | Subsidies and grants\n\nen | es\n\n  * Solutions /Verify\n    * Identity Verification Platform\n    * Age Verification\n/Authenticate\n\n    * Facial Access Control\n    * Face authentication\n    * Voice authentication\n  * Industries\n    * Financial Services\n    * Insurance\n    * Telcos & Utilities\n    * iGaming\n    * Casinos & Betting Shops\n    * Stadiums & Events\n    * Sport Clubs & Fitness Centers\n    * Public Security\n  * Use Cases\n    * /Identity Verification\n      * Customer Onboarding\n      * ID Document Verification\n    * /Face Authentication\n      * Physical Access Control\n      * Time & Attendance\n      * Visitor Management System\n    * /Voice authentication\n      * Contact Center Authentication\nPricing\n\n  * Resources /Insights\n    * Success Stories\n    * Blog\n    * Multimedia\n    * Academy\n    * Newsroom\n/Compliance\n\n    * Data Protection\n    * Regulation & Certifications\n/Developers\n\n    * Product Documentation Hub\n    * APIs\n    * SDKs\n  * About\n    * About us\n    * Careers\n    * Partners\n    * Events\n    * Contact\n\nTry a demo\n\nPopup title\n\nLorem ipsum dolor sit amet, consectetur adipiscing elit. Ut elit tellus,\nluctus nec ullamcorper mattis, pulvinar dapibus leo.\n\n"
}