{
    "summary": "\n\n  * Apple\n  *     * Store\n\n    * Mac\n\n    * iPad\n\n    * iPhone\n\n    * Watch\n\n    * AirPods\n\n    * TV & Home\n\n    * Entertainment\n\n    * Accessories\n\n    * Support\n\n  *   * 0+\n\n\n\nMac App Store Preview\n\nThis app is available only on the App Store for iPhone, iPad, Mac, and Apple\nWatch.\n\n#  Strides: Goal & Habit Tracker  4+\n\n##  Daily Checklist & Life Planner\n\n##  Goals LLC\n\n  *     * 4.8 • 349 Ratings\n\n  *     * Free\n    * Offers In-App Purchases\n\n## Screenshots\n\n  * Mac \n  * iPhone \n  * iPad \n  * Apple Watch \n\n  *   *   * \n\n## Description\n\nImagine having all of your most important habits, routines and goals together\nin one simple to do list. Now you can! With Strides, you can track good or bad\nhabits, SMART goals, and more. Keep up with reminders to hold you accountable\nand charts to keep you motivated. Explore new ways to manage your life with\nover 150 templates and the ability to create your own trackers.\n\n  \n\nGet organized with a daily checklist to help create your perfect routine. Keep\nup with what you’ve accomplished with progress reports that compile your\ngoals, projects and progress all in one place. Set up reminders and add notes\nto ensure you’re on track and on task.\n\n  \n\nTrack anything you want with four types of trackers. Streak calendars let you\nkeep up with your success rate, and milestone calendars help you to keep up\nwith project timelines. Want to keep track of a repeating number? Check out\nthe Average tracker. Looking to hit a goal by a specific date? Give the Target\ntracker a try.\n\n  \n\nStart keeping track of your habits and goals anywhere you go. Download today\nto get organized and create the perfect routine with Strides.\n\n  \n\nTRACKERS:\n\n\\- 150+ templates to choose from, or create your own customized tracker\n\n\\- Progress Reports with everything in one place\n\n\\- View charts with history, streak, success rate and more\n\n\\- Unlimited reminders to set yourself up for success\n\n  \n\nADDITIONAL FEATURES:\n\n\\- Integration with Apple Health\n\n\\- Sync between iPhone, iPad & Mac\n\n\\- Add notes to logs and trackers\n\n\\- Reminders to keep you on track\n\n  \n\nSEE WHAT OTHERS ARE SAYING:\n\n\"I just wanted to say a big THANK YOU! Strides is one of the most useful apps\nout there. Nowadays, I can't even imagine myself without it :)” ~Leyla\n\n  \n\n\"Amazing app. The sheer amount of flexibility with what you can track with\nStrides is amazing.\" ~Carlo\n\n  \n\n\"My life has become so much more organized and fulfilled since I started using\nyour app. I really appreciate it!” ~Micah\n\n  \n\n\"Best tracking app. I love, love, love this app! This is exactly what I've\nbeen looking for for two or three years. I can track multiple goals and see\nthem all on one screen. Perfect!\" ~Kate\n\n–\n\nStrides is free forever to track what's most important to you. If you want to\nget even more out of it and support development, you can upgrade to Strides\nPlus to unlock consistently updating features, including Unlimited Trackers,\nSync, Backup, Tags & Filters, Today List, Export Data and more.\n\n  \n\nStrides Plus is an auto-renewing monthly subscription for $4.99/month, or an\nauto-renewing yearly subscription at $29.99/year, for unlimited goal and habit\ntrackers and other premium features like progress reports while you maintain\nan active subscription. Strides also offers a lifetime subscription for $79.99\nwhich is paid for by a one-time upfront payment with unlimited access to all\npremium features forever.\n\n  \n\nPayment will be charged to the credit card connected to your iTunes Account\nwhen you confirm the initial subscription purchase. Subscriptions\nautomatically renew unless auto-renew is turned off at least 24-hours before\nthe end of the current subscription period. Your account will be charged for\nrenewal within 24-hours prior to the end of the current period, and the cost\nof the renewal will be identified. You may manage your subscription and auto-\nrenewal may be turned off by going to your Account Settings after the\npurchase. Any unused portion of a free trial period, if offered, will be\nforfeited when you purchase a subscription, where applicable.\n\n–\n\nRead our full Privacy Policy / Terms of Use:\n\nhttps://www.stridesapp.com/privacy.html\n\nhttps://www.apple.com/legal/internet-services/itunes/dev/stdeula/\n\n  \n\nKeep making strides!\n\nmore\n\n## What’s New\n\nVersion History\n\nJan 22, 2024\n\nVersion 16.0\n\nNew: Milestone subtasks and notes! Now you can break down your big project\ngoal into milestones, then divide a milestone into small steps with the new\nMilestone Checklist feature. You can also add notes to individual milestones\nand automatically sort them however you like to keep your projects neat and\norganized.\n\n  \n\nSome of you have asked for the option to log your progress with more precision\nthan 5% increments, like 33% or 67%. Now you can tap the current percentage\nand type any number you want.\n\n  \n\nOh, and any number that you're editing throughout the app is now highlighted\nso you don't have to delete the old one then type the new one.\n\n  \n\nWe also added a hide keyboard button to keep the screen clutter-free when\nreading long notes.\n\n  \n\nLots of little improvements and fixes in this one too. Hope you're having a\ngreat start to 2024!\n\nmore\n\n##  Ratings and Reviews\n\nSee All\n\n4.8 out of 5\n\n349 Ratings\n\n349 Ratings\n\nxray98  ,  01/02/2018\n\n###  A seriously powerful app\n\n> I started using this app only 5 days ago, but it’s already making huge\n> differences in my life. I feel that, because of this app, I can really start\n> achieving the goals I’ve been wanting to achieve. This might sound gross,\n> but I’ve always struggled to make sure to brush and floss my teeth twice a\n> day. Since using this app, I haven’t missed it once. I’ve started getting\n> back into reading by setting a daily goal of reading an hour a day. I’ve\n> made sure to be working out at least 5 days a week because of this app. I’ve\n> started journaling at the end of each day because of this app. I’ve set\n> weight goals for myself that I’m tracking, and it even gives a projection\n> for my weight by my goal date based on how much progress I’m making so far.\n>\n>  \n>\n>\n> The app is basically just a daily to-do list, and that may sound super\n> simple, but it’s so powerful. I feel accomplished completing my goals each\n> day, and the app encourages me to stick with it and achieve more. Thanks to\n> Strides, I’m able to form the habits I’ve been wanting to form, and break my\n> goals up into pieces each day, which makes them much easier to achieve. I\n> really just want to say thank you to the developers for helping me better\n> myself and better my life. I highly recommend this for anyone looking to do\n> the same.\n>\n> more\n\nGreenkg24  ,  02/02/2020\n\n###  Awesome habit/goal tracker.. one issue\n\n> Love the apps functions, UI/UX. It has been pivotal in tracking my progress\n> and staying on top of my goals. My only issue and something I think should\n> be changed is the tagging and archive features. I love the tagging feature\n> to organize my goals.. BUT I track daily goals tagged by their month/year\n> and I also track my annual goals tagged as annual/year. BUT in my due today\n> tab the daily goals that have a goal date that is in the past they still\n> appear in the due today tab. First problem, the due today tab should only\n> show you the items that are within the set period of time for the specific\n> goal. For example, I have a goal that is a target number to hit for the\n> period of January 1 -31. On February 1, that same goal was still showing up\n> as due today.\n>\n>  \n>\n>\n> Second issue, to try to fix the first issue I decided to archive the goals\n> that have “expired”, which seems to alleviate this because they no longer\n> appear in my due today tab. BUT when I click the drop down to sort by tags,\n> my January 2020 tag is now empty because I archived those goals. So, it\n> should be possible to archive any and all goals but still be able to sort by\n> their other tags.\n>\n>  \n>\n>\n> Would love to see a solution to this issue, whether it’s the one I described\n> or another one. Thanks! Still absolutely love the app, just a few minor\n> suggestions for optimization.\n>\n> more\n\n###  Developer Response  ,\n\n> Thanks for reaching out! I'm really glad to hear you're enjoying Strides,\n> and I appreciate the feedback. I’d be happy to help with tagging and\n> archiving. Please reach out through the Feedback view in the app so I can\n> help out.\n>\n>  \n>\n>\n> Best of luck with all your goals & habits!\n>\n> Kyle Richey\n>\n> Strides CEO\n>\n> more\n\nKarrots125  ,  12/01/2017\n\n###  Sleek, Simple Strides\n\n> So I downloaded several different apps of this type of goal-tracker app. I\n> was able to quickly narrow it down to this and one other by virtue of how\n> easy it is to add custom goals and track them. Over the coarse of a month\n> this one has become by far my favorite. It allows me to customize what, how\n> many, how often,and track with an easy swipe left or right. It gives me\n> reminders but doesn't annoy me. I can easily go back to log days I've done\n> (or not) but haven't logged and I can see at a glance whether I'm improving\n> the frequency of my goals. This has quickly become one of my most frequently\n> used apps! Highly recommend for all ages of goal-setters and (hopefully)\n> accompish-ers!\n>\n> Update: I’ve been using this for about six months now and still think this\n> is by far the best goal-tracker app. I love the personalized goals and being\n> able to look back over the months and see how I’m improving long-term. I’m\n> slowly adding goals and know this app is what is keeping me focused!\n>\n> more\n\n##  Events\n\n###  NOW AVAILABLE\n\nMAJOR UPDATE\n\nBig Goal Small Steps\n\n##  App Privacy\n\nSee Details\n\nThe developer, Goals LLC, indicated that the app’s privacy practices may\ninclude handling of data as described below. For more information, see the\ndeveloper’s privacy policy.\n\n### Data Not Linked to You\n\nThe following data may be collected but it is not linked to your identity:\n\n  * Purchases\n  * Usage Data\n  * Diagnostics\n\nPrivacy practices may vary, for example, based on the features you use or your\nage. Learn More\n\n## Information\n\nSeller\n\n     Goals LLC \n\nSize\n\n    20.9 MB\n\nCategory\n\n     Productivity \n\nCompatibility\n\n    \n\niPhone\n\n    Requires iOS 16.0 or later. \n\niPad\n\n    Requires iPadOS 16.0 or later. \n\nMac\n\n    Requires macOS 13.0 or later. \n\nLanguages\n\n    \n\nEnglish, French, German, Japanese, Korean, Portuguese, Russian, Simplified\nChinese, Spanish, Traditional Chinese\n\nmore\n\nAge Rating\n\n     4+ \n\nCopyright\n\n    © 2024 StridesApp.com\n\nPrice\n\n    Free\n\nIn-App Purchases\n\n    \n\n  1. Strides Plus $4.99\n  2. Strides Plus $29.99\n  3. Strides Plus $39.99\nmore\n\n  * Developer Website \n  * App Support \n  * Privacy Policy \n\n  * Developer Website \n  * App Support \n  * Privacy Policy \n\n## Supports\n\n  * ###  Family Sharing \n\n####\n\nSome in‑app purchases, including subscriptions, may be shareable with your\nfamily group when Family Sharing is enabled. Learn More\n\nmore\n\n##  More By This Developer\n\nSummit: Daily Planner\n\nProductivity\n\n##  You Might Also Like\n\nSee All\n\nGoal Setting Tracker Planner\n\nProductivity\n\nHabitify - Habit Tracker\n\nProductivity\n\nWay of Life - Habit Tracker\n\nProductivity\n\neveryday - Habit Tracker\n\nProductivity\n\nTally: The Anything Tracker\n\nProductivity\n\nHabit — Daily Tracker\n\nProductivity\n\nMore ways to shop: Find an Apple Store or other retailer near you. Or call\n1-800-MY-APPLE.\n\nChoose your country or region\n\nCopyright © 2023 Apple Inc. All rights reserved.\n\n  * Privacy Policy\n  * Terms of Use\n  * Sales and Refunds\n  * Legal\n  * Site Map\n\n",
    "links": "[{\"link\": \"https://apps.apple.com/us/app/strides-goal-habit-tracker/id672401817?platform=mac\", \"text\": \"\\n                  Mac\\n                \"}, {\"link\": \"https://apps.apple.com/us/app/strides-goal-habit-tracker/id672401817?platform=iphone\", \"text\": \"\\n                  iPhone\\n                \"}, {\"link\": \"https://apps.apple.com/us/app/strides-goal-habit-tracker/id672401817?platform=ipad\", \"text\": \"\\n                  iPad\\n                \"}, {\"link\": \"https://apps.apple.com/us/app/strides-goal-habit-tracker/id672401817?platform=appleWatch\", \"text\": \"\\n                  Apple Watch\\n                \"}, {\"link\": \"https://apps.apple.com/us/app/strides-goal-habit-tracker/id672401817?see-all=reviews\", \"text\": \"\\n     See All\\n   \"}, {\"link\": \"https://apps.apple.com/us/app/strides-goal-habit-tracker/id672401817?eventid=6475483766\", \"text\": \"\"}, {\"link\": \"https://apps.apple.com/us/story/id1542695115\", \"text\": \"Learn More\"}, {\"link\": \"https://apps.apple.com/us/app/strides-goal-habit-tracker/id672401817?see-all=customers-also-bought-apps\", \"text\": \"\\n     See All\\n   \"}]",
    "priceAndPlans": "  * Global Nav Open Menu Global Nav Close Menu\n  * Apple\n  * Shopping Bag +\n\nSearch apple.com\n\nCancel\n\n  * Apple\n  * Store\n  * Mac\n  * iPad\n  * iPhone\n  * Watch\n  * AirPods\n  * TV & Home\n  * Only on Apple\n  * Accessories\n  * Support\n  *   * Shopping Bag +\n\nCancel\n\nThe Wayback Machine -\nhttp://web.archive.org/web/20220821191444/https://apps.apple.com/\n\nConnecting...\n\nMore ways to shop: Find an Apple Store or other retailer near you. Or call\n1-800-MY-APPLE.\n\nChoose your country or region\n\nCopyright © 2022 Apple Inc. All rights reserved.\n\nPrivacy Policy Terms of Use Sales and Refunds Legal Site Map\n\n"
}