{
    "summary": "Visit our InstagramVisit our TwitterVisit our LinkedIn\n\n  * About\n\n  * Newsletters\n\n  * TV & Film\n\nSelf-Improvement, Business\n\n# 14 Best Goal-Setting Apps for Tracking & Achieving Goals\n\nMay 07, 2020    Evan Tarver\n\nTable of Contents\n\nStrides: Habit Tracker & Project Management Who Should Use Strides Coach.Me:\nApp With Community & Coaching Habitica: Goal-Setting Gamification Productive:\nDaily Habit Tracker Way of Life: Daily Goal-Setting Accountability Stickk: App\nUsing Negative Incentives ATracker: Time-Based Habit Management GoalsOnTrack:\nProfessional & Business Goals Streaks: Fitness-Focused Goals Habit-Bull: App\nFocused on Daily Motivation Toodledo: Team-Focused Goal-Setting Lifetick: App\nFocused on Core Values Fabulous: Step-by-Step Achievement Plans Habitify:\nData-Driven Decision-Making Conclusion: Best Goal-Setting App\n\nEveryone wants to achieve goals, however, few are actually able to do it. One\nway to make goal achievement easier is to use a goal-setting app that helps\nyou set, track, and make progress towards your goals. Below we discuss the\nbest goal-setting apps that can aid you in achieving important goals.\n\nHere are the top 14 goal-setting apps and what they're best for:\n\n  * Strides: Habit tracker and personal project management tool\n  * Coach.Me: App with personalized community and coaching\n  * Habitica: Gamifies the goal-setting & achieving process\n  * Productive: Daily habit tracker for small repeatable habits\n  * Way of Life: Builds habits through daily accountability\n  * Stickk: Goal-setting app using negative incentives\n  * ATracker: Time-based habit management app\n  * GoalsOnTrack: App for professional & business goals\n  * Streaks: App for fitness-focused goals\n  * Habit-Bull: Goal-setting app with daily motivation\n  * Toodledo: Team-focused goal-setting app\n  * Lifetick: Builds habits based on defined core values\n  * Fabulous: App with step-by-step achievement plans\n  * Habitify: App that helps make data-driven decisions\n\n## Strides: Habit Tracker & Project Management\n\nWhat It’s Used For: All-in-one habit tracker and project management tool  \nPrice: Free up to three goals, $5/month for unlimited goals.\n\nThe Strides app tracker goes beyond other options as it helps you to kick bad\nhabits and embed good ones by setting personal SMART goals and managing the\nrelated projects. Available on iOS and web, Strides uses four different\ntracking methods to help you achieve your goals. The free version tracks up to\nthree habits or goals, while Strides Plus, which costs $5/month, allows\nunlimited goals. Data can be synced between devices.\n\n### Strides Features\n\n  * Habit/Goal Categories: Health, finance, hobbies, business, relationships, or you can create a custom category.\n  * Project Management: Create larger project goals using a variety of templates to set up your project, view metrics, and analyze project data.\n  * Goal-Tracking Options: Offers four customizable trackers, including Target, Average, Habit and Milestones.\n  * Additional Offerings: Strides includes a free 7-day email course promoting productivity through goal setting and habit creation.\n\n## Who Should Use Strides\n\nStrides is an effective productivity tool and one of the best goal-setting\napps for those who want an all-in-one habit tracker and project management\ntool. Its clean template and four customizable trackers help you to visually\nmonitor progress to improve discipline and accountability. Check out Strides'\nwebsite for more information.\n\n## Coach.Me: App With Community & Coaching\n\nWhat It’s Used For: Kicking bad habits and building good ones with live,\npersonalized coaching and support  \nPrice: Free to track unlimited goals with personal coaching for $20/week,\nleadership coaching for $249/month\n\nThe Coach.Me goal tracker offers a clean interface to track unlimited habits\nfor free. Available on iOS, Android, and web, users can select from a variety\nof habits under pre-selected categories or create their own goals. Once a goal\nis selected, you join a community of users with the same goal to help you\nachieve or kick the habit. For those who want extra guidance, Coach.me offers\nweekly habit coaching for $20/week and up and leadership coaching for\n$249/month.\n\n### Coach.Me Features\n\n  * Habit/Goal Categories: Themes include nutrition, sleep, learning, or fitness, and custom themes can also be created.\n  * Online Community: Become part of an online community related to your goal or habit category and use the chat function to get accountability and advice.\n  * Free Habit-Forming Advice: App offers additional advice to its users through things like the Medium platform.\n  * Premium Coaching: Coach.Me offers three levels of coaching: weekly group coaching, daily private coaching, or executive coaching for $20-$249.\n\n### Who Should Use Coach.me\n\nCoach.me is most effective for goal-setters who need personalized support to\nset or change their habits or behavior. While not as attractive or\ncustomizable as others, Coach.me’s clean, simple interface gets the job done\nfor free. The program’s large community of subscribers and menu of paid\ncoaching options also sets it apart. Check out their website for more details.\n\n## Habitica: Goal-Setting Gamification\n\nWhat It’s Used For: Goal-setting gamification through virtual avatars that\nshow the positive and negative effects of your actions  \nPrice: Free for basic app and multiple-user options for $9/month plus $3/user\n\nHabitica is a gamified version of a goal-setting app. Users set up an avatar\nthat earns rewards or punishments based on meeting or missing goals and\nhabits. Available on iOS, Android, and web, Habitica also offers extensions to\ndifferent third party sites like Chrome to support you in your goal. The basic\napp is free, with group plans for households, teams, or schools available for\n$9/month plus $3/user.\n\n### Habitica Features\n\n  * Gamification: Experience and gold is given to avatars for completing good habits or avoiding bad ones. If a user fails to avoid a bad habit, their avatar loses health. As a user conquers their tasks, they progress in the game, earning better weapons and tools.\n  * Single Player or Multiplayer Options: The gamification can be played as a solo adventure or together as a group where you work together as a team and hold each other accountable.\n\n### Who Should Use Habitica\n\nHabitica is great for those who enjoy games and competitions. By gamifying\ngood habits and virtually punishing bad habits, users quickly see the effects\nof their actions. The collaborative mode takes it a step further and adds\nadditional accountability and partnership. Check out Habitica’s website for\nmore information.\n\n## Productive: Daily Habit Tracker\n\nWhat It’s Used For: Helps users build positive habits and routines into their\nday-to-day  \nPrice: Free for 5 habits with unlimited habit tracking for $6.99 a month to\n$29.99 annually\n\nProductive is a useful app for those who want to add positive routine and\nstructure to their day-to-day. Both the free and premium version, available\nonly on iOS, allow you to choose from a list of daily habits or customize your\nown. The free version is limited to five habits while the subscription-based\npremium version allows an unlimited number of habits for $6.99 a month, $11.99\nfor three months, or $29.99 annually.\n\n### Productive Features\n\n  * Habit/Goal Categories: Habits can be chosen from pre-engineered categories such as Morning Routine, Getting Stuff Done, Staying Fit, and Personal Finance, among others. Users can also create their own.\n  * Daily Habit Tracking: Habit-tracking can be customized to time of day, frequency, and length of habit. Reminders can be time-based or location-based.\n  * Don't Break the Chain Approach: The app displays your personal Life Log, which shows which days you have completed all, some or none of your tasks, encouraging you to build a streak of perfect days and further build your daily routine.\n\n### Who Should Use Productive\n\nProductive is best for iPhone users who want to build positive habits and\nroutines into their daily life. Productive’s colorful, customizable interface\nis great for those who are motivated by visual reminders and personal bests.\nTo learn more, check out their website for details.\n\n## Way of Life: Daily Goal-Setting Accountability\n\nWhat It’s Used For: Building daily accountability without spending excessive\ntime on your phone  \nPrice: Free to track three goals or habits, with unlimited tracking for\n$3.99/month\n\nWay of Life is built around brief daily interactions to assess progress\ntowards your goals as well as to understand how to improve your habits. The\nfree version allows you to choose up to three habits or goals that you want to\ntrack, while the premium version includes unlimited habits and costs\n$3.99/month.\n\n### Way of Life Features\n\n  * **Daily Accountability:  **The app is simple and sends s simple daily notification asking whether you have completed your good habits or avoided your bad habits that day.\n  * **Daily Journal:**  Also included with the daily accountability is a journal space that can be completed to log your actions.\n  * **Clean Interface:**  The app's interface incorporates custom reminders and widgets while organizing data so you can see trends over time to better gauge progress.\n\n### Who Should Use Way of Life\n\nWay of Life is a great solution for those who want daily accountability\ntowards reaching their goals or achieving a habit without spending too much\ntime on their phone. Data visualization through pie, bar and line charts and\njournal entries help motivate users and pinpoint areas for improvement. Check\nout their website for more information.\n\n## Stickk: App Using Negative Incentives\n\nWhat It’s Used For: Building habits through negative incentives rather than\npositive incentives (aka the “stick” rather than the “carrot”)  \nPrice: Free with option to deposit money for further accountability\n\nFounded by Yale professors, Stickk describes itself as a commitment platform\nrather than a goal-setting app. Stickk has users decide on a single goal, sign\ncommitments to themselves, and then put money or similar type of\naccountability on the line to ensure they achieve their goal. Available for\nfree on the web, iOS or Android, Stickk focuses on loss aversion to help users\ncommit to behavior change.\n\n### Stickk Features\n\n  * Use of Negative Incentives: Users define their commitment with a preset goal and put money on the line. Funds are then put in escrow. Every time the user fails to meet their progress goals, the money is donated to a chosen anti-charity, random charity, or designated friend.\n  * Commitment Journal: Option to share progress, take notes, and update supporters and a referee, if you chose one.\n  * Group Wagers: Groups can also collaborate to tackle a similar goal, such as weight loss, and make a community wager.\n\n### Who Should Use Stickk\n\nStickk is best for those who are motivated by strong convictions and would\nfind it difficult to sway from those. By using loss aversion and negative\nconsequences to encourage positive behavior, Stickk literally uses the stick\nmethod to help you achieve your goals. Check out their website for more\ninformation.\n\n## ATracker: Time-Based Habit Management\n\nWhat It’s Used For: Building good habits through better time management  \nPrice: Free basic app with ad-free ATracker Pro between $2.99 and $4.99, as\nwell as web-syncable Premium version for $2.99/month\n\nIf you’re looking to manage your time more productively, ATracker is one of\nthe best goal-setting apps on our list. The basic ATracker app, free for iOS\nor Android, allows you to track and categorize time spent. ATracker Pro, with\na one time cost of $2.99 for Android and $4.99 for iOS, provides ad-free\naccess to unlimited task management, data export, and support for multiple\ndevices including Apple Watch. ATracker Premium, for $2.99/month also syncs to\nthe web.\n\n### ATracker Features\n\n  * Time-Tracking Functionality: Start and stop tracking an activity with a single click. Specified times and durations can be set to ensure adequate time is being spent on desired activities. For example, you may want to run a specific number of hours per week.\n  * Calendar View: Activities and goals can be viewed in a list or calendar form for you to analyze. Pie and bar chart reports can be reviewed and shared with others.\n\n### Who Should Use ATracker\n\nATracker is best for independent professionals and those trying to better\nunderstand and manage their daily time and productivity. Target tasks,\nreminders and duration settings will ensure that you are spending adequate\ntime on desired tasks while data reports can help you find or reallocate time\nso you can work on achieving your goals. For more information, check out their\nwebsite.\n\n## GoalsOnTrack: Professional & Business Goals\n\nWhat It’s Used For: Achieving professional goals through customized goal\ntemplates and action plans  \nPrice: $68 annually for unlimited access to the web and mobile applications\n\nGoalsOnTrack describes itself as the “goal setting and goal management\nsoftware for high achievers”. Membership costs $68 annually and includes\nunlimited access to the web and mobile applications. The software’s dashboard\nhelps you create SMART goals through the use of templates, and track manually\nor by subgoals, tasks, and outcomes.\n\n### GoalsOnTrack Features\n\n  * Custom Professional Dashboard: Custom dashboard helps you set major goals, tasks and habits, including custom or preset goals such as starting your own business or creating a passive income stream.\n  * Professional Templates & Tools: Templates include multi-level goals with action plans. Integrated tools such as a time tracker, task manager, habit tracker, calendar, vision board and journal work together to support you in achieving your goals while the Goal Review reports help you assess progress.\n\n### Who Should Use GoalsOnTrack\n\nGoalsOnTrack high price point and detailed templates will appeal to\nprofessionals and business owners who want to achieve financial and career\ngoals. Their SMART goal strategy and preset action plans build a framework\nthat works best for achieving “Mount Everest” goals, such as starting a\nbusiness, creating passive income streams or writing a book. Check out their\nwebsite for more information.\n\n## Streaks: Fitness-Focused Goals\n\nWhat It’s Used For: Building fitness-focused habits with support from iOS\nHealth app and Apple Watch  \nPrice: Track up to twelve habits for better health and well-being for $4.99\n\nStreaks is a paid iOS app that helps you focus on achieving health-related\ngoals. Costing $4.99 to download, Streaks allows you to select up to twelve\nactions to focus on in order to create a habit and integrates with Apple Watch\nas well as the iOS Health app, especially useful for tracking habits related\nto your personal health.\n\n### Streaks Features\n\n  * Health & Wellness Goals: Integration with the iOS Health app and Apple Watch means fitness and health goals are automatically tracked. The goal is to create a health-related streak and avoid breaking it or it resets to zero.\n\n### Who Should Use Streaks\n\nStreaks colorful and easy to navigate interface is best for fitness-related\ngoals and habits. Integration with the iOS Health app and Apple Watch and\ncustomizable widgets keeps users engaged in building good habits and avoiding\nbad ones, to help them achieve optimal wellness. For more information, check\nout their website.\n\n## Habit-Bull: App Focused on Daily Motivation\n\nWhat It’s Used For: Helping beginners build good habits through a simple\ninterface and the use of motivation  \nPrice: Free version tracks 5 goals while Premium version between $4.99/monthly\nto $19.99/annually tracks up to 100 habits\n\nHabit-Bull is a goal-setting app and productivity tool for iOS and Android\nusers. Habit-Bull helps you break bad habits and reinforce good ones through a\nfocus on motivation. Similar to Streaks and Productive, this app adheres to\nthe, \"don’t break the chain” philosophy. The free version allows tracking of\nfive goals while the Premium version for $4.99/monthly, or $19.99/annually,\noffers tracking of 100 habits, cloud backup and sync, widgets, and data export\ncapability.\n\n### Habit-Bull Features\n\n  * Motivational Focus: Motivational phrases and support help you get advice and push through obstacles, while a thoughtful graphic interface inspires you not to break the chain.\n  * Clean Interface & Design: HabitBull’s clean interface allows you to set a positive or negative habit, with reminders and a streaks calendar.\n\n### Who Should Use HabitBull\n\nHabit-Bull’s user-friendly interface is best-suited for beginners who want to\ncreate positive or eliminate negative habits. Simple to set up and visually\nappealing, Habit-Bull’s motivational quotes and positive community will\nsupport you in achieving your goals. Check out their website for more\ninformation.\n\n## Toodledo: Team-Focused Goal-Setting\n\nWhat It’s Used For: Setting team goals and managing associated team projects  \nPrice: Four options including a free version as well as pricing from\n$2.99/month to $4.99/month, with a custom-priced business option\n\nToodledo calls itself a flexible, multi-functional productivity tool with\nrobust collaboration features. Based on the ‘Getting Things Done’ philosophy,\nToodledo systematically organizes your personal, professional, and household\ntasks to optimize productivity. In addition to a free option, Toodledo has\nfour subscription options including Standard for $2.99/month, Plus for\n$4.99/month, and a custom-priced Business option.\n\n### Toodledo Features\n\n  * Team-Focused Goals: Toodledo’s goal-setting tools support project management by sharing and assigning tasks. The Workspaces feature permits other users to access pre-approved to-do lists, files, and tasks, for better team engagement.\n  * Prioritized Task List & Scheduler: Toodledo’s hotlist automatically prioritizes a list of tasks based on due date or user priority. If there is free time in the calendar, the scheduler will generate tasks based on due-dates, priorities, and time estimates so you can better complete projects within a team setting.\n  * Customization Options: Toodledo allows users to customize their settings to the level of detail they find useful. Users can set goals, schedule tasks and subtasks, put in reminders and alarms, and generate statistics to gauge progress.\n\n### Who Should Use Toodledo\n\nToodledo is best for professional users seeking a combined goal setting and\nproject management tool. The free version, available only for individuals, is\nless useful than some of our other options, given the limit on habits, tasks,\nand data storage of only two weeks, making it less useful. If you’re looking\nto set team goals, check out their website.\n\n## Lifetick: App Focused on Core Values\n\nWhat It’s Used For: Building good habits by understanding core values and the\n‘why’ behind your actions  \nPrice: Free individual version for up to four goals or unlimited goals for\n$5/month; team version costs $10/month and up\n\nUnlike the other apps on our list, Lifetick takes a philosophical approach to\ngoal-setting before arming you with the tools to achieve them. Lifetick asks\nyou to start with your core values and understand why they matter before you\ncommit to a series of tasks. LifeTick, integrated via web, iOS, and Android,\nhas a free individual version for up to four goals or unlimited goals for\n$5/month. Team memberships for organizations run $10/month and up.\n\n### Lifetick Features\n\n  * Value-Based Goal-Setting: users select up to 10 core values, which may include health, family, education, lifestyle, friends, spirituality, finance, and career or a custom selection. They then set SMART goals, linking to a specific core value, writing down why it matters, and marking the magnitude and priority of low-to-high.\n  * Reminders & Reports: The free individual version also includes email reminders, a journal of achievements, and goal and task reports. The paid version for individuals also includes multi-task checklists, the ability to customize trackers and tracker reports.\n  * Multi-User Collaboration: Users can set shared goals with other users, called collaborators, who then add, edit or complete tasks together. Users can also set up supporters to update them of progress and cheer them along the way.\n\n### Who Should Use Lifetick\n\nLifetick is most useful for people or groups wanting to link their goals to\ncore values as well as understand the ‘why’ behind their actions. This can\nhelp with better behavior and sustained habitual changes. Check out their\nwebsite for more information.\n\n## Fabulous: Step-by-Step Achievement Plans\n\nWhat It’s Used For: Building habits and self-discipline through a gentle,\nstep-by-step plan  \nPrice: Subscription only service costs $9.99/month or $95.99/year\n\nThe Fabulous app for iOS and Android was incubated in Duke's Behavioral\nEconomics Lab. Focused on health and wellness, the app will help reset habits,\nretrain your mind, and build self-discipline. Fabulous is a subscription-only\nservice, costing $9.99/month or $95.99/year. Fabulous takes a step-by-step\napproach to self-improvement, instilling one or two habits at a time before\nmoving on to the next one.\n\n### Fabulous Features\n\n  * Plans & Programs: Through individual journeys, such as Morning Ritual, Start an Exercise Habit, Mental Toughness, or Building Self-Discipline, the app provides a program and tools for building focus and concentration, better sleep, stress management, healthy eating, exercise, motivation and happiness.\n  * Rigid Structure: Fabulous is fairly rigid with little flexibility to customize habits and routines. That said, additional ‘live’ challenges can be joined, such as meditation or healthier eating, allowing users to discuss, share progress, and motivate others along the way.\n\n### Who Should Use Fabulous\n\nFabulous is good for those who want a gentle, step-by-step plan to improve\ntheir health and holistic well-being. The app focuses on one keystone habit at\na time, making sure it sticks before moving on. Integrated coaching for\nexercise, meditation and diet helps users to focus on specific actions and\ntriggers to improve their health. Check out their website for more\ninformation.\n\n## Habitify: Data-Driven Decision-Making\n\nWhat It’s Used For: Achieving goals with performance data and number crunching  \nPrice: Free to track 3 goals, with unlimited goals for $4.99/month, $30/year\nor $39.99 one-time payment\n\nHabitify is perfect for those who are motivated by performance data. Once\ngoals are set and habits tracked, performance analysis improves effectiveness.\nHabitify drills down on hourly and day of the week trends to help you assess\nstumbling blocks. Available on the web, iOS and Android, the free version\ntracks 3 goals while the premium version ($4.99/month, $30/year or $39.99 one-\ntime) allows unlimited goals.\n\n### Habitify Features\n\n  * Analyzer & Data-Exporter: A yearly analyzer and data export will help you dig deep into the data. The premium version also allows you to make notes, set unlimited reminders, and skip a habit if you're sick or on holiday or archive habits.\n\n### Who Should Use Habitify\n\nHabitify is great for those who enjoy assessing data to improve performance.\nHabitify’s useful charts and tables provide specific, actionable insights to\nhelp pinpoint trouble spots while unlimited reminders ensure you tick off that\nhabit until it’s second nature. Check out their website for more information.\n\n## Conclusion: Best Goal-Setting App\n\nWhatever facet of your life you are looking to progress in, goal-setting apps\nare useful tools to set and stay on target. Each tool uses a different\napproach, leveraging technology in order to reinforce good habits or dissuade\nyou from bad ones. Whether you are motivated by positive psychology, the stick\nrather than the carrot, or graphs and charts, there are a variety of tools to\nhelp you achieve goals and accelerate your growth.\n\nShare\n\nTable of Contents\n\nStrides: Habit Tracker & Project Management Who Should Use Strides Coach.Me:\nApp With Community & Coaching Habitica: Goal-Setting Gamification Productive:\nDaily Habit Tracker Way of Life: Daily Goal-Setting Accountability Stickk: App\nUsing Negative Incentives ATracker: Time-Based Habit Management GoalsOnTrack:\nProfessional & Business Goals Streaks: Fitness-Focused Goals Habit-Bull: App\nFocused on Daily Motivation Toodledo: Team-Focused Goal-Setting Lifetick: App\nFocused on Core Values Fabulous: Step-by-Step Achievement Plans Habitify:\nData-Driven Decision-Making Conclusion: Best Goal-Setting App\n\n#### Related Content\n\n  * 11 Types of Motivation: What They Are & How to Use Them\n  * What is Motivation? Principles, Theories & How it Works\n  * What Are SMART Goals? Definition, Elements & Importance\n\n### Get the Latest Newsletters Delivered to Your Inbox\n\n### Related Issues\n\nCheck out my recent newsletters on the topic\n\n  * #### 11 Types of Motivation: What They Are & How to Use Them\n\nJuly 15, 2020\n\nThere are many different types of motivation that affect specific types of\npeople. Learn which types motivate you to succeed in life as well as in\nbusiness.\n\nRead More 11 Types of Motivation: What They Are & How to Use Them Self-\nImprovement\n\n  * #### What is Motivation? Principles, Theories & How it Works\n\nMay 5, 2020\n\nWhat is motivation, exactly? In this article, you'll learn the definition of\nmotivation, its principles, theories and how it all works.\n\nRead More What is Motivation? Principles, Theories & How it Works Business\n\n  * #### What Are SMART Goals? Definition, Elements & Importance\n\nApril 29, 2020\n\nSMART goals are created using the \"SMART\" acronym, which stands for Specific,\nMeasurable, Achievable, Realistic, and Time-bound.\n\nRead More What Are SMART Goals? Definition, Elements & Importance Self-\nImprovement\n\n  * #### Arousal Theory of Motivation: Definition, Principles & Optimization\n\nApril 28, 2020\n\nThe arousal theory of motivation states that people are motivated by unique\nlevels of mental alertness. Learn how the theory works here.\n\nRead More Arousal Theory of Motivation: Definition, Principles & Optimization\nSelf-Improvement\n\n  * #### How to Achieve Goals in Any Environment\n\nApril 24, 2020\n\nGoal-achievement is hard. To help, learn how to achieve goals in any\nenvironment with these seven proven goal-achieving steps.\n\nRead More How to Achieve Goals in Any Environment Self-Improvement\n\n  * #### How to Set Goals the Right Way in 2020\n\nApril 15, 2020\n\nGoal-setting is an overlooked but important part of goal-achievement. Learn\nhow to set goals the right way in 5 proven steps with this article.\n\nRead More How to Set Goals the Right Way in 2020 Self-Improvement\n\n  * #### Best Goal-Setting Worksheet Templates For Achievement\n\nApril 9, 2020\n\nCheck out this list of the best free goal-setting worksheets to help with\nachievement. Included are free downloadable templates and alterative options.\n\nRead More Best Goal-Setting Worksheet Templates For Achievement Self-\nImprovement\n\n  * #### How to Motivate Other People to Succeed in 6 Proven Steps\n\nMarch 1, 2020\n\nMotivating other people to perform well and succeed is key in business as well\nas life. Learn how to motivate people to succeed with these 6 proven steps.\n\nRead More How to Motivate Other People to Succeed in 6 Proven Steps Self-\nImprovement\n\n  * #### Vroom's Expectancy Theory of Motivation: Definition, Principles & Uses\n\nFebruary 28, 2020\n\nThe expectancy theory of motivation says your motivation is directly tied to\nexpectations that your hard work will result in the goal you want.\n\nRead More Vroom's Expectancy Theory of Motivation: Definition, Principles &\nUses Self-Improvement\n\nPrev Next  \n\n#### About\n\nHi, my name’s Evan and I’m a writer and entrepreneur with a background in tech\nand finance. I spend my career searching for actionable information on living\nan optimal life, testing what I’ve learned and sharing what’s worked (and what\nhasn’t).\n\nVisit our InstagramVisit our TwitterVisit our LinkedIn\n\n### Location\n\nLos Angeles, CA  \nAustin, TX\n\n### Quick Links\n\nAboutNewslettersTV & Film\n\nCOPYRIGHT EVAN TARVER - 2023\n\nsearchclosechevron-upchevron-downbars linkedin facebook pinterest youtube rss\ntwitter instagram facebook-blank rss-blank linkedin-blank pinterest youtube\ntwitter instagram\n\n",
    "links": "[{\"link\": \"https://evantarver.com/\", \"text\": \"\"}, {\"link\": \"https://evantarver.com/about/\", \"text\": \"Evan Tarver\"}, {\"link\": \"https://evantarver.com/about/\", \"text\": \"About\"}, {\"link\": \"https://evantarver.com/blog/\", \"text\": \"Newsletters\"}, {\"link\": \"https://evantarver.com/tv-and-film-scripts/\", \"text\": \"TV & Film\"}]",
    "priceAndPlans": "Error: Timeout 30000ms exceeded. =========================== logs\n=========================== navigating to\n\"http://web.archive.org/web/20230930222925/https://evantarver.com/\", waiting\nuntil \"load\" ============================================================\n\n"
}