{
    "summary": "  * Solution\n    * Identity verification made easy\n    * Features\n    * Biometric login\n    * Face Capture and Matching\n    * Liveness Detection\n    * Capture and reading\n    * ID Validation\n    * AML databases\n  * Use cases\n    * Finance\n    * Mobility\n    * Hospitality\n    * Telecomunications\n    * Social Media\n    * Gambling\n  * Plans\n  * Developers\n    * Documentation\n    * Support\n    * Status page\n  * Compliance\n    * Certificates and regulation\n    * Data protection\n  * Resources\n    * Blog\n    * Ebooks and templates\n    * Webinars\n    * Success cases\n  * Sign up\n  * EN\n    * ES\n\nPortada » The problem of DEX regulation and how to solve it\n\n# The problem of DEX regulation and how to solve it\n\n**Pablo** Fecha de publicación: 14 de June de 2022\n\nWant to know what problems are facing the regulation of decentralized\nexchanges? In what ways could they be solved?\n\nWe tackle it in this article, but first, we break down what an exchange is:\n\nÍndice\n\nToggle\n\n  * What is a cryptocurrency exchange?\n    * Centralized Exchange\n    * Decentralized Exchanges (DEX)\n  * Why is DEX regulation a problem?\n\n## What is a cryptocurrency exchange?\n\nCryptocurrency exchanges are online tools and platforms that allow you to buy\nbitcoin or other cryptocurrencies quickly and easily. They are digital spaces\nsimilar to trading platforms, but focused on cryptocurrencies.\n\nSince 2009, numerous exchanges have appeared for the purchase, sale and\nexchange of cryptocurrencies. An accumulation of platforms accessible to an\nincreasingly wide audience of all ages.\n\nThe most delicate part of the process occurs when users make deposits,\nwithdrawals or purchase cryptocurrencies with FIAT money (such as, for\nexample, the Euro). This is where the need to control and manage the\nverification of the identity of users comes in, with the aim of avoiding money\nlaundering or terrorist financing, among others.\n\nThis is why it is important to know the differences between a decentralized\nexchange vs. a traditional exchange.\n\n### Centralized Exchange\n\nIt is the trading platform where cryptocurrencies are bought and sold in a\nregulated manner. Therefore, it requires identity verification of its users.\n\n### Decentralized Exchanges (DEX)\n\nIt is an automated and autonomous platform, in many cases only with\nprogramming. The problem is that they can be somewhat insecure if they do not\nmeet the required compliance standards.\n\n## Why is DEX regulation a problem?\n\nIn recent months, centralized exchanges have been adding KYC to their\nplatforms.\n\nThis is because regulation is becoming more demanding than ever. For their\npart, DEXs are debating whether to preempt identity verification or not. After\nall, much of the appeal of DEXs is that users are anonymous.\n\n> The problem of anonymity in decentralized exchanges can be solved with\n> identity verification and KYC.\n\nThe reality is that banks or financial institutions are currently obliged to\nknow and verify the identity of their clients. Due to this need, Know Your\nClient (KYC) measures have emerged; a mechanism that allows complying with the\nobligation of due diligence in customer identification.\n\nKYC consists of collecting a series of user data such as full name, address or\ndate of birth. But it is not enough to provide this data, because it is also\nimportant to prove that you are who you say you are. This is where documentary\nproof, such as an ID card, must be presented.\n\nKYC also involves risk analysis of each client, as well as possible monitoring\nof suspicious transactions. Behind it are organizations such as the European\nCentral Bank or the FATF, which follow instructions to monitor possible\nfraudulent transactions. Therefore, as the market grows, KYC is being applied\nmore and more in the cryptocurrency sector.\n\nCurrently, a good part of the most secure cryptocurrency exchanges or trading\nplatforms already ask their customers for personal data or even restrict the\noperations they can perform if they do not verify their digital identity.\n\nThe latter is something that clashes with the freedom that existed previously,\nwith the anonymity, decentralization and deregulation of the cryptocurrency\nmarket. After all, these digital currencies emerged to be independent of\nfinancial authorities.  \n\nBut the regulation is for the safety of investors, to prevent the illicit use\nof this market and to trace transactions that may be the result of a crime.\n\nIn spite of everything, there are users who are still attracted by the use of\nDEXs. In fact, the best decentralized exchange to date is MDEX (BSC), as it is\nthe largest decentralized exchange in the world.\n\nDespite the fact that the best decentralized exchanges are still fighting the\nbattle, regulation is near and the solution is to incorporate KYC in the\ncryptocurrency sector. What do you think?\n\nIf you liked it, share it on\n\nSee all posts\n\n## You may also be interested in\n\nOctober 10, 2023\n\n### Legal Session #2: Data Protection Regulation\n\nA few weeks ago, the second closed-door session was held for the Alice\ncommunity together with the boutique law firm ATH21, in which Marina\nFontcuberta, Senior Associate, answered questions regarding data protection,\ncurrent regulations and how to comply with them in the different processes of\nthe company; “We’ve all heard the typical phrase ‘Data is […]\n\nApril 26, 2023\n\n### What is PSD3 and why should we (very) take it into account?\n\nThe Payment Services Directive 3 (PSD3) is a European legislation that seeks\nto regulate payment services and improve consumer protection in the field of\nelectronic financial transactions. This directive is the evolution of PSD2 and\nbrings with it new requirements and responsibilities for both payment service\nproviders and end users. What is the goal of […]\n\nMarch 8, 2023\n\n### What is the difference between CDD  and EDD?\n\nCustomer Due Diligence (CDD) is the process of gathering information about a\ncustomer to assess the risk of a business relationship. This includes\nidentifying the customer and verifying their identity, as well as gathering\ninformation about their business activity. Enhanced Due Diligence (EDD) is a\nmore comprehensive process performed when a customer is deemed to […]\n\n  * About Alice\n  * Our team\n  * Careers\n  * Financing and grants\n  * Press\n  * Information security\n\n**Contact us**\n\nTalk to us  \nSign up  \n+34 634 251 948  \nMonday to Friday  \n8:00-20:00 (CET)\n\nSubscribe to our newsletter and stay updated on valuable content for your\nbusiness. NO SPAM.\n\nAll rights reserved\n\n  * Privacy policy\n  * Cookies policy\n  * Cookie settings\n  * Legal Notice\n\nWe are using cookies to give you the best experience on our website.\n\nYou can find out more about which cookies we are using or switch them off in\nsettings.\n\nAccept\n\nClose GDPR Cookie Settings\n\n  * Privacy Overview\n  * 3rd Party Cookies\n\nPowered by  GDPR Cookie Compliance\n\nPrivacy Overview\n\nThis website uses cookies so that we can provide you with the best user\nexperience possible. Cookie information is stored in your browser and performs\nfunctions such as recognising you when you return to our website and helping\nour team to understand which sections of the website you find most interesting\nand useful.\n\n3rd Party Cookies\n\nThis website uses Google Analytics to collect anonymous information such as\nthe number of visitors to the site, and the most popular pages.\n\nKeeping this cookie enabled helps us to improve our website.\n\nEnable or Disable Cookies\n\nPlease enable Strictly Necessary Cookies first so that we can save your\npreferences!\n\nEnable All Save Settings\n\n",
    "links": "[{\"link\": \"https://alicebiometrics.com/en/ebooks-and-templates/\", \"text\": \"Ebooks and templates\"}, {\"link\": \"https://alicebiometrics.com/en/webinars\", \"text\": \"Webinars\"}, {\"link\": \"https://alicebiometrics.com/en/success-cases/\", \"text\": \"Success cases\"}, {\"link\": \"https://alicebiometrics.com/en/the-problem-of-dex-regulation-and-how-to-solve-it/\", \"text\": \"EN\"}, {\"link\": \"https://alicebiometrics.com/en/talk-to-us\", \"text\": \"Talk to us\"}, {\"link\": \"https://alicebiometrics.com/en/signup\", \"text\": \"Sign up\"}]"
}