{
    "summary": "The Wayback Machine -\nhttp://web.archive.org/web/20231116055436/https://bisq.network/\n\nEn\n\nDe\n\nEn\n\nEs\n\nFr\n\nPt\n\nPt (Br)\n\nRu\n\n日本語\n\n简体中文\n\n  * Getting Started\n  * Bisq DAO\n  * Dashboard\n  * FAQ\n  * Markets\n  * Blog\n  * Wiki\n  * Downloads\n  * Learn More \n\nWiki\n\nBlog\n\n  * Downloads \n\nAll Downloads\n\nGo to Downloads Page\n\nDownload for Windows\n\n.exe\n\nDownload for macOS\n\n.dmg\n\nDownload for Debian/Ubuntu\n\n.deb\n\nDownload for Red Hat/Fedora\n\n.rpm\n\nDownload for Arch Linux\n\nArch User Repo\n\nSource Code\n\nzip | tar.gz\n\nRelease Notes\n\nv1.9.14\n\nVerification\n\nPGP signatures | PGP Public Key\n\n  * En \n\nDe\n\nEn\n\nEs\n\nFr\n\nPt\n\nPt (Br)\n\nRu\n\n日本語\n\n简体中文\n\n  *   * \n\n# Exchange, Decentralized.\n\nBuy and sell bitcoin for fiat (or other cryptocurrencies) privately and\nsecurely using Bisq's peer-to-peer network and open-source desktop software.\nNo registration required.\n\nDownload for Windows\n\n.exe\n\nDownload for macOS\n\n.dmg\n\nDownload for Debian/Ubuntu\n\n.deb\n\nDownload for Red Hat/Fedora\n\n.rpm\n\nDownloads\n\nGet Bisq\n\nDownloads  Get Android Notifications App  Get iOS Notification app  Get\nStarted\n\nAll Downloads  |  v1.9.14  |  You appear to be running Windows You appear to\nbe using macOS You appear to be using Debian/Ubuntu You appear to be using Red\nHat/Fedora Current Version\n\n## Features\n\n#### No Identity Verification\n\nGet started in minutes. No need to wait for approval from a central authority.\n\n#### Decentralized\n\nTrading takes place on a global P2P network of users running Bisq on their own\nmachines.\n\n#### Safe\n\nBisq never holds your funds. Deposits held in 2-of-2 multisig wallets\nencourage safe, successful trades.\n\n#### Private\n\nYour data is stored locally on-disk, and is never sent to a central server.\nEvery Bisq node is a Tor hidden service by default.\n\n#### Open\n\nCode is open-source, and project strategy is discussed openly on Keybase and\nGitHub.\n\n#### Easy to Use\n\nWe've made all this sophistication simple—make your first trade in under 10\nminutes!\n\n#### The Bisq DAO\n\nDecentralized governance for a decentralized exchange, built on top of\nBitcoin. Learn more here.\n\n## How to Get Started\n\nWith Bisq, you can start trading in less than 10 minutes:\n\n  1. Download the app, or build it from source.\n  2. Add your national or crypto currency accounts.\n  3. Create new offer or take an existing one.\n  4. Follow the user interface to finalize the trade.\n\n## Join the Community\n\nBisq is always looking for highly-skilled developers, designers and security\nexperts to join our community. If you’re interested in helping make Bisq\nbetter, there are many ways to contribute. We’d love to hear from you!\n\n  * GitHub\n  * Twitter\n  * Mastodon\n  * YouTube\n  * Forum\n  * Freenode IRC\n  * Reddit\n  * Matrix\n  * Telegram\n\n##### Bisq mobile notification App\n\n\n\n© 2022 Bisq\n\n* * *\n\n##### Resources\n\n  * Roadmap\n  * Contribute\n\n  * Benefactors\n  * Market Data API\n\n* * *\n\n##### Join the Community\n\n",
    "links": "[{\"link\": \"/web/20231116055436/https://bisq.network/\", \"text\": \"\"}, {\"link\": \"/web/20231116055436/https://bisq.network/de/\", \"text\": \"De\"}, {\"link\": \"/web/20231116055436/https://bisq.network/\", \"text\": \"En\"}, {\"link\": \"/web/20231116055436/https://bisq.network/es/\", \"text\": \"Es\"}, {\"link\": \"/web/20231116055436/https://bisq.network/fr/\", \"text\": \"Fr\"}, {\"link\": \"/web/20231116055436/https://bisq.network/pt-PT/\", \"text\": \"Pt\"}, {\"link\": \"/web/20231116055436/https://bisq.network/pt-BR/\", \"text\": \"Pt (Br)\"}, {\"link\": \"/web/20231116055436/https://bisq.network/ru/\", \"text\": \"Ru\"}, {\"link\": \"/web/20231116055436/https://bisq.network/ja/\", \"text\": \"日本語\"}, {\"link\": \"/web/20231116055436/https://bisq.network/zh-CN/\", \"text\": \"简体中文\"}, {\"link\": \"/web/20231116055436/https://bisq.network/getting-started\", \"text\": \"Getting Started\"}, {\"link\": \"/web/20231116055436/https://bisq.network/dao\", \"text\": \"Bisq DAO\"}, {\"link\": \"/web/20231116055436/https://bisq.network/dashboard\", \"text\": \"Dashboard\"}, {\"link\": \"/web/20231116055436/https://bisq.network/blog\", \"text\": \"Blog\"}, {\"link\": \"/web/20231116055436/https://bisq.network/downloads\", \"text\": \"Downloads\"}, {\"link\": \"/web/20231116055436/https://bisq.network/blog/\", \"text\": \"Blog\"}, {\"link\": \"/web/20231116055436/https://bisq.network/downloads\", \"text\": \"Go to Downloads Page\"}, {\"link\": \"http://web.archive.org/web/20231116055436/https://bisq.network/downloads/v1.9.14/Bisq-64bit-1.9.14.exe\", \"text\": \".exe\"}, {\"link\": \"http://web.archive.org/web/20231116055436/https://bisq.network/downloads/v1.9.14/Bisq-1.9.14.dmg\", \"text\": \".dmg\"}, {\"link\": \"http://web.archive.org/web/20231116055436/https://bisq.network/downloads/v1.9.14/Bisq-64bit-1.9.14.deb\", \"text\": \".deb\"}, {\"link\": \"http://web.archive.org/web/20231116055436/https://bisq.network/downloads/archive/v1.9.14.zip\", \"text\": \"zip\"}, {\"link\": \"http://web.archive.org/web/20231116055436/https://bisq.network/downloads/archive/v1.9.14.tar.gz\", \"text\": \"tar.gz\"}, {\"link\": \"http://web.archive.org/web/20231116055436/https://bisq.network/downloads/v1.9.14\", \"text\": \"v1.9.14\"}, {\"link\": \"http://web.archive.org/web/20231116055436/https://bisq.network/downloads/v1.9.14\", \"text\": \"PGP signatures\"}, {\"link\": \"http://web.archive.org/web/20231116055436/https://bisq.network/downloads/v1.9.14/E222AA02.asc\", \"text\": \"PGP Public Key\"}, {\"link\": \"/web/20231116055436/https://bisq.network/de/\", \"text\": \"De\"}, {\"link\": \"/web/20231116055436/https://bisq.network/\", \"text\": \"En\"}, {\"link\": \"/web/20231116055436/https://bisq.network/es/\", \"text\": \"Es\"}, {\"link\": \"/web/20231116055436/https://bisq.network/fr/\", \"text\": \"Fr\"}, {\"link\": \"/web/20231116055436/https://bisq.network/pt-PT/\", \"text\": \"Pt\"}, {\"link\": \"/web/20231116055436/https://bisq.network/pt-BR/\", \"text\": \"Pt (Br)\"}, {\"link\": \"/web/20231116055436/https://bisq.network/ru/\", \"text\": \"Ru\"}, {\"link\": \"/web/20231116055436/https://bisq.network/ja/\", \"text\": \"日本語\"}, {\"link\": \"/web/20231116055436/https://bisq.network/zh-CN/\", \"text\": \"简体中文\"}, {\"link\": \"http://web.archive.org/web/20231116055436/https://bisq.network/downloads/v1.9.14/Bisq-64bit-1.9.14.exe\", \"text\": \"\"}, {\"link\": \"http://web.archive.org/web/20231116055436/https://bisq.network/downloads/v1.9.14/Bisq-1.9.14.dmg\", \"text\": \"\"}, {\"link\": \"http://web.archive.org/web/20231116055436/https://bisq.network/downloads/v1.9.14/Bisq-64bit-1.9.14.deb\", \"text\": \"\"}, {\"link\": \"/web/20231116055436/https://bisq.network/downloads\", \"text\": \"\"}, {\"link\": \"/web/20231116055436/https://bisq.network/downloads\", \"text\": \"\"}, {\"link\": \"/web/20231116055436/https://bisq.network/getting-started\", \"text\": \"\"}, {\"link\": \"/web/20231116055436/https://bisq.network/downloads\", \"text\": \"\\n                        All Downloads\\n                      \"}, {\"link\": \"/web/20231116055436/https://bisq.network/getting-started\", \"text\": \"make your first trade\"}, {\"link\": \"/web/20231116055436/https://bisq.network/dao\", \"text\": \"Learn more here\"}, {\"link\": \"/web/20231116055436/https://bisq.network/downloads\", \"text\": \"Download the app\"}, {\"link\": \"http://web.archive.org/web/20231116055436/https://bisq.network/community/\", \"text\": \"community\"}, {\"link\": \"/web/20231116055436/https://bisq.network/benefactors\", \"text\": \"Benefactors\"}]",
    "priceAndPlans": "# Frequently asked questions\n\nFrom Bisq Wiki\n\nJump to navigation Jump to search\n\nBelow is a compilation of **frequently-asked questions (FAQ)** about Bisq, how\nto use it, and how to help the project.\n\nFeel free to ask further questions on any of Bisq's many outreach channels.\n\n## Contents\n\n  * 1 About\n    * 1.1 How is Bisq different from other decentralized exchanges?\n    * 1.2 Is Bisq open-source software?\n    * 1.3 Is Bisq safe?\n  * 2 Getting started\n    * 2.1 I find Bisq very confusing. I've tried using it but just end up getting lost!\n    * 2.2 I can't use Bisq to trade because there are hardly ever any offers in my currency. What can I do?\n    * 2.3 I heard I need bitcoin in order to buy bitcoin on Bisq...but I don't have any bitcoin. What can I do?\n  * 3 Trading\n    * 3.1 What are trading fees?\n    * 3.2 Mining fees are too high. How can I trade on Bisq cost-effectively?\n    * 3.3 Why does Bisq require a security deposit in BTC?\n    * 3.4 What are trading limits? How much bitcoin can I buy/sell at once?\n    * 3.5 Which payment methods are available?\n    * 3.6 How does Bisq handle fiat like dollars and euros? Where does it go?\n    * 3.7 How long does a trade take?\n    * 3.8 How does Bisq protect my privacy?\n    * 3.9 Do I need to keep Bisq online for my offers to remain online?\n    * 3.10 Do I have to use the Bisq wallet?\n    * 3.11 Do I have to use the Bisq token?\n    * 3.12 Will my bank know I'm trading bitcoin?\n  * 4 Common Technical Niggles\n    * 4.1 Bisq on macOS won't open, or it's asking for permission to record my keystrokes!\n    * 4.2 Bisq seems to bog down my computer. When I open it, CPU and memory usage spike. Can this be prevented?\n    * 4.3 I'm on a high-resolution monitor on Linux and everything is way too small. Help?\n    * 4.4 Bisq says \"this offer cannot be taken due to counterparty trade restrictions\". What does that mean?\n    * 4.5 My SPV resync is taking all day and it keeps freezing. What can I do to make it go faster?\n    * 4.6 How can I get a fresh Bisq wallet and transfer my BSQ balance to it?\n    * 4.7 \"heightOfLastBlock must match chainHeight\" error on starting Bisq\n    * 4.8 \"Payment started\" button will not stick, always says \"Please send confirmation again\"\n    * 4.9 I want to install Bisq on a VPS or on an otherwise headless system\n    * 4.10 I receive an error message on Linux, regarding Java heap space\n  * 5 Dispute resolution\n    * 5.1 How does dispute resolution work?\n    * 5.2 How is collusion between mediators, arbitrators, and traders prevented?\n    * 5.3 What happens if the person buying bitcoin does a chargeback after the bitcoin has been released from the multisig address?\n    * 5.4 Wouldn't a pure reputation system among traders make mediators and arbitrators unnecessary?\n    * 5.5 How can I contact my trading peer?\n  * 6 DAO\n    * 6.1 What is the Bisq DAO?\n    * 6.2 How does the Bisq DAO work?\n    * 6.3 What do I need to know about the DAO, as a trader?\n    * 6.4 Is Bisq using a token because it needs money? What's the issuance schedule for the token?\n    * 6.5 Can I use Bisq without BSQ and without this DAO?\n  * 7 Other\n    * 7.1 This project is cool! How can I help out?\n    * 7.2 I have a question that isn’t covered here...?\n\n## About\n\n#### How is Bisq different from other decentralized exchanges?\n\nBisq is a peer-to-peer trading network, not a website or \"app\" or other\ncentralized service. It's software you run on your own hardware, which\nconnects to other people running the Bisq software to facilitate trades. It's\nopen-source and community-driven.\n\nAnd you can trade bitcoin for fiat currencies with it!\n\nThe difference between Bisq and other so-called decentralized exchanges is as\nstark as the difference between owning your own home and renting someone\nelse's—in the former case you have full control over the property, and in the\nlatter you're always subject to the landlord's whims and demands (no matter\nhow nice the landlord may seem to be).\n\nWith Bisq you're always the owner—not just owner of your bitcoin, but also\nowner of your data.\n\n  * Bisq does not hold any bitcoin. All bitcoin used for trading is held in **2-of-2 multisignature addresses** controlled solely by the trading peers themselves.\n  * Bisq does not hold any national currency. National currency is transferred directly from one trader to the other using traditional banking and payment services.\n  * All Bisq data is transferred over its own secure peer-to-peer network, which is built on top of the Tor network—no central servers. This means **there are no data honeypots** , rendering large-scale hacks of customer information databases impossible.\n  * Bisq does not know anything about traders who use its network, and no data is stored on who trades with whom.\n  * Bisq does not require registration, so your privacy is protected, and you can **begin trading instantly**.\n  * Bisq is code, not a company. It is an open-source project organized as a decentralized autonomous organization (DAO) built on top of Bitcoin.\n\nSee more in the Introduction.\n\n#### Is Bisq open-source software?\n\nBisq's software is free/libre open-source licensed under Version 3 of the GNU\nAffero General Public License.\n\nHere's the source code and license.\n\n#### Is Bisq safe?\n\nThanks to strong incentives encouraging traders to play fairly, the vast\nmajority of trades on Bisq go smoothly and quickly.\n\nBisq employs three primary mechanisms to achieve security:\n\n  * All bitcoin traded with Bisq is secured in a 2-of-2 multisignature address.\n  * Both traders are required to pay security deposits, which are refunded after trades are completed.\n  * Trade disputes are handled through a 3-tier mechanism that includes end-to-end encrypted trader chat, mediation, and arbitration.\n\nWhen trading fiat currency for bitcoin, there is always some chargeback risk,\nas fiat transactions can often be reversed.\n\nTo mitigate this risk, Bisq:\n\n  * only supports payment methods which are known to make chargebacks difficult—this is why Bisq does not support PayPal and credit cards, for example. See more on chargeback risks.\n  * employs an signing mechanism that forces 0.01 BTC buy limits until a buyer's integrity (not identity!) is verified.\n\n## Getting started\n\n#### I find Bisq very confusing. I've tried using it but just end up getting\nlost!\n\nSome people find Bisq's interface intuitive, but many people don't. Check out\nthis tour video to help you make sense of the interface, and then check out\nthe Bird's Eye View of a Bisq Trade video for a high-level overview of how\nBisq trading works.\n\nThen check out the getting-started guide to see how to get up and running\nquickly.\n\nAs of April 2021, Bisq contributors have designed a whole new beautiful\ninterface that should make Bisq significantly more intuitive, and are also in\ntouch with a talented UI developer to turn the design into code. You can\nfollow progress on this initiative here.\n\n#### I can't use Bisq to trade because there are hardly ever any offers in my\ncurrency. What can I do?\n\nWhile Bisq can technically support any market, only a handful of markets are\nconsistently active on Bisq—mainly because they offer good payment methods and\nhad strong on-the-ground support to bootstrap them in the beginning.\n\n| Note that a weak offer book in a particular market doesn't _necessarily_\nmean trades don't take place in that market. It could be that there are people\nlurking there that will happily take an offer if you take the initiative to\nmake one (this is often the case in markets like CAD, AUD, and GBP, for\nexample).\n\nYou can check trade history for your market by going to `Market` > `Trades`\nand picking your currency from the dropdown.  \n  \n---|---  \n  \nIf your market has no recent trades, a little more work will need to be done\nto get it going. At a minimum, payment methods common in your market should be\nadded (suggest them here), and some form of marketing should be done to get\nusers and market-makers to bootstrap a market.\n\nBisq contributors are more than happy to help if you can help with guidance,\nconnections to people who can help, and/or events and translations and other\nvehicles for reaching your target demographics.\n\n#### I heard I need bitcoin in order to buy bitcoin on Bisq...but I don't have\nany bitcoin. What can I do?\n\nYes, the chicken-and-egg problem with Bisq is real.\n\nHere are some ways to get just enough bitcoin to do your first trade on Bisq:\n\n  * try to obtain some yourself using these suggestions\n  * hop onto the `Get your first BTC` room on Matrix and make a deal (see more here)\n\n## Trading\n\n#### What are trading fees?\n\nTrading fees are calculated as a percentage of trade size: 0.1% for makers and\n0.7% for takers if paid in BTC and about half of that if paid in BSQ.\n\nKeep in mind that you'll also need to pay mining fees for the on-chain\ntransactions, as well as a deposit to lock into the multisig escrow. You'll\nget the deposit back in full after the trade completes successfully.\n\n#### Mining fees are too high. How can I trade on Bisq cost-effectively?\n\nBisq's current trade protocol requires 4 on-chain transactions. Takers pay for\n3 of these transactions and makers pay for 1 of them.\n\nTherefore, to make trading on Bisq as cost-effective as possible, consider\n**making your own offers** at times **when mining fees are lower**.\n\nOther things you can do:\n\n  * make offers to trade **larger amounts of BTC** (bigger offers tend to get better pricing)\n  * **pay trade fees with BSQ** (BSQ trade fees tend to be about half of BTC trading fees)\n\n#### Why does Bisq require a security deposit in BTC?\n\nSecurity deposits create strong incentives for buyers and sellers to follow\nthe rules of Bisq's trading protocol. Deposits are locked into multisig escrow\nalong with the bitcoin being traded, and are returned to each user when the\ntrade is complete.\n\nIf a trade is disputed through a mediator or arbitrator, some or all of the\noffending party's security deposit may be awarded to the counterparty.\nExamples of protocol violations include a buyer failing to pay a seller,\npaying with a different account or with a different name, or a seller failing\nto acknowledge receipt of a buyer's payment.\n\nMost Bisq trades complete without any problem thanks in part to the incentives\nthat security deposits create.\n\nSee full trading rules.\n\n#### What are trading limits? How much bitcoin can I buy/sell at once?\n\nTrading limits vary based on payment method, since some payment methods are\nmore secure than others.\n\nRelatively safe payment methods such as Japan's Furikomi and Australia's PayID\nare set to allow trades of up to 1 BTC, but other payment methods such as\nZelle and SEPA have a cap of 0.25 BTC. See the full list of payment methods\nand limits.\n\nAltoins are not possible to charge back, so all altcoin trades have a limit of\n2 BTC.\n\n#### Which payment methods are available?\n\nSee payment methods.\n\nIf you'd like to suggest a payment method to be added, please submit a new\nissue.\n\n#### How does Bisq handle fiat like dollars and euros? Where does it go?\n\nBisq doesn't handle fiat at all -- it only handles BTC. Trades are settled\noutside of Bisq, meaning fiat payments are sent outside Bisq via traditional\nbanking services.\n\nBisq merely matches peers and sets incentives (e.g. locking a BTC security\ndeposit from both peers, as a sort of escrow) to encourage both trading peers\nto act in good faith. This is also why you need bitcoin to begin trading on\nBisq.\n\n#### How long does a trade take?\n\nThere is no automatic order matching on Bisq, and trades are settled manually\nby humans. As a result, trades are not completed as quickly as they would be\non centralized exchanges, but can still be fairly quick.\n\nSome payment methods are instant (e.g., Faster Payment) while others can take\na few days (e.g., SEPA).\n\nAs far as Bisq is concerned, the deposit transaction needs to be confirmed\nonce before the buyer can send payment. Bitcoin transactions take about 10\nminutes to confirm, so with quick traders and quick payment method, a Bisq\ntrade can be completed in a matter of minutes.\n\nAltcoin trade periods are always 1 day (or 1 hour for Altcoins Instant\ntrades).\n\nSee the list of payment methods for complete details.\n\n#### How does Bisq protect my privacy?\n\nBisq is standalone, open-source software that you can inspect before running\non your machine, and as a result, you don't have to trust that any server is\nlogging your personal details (as you would in the case of a website).\n\nAs for the trading process, your payment information is stored locally on your\nmachine, and only your trading partner (and your mediator or arbitrator, in\ncase of a dispute) can ever see it. All data exchanged between users is\nencrypted and signed.\n\nTo transmit data from one user to another, Bisq uses a P2P network built on\ntop of Tor, which provides a high degree of anonymity. The user doesn't need\nto do any additional work for all of this to work—it is all integrated in the\napplication.\n\n#### Do I need to keep Bisq online for my offers to remain online?\n\nYes. There are no central servers on the Bisq network—so all peers are\nresponsible for keeping their offers online.\n\nIf you have published an offer, your Bisq application needs to stay online so\nit can react when another trader wants to take your offer (the multisig\ndeposit transaction is created in the take-offer process). Be sure you have\ndeactivated your computer's standby mode so your Bisq application can stay\nonline (monitor standby is not a problem).\n\nIf your Bisq application does go offline, your offer will get removed from the\ndistributed offerbook. It will be re-published the next time you start your\nBisq application.\n\nAfter an offer has been taken and the trade process has started, neither\ntrader needs to be online continuously, but each trader will need to be online\nperiodically to check if any action is needed on their side (e.g. sending\nfiat/altcoin, confirming payment receipt, etc).\n\n#### Do I have to use the Bisq wallet?\n\nNo, but you may find it convenient to keep a small amount of trading capital\nthere.\n\nWhen entering a new trade on Bisq, you will get the option to transfer funds\nfrom your Bisq wallet _or_ send funds from an external wallet.\n\nLikewise, when concluding a trade on Bisq, you can withdraw your funds to the\nBisq wallet or to an external wallet.\n\n#### Do I have to use the Bisq token?\n\nNo, using BSQ is totally optional. However, using it gets you a ~50% discount\non trading fees while helping to compensate Bisq contributors at the same\ntime.\n\n#### Will my bank know I'm trading bitcoin?\n\nGenerally speaking, Bisq doesn't deal with banks at all. All fiat transfers\ntake place directly between users.\n\nBut there have been reports of banks closing accounts upon suspecting bitcoin\nactivity. As a result, Bisq requires that the \"reason for payment\" field\nalways be left BLANK when making a payment (if the payment method offers such\na field).\n\nIf a reason is required, it should be something trivial like a \"-\" or\n\"payment\". If you want to use something else, please agree on an alternative\nwith your peer using trader chat. See full trading rules for more information.\n\n## Common Technical Niggles\n\n#### Bisq on macOS won't open, or it's asking for permission to record my\nkeystrokes!\n\nIf Bisq won't open, try right-clicking the app and clicking `Open`.\n\nIf you get the prompt asking to record your keystrokes, rest assured it's a\nbug (Bisq is absolutely not recording your keystrokes). This bug should be\nfixed with a [LTS version update] coming soon.\n\n#### Bisq seems to bog down my computer. When I open it, CPU and memory usage\nspike. Can this be prevented?\n\nBisq has had memory usage and CPU usage issue on certain operating systems in\nthe past, but these issues should be resolved now. You can manually set the\nmax RAM usage by following these instructions.\n\nChances are Bisq is probably just trying to sync blockchain data. New releases\nof Bisq include data stores updated at release time to reduce this syncing\ntime, but as a release gets older (i.e., beyond 3-4 weeks old), the data\nstores get older, and syncing takes longer. Just let it finish and your\ncomputer resources should go back down to normal again.\n\nIf the issue doesn't go away on its own, please reach out for help in the\n`Support` room on Matrix or open an issue on GitHub.\n\n#### I'm on a high-resolution monitor on Linux and everything is way too\nsmall. Help?\n\nSee this article for a tip on fixing this issue.\n\n#### Bisq says \"this offer cannot be taken due to counterparty trade\nrestrictions\". What does that mean?\n\nThis happens in rare circumstances. Bisq checks information about an account\nsuch as its age to determine if it is allowed to trade over certain limits.\nThe information is stored in the P2P network, and it may not yet have\npropagated to your node. Try again after restarting Bisq. The offer maker may\nneed to restart Bisq in order for the information to propagate.\n\n#### My SPV resync is taking all day and it keeps freezing. What can I do to\nmake it go faster?\n\nUnfortunately this can happen sometimes if your wallet is over a year old\nand/or has a lot of transactions. If the resync stalls, close and restart Bisq\nto continue the resync. It will go faster if you connect to a local Bitcoin\nnode. After your SPV resync is completed, it would be best to switch to a\nfresh wallet.\n\n#### How can I get a fresh Bisq wallet and transfer my BSQ balance to it?\n\nThe procedure involves setting aside the existing wallet directory (by\nrenaming) in order to get a fresh wallet. The wallet directory is at\n`btc_mainnet/wallet` from the main data directory location. You'll then be\nable to activate either the old or new wallet by renaming the directory before\nstarting Bisq. Be sure that Bisq is never running when you rename a directory.\n\n  1. You have some BSQ and also some BTC balance existing in your wallet. (You need BTC to pay mining fees for sending BSQ).\n  2. Close Bisq then rename your `wallet` directory to `oldWallet`.\n  3. Start Bisq and it will create a fresh wallet. Note down your BSQ receiving address and also your BTC receiving address. Write down your recovery seed phrase (Under Account / Wallet Seed menu) and store it in a safe place (not online).\n  4. Close Bisq and rename your `wallet` dir to `newWallet`, rename your old wallet dir to `wallet`, then restart Bisq.\n  5. Send BSQ to your new receiving address you saved in the earlier step. Then send BTC the same way. Close Bisq.\n  6. Rename `wallet` to `oldWallet` and `newWallet` to `wallet`. Then restart Bisq.\n\nDone! Your BSQ and BTC balances have been moved to a fresh wallet.\n\n#### \"heightOfLastBlock must match chainHeight\" error on starting Bisq\n\nThe following procedure should fix itː\n\n  * make a backup of your data folder\n  * close Bisq\n  * from inside data folder, delete DaoStateStore and BsqBlocks\n  * restart Bisq\n\n#### \"Payment started\" button will not stick, always says \"Please send\nconfirmation again\"\n\nThis is a known issue, stemming from how the application will err on the side\nof caution when P2P network conditions are less than favorable. It most often\nhappens when the peer is offline, so usually when a seller taker accepts an\nopen offer with a non-instant payment method, like SEPA, and then goes\noffline, since the payment will take at least a day to be credited and they do\nnot need to stay connected while the buyer maker's payment arrives. Here are\nsome things that might work\n\n  * Send a message in trader chat\n  * Insist on pressing the button tens of times\n  * Restart Bisq\n  * Follow menus **Settings** -> **Network Info** -> **Open Tor Settings** -> **Delete Outdated Tor Files And Shutdown** , then restart Bisq\n  * Do nothing and stay online, as the button will sometimes finally \"register\" by itself with a random delay\n  * When everything else fails, and the trade period is almost at its end, communicate your intentions to the peer in trader chat and open mediation by pressing Ctrl-O in trade window, explaining what happened to the mediator, even better by attaching a screenshot of the issue; a support ticket will be opened and both peers will have the opportunity to accept the original payout\n\n#### I want to install Bisq on a VPS or on an otherwise headless system\n\nBisq needs a graphical desktop environment to be ran, but in order to keep\noffers online without the need to have your PC always on, some users reported\ngood results by using https://www.xpra.org as a graphical endpoint which you\ncan forward to a client.\n\n#### I receive an error message on Linux, regarding `Java heap space`\n\nYou can increase the memory allowance to Bisq, by editing the file\n`/opt/bisq/lib/app/Bisq.cfg`, to make it read `java-options=-XX:MaxRAM=16g`\nwhere it says `java-options=-XX:MaxRAM=8g`\n\n## Dispute resolution\n\n#### How does dispute resolution work?\n\nBisq provides a 3-layer mechanism for resolving disputes: trader chat,\nmediation, and arbitration.\n\nTrader chat enables traders to resolve small issues themselves privately over\nend-to-end encrypted chat right in Bisq. If this doesn't work, traders can\nengage a mediator to examine the situation and suggest a payout. In rare\ncircumstances that mediation fails, a trader can choose to engage an\narbitrator to re-examine the situation and make a payout.\n\nVeteran users: please note that the arbitrator role changed significantly with\nthe launch of the new trade protocol on v1.2.\n\nSee trading rules and dispute resolution for more.\n\n#### How is collusion between mediators, arbitrators, and traders prevented?\n\nWith the launch of the new trading protocol in v1.2, multisig escrows went\nfrom 2-of-3 to 2-of-2 arrangements, so that only the two trading peers have\ncontrol of trading funds (instead of the 2 trading peers and an arbitrator).\nWith no keys in the multisig escrow, it is no longer possible for a mediator\nor arbitrator to collude with another trader to release funds maliciously.\n\nMediators and arbitrators are still bonded roles, however, because even though\nthey cannot sign a payout transaction to resolve a dispute, they can _advise_\nhow to resolve a dispute, and it's important that they be responsive,\nresponsible, and fair when doing so.\n\n#### What happens if the person buying bitcoin does a chargeback after the\nbitcoin has been released from the multisig address?\n\nBisq only supports payment methods for which chargebacks are not easy (e.g.,\nthis is why PayPal and credit cards are not supported). But there is still a\nlittle chargeback risk with banks. If a bank executes a chargeback after the\nBTC has been released, there is nothing a mediator or arbitrator can do.\n\nBisq's goal is to make this scenario as unattractive as possible, using three\nprimary mechanisms:\n\n  1. Account aging requires newly-created fiat payment accounts on Bisq to have lower trade limits, and those limits are increased over time.\n  2. Account signing requires higher-risk payment methods to be signed upon verifying the integrity of a trader before account aging kicks in. Until such accounts are signed, buy limits are set to 0.01 BTC.\n  3. National currency payment methods which are found to be used for chargebacks are quickly removed.\n\n#### Wouldn't a pure reputation system among traders make mediators and\narbitrators unnecessary?\n\nPure reputation without additional dispute resolution measures is a weak\nprotection system, as you can never avoid sybil or long con attacks.\n\nSuch mechanisms are also problematic for protecting privacy and for keeping\nthe service decentralized.\n\n#### How can I contact my trading peer?\n\nBisq has a built-in end-to-end encrypted chat mechanism that you can use to\ntalk to your trading peer while the trade is in progress.\n\n## DAO\n\n#### What is the Bisq DAO?\n\nThe Bisq DAO (decentralized autonomous organization) is a decentralized\ngovernance mechanism for the Bisq software, built on Bitcoin. It takes the\nplace of a company. How good can decentralized software possibly be if it's\nstill controlled by a single entity, like a company?\n\nDecentralized software is no good without decentralized governance.\n\nThat's why Bisq is not a company or legal entity of any kind—instead, it's\norganized as a DAO. The DAO handles the software's funding and strategy-making\nto enable the Bisq network to thrive, and at the same time, harden it against\nattacks on the infrastructure that powers its leadership and operation.\n\nIn a nutshell, the Bisq DAO enables Bisq to become even more censorship-\nresistant, a core principle of the project from the very beginning.\n\nRead more about the Bisq DAO in this introductory article.\n\n#### How does the Bisq DAO work?\n\nThe primary purposes of the Bisq DAO are financing the project and determining\nstrategy.\n\n  1. Trading fees are distributed directly from traders to contributors with a token (colored bitcoin) called BSQ.\n  2. Strategy is determined collectively through voting done in the Bisq software and recorded on the Bitcoin network.\n\nLearn more about how this actually works in this series of short 3-5 minute\nvideos.\n\nSee this article for a full list of resources to learn more.\n\n#### What do I need to know about the DAO, as a trader?\n\nFirst of all, you are NOT required to use the BSQ token or Bisq DAO to use\nBisq.\n\nBut there are benefits to doing so: you'll pay lower trading fees by using BSQ\ninstead of BTC.\n\nBut why have the BSQ token at all? Because it enables Bisq contributors to be\npaid for their work without any central wallets or points of control. When you\nbuy BSQ, you're directly paying a Bisq contributor for their work, and in the\nprocess, helping to sustain the whole project. The dynamic this token enables\nis not possible with plain bitcoin.\n\nWhen you use BSQ to pay trading fees, it's destroyed and 'burned' out of\nexistence.\n\nSee more on this dynamic here.\n\n#### Is Bisq using a token because it needs money? What's the issuance\nschedule for the token?\n\nBisq already earns revenue from trading fees. It's not launching this DAO and\nBSQ token for _earning_ revenue—it's doing it to _distribute_ the revenue it\nalready earns to more people without any central points of control.\n\nBSQ tokens are issued every time a contributor's compensation request is\napproved through voting, and the tokens are destroyed every time a trader uses\nBSQ to pay trading fees.\n\nBSQ issuance is not a 1-time event, and its purpose is not to raise capital.\nYou can see a walk-through of the BSQ issuance process in this video series.\n\n#### Can I use Bisq without BSQ and without this DAO?\n\nYou can pay trading fees with BTC instead of BSQ. Since v1.9.8, the DAO has to\nbe always activated.\n\nBefore the Bisq DAO, trading fees went to just a couple of wallets owned by\nspecific Bisq contributors (arbitrators). All other contributors were not\npaid. Bisq needs its contributors to be paid in regular, predictable ways to\nensure continual (and reliable) development, service, and growth; the Bisq DAO\nenables this to happen by distributing trading fees to all contributors in a\ntotally decentralized way.\n\nThe Bisq DAO and BSQ enable a funding and governance mechanism that is [not\npossible with plain bitcoin]. We highly recommend you check out the\ndocumentation and video series] to learn more.\n\n## Other\n\n#### This project is cool! How can I help out?\n\nCheck out the contributor checklist. We'd love to hear from you!\n\n#### I have a question that isn’t covered here...?\n\nFeel free to reach out on Matrix or any other channel.\n\nRetrieved from\n\"https://bisq.wiki/index.php?title=Frequently_asked_questions&oldid=3174\"\n\n## Navigation menu\n\n### Personal tools\n\n  * English\n  * Log in\n\n### Namespaces\n\n  * Page\n  * Discussion\n\n###  Variants\n\n### Views\n\n  * Read\n  * View source\n  * View history\n\n### More\n\n###  Search\n\n### Navigation\n\n  * Main page\n  * Recent changes\n  * Random page\n  * Help about MediaWiki\n\n### Tools\n\n  * What links here\n  * Related changes\n  * Special pages\n  * Printable version\n  * Permanent link\n  * Page information\n\n  * This page was last edited on 1 March 2023, at 17:34.\n\n  * Privacy policy\n  * About Bisq Wiki\n  * Disclaimers\n\n  * \n\n"
}