{
    "summary": "Developers\n\nDevelopers\n\nDocs\n\nStart building your universally connected smart contracts\n\nDeveloper Hub\n\nnew\n\nTools, tutorials, and technical support\n\nDeveloper Experts Program\n\nChainlink’s most active and supportive technical community members\n\nProducts\n\nProducts\n\nCross-chain\n\nCross-Chain Communication\n\nnew\n\nMove data and value between existing systems and any public or private\nblockchain.\n\nData\n\nData Streams\n\nnew\n\nLeverage high-frequency market data to power the next-generation of DeFi\nmarkets.\n\nMarket and Data Feeds\n\nIntegrate ultra-secure onchain data to trigger smart contracts in DeFi and\nbeyond.\n\nProof of Reserve\n\nVerify cross-chain and off-chain reserves backing tokenized and wrapped\nassets.\n\nCompute\n\nFunctions\n\nConnect a smart contract to any API and run custom Web3 computation in\nminutes.\n\nAutomation\n\nAutomate smart contracts in a decentralized way with time or event-based\ntriggers.\n\nVRF\n\nUse verifiably random numbers to ensure fair outcomes in games, NFTs, and\nmore.\n\nUse Cases\n\nUse Cases\n\nOverview\n\nDecentralized services powering hybrid smart contract use cases across a wide-\nvariety of industries\n\nLearn more\n\nFinancial Services  \n\nDeFi  \n\nGaming\n\nNFT Collectibles\n\nClimate Markets\n\nEnterprise\n\nInsurance\n\nEcosystem\n\nEcosystem\n\nChainlink Ecosystem\n\nProvide oracle computation directly to smart contracts and earn revenue by\nrunning critical data infrastructure\n\nData Providers\n\nLeverage the Chainlink Network to make your data accessible onchain directly\nthrough your own Chainlink nodes\n\nCommunity\n\nCommunity\n\nChainlink Community\n\nGain access to resources and events for Chainlink’s global community\n\nLearn more\n\nGrant Program  \n\nFunding and supporting the creation of new smart contract applications built\nby the community\n\nEvents\n\nUpcoming Chainlink virtual and in-person events, hackathons, meetups, and more\n\nResources\n\nResources\n\nBlog\n\nDiscover the latest product news, deep dives, developer tutorials, and more\n\nLearn more\n\nWhitepaper  \n\nCase Studies  \n\nTech Talks\n\nFAQs\n\nEducation Hub\n\nEconomics\n\nEconomics\n\nStaking app\n\nStake your LINK to help secure the Chainlink Network and earn rewards\n\nView the app\n\nEconomics 2.0  \n\nStaking\n\nBUILD Program\n\nStart building\n\nMenu\n\nStart building\n\nNEW\n\nThe Constellation Hackathon is on:\n\nCompete for $500K+ in prizes.\n\nSmartCon is LIVE right now. Discover 200+ leading DeFi, NFT, and blockchain\nprojects.  \n\nSign up today\n\nWin your share of  \n **500k+** in prizes.\n\nSign Up Now\n\nJoin the biggest names in finance and tech\n\nWatch live now\n\nChainlink Labs is hiring. Come join an industry-leading team.\n\nSee current openings\n\nWhat Is a Smart Contract?History of Smart ContractsHow Smart Contracts\nWorkSmart Contract ExamplesSmart Contract BenefitsSmart Contract Use\nCasesSmart Contract Limitations\n\nShare\n\nEducation\n\n/\n\nDeFi\n\n# What Is a DEX (Decentralized Exchange)?\n\nLast Updated Date:\n\nMay 24, 2023\n\nDEFINITION\n\nA decentralized exchange (DEX) enables users to trade crypto assets through\nblockchain transactions without the need for a custodian or centralized\nintermediary.\n\n **A DEX (decentralized exchange) is a peer-to-peer marketplace where users\ncan trade cryptocurrencies in a non-custodial manner without the need for an\nintermediary to facilitate the transfer and custody of funds.** DEXs\nsubstitute intermediaries—traditionally, banks, brokers, payment processors,\nor other institutions—with blockchain-based smart contracts that facilitate\nthe exchange of assets.\n\nCompared to traditional financial transactions, which are opaque and run\nthrough intermediaries who offer extremely limited insight into their actions,\nDEXs offer complete transparency into the movement of funds and the mechanisms\nfacilitating exchange. In addition, as user funds don’t pass through a third\nparty’s cryptocurrency wallet during trading, DEXs reduce counterparty risk\nand can decrease systemic centralization risks in the cryptocurrency\necosystem.\n\nDEXs are a cornerstone of decentralized finance (DeFi) and serve as a key\n“money LEGO” upon which more sophisticated financial products can be built as\na result of permissionless composability.  \n  \n\n_The swift growth of DEX spot volume. (_ _Source_ _)_\n\nThis article outlines how decentralized exchanges work, the different types of\nDEX, and the benefits and risks they bring to the cryptocurrency ecosystem.\n\n## How Does a DEX Work?\n\nThere are several DEX designs, each offering a different benefits and trade-\noffs in terms of feature-sets, scalability, and decentralization. The two most\ncommon types are order book DEXs and automated market makers (AMMs). DEX\naggregators, which parse through multiple DEXs on-chain to find the best price\nor lowest gas cost for the user’s desired transaction, are also a widely used\ncategory.\n\nOne of the main benefits of DEXs is the high degree of determinism achieved by\nusing blockchain technology and immutable smart contracts. Whereas in\ncentralized exchanges (CEXs), such as Coinbase or Binance, the platform\nfacilitates trading using the internal matching engine of the exchange, DEXs\nexecute trades through smart contracts and on-chain transactions. Furthermore,\nDEXs allow users to maintain full custody of their funds via their self-hosted\nwallets during trading.\n\nDEX users are typically required to pay two types of fees—network fees and\ntrading fees. Network fees refer to the gas cost of the on-chain transaction\nwhile trading fees are collected by the underlying protocol, its liquidity\nproviders, token holders, or a combination of these entities as specified by\nthe design of the protocol.\n\nThe vision behind many DEXs is to have permissionlessly accessible, end-to-end\non-chain infrastructure with no central points of failure and decentralized\nownership across a community of distributed stakeholders. This typically means\nprotocol administrative rights are governed by a decentralized autonomous\norganization (DAO), made up of a community of stakeholders, which votes on key\nprotocol decisions.\n\nHowever, maximizing the decentralization of the protocol while keeping it\ncompetitive in a crowded DEX landscape isn’t an easy feat, as the core\ndevelopment team behind the DEX is generally able to make more informed\ndecisions about mission-critical protocol functionality than a distributed set\nof stakeholders. Even so, many DEXs opt for a distributed governance structure\nin an attempt to increase censorship resistance and long-term resiliency.\n\n### Order Book DEXs\n\nAn order book—a real-time collection of open buy and sell orders in a\nmarket—is a foundational pillar of electronic exchanges. Order books allow an\nexchange’s internal systems to match buy and sell orders.\n\nFully on-chain order book DEXs have been historically less common in DeFi, as\nthey require every interaction within the order book to be posted on the\nblockchain. This requires either far higher throughput than most current\nblockchains can handle or significant compromises in network security and\ndecentralization. As such, early examples of order book DEXs on Ethereum had\nlow liquidity and suboptimal user experience. Even so, these exchanges were a\ncompelling proof of concept for how a DEX could facilitate trading using smart\ncontracts.\n\nWith scalability innovations such as layer-2 networks like optimistic rollups\nand ZK-rollups and the launch of higher-throughput and app-specific\nblockchains, on-chain order book exchanges have become more feasible and now\nattract a considerable amount of trading activity. Additionally, hybrid order\nbook designs have become more popular, where the order book management and\nmatching processes take place off-chain while the settlement of trades occurs\non-chain.  \n\nSome popular order book DEXs include 0x, dYdX, Loopring DEX, and Serum.\n\n### Automated Market Makers (AMMs)\n\nAutomated market makers are the most widely used type of DEX as they enable\ninstant liquidity, democratized access to liquidity provision, and—in many\ncases—permissionless market creation for any token. An AMM is essentially a\nmoney robot that is always willing to quote a price between two (or more)\nassets. Instead of an order book, an AMM utilizes a liquidity pool that users\ncan swap their tokens against, with the price determined by an algorithm based\non the proportion of tokens in the pool.\n\nSince they’re always able to quote a price for a user, AMMs enable instant\naccess to liquidity in markets that otherwise may have lower liquidity. In the\ncase of an order book DEX, a willing buyer has to wait for their order to be\nmatched with the order of a seller—even if the buyer posts their order to the\n“top” of the order book close to the current price, the order may never\nexecute.\n\nIn the case of an AMM, the exchange rate is determined by a smart contract.\nUsers can get instant access to liquidity, while liquidity providers\n(depositors into the AMM’s liquidity pool) can earn passive income via trading\nfees. This combination of instant liquidity and democratized access to\nliquidity provision has enabled an explosion of new tokens being launched\nthrough AMMs and unlocked new designs that focus on distinct use cases, such\nas stablecoin swaps. If you’d like a more detailed exploration of AMMs, read\nthis post covering how AMMs work.\n\nWhile most current AMM designs deal with cryptocurrencies, AMMs could also be\nused to facilitate swaps of NFTs, tokenized real-world assets, carbon credits,\nand much more.\n\nSome popular AMM DEXs include Bancor, Balancer, Curve, PancakeSwap, Sushiswap,\nTrader Joe, and Uniswap.\n\n## What Are the Benefits of Decentralized Exchanges?\n\nSince DEX trades are facilitated by deterministic smart contracts, they carry\nstrong guarantees that they will execute in exactly the manner the user\nintended, without the intervention of centralized parties. In contrast to the\nopaque execution methods and potential for censorship present in traditional\nfinancial markets, DEXs offer strong execution guarantees and increased\ntransparency into the underlying mechanics of trading.\n\nIn this video, Sergey Nazarov, co-founder of Chainlink, discusses how the need\nfor cryptographically enforced guarantees is increasing the demand for\ndecentralized infrastructure:  \n\n\n\nAs there are no custodians involved and users can participate using their\nself-hosted wallets, DEXs reduce counterparty risk. DEXs can also reduce some\nof the systemic risks of the blockchain industry by reducing the amount of\ncapital concentrated in the wallets of a small number of centralized\nexchanges. In 2014, the Mt. Gox centralized exchange handled a significant\nportion of all Bitcoin trading volume before it abruptly ceased operations\namid the loss of hundreds of thousands of bitcoin.\n\nDEXs also help increase financial inclusion. While there have been cases of\nspecific user interfaces limiting access based on geographic location or other\nfactors, accessing a DEX’s smart contracts only requires an Internet\nconnection and a compatible self-hosted wallet. As users are able to sign in\nin a straightforward manner using their wallet address, the onboarding process\nfor a DEX is seamless and practically instantaneous compared to a centralized\nexchange.\n\n## DEX Risks and Considerations\n\nDEXs have democratized access to trading and liquidity provision through\nstrong execution guarantees, increased transparency, and permissionless\naccess. However, DEXs also carry a set of risks, which include but are not\nlimited to:\n\n  * Smart contract risk—Blockchains are considered highly secure for executing financial transactions. However, the code quality of a smart contract is nevertheless dependent on the skill level and experience of team that developed it. Smart contract bugs, hacks, vulnerabilities, and exploits can occur, leaving DEX users susceptible to a loss of funds. Developers can mitigate this risk through security audits, peer-reviewed code, and sound testing practices, but diligence is always required.\n  * Liquidity risk—While DEXs are becoming increasingly popular, some DEX markets have poor liquidity conditions, leading to large amounts of slippage and a suboptimal user experience. Due to how the network effects of liquidity works (high liquidity attracts more liquidity, low liquidity attracts less liquidity), significant portions of trading activity is still conducted on centralized exchanges, which often leads to less liquidity on DEX trading pairs.\n  * Frontrunning risk—Due to the public nature of blockchain transactions, DEX trades may be frontrun by arbitrageurs or maximal extractable value (MEV) bots trying to siphon value from unwitting users. Similar to high-frequency traders in traditional markets, these bots try to exploit market inefficiencies by paying higher transaction fees and optimizing network latency to exploit ordinary users’ DEX trades.\n  * Centralization risk—While many DEXs aim to maximize their decentralization and censorship resistance, points of centralization can still be present. These include the DEX’s matching engine being hosted on centralized servers, the development team having administrative access to the DEX’s smart contracts, and the use of low-quality token bridging infrastructure among others.\n  * Network risk—As the exchange of assets is facilitated by a blockchain, using a DEX may be prohibitively expensive or outright impossible if the network experiences congestion or downtime, leaving DEX users susceptible to market movements.\n  * Token risk—As many DEXs feature permissionless market creation—the ability for anyone to create a market for any token—the risks of buying low-quality or malicious tokens can be higher than in centralized exchanges. DEX users need to consider the risks associated with participating in early-stage projects.\n\nIn addition to the above, some users may find having full custody of their\nprivate keys a daunting prospect. While having full control over one’s assets\nis one of the main benefits offered by the Web3 vision, many users may prefer\nto have a third party entrusted with the custody of their assets. However,\nfollowing good security and key management practices can allow more users to\nenjoy the benefits of maintaining full control over their assets while\naccessing a sophisticated ecosystem of open-source financial services.\n\n## How DEXs Can Use Chainlink To Help Increase Security and Unlock Advanced\nFeatures\n\nDEXs can use Chainlink oracle services to increase the resiliency of their\nprotocol and introduce advanced features that users may be familiar with from\ncentralized infrastructure.\n\nChainlink Price Feeds provide accurate, secure, and reliable financial market\ndata on cryptocurrencies, commodities, forex, indices, and more, and help\nsecure tens of billions of dollars for DeFi applications across the multi-\nchain ecosystem. Using Chainlink decentralized oracle networks, dApps are able\nto retrieve off-chain price data in a simple, secure, and decentralized manner\nand execute actions based on that data.\n\nDEX protocols can use Chainlink Price Feeds for reliable price conversions,\naccurate display prices on a frontend, or the secure calculation of staking\nrewards and fee distributions to stakeholders. On DEXs involving margin or\nfutures contracts, Price Feeds can help ensure the correct pricing of\ncollateral assets and the accurate processing of liquidations.\n\nChainlink Price Feeds can also be used as an additional backstop by DEXs\nlooking to increase the resilience of their protocol to outlier market events,\nwhich a battle-tested source of price data can help protect against. Secure\nprice infrastructure can also help ensure the security and accuracy of price\nmonitoring and financial analysis infrastructure, and help create and manage\narbitrage strategies between different decentralized exchanges.\n\nChainlink Automation, a decentralized automation solution, is also widely used\nin the DeFi ecosystem to support the introduction of sophisticated features\nthrough end-to-end smart contract automation. Chainlink Automation uses\ndecentralized and reliable off-chain computation to monitor user-defined\nconditions and then call on-chain functions once those conditions are\nsatisfied.\n\nChainlink Automation can trigger limit orders when asset prices cross\npredefined price points, empowering traders to have more granular control of\ntheir portfolios and saving development teams time and resources that they can\nthen spend improving the core business logic of their protocol. Chainlink\nAutomation can also be used to reliably perform the periodic distribution of\ntrading fees and staking rewards.\n\n## Conclusion\n\nDEXs are a foundational pillar of the cryptocurrency ecosystem, letting users\nexchange digital assets in a peer-to-peer manner without the need for\nintermediaries. DEXs have experienced increasing adoption in the last few\nyears due to the instant liquidity they can enable for newly launched tokens,\ntheir seamless onboarding experience, and the democratized access to trading\nand liquidity provision they provide.\n\nIt remains to be seen if the majority of trading activity will migrate to DEXs\nand whether current DEX designs will support long-term growth and\ninstitutional adoption. However, DEXs are expected to remain vital\ninfrastructure for the cryptocurrency ecosystem and will continue to see\nimprovements in transaction scalability, smart contract security, governance\ninfrastructure, and user experience.\n\nIf you are a DeFi developer and want to integrate Chainlink, check out our\ndocumentation, ask a question in Discord, or set up a call with an expert.\n\nShare\n\n## Related articles  \n\nWhat Are Stablecoins?\n\nDeFi’s Permissionless Composability is Supercharging Innovation\n\nWhat Is a Decentralized Money Market?\n\nUnlocking Synthetic Derivatives With Chainlink Oracles\n\nUnderstanding Proof of Reserves\n\nWhat Are Automated Market Makers (AMMs)?\n\nWhat Are Flash Loans?\n\n## Learn more about blockchain technology\n\n### Cross-Chain\n\nSee how cross-chain solutions enable a new frontier of dApp functionality.\n\n### DeFi\n\nTake a deep dive into the burgeoning decentralized financial system.\n\n### Metaverse\n\nExplore what’s possible in the metaverse and how you can visit it.\n\n### NFTs\n\nDiscover how to create NFTs and make them dynamic using oracles.\n\n### Oracles\n\nUncover why blockchains need oracles and how they power Web3.\n\n### Smart Contracts\n\nLearn what smart contracts are and how you can build them.\n\n### Web3\n\nDiscover the next step in the evolution of the Internet.\n\n## Get the latest Chainlink content straight to your inbox.\n\nEmail Address\n\nYes, I agree to receive email communications from Chainlink.\n\nThank you for signing up! Please check your inbox to confirm your\nsubscription.\n\nOops! Something went wrong while submitting the form. Please try again\n\n### Developers\n\n  * Docs\n  * Faucets\n  * Developer Hub\n  * Developer Experts\n\nAPPLY\n\n  * Chainlink Hackathon\n  * Bootcamp\n  * Use Cross-Chain (CCIP)\n  * Use Data Feeds\n  * Use Randomness (VRF)\n  * Use Automation\n  * Use Functions\n  * Node Operators\n\n### Products\n\n  * Cross-Chain\n  * Data Streams\n  * Market and Data Feeds\n  * Functions\n  * VRF\n  * Automation\n  * Proof of Reserve\n\n### Use Cases\n\n  * Overview\n  * Financial Services\n  * DeFi\n  * Gaming\n  * NFT Collectibles\n  * Climate Markets\n  * Enterprise\n  * Insurance\n\n### Community\n\n  * Community Overview\n  * Grant Program\n  * Events\n  * Become an Advocate\n  * Code of Conduct\n\n### Resources\n\n  * Whitepaper\n  * Case Studies\n  * Tech Talks\n  * Blog\n  * Economics 2.0\n  * Staking\n  * FAQs\n  * Education Hub\n  * What Is DeFi?\n  * What Is an Oracle?\n  * What Is a Smart Contract?\n  * What Is an NFT?\n  * What Is Web3?\n\n### Chainlink\n\n  * Ecosystem\n  * Data Providers\n  * Press\n  * Team\n  * Circulating Supply \n  * Careers\n\nWE ARE HIRING!\n\n  * Brand Assets\n  * Chainlink Badging\n\n### Contact\n\n  * Talk to an Expert\n  * Security\n  * Support\n  * Custom Chainlinks\n  * Press Inquiries\n\n### Social\n\n  * Twitter\n  * YouTube\n  * Discord\n  * Telegram\n  * WeChat\n  * Reddit\n  * Kakao\n\nHome\n\nChainlink®\n\n© 2023 Chainlink Foundation\n\nen\n\nZH\n\nPrivacy PolicyTerms of Service\n\n  * \n\n",
    "links": "[{\"link\": \"https://chain.link/developer-resources\", \"text\": \"Developers\"}, {\"link\": \"https://chain.link/developers/experts\", \"text\": \"\"}, {\"link\": \"https://chain.link/cross-chain\", \"text\": \"\"}, {\"link\": \"https://chain.link/data-streams\", \"text\": \"\"}, {\"link\": \"https://chain.link/data-feeds\", \"text\": \"\"}, {\"link\": \"https://chain.link/proof-of-reserve\", \"text\": \"\"}, {\"link\": \"https://chain.link/functions\", \"text\": \"\"}, {\"link\": \"https://chain.link/automation\", \"text\": \"\"}, {\"link\": \"https://chain.link/vrf\", \"text\": \"\"}, {\"link\": \"https://chain.link/use-cases\", \"text\": \"Use Cases\"}, {\"link\": \"https://chain.link/use-cases\", \"text\": \"\"}, {\"link\": \"https://chain.link/use-cases/financial-services\", \"text\": \"\"}, {\"link\": \"https://chain.link/use-cases/defi\", \"text\": \"\"}, {\"link\": \"https://chain.link/use-cases/gaming\", \"text\": \"\"}, {\"link\": \"https://chain.link/use-cases/nft-collectibles\", \"text\": \"\"}, {\"link\": \"https://chain.link/use-cases/climate-markets\", \"text\": \"\"}, {\"link\": \"https://chain.link/use-cases/enterprise\", \"text\": \"\"}, {\"link\": \"https://chain.link/use-cases/insurance\", \"text\": \"\"}, {\"link\": \"https://chain.link/ecosystem\", \"text\": \"Ecosystem\"}, {\"link\": \"https://chain.link/ecosystem\", \"text\": \"\"}, {\"link\": \"https://chain.link/ecosystem/data-providers\", \"text\": \"\"}, {\"link\": \"https://chain.link/community\", \"text\": \"Community\"}, {\"link\": \"https://chain.link/community\", \"text\": \"\"}, {\"link\": \"https://chain.link/community/grants\", \"text\": \"\"}, {\"link\": \"https://chain.link/community/events\", \"text\": \"\"}, {\"link\": \"https://chain.link/whitepaper\", \"text\": \"\"}, {\"link\": \"https://chain.link/case-studies\", \"text\": \"\"}, {\"link\": \"https://chain.link/techtalks\", \"text\": \"\"}, {\"link\": \"https://chain.link/faqs\", \"text\": \"\"}, {\"link\": \"https://chain.link/education\", \"text\": \"\"}, {\"link\": \"https://chain.link/economics\", \"text\": \"\"}, {\"link\": \"https://chain.link/economics/staking\", \"text\": \"\"}, {\"link\": \"https://chain.link/economics/build-program\", \"text\": \"\"}, {\"link\": \"https://chain.link/education\", \"text\": \"Education\"}, {\"link\": \"https://chain.link/education-hub/stablecoins\", \"text\": \"What Are Stablecoins?\"}, {\"link\": \"https://chain.link/education-hub/permissionless-composability\", \"text\": \"DeFi’s Permissionless Composability is Supercharging Innovation\"}, {\"link\": \"https://chain.link/education-hub/decentralized-money-markets\", \"text\": \"What Is a Decentralized Money Market?\"}, {\"link\": \"https://chain.link/education-hub/synthetic-derivatives\", \"text\": \"Unlocking Synthetic Derivatives With Chainlink Oracles\"}, {\"link\": \"https://chain.link/education-hub/proof-of-reserves\", \"text\": \"Understanding Proof of Reserves\"}, {\"link\": \"https://chain.link/education-hub/what-is-an-automated-market-maker-amm\", \"text\": \"What Are Automated Market Makers (AMMs)?\"}, {\"link\": \"https://chain.link/education-hub/flash-loans\", \"text\": \"What Are Flash Loans?\"}, {\"link\": \"https://chain.link/education/cross-chain\", \"text\": \"\"}, {\"link\": \"https://chain.link/education/defi\", \"text\": \"\"}, {\"link\": \"https://chain.link/education/metaverse\", \"text\": \"\"}, {\"link\": \"https://chain.link/education/nfts\", \"text\": \"\"}, {\"link\": \"https://chain.link/education/blockchain-oracles\", \"text\": \"\"}, {\"link\": \"https://chain.link/education/smart-contracts\", \"text\": \"\"}, {\"link\": \"https://chain.link/education/web3\", \"text\": \"\"}, {\"link\": \"https://chain.link/developers/experts\", \"text\": \"Developer Experts\"}, {\"link\": \"https://chain.link/hackathon\", \"text\": \"Chainlink Hackathon\"}, {\"link\": \"https://chain.link/bootcamp\", \"text\": \"Bootcamp\"}, {\"link\": \"https://chain.link/cross-chain\", \"text\": \"Cross-Chain\"}, {\"link\": \"https://chain.link/data-streams\", \"text\": \"Data Streams\"}, {\"link\": \"https://chain.link/data-feeds\", \"text\": \"Market and Data Feeds\"}, {\"link\": \"https://chain.link/functions\", \"text\": \"Functions\"}, {\"link\": \"https://chain.link/vrf\", \"text\": \"VRF\"}, {\"link\": \"https://chain.link/automation\", \"text\": \"Automation\"}, {\"link\": \"https://chain.link/proof-of-reserve\", \"text\": \"Proof of Reserve\"}, {\"link\": \"https://chain.link/use-cases\", \"text\": \"Overview\"}, {\"link\": \"https://chain.link/use-cases/financial-services\", \"text\": \"Financial Services\"}, {\"link\": \"https://chain.link/use-cases/defi\", \"text\": \"DeFi\"}, {\"link\": \"https://chain.link/use-cases/gaming\", \"text\": \"Gaming\"}, {\"link\": \"https://chain.link/use-cases/nft-collectibles\", \"text\": \"NFT Collectibles\"}, {\"link\": \"https://chain.link/use-cases/climate-markets\", \"text\": \"Climate Markets\"}, {\"link\": \"https://chain.link/use-cases/enterprise\", \"text\": \"Enterprise\"}, {\"link\": \"https://chain.link/use-cases/insurance\", \"text\": \"Insurance\"}, {\"link\": \"https://chain.link/community\", \"text\": \"Community Overview\"}, {\"link\": \"https://chain.link/community/grants\", \"text\": \"Grant Program\"}, {\"link\": \"https://chain.link/community/events\", \"text\": \"Events\"}, {\"link\": \"https://chain.link/community/advocates\", \"text\": \"Become an Advocate\"}, {\"link\": \"https://chain.link/code-of-conduct\", \"text\": \"Code of Conduct\"}, {\"link\": \"https://chain.link/whitepaper\", \"text\": \"Whitepaper\"}, {\"link\": \"https://chain.link/case-studies\", \"text\": \"Case Studies\"}, {\"link\": \"https://chain.link/techtalks\", \"text\": \"Tech Talks\"}, {\"link\": \"https://chain.link/economics\", \"text\": \"Economics 2.0\"}, {\"link\": \"https://chain.link/economics/staking\", \"text\": \"Staking\"}, {\"link\": \"https://chain.link/faqs\", \"text\": \"FAQs\"}, {\"link\": \"https://chain.link/education\", \"text\": \"Education Hub\"}, {\"link\": \"https://chain.link/education/defi\", \"text\": \"What Is DeFi?\"}, {\"link\": \"https://chain.link/education/blockchain-oracles\", \"text\": \"What Is an Oracle?\"}, {\"link\": \"https://chain.link/education/smart-contracts\", \"text\": \"What Is a Smart Contract?\"}, {\"link\": \"https://chain.link/education/nfts\", \"text\": \"What Is an NFT?\"}, {\"link\": \"https://chain.link/education/web3\", \"text\": \"What Is Web3?\"}, {\"link\": \"https://chain.link/ecosystem\", \"text\": \"Ecosystem\"}, {\"link\": \"https://chain.link/ecosystem/data-providers\", \"text\": \"Data Providers\"}, {\"link\": \"https://chain.link/press\", \"text\": \"Press\"}, {\"link\": \"https://chain.link/team\", \"text\": \"Team\"}, {\"link\": \"https://chain.link/circulating-supply\", \"text\": \"Circulating Supply \"}, {\"link\": \"https://chain.link/brand-assets\", \"text\": \"Brand Assets\"}, {\"link\": \"https://chain.link/badge\", \"text\": \"Chainlink Badging\"}, {\"link\": \"https://chain.link/contact\", \"text\": \"Talk to an Expert\"}, {\"link\": \"https://chain.link/security\", \"text\": \"Security\"}, {\"link\": \"https://chain.link/privacy-policy\", \"text\": \"Privacy Policy\"}, {\"link\": \"https://chain.link/terms\", \"text\": \"Terms of Service\"}]"
}