{
    "summary": "  * Home\n  * News\n    * News\n      * Business\n      * Tech\n      * Editorial\n      * Press Releases\n      * Events\n      * Interviews\n      * Videos\n  * Authors\n  * Conferences\n  * Blockchain 101\n    * Bitcoin 101\n  * Ventures\n  * Events\n\nSUBSCRIBE Buy BSV\n\n____\n\nCG\n\n__\n\n  * __\n  * __\n  * __\n  * __\n  * __\n  * __\n  * __\n  * __\n  * __\n\n____\n\n  * \n\nHome » Editorial » A Case for DEX on Bitcoin\n\n# A Case for DEX on Bitcoin\n\nEditorial 30 January 2022\n\nGuest Contributor  \n  \n---  \n  \n _This post originally appeared on the ZeMing M. Gao’swebsite, and we\nrepublished with permission from the author. Read the full piece here._\n\nAlthough not a firm believer of decentralized finance (DeFi) and decentralized\nexchange (DEX) in their present forms in a general sense, I find it worthwhile\nto share the following truth:\n\n **Superior DEX can be built on Bitcoin blockchain.**\n\nFor most people, it is a big surprise to hear that a decentralized exchange\n(DEX) can be, and already has been, built on Bitcoin blockchain; and it meets\nwith incredulity and ridicule when you say that DEX built on Bitcoin\nblockchain is superior to any other DEXs.\n\nMost people today are still living with ignorant falsehood such as “Bitcoin is\nnot Turing complete,” or “Bitcoin does not support smart contracts.”\n\nBut Bitcoin was Turing complete from the very beginning, and Bitcoin has\nalways had smart contract capabilities. And Bitcoin can do not just DEX, but\nin fact superior DEX.\n\n **DeFi & DEX**\n\nAs part of the DeFi (decentralized finance) movement, decentralized exchanges\n(DEX) have had explosive developments in the recent years, and taken the\ndigital currency market by storm. Uniswap, for example, rose to a market cap\nof $15 billion from nothing in just two short years.\n\nThe premise of DEX is to facilitate peer-to-peer trading without the support\nof a centralized intermediary in its ordinary sense. While centralized\nexchanges such as Binance have been also working on a type of DEXs which are\norder-book-based, a new type of DEXs that employ liquidity pool protocols to\neffectuate AMM (automated market maker) and to allow swaps have attracted more\nattention. Uniswap, PancakeSwap, and SushiSwap are this type of DEXs, and have\nall achieved multibillion-dollar valuations on the digital currency market.\n\nMost of the swap DEXs grew from and have been built on the Ethereum\nblockchain. It is a result of a historical misunderstanding of Bitcoin\nblockchain. The misunderstanding is a result of a persistent propaganda based\non intentionally misleading disinformation. And the same misunderstanding led\nto the creation of Ethereum in the first place, when everything Ethereum\npurported to do could have been done on Bitcoin, only better.\n\nAt least in a technical sense, the true Bitcoin blockchain according to\nSatoshi Nakamoto’s original design (Bitcoin Satoshi Vision, or BSV) supports\nfundamentally better DeFi or DEX. This is because of, not in spite of, the\ncharacteristics of Bitcoin blockchain.\n\n **This is already happening with  ** **TokenSwap** **.**\n\n **TokenSwap**\n\nTokenSwap is a liquidity pool type swap exchange based on the BSV blockchain.\nAll transactions are on-chain, layer-1 (L1), enabled by smart contracts coded\nusing sCrypt, an advanced programming language built on top of Bitcoin\nscripts. The platform started in September 2021.\n\nOn its website, TokenSwap lists numerous advantages, including:\n\n  * Funds kept in non-custodial wallet\n  * Onchain trading\n  * 0 confirmation on deposit/instant deposit\n  * Instant withdrawal\n  * 0 withdrawal fee\n  * Unlimited TPS (compared with ETH)\n  * Free from exchange hacks because of account information leakage\n  * Free of unplug, manipulation from exchanges that fake or delete user data for their own favor\n  * No front-running, which happens on ETH DEXs that causes loss to users\n  * Instant matching between users or user-pool with low fees, instant settlement\n\nTokenSwap on TokenSwap — AMM DEX running on BSV (tswap.io)\n\nMost if not all of the advantages described by TokenSwap are real. TokenSwap\nis BSV-based on-chain swaps. Its advantages over central exchanges (CEX) are\nobvious. But when compared with other decentralized exchanges (DEX),\nespecially AMM swaps (like Uniswap), it is less obvious.\n\n **Key advantages of TokenSwap over other Layer-1 (L1) swaps:**\n\n **1\\. Better economics**\n\nDue to the much lower on-chain transaction fees on BSV blockchain, it is much\nless costly to do small amount transactions on TokenSwap, and this tends to\ntranslate to higher trading volumes, which in turn has potential to lead to\nmore sophisticated trading systems.\n\nThere are two different kinds of fee involved in making a trading transaction.\nOne is the trading commission, which is usually a fixed percentage and\ncomparable among all the DEX exchanges, including TokenSwap. The other is an\non-chain transaction fee, or sometimes called “network fee”, charged by the\nunderlying blockchain (more specifically by miners).\n\nThe trading commission (fee) is charged by the trading platform and is usually\nin the range of 0.2% to 0.3%, with little differentiation among different DEX\nplatforms.\n\nThe network fee, however, is vastly different on BSV and other chains.\n\nEven with large complex Sensible Contracts coded in sCrypt not optimized to\nreduce the script size, the fee per transaction on BSV chain is under $0.10\n(and the fee is trending further lower both because of the contract script\nsize optimization and BSV’s constantly diminishing network fees per byte).\nCompared to most other chains such as Ethereum which typically costs more than\n$10 per transaction, this part is almost negligible on BSV.\n\nIf you’re making a fairly large transaction, say $1000, $10,000 or above, the\ndifference is minimal percentage-wise, as most people probably wouldn’t mind\nor even notice a $10 fee for $10,000 transaction which is 0.1%. But if you’re\nmaking transactions less than $100, the difference is quite large. A $10 fee\nfor a $100 trade is 10%.\n\nThis difference in fees means that TokenSwap users are more likely to make\nfrequent small amount transactions on its trading platform. This, in turn,\nmeans that the level of transaction volumes per unit locked asset value on\nTokenSwap is likely to be able to achieve a much higher level than that of\nhigh-fee L1 swaps.\n\nThe potential impact of significantly lower transaction fees may go far beyond\nmere user cost savings and higher transaction volumes. History tells us that\nlower transaction fees is the most fundamental mechanism or catalyst for deep\nchanges in business models. Advanced automation, even AI assisted processes,\nwould be enabled with low transaction fees but would not be possible with high\ntransaction fees. Low transaction fee opens up new doors and even creates new\nfields of development.\n\n **2\\. Frontrunning prevention**\n\nAnother important advantage of BSV-based TokenSwap over other L1 swaps is that\nit has a mechanism to prevent  **frontrunning.**\n\nFrontrunning is an extremely detrimental loophole on almost all DEXs. It\nhappens when someone observes another person’s pending order and takes\nadvantage of the order by submitting a frontrunning order which is executed\nbefore the other pending order by making a higher fee bidding for faster\nprocessing. It is also rather unique to DEXs, because, at least in theory,\nCEXs can hide the orders from the public, but DEXs cannot, as transparent on-\nchain information is characteristic of any public blockchain.\n\nOn CEXs facilitated by an intermediary, frontrunning is illegal because\nusually it is the party that has fiduciary duty that sees another party’s\norders. It is suspected that on digital currency CEXs, illegal frontrunning\ndoes happen anyway (if it even happens on stock brokerages which are strictly\nregulated, it does not require a stretch of imagination for this to happen\nmore easily on digital currency CEXs that have thrived due to a lack of\nregulation and compliance), but at least people know it is illegal and\ntherefore suppose it does not happen regularly.\n\nOn DEX, however, because the order information is public, frontrunning is not\nonly possible, but could even be legal.\n\nBut TokenSwap is different, because BSV is different:\n\nBSV blockchain processes transactions on the first-seen basis, and the order\nof processing cannot be changed by fee bidding, thus preventing frontrunning.\nWith BSV, miners still require the transaction fees to meet their minimum (or\nthe transactions may be ignored), but as long as the transactions meet miners\nfee requirement, they get in sequentially.\n\nYou might ask why couldn’t other chains implement the same policy. Well, it\nreally is not up to them when their chain has frequent congestion problems.\nFee bidding is a necessary mitigation measure for alleviating the congestion\nproblem for chains such as Ethereum. It’s the reality, and one cannot have it\nboth ways. To put it shortly, when you have an inadequate chain, you may hide\nit somewhat by playing tricks, but you can’t make the deficiency disappear by\nmagic. It always comes back one way or another.\n\nAt the same time, BSV enables instant matching between users or user-pool with\ninstant settlement, leaving no room for frontrunning. Again, this is not\npossible with a blockchain such as Ethereum.\n\n **Advantages of TokenSwap over Layer-2 (L2) swaps:**\n\nLayer-2 (L2) DEX is different, in that a DEX based on a L2 solution will be\nable to reduce the fees significantly.\n\nHowever, the problems of L2 solutions are fundamental:  **it is not\nblockchain**. They just pretend to be blockchain. Having started with a\nblockchain that has failed to provide a real solution, it creates an off-chain\nsolution but associates itself with blockchain in name, in order to ride on\nthe market tide created by the blockchain hype.\n\nThis is not to say that L2 is completely useless in principle. But the truth\nis that, other than high-frequency data or content streaming applications, one\ncan hardly think of any L2 applications that are necessary  **when a public\nblockchain that can provide truly scalable Layer-1 (L1) solutions already\nexists**.\n\nL2 is always a compromise. People who don’t see this should ask themselves a\nvery simple question: why inventing blockchain in the first place at all? If\nL2 could be a good solution, the existing non-blockchain technologies such as\ndistributed databases would have all the answers that are not only just as\ngood but in fact also enjoy a far more mature and established ecosystem, so\nthere would be absolutely no need for blockchain.\n\nTo put it simply, any transaction that needs to be, or should be,  **atomic**\n, or potentially needs to be  **distinctively identified (for accounting or\nauditing purposes for example)** , should be on chain, otherwise there would\nbe no need of blockchain technology in the first place. Placing these types of\ntransactions on L2 is dishonesty.\n\nAnd trading transactions are certainly this type of transactions.\n\nHigh-frequency data or content streaming applications are the only exceptions\nthat would justify L2 solutions such as payment channels.\n\n(Note, I’m talking about transactions not tokens themselves here, as they are\ndifferent things. There can be a strong case made for L2 tokens for many\ncommercial applications, and that is what Tokenized.com is doing, but that’s a\nwhole different subject.)\n\n **But BSV?  Bitcoin?**\n\nWait, the title says “Bitcoin,” but you talk about BSV?\n\nWell, in short, BSV (Bitcoin Satoshi Vision) is the only blockchain that is\ntruthful to the original bitcoin design by the Bitcoin inventor Satoshi\nNakamoto, and Satoshi himself is completely behind BSV. Other chains such as\nBTC, BCH are not the true bitcoin.\n\nBitcoin Satoshi Vision (BSV) is the only blockchain that has the following\nproperties:\n\n  * Unbounded scalability (orders of magnitude more scalable, designed to reach TPS in the millions);\n  * Supremely secure and reliable (the only blockchain that has the maximal PoW security track record);\n  * Extremely low cost (orders of magnitude less expensive, at 1/100th of a cent per transaction);\n  * Instantly verifiable transactions (due to UTXO, SPV and verification-before-the-next-chain);\n  * Full smart contract capacity with Turing completeness.\n\nFor more information, please read the following articles on BSV (as serious\ntech/economics studies):\n\n  * BTC and BSV, what is the real difference?\n  * Why BSV is a value creating system, while BTC a value absorbing system?\n  * Proof of Work (PoW) is the only way to prevent corruption\n  * Why I Believe Craig Wright is Most Likely Satoshi\n  * In expectation of the historic Bitcoin trial: Kleiman v. Wright\n\n **Prospects**\n\nDEX on Bitcoin blockchain is just starting. TokenSwap is only two months old\nand still very small. It could fail (this not being a prediction, but just a\nhypothetical). But if TokenSwap fails to make it, somebody else will\neventually do on the BSV blockchain, because the technological advantages are\nenormous.\n\nTokenSwap uses a base trading token TSC to facilitate all trading. Trading\nfees are paid in TSC. TSC tokens are released primarily in the form of farming\npayouts to incentivize early adopters. Liquidity providers who don’t want to\ndo farming do not receive farming payouts, but earn transaction fees.\n\nThe TokenSwap platform now has roughly about $10 million of total assets\nlocked in the pools for trading. Its base trading token TSC has a current\nvaluation (market cap) of around $4 million based on the number of TSC tokens\nalready released and the current TSC token price, and its fully diluted\nvaluation is about $60 million (when all one billion TSC tokens are released\nin about 28 months from now), based on the current TSC token price.\n\nBecause TokenSwap charges 0.25% fees for all trading pairs, of which 0.04%(16%\nof the total fee) will be used to repurchase TSC, and repurchased TSC will be\nburnt, the total number of existing TSC tokens will be less than one billion,\nmaking the TSC valuation more favorable. The actual percentage of TSC that\nwill be burnt depends on the trading volume. The higher the trading volume,\nthe more TSC will be burnt. Therefore, the trading volume has a double-\npositive impact on TSC tokenomics.\n\nGiven the total value of assets locked in the pools for trading, if you assume\nthe level of trading activities  **per unit total asset value**  is comparable\nto the general digital currency market (see below), a rough estimate of the\n**annual  **trading revenue generated from charging transaction fees on\nTokenSwap would be close to $400K, which means a bit over $1000 daily\ntransaction fee. (Note: $1000 daily transaction fee is just a conservative\nestimate, and the actual number is likely higher. TokenSwap team would have a\nmuch better view on the actual transaction volume and resultant fees, and hope\nthey can release such numbers.)\n\nConsidering that the transaction fee is almost pure profit for TSC token\nholders, it easily justifies a current market cap of TSC to be at least  **$8\nmillion, assuming a modest P/E ratio of 20**. And this does not even include\nthe farming payouts, which is far more than the regular transaction fees\nearned by the liquidity providers in the early stages.\n\nHowever, the above uses a traditional fundamental valuation metrics (P/E\nratio) to price TSC token. It is a method frequently used to price traditional\nmature stocks, but no digital currency is actually valued/priced using such\nfundamental valuation metrics.\n\nCompare it directly with the other DEX tokens. One valuation metrics is the\ntoken market cap/daily trading volume ratio. This ratio ranges from 3–10x\n(Uniswap being a 7x). Because an active DEX’s daily transaction volume\ntypically approaches the level of TVL, a DEX token market cap should be 3–10\ntimes that of its TVL. This is what the digital currency market apparently\napplies to listed DEX tokens anyway. Measured by this metrics, the comparable\nmarket cap of TSC would be $30-$100 million, based on just the currently\nrealized numbers instead of any future projections.\n\nThis means that TSC at the current market cap of $4 million is severely\nundervalued. Even if the TVL on the platform does not increase from the\ncurrent level over the next 28 months (which would be a terrible outlook for a\nDEX platform), it would passively reach its fully diluted valuation (see\nabove) based on the current token price, but the valuation could still be\njustified.\n\nBut to be successful, the platform must grow, and its TVL and trading pairs\nand activities increase. And when platform grows, the token price and the\nmarket cap should increase.\n\nThe future of TokenSwap lies on whether the size and volume of the platform\nincreases to match the inflation over the time. The TSC payout is already\nmaxed out according to the 30-month full dilution schedule, so they can’t\nattract new assets to farming by simply increasing payout. In any event,\nfarming incentive payouts is really a temporary bootstrapping strategy, the\neffectiveness of which gradually decreases with time. The platform will need\nto attract more assets and users that want to trade intrinsically (rather than\nthose who join to earn more farming payouts only).\n\nTokenSwap started with BSV related liquidity pool pairs, but is not limited to\ntrading pairs involving BSV coin. Although the technology is based on the BSV\nblockchain, in theory TokenSwap can create unlimited number of liquidity pools\nby bringing any tokens outside of the BSV blockchain to the platform. Any coin\nor token, BTC, ETH or any other tokens including those on Ethereum, can be\nbrought to TokenSwap platform through a token bridge, which is already\noperating and expanding.\n\nThe challenges are in market recognition, as the entire BSV ecosystem suffers\nthe same.  **The truth is not known, yet.**  Even most developers and digital\ncurrency influencers don’t understand this. The words need to be spread. And\nthe outcome of the ongoing lawsuit Kleiman v. Wright will have a positive\nimpact. See: In expectation of the historic Bitcoin trial: Kleiman v. Wright.\n\nEconomics aside, there is also a moral or ethical argument for supporting BSV-\nbased applications such as TokenSwap. It’s utility. It’s truth. It’s honesty.\n\n **Disclaimer/Disclosure** : This is absolutely not financial advice. I am\njust writing to express my own understanding of the system, mostly from a\ntechnical standpoint. I am not a fan in DeFi in general, and not even entirely\nsure of its legality in certain jurisdictions. With regard to TokenSwap\nspecifically, because I am an early supporter and a holder of TSC tokens and\nliquidity pool shares on TokenSwap, my views are biased.\n\n _This article was lightly edited for clarity._\n\nWatch: CoinGeek New York panel, Blockchain for a Better Supply Chain &\nSustainability\n\nframeborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-\nmedia; gyroscope; picture-in-picture; web-share\" allowfullscreen>\n\n ** _New to blockchain? Check out CoinGeek’sBlockchain for Beginners section,\nthe ultimate resource guide to learn more about blockchain technology._**\n\n## Tagged\n\n  * Bitcoin SV\n  * decentralized exchange\n  * decentralized finance\n  * TokenSwap\n\n## Related News\n\nBusiness 18 September 2023\n\n## How Ordinals and BSV blockchain are revolutionizing creative digital art\nand assets\n\nTech 6 June 2023\n\n## Back to Bitcoin basics with Kevin Healy: Fundamentals of the protocol and\nbasic economics\n\nInterviews 25 February 2022\n\n## CoinGeek Weekly Livestream: Paul Rajchgod on the venture capital\nenvironment within BSV space\n\nBusiness 25 February 2020\n\n## CoinGeek London 2020: Josh Petty delves into future of social networks on\nBitcoin\n\nEditorial 25 June 2019\n\n## Debunking TNW: Hard Fork doesn’t understand Bitcoin\n\nBusiness 24 May 2019\n\n## Deconomy panel: BSV ‘in some ways the purest form of Bitcoin’\n\n## latest news\n\nEditorial 3 hours ago\n\n## Free the data!\n\nSocial media CEOs from tech giants like Twitter and Facebook were able to\nbuild some of the greatest wealth (and power) in the world's history by\nselling their users' aggregate data.\n\nEditorial 16 November 2023\n\n## Thoughts on the recent Satoshi Nakamoto posts on X\n\nThe X account of @satoshi has been dubbed fraud by the community hating on Dr.\nCraig Wright, but it cannot be denied that its tweets are rooted in Satoshi's\noriginal Bitcoin protocol.\n\nEditorial 15 November 2023\n\n## Bitcoin must have utility before it can become anything\n\nBTC’s ‘consumption of energy’ has no objective foundation; it is not the\nconsumption of energy that determines the price, but the other way around,\nthat is, BTC price drives its energy consumption.\n\n**Join the official Bitcoin SV Discord channel:  \n**www.discord.gg/bsv\n\n  * About Us\n  * About Calvin Ayre\n  * Our Team\n  * Advertising\n\n  * Privacy Policy\n  * Terms of Use\n  * Cookie Notice\n  * Contact us\n\n* * *\n\n  * __\n  * __\n  * __\n  * __\n  * __\n  * __\n  * __\n  * __\n  * __\n\n__\n\n____\n\n",
    "links": "[]"
}