{
    "summary": "Black Friday Offer | Get up to $50 in Bitcoin with a new Ledger\n\nShop now\n\n  * Shop Ledger \n  * Learn and earn \n\n  * Search __\n  * Glossary \n  * Topics\n    * Blockchain\n    * Crypto\n    * DAOs\n    * DeFi\n    * Economics and Regulation\n    * Ledger solutions\n    * Metaverse\n    * NFTs\n    * Scams\n    * Security\n    * Tutorials\n  * Series\n    * Enter The Donjon\n    * How I Got Hacked\n    * Keep Your Crypto Safe\n    * Ledger How To's\n    * On The Ledger\n    * Reading Room\n    * School of Block\n  * Start learning\n  * English\n    * العربية\n    * 简体中文\n    * Français\n    * Deutsch\n    * Русский\n    * Español\n    * 日本語\n    * 한국어\n    * Türkçe\n    * Português\n\n  * The Classroom __\n    * 1\\. Welcome to Web3\n      * What is Web 3.0?\n      * What Is Blockchain?\n      * Blockchain: Where It Started, Where It’s Going\n      * What Is Cryptocurrency?\n      * How Many Cryptocurrencies Are There?\n    * 2\\. How to secure your crypto\n      * What Is a Private Key?\n      * What Is a Crypto Wallet?\n      * What is a Secret Recovery Phrase?\n      * Crypto Threats: How Crypto Gets Stolen\n    * 3\\. What is Ledger?\n      * What is Ledger? The Ledger Ecosystem Explained\n      * Ledger’s Security Model: How Are Ledger Devices Secured?\n      * Ledger Live App: Buy, Sell, Stake and Swap Crypto\n    * 4\\. Web3 security essentials\n      * Web3 Scams Introduction\n      * Do Your Own Research (DYOR): How to Investigate Crypto Projects\n      * How to Migrate Your Crypto to Ledger\n    * Blockchain Basics\n      * How Does a Blockchain Transaction Work?\n      * Crypto Nodes: What Are They And How Do They Work?\n      * What Is a Mempool?\n      * Consensus Mechanisms: How Blockchains Stay Secure\n    * Buy it, Sell it, Swap it, Earn it\n      * Why Use Ledger Live For Payments and Transactions?\n      * Buying Crypto Through Ledger Live\n      * How To Swap Your Crypto Securely Via Ledger Live\n      * Earn Crypto With Ledger Live: Staking Made Easy\n    * Digital Assets Explained\n      * Crypto Coins and Tokens: Their Use-Cases Explained\n      * What Are Stablecoins?\n      * What Are Memecoins?\n      * Digital Assets Beyond Currency\n    * Wallet Knowledge (Leveling Up)\n      * What Is a Software Wallet?\n      * What Is a Hardware Wallet?\n      * What Is a Cold Wallet?\n      * How To Choose a Crypto Wallet\n  * Topics __\n    * Blockchain\n    * Crypto\n    * DAOs\n    * DeFi\n    * Economics and Regulation\n    * Ledger solutions\n    * Metaverse\n    * NFTs\n    * Scams\n    * Security\n    * Tutorials\n  * Series __\n    * Enter The Donjon\n    * How I Got Hacked\n    * Keep Your Crypto Safe\n    * Ledger How To's\n    * On The Ledger\n    * Reading Room\n    * School of Block\n  * Shop Ledger \n  * Learn and earn \n\n  * Search __\n  * Glossary \n  * English\n    * العربية\n    * 简体中文\n    * Français\n    * Deutsch\n    * Русский\n    * Español\n    * 日本語\n    * 한국어\n    * Türkçe\n    * Português\n\n### Up your Web3 game\n\n## Ledger Academy Quests\n\n  * __ Test your knowledge\n  * __ Earn POK NFTs\n\nPlay now See all quests\n\n__________\n\n  * Ledger Academy  __\n  * DeFi __\n  * ... __\n  * What Is a Decentralized Exchange (DEX)?\n\n# What Is a Decentralized Exchange (DEX)?\n\nBy **Kirsty Moreland**\n\nOct 9, 2020 | **Updated Jun 28, 2023**\n\n__Read 6 min\n\nMedium\n\nSHARE\n\nKEY TAKEAWAYS:  \n---  \n— A Decentralized Exchange (DEX) allows you to trade cryptocurrencies while\nowning your private key, thus keeping control of your crypto  \n  \n— Other advantages of a DEX include lower fees and potentially enhanced\nsecurity  \n  \n— Ledger hardware wallets can be used with many DEXs, while empowering you\nwith the highest security for your private keys  \n  \n_When looking to trade cryptocurrencies, one most often needs to use an\nexchange to do so. However, did you know that there’s two types of exchanges?\nCentralized ones, where you are not in full control of your own crypto, or\nDecentralized ones also known as a DEX. Today, we’re taking a closer look into\nwhat a DEX is and what it brings to the table._\n\nLooking to start your journey into the wondrous world of cryptocurrencies?\nMost likely, you’ll find yourself using a crypto exchange to get your very\nfirst Bitcoin or other crypto of your choosing. After this, that crypto\nexchange can still be pretty useful to you, since you can trade one digital\nasset for another there. For example, you could swap your Ethereum for XRP if\nyou want.\n\nHowever, did you know that the crypto you keep on an exchange is actually not\nin your control?\n\nYou cannot do what you want with your own crypto. The exchange holds a vital\npiece of data: your Private Key. Remember the famous crypto saying _Not your\nkey, not your coins_? Since the exchange holds your key, they own your crypto\nand have control over them.\n\nNow, imagine if there are security issues on the exchange’s platform. We’ve\nseen several of them being hacked for hundreds of millions of dollars over the\nyears. Part of the reason is that these exchanges are _centralized_ : there’s\na single place where their huge crypto wealth is stored – a great target for\nhackers.\n\nThat’s where Decentralized Exchanges come in.\n\n## What Is a Decentralized Exchange (DEX)?\n\nA decentralized exchange – or DEX in short is an exchange where YOU hold your\nkeys. Remember that _Private Key_ we mentioned earlier? With a DEX, you\nactually hold the Private Key. This means you remain in total control of your\nown crypto, and you decide how its security is handled. Also that single point\nof failure we mentioned for normal exchanges? A DEX doesn’t have that:\neveryone keeps their own keys, so the wealth is completely dispersed. It is\n_decentralized_. That said, a DEX doesn’t offer the same services. Let’s dive\ndeeper into it.\n\n## What Is a Decentralized Exchange (DEX) For?\n\nLet’s start with the most important part: How can you hold your Private Key,\nbut still trade your cryptocurrencies for another? Well, with centralized\ncrypto exchanges, you used to have to make an account to log in and use their\nservices. With a DEX, your Private Key counts as your login. Once you log into\nthe DEX with your Private Key, you’ll immediately see your crypto balances.\nYou won’t have to provide any personal information – great for those who value\ntheir privacy!\n\nThis doesn’t mean that a DEX doesn’t come with its own challenges. Let’s go\nover the pros and cons of using a Decentralized Exchange.\n\n## Benefits of Decentralized Exchanges\n\nYou’re probably aware that traditional crypto exchanges handle the swap of one\ndigital currency for another for you. So how’s this different for a DEX?\n\nThey actually don’t handle the exchange itself: it’s purely peer-to-peer. This\nmeans that the platform is basically there to help you trade your crypto with\nsomeone else directly, rather than getting involved in it. Ok, sounds great,\nbut what does this mean for you? Two advantages: 1. You don’t need to trust\n_anyone_ for the trade to take place. 2. The fees paid for the trade are\nusually lower than with normal exchanges.\n\nLastly, let’s talk security. A DEX is decentralized, meaning each individual\nperson keeps their own crypto secure. You don’t have to entrust the security\nof your crypto to someone else – you’re completely in control of it.\n\n_This is a blessing… but can also be a curse if you don’t take this\nresponsibility seriously._\n\n## Risks of Decentralized Exchanges\n\nReading this article, you might be thinking that you prefer to start your\ncrypto journey through a DEX, right? Well… that’s not going to happen\nunfortunately. A DEX is an amazing tool for trading. On the other hand, it\ndoesn’t allow you to buy your crypto currencies there though. There might be a\nfeature to buy crypto on their page, but it’ll be an outside service: it’s not\nactually within the DEX platform itself. Decentralized exchanges only provide\nthe option to trade your crypto assets, not to purchase some with Euros or US\nDollars.\n\nBeing in charge of the security of your private keys can be an amazing thing,\nbut it also means you are completely responsible for it. A problem when using\na DEX is that most methods require you to enter your private keys on a\ncomputer or smartphone. This makes them vulnerable to online attacks.\n\nYou’ll need to first get a good grasp of how you can secure your private keys.\nThe best and easiest way to secure your private keys is with hardware wallets,\nlike the ones we create. We recommend everyone wanting to use a DEX to read\nthis article showing the different ways you can secure your private keys.\n\nLastly, a decentralized exchange is pretty different to use from usual\nexchanges. It’s not as simple as logging in and clicking just two buttons to\ntrade your Bitcoin for Ethereum. Use-cases for a DEX are often a bit limited:\ndue to its complexity, it’s more for advanced users. Also the assets you can\ntrade on a DEX are usually somewhat limited. That said, it can be used to help\ndiversify your crypto portfolio while maintaining ownership and privacy.\n\n## Stay Secure: Access DEXs With Your Ledger\n\nSo the best and easiest way to secure your Private Keys is using a hardware\nwallet. Why? The answer is pretty simple: your computer or smartphone is\nconnected to the internet. This can look completely harmless, though the\nopposite couldn’t be more true. Someone can use this to hack your computer or\nsmartphone and gain access to all the data that’s on it, including your\nprivate keys. If they get access to this, they can steal all of your crypto\nassets.\n\nHardware wallets make sure that your private keys never end up on your PC or\nphone. It remains completely offline, out of reach from hackers.\n\nYou’re probably wondering to yourself: can Ledger devices be used with\ndecentralized exchanges? Well good news: Yes, Ledger hardware wallets can be\nused with multiple DEXs! Back in the beginning of 2019, our devices became the\nfirst hardware wallet that can be used with the famous Binance DEX. The list\nof DEXes that the Ledger Nano X and Ledger Nano S can connect to is endless:\nIDEX, Waves Platform and many more!\n\n_Keep learning! If you enjoy getting to grips with crypto and blockchain,\ncheck out our School of Block video  _Get Rich Quickly In Crypto.\n\n**Kirsty Moreland**  \n\nEditor of Ledger Academy. Writer and researcher of blockchain technology and\nall its use cases. Lover of old music, bikes and finding answers to questions.\n\n**SHARE**\n\nNext up: Not Your Keys, Not Your Coins: Explained\n\n  \n\nRelated Resources\n\nWhat Is Spot Trading in Crypto?\n\n__Read\n\n5 min Medium\n\nWhat is a Centralized Cryptocurrency Exchange (CEX)?\n\n__Read\n\n5 min Beginner\n\nOsmosis DEX Explained\n\n__Read\n\nBeginner\n\nWhat is an Automated Market Maker (AMM)?\n\n__Read\n\n5 min Medium\n\nCrypto On-Ramps and Off-Ramps: What Are They For?\n\n__Read\n\n6 min Beginner\n\nDEX Vs CEX: Which Crypto Exchange Is Best?\n\n__Read\n\n5 min Beginner\n\nWhat is 1inch Network?\n\n__Read\n\n4 min Medium\n\nSelf-Custody: How to Be Your Own Bank\n\n__Read\n\n6 min Beginner\n\nWhat Is Leverage Trading In Crypto?\n\n__Read\n\n6 min Beginner\n\n### Stay in touch\n\nAnnouncements can be found in our blog. Press contact:  \nmedia@ledger.com\n\n  * __\n  * __\n  * __\n  * __\n  * __\n  * __\n  * __\n  * __\n\n### Subscribe to our  \nnewsletter\n\nNew coins supported, blog updates and exclusive offers directly in your inbox\n\n  \n\nEnter your email\n\nRegister to newsletter\n\nYour email address will only be used to send you our newsletter, as well as\nupdates and offers. You can unsubscribe at any time using the link included in\nthe newsletter.\n\nLearn more about how we manage your data and your rights.\n\n__\n\n  * English\n    * العربية\n    * 简体中文\n    * Français\n    * Deutsch\n    * Русский\n    * Español\n    * 日本語\n    * 한국어\n    * Türkçe\n    * Português\n\nCopyright © Ledger SAS. All rights reserved. Ledger, Ledger Stax, Ledger Nano\nS, Ledger Vault, Bolos are registered trademarks of Ledger SAS  \n  \n1 rue du Mail, 75002 Paris, France  \n  \nPayment methods  \n        \n       \n\n  * Products\n    * Ledger Stax\n    * Ledger Nano X\n    * Ledger Nano S Plus\n    * Compare our devices\n    * Bundles\n    * Accessories\n    * All products\n    * Downloads\n\n  * Crypto Assets\n    * Bitcoin wallet\n    * Ethereum wallet\n    * Cardano wallet\n    * XRP wallet\n    * Monero wallet\n    * USDT wallet\n    * See all assets\n\n  * Crypto Services\n    * Crypto Prices\n    * Buy crypto\n    * Staking crypto\n    * Swap crypto\n\n  * For Business\n    * Ledger Enterprise Solutions\n\n  * For Startups\n    * Funding from Ledger Cathay Capital\n\n  * For Developers\n    * The Developer Portal\n\n  * Get started\n    * Start using your Ledger device\n    * Compatible wallets and services\n    * How to buy Bitcoin\n    * Guide before buying bitcoin\n\n  * See also\n    * Support\n    * Bounty program\n    * Resellers\n    * Ledger Press Kit\n    * Affiliates\n    * Status\n    * Partners\n\n  * Careers\n    * Join us\n    * All jobs\n\n  * About\n    * Our vision\n    * Ledger Academy\n    * The company\n    * The people\n    * Diversity\n    * Blog\n\n  * Legal\n    * Sales Terms and Conditions\n    * Website Terms of Use\n    * Ledger Live Terms of Use\n    * Privacy Policy\n    * Cookie Policy\n    * Ledger Warranty\n    * Other\n\n",
    "links": "[{\"link\": \"https://www.ledger.com/reseller\", \"text\": \"Resellers\"}, {\"link\": \"https://www.ledger.com/partners\", \"text\": \"Partners\"}, {\"link\": \"https://www.ledger.com/the-company\", \"text\": \"The company\"}, {\"link\": \"https://www.ledger.com/the-people-behind-ledger\", \"text\": \"The people\"}, {\"link\": \"https://www.ledger.com/blogs\", \"text\": \"Blog\"}]"
}