{
    "summary": "Skip to main content\n\nExclusive news, data and analytics for financial market professionalsLearn\nmore aboutRefinitiv\n\nReuters home\n\n  * World\n\n  * Business\n\n  * Markets\n\n  * Sustainability\n\n  * Legal\n\n  * More\n\nMy View\n\nSign InRegister\n\n  * Future of Money\n\n# Cryptoverse: Let's talk about DEX, baby\n\nBy Medha Singh and Lisa Pauline Mattackal\n\nNovember 22, 202211:18 PM UTCUpdated a year ago\n\n  *   *   * \n\n  *   *   *   *   * \n\nNov 22 (Reuters) - As the crypto castle crumbles, some true believers say the\nanswer is to double down on DEX. Decentralized exchanges, that is.\n\nThe spectacular collapse of Sam Bankman-Fried's FTX, a major centralized\ncrypto exchange, has unleashed a wave of calls for more regulation from\nmainstream bankers and investors.\n\nBy contrast, some crypto players are channeling bitcoin creator Satoshi\nNakamoto's original crypto vision by cutting out the financial middleman and\ntaking to decentralized exchanges, where investors trade peer-to-peer on the\nblockchain.\n\nAdvertisement · Scroll to continue\n\nOn Nov. 10, as FTX imploded, overall daily trading volumes on DEXs including\nthe likes of Uniswap leapt as high as $12 billion, their highest level since\nMay, according to data from market tracker DeFi Llama, though they have since\npared gains.\n\nFour days later, November volumes had surpassed the whole of the month before,\naccording to CryptoCompare.\n\nMeanwhile, weekly bitcoin flows from centralized exchanges, or CEXs, recorded\ntheir largest-ever net outflow, with 97,805 coin moved off platforms in the\nseven days to Nov. 13, CryptoCompare data shows.\n\nAdvertisement · Scroll to continue\n\n\"It is now clear that there can be risk associated with holding assets in a\ncentralized entity,\" said Varun Kumar, CEO of decentralized crypto exchange\nHashflow. \"Data is showing that users are turning to decentralized trading\nsolutions.\"\n\nNonetheless, DEXs are not necessarily safer than their centralized rivals,\nwith inexperienced investors potentially exposed to huge risks.\n\nUsers trade tokens directly with each other using blockchain-based smart\ncontracts instead of passing funds through an intermediary or central\nauthority.\n\nAdvertisement · Scroll to continue\n\nThus, as with other platforms in the world of decentralized finance (DeFi) or\nWeb3, there is no central oversight and - for good or for ill - investors are\nresponsible for their trades, settlements and safe-keeping of coins or tokens.\n\nBy comparison CEXs, such as Coinbase (COIN.O), Binance and FTX, are more akin\nto traditional exchanges on Wall Street, acting as the middleman in\ntransactions, thus making trading more user-friendly especially for new\ninvestors, and sometimes offering coin custody services, as FTX did.\n\nMany centralized players have also been pushing to boost user confidence with\nmeasures to increase transparency, such as demonstrating proof of their\nreserves.\n\nCoinbase, Binance and FTX didn't immediately respond to requests for comment.\n\nReuters Graphics\n\n## FTX SHENANIGANS\n\nThat said, advocates of decentralization say DEXs could offer investors some\nprotection from the kind of shenanigans that appear to have gone on at FTX,\nwhere as much as $1 billion of customer funds are reported missing.\n\nRepresentations of cryptocurrencies plunge into water in this illustration\ntaken, May 23, 2022. REUTERS/Dado Ruvic/Illustration/File Photo  Acquire\nLicensing Rights\n\nDEXs cannot halt withdrawals, they require users to retain custody of their\nfunds, and trading activity and reserves can be traced directly on the\nblockchain.\n\n\"There are definitely elements of DEXs appealing to people as they mitigate\nthe chances of some nefarious operator or a single point of failure in the\nsystem,\" said David Wells, CEO at crypto exchange Enclave Markets, which\noffers elements of both centralized and decentralized services.\n\nThe FTX crash certainly pumped up trading volumes on decentralized exchanges\nat the time.\n\nVolumes at the largest DEX, Uniswap, spiked to $17.2 billion in the week of\nNov. 6-13, from just over $6 billion the week before, while other smaller\ndecentralized exchanges also reported higher volumes.\n\nGMX saw over $6 billion in the week after Nov. 6, when FTX's troubles came to\nlight, three times recent its weekly averages. Hashflow saw $110 million on\nNov. 9, the day Binance dropped a plan to bail out FTX, versus a daily average\nof $25 million.\n\nDespite the recent surge, crypto isn't migrating en masse to DeFi exchanges,\nand daily DEX volumes have fallen back near October levels of below $3\nbillion.\n\nNonetheless, there has been a broader, more subtle shift to decentralized\nexchanges, with data from Chainalysis showing overall monthly trading volumes\non DEXs were between $181.5 billion and $240.3 billion from August through\nOctober, compared with a range of $173 billion to $203.5 billion for CEXs.\n\n## LOWER TRADE SPEEDS\n\nThe renewed interest in DEXs ties into the debate at the heart of crypto since\nSatoshi Nakamoto's bitcoin white paper 14 years ago: the role, if any, that\ncentralization and regulation should play in the crypto ecosystem.\n\nWhile some investors prefer the transparency of decentralized exchanges, the\nplatforms aren't suitable for investors such as traditional financial\ninstitutions and specialized trading firms, said Wells at Enclave Markets.\n\nFor example, DEXs typically have slower transaction speeds, while hedge funds\nmight not want their trading strategies to be publicly traceable on the\nblockchain.\n\nMany traditional finance institutions are also legally required to hold\nexternal funds with an external custodian and would not be able to \"self-\ncustody\" investors' assets to trade them on decentralized exchanges.\n\nSo is the future DEX or CEX?\n\nMany market participants see both centralized and decentralized exchanges\ncoexisting.\n\n\"The interconnectedness is critical,\" said Chris Kline, co-founder of Bitcoin\nIRA, which offers cryptocurrency retirement accounts, referring to DEXs and\nCEXs growing together as crypto trading expands.\n\n\"Both will exist in the future.\"\n\nReporting by Lisa Pauline Mattackal and Medha Singh in Bengaluru; Editing by\nVidya Ranganathan and Pravin Char\n\nOur Standards: The Thomson Reuters Trust Principles.\n\n  *   *   *   *   * \n\nAcquire Licensing Rights, opens new tab\n\n## Read Next\n\n  * article with video\n\nFuture of MoneycategoryCryptoverse: Bitcoin miners get stuck in a bear pit\n\nSpare a thought for the beleaguered bitcoin miner.\n\n  * article with video\n\nFuture of MoneycategoryCryptoverse: Ether snaps at bitcoin's heels in race for\ncrypto crown\n\nFor years, ether could barely dream of challenging its big brother bitcoin.\nNow, its ambitions may be becoming more realistic.\n\n  * article with gallery\n\nFuture of MoneycategoryCryptoverse: Blockchain bridges fall into troubled\nwaters\n\nAnother day, another hack - and another blockchain bridge burned.\n\n  * article with gallery\n\nFuture of MoneycategoryCryptoverse: What crisis? Venture capitalists bet big\non crypto\n\nIt's not all doom and gloom.\n\n  * Future of MoneycategoryHow crypto giant Binance became a hub for hackers, fraudsters and drug traffickers\n\nFor five years, the world’s largest cryptocurrency exchange Binance served as\na conduit for the laundering of at least $2.35 billion in illicit funds, a\nReuters investigation has found.\n\n  * Future of MoneycategoryCrypto giant Binance kept weak money-laundering checks even as it promised tougher compliance, documents show\n\n##\n\nNewsletter|Once a week.\n\nReuters Crypto\n\nWhere tech meets finance: Reuters’ expert journalists help you spot the scam\nand understand the value of cryptocurrencies, virtual worlds, and the fast-\npaced developments of digital assets.\n\nSign up\n\n## More from Reuters\n\nBlack women say hair relaxers gave them cancer(4:32) -November 4, 2023Watch\nmore videos\n\n1/1 Skip Ad Continue watching after the ad Visit Advertiser websiteGO TO PAGE\n\nNEXT StayNext Off English (United States) 360p 720p HD 1080p HD Auto (360p)\nAbout Connatix V383130 About Connatix V383130 EXPLORE MORE Black women say\nhair relaxers gave them cancer 04:32 Pictures of October 01:42 Images of\nSeptember 01:42 Images of August 01:57 America now in prolonged state of\npolitical violence 03:55 How gold mining contaminates Amazon wildlife 04:14\nImages of July 01:37 Images of June 01:41 Top US leaders and their family\nconnections to slavery 08:29 Images of May 01:42\n\n## Markets\n\n  * ### Siemens Energy shares down 11% as investor day underwhelms\n\nBusinesscategory · November 21, 2023 · 2:51 PM UTC · 10 min ago\n\nGermany's Siemens Energy shares turned sharply lower on Tuesday to fall as\nmuch as 11%, with traders citing profit taking as the company held its capital\nmarkets day (CMD).\n\n  * European Marketscategory\n\n### Euro zone to tighten fiscal policy in 2024, some still to spend too much\n-Commission\n\n2:43 PM UTC · Updated 19 min ago\n\n  * article with gallery\n\nWorldcategory\n\n### Britain to launch South Korea trade talks as president visits\n\n2:38 PM UTC · Updated 24 min ago\n\n  * Businesscategory\n\n### Toyota unit to set up third plant in India's Karnataka state for nearly\n$400 mln\n\n2:10 PM UTC · Updated an hour ago\n\n  * Businesscategory\n\n### GM to hold Nov. 29 business update after UAW contract deal\n\n2:47 PM UTC · Updated 15 min ago\n\n## Site Index\n\n### Latest\n\n  * Home\n\n### Browse\n\n  * World\n  * Business\n  * Markets\n  * Sustainability\n  * Legal\n  * Breakingviews\n  * Technology\n  * Investigations, opens new tab\n  * Sports\n  * Science\n  * Lifestyle\n\n### Media\n\n  * Videos, opens new tab\n  * Pictures\n  * Graphics, opens new tab\n\n### About Reuters\n\n  * About Reuters, opens new tab\n  * Careers, opens new tab\n  * Reuters News Agency, opens new tab\n  * Brand Attribution Guidelines, opens new tab\n  * Reuters Leadership, opens new tab\n  * Reuters Fact Check, opens new tab\n  * Reuters Diversity Report, opens new tab\n\n### Stay Informed\n\n  * Download the App (iOS), opens new tab\n  * Download the App (Android), opens new tab\n  * Newsletters, opens new tab\n\n## Information you can trust\n\nReuters, the news and media division of Thomson Reuters, is the world’s\nlargest multimedia news provider, reaching billions of people worldwide every\nday. Reuters provides business, financial, national and international news to\nprofessionals via desktop terminals, the world's media organizations, industry\nevents and directly to consumers.\n\n## Follow Us\n\n  *   *   *   *   * \n\n## Thomson Reuters Products\n\n  * Westlaw, opens new tab\n\nBuild the strongest argument relying on authoritative content, attorney-editor\nexpertise, and industry defining technology.\n\n  * Onesource, opens new tab\n\nThe most comprehensive solution to manage all your complex and ever-expanding\ntax and compliance needs.\n\n  * Checkpoint, opens new tab\n\nThe industry leader for online information for tax, accounting and finance\nprofessionals.\n\n## LSEG Products\n\n  * Workspace, opens new tab\n\nAccess unmatched financial data, news and content in a highly-customised\nworkflow experience on desktop, web and mobile.\n\n  * Data Catalogue, opens new tab\n\nBrowse an unrivalled portfolio of real-time and historical market data and\ninsights from worldwide sources and experts.\n\n  * World-Check, opens new tab\n\nScreen for heightened risk individual and entities globally to help uncover\nhidden risks in business relationships and human networks.\n\n  * Advertise With Us, opens new tab\n  * Advertising Guidelines, opens new tab\n  * Coupons, opens new tab\n  * Acquire Licensing Rights, opens new tab\n\n  * Cookies, opens new tab\n  * Terms of Use, opens new tab\n  * Privacy, opens new tab\n  * Digital Accessibility, opens new tab\n  * Corrections, opens new tab\n  * Site Feedback, opens new tab\n\nAll quotes delayed a minimum of 15 minutes. See here for a complete list of\nexchanges and delays.\n\n© 2023 Reuters. All rights reserved\n\n## Opt out of sale of personal data and targeted advertising\n\nWhen you visit our website, we store cookies on your browser to collect\ninformation. The information collected might relate to you, your preferences\nor your device, and is mostly used to make the site work as you expect it to\nand to provide a more personalized web experience. However, you can choose not\nto allow certain types of cookies, which may impact your experience of the\nsite and the services we are able to offer. Click on the different category\nheadings to find out more and change our default settings according to your\npreference. You cannot opt-out of our First Party Strictly Necessary Cookies\nas they are deployed in order to ensure the proper functioning of our website\n(such as prompting the cookie banner and remembering your settings, to log\ninto your account, to redirect you when you log out, etc.). For more\ninformation about the First and Third Party Cookies used please follow this\nlink.  \nMore information\n\nAllow All\n\n###  Manage Consent Preferences\n\n#### Strictly Necessary Cookies\n\nAlways Active\n\nStrictly Necessary Cookies\n\nThese cookies are necessary for the website to function and cannot be switched\noff in our systems. They are usually only set in response to actions made by\nyou which amount to a request for services, such as setting your privacy\npreferences, logging in or filling in forms.    You can set your browser to\nblock or alert you about these cookies, but some parts of the site will not\nthen work. These cookies do not store any personally identifiable information.\n\n#### Sale of Personal Data and Targeted Advertising\n\nSale of Personal Data and Targeted Advertising\n\nThird party trackers collect information used for analytics and to personalize\nyour experience with targeted ads. Under the Virginia Consumer Data Protection\nAct, you have the right to opt-out of the sale of your personal data to third\nparties. You also have the right to opt out of targeted advertising related\nprocessing. You may exercise your right to opt out of the sale of personal\ndata and targeted advertising by using this toggle. If you opt out, we will\nnot be able to offer you personalized ads and we will stop sharing your\npersonal information with third parties. Additionally, you may contact our\nlegal department for further clarification about your rights as a Virginia\nconsumer by using this Exercise My Rights link.\n\n  * ##### Performance Cookies\n\nRequired Cookies\n\nThese cookies allow us to count visits and traffic sources so we can measure\nand improve the performance of our site. They help us to know which pages are\nthe most and least popular and see how visitors move around the site.    All\ninformation these cookies collect is aggregated and therefore anonymous. If\nyou do not allow these cookies we will not know when you have visited our\nsite, and will not be able to monitor its performance.\n\n  * ##### Targeting Cookies\n\nRequired Cookies\n\nThese cookies may be set through our site by our advertising partners. They\nmay be used by those companies to build a profile of your interests and show\nyou relevant adverts on other sites.    They do not store directly personal\ninformation, but are based on uniquely identifying your browser and internet\ndevice. If you do not allow these cookies, you will experience less targeted\nadvertising.\n\nReject All Confirm My Choices\n\nBack Button\n\nBack\n\n### Performance Cookies\n\nVendor Search Search Icon Filter Icon\n\nClear Filters\n\nInformation storage and access\n\nApply\n\nConsent Leg.Interest\n\nAll Consent Allowed\n\nSelect All Vendors\n\nSelect All Vendors\n\nAll Consent Allowed\n\nReject All Confirm My Choices\n\n",
    "links": "[{\"link\": \"https://www.reuters.com/differentiator/\", \"text\": \"\"}, {\"link\": \"https://www.reuters.com/\", \"text\": \"\"}, {\"link\": \"https://www.reuters.com/world/\", \"text\": \"World\"}, {\"link\": \"https://www.reuters.com/business/\", \"text\": \"Business\"}, {\"link\": \"https://www.reuters.com/markets/\", \"text\": \"Markets\"}, {\"link\": \"https://www.reuters.com/sustainability/\", \"text\": \"Sustainability\"}, {\"link\": \"https://www.reuters.com/legal/\", \"text\": \"Legal\"}, {\"link\": \"https://www.reuters.com/business/future-of-money/\", \"text\": \"Future of Money\"}, {\"link\": \"https://www.reuters.com/authors/medha-singh/\", \"text\": \"Medha Singh\"}, {\"link\": \"https://www.reuters.com/authors/lisa-pauline-mattackal/\", \"text\": \"Lisa Pauline Mattackal\"}, {\"link\": \"https://www.reuters.com/markets/currencies/rise-fall-crypto-exchange-ftx-2022-11-10/\", \"text\": \"FTX imploded\"}, {\"link\": \"https://www.reuters.com/markets/currencies/rise-fall-crypto-exchange-ftx-2022-11-10/\", \"text\": \"Nov. 9\"}, {\"link\": \"https://www.reuters.com/technology/cryptoverse-bitcoin-miners-get-stuck-bear-pit-2022-09-27/\", \"text\": \"\"}, {\"link\": \"https://www.reuters.com/business/future-of-money/\", \"text\": \"\"}, {\"link\": \"https://www.reuters.com/technology/cryptoverse-bitcoin-miners-get-stuck-bear-pit-2022-09-27/\", \"text\": \"Cryptoverse: Bitcoin miners get stuck in a bear pit\"}, {\"link\": \"https://www.reuters.com/technology/cryptoverse-ether-snaps-bitcoins-heels-race-crypto-crown-2022-09-13/\", \"text\": \"\"}, {\"link\": \"https://www.reuters.com/business/future-of-money/\", \"text\": \"\"}, {\"link\": \"https://www.reuters.com/technology/cryptoverse-ether-snaps-bitcoins-heels-race-crypto-crown-2022-09-13/\", \"text\": \"Cryptoverse: Ether snaps at bitcoin's heels in race for crypto crown\"}, {\"link\": \"https://www.reuters.com/business/future-of-money/cryptoverse-blockchain-bridges-fall-into-troubled-waters-2022-08-09/\", \"text\": \"\"}, {\"link\": \"https://www.reuters.com/business/future-of-money/\", \"text\": \"\"}, {\"link\": \"https://www.reuters.com/business/future-of-money/cryptoverse-blockchain-bridges-fall-into-troubled-waters-2022-08-09/\", \"text\": \"Cryptoverse: Blockchain bridges fall into troubled waters\"}, {\"link\": \"https://www.reuters.com/business/future-of-money/cryptoverse-what-crisis-venture-capitalists-bet-big-crypto-2022-07-26/\", \"text\": \"\"}, {\"link\": \"https://www.reuters.com/business/future-of-money/\", \"text\": \"\"}, {\"link\": \"https://www.reuters.com/business/future-of-money/cryptoverse-what-crisis-venture-capitalists-bet-big-crypto-2022-07-26/\", \"text\": \"Cryptoverse: What crisis? Venture capitalists bet big on crypto\"}, {\"link\": \"https://www.reuters.com/business/future-of-money/\", \"text\": \"\"}, {\"link\": \"https://www.reuters.com/business/future-of-money/how-crypto-giant-binance-became-hub-hackers-fraudsters-drug-traffickers-2022-07-11/\", \"text\": \"How crypto giant Binance became a hub for hackers, fraudsters and drug traffickers\"}, {\"link\": \"https://www.reuters.com/business/future-of-money/\", \"text\": \"\"}, {\"link\": \"https://www.reuters.com/business/future-of-money/crypto-giant-binance-kept-weak-money-laundering-checks-even-it-promised-tougher-2022-07-11/\", \"text\": \"Crypto giant Binance kept weak money-laundering checks even as it promised tougher compliance, documents show\"}, {\"link\": \"https://www.reuters.com/video/\", \"text\": \"Watch more videos\"}, {\"link\": \"https://www.reuters.com/markets/\", \"text\": \"\"}, {\"link\": \"https://www.reuters.com/business/energy/siemens-energy-shares-down-11-investor-day-underwhelms-2023-11-21/\", \"text\": \"\"}, {\"link\": \"https://www.reuters.com/business/energy/siemens-energy-shares-down-11-investor-day-underwhelms-2023-11-21/\", \"text\": \"Siemens Energy shares down 11% as investor day underwhelms\"}, {\"link\": \"https://www.reuters.com/business/\", \"text\": \"\"}, {\"link\": \"https://www.reuters.com/markets/europe/euro-zone-tighten-fiscal-policy-2024-some-still-spend-too-much-commission-2023-11-21/\", \"text\": \"\"}, {\"link\": \"https://www.reuters.com/markets/europe/\", \"text\": \"\"}, {\"link\": \"https://www.reuters.com/markets/europe/euro-zone-tighten-fiscal-policy-2024-some-still-spend-too-much-commission-2023-11-21/\", \"text\": \"Euro zone to tighten fiscal policy in 2024, some still to spend too much -Commission\"}, {\"link\": \"https://www.reuters.com/world/uk/britain-launch-south-korea-trade-talks-during-yoons-state-visit-2023-11-20/\", \"text\": \"\"}, {\"link\": \"https://www.reuters.com/world/\", \"text\": \"\"}, {\"link\": \"https://www.reuters.com/world/uk/britain-launch-south-korea-trade-talks-during-yoons-state-visit-2023-11-20/\", \"text\": \"Britain to launch South Korea trade talks as president visits\"}, {\"link\": \"https://www.reuters.com/business/autos-transportation/toyota-unit-set-up-third-plant-indias-karnataka-state-nearly-400-mln-2023-11-21/\", \"text\": \"\"}, {\"link\": \"https://www.reuters.com/business/\", \"text\": \"\"}, {\"link\": \"https://www.reuters.com/business/autos-transportation/toyota-unit-set-up-third-plant-indias-karnataka-state-nearly-400-mln-2023-11-21/\", \"text\": \"Toyota unit to set up third plant in India's Karnataka state for nearly $400 mln\"}, {\"link\": \"https://www.reuters.com/business/autos-transportation/gm-hold-nov-29-business-update-after-uaw-contract-deal-2023-11-21/\", \"text\": \"\"}, {\"link\": \"https://www.reuters.com/business/\", \"text\": \"\"}, {\"link\": \"https://www.reuters.com/business/autos-transportation/gm-hold-nov-29-business-update-after-uaw-contract-deal-2023-11-21/\", \"text\": \"GM to hold Nov. 29 business update after UAW contract deal\"}, {\"link\": \"https://www.reuters.com/\", \"text\": \"Home\"}, {\"link\": \"https://www.reuters.com/world/\", \"text\": \"World\"}, {\"link\": \"https://www.reuters.com/business/\", \"text\": \"Business\"}, {\"link\": \"https://www.reuters.com/markets/\", \"text\": \"Markets\"}, {\"link\": \"https://www.reuters.com/sustainability/\", \"text\": \"Sustainability\"}, {\"link\": \"https://www.reuters.com/legal/\", \"text\": \"Legal\"}, {\"link\": \"https://www.reuters.com/breakingviews/\", \"text\": \"Breakingviews\"}, {\"link\": \"https://www.reuters.com/technology/\", \"text\": \"Technology\"}, {\"link\": \"https://www.reuters.com/investigates/\", \"text\": \"\"}, {\"link\": \"https://www.reuters.com/sports/\", \"text\": \"Sports\"}, {\"link\": \"https://www.reuters.com/science/\", \"text\": \"Science\"}, {\"link\": \"https://www.reuters.com/lifestyle/\", \"text\": \"Lifestyle\"}, {\"link\": \"https://www.reuters.com/fact-check/\", \"text\": \"\"}, {\"link\": \"https://www.reuters.com/info-pages/advertising-guidelines/\", \"text\": \"\"}, {\"link\": \"https://www.reuters.com/info-pages/terms-of-use/\", \"text\": \"\"}, {\"link\": \"https://www.reuters.com/info-pages/contact-us/\", \"text\": \"\"}]"
}