{
    "summary": "Skip to content\n\n  * Learn\n  * Blog\n  * Support\n    * FAQs\n    * Help\n  * About\n  * Contact\n  * Download\n\nMenu\n\n  * Learn\n  * Blog\n  * Support\n    * FAQs\n    * Help\n  * About\n  * Contact\n  * Download\n\nTwitter Discord Youtube Store\n\nDownload\n\n  * Learn\n  * Blog\n  * Support\n    * FAQs\n    * Help\n  * About\n  * Contact\n  * Download\n\nMenu\n\n  * Learn\n  * Blog\n  * Support\n    * FAQs\n    * Help\n  * About\n  * Contact\n  * Download\n\nTwitter Discord Youtube Store\n\nDownload\n\n# What Is a DEX in Crypto? How Decentralized Exchanges Work\n\n**Decentralized Crypto Exchange Definition** : _A decentralized crypto\nexchange (DEX) is a digital, decentralized peer-to-peer marketplace available\nfor anyone to buy and sell cryptocurrencies_.\n\nWritten by: Mike Martin   |  _Updated August 28, 2023_\n\nReviewed by: Ryan Grace\n\nFact checked by: Laurence Willows\n\nDecentralized exchanges (DEXs) operate on peer-to-peer blockchains with no\nintermediaries. In this article, we will teach you everything there is to know\nabout decentralized crypto exchanges (DEXs) and the revolutionary technology\ntransforming and democratizing finance.\n\nTable of Contents\n\n  * What Is a Decentralized Crypto Exchange (DEX)?\n\n  * Centralized vs. Decentralised Crypto Exchanges (CEX vs. DEX)\n\n  * How Do I Place A Trade On A DEX?\n\n  * Automated Market Makers (AMM)\n\n  * What Are the Costs of Trading on a DEX?\n\n  * Top 4 Decentralized Exchanges\n\n  * DEX Aggregators\n\n  * Final Word\n\n  * FAQs\n\n🍒 tasty takeaways\n\n  * DEX stands for decentralized cryptocurrency exchange.\n\n  * A self-custody crypto wallet is required to trade on a DEX.\n\n  * DEXs are most popular on the Ethereum network.\n\n  * Bitcoin (BTC) has limited DEX options as the chain doesn’t support smart contracts. \n\n  * DEXs offer more trading pairs and lower fees than most exchanges.\n\n  * In addition to swapping on a DEX, anyone can become a market maker by joining a DEX liquidity pool. \n\n  * To trade on a DEX, you must pay both protocol and gas fees. \n\n  * The top three DEXs are Curve Finance, Uniswap, and PancakeSwap.\n\n## What Is a Decentralized Crypto Exchange (DEX)?\n\nCrypto investors who access blockchains through self-custody wallets must\ninteract with decentralized applications (dApps).\n\ndApps are run on distributed networks. This is in contrast to centralized\nbusinesses such as Coinbase, which run their businesses on centralized servers\ninaccessible to the public.  Since dApps are built atop decentralized\nblockchains, they are entirely transparent and very efficient.\n\nThe most popular dApps operate in the decentralized finance (DeFi) space,\nwhich is dominated by the Ethereum network. In addition to staking, lending,\nand derivative trading dApps, there are decentralized exchange dApps.\n\nDecentralized exchanges (DEXs) allow crypto traders to swap coins and tokens\nwithout a central authority. Due to the current lack of regulations (there is\nno ‘know your customer’ (KYC) in crypto), no paperwork or approval is required\nto trade on a DEX.\n\nThat’s a lot of abbreviations you just learned. Let’s run through them one\nmore time before we move on:\n\n**dApp** : Decentralized application\n\n**DeFi** : Decentralized Finance\n\n**DEX** : Decentralized exchange\n\n**_🍒 Read:   _Top 5 DEXs in 2023  \n__**\n\n## Centralized vs. Decentralised Crypto Exchanges (CEX vs. DEX)\n\nTo understand how a DEX works, we must first understand how a traditional\ncentralized crypto exchange works.\n\n### Centralized Crypto Exchange\n\nA centralized crypto exchange (CEX) is a crypto marketplace that is managed by\na central organization that facilitates the buying and selling of\ncryptocurrency.\n\nWhen you hold crypto on a CEX, the exchange holds your private keys for you in\n‘custody’.\n\nIn crypto, private keys are the only way to prove ownership over digital\nassets. Since you don’t have direct access to your private keys on a CEX, you\ncan’t trace your digital assets on a blockchain to assure your exchange is\nholding your crypto 1×1.\n\nExchanges are known to pool together their customers’ crypto and use it for\ntheir own personal gain. FTX traded their customer’s crypto for personal gain\nand lost the majority of it.\n\n> “Not your keys, not your coins”\n>\n> — Crypto Community\n\nEven with all of these risks, the vast majority of retail crypto traders still\nprefer to hold their crypto on a CEX.\n\n### Decentralized Crypto Exchange\n\nIn order to transact on a DEX, you need to connect your crypto private keys\nvia a self-custody wallet (like the tastycrypto wallet). Since CEXs do not\nallow users access to private keys, it is impossible to interact with DEXs (or\nany dApp) via a custodial wallet.\n\n ** _👉  _** ** _Learn how to connect to DEXs using tastycrypto with\nWalletConnect!_**\n\nUnlike CEXs, DEXs do not hold your cryptocurrency. When you want to place a\ntrade on a DEX, you connect your wallet and disconnect it when you’re done.\nYour crypto is always stored independently of the exchange on a seed-phrase-\nprotected wallet.\n\n👉 Go In-Depth! CEX vs DEX: Which Offers the Lowest Fees?\n\n## How Do I Place A Trade On A DEX?\n\nTo place a crypto trade on a DEX, follow the below steps.\n\n  1. Find a DEX that supports the crypto assets you wish to trade. \n\n  2. Fund your self-custody crypto wallet with crypto. \n\n  3. Connect your crypto wallet to a DEX that supports the coins/tokens you wish to trade.\n\n  4. Choose the cryptocurrency pair that you wish to buy/sell.\n\n  5. Select the gas fee you are willing to pay (the wallet will approximate this for you).\n\n  6. Wait for your trade to be confirmed (For the Ethereum network, this takes a few minutes).\n\n\n\n## Automated Market Makers (AMM)\n\nYou may have wondered by now with no central intermediary or traditional\nmarket makers involved, how are trades actually _filled_ on DEXs?\n\nDEXs are powered by automated market makers. Automated market makers are smart\ncontracts (algorithms) that automate the process of buying and selling digital\nassets.\n\nOn traditional exchanges, market makers are finance professionals who provide\nliquidity by buying and selling assets using an order book.\n\n### Liquidity Pools\n\nOn DEXs, this order book is replaced by liquidity pools. Liquidity pools\nrepresent cryptocurrency locked in a smart contract.  \n\nAnyone can become a market maker in DeFi (and earn the fees that come with\nit!) by contributing an equal value of two or more cryptocurrencies to a\nliquidity pool.\n\nFor example, if you owned 1k worth of both ether (ETH) and 1k worth of USD\nCoin (USDC), you contribute both of these cryptos to an ETH/USDC liquidity\npool on any DEX you want.\n\nIn return, you will be given a liquidity provider token that represents your\ncrypto. You can cash this token in for your crypto whenever you want.\n\nThe more traders buy and sell the ETH/USDC pair, the more you make in fees.\n\n### Liquidity Pool Risks: Impermanent Loss\n\n\n\n> Liquidity Pool Formula: x * y = k\n\nLet’s refer back to our ETH/USDC pool for an example.\n\nHere, we contributed both 1k of ETH and 1k of USDC (A US dollar-pegged\nstablecoin) to the ETH/USDC pool.\n\nSince we added our crypto to this pool, ETH has risen dramatically in value.\nThis means that traders have been buying ETH and selling USDC from our pool.\nTherefore, our quantity of ETH has gone down and our quantity of USDC has gone\nup.\n\nThough the net value of our pool will always be the same as the initial\ninvestment (2k), we would have made _more_ if we simply held ETH outright and\nnot contributed to a liquidity pool at all.\n\nThis is what impermanent loss means.\n\n## What Are the Costs of Trading on a DEX?\n\nSo when you trade on a DEX you pay trading fees; when you provide liquidy on a\nDEX you earn fees. But what are these fees?\n\nThere are two fees to consider when trading on a DEX:\n\n  1. **Protocol Fee**\n\nEvery DEX has a fee to transact on their platform. Typically, this fee is 0.3%\nof the transaction value. Some of this goes to the protocol itself, while the\nmajority of it goes to pay the liquidity providers.\n\n  1.   **Gas Fee**\n\nAll blockchain transactions must be validated in order to be added to the\nblockchain. On the Ethereum network, stakers do this work for you. However, it\nis not free. Gas fees can fluctuate widely. Currently, the gas fee to convert\none ether to one USD Coin on the Uniswap DEX is about $4, as seen below.\n\n**_🚨_**CEXs charge maker/taker fees. Learn how they work here!\n\n\n\n## Top 4 Decentralized Exchanges\n\nIn DeFi, we speak in terms of TVL (total value locked) to determine a\nprotocol’s value. The higher the total value locked (TVL), the more value (and\ntrading volume/liquidity) a dApp has.  Let’s now review the top 4 DEXs as\ndetermined by their TVL in DefiLlama.\n\n  1. Curve\n\n    * **TVL** : 3.72B\n\n    * **Chains** : Ethereum, Arbitrum, Optimism, Polygon, Fantom, Avalanche, Moonbeam, Kava\n\n    * **Fees** : Varies\n\n  2.   Uniswap\n\n    * **TVL** : $3.49B\n\n    * **Chains** : Ethereum, Arbitrum, Optimism, Polygon \n\n    * **Fees** : 0.3%; varies\n\n  3. PancakeSwap\n\n    * **TVL** : $2.37B\n\n    * **Chains** : Ethereum, BSC (Binance Smart Chain), Aptos \n\n    * **Fees** : 0.25%; varies\n\n  4. Balancer\n\n    * **TVL** : $1.56\n\n    * **Chains** : Ethereum, Arbitrum, Polygon\n\n    * **Fees** : Varies\n\n📕  Read! Uniswap vs. SushiSwap vs. PancakeSwap: Which DEX Is Best?\n\n## DEX Aggregators\n\nDEX aggregators are protocols that provide access to numerous DEX liquidity\npools on one interface. This integration allows traders to pick and choose\nbetween protocols that give them the best rates and liquidity.\n\nThe 1inch Network is currently one of the most popular DEX aggregators.\n\n## Final Word\n\nIf you want to trade crypto with a self-custody wallet, you’ll need to trade\non a DEX. Though DEXs do offer incredible efficiency, they are not without\nrisks.\n\nThe greatest risk to all self-custody wallets is that the owner loses their\nseed phrase. The second risk relates to hacking and protocol risk.\n\nTo reduce hacking risks, it is wise to make sure the device your wallet is\nstored on is both secure and clean. To mitigate protocol risk, it is wise to\nalways disconnect your wallet from a DEX when you are not actively trading.\n\n_New to crypto?_ _Read this article by the FTC (Federal Trade Commission) to\nlearn more about the risks of investing in digital assets_ _._\n\n## FAQs\n\nWhat is a DEX in crypto?\n\nIn crypto, a DEX is a decentralized exchange for trading cryptocurrencies\n(coins and tokens).\n\nWhat is the best DEX crypto?\n\nThe best DEX as far as liquidity and security is generally considered to be\nUniswap.\n\nWhat are examples of DEX in crypto?\n\nExamples of DEX in crypto include Uniswap, SushiSwap, and PancakeSwap.\n\nHow do I get DEX crypto?\n\nIn order to interact with a DEX in crypto, you must first connect a self-\ncustody crypto wallet.\n\nWhat does a DEX crypto do?\n\nA DEX allows users to trade cryptocurrencies directly with one another via\nliquidity pools without an intermediary.\n\n### 🍒 tasty reads\n\n####  What Is Wrapped Ether? Complete wETH Guide\n\nNovember 8, 2023\n\n####  Impermanent Loss in DeFi: The Complete Guide\n\nNovember 6, 2023\n\n####  What is GMX? DeFi Perpetual Exchange Guide\n\nOctober 16, 2023\n\n####  What Is Defi Liquidity Mining and How Does It Work?\n\nOctober 10, 2023\n\n####  Wrapped Crypto Tokens: A Beginner’s Guide\n\nSeptember 29, 2023\n\n####  MEV Bot Guide for Beginners: Ethereum Arbitrage\n\nSeptember 26, 2023\n\n####  Mike Martin\n\nMike Martin serves as the Head of Content for tastycrypto. Before joining\ntastycrypto, Michael worked in the active trader divisions of thinkorswim, TD\nAmeritrade, and Charles Schwab. He also served as a writer and editor for\nprojectfinance.\n\nMichael has been active in the crypto community since 2017. He holds\ncertifications from Duke University in decentralized finance (DeFi) and\nblockchain technology.\n\nContact: Mike@tastycrypto.com\n\nPrevious\n\nNext\n\nShare the Post:\n\n  * Legal Stuff\n\n  * Legal Stuff\n\nTwitter Discord Youtube\n\n© 2023 tasty Software Solutions, LLC. tastycrypto is a product offered by\ntasty Software Solutions, LLC, a separate, but affiliated company of\ntastytrade, Inc. tastycrypto is a product provided independently of\ncryptocurrency services offered through tastytrade, Inc. or its affiliates.\n\n",
    "links": "[{\"link\": \"https://www.tastycrypto.com/?s=\", \"text\": \"\"}, {\"link\": \"https://www.tastycrypto.com/download\", \"text\": \"\"}, {\"link\": \"https://www.tastycrypto.com/?s=\", \"text\": \"\"}, {\"link\": \"https://www.tastycrypto.com/download\", \"text\": \"\"}]"
}