{
    "summary": "\n\nSEO\n\n  * General SEO\n  * Keyword Research\n  * On-Page SEO\n  * Link Building\n  * Technical SEO\n  * Local SEO\n  * Enterprise SEO\n\nMarketing\n\n  * General Marketing\n  * Content Marketing\n  * Affiliate Marketing\n  * Paid Marketing\n  * Video Marketing\n\nData & Studies\n\nProduct\n\nGuides\n\n  * SEO\n  * Keyword Research\n  * On-Page SEO\n  * Link Building\n  * Technical SEO\n  * Local SEO\n\nSearch\n\nSearch\n\nSubscribe\n\nMenu\n\n\n\nSearch\n\nSEO  General SEO Keyword Research On-Page SEO Link Building Technical SEO\nLocal SEO Enterprise SEO\n\nMarketing  General Marketing Content Marketing Affiliate Marketing Paid\nMarketing Video Marketing\n\nData & Studies\n\nProduct\n\nGuides  SEO Keyword Research On-Page SEO Link Building Technical SEO Local SEO\n\nSubscribe\n\nGeneral SEO\n\n# How to Do a SERP Analysis\n\nBy  Chris Haines ✓ Reviewed by  Joshua Hardwick\n\nUpdated: April 11, 202313 min read\n\nChris Haines\n\nChris is an SEO director who has 10 years of experience in SEO, agency side.\nWhen not involved in SEO, he enjoys messing around with vintage synthesizers,\nwalks on sandy beaches, and a good cup of tea.\n\n____\n\nArticle Performance\n\n  * Organic traffic __\n\n726\n\n  * Linking websites __\n\n37\n\nGet SEO metrics of any website or URL.\n\nSign up for Ahrefs →\n\nThe number of websites linking to this post.\n\nThis post's estimated monthly organic search traffic.\n\nGet the week's best marketing content\n\nEmail Subscription\n\nSubscribe\n\nLeave this field empty if you're human:\n\nContents\n\n  * Step 1. Get a high-level overview of the SERP\n  * Step 2. Investigate if (and how) you can rank\n  * Step 3. Check for other opportunities\n\nSERP analysis is a process that helps you determine if and how you can rank\nfor a keyword and whether the effort is worth the reward.\n\nIt’s important because not all keywords are created equal. Some are harder to\nrank for than others, so you must choose wisely.\n\nIn this guide, you’ll learn how to analyze a SERP to see if it’s crackable.\n\nLet’s get started.\n\nContents\n\n  * Step 1. Get a high-level overview of the SERP\n  * Step 2. Investigate if (and how) you can rank\n  * Step 3. Check for other opportunities\n\n## Step 1. Get a high-level overview of the SERP\n\nThe first step of a SERP analysis is to get a rough sense of the traffic\nopportunity and ranking difficulty opportunity.\n\nTo do this, we can use two of Ahrefs’ core metrics: Keyword Difficulty and\nTraffic Potential.\n\n  *  **Keyword Difficulty (KD)** estimates how hard it will be to rank on the first page of Google for a keyword on a scale from 0 to 100.\n  *  **Traffic Potential (TP)** is the total estimated monthly search traffic to the top-ranking page for a keyword.\n\nUsing these two metrics, we will be able to get a top-level overview of the\nSERP and determine whether it’s worth further investigation.\n\nLet’s use Ahrefs’ Keywords Explorer to get a quick, high-level view of the\nkeyword “when were dogs domesticated.”\n\nSo what exactly is the **overview** showing us?\n\nWe can see the keyword “when were dogs domesticated” has a super hard KD of 73\nbut a low TP of 3.2K.\n\nAt first glance, this query doesn’t appear to be worth the effort. But it may\nwarrant further investigation if this topic is lucrative for your business.\n\nWith a super hard **KD** of 73, Ahrefs estimates that we will need ~235 links\nto rank in the top 10 for this SERP, which will require a fair amount of\nresources to compete.\n\nGenerally speaking, it is better to look for low-KD and high-TP queries, where\npossible.\n\nTo better understand the effort-to-reward ratio for this query, and any\nothers, we can plot the effort-to-reward ratio in an XY graph:\n\n  *  **Top left** : Golden opportunities (low investment, high reward).\n  *  **Top right** : Long-term opportunities (high investment, high reward).\n  *  **Bottom left** : Possible opportunities (low rewards, so effort might not be worth it).\n  *  **Bottom right** : Try to avoid (unless it’s a highly lucrative topic for your business).\n\nOur query for “when were dogs domesticated” falls into the “high effort, low\nreward” quadrant, so it may not be worth the effort.\n\nWe are looking for a query that falls in the top left-hand section. In most\ncases, these will be the golden keyword opportunities.\n\nAvoid queries that fall into the bottom right section where possible unless it\nis particularly lucrative for your business.\n\nLet’s try to find a search with more opportunity.\n\nLet’s plug in “how to leash train a dog” into Ahrefs’ Keywords Explorer and\nsee if this keyword has better metrics.\n\nWe can see that this query has a medium KD of 18 but a much higher TP of 24K.\nGreat!\n\nWe can see that this search has a much better effort-to-reward ratio than our\nprevious query, so let’s scroll down the page in Keywords Explorer to the\n**SERP overview** and investigate if (and how) we can rank.\n\n## Step 2. Investigate if (and how) you can rank\n\nNow that we have completed our top-level overview, we can consider other\nfactors using the **SERP overview** in Ahrefs’ Keywords Explorer.\n\nWe should consider four key elements in our SERP analysis when investigating\nthe ranking difficulty:\n\n### 1\\. Domain Rating (DR)\n\nDR **** is one of Ahrefs’ most widely used metrics in SEO. It shows the\nrelative strength of a website’s backlink profile on a scale from 0 to 100.\n\nIt’s not a Google ranking factor, but there are a couple of reasons why it can\nbe easier for high-DR sites to rank on Google:\n\n  1.  **They can boost a page’s strength with internal links** – High-DR sites have lots of strong pages. They can funnel some of this strength to specific pages with internal links.\n  2.  **They are often trusted brands** – People may prefer to click these results on the SERPs. They may also have more topical authority, which may help. \n\nThese reasons explain why 64.9% of SEOs pay attention to DR when analyzing\ntheir chances to rank:\n\n> Do you pay attention to Domain Rating (or any other “website authority”\n> metric) when analysing your chances to rank for a given keyword?\n>\n> — Tim Soulo 🇺🇦 (@timsoulo) April 27, 2022\n\nWhile it’s certainly possible to outrank a higher DR site, a good rule of\nthumb is to look for pages ranking in the top 10 with the same DR as you or\nlower. By doing this, we can maximize our chances of appearing on the SERP.\n\nIf we return to our previous query “how to leash train a dog” and look at the\n**SERP overview,** we can see that the first result comes from a DR 90 site.\n\nEven with a high-DR site, this looks hard to beat.\n\n  * Scanning down the DR column, we can see that 8 out of 10 sites have a DR of 70+, so we could potentially be on the back foot from the start with this query.\n  * Jumping to the sixth result, we can see that it has a DR of 26, which suggests that this SERP is crackable, at least in terms of DR. \n\nFinding outliers like this DR 26 site is what we need to be focusing on at\nthis stage. It can mean that ranking on this SERP with a ≤ 70 DR site is\npossible.\n\nAssuming that we don’t have a DR 70+ site, our hopes of ranking will most\nlikely rest on equalling the ranking of the DR 26 site.\n\nIt is worth noting that the traffic this site receives is estimated to be\naround 833, which is a lot lower than our original estimated 24K **TP.**\n\nWith these revised figures, we need to reevaluate whether the effort is worth\nthe reward at this stage. That depends on our website’s authority, our risk\nappetite, and the resources available.\n\nAlthough DR plays an important initial role in our SERP analysis, there are\nother factors that we should consider as well, such as links.\n\n### 2\\. Links\n\nIf you ask an SEO what the top Google ranking factors are, chances are they\nwill mention “backlinks” in their reply.\n\nBut what exactly is a backlink? Simply put, backlinks are clickable links from\none website to another.\n\nBacklinks are also highly important for ranking on Google, as they are one of\neight confirmed ranking factors.\n\n> 8 confirmed Google ranking factors:  \n>  \n> 1\\. Backlinks  \n> 2\\. Relevance  \n> 3\\. Freshness  \n> 4\\. HTTPS  \n> 5\\. Mobile-friendliness  \n> 6\\. Page speed  \n> 7\\. Core Web Vitals  \n> 8\\. Intrusive interstitials  \n>  \n> Let’s take a closer look. 👇\n>\n> — Ahrefs (@ahrefs) October 27, 2022\n\nWe saw in step #1 that **KD** can give us a broad indication of how many links\nwe will need to rank, but actual link numbers will vary from site to site.\n\nLet’s return to our query for “how to leash train a dog” in the **SERP\noverview** and take a closer look at the links.\n\n  * Looking at the **Domains** column in the above image, we can see that the first result has 521 referring domains. Unless we can acquire over 521 referring domains, we should rule out the possibility of outranking this result.\n  * The second result has 116 **domains.** Again, this seems relatively high, so we should probably rule out outranking this result too.\n  * Positions #3–10, however, have ≤ 36 **domains each** , which is where the most opportunities lie on this SERP.\n\nWe can see from this link analysis that the lower end of the SERP is much\neasier to crack—at least in terms of links.\n\nIf we hone in on the sixth result, we can see that this site only has eight\ndomains.\n\nAcquiring more than eight domains should be achievable for most businesses, so\nthis could be a great opportunity.\n\nWe only need to be aware that the estimated traffic for the sixth result is\nmuch lower than our initial **TP** estimate of 24K and is now 851.\n\nLooking at the rest of the SERP’s traffic, we can see that rather than\ngradually declining, the eighth and 10th results have more impressive\nestimated traffic, 5,895 and 3,643, respectively.\n\nThis may mean that the estimated traffic opportunity may not be as low as 851,\nbut it can vary depending on our exact position.\n\nSo far, just using DR and links, we have seen how feasible it will be for us\nto rank on this SERP. We can see that the lower half of the SERP (from\npositions #6–10) is most achievable at this stage.\n\nNow we will need to consider the role of search intent on the SERP.\n\n### 3\\. Search intent\n\nSearch intent is used to describe the primary reason for an online search. In\nother words, it indicates why the user typed their query into the search\nengine in the first place.\n\nBut what does search intent mean in terms of our SERP analysis?\n\nIn a nutshell: Our webpage needs to provide the best answer for the query to\nrank well on the SERP. Identifying the dominant search intent on the SERP can\nhelp determine how or if we will compete.\n\nMost content on the internet falls into the categories below and, for our SERP\nanalysis, it makes sense to use this categorization:\n\n  * Blog posts\n  * Category pages\n  * Product pages\n  * Landing pages\n  * Videos\n\nLet’s use Ahrefs’ own keywords to explore this concept in more detail.\n\nSay we have a website that we want to rank for “backlink checker,” and we have\nwritten a blog post targeting that query.\n\nThis alone will not enable us to rank for this query, as the intent of this\nsearch is strongly aligned toward SEO tool companies with big backlink\ndatabases—like Ahrefs. For these types of websites, the backlink checker is\nlikely to be one of their main product pages.\n\nIf you thought of it, why would you click on a result for “backlink checker”\nthat didn’t have a backlink checker product?\n\nYou probably wouldn’t.\n\nThis rules out the possibility of targeting this keyword for the average\nwebsite creating a simple blog post on this topic.\n\nLet’s consider another more visual example using Ahrefs’ Keywords Explorer.\nLet’s plug in the keyword “how to draw a picasso face” and scroll down to the\n**SERP overview.**\n\nWith this query, we can see that 4 out of the top 6 results on this SERP are\nvideo-based. Therefore, we can see that the search intent is focused on video\ncontent.\n\nBecause this format of content is so dominant at the top of the SERP, it will\nlikely be tough to rank near the top of this SERP unless we create video\ncontent ourselves.\n\nReturning to the **SERP overview** for our “how to leash train a dog” search\nquery, we can see that the majority of the articles here are blog posts, but\nthe fifth result is a video SERP feature.\n\nThis indicates that, at least for some searches, searchers are looking for\nvideo guides rather than blog posts about this topic.\n\nWith this type of mixed search intent, it is best to create content in both\nformats, assuming you have the expertise and resources to compete. This will\nlikely increase the chances of appearing on the SERP for this particular\nkeyword.\n\nIn summary, we have seen how analyzing search intent can help inform our SERP\nstrategy and determine if and how we will compete.\n\nLet’s now take a look at content quality.\n\n### 4\\. Content quality\n\nIt’s worth being aware that the standard of content Google expects can be much\nhigher for certain topics.\n\nFor example, in a Your Money or Your Life (YMYL) topic, such as medical\nadvice, you likely need to provide content created or reviewed by doctors to\ncompete on the SERP.\n\nGoogle defines YMYL topics as the following:\n\nUnless you have the resources to compete on these types of SERPs, then it is a\ngood idea to stay clear of them.\n\nEven in non-YMYL topics, such as product reviews, there are sites like\nWirecutter independently reviewing thousands of products every year with great\nsuccess. So it’s not just YMYL topics that have extremely high-quality\ncontent.\n\nWirecutter now has the backing of The New York Times, so it has tremendous\nresources at hand.\n\nLooking at its website, it typically updates or publishes around 10 articles\nper day, and this is despite its reviews taking “weeks or months of research”\nto complete.\n\nSo how do high-quality sites like Wirecutter impact our SERP analysis?\n\nSimply put, if there is a website that has high-quality content within the\nSERP, then you should consider whether you have the resources to compete and\noutrank them.\n\n## Step 3. Check for other opportunities\n\nThe final step of our SERP analysis is to check for any other opportunities.\nOne of the biggest opportunities you can take advantage of is SERP features.\n\nGoogle seems to have hinted it as one of its priorities for search as far back\nas 2007. According to then-representative Marissa Mayer:\n\n> We [Google] want to help you find the very best answer, even if you don’t\n> know where to look.\n\nBut what exactly is a SERP feature, and how can we identify it?\n\nA SERP feature is any result on the SERPs that is not a traditional organic\nsearch result.\n\nIn brief, these are some of the most common SERP features and their basic\nrequirements:\n\n  *  **Featured snippets** – Provide a concise answer to a query.\n  *  **Video carousels** – Create a YouTube video on the topic.\n  *  **Image packs** – Provide a relevant image of what people are looking for.\n  *  **Top stories** – Publish relevant news stories on the topic.\n  *  **People Also Ask** – Answer a related question on the topic.\n\nUsing Ahrefs’ Site Explorer, we can see a list of current SERP features in the\n**Organic keywords** report by entering any website into the search bar and\nthen clicking on the **SERP features** filter.\n\nIn the example below, I have used ahrefs.com.\n\nFiltering results by specific **SERP features** can be useful for competitor\nanalysis or simply understanding which SERP features your website ranks for.\n\nSo what do SERP features look like in the wild?\n\nLet’s take a look at a featured snippet for “what are cats whiskers for” in\nGoogle search.\n\nAs we can see above, appearing in a featured snippet will mean you get more\nSERP real estate than a standard organic listing and will also mean that the\nresult appears at the top of the search results.\n\nThis is why SERP features are considered by some SEOs as the cheat codes for\nSEO. They can also potentially drive more traffic than your average organic\nresult.\n\nIf we return to our previous example of “how to leash train a dog,” we can see\nthat the **SERP overview** has identified the fifth result on this SERP as a\nvideo SERP feature.\n\nLet’s click on the caret next to **Videos** to expand this result.\n\nOnce we click on the caret, we can see the expanded result.\n\nThere are three videos in the carousel from 2016, 2017, and 2021. If we had\nthe resources to create video content for this query, creating a more up-to-\ndate, high-quality video could be a valuable shortcut to ranking well on this\nSERP.\n\nAssuming we managed to rank a video in the fifth position, this would leapfrog\nthe DR 26 website we looked at earlier in the sixth position.\n\nIf you created a blog post and a YouTube video targeting this search, you\ncould acquire traffic from two sources rather than just one.\n\nIn summary, targeting SERP features is worth your time if you have the\nresources available. Winning SERP features allows us to acquire more SERP real\nestate instead of just appearing for a single organic result for a search\nquery.\n\n## Final thoughts\n\nConducting a SERP analysis may sound daunting at first, but Keywords Explorer\nmakes it easy by giving you an overview of the key metrics you need to\nconsider.\n\nAfter that, it’s just a case of following the process and asking yourself:\n\n  * Can you provide a better answer to a keyword query than what is on the current SERP? \n  * Can you create higher-quality content than the top result for the query?\n  * Do you have sufficient resources to create the content?\n  * Are there any SERP features you can target to win more SERP real estate?\n\nIf the answer is “yes” to most of the above questions, you should have a\ndecent chance of cracking the SERP.\n\nWhat’s your experience with SERP analysis? Got more questions? Ping me on\nTwitter. 🙂\n\nCopy link\n\nArticle Performance\n\n  * Organic traffic __\n\n726\n\n  * Linking websites __\n\n37\n\nGet SEO metrics of any website or URL.\n\nSign up for Ahrefs →\n\nThe number of websites linking to this post.\n\nThis post's estimated monthly organic search traffic.\n\nGet the week's best marketing content\n\nEmail Subscription\n\nSubscribe\n\nLeave this field empty if you're human:\n\nArticle by\n\nChris Haines\n\nChris is an SEO director who has 10 years of experience in SEO, agency side.\nWhen not involved in SEO, he enjoys messing around with vintage synthesizers,\nwalks on sandy beaches, and a good cup of tea.\n\n____\n\nKeep Learning\n\nHow to Do an SEO Competitor Analysis\n\nDiscover how to outrank your competitors by analyzing the strengths and\nweaknesses of their SEO strategies.\n\nHow to Do a Content Gap Analysis [With Template]\n\nFollow our in-depth, step-by-step guide for doing competitive content gap\nanalysis for SEO. Easy gap analysis template included!\n\nSearch\n\nEnglish\n\n  * Deutsch\n  * Español\n  * Français\n  * Italiano\n  * Português\n  *  **中文**\n\nEnglishDeutschEspañolFrançaisItalianoPortuguês中文\n\n© 2024 Ahrefs Pte Ltd.\n\nPick a topic\n\nSEO\n\n  * General SEO\n  * Keyword Research\n  * On-Page SEO\n  * Link Building\n  * Technical SEO\n  * Local SEO\n  * Enterprise SEO\n\nMarketing\n\n  * General Marketing\n  * Content Marketing\n  * Affiliate Marketing\n  * Paid Marketing\n  * Video Marketing\n\nData & Studies\n\nProduct\n\nAhrefs Tools\n\nCore Tools\n\n  * Site Explorer\n  * Keywords Explorer\n  * Content Explorer\n  * Site Audit\n  * Rank Tracker\n\nFree Tools\n\n  * Backlink Checker\n  * Website Authority Checker\n  * Keyword Rank Checker\n  * Broken Link Checker\n  * SERP Checker\n\nClose\n\n\n\nJoin the Ahrefs' Digest\n\nGet the week's best marketing content in your inbox.\n\nEmail Subscription\n\nSubscribe\n\nLeave this field empty if you're human:\n\nThanks!\n\nPlease check your email inbox and spam folder. We've sent you a link to verify\nyour email.\n\nGot It\n\n",
    "links": "[{\"link\": \"https://ahrefs.com/\", \"text\": \"Subscribe\"}, {\"link\": \"https://ahrefs.com/\", \"text\": \"Subscribe\"}, {\"link\": \"https://ahrefs.com/\", \"text\": \"Ahrefs Pte Ltd.\"}, {\"link\": \"https://ahrefs.com/\", \"text\": \"Subscribe\"}]"
}