{
    "summary": "This website stores cookies on your computer. These cookies are used to\nimprove your website experience and provide more personalised services to you,\nboth on this website and through other media. To find out more about the\ncookies we use, see our Privacy Policy.\n\nWe won't track your information when you visit our site. But in order to\ncomply with your preferences, we'll have to use just one tiny cookie so that\nyou're not asked to make this choice again.\n\nManage settings\n\nAccept  Decline\n\nIt looks like you have have Javascript disabled. Some parts of the site may\nnot work as expected. Enable javascript for the full experience\n\nSkip to content\n\nOpen menu\n\nWhat we do\n\nSolutions\n\nCustomers\n\nPartners\n\nCompany\n\nInsights\n\nContact us\n\nTechnology\n\nOne-of-a-kind tech for change-making customers\n\nOur platform\n\nComposable approach\n\nProcess orchestration\n\nConfiguration as Code\n\nMulti-cloud approach\n\nSecurity & compliance\n\nServices\n\nFrom pre to post live and everything in between. We've got you covered.\n\nEnablement\n\nAdvisory\n\nEcosystem\n\nComposable is a team sport. Developers and partners make it a winning\nstrategy.\n\nDevelopers\n\nMarketplace\n\nLive demo\n\nLending solutions\n\nChoose from our range of configurable lending solutions that help customers\nchange their financial lives every day.\n\nLending\n\nSME lending\n\nMortgages\n\nPersonal lending\n\nBuy Now Pay Later\n\nPurchase finance\n\nDaily banking solutions\n\nOur banking solutions help you create modern financial experiences whether you\nneed to build, change or scale.\n\nDeposits\n\nStored value accounts\n\nBusiness banking & deposits\n\nPersonal banking & deposits\n\nOverarching solutions\n\nOffer complete business solutions with our composable platform and ready-made\nproduct catalogue.\n\nEmbedded finance\n\nBanking-as-a-Service\n\nOur customers\n\nBrowse our selection of customer stories and find out what they’re building\nand how we’re helping.\n\nSuccess stories\n\nWho we serve\n\nOur flexibility makes us the easy choice for any type of company wanting to\noptimise financial services.\n\nTraditional banks\n\nNeobanks\n\nLenders\n\nFintechs\n\nTelcos\n\neCommerce\n\nPartnership\n\nOur network includes all types of partners that support and add value to Mambu\ncustomers.\n\nPartner ecosystem\n\nIntegrated solutions\n\nTechnology partners\n\nConsulting partners & system integrators\n\nPartner programme\n\nEnablement and education of our partner community is the cornerstone of our\njoint success.\n\nPartner with Mambu\n\nPartner portal\n\nPartner finder\n\nBecome a Mambuvian\n\nWant to be a part of a team that builds extraordinary products and operates\nglobally?\n\nYour career\n\nOpen positions\n\nOur story\n\nThe history, mission and ethos that define what we do and why\n\nAbout us\n\nOur offices\n\nSustainability\n\nSee how we take responsibility for our operations and impacts.\n\nSustainability\n\nPeople, diversity and inclusion\n\nNewsGet the latest news and updates from Mambu, our partners and our\ncustomers.\n\nInsights hub\n\nYour one-stop shop for research, events, reports and perspectives on all\nthings financial, technology and more.\n\nArticles\n\nEvents\n\nWebinars\n\nPodcasts\n\nWhitepapers\n\nReports\n\nAll insights\n\nValue calculatorGet customised insights, market intelligence and forecast\ngrowth opportunities for your business.\n\n# What is KYC in financial services?\n\narticle\n\n14 Aug 2023\n\nby Mambu Communications\n\n4 min read\n\nRising internet usage fuels economic growth but also increases financial\ncrimes. To counter this, financial institutions must verify customer\nidentities before entering into a business relationship or transaction.\n\nKnow Your Customer (KYC) procedures have become a legal necessity for banks\nand financial institutions worldwide to ensure they know their customers and\ncomply with anti-money laundering (AML) regulations. Traditionally, KYC\ninvolved in-person meetings, but now many companies are transitioning to\nelectronic Know Your Customer (eKYC) processes, offering convenience for both\nbusinesses and customers. However, KYC compliance is no walk in the park,\ndemanding meticulous data assessment and collaboration across teams.\n\nThe ABC of KYC\n\nAutomated KYC workflows act as the vigilant gatekeepers of the financial\nworld, facilitating seamless onboarding for customers and institutions alike.\nKYC is integrated into the customer lifecycle, spanning from onboarding to\naccount maintenance, marketing, product openings, tax declarations, and more.\nAcross borders, KYC requirements may differ, but most programs encompass three\nfundamental components:\n\n  * Identity verification: Verifying the identity of individuals or business customers involves cross-checking names, addresses, and social security numbers on government-issued IDs with data from government and third-party databases.\n  * Customer due diligence: Ensuring customer compliance involves screening for illegal activities, sanctions, and terrorist watchlists, reviewing executive bios, company reports, and media press, analysing past transactions and behaviour. Banks must also identify politically exposed persons and those doing business in regions with higher money laundering risks.\n  * Ongoing monitoring: Consistently monitoring customers and their transactions to identify shifts in risk, suspicious behaviour, or potential fraud.\n\nKYC offers numerous advantages. It provides a comprehensive understanding of\ncustomers’ financial profiles, facilitates risk assessment for informed\nbusiness decisions, fosters long-term relationships, builds mutual trust, and\nensures regulatory compliance to enhance security and safety for both the FI\nand its customers.\n\nThe cost-cutting superhero\n\nMoney laundering, often linked to fraud and drug trafficking, has witnessed a\nsurge in identity theft as a major strategy, making KYC even more crucial.\nResearch from The Financial Accountability, Transparency and Integrity (FACTI)\nPanel, a UN-affiliated group, reveals that approximately 2.7% of global GDP is\nlaundered annually, costing US banks over $2 billion yearly in fines.\n\nStrengthening KYC processes has become imperative to combat the significant\namount of money laundering falling through the cracks. McKinsey reports that\naround 10% of a bank's workforce is involved in financial crime-related\nactivities, with KYC reviews being the most costly. Additionally, institutions\nspent $274.1 billion on financial crime compliance in 2022, as per Appian’s\nlatest report.\n\nAccording to a McKinsey study, banks that streamlined KYC processes\nexperienced remarkable results: a 61% decrease in second-line of defence\nreturns, a 17% quicker response time to information requests, and a 38%\nreduction in case completion time. Amid the current economic downturn,\nstreamlining KYC processes allows FIs to allocate resources efficiently and\nstay competitive in the digital era.\n\nScaling smartly\n\nFinancial institutions frequently find themselves ill-prepared to tackle the\nnumerous challenges posed by KYC compliance. On top of that, the pandemic\ntriggered a shift in banking, with more customers switching accounts,\npressurising financial institutions to speed up customer onboarding.\nAccelerating digital transformation and embracing automation is crucial for\nFIs to overcome the challenges of traditional time-consuming KYC processes. By\nadopting advanced KYC technologies, they can offer a superior digital\nexperience, beyond just price or product offerings.\n\nKYC automation is becoming an integral part of the transformation strategy for\nFIs. By doing so, they can not only grab their share of the market pie but\nalso position themselves for long-term benefits. SaaS solutions are already\ndriving improvements in this area, as these platforms are built on the\nassumption that the need for change is constant, so can quickly flex and adapt\nto changes.\n\nSeveral Mambu partners and leading companies in the identity verification\nspace are also leveraging AI and advanced technology to enhance customer\nexperience and security. For instance, Onfido employs AI for photo ID and\nfacial biometric verification, prioritising customer experience, conversion\nrates, privacy, and security. Similarly, IDnow’s robust solution verifies over\n7 billion customers worldwide from 195 countries, using AI to detect forged\ndocuments effectively. Additionally, Jumio offers a unified identity\nverification and eKYC platform, harnessing advanced tech like AI and\nbiometrics to combat fraud, expedite customer onboarding, and ensure\nregulatory compliance. Meanwhile, Fourthline, a European fintech, combines AI\nand human expertise to verify digital identities, performing 200 checks with a\nremarkable 99.98% accuracy rate, effectively enhancing the user experience\nwhile uncovering 60% more fraud.\n\nEmbracing a cloud-native foundation, such as Mambu, unlocks the full potential\nof KYC capabilities for financial institutions. By seamlessly integrating with\nthe best-of-breed KYC providers, banks can orchestrate their systems\nefficiently, enabling automatic identity verification, KYC, and AML checks.\nThe cloud-native banking platform securely stores all relevant information,\nensuring data privacy and compliance with regulatory requirements. Non-\nproprietary software and cloud technology offer financial institutions the\nfreedom to select tech partners and adapt quickly to changing regulations.\nThis flexibility and agility are crucial in the fast-evolving financial\nlandscape, allowing banks to scale up and down as needed, ensuring they remain\ncompetitive and future-ready.\n\n### Share this post\n\nMambu Communications\n\nOur PR & Communications team includes marketers, content creators and online\nexperts, and provides insights and expertise from the entire Mambu team. For\nmedia queries, please contact us at press@mambu.com.\n\n## Sign up for the latest news\n\n## Technology\n\n  * Our platform\n  * Lending\n  * Deposits\n  * Enablement\n  * Customers\n  * Marketplace\n\n## Company\n\n  * About\n  * Sustainability\n  * Modern Slavery statement\n  * Careers\n  * Our offices\n  * Partners\n  * Contact us\n\n## Insights\n\n  * Events\n  * Articles\n  * News\n  * Webinars\n  * Podcasts\n  * Reports\n\n## Developers\n\n  * Mambu support\n  * Mambu User Guide\n  * API Reference\n  * Mambu ecosystem\n  * Mambu status\n\nlinkedintwitteryoutubefacebookinstagram\n\n© Mambu 2023\n\nImprintPrivacySitemap\n\n"
}