{
    "summary": "  * English\n    * Español \n    * Italiano \n    * Français \n  * Take a tour\n  * Blog\n  * Support\n  * Sign in\n\n  * Our solutions \n    * All\n    *       * The Real Identity Platform Build trust with your customers using a flexible, end-to-end identity verification platform.\n\n        * The Real Identity Platform\n        * Take a tour\n        * Book a meeting\n        * Try for free\n        * All products\n      * Airside Mobile Verify once, share anywhere.\n\n    *       * Onfido Studio Orchestrate verifications and signals into easy-to-manage workflows.\n\n      * Onfido Atlas™ Get fair, fast, and accurate results with AI.\n\n      * Smart Capture SDK Integrate an exceptional capture experience.\n\n      * Verification Suite Access a library of verifications and fraud signals.\n\n        * Verification Suite\n        * Document verification\n        * Biometric verification\n        * Data verification\n        * Fraud detection\n  * Challenges we solve\n    * All\n    * Challenges\n      * All\n      * Customer acquisitionDrive growth using automated onboarding.\n      * Global complianceNavigate regulatory compliance in each region.\n      * Cost of customer acquisitionAutomate onboarding processes to reduce costs.\n      * Fraud preventionPrevent fraud to protect your business and customers.\n      * Customer use cases\n    * Use cases\n      * All\n      * KYCNavigate know your customer compliance.\n      * Identity verificationCreate confidence in user identity.\n      * Driver registrationMeet regulatory needs and protect your fleet.\n      * User onboardingAutomate onboarding and maximize conversion.\n      * Age verificationVerify a customer’s legal age.\n    * Related content\n      * All\n      * EU KYC requirements guide\n      * Guide to digital identity verification\n      * Identity fraud report\n  * Industries\n    * All\n    * Industries\n      * All\n      * Industries we partner with\n      * Financial servicesAutomate onboarding, prevent fraud, and navigate KYC.\n      * GamingSeamlessly onboard players and meet KYC requirements.\n      * HealthcareKnow your patient using digital verification.\n      * Sharing economyProtect your platform, reputation, and users.\n      * Retail & eCommercePrevent account takeover and chargeback fraud.\n      * TelecommunicationsMeet regulatory requirements and stop fraud.\n      * TransportVerify renters, drivers, and riders.\n    * Financial services in depth\n      * All\n      * Enhance customer engagement with digital banking\n      * Identity verification for traditional banks\n      * Onboarding for digital-first banks\n      * KYC for remittance services\n      * eKYC for lending services\n  * Our company\n    * All\n    * About Onfido\n      * All\n      * Supported documents\n      * About Onfido\n      * Partners\n      * Leadership\n      * Certifications\n    * Learn more\n      * All\n      * Why Onfido?\n      * Press\n      * Careers\n    * Featured partnership\n      * All\n      * SalesforceLearn how our partnership embeds identity verification directly in Salesforce.\nLatest customer story\n\n      * All\n      * LemonwayLearn how Lemonway has doubled its number of validated wallets and accounts.\n  * Resources\n    * All\n    * Resources\n      * All\n      * BlogRead about all things digital identity.\n      * Customer storiesLearn how businesses succeed with Onfido.\n      * Reports & whitepapersGet in-depth research, insights, and guidance.\n      * VideosWatch expert webinars and videos.\n    * For developersEverything you need to get started with Onfido.\n      * All\n      * Developer hub\n      * API reference\n      * Release notes\nSupport\n\n      * All\n      * Knowledgebase\n      * Customer success & professional services\n\n  * Get in touch Try for free\n\nKYC  AML  Supported documents  All products  Interactive tour  ROI calculator\nFraud report  Financial services\n\nClose\n\nWe're now ETSI TS 119 461 certified! Learn how we're creating 'verify once,\nshare anywhere' digital identity.\n\nRead the guide\n\nWe're now ETSI TS 119 461 certified!  |  Learn how we're creating 'verify\nonce, share anywhere' digital identity.\n\nWe're now ETSI TS 119 461 certified!  |  Learn more about ETSI technical\nstandards for identity verification, what they mean for your business, and how\nto stay compliant in our EU KYC guide.\n\nRead the guide\n\nDismiss\n\n#  Digital identity  \nmade simple\n\nCreate trust at onboarding and beyond with a complete, AI-powered digital\nidentity solution built to help you know your customers online.  Automation\nallows you to acquire new customers and reduce costs while meeting global KYC\nand AML compliance.\n\nGet in touch  See how it works\n\nOnfido recogized as a Leader in 7 identity verification areas by G2 user-\ngenerated ratings.  See where.\n\n#  Digital identity  \nmade simple\n\nCreate trust at onboarding and beyond with a complete, AI-powered digital\nidentity solution built to help you know your customers online.  Automation\nallows you to acquire new customers and reduce costs while meeting global KYC\nand AML compliance.\n\nGet in touch  See how it works\n\nOnfido recogized as a Leader in 7 identity verification areas by G2 user-\ngenerated ratings.  See where.\n\nTrusted by 1000+ global businesses\n\nPrevious\n\nNext\n\n##  How can Onfido  \nhelp your business?\n\n##  **Onboard more customers**\n\nMake a great first impression using our Smart Capture SDK with automated\nidentity verification powered by Atlas™ AI.\n\nDrive growth\n\n##  **Navigate compliance**\n\nSatisfy global and local regulatory compliance, including KYC, AML, and age\nverification requirements.\n\nMeet compliance\n\n##  **Prevent advanced fraud**\n\nStop identity fraud using award-winning document and biometric verifications,\ndata sources, and passive fraud detection signals.\n\nPrevent fraud\n\n##  **Reduce cost and complexity**\n\nAutomate onboarding to reduce the cost of customer acquisition. It’s easy to\norchestrate journeys that make verification simple.\n\nReduce costs\n\nOur solution\n\n##  The Real Identity Platform\n\nPut digital trust at the core of every customer interaction. Powered by fast,\nfair, and accurate AI, the Real Identity Platform brings together a global\nsuite of identity verifications and signals into an easy-to-use orchestration\nstudio.\n\nExplore the platform\n\n###  Verification Suite\n\nVerify customer identities using a library of award-winning document and\nbiometric verifications, trusted data sources, and passive fraud signals.\n\nDocument Verification  Biometric Verification  Data Verification  Fraud\nDetection\n\nExplore Verification Suite\n\n###  Onfido Studio\n\nOrchestrate digital identity verification and fraud prevention journeys that\npresent the right verifications at the right moments — no code required.\n\nExplore Onfido Studio\n\n###  Atlas™ AI\n\nAutomate onboarding, KYC compliance, and identity verification with the power\nof Onfido Atlas™, our award-winning AI technology developed in-house over 10\nyears.\n\nExplore Onfido Atlas™\n\n###  Smart Capture SDK\n\nDeliver an exceptional, bias-free identity verification experience for your\ncustomers using Onfido Smart Capture, our easy-to-integrate SDK built with\naccessibility in mind.\n\nExplore Smart Capture\n\n##  Real Identity Platform tour\n\nTake a tour\n\nProduct innovation\n\n##  Multi-layer fraud detection\n\nPrevent large-scale fraud attacks with a multi-layer approach to fraud\ndetection. Now available as part of the Onfido Real Identity Platform, Repeat\nAttempts flags when users submit a previously seen identity document — even if\nit’s been altered to contain different data. Known Faces alerts when a face\nhas been seen before. Device Intelligence recognizes risky IP addresses, bots,\ndevice integrity and geolocation. Together, these solutions add extra layers\nof fraud protection with no additional user friction.\n\nSee our latest product innovations\n\nDeveloper resources\n\n##  Built by developers for developers\n\nTake advantage of detailed documentation, product guides, API libraries, and\nreference materials that help you get up and running with ease.\n\n### Developer Hub\n\nGet everything you need to configure and integrate with the Onfido Real\nIdentity Platform.\n\nExplore resources\n\n### API reference\n\nMake integration quick and efficient using our comprehensive technical\nreference guides.\n\nGet documentation\n\n### Professional Services\n\nOur integration and success teams’ mission is to deliver maximum value for our\ncustomer.\n\nLearn more\n\n##  Recognized as a leader\n\nWith more than a decade of identity verification, fraud detection, and AI\ndevelopment experience, Onfido is recognized as a global technology leader\nproviding automated digital identity and authentication solutions.\n\n### Leading Vendor: Account Opening Financial Services\n\nLiminal Link Index 2023\n\nRead report\n\n### Best AI product in FinTech\n\nCogX 2022\n\nLearn more\n\n### Identity Verification Leader\n\nG2 Fall 2023\n\nLearn more\n\n### Identity Verification Momentum Leader\n\nG2 Fall 2023\n\nLearn more\n\n### Biometric Authentication Leader\n\nG2 Fall 2023\n\nLearn more\n\n### Anti-money Laundering Leader\n\nG2 Fall 2023\n\nLearn more\n\n### Europe Fraud Detection Leader\n\nG2 Fall 2023\n\nLearn more\n\n### Users Love Us\n\nG2\n\nLearn more\n\n### Company of the Year Award for Identity Verification Solutions\n\nFrost & Sullivan, 2023\n\nLearn more\n\n### Security Orchestration Solution of the Year\n\nCyberSecurity Breakthrough Award 2022\n\n### Best Innovation in Computer Vision\n\nCogX 2023\n\n## We required a quick, tactical solution that did not involve expensive IT\nengineering costs. Onfido Studio was perfect as it was an ‘off-the-shelf’\nproduct that we could plug into our application process but without\nintegrating it fully into our mainframe systems.\n\n###  Darren Prescott, Senior Manager Current Accounts & Credit Cards, The Co-\nOperative Bank\n\n## Partnering with Onfido has helped us deliver a premium onboarding\nexperience for new customers while enabling us to meet strict KYC\nrequirements. The sheer scale of Onfido’s identity verification has\naccelerated our strategic growth targets, supporting over 40,000 identity\nchecks daily.\n\n###  Hasan Luongo, VP of Global Marketing, Chipper Cash\n\nRead the Chipper Cash story\n\n## We want to give every customer a quick set-up, a smooth experience, and\npowerful credit access. That starts at onboarding — with Onfido, we have a\nfast, accurate, and human-less way to verify our customers, enabling our\ncompliance at scale.\n\n###  Eric Suen, Vice President of Technology, DBS\n\nRead the DBS Bank story\n\n## With Onfido Studio, Access Group is creating a superior user journey,\nmodifying the way candidates can prove their identity digitally. We went to\nfull production in just four weeks, providing over 3,000 identity verification\nchecks for Right to Work screenings in the two weeks that followed, with the\nagility of Studio to scale our operation.\n\n###  Colin Whipp, Head of Account Management, The Access Group\n\nRead The Access Group story\n\n## We're pleased to be part of this new approach, powering background checks\nand screening thanks to our partnership with Onfido. By providing the highest\nlevels of identity proofing, applicants are able to prove their status and\nmanage onboarding processes wherever they are and at a time to suit them. The\ndays of photocopying and in-person manual review are now in the past.\n\n###  Callum Murray, CEO, Amiqus\n\nRead the press release\n\nView all customer stories\n\nWhat’s new?\n\n##  Keep up to date with identity insights and resources\n\nAll resources\n\nTendoPay streamlines customer onboarding for Financial Services with Onfido\n\nOver 95% of new applications process in under 5 minutes 50% reduction in\nsuspicious cases The background: TendoPay is a dynamic financial services\ncompany, with…\n\nRead more\n\nJob&Talent selects Onfido to accelerate user onboarding process with trusted\nidentity verification\n\nOnfido, the global leader in automated identity verification, today announced\na partnership with Job&Talent, a world-leading marketplace headquartered in\nSpain, for essential work. Together, they…\n\nRead more\n\nGoing glocal: Onfido and guest speaker Andras Cser discuss unlocking global\ngrowth amid Europe’s regulatory maze\n\nExperts discuss how companies can scale globally while navigating Europe’s\ncomplex and fragmented regulatory landscape without compromising user\nonboarding experience San Francisco, CA, & London,…\n\nRead more\n\nEmbracing glocalization: bridging global outreach with local standards\n\nIn an era where businesses are extending their reach beyond local boundaries,\nstepping into the global arena is no longer a choice but a necessity.…\n\nRead more\n\nFrankenstein fraud, or cybercrime’s modern Prometheus?\n\nWhile Frankenstein was the doctor, not the monster he assembled from old body\nparts, the analogy with synthetic identity fraud is too good to pass…\n\nRead more\n\nWearonize integrates Onfido’s identity verification solution to power seamless\nuser onboarding\n\nFintech as a Service provider selects Onfido for its AI-powered digital\nidentity solution to streamline and secure customer onboarding. Onfido, the\nglobal leader in automated…\n\nRead more\n\n##  Ready to get started?\n\nOur identity experts are available to talk through your requirements, answer\nquestions, and set up a demo.\n\nContact us  Try for free\n\n**Onfido uses 256-bit SSL encryption 100% of the time on every device.**\n\nOnfido is SOC 2 Type II compliant.\n\nOnfido has been certified by BSI to ISO 27001 under certificate number IS\n660122.\n\n* * *\n\n  * Solutions\n    * Real Identity Platform\n    * Verification Suite\n    * Onfido Studio\n    * Onfido Atlas\n    * Smart Capture SDK\n  * Challenges we solve\n    * Compliance\n    * Customer acquisition\n    * Reducing cost of acquisition\n    * Fraud prevention\n  * Industries\n    * Financial services\n    * Gaming\n    * Healthcare\n    * Marketplaces & communities\n    * Retail & eCommerce\n    * Telecommunications\n    * Transport\n  * Our company\n    * About Onfido\n    * Why Onfido?\n    * Onfido partners\n    * Certifications\n    * Leadership\n    * Press\n    * Contact us\n    * Airside\n  * Resources\n    * Blog\n    * Supported documents\n    * Developer hub\n    * API reference\n    * Release notes\n    * Support\n    * Sign in\n\nFollow us\n\nBack to top\n\n* * *\n\n© Onfido, 2023. All rights reserved.  \nCompany registration number: 07479524.\n\n  * Service status\n  * Privacy Policy\n  * Website and B2B Privacy Policy\n  * Security and Compliance\n  * Cookie and SDK Policy\n  * Terms of Use\n  * Anti Modern Slavery Statement\n  * Responsible Security Bug Disclosure Policy\n\nCookie Preferences Cookie Preferences Cookie Preferences Cookie Preferences\n\n  \nWe care about your privacy! This website uses cookies to improve your\nexperience, tailor content to your preferences, and analyze performance and\ntraffic on our website. We share information about use of our site with our\nsocial media, advertising and analytics partners.\n\nSettings Accept\n\nYour Opt Out Preference Signal is Honored\n\n## Privacy Preference Center\n\nWhen you visit any website, it may store or retrieve information on your\nbrowser, mostly in the form of cookies. This information might be about you,\nyour preferences or your device and is mostly used to make the site work as\nyou expect it to. The information does not usually directly identify you, but\nit can give you a more personalized web experience. Because we respect your\nright to privacy, you can choose not to allow some types of cookies. Click on\nthe different category headings to find out more and change our default\nsettings. However, blocking some types of cookies may impact your experience\nof the site and the services we are able to offer.  \nMore information\n\nAllow All\n\n###  Manage Consent Preferences\n\n#### Strictly Necessary Cookies\n\nAlways Active\n\nThese cookies are necessary for the website to function and cannot be switched\noff in our systems. They are usually only set in response to actions made by\nyou which amount to a request for services, such as setting your privacy\npreferences, logging in or filling in forms. You can set your browser to block\nor alert you about these cookies, but some parts of the site will not then\nwork.\n\n#### Performance Cookies\n\nPerformance Cookies\n\nThese cookies allow us to count visits and traffic sources so we can measure\nand improve the performance of our site. They help us to know which pages are\nthe most and least popular and see how visitors move around the site. All\ninformation these cookies collect is aggregated and therefore anonymous. If\nyou do not allow these cookies we will not know when you have visited our\nsite, and will not be able to monitor its performance.\n\n#### Functional Cookies\n\nFunctional Cookies\n\nThese cookies enable the website to provide enhanced functionality and\npersonalisation. They may be set by us or by third party providers whose\nservices we have added to our pages. If you do not allow these cookies then\nsome or all of these services may not function properly.\n\n#### Targeting Cookies\n\nTargeting Cookies\n\nThese cookies may be set through our website by our third party advertising\npartners. They may be used by those companies to build a profile of your\ninterests and to better reach you with personalised ads and content, both on\nour own website and third-party websites, apps, and other online services\n(“Services”). Advertising cookies enable the third party ad companies to track\nyour visits to the Services, to better understand your preferences and\ninterests in order to provide you more relevant ads on behalf of us and other\ncompanies. If you do not allow Targeting Cookies, you will still see ads\nonline but they may be less relevant to you.\n\nBack Button\n\n### Cookie List\n\nSearch Icon\n\nFilter Icon\n\nClear\n\ncheckbox label label\n\nApply Cancel\n\nConsent Leg.Interest\n\ncheckbox label label\n\ncheckbox label label\n\ncheckbox label label\n\nReject All Confirm My Choices\n\n"
}