{
    "summary": "Medical News Today\n\n  * Health Conditions\n  * Health Products\n  * Discover\n  * Tools\n  * Connect\n\nSubscribe\n\n# Why do we need magnesium?\n\nMedically reviewed by Miho Hatanaka, RDN, L.D. — Written by Megan Ware, RDN,\nL.D. —  Updated on October 25, 2023\n\n  * Benefits\n  * Recommended intake\n  * Sources\n  * Deficiency\n  * Risks\n  * Interactions\n  * Supplements\n  * Summary\n\nWe include products we think are useful for our readers. If you buy through\nlinks on this page, we may earn a small commission. Here’s our process.\n\n## How we vet brands and products\n\n **Medical News Today only shows you brands and products that we stand\nbehind.**\n\nOur team thoroughly researches and evaluates the recommendations we make on\nour site. To establish that the product manufacturers addressed safety and\nefficacy standards, we:\n\n  *  **Evaluate ingredients and composition:** Do they have the potential to cause harm?\n  *  **Fact-check all health claims:** Do they align with the current body of scientific evidence?\n  *  **Assess the brand:** Does it operate with integrity and adhere to industry best practices? \n\nWe do the research so you can find trusted products for your health and\nwellness.\n\nRead more about our vetting process.\n\nWas this helpful?\n\nMagnesium plays a role in over 300 enzyme reactions in the human body.\nMagnesium functions include helping with muscle and nerve function, regulating\nblood pressure, and supporting the immune system.\n\nAn adult body contains around 25 gram (g) of magnesiumTrusted Source, 50–60%\nof which the skeletal system stores. The rest is present in muscle, soft\ntissues, and bodily fluids.\n\nMany people in the United States do notTrusted Source get enough magnesium in\ntheir diet, though deficiency symptoms are uncommon in otherwise healthy\npeople.\n\nDoctors link magnesium deficiency with a range of health complications, so\npeople should aim to meet their daily recommended levels of magnesium.\n\nAlmonds, spinach, and cashew nuts are some of the foods highest in magnesium.\nIf a person cannot get enough magnesium through their diet, their doctor may\nrecommend taking supplements.\n\nIn this article, we look at the function and benefits of magnesium, what it\ndoes in the body, dietary sources, and possible health risks doctors link to\ntoo much.\n\n##\n\nBenefits\n\nShare on PinterestMany types of nuts and seeds are rich in magnesium.\n\nMagnesium is one of seven essential macrominerals. These macrominerals are\nminerals that people need to consume in relatively large amounts — at least\n100 milligrams (mg) per day. Microminerals, such as iron and zinc, are just as\nimportant, though people need them in smaller amounts.\n\nMagnesium is vital for many bodily functions. Getting enough of this mineral\ncan help prevent or treat chronic diseases, includingTrusted Source\nAlzheimer’s disease, type 2 diabetes, cardiovascular disease, and migraine.\n\nThe following sections discuss the function of magnesium in the body and its\neffects on a person’s health.\n\n### 1\\. Bone health\n\nWhile most research has focused on the role of calcium in bone health,\nmagnesium is also essential for healthy bone formation.\n\nResearch from 2013Trusted Source has linked adequate magnesium intake with\nhigher bone density, improved bone crystal formation, and a lower risk of\nosteoporosis in females after menopause.\n\nMagnesium may improve bone health both directly and indirectly, as it helps to\nregulate calcium and vitamin D levels, which are two other nutrients vital for\nbone health.\n\n### 2\\. Diabetes\n\nResearch has linked high magnesium diets with a lower risk of type 2 diabetes.\nThis may be because magnesium plays an important roleTrusted Source in glucose\ncontrol and insulin metabolism.\n\nA 2015 reviewTrusted Source in the _World Journal of Diabetes_ reports that\nmost, but not all, people with diabetes have low magnesium and that magnesium\nmay play a role in diabetes management.\n\nA magnesium deficiency may worsen insulin resistance, which is a condition\nthat often develops before type 2 diabetes. On the other hand, insulin\nresistance may cause low magnesium levels.\n\nIn many studies, researchers have linked high magnesium diets with diabetes.\nIn addition, a systematic review from 2017 suggests that taking magnesium\nsupplements can also improve insulin sensitivity in people with low magnesium\nlevels.\n\nHowever, researchers need to gather more evidence before doctors can routinely\nuse magnesium for glycemic control in people with diabetes.\n\n### 3\\. Cardiovascular health\n\nThe body needs magnesium to maintain the health of muscles, including the\nheart. Research has found that magnesium plays an important role in heart\nhealth.\n\nA 2018 review reports that magnesium deficiency can increase a person’s risk\nof cardiovascular problems. This is partly due to its roles on a cellular\nlevel. The authors observe that magnesium deficiency is common in people with\ncongestive heart failure and can worsen their clinical outcomes.\n\nPeople who receive magnesium soon after a heart attack have a lower risk of\nmortality. Doctors sometimes use magnesium during treatment for congestive\nheart failure (CHF) to reduce the risk of arrhythmia, or abnormal heart\nrhythm.\n\nAccording to a 2019 meta-analysisTrusted Source, increasing magnesium intake\nmay lower a person’s risk of stroke. They report that for each 100 mg per day\nincrease in magnesium, the risk of stroke reduced by 2%.\n\nSome research also suggests that magnesium plays a role in hypertension.\nHowever, according to the Office of Dietary SupplementsTrusted Source (ODS),\nbased on current research, taking magnesium supplements lowers blood pressure\n“to only a small extent.”\n\nThe ODS call for a “large, well-designed” investigation to understand the role\nof magnesium in heart health and the prevention of cardiovascular disease.\n\n### 4\\. Migraine headaches\n\nMagnesium therapy may helpTrusted Source prevent or relieve headaches. This is\nbecause a magnesium deficiency can affect neurotransmitters and restrict blood\nvessel constriction, which are factors doctors link to migraine.\n\nPeople who experience migraines may have lower levels of magnesium in their\nblood and body tissues compared with others. Magnesium levels in a person’s\nbrain may be low during a migraine.\n\nA systematic review from 2017Trusted Source states that magnesium therapy may\nbe useful for preventing migraine. The authors suggest that taking 600 mg of\nmagnesium citrate appears to be a safe and effective prevention strategy.\n\nThe American Migraine Foundation report that people frequently use doses of\n400–500 mg per day for migraine prevention.\n\nThe amounts that may have an affect are likely to be high, and people should\nonly use this therapy under the guidance of their doctor.\n\nRead more about magnesium for migraine.\n\n### 5\\. Premenstrual syndrome\n\nMagnesium may also play a role in premenstrual syndrome (PMS).\n\nSmall-scale studies, including a 2012 articleTrusted Source, suggest that\ntaking magnesium supplements along with vitamin B-6 can improve PMS symptoms.\nHowever, a more recent 2019 reviewTrusted Source reports that the research is\nmixed, and further studies are needed.\n\nThe American College of Obstetricians and Gynecologists suggest that taking\nmagnesium supplements could help to reduce bloating, mood symptoms, and breast\ntenderness in PMS.\n\n### 6\\. Anxiety\n\nMagnesium levels may play a role in mood disorders, including depression and\nanxiety.\n\nAccording to a systematic review from 2017Trusted Source, low magnesium levels\nmay have links with higher levels of anxiety. This is partly due to activity\nin the hypothalamic-pituitary-adrenal (HPA) axis, which is a set of three\nglands that control a person’s reaction to stress.\n\nHowever, the review points out that the quality of evidence is poor, and that\nresearchers need to do high quality studies to find out how well magnesium\nsupplements might work for reducing anxiety.\n\n### Further resources\n\nFor more in-depth resources about vitamins, minerals, and supplements, visit\nour dedicated hub.\n\nWas this helpful?\n\n##\n\nRecommended daily intake\n\nThe following table shows the recommended daily allowance (RDA) for magnesium\nintake by age and sex, according to the ODSTrusted Source.\n\n **Age**|  **Male**|  **Female**  \n---|---|---  \n1–3 years| 80 mg| 80 mg  \n4–8 years| 130 mg| 130 mg  \n9–13 years| 240 mg| 240 mg  \n14–18 years| 410 mg| 360 mg  \n19–30 years| 400 mg| 310 mg  \n31–50 years| 420 mg| 320 mg  \n51+ years| 420 mg| 320 mg  \n  \nPeople should increase their magnesium intake by around 40 mg per day during\npregnancy.\n\nExperts base the adequate intake for babies under 1 year old on the amounts\nfound in breastmilk.\n\n##\n\nSources\n\nMany foods contain high levels of magnesium, including nuts and seeds, dark\ngreen vegetables, whole grains, and legumes. Manufacturers also add magnesium\nto some breakfast cereals and other fortified foods.\n\nThe best sources of magnesium includeTrusted Source:\n\n **Source**|  **Per serving**|  **Percentage of daily value**  \n---|---|---  \nAlmonds (1 ounces or oz)| 80 mg| 20%  \nSpinach (half a cup)| 78 mg| 20%  \nRoasted cashews (1 oz)| 74 mg| 19%  \nOil roasted peanuts (one-quarter cup)| 63 mg| 16%  \nSoy milk (1 cup)| 61 mg| 15%  \nCooked black beans (half a cup)| 60 mg| 15%  \nCooked edamame beans (half a cup)| 50 mg| 13%  \nPeanut butter (2 tablespoons)| 49 mg| 12%  \nWhole wheat bread (2 slices)| 46 mg| 12%  \nAvocado (1 cup)| 44 mg| 11%  \nPotato with skin (3.5 oz)| 43 mg| 11%  \nCooked brown rice (half a cup)| 42 mg| 11%  \nLow fat yogurt (8 oz)| 42 mg| 11%  \nFortified breakfast cereals| 40 mg| 10%  \nOatmeal, instant, 1 packet| 36 mg| 9%  \nCanned kidney beans (half a cup)| 35 mg| 9%  \nBanana (1 medium)| 32 mg| 8%  \n  \nWheat products lose magnesium when the wheat is refined, so it is best to\nchoose cereals and bread products made with whole grains. Most common fruits,\nmeat, and fish contain low in magnesium.\n\nRead more about 10 healthful high magnesium foods here.\n\n##\n\nMagnesium deficiency\n\nWhile many people do not meet their recommended intake for magnesium,\ndeficiency symptoms are rare in otherwise healthy people. Magnesium deficiency\nis known as hypomagnesemia.\n\nMagnesium inadequacy or deficiency can resultTrusted Source from excess\nconsumption of alcohol, a side effect of certain medications, and some health\nconditions, including gastrointestinal disorder and diabetes. Deficiency is\nmore common in older adults.\n\nSymptoms of magnesium deficiency include:\n\n  * a loss of appetite\n  * nausea or vomiting\n  * fatigue or weakness\n\nSymptoms of more advanced magnesium deficiency include:\n\n  * muscle cramps\n  * numbness\n  * tingling\n  * seizures\n  * personality changes\n  * heart rhythm changes or spasms\n\nResearch has linked magnesium deficiency with a range of health conditions,\nincludingTrusted Source Alzheimer’s disease, type 2 diabetes, cardiovascular\ndisease, and migraine.\n\n##\n\nRisks of too much magnesium\n\nAn overdose of magnesium through dietary sources is unlikely because the body\nwill eliminate any excess magnesium from food through urine.\n\nHowever, a high intake of magnesium from supplements can lead to\ngastrointestinal problems, such as diarrhea, nausea, or cramping.\n\nVery large doses can cause kidney problems, low blood pressure, urine\nretention, nausea and vomiting, depression, lethargy, a loss of central\nnervous system (CNS) control, cardiac arrest, and possibly death.\n\nPeople with a kidney disorder should not take magnesium supplements unless\ntheir doctor advises that they do so.\n\n##\n\nDrug interactions\n\nMagnesium supplementation may also give rise to some drug interactions.\nMedications that may interact with magnesium supplements or affect magnesium\nlevels includeTrusted Source:\n\n  * oral bisphosphonates that treat osteoporosis, such as alendronate (Fosamax)\n  * tetracycline antibiotics, including doxycycline (Vibramycin) and demeclocycline (Declomycin)\n  * quinolone antibiotics, including levofloxacin (Levaquin) and ciprofloxacin (Cipro)\n  * diuretics, such as furosemide (Lasix)\n  * prescription proton pump inhibitors, including esomeprazole magnesium (Nexium)\n\n##\n\nShould I take supplements?\n\nMagnesium supplements are available to purchase online, but it is best to\nobtain any vitamin or mineral through food because nutrients work better when\npeople combine them with other nutrients.\n\nMany vitamins, minerals, and phytonutrients work synergistically. This term\nmeans that taking them together brings more health benefits than taking them\nseparately.\n\nIt is better to focus on a healthful, balanced diet to meet daily requirements\nfor magnesium and to use supplements as a backup, but under medical\nsupervision.\n\n##\n\nSummary\n\nMagnesium is an essential macronutrient that plays a key role in many body\nprocesses, including muscle, nerve, and bone health, and mood.\n\nResearch has linked magnesium deficiencies with a range of health\ncomplications. If a person is unable to get their daily requirements from\ntheir diet, a doctor may recommend taking magnesium supplements.\n\nLast medically reviewed on January 6, 2020\n\n  * Diabetes\n  * Bones / Orthopedics\n  * Cardiovascular / Cardiology\n  * Nutrition / Diet\n  * Cat 1\n  * minerals\n\n### How we reviewed this article:\n\nSources\n\nMedical News Today has strict sourcing guidelines and draws only from peer-\nreviewed studies, academic research institutions, and medical journals and\nassociations. We avoid using tertiary references. We link primary sources —\nincluding studies, scientific references, and statistics — within each article\nand also list them in the resources section at the bottom of our articles. You\ncan learn more about how we ensure our content is accurate and current by\nreading our editorial policy.\n\n  * Barbagallo, M., & Dominguez, L. J. (2015). Magnesium and type 2 diabetes.  \nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC4549665/\n\n  * Boyle, N. B., _et al._ (2017). The effects of magnesium supplementation on subjective anxiety and stress—A systematic review.  \nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC5452159/\n\n  * Castiglioni, S., _et al._ (2013). Magnesium and osteoporosis: Current state of knowledge and future research directions.  \nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC3775240/\n\n  * DiNicolantonio, J. J., _et al._ (2018). Magnesium for the prevention and treatment of cardiovascular disease.  \nhttps://openheart.bmj.com/content/5/2/e000775\n\n  * Ebrahimi, E., _et al._ (2012). Effects of magnesium and vitamin B6 on the severity of premenstrual syndrome symptoms.  \nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC4161081/\n\n  * Gröber, U., _et al._ (2015). Magnesium in prevention and therapy.  \nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC4586582/\n\n  * Magnesium. (2013).  \nhttps://americanmigrainefoundation.org/resource-library/magnesium/\n\n  * Magnesium [Fact sheet]. (2019).  \nhttps://ods.od.nih.gov/factsheets/Magnesium-HealthProfessional/\n\n  * Moslehi, M., _et al._ (2019). The association between serum magnesium and premenstrual syndrome: A systematic review and meta-analysis of observational studies [Abstract].  \nhttps://www.ncbi.nlm.nih.gov/pubmed/30880352\n\n  * Premenstrual syndrome (PMS). (2015).  \nhttps://www.acog.org/Patients/FAQs/Premenstrual-Syndrome-PMS?IsMobileSet=false\n\n  * Silva Morais, J. B., _et al._ (2017). Effect of magnesium supplementation on insulin resistance in humans: A systematic review [Abstract].  \nhttps://www.sciencedirect.com/science/article/abs/pii/S0899900717300229?via%3Dihub\n\n  * Vitamins. (n.d.).  \nhttps://www.britannica.com/science/human-nutrition/Vitamins\n\n  * von Luckner, A., & Riederer, F. (2017). Magnesium in migraine prophylaxis—is there an evidence-based rationale? A systematic review [Abstract].  \nhttps://headachejournal.onlinelibrary.wiley.com/doi/abs/10.1111/head.13217\n\n  * Zhao, B., _et al._ (2019). The effect of magnesium intake on stroke incidence: A systematic review and meta-analysis with trial sequential analysis.  \nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC6692462/\n\nShare this article\n\nMedically reviewed by Miho Hatanaka, RDN, L.D. — Written by Megan Ware, RDN,\nL.D. —  Updated on October 25, 2023\n\n## Latest news\n\n  * Flavonoid-rich foods and drinks tied to an up to 28% lower risk of type 2 diabetes\n\n  * In Conversation: What makes a diet truly heart-healthy?\n\n  * Nightmares, 'daymares' could be tell-tale signs of autoimmune disease\n\n  * Hot nights and extreme temperatures may raise stroke risk, study finds\n\n  * Early memory problems in cognitively healthy people linked to Alzheimer's risk\n\n## Was this article helpful?\n\nYesNo\n\n### Related Coverage\n\n  * Signs and symptoms of low magnesium levels (magnesium deficiency)\n\nMagnesium deficiency is rare, but low magnesium levels can happen if the body\ndoes not get enough magnesium. Learn about the symptoms, treatment…\n\nREAD MORE\n\n  * Magnesium powder: What it is, potential benefits, and possible risks\n\nMedically reviewed by Adrienne Seitz, MS, RD, LDN\n\nMagnesium powder supplements can help some people reach the recommended daily\nallowance of magnesium. Learn more about possible benefits and risks…\n\nREAD MORE\n\n  * 9 of the best magnesium supplements: For sleep, anxiety, weight loss, and more\n\nMedically reviewed by Jillian Kubala, MS, RD\n\nMagnesium supplements can help support general health and well-being. Learn\nmore here.\n\nREAD MORE\n\n  * The 10 best selenium supplements of 2022: Should you take them?\n\nMedically reviewed by Jillian Kubala, MS, RD\n\nSelenium is a mineral that supports a range of body functions. Learn about the\nbenefits, side effects, recommended daily dosage, and 10 of the best…\n\nREAD MORE\n\n  * What to know about molybdenum\n\nMedically reviewed by Kathy W. Warwick, RDN, CDCES\n\nMolybdenum is an essential trace mineral that helps the body break down toxic\nsubstances. Most people consume enough molybdenum in their diet. Learn…\n\nREAD MORE\n\n## Get our newsletter\n\nKeep up with the ever-changing world of medical science with new and emerging\ndevelopments in health.\n\nSUBSCRIBE\n\nYour privacy is important to us\n\n  * About Us\n  * Contact Us\n  * Terms of Use\n  * Privacy Policy\n  * Privacy Settings\n  * Advertising Policy\n\n  * Health Topics\n  * Health Hubs\n  * Medical Affairs\n  * Content Integrity\n  * Newsletters\n  * Do Not Sell or Share My Personal Information\n  * © 2024 Healthline Media UK Ltd, Brighton, UK. All rights reserved. MNT is the registered trade mark of Healthline Media. Any medical information published on this website is not intended as a substitute for informed medical advice and you should not take any action before consulting with a healthcare professional. See additional information.\n\n© 2024 Healthline Media UK Ltd, Brighton, UK. All rights reserved. MNT is the\nregistered trade mark of Healthline Media. Any medical information published\non this website is not intended as a substitute for informed medical advice\nand you should not take any action before consulting with a healthcare\nprofessional. See additional information.\n\nAboutCareersAdvertise with us\n\nOUR BRANDS\n\nHealthlineMedical News TodayGreatistPsych CentralBezzy\n\n",
    "links": "[{\"link\": \"https://www.medicalnewstoday.com/product-selection-process\", \"text\": \"Here’s our process\"}, {\"link\": \"https://www.medicalnewstoday.com/about/brand-vetting\", \"text\": \"\"}]"
}