{
    "summary": "Skip to main content\n\n  * Home \n  * Conditions ____\n\n__Back\n\n### Conditions\n\nView All\n\n    * ADD/ADHD\n    * Allergies\n    * Arthritis\n    * Atrial fibrillation\n    * Breast Cancer\n    * Cancer\n    * Crohn's Disease\n    * Depression\n    * Diabetes\n    * DVT\n    * Eczema\n    * Eye Health\n    * Heart Disease\n    * HIV & AIDS\n    * Lung Disease\n    * Lupus\n    * Mental Health\n    * Multiple Sclerosis\n    * Migraine\n    * Pain Management\n    * Psoriasis\n    * Psoriatic Arthritis\n    * Rheumatoid Arthritis\n    * Sexual Conditions\n    * Skin Problems\n    * Sleep Disorders\n    * Ulcerative Colitis\n    * View All \n\n  * Drugs & Supplements ____\n\n__Back\n\n### Drugs & Supplements\n\n    * Drugs\n    * Supplements\n    * Pill Identifier\n    * Interaction Checker\n\n  * Well-Being ____\n\n__Back\n\n### Well-Being\n\nView All\n\n    * Aging Well\n    * Baby\n    * Birth Control\n    * Children's Health\n    * Diet & Weight Management\n    * Fitness & Exercise\n    * Food & Recipes\n    * Healthy Beauty\n    * Men's Health\n    * Parenting\n    * Pet Health\n    * Pregnancy\n    * Sex & Relationships\n    * Teen Health\n    * Women's Health\n    * View All \n\n  * Symptom Checker\n  * Find a Doctor\n  * More ____\n\n__Back\n\n### More\n\n    * News\n    * Blogs\n    * Podcasts\n    * Webinars\n    * Newsletters\n    * WebMD Magazine\n    * Best Hospitals\n    * Support Groups\n    * Orthopedics\n\n  * Privacy & More __\n\nSubscribe\n\n __\n\nLog In\n\nSearch\n\nSubscribe\n\n__\n\n  * Diet& Weight Management/\n  * Reference/\n\nHealth & Diet Guide __\n\n  * Popular Diet Plans\n  * Healthy Weight Resources\n  * Healthy Eating & Nutrition __\n    * Vitamins and Nutrients\n    * Understanding Fats\n  * Calorie Counting\n  * Best & Worst Choices\n  * View Full Guide \n\n# Magnesium\n\nMedically Reviewed by Zilpah Sheikh, MD on May 19, 2024\n\nWritten by R. Morgan Griffin\n\n  * What Is Magnesium?\n  * Magnesium Benefits\n  * How Much Magnesium Is Needed Daily?\n  * Foods High in Magnesium\n\n  * Magnesium Risks\n  * Takeaways\n  * \n\n5 min read\n\n## What Is Magnesium?\n\nMagnesium is a mineral that's crucial for the body's functions.\n\n **What does magnesium do for the body?**\n\nMagnesium helps keep blood pressure normal, bones strong, and the heart rhythm\nsteady. It also controls your blood sugar levels and makes protein and DNA.\n\n **Magnesium deficiency**\n\nWhen you don't get enough magnesium over time, you can end up with a\ndeficiency. You may not feel it right away because your body tries to hold on\nto what little magnesium it has in your pee. Some illnesses and medicines can\nalso mess with how your body handles magnesium, making deficiency more likely.\nSigns of a magnesium deficiency include:\n\n  * Not feeling hungry\n  * Feeling sick\n  * Throwing up\n  * Being tired\n  * Feeling weak\n\nIf you're really low on magnesium, you might feel numb and tingly, get muscle\ncramps, have seizures, or changes to your heart rhythm. Some people are more\nlikely to have a magnesium deficiency. They include:\n\n  * People with gut problems such as Crohn's or celiac disease\n  * People with type 2 diabetes\n  * People who misuse alcohol over a long period\n  * Older adults\n  * People who have parathyroid problems\n  * People who take certain drugs for diabetes and cancer\n  * People with kidney disease\n\nHealth care providers sometimes suggest that people with these conditions take\nmagnesium supplements.\n\nProton pump inhibitors (PPIs), a common type of medicine used to treat acid\nreflux, are also linked to low magnesium levels. Examples of PPIs include:\n\n  * Dexlansoprazole (Dexilant)\n  * Esomeprazole (Nexium)\n  * Lansoprazole (Prevacid)\n  * Omeprazole (Prilosec, Zegerid)\n  * Pantoprazole (Protonix)\n  * Rabeprazole (Aciphex)\n\nIf you take any of these medicines for a long time, your health care provider\nmay perform a blood test to check your magnesium level.\n\n## Magnesium Benefits\n\nExperts say that many people in the U.S. aren't eating enough foods with\nmagnesium. Adults who get less than the recommended amount of magnesium are\nmore likely to have high levels of inflammation markers. Inflammation has been\nassociated with major health conditions such as heart disease, diabetes, and\ncertain cancers. Also, low magnesium appears to be a risk factor for\nosteoporosis.\n\nThere's some evidence that eating foods high in magnesium and other minerals\ncan help prevent high blood pressure in people with prehypertension.\n\nDoctors prescribe intravenous or injected magnesium to treat other conditions,\nsuch as eclampsia during pregnancy and severe asthma attacks. Magnesium is\nalso the main ingredient in many antacids and laxatives.\n\n **Magnesium for anxiety**\n\nResearch shows magnesium could help you handle stress better and keep your\ncortisol levels in check. When your body doesn't have enough magnesium, stress\ncan hit you harder. And when you're under a lot of physical or mental\npressure, your magnesium levels can drop. The mineral may also calm your\nbrain's chemical messengers, helping you feel more relaxed and ease muscle\ntension and cramps.\n\n **Magnesium for migraines**\n\nResearchers have found that magnesium deficiency could play a role in migraine\nattacks. They're looking at whether magnesium supplements or IV treatments\ncould ease symptoms.\n\n **Magnesium and sleep**\n\nMagnesium might improve sleep by controlling a brain chemical called GABA,\nwhich is crucial for sleep. It can also help relax muscles and regulate your\nnervous system, which could mean you'll sleep better at night.\n\n **Does magnesium help you lose weight?**\n\nMagnesium supplements have shown promise in lowering body mass index (BMI),\nespecially in people with magnesium deficiency and obesity. This indicates\nthat the mineral may help reduce overall body fat.\n\n## How Much Magnesium Is Needed Daily?\n\nThe recommended dietary allowance (RDA) includes the magnesium you get from\nboth the food you eat and any supplements you take.\n\n **Category**\n\n|\n\n **Recommended Dietary Allowance (RDA)**  \n  \n---|---  \n  \n **CHILDREN**  \n  \n **1-3 years**\n\n|\n\n80 milligrams/day  \n  \n **4-8 years**\n\n|\n\n130 milligrams/day  \n  \n **9-13 years**\n\n|\n\n240 milligrams/day  \n  \n **FEMALES**  \n  \n **14-18 years**\n\n|\n\n360 milligrams/day  \n  \n **19-30 years**\n\n|\n\n310 milligrams/day  \n  \n **31 years and over**\n\n|\n\n320 milligrams/day  \n  \n **Pregnant**\n\n|\n\nUnder 19 years: 400 milligrams/day  \n19 to 30 years: 350 milligrams/day  \n31 years and up: 360 milligrams/day  \n  \n **Breastfeeding**\n\n|\n\nUnder 19 years: 360 milligrams/day  \n19 to 30 years: 310 milligrams/day  \n31 years and up: 320 milligrams/day  \n  \n **MALES**  \n  \n **14-18 years**\n\n|\n\n410 milligrams/day  \n  \n **19-30 years**\n\n|\n\n400 milligrams/day  \n  \n **31 years and up**\n\n|\n\n420 milligrams/day  \n  \n **Recommended magnesium intake for children**\n\n1-3 years: 80 milligrams/day  \n4-8 years: 130 milligrams/day  \n9-13 years: 240 milligrams/day  \n14-18 years: 360 milligrams/day\n\n**Recommended magnesium intake during pregnancy**\n\nUnder 19 years: 400 milligrams/day  \n19-30 years: 350 milligrams/day  \n31 years and up: 360 milligrams/day\n\n**Recommended magnesium intake while breastfeeding**\n\nUnder 19 years: 360 milligrams/day  \n19-30 years: 310 milligrams/day  \n31 years and up: 320 milligrams/day\n\nMost people get more than enough magnesium from foods and do not need to take\nmagnesium supplements, as too much of the mineral can be toxic. In addition to\nwhat you get from food, the highest dose you should take of magnesium\nsupplements is:\n\n  * 65 milligrams/day for children aged 1-3\n  * 110 milligrams/day for children aged 4-8\n  * 350 milligrams/day for adults and children aged 9 or older\n\n _ **These doses are the highest anyone should add to their diet. Many people\ntake in significant quantities of magnesium through the foods they eat. It's\nsafe to get high levels of magnesium naturally from food, but adding large\namounts of supplements to your diet can prove dangerous. Do not exceed these\nmaximum advised levels.**_\n\n## Foods High in Magnesium\n\nNatural food sources of magnesium include:\n\n  * Green, leafy vegetables such as spinach\n  * Nuts\n  * Seeds\n  * Beans, peas, and soybeans\n  * Whole-grain cereals\n  * Wheat germ\n  * Wheat\n  * Oat bran\n\nEating whole foods is always best. Magnesium can be lost during refinement and\nprocessing.\n\n## Magnesium Risks\n\nTaking magnesium may cause side effects and other problems. Here's a closer\nlook at some of them:\n\n **Magnesium side effects**\n\nMagnesium supplements can cause nausea, cramps, and diarrhea. Magnesium\nsupplements often cause softening of stool.\n\n **Magnesium interactions**\n\nMagnesium supplements may interact with certain medicines, including\ndiuretics, heart medicines, or antibiotics. If you take any medicine, check\nwith your health care provider before taking magnesium.\n\n **Conditions with extra risk factors**\n\nPeople with diabetes, intestinal disease, heart disease, or kidney disease\nshould not take magnesium before speaking with their health care provider.\n\n **Magnesium overdose**\n\nSigns of a magnesium overdose can include nausea, diarrhea, low blood\npressure, muscle weakness, and fatigue. At very high doses, magnesium can be\n_fatal_.\n\n## Takeaways\n\nMagnesium is a mineral vital for normal blood pressure, strong bones, and\nsteady heart rhythms. Many Americans don't get enough magnesium in their\ndiets, which can lead to health issues such as inflammation, osteoporosis, and\nhigh blood pressure. While doctors suggest magnesium supplements for people\nwith certain health conditions or taking specific medications, too much of the\nmineral can be harmful. Natural sources of magnesium include green leafy\nvegetables, nuts, beans, and whole-grain cereals.\n\nSources  Update History\n\nShare\n\nView privacy policy, copyright and trust info\n\nShare\n\nView privacy policy, copyright and trust info\n\nNext Article What Your Body Shape Says About Your Health __\n\n### More on Diet& Weight Management\n\n#### Ingredients Guide: Facts & Cooking Tips\n\n#### How to Lose Weight Safely\n\n#### 13 Ways to Fight Sugar Cravings\n\nRecommended\n\n### FEATURED\n\n###  Top doctors in Boydton, VA\n\nSS\n\n##### Dr. Shailesh Charud Shirolkar, MD\n\nInternal Medicine, Other Specialty, Hospital Medicine\n\n4.0\n\n2 Ratings\n\n35 Years Exp\n\n(252) 436-1148View Full Profile\n\nMJ\n\n##### Dr. Mark Girish Jablonski, MD\n\nDiagnostic Radiology, Internal Medicine\n\n0.0\n\n22 Years Exp\n\n(412) 230-8200View Full Profile\n\nLY\n\n##### Dr. Lisa Michelle York, MD\n\nFamily Medicine\n\n5.0\n\n1 Rating\n\n23 Years Exp\n\n(434) 447-7177View Full Profile\n\n### Find more top doctors on\n\n __Search\n\n __\n\n### Related Links\n\n  * Diet & Weight Management Home\n  * Diet News\n  * Diet Medical Reference\n  * Diet Blogs\n  * Diet Plans A-Z\n  * Popular Diet Plans\n  * Healthy Weight Guide\n  * Health Tools & Calculators\n  * Healthy Eating & Nutrition\n  * Best & Worst Health Choices\n  * All Health Guide Topics\n  * Weight Loss & Obesity\n  * Fitness & Exercise\n  * Food & Recipes\n  * Food Calculator\n  * BMI Calculator\n  * Diabetes\n  * Cholesterol Management\n  * More Related Topics\n\n### Sign up for our free Food & Fitness Newsletter\n\n#### Get tips for eating better and exercising smarter\n\nSubscribe\n\n## Thanks for subscribing!\n\n###\n\nBy clicking Subscribe, I agree to the WebMD Terms & Conditions & Privacy\nPolicy and understand that I may opt out of WebMD subscriptions at any time.\n\n__\n\n### Follow WebMD on Social Media\n\n### Download WebMD App\n\nPolicies\n\nAbout\n\nOur Apps\n\nFor Advertisers\n\n  * Privacy Policy\n  * Cookie Policy\n  * Editorial Policy\n  * Advertising Policy\n  * Correction Policy\n  * Your Privacy Choices\n  * Terms of Use\n\n  *   *   * \n\n© 2005 - 2024 WebMD LLC, an Internet Brands company. All rights reserved.\nWebMD does not provide medical advice, diagnosis or treatment. See additional\ninformation.\n\nBy using this site, you agree with our use of cookies. See our cookies Notice\n\nManage Preferences Accept Cookies\n\n## Privacy Preference center\n\n  * ### Your Privacy \n\n  * ### Privacy Preference center\n\n#### Your Privacy\n\nWhen you visit our website, we store cookies on your browser to collect\ninformation. The information collected might relate to you, your preferences\nor your device, and is mostly used to make the site work as you expect it to\nand to provide a more personalized web experience. However, you can choose not\nto allow certain types of cookies, which may impact your experience of the\nsite and the services we are able to offer. Click on the different category\nheadings to find out more and change our default settings according to your\npreference. You cannot opt-out of our First Party Strictly Necessary Cookies\nas they are deployed in order to ensure the proper functioning of our website\n(such as prompting the cookie banner and remembering your settings, to log\ninto your account, to redirect you when you log out, etc.). For more\ninformation about the First and Third Party Cookies used please follow this\nlink.  \nMore information\n\n#### Privacy Preference center\n\nPrivacy Preference center\n\nWe use cookies and other tracking technologies to provide you with a\npersonalized experience on our sites, such as showing you content and ads that\nare relevant to your interests. We may need to disclose certain information\ncollected through those tracking technologies, like your IP address or other\ninformation that may be deemed “personal information” under certain state\nprivacy laws, to our advertising partners or other technology providers, in\norder to provide such relevant content and advertising. That disclosure could\nbe considered a “sale,” “share” or “targeted advertising” under applicable\nlaw. You can choose to opt out of having your personal information disclosed\nto our partners for these activities by sliding the toggle above to the left\nand then clicking on the “Confirm My Choices” button, or by visiting this\nwebsite with an opt-out preference signal, such as Global Privacy Control.\nOpting out will not prevent you from seeing ads, but may result in ads or\ncontent that could be less relevant to your interests. Additionally, we may\nstill disclose your personal information to service providers and/or\nprocessors in accordance with law and our privacy policy. Please note that in\nsome cases supplemental terms may also apply to the data collected and shared\nthrough cookies and other tracking technologies, and these supplemental terms\ncan be found linked in the footer of the applicable website. You can read more\nabout our privacy practices, including managing opt-outs in your email or\naccount settings, by visiting our privacy policy, linked in the footer.\n\nBack Button\n\n### Cookie List\n\nFilter Button\n\nConsent Leg.Interest\n\ncheckbox label label\n\ncheckbox label label\n\ncheckbox label label\n\nClear\n\ncheckbox label label\n\nApply Cancel\n\nConfirm My Choices\n\nAllow All\n\n",
    "links": "[{\"link\": \"https://member.webmd.com/signin?appid=1&returl=https://www.webmd.com/diet/supplement-guide-magnesium\", \"text\": \" Log In \"}]"
}