{
    "summary": "\n\n  * Apple\n  *     * Store\n\n    * Mac\n\n    * iPad\n\n    * iPhone\n\n    * Watch\n\n    * AirPods\n\n    * TV & Home\n\n    * Entertainment\n\n    * Accessories\n\n    * Support\n\n  *   * 0+\n\n\n\nApp Store Preview\n\nOpen the Mac App Store to buy and download apps.\n\n#  Trust: Crypto & Bitcoin Wallet  17+\n\n##  Best and Secure Crypto Wallet\n\n##  SIX DAYS LLC\n\n###  Designed for iPad\n\n  * #61 in Finance \n  *     * 4.7 • 192.4K Ratings\n\n  *     * Free\n\n## Screenshots\n\n  * iPad \n  * iPhone \n\n  *   *   *   *   *   *   *   * \n\n## Description\n\nTrust Wallet is a self-custody crypto wallet trusted by 60+ million people.\nBuy Bitcoin & cryptocurrency, explore NFT collections, and access thousands of\nWeb3 dApps.\n\n  \n\nTrust Wallet is a multi-chain self-custody cryptocurrency wallet and secure\ngateway to thousands of Web3 decentralized applications (dApps).\n\n  \n\nTrust Wallet is already “trusted” and used by 60+ million people, and is the\neasiest way to store, send and receive digital assets, manage your NFT\ncollection, explore DeFi, GameFi, and the metaverse.\n\n  \n\nAs a secure self-custody crypto wallet, Trust Wallet allows you to take\ncomplete control of your crypto assets. That means no one can freeze your\nfunds, halt your withdrawals, or take your funds without your permission.\n\n  \n\nTrust Wallet supports 8+ million digital assets, non-fungible tokens (NFTs),\n70+ blockchains, and allows you to connect safely to thousands of Web3 dApps.\n\n  \n\nSo what can you do with dApps?\n\n  \n\nSwap coins and tokens across different blockchains, explore and manage your\nfavorite NFT collections, earn rewards on your crypto, play popular Web3\ngames, access the metaverse, and everything in between.\n\n  \n\nWith the Trust Wallet Mobile App, you get:\n\n  \n\nA SECURE SELF-CUSTODY CRYPTO WALLET\n\n  \n\nInstantly turn your mobile device into a powerful self-custody Web3 wallet and\ngateway to thousands of dApps. Trust Wallet also supports WalletConnect v2.\n\nWith a self-custody wallet like Trust Wallet, you’re always in complete\ncontrol of your digital assets. Use the app as your bitcoin wallet, NFT\nwallet, or crypto wallet for millions of assets.\n\n  \n\nINDUSTRY-LEADING SECURITY\n\n  \n\nSecure login and built-in security features that prevent unauthorized access\nto your assets.\n\nYour private keys are safely stored on your device and are strongly encrypted\nwith an AES algorithm. Also, we do not collect any contact information or\npersonal details.\n\n  \n\nMULTI-CHAIN FUNCTIONALITY & THE LARGEST TOKEN SUPPORT\n\n  \n\nTrust Wallet supports 70+ blockchains, and 8+ million assets including Bitcoin\n(BTC), Ethereum (ETH), Solana (SOL), (XRP) XRP, Cardano (ADA), Bitcoin Cash\n(BCH), BNB (BNB), Polygon (MATIC), Avalanche (AVAX), zkEVM, zkSync Era, and\nmore.\n\nManage NFTs from different blockchains easily in one place\n\n  \n\nTHE MOST EASY-TO-USE CRYPTO WALLET\n\n  \n\nBuy & Sell Bitcoin and cryptocurrencies via 3rd party fiat payment processors\nas well as swap and stake cryptocurrency securely – all without leaving the\napp.\n\nHelpful integrations like Coinbase Pay and Binance Pay to deposit crypto\nseamlessly from your exchange account in just a few clicks.\n\nLeverage our integrated tax feature, which is an optional tool for those who\nwant to report their taxes without the usual complexity of manually adding\ntransactions and wallets.\n\nTake advantage of our dApp browser and “plug and play” network auto-detect\nfeature, which makes connecting to dApps across different blockchains quick\nand easy.\n\n  \n\nADVANCED FEATURES FOR CRYPTO TECHIES\n\n  \n\nDive into more advanced features (if you consider yourself a crypto techie)\nlike adding custom tokens and adjusting your node settings.\n\nUse “watch addresses” to monitor all your crypto wallets in one place.\n\n  \n\nA WALLET USED BY 60+ MILLION PEOPLE\n\n  \n\nTrust Wallet is used by over 60 million people worldwide and supports multiple\nlanguages.\n\nSecurely store, send and receive crypto from family and friends, or your\nexchange account.\n\n  \n\nReady to turn your mobile device into your go-to Bitcoin Wallet, NFT Wallet,\nand crypto wallet for thousands of other digital assets?\n\n  \n\nIf you’re already a Trust Wallet Browser Extension user, you can quickly\nimport your wallet to move between mobile and desktop seamlessly — and if\nyou’re new to Trust Wallet, we’ll help you get started quickly and securely.\n\n  \n\nJoin 60+ million people who already trust our Wallet — get Trust Wallet today!\n\n  \n\nTrust Wallet is built with, and for our community. Have an idea, want to share\nfeedback, or need support? Reach out to us here: support@trustwallet.com and\nfollow us on Twitter: @TrustWallet\n\nmore\n\n## What’s New\n\nVersion History\n\nNov 21, 2023\n\nVersion 10.3\n\n• New Blockchains: Integration of Mantle, Juno, Akash, Axelar, and Agoric,\nexpanding blockchain diversity.\n\n• New Staking Options: Availability of staking on Juno, Akash, Axelar, and\nAgoric, offering varied yield opportunities.\n\n• Cross-Swap Expansion: Binance Smart Chain integration for enhanced asset\ntransfer capabilities.\n\n• Tron Staking Enhancements: Upgrades to improve efficiency and user\nexperience in Tron staking.\n\n• WalletConnect Security: Enhanced security with domain verification to\nbolster user trust.\n\nmore\n\n##  Ratings and Reviews\n\nSee All\n\n4.7 out of 5\n\n192.4K Ratings\n\n192.4K Ratings\n\nNecrophonic  ,  04/04/2021\n\n###  Make sure to have enough BNB\n\n> You have to have BNB to do any kind of transfer or transaction. That’s all\n> well and good because most transactions only cost an equivalent to 25 cents\n> of BNB more or less... but the app only lets you buy BNB in a minimum of $50\n> increments. If you’re only a few points of a percentage short in BNB, but\n> one of your other currencies is tanking and you want to get out from\n> underneath it, you still need to drop $50 just to get the couple of cents\n> worth of BNB that you need. You can’t even trade other currencies for BNB\n> within the app if you are a few cents short, to make up the difference.\n>\n>  \n>\n>\n> The only other option is to buy BNB in a smaller quantity directly from\n> Binance and then transfer it into your Trust Wallet... But that process\n> involves a a four-day hold on Binance’s end. By the time your four days are\n> up, the currency you are trying to trade might have tanked entirely.\n>\n>  \n>\n>\n> This app would be much better if you could trade other currencies for BNB\n> within the app, and it back-ended the BNB cost on the transfer.\n>\n> more\n\n###  Developer Response  ,\n\n> The app connects to a 3rd party provider for crypto purchases. The minimum\n> crypto purchase is set by the provider.\n>\n> The Built-In DEX will only allow trading of supported tokens, and a small\n> fee is required to do so. That is how a decentralized wallet works. Learn\n> more here: https://community.trustwallet.com/t/what-is-the-dex-inside-trust-\n> wallet/174\n>\n>  \n>\n>\n> more\n\nCryptoTrader@  ,  02/12/2023\n\n###  My Honest Review\n\n> Hi, I’ve lost a lot of Etherium trying Tryst wallet swap! But I came to\n> understand that every DEX/CEX has their failure implemented by the dev teams\n> knowingly/unknowingly! Recently, swap u do will never process, & if u\n> research how to cancel it, Trust wallet will give u one option that is bound\n> to fail so that u keep losing ETH trying to cancel pending transaction! They\n> know these things happen but they allow it to make ur life miserable! Simple\n> solution? Never use wallet connect feature, Write down ur secrete phrase on\n> paper, uninstall the trust wallet app, install new one & watch all those\n> pending garbage vanish! Trust wallet is becoming nuisance! They’ve been\n> taken over by other apps like ViaWallet, OKX and many others! I hate using\n> any of the old CEX/DEX making me lose eth in the name of useless gas fee!\n> What a boring idea to peg every swap with mountainous gas fee! Trust wallet,\n> Coinbase, Binance, FTX and many more are designed to fail! The future\n> doesn’t belong to them! That’s my observation! I swap between any crypto on\n> ViaWallet or OKX without hearing anything called Gwei or gas fee! Ask\n> urself, why? Why must I initiate transaction with high cost & it stays on\n> pending and often can’t be found on the Eth blockchain? These exchanges made\n> it so for greed & greed only! If u do not wake up now, u will not wake up\n> later! Nothing is 1% special about trust wallet in comparison to its\n> competitors! Prove me wrong!\n>\n> more\n\n###  Developer Response  ,\n\n> We are sorry to hear about your negative experience with Trust Wallet and\n> the frustration you've faced regarding failed swaps and pending\n> transactions. We understand the challenges with network fees, but it's\n> important to clarify that Trust Wallet itself does not impose these fees.\n> The fees are determined by the blockchain network and go directly to the\n> miners to process the transactions.\n>\n>  \n>\n>\n> While certain platforms may not charge such fees explicitly, the costs might\n> be integrated into other aspects of their services. We believe in being\n> transparent about the fees and allowing users to have control over their\n> assets and transactions.\n>\n>  \n>\n>\n> We appreciate your feedback and will strive to improve our services wherever\n> possible. Trust Wallet works continuously to enhance the user experience,\n> and your observations contribute to that process. However, we encourage you\n> to reach out to our support at support.trustwallet.com for any specific\n> concerns or guidance on how to navigate these issues. Your satisfaction and\n> the security of your assets are our top priorities.\n>\n> more\n\nk,nguyen  ,  05/14/2021\n\n###  Need my money back please. Please read it before you guys lose money\n\n> Before I downloaded this wallet I thought same thing with someone else think\n> that it was pretty good . I don’t know that it is fraud or not . I purchased\n> to buy BNB by my debit card via third party payment ( simplex payment) on\n> last Friday. It took the money right away after submitted . However , it\n> emailed to me and said that the transaction was canceled I will receive my\n> money back within 3 days but I haven’t received any money until now . I\n> emailed to them so many times but they just send me back automatically notes\n> about policies transactions two times. No one took care my emails . Even I\n> just would like to have transaction go through to have some BNB coin to\n> switch to other coins again but no one was available to help my questions .\n> I tried to click on BNb to buy again but it said unavailable so many times .\n> It is frozen now. I know that the simplex payment is the third party but\n> please tell them send back to me my money . With me only a few money that is\n> ok for me to lose it . If they don’t return to me . I’m apologizing to you\n> to give you 1 star because of it . Then I suggest that you guys don’t use\n> the simplex payment for customers anymore if there are so many cases like\n> mine. You guys will lose customers and the businesses in the future.\n>\n> more\n\n##  App Privacy\n\nSee Details\n\nThe developer, SIX DAYS LLC, indicated that the app’s privacy practices may\ninclude handling of data as described below. For more information, see the\ndeveloper’s privacy policy.\n\n### Data Not Linked to You\n\nThe following data may be collected but it is not linked to your identity:\n\n  * Diagnostics\n\nPrivacy practices may vary, for example, based on the features you use or your\nage. Learn More\n\n## Information\n\nSeller\n\n     SIX DAYS LLC \n\nSize\n\n    103.6 MB\n\nCategory\n\n     Finance \n\nCompatibility\n\n    \n\niPhone\n\n    Requires iOS 15.0 or later. \n\niPad\n\n    Requires iPadOS 15.0 or later. \n\niPod touch\n\n    Requires iOS 15.0 or later. \n\nMac\n\n    Requires macOS 12.0 or later and a Mac with Apple M1 chip or later. \n\nLanguages\n\n    \n\nEnglish, Arabic, Breton, Bulgarian, Burmese, Czech, Danish, French, German,\nGreek, Indonesian, Italian, Japanese, Kanuri, Kazakh, Korean, Laotian,\nLatvian, Polish, Portuguese, Romanian, Russian, Simplified Chinese,\nSinghalese, Slovak, Slovenian, Spanish, Swedish, Traditional Chinese, Turkish,\nUkrainian, Vietnamese\n\nmore\n\nAge Rating\n\n     17+ Unrestricted Web Access\n\nCopyright\n\n    © Copyright DApps Platform, Inc. 2023\n\nPrice\n\n    Free\n\n  * Developer Website \n  * App Support \n  * Privacy Policy \n\n  * Developer Website \n  * App Support \n  * Privacy Policy \n\n##  You Might Also Like\n\nSee All\n\nSafeMoon\n\nFinance\n\nSafePal: Crypto Wallet BTC NFT\n\nFinance\n\nAtomic Wallet\n\nFinance\n\nBitMart: Trade BTC, ETH, DOGE\n\nFinance\n\nKuCoin- Buy Bitcoin & Crypto\n\nFinance\n\nCoinGecko - Crypto & NFT Price\n\nFinance\n\nMore ways to shop: Find an Apple Store or other retailer near you. Or call\n1-800-MY-APPLE.\n\nChoose your country or region\n\nCopyright © 2023 Apple Inc. All rights reserved.\n\n  * Privacy Policy\n  * Terms of Use\n  * Sales and Refunds\n  * Legal\n  * Site Map\n\n",
    "links": "[{\"link\": \"https://apps.apple.com/us/app/trust-crypto-bitcoin-wallet/id1288339409?platform=ipad\", \"text\": \"\\n                  iPad\\n                \"}, {\"link\": \"https://apps.apple.com/us/app/trust-crypto-bitcoin-wallet/id1288339409?platform=iphone\", \"text\": \"\\n                  iPhone\\n                \"}, {\"link\": \"https://apps.apple.com/us/app/trust-crypto-bitcoin-wallet/id1288339409?see-all=reviews\", \"text\": \"\\n     See All\\n   \"}, {\"link\": \"https://apps.apple.com/us/app/trust-crypto-bitcoin-wallet/id1288339409?see-all=customers-also-bought-apps\", \"text\": \"\\n     See All\\n   \"}]",
    "priceAndPlans": "  * Global Nav Open Menu Global Nav Close Menu\n  * Apple\n  * Shopping Bag +\n\nSearch apple.com\n\nCancel\n\n  * Apple\n  * Store\n  * Mac\n  * iPad\n  * iPhone\n  * Watch\n  * AirPods\n  * TV & Home\n  * Only on Apple\n  * Accessories\n  * Support\n  *   * Shopping Bag +\n\nCancel\n\nThe Wayback Machine -\nhttp://web.archive.org/web/20220821191444/https://apps.apple.com/\n\nConnecting...\n\nMore ways to shop: Find an Apple Store or other retailer near you. Or call\n1-800-MY-APPLE.\n\nChoose your country or region\n\nCopyright © 2022 Apple Inc. All rights reserved.\n\nPrivacy Policy Terms of Use Sales and Refunds Legal Site Map\n\n"
}