{
    "summary": "Skip to content Skip to content\n\nMenu\n\n  * Search Anything\n\n  * About\n  * Edge-ucation\n  * Support\n  * Events\n  * Get Started\n\n  * About\n  * Edge-ucation\n  * Support\n  * Events\n  * Get Started\n\n  * About\n  * Edge-ucation\n  * Support\n  * Events\n  * Get Started\n\n  * About\n  * Edge-ucation\n  * Support\n  * Events\n  * Get Started\n\n#  Edge: Private and Secure Mobile Crypto Wallet Bitcoin Wallet\n\n__\n\n__\n\n__\n\n###  SECURE\n\nAutomatic client-side encryption ensures bitcoin keys are always encrypted and\nprotected from malware.\n\n###  PRIVATE\n\nHD address rotation, decentralized access, & zero-knowledge encryption make\nEdge the #1 most private cross-platform account.\n\n###  DECENTRALIZED\n\nConnectivity to multiple public bitcoin nodes ensures wallets function even if\nEdge servers are down.\n\n###  POWERFUL\n\nTransaction tagging and multiple wallets per account make the power users\nhappy.  \n\n###  INTUITIVE\n\nThe familiarity of a username & password hides the complexity of cryptography\nand synchronization.  \n\n###  EXPANDABLE\n\nEdge Login, plugins, and the Edge SDK connect the mobile wallet to a suite of\nother blockchain applications.\n\n###  SECURE\n\nAutomatic client-side encryption ensures bitcoin keys are always encrypted and\nprotected from malware.\n\n###  PRIVATE\n\nHD address rotation, decentralized access, & zero-knowledge encryption make\nEdge the #1 most private cross-platform account.\n\n###  DECENTRALIZED\n\nConnectivity to multiple public bitcoin nodes ensures wallets function even if\nEdge servers are down.\n\n###  POWERFUL\n\nTransaction tagging and multiple wallets per account make the power users\nhappy.  \n\n###  INTUITIVE\n\nThe familiarity of a username & password hides the complexity of cryptography\nand synchronization.  \n\n###  EXPANDABLE\n\nEdge Login, plugins, and the Edge SDK connect the mobile wallet to a suite of\nother blockchain applications.\n\n#### Incredibly rich functionality and features.\n\n06\n\nHierarchical Deterministic wallets with changing addresses per transaction\n\n07\n\nSupport for over 140 currency exchange rates\n\n08\n\nZero-access to user funds or transaction data by Edge or other 3rd parties\n\n09\n\nConfigurable mining fees per transaction\n\n10\n\nDecentralized server architecture. Wallets work even if Edge servers are down\n\n11\n\nOpen-source code. Available on Github\n\n01\n\nMulti-device synchronization across all mobile devices\n\n02\n\nOne-Touch 2-Factor Authentication\n\n03\n\nSimple password recovery\n\n04\n\nMultiple wallets per account with simple user defined wallet names\n\n05\n\nIntegration with address book to auto-complete payee name and photo\n\n06\n\nHierarchical Deterministic wallets with changing addresses per transaction\n\n07\n\nSupport for over 140 currency exchange rates\n\n08\n\nZero-access to user funds or transaction data by Edge or other 3rd parties\n\n09\n\nConfigurable mining fees per transaction\n\n10\n\nDecentralized server architecture. Wallets work even if Edge servers are down\n\n11\n\nOpen-source code. Available on Github\n\n01\n\nMulti-device synchronization across all mobile devices\n\n02\n\nOne-Touch 2-Factor Authentication\n\n03\n\nSimple password recovery\n\n04\n\nMultiple wallets per account with simple user defined wallet names\n\n05\n\nIntegration with address book to auto-complete payee name and photo\n\n06\n\nHierarchical Deterministic wallets with changing addresses per transaction\n\n____\n\n### About Bitcoin\n\nEdge is a mobile wallet that makes holding and trading bitcoin simple, while\nalso allowing users to send, receive, and trade additional digital currencies.\n\nEdge wallet is safe, secure, and user-friendly, resulting in a simple user\nexperience for both newbies and veterans alike.\n\n\n\n### **Download here**\n\niOS __\n\nAndroid __\n\nAndroid Direct Download __\n\n\n\n### **Secure**\n\nAutomatic client-side encryption ensures bitcoin keys are always encrypted and\nprotected from malware.\n\n\n\n### **Private**\n\nHD address rotation, decentralized access, & zero-knowledge encryption make\nEdge the #1 most private cross-platform wallet.\n\n\n\n### **Decentralized**\n\nConnectivity to multiple public bitcoin nodes ensures wallets function even if\nEdge servers are down.\n\n\n\n### **Powerful**\n\nTransaction tagging and the ability to import multiple private seeds into one\nsingle account makes the power users happy.\n\n\n\n### **Intuitive**\n\nCreating an account with the familiarity of a username & password hides the\ncomplexity of cryptography and having to write down complicated seed phrases.\n\n\n\n### **Expandable**\n\nEdge Login, in-app plugins, and the Edge SDK connect the mobile wallet to a\nsuite of other blockchain applications.\n\n\n\n## **Incredibly Rich Functionality and Features for the** **Edge Bitcoin\nWallet**\n\n  * Zero-access to user funds or transaction data by Edge or other 3rd parties\n  * Fast Touch/Face ID login on both iOS and Android\n  * Simple account creation using just a login & password (no printing of PDFs, writing down complicated seed phrases, or adding encryption settings)\n  * Automatic encrypted wallet backup to redundant peer-to-peer cloud servers\n  * One-Touch 2-Factor Authentication for the easiest-to-secure wallet in the world\n  * Quickly switch accounts with username drop down on login screens\n  * Multi-device synchronization across all mobile devices\n  * Simple password recovery capability\n  * Hierarchical Deterministic wallets with changing addresses per transaction\n  * Multiple wallets per account with simple user–defined wallet names (i.e. “Vacation Fund”)\n  * Support for over 140 currency exchange rates\n  * Configurable mining fees per transaction\n  * Decentralized server architecture. Wallets work even if Edge servers are down.\n  * Integration with address book to auto-complete payee name and photo\n  * Open-source code. Available on Github __.\n\n\n\nBitcoin is the reason we’re all here. After Satoshi Nakamoto released the\nfamous Bitcoin White Paper and started running the Bitcoin Blockchain, a\nrevolution was born. Our company was created to solve some of the challenges\nthat Bitcoin presented to its users.\n\nBitcoin is a fast–moving, evolving network. Edge has always kept up, giving\nusers the functionality they need to get the most out of what the Bitcoin\nnetwork has to offer. The Edge Wallet supports Segregated Witness\ntransactions, dynamic and custom mining fees, and connecting to your own full\nBitcoin node.\n\nBitcoin is the oldest and most secure blockchain in existence and continues to\nsolidify itself as high powered digital gold. Since our inception, we’ve been\ncommitted to helping users get the most out of Bitcoin, whether it be a\npayment method, store of value, or as an on-ramp to other digital currencies.\n\n\n\n## **The Benefits Of The Edge Bitcoin Wallet**\n\n### **1\\. Buy, Sell, and Save Bitcoin**\n\nIn addition to storing, transferring bitcoin between wallets, and receiving\ncryptocurrencies in their wallet, users can also swap assets while on the\nmove.\n\nCrypto enthusiasts can utilize the wallet’s built-in exchange functionality to\ntake advantage of market movements, even while away from their computer\nscreens. You can easily swap a cryptocurrency you think is going to fall in\nvalue for another currency of greater value.\n\n\n\n### **2\\. Mobile Access to Your Bitcoin and Other Crypto Assets**\n\nEdge wallet gives users access to their money anywhere, anytime. With Edge\ninstalled on their mobile device, users have complete freedom to instantly\nsend or receive any of our supported cryptocurrencies.\n\n\n\n### **3\\. Multi-Currency Support**\n\nUnlike many other mobile wallets, Edge supports multiple cryptocurrencies\nbeyond Bitcoin. In addition, we are continuously developing and striving to\nadd full support for additional currencies.\n\n\n\n### **4\\. Highly Secure**\n\nEdge includes robust security features never previously seen in a mobile, web-\nbased, or desktop cryptocurrency wallet. Click here to learn more about Edge’s\nsecurity features.\n\n\n\n### **5\\. Intuitive User Interface**\n\nWe’ve designed our user interface with accessibility in mind, making it easy\nto create and access numerous wallets from the main Wallets dashboard.\n\n\n\n## **Cryptocurrency Wallet vs. Exchange—What’s the Difference?**\n\nA cryptocurrency wallet is specialized software that enables an investor to\nsecurely store their holdings, with users having options to choose between\nboth hot wallets (online) and cold wallets (offline). Cold wallets are often\ndescribed as the “safest” way for an individual to secure their\ncryptocurrency. At Edge, we fundamentally disagree with this narrative, and\ninstead realize that “safety” and “security” are dependent on the threat a\nuser is securing against. In developing Edge, our goal has been to create a\nwallet that offers both a high degree of security, as well as usability. Edge\noffers the ease of access that comes from a hot wallet for regular use, along\nwith high levels of security previously said to only be achieved with cold\nwallets.\n\nThe term “wallet” is generally used to describe self-custody solutions where\nthe user holds their own private keys. Exchanges, on the other hand, are\ncustodians, meaning the exchange holds private keys on behalf of their\ncustomers. Exchanges were originally created to facilitate buying, selling,\nand trading different cryptocurrencies, with a variety of purchasing options.\nWallets were originally created to allow users to send, receive, and hold\ntheir own private keys, without having to rely on a third-party custodian.\n\nToday, many wallets have enabled exchange functionality inside of their\napplications. At Edge, our primary focus has been to provide robust, globally\naccessible exchange functionality inside of our application. While some\nwallets are more limited in their ability to support buying, selling, and\ntrading, Edge’s core focus is to offer these to our end users all across the\nglobe. This merger of exchange functionality into wallets has blurred the\nlines between what is a “wallet” and what is an “exchange”. The easiest\ndistinction to make is that wallets offer self-custody, while with exchanges,\nthe exchanges act as the custodian.\n\n\n\n## **Should I Keep My Crypto On An Exchange Or In A Wallet?  **\n\nThe decision on whether to keep your cryptocurrency on an exchange or in a\nwallet is entirely personal. However, keeping your cryptocurrency on an\nexchange may result in a complete loss of funds if either your personal\naccount or the exchange itself is hacked. As well, without controlling your\nown private keys, the exchange has complete control over your assets,\nresulting in third-party risk.\n\nIf you’re an active day trader, keeping a relatively small position on an\nexchange is a good option for facilitating regular moves in and out of\npositions. This is due to reduced fees and settlement times on exchanges\nrelative to the network fees and settlement times of on-chain transactions.\nUsers should strongly consider storing their holdings directly in a wallet\nrather than an exchange for any assets being held for the long term and\ntreated as an investment. Wallets offer far greater individual protection\nagainst hackers, with many having multiple layers of security to keep users’\ncrypto assets safe.\n\n## Get the latest on Crypto  \nSign up for our newsletter\n\nEmail(Required)\n\nCAPTCHA\n\nEmail\n\nThis field is for validation purposes and should be left unchanged.\n\nΔ\n\n## Wallets\n\n  * Bitcoin \n  * Ethereum \n  * Litecoin \n  * EOS \n  * Stellar \n  * XRP \n  * Dash \n  * Monero \n\n## Company\n\n  * About\n  * Crypto Loans\n  * Edge-ucation\n  * Events\n  * Get Started\n  * White Paper __\n  * Careers __\n  * FAQ __\n\n## Contact\n\n  * Submit Ticket __\n  * App Feedback __\n  * Request API Key __\n  * Call +1.619.777.5688\n  * Text +1.619.777.5688\n  * Request In-Person/Virtual Support __\n\nTwitter ____ Linkedin ____ Github ____ Youtube ____\n\nGet the App\n\n__\n\n__\n\n© Edge App 2023\n\n  * Terms of Service\n  * Privacy Policy\n\n  * Terms of Service\n  * Privacy Policy\n\nNotifications\n\n",
    "links": "[{\"link\": \"https://edge.app/bitcoin-wallet/?af=edge-app-bitcoin-wallet\", \"text\": \"\\n                    Bitcoin                \"}]",
    "priceAndPlans": "Error: Timeout 30000ms exceeded. =========================== logs\n=========================== navigating to\n\"http://web.archive.org/web/20231109134336/https://edge.app/\", waiting until\n\"load\" ============================================================\n\n"
}