{
    "summary": "__ Menu\n\n__Inloggen onze Vereende __ Menu\n\nZoek\n\nZoek\n\n  *     * Verzekeringen\n    * Schadeverzekeringen\n    * BAVAM-polis\n    * Schade melden als verzekerde\n    * Schade melden als tegenpartij\n    * Downloads\n  *     * Fondsen en Buitenland\n    * Waarborgfonds Motorverkeer\n    * Fonds Middelen Gemoedsbezwaarden\n    * Nederlands Bureau\n  *     * Pools\n    * Atoompool\n    * Terrorismepool\n  *     * Over ons\n    * Wie we zijn\n    * Veelgestelde vragen\n    * Werken bij de Vereende\n    * Pers & Jaarverslagen\n    * Complimenten & klachten\n    * Downloads verzekeren\n    * Fraude\n    * Governance\n    * Contact\n    * Naar homepage de Vereende\n    * Inschrijven nieuwsbrief\n\n  * Home\n  * Motorrijtuigverzekering\n  * Camperverzekering\n\n#  Camperverzekering\n\n**De camper was nog nooit zo populair als in de afgelopen coronatijd. Toen in\nde afgelopen zomer kamperen voor veel mensen nog de enige coronaproof optie\nvoor de vakantie bleek, schoten de camperverkopen omhoog. Er zijn in Nederland\nnu meer dan 140.000 campers geregistreerd. De camper blijft een ‘corona-\nveilige-manier’ om mee op vakantie te gaan en de populariteit van de camper\nwint hierdoor nog steeds terrein. En uiteraard heeft de Vereende voor de\nbijzondere campergevallen een passende verzekeringsoplossing.**\n\n### Camperverzekering  \n\nDe camperverzekering van de Vereende is een motorrijtuigverzekering die in\nieder geval bestaat uit de verplichte WA-dekking conform de Wet\naansprakelijkheidsverzekering motorrijtuigen (Wam). Naast deze verplichte\ndekking is, afhankelijk van een aantal factoren, zoals het gebruik en het\nbouwjaar een volledig cascodekking of een beperkt cascodekking bij te sluiten.\n\n### Voor wie?  \n\nU kunt bij de Vereende terecht als u uw camper niet kan verzekeren in de\nreguliere verzekeringsmarkt. Dit kan te maken hebben met de bijzondere aard\nvan het voertuig, bijvoorbeeld als het een omgebouwde touringcar is. Maar het\nkan ook dat uw vorige verzekeraar uw polis bijvoorbeeld heeft beëindigd\n(royement) vanwege wanbetaling of een te groot schadeverleden. Wellicht heeft\nu een strafrechtelijk verleden of heeft u ooit fraude gepleegd waardoor een\nandere verzekeraar u niet accepteert.\n\nEen verzekering bij de Vereende kunt u alleen afsluiten via een\nassurantieadviseur. Onderaan deze pagina kunt u, na het invullen van uw\npostcode, de dichtstbijzijnde adviseurs vinden. Neem contact op met één van\nhen voor meer informatie over het afsluiten van een verzekering bij de\nVereende.\n\n### Verzekerde  \n\nVerzekerd op de camperverzekering zijn verzekeringnemer (de eigenaar van de\ncamper), de bestuurder en de inzittenden van de camper. Inzittenden moeten wel\nvoldoen aan de wettelijke eisen, dus moeten zij op ‘geldige zitplaatsen’\nzitten tijdens het rijden. Dit zijn de zitplaatsen met goedgekeurde\nveiligheidsgordels.\n\n### Dekking\n\nDe WA-verzekering biedt dekking voor schade veroorzaakt met of door het\nverzekerde voertuig aan anderen.\n\nDe beperkt cascoverzekering voor de camper biedt dekking voor schade\nveroorzaakt door brand, diefstal/inbraak, ruitbreuk, storm, hagel en\naanrijding met dieren.\n\nDe volledig cascoverzekering voor de camper biedt dekking voor schade\nveroorzaakt door alles wat ook onder de beperkt cascoverzekering is gedekt en\ndaarbij ook nog andere gebeurtenissen, zoals botsingen en het van de weg of te\nwater raken van de camper. De schade is bij de cascodekking ook verzekerd als\ndeze door eigen schuld van de verzekerde is ontstaan.\n\nAanvullend kan ook nog gekozen voor een Ongevallen Inzittenden dekking (OI),\neen Schadeverzekering voor inzittenden (SVI) of motorrijtuigenrechtsbijstand.  \n\n### Premie\n\nDe WA-premie voor de camperverzekering is afhankelijk van verschillende\nfactoren. Denk bijvoorbeeld aan:\n\n  * De massa van het ledig voertuig (het ledig gewicht);\n  * Het soort gebruik van de camper, wordt deze uitsluitend privé gebruikt door u, of wordt deze ook verhuurd?\n  * Uw schadeverleden;\n  * Het aantal jaarlijks te rijden  kilometers en\n  * of het een standaard camper betreft of een omgebouwd ander voertuig.\n\nDe premie voor de eventuele casco- of beperkt cascodekking zal per geval\nmoeten worden vastgesteld en of deze dekking wordt verleend, is afhankelijk\nvan de situatie.\n\nAls bij een vorige verzekeraar met de camper schadevrije jaren zijn opgebouwd\ndie wij uit Roy-data kunnen overnemen, wordt er bonus/maluskorting op de\npremie verleend. Dit geldt zowel voor de WA-premie als voor de eventuele\nbeperkt casco en volledig cascopremie.\n\nDaarnaast is er assurantiebelasting verschuldigd. Voor de camperverzekering\ngeldt een percentage van 21% assurantiebelasting.\n\n###  ****Eigen risico\n\nAfhankelijk van het gebruik (verhuur of niet) van de camper geldt een\nstandaard eigen risico op de Wam- dekking. Bij eigen gebruik is het eigen\nrisico € 450,- per gebeurtenis, bij verhuur is het standaard eigen risico €\n500,-. Als het een bijzonder voertuig betreft, dus een omgebouwde bus of\nvrachtwagen, dan geldt standaard een eigen risico van €750,-.\n\nAls beperkt casco- of volledig cascodekking mogelijk is, dan kan daar ook een\neigen risico voor gelden. Dit is situatie-afhankelijk.\n\nDe van toepassing zijnde eigen risico’s op de camperverzekering worden vermeld\nop het polisblad.\n\n## Bijzonderheden\n\n**Verzekerd bedrag**  \n\nHet verzekerd bedrag voor de WA-dekking voor de camperverzekering is wettelijk\nbepaald en bedraagt € 1.220.000,00 voor schade aan zaken en € 6.070.000,00\nvoor schade aan personen.\n\n## Downloads\n\n__\n\nAlgemene Voorwaarden de Vereende\n\nDownload __\n\n__\n\nPolisvoorwaarden Motorrijtuigverzekering\n\nDownload __\n\n__\n\nAanvraagformulier motorrijtuigverzekering\n\nDownload __\n\n## Verzekeringskaart\n\n### Wat moet ik doen bij schade?\n\nAls u een beroep wilt doen op uw verzekering, meld dit dan bij uw\nassurantieadviseur. Hij/zij helpt u dan verder bij het afwikkelen van de\nschade.\n\n##  Verzekering afsluiten?  \nVind een adviseur in de buurt.\n\nEen verzekering van de Vereende kunt u alleen aanvragen en afsluiten via een\nassurantieadviseur. Voer hieronder uw postcode in en vind direct verschillende\nadviseurs in uw buurt.\n\nVind uw adviseur\n\n### Voor de assurantieadviseur\n\nDe camperverzekering kunt u in het Portaal OnzeVereende aanvragen. Heeft u nog\ngeen samenwerkingsverband met de Vereende? Neem dan contact op met ons\nserviceteam. Dit kan via serviceteam@vereende.nl of 070-3408110.  \n\nInschrijven nieuwsbrief  __Veel gestelde vragen Downloads  __Contact\n\ndoor:\n\n  * Privacy\n  * Disclaimer\n  * Fraude\n\n**Volg ons**\n\n  *   * \n\n© 2024 - Verzekeren\n\nMeld u nu aan voor onze nieuwsbrief 'Zeker Vandaag'\n\nSchrijf u in en we houden u elke twee weken op de hoogte van ons laatste\nnieuws.\n\nNee, ik ben niet geïnteresseerd\n\nBedankt\n\nBedankt voor uw aanmelding. U kunt uw profiel aanvullen onderaan elke\nnieuwsbrief. Zo kunnen wij Zeker Vandaag zo relevant mogelijk voor u maken.\n\nEr ging iets fout. Het e-mailadres is niet opgeslagen.\n\n",
    "links": "[{\"link\": \"https://verzekeren.vereende.nl/\", \"text\": \"\"}, {\"link\": \"https://verzekeren.vereende.nl/\", \"text\": \"Home\"}, {\"link\": \"https://verzekeren.vereende.nl/motorrijtuigverzekering\", \"text\": \"Motorrijtuigverzekering\"}, {\"link\": \"https://verzekeren.vereende.nl/disclaimer\", \"text\": \"Disclaimer\"}]",
    "priceAndPlans": "Error: Timeout 30000ms exceeded. =========================== logs\n=========================== navigating to\n\"http://web.archive.org/web/20240112212641/https://verzekeren.vereende.nl/\",\nwaiting until \"load\"\n============================================================\n\n"
}