{
    "summary": "### ACSI\n\nMenu\n\n#### Menu\n\n  * Voor kampeerders\n    * Verzekeringen\n    * Campinggidsen\n    * CampingCard ACSI\n    * ACSI Eurocampings\n    * Suncamp\n    * ACSI Kampeerreizen\n    * ACSI FreeLife\n    * Apps\n    * ACSI Club ID\n    * Over ons\n  * Zakelijk\n    * Samenwerken\n    * Productinformatie voor campings\n    * Informatie voor campings\n      * Voordelen van ACSI camping.info Booking\n      * Uw camping in een van de ACSI-gidsen?\n      * Deelnemende campings\n    * Contact voor campings en andere bedrijven\n  * Kampeernieuws\n  * Werken bij\n    * Vacatures\n    * ACSI als werkgever\n    * Inspecteurs\n    * Studenten & Starters\n    * Verhalen\n    * Contact met HR\n  * Mijn ACSI-account\n  * Contact\n  * Contact\n  * NL Nederlands\n    * DE Deutsch\n    * EN English\n    * FR Français\n    * IT Italiano\n    * ES Español\n    * DA Dansk\n\nHome > Verzekeringen > Camperverzekering\n\n# Camperverzekering\n\n  * Korting met de schadevrije jaren van uw auto\n  * Tot 3 jaar lang de aanschafwaarde vergoed\n  * Vervangende camper\n\nBereken uw premie\n\n**Voordelen**\n\n## Waarom de ACSI Camperverzekering?\n\n  * #### Meerwielentarief\n\nGebruik de schadevrije jaren van uw auto voor de verzekering van uw camper.\nDit scheelt aanzienlijk in premie.\n\n  * #### Aanschafwaarderegeling\n\nUw camper gestolen of _total loss_? Met de aanschafwaarderegeling van ACSI\nkrijgt u tot drie jaar lang de aanschafwaarde terug.\n\n  * #### Vervangende camper\n\nSluit pechhulpdekking af. Gebeurt er dan iets met uw camper? Dan krijgt u een\nvervangende camper (€ 125 per dag met een maximum van € 1.250).\n\n**Dekking ACSI Camperverzekering**\n\n## Dit is er allemaal verzekerd\n\nAls u plannen aan het maken bent voor een trip met uw camper, kampeerauto of\nbuscamper is schade, pech of diefstal wel het laatste waar u aan wilt denken.\nDe ACSI Camperverzekering is zeer flexibel. U kiest zelf hoe uitgebreid u\nverzekerd wil zijn. Alleen WA, Beperkt of Volledig Casco. En bij de ACSI\nCamperverzekering krijgt u **standaard tot 3 jaar de nieuw- of aanschafwaarde\nvan uw camper terug!**\n\nLet op: met deze verzekering bent u enkel verzekerd voor recreatief gebruik.\n\n**Met de ACSI Camperverzekering bent u verzekerd voor:**\n\n  * Schade die uw camper, kampeerauto of buscamper veroorzaakt aan anderen, andermans auto of spullen.\n  * Hulpverlening na een ongeval (onder andere slepen, vervoer naar huis bij een ongeluk of ziekte en noodreparaties).\n  * Reparatie: u mag zelf kiezen waar u de schade laat herstellen. Kiest u voor een aangesloten herstelbedrijf? Dan valt uw eigen risico lager uit.\n  * Vervangende camper (€ 125 per dag met een maximum van € 1.250). Kies de optie ‘pechhulp’ bij het afsluiten van de verzekering.\n  * Diefstal of _total loss_? U krijgt tot 3 jaar de nieuw- of aanschafwaarde van uw camper terug.\n\n**  \nMet een Beperkt Casco-dekking komt daar nog bij:**\n\n  * Schade door bijvoorbeeld brand, hagel, bliksem, overstroming of een aanrijding met een dier.\n  * Schade aan uw inboedel. Vergoeding van de schade is afhankelijk van de manier waarop de spullen zijn opgeborgen (in een gesloten kast of uit het zicht). Ook moet uw camper op slot zijn.\n  * Ruitschade.\n\n**Met een Volledig Casco-dekking komt daar nog bij:**\n\n  * Alle schade aan uw camper. Ook als de schade uw eigen schuld is.\n\n**Profiteer van 3% pakketkorting:**\n\n  * Combineer uw camperverzekering nu met een doorlopende reisverzekering en profiteer van 3% pakketkorting. \n  * Kies bij het afsluiten in stap 2 voor de doorlopende reisverzekering.\n  * U kunt dan direct uw (elektrische) fiets(en) gratis meeverzekeren.\n  * Kies dan voor fietsdekking tijdens het afsluiten.\n\nWist u dat u een lager eigen risico heeft als u uw schade laat herstellen bij\neen aangesloten herstelbedrijf? Een lijst van bij ACSI aangesloten\nherstelbedrijven vindt u hier.\n\nBereken uw persoonlijke premie eenvoudig en snel met onze Premiehulp.\n\n**Benieuwd naar alle voorwaarden en verzekerde bedragen?**\n\n  * Algemene voorwaarden ACSI Camperverzekering\n\n  * Bijzondere voorwaarden ACSI Camperverzekering\n\n  * Verzekeringskaart ACSI Camperverzekering\n\n#### **Gerelateerde producten**\n\n  * __Doorlopende Reisverzekering\n  * __Autoverzekering\n  * __Gezinsongevallen­verzekering\n\n#### **Onze partner**\n\nDe verzekering is samengesteld bij:\n\n**Premiehulp**\n\n## Wat betaal ik voor deze verzekering?\n\n__\n\n### Snel en eenvoudig uw premie berekenen\n\nBereken hier uw premie op basis van uw persoonlijke situatie en wensen.\n\nBereken uw premie\n\n**Wij staan voor u klaar**\n\n## Direct regelen\n\n  * __\n\n### Schade melden\n\n  * __\n\n### Wijzigingen\n\n  * __\n\n### Schade inzien\n\n  * __\n\n### Klantenservice\n\n## Heeft u vragen?\n\nWij beantwoorden ze graag. Kies hier op welke manier.\n\nFAQ\n\n## Veelgestelde vragen over de verzekeringen\n\n### **Tot welk gewicht kunnen campers worden verzekerd?**\n\nAlleen campers tot 3.500 kg kunnen worden verzekerd.\n\n### **Is pechhulp meeverzekerd?**\n\nDit is niet standaard meeverzekerd maar wel een aanvullende dekking die u kunt\nmeeverzekeren.\n\n###  **Heb ik recht op pechhulp in mijn eigen woonplaats?**\n\nDit is niet standaard meeverzekerd, maar u kunt kiezen voor een aanvullende\ndekking waarbij het is meeverzekerd.\n\n###  **Ben ik verzekerd als ik mijn camper verhuur?**\n\nU bent verzekerd voor verhuur aan een privépersoon als op uw polisblad staat\ndat dit is meeverzekerd. De verzekering voor particulier verhuur geldt niet\nbij bedrijfsmatig verhuur.\n\n###  **Kan ik de opgebouwde schadevrije jaren van mijn auto voor de camper\ngebruiken?**\n\nJa, dit is mogelijk. Hiervoor is het niet verplicht dat uw autoverzekering ook\nbij ons is ondergebracht.\n\n###  **Moet ik bij schade altijd naar een aangesloten herstelbedrijf?**\n\nNee, u heeft vrije keuze in het herstelbedrijf voor uw camper. Indien u voor\neen eigen risico heeft gekozen verlagen wij het eigen risico, als u de schade\nlaat repareren door een camperschadeherstelbedrijf waarmee we een\nsamenwerkingsovereenkomst hebben gesloten.  \n\n###  **Hoe lang ben ik in het buitenland verzekerd?**\n\nDe verzekering eindigt op de dag dat de camper zich langer dan 6\naaneengesloten maanden in het buitenland bevindt, of direct als de camper op\neen buitenlands kenteken wordt gezet.\n\nx\n\n### Neem contact met ons op\n\nVoornaam en achternaam *\n\nE-mailadres *\n\nSoort verzekering / onderwerp *\n\nVraag\n\nVerzenden\n\nStel hier een vraag\n\nMeld je aan voor onze nieuwsbrief\n\nAanmelden\n\n  * Facebook\n  * YouTube\n  * Instagram\n\n  * Voor kampeerders\n    * ACSI Gidsen\n    * CampingCard ACSI\n    * Apps\n    * ACSI FreeLife\n    * ACSI Club ID\n    * SunLodges\n  * ACSI Verzekeringen\n    * Caravanverzekering\n    * Camperverzekering\n    * Reisverzekering\n    * Autoverzekering\n    * Woonhuisverzekering\n    * Alle ACSI verzekeringen\n  * Websites\n    * ACSI Webshop\n    * ACSI Eurocampings\n    * Suncamp\n    * ACSI Kampeerreizen\n    * CampingCard ACSI\n    * ACSI Klein & Fijn Kamperen\n  * Over ACSI\n    * Over ons\n    * ACSI Inspectieteam\n    * Historie\n    * Werken bij ACSI\n    * Nieuws\n    * Word affiliate partner\n    * Mijn ACSI-account\n  * Klantenservice & contact\n    * Klantenservice ACSI Verzekeringen\n    * Contactgegevens\n    * Samenwerken\n    * 085 747 04 70 vandaag tot 18:00 uur\n\nContactblok\n\n  * Cookies\n  * Privacy statement\n\n© 2024 ACSI Holding BV\n\n__\n\n__\n\n__\n\n__\n\n__\n\n## ACSI respecteert uw privacy\n\nDoor op 'Accepteren' te klikken, ga je akkoord met het gebruik van analytische\ncookies (die worden gebruikt om inzicht te krijgen in het gebruik van onze\nwebsite en ter verbetering van onze site en services) en tracking cookies\n(inclusief die van vertrouwde partners) die helpen beslissen welk product je\nop onze site en daarbuiten te zien krijgt, de bezoekers van onze website te\nmeten en je in staat stellen om dingen leuk te vinden of direct te delen op\nsocial media. Door op \"Cookie-instellingen\" te klikken, kun je je toestemming\nbeheren en meer informatie vinden over de cookies die we gebruiken.\n\nAccepteren\n\nCookie-instellingen\n\n## Voorkeurenmenu\n\nWanneer u een website bezoekt, kan er informatie in uw browser worden\nopgeslagen of eruit worden opgehaald, voornamelijk in de vorm van cookies.\nDeze informatie kan over u, uw voorkeuren of uw apparaat zijn en wordt\nvoornamelijk gebruikt om de website correct te laten werken. De informatie\nidentificeert u normaal gesproken niet direct, maar kan u een beter op uw\nvoorkeuren toegesneden surfervaring geven. Omdat we uw recht op privacy\nrespecteren, kunt u er voor kiezen sommige soorten cookies te blokkeren. Klik\nop de namen voor de verschillende categorieën voor meer informatie en om onze\nstandaardinstellingen te wijzigen. Weest u zich er echter wel van bewust dat\nhet blokkeren van sommige soorten cookies uw ervaring van de website en de\ndoor ons aangeboden diensten nadelig kan beïnvloeden.  \nMeer informatie\n\nAlle toestaan\n\n### Cookievoorkeuren beheren\n\n#### Strikt noodzakelijke cookies\n\nAltijd actief\n\nDeze cookies zijn nodig anders werkt de website niet. Deze cookies kunnen niet\nworden uitgeschakeld. In de meeste gevallen worden deze cookies alleen\ngebruikt naar aanleiding van een handeling van u waarmee u in wezen een dienst\naanvraagt, bijvoorbeeld uw privacyinstellingen registreren, in de website\ninloggen of een formulier invullen. U kunt uw browser instellen om deze\ncookies te blokkeren of om u voor deze cookies te waarschuwen, maar sommige\ndelen van de website zullen dan niet werken. Deze cookies slaan geen\npersoonlijk identificeerbare informatie op.\n\nLeveranciersdetails weergeven‎\n\n#### Functionele cookies\n\nFunctionele cookies\n\nDeze cookies stellen de website in staat om extra functies en persoonlijke\ninstellingen aan te bieden. Ze kunnen door ons worden ingesteld of door\nexterne aanbieders van diensten die we op onze pagina’s hebben geplaatst. Als\nu deze cookies niet toestaat kunnen deze of sommige van deze diensten wellicht\nniet correct werken.\n\nLeveranciersdetails weergeven‎\n\n#### Prestatiecookies\n\nPrestatiecookies\n\nDeze cookies stellen ons in staat bezoekers en hun herkomst te tellen zodat we\nde prestatie van onze website kunnen analyseren en verbeteren. Ze helpen ons\nte begrijpen welke pagina’s het meest en minst populair zijn en hoe bezoekers\nzich door de gehele site bewegen. Alle informatie die deze cookies verzamelen\nwordt geaggregeerd en is daarom anoniem. Als u deze cookies niet toestaat,\nweten wij niet wanneer u onze site heeft bezocht.\n\nLeveranciersdetails weergeven‎\n\n#### Doelgroepgerichte cookies\n\nDoelgroepgerichte cookies\n\nDeze cookies kunnen door onze adverteerders op onze website worden ingesteld.\nZe worden wellicht door die bedrijven gebruikt om een profiel van uw\ninteresses samen te stellen en u relevante advertenties op andere websites te\ntonen. Ze slaan geen directe persoonlijke informatie op, maar ze zijn\ngebaseerd op unieke identificatoren van uw browser en internetapparaat. Als u\ndeze cookies niet toestaat, zult u minder op u gerichte advertenties zien.\n\nLeveranciersdetails weergeven‎\n\nBack Button\n\n### Performance Cookies\n\nSearch Icon\n\nFilter Icon\n\nClear\n\ncheckbox label label\n\nApply Cancel\n\nConsent Leg.Interest\n\ncheckbox label label\n\ncheckbox label label\n\ncheckbox label label\n\n  * ### \n\n####\n\nView Cookies\n\n    * Name\n\ncookie name\n\nMijn keuzes bevestigen\n\n",
    "links": "[{\"link\": \"https://www.acsi.eu/nl/camper-verzekering/\", \"text\": \"Bereken uw premie\"}, {\"link\": \"https://www.acsi.eu/nl/camper-verzekering/\", \"text\": \"Bereken uw premie\"}, {\"link\": \"https://www.acsi.eu/nl/schade-melden/\", \"text\": \"\"}, {\"link\": \"https://www.acsi.eu/nl/wijzigingen-doorgeven/\", \"text\": \"\"}, {\"link\": \"https://www.acsi.eu/nl/mijn-verzekeringen/\", \"text\": \"\"}, {\"link\": \"https://www.acsi.eu/nl/klantenservice-acsi-verzekeringen/\", \"text\": \"\"}, {\"link\": \"https://www.acsi.eu/nl/verzekering/camperverzekering/\", \"text\": \"Camperverzekering\"}, {\"link\": \"mailto:?subject=ACSI%20Camperverzekering%20%7C%20Veilig%20en%20Verzekerd%20op%20Reis&body=https://www.acsi.eu/nl/verzekering/camperverzekering/\", \"text\": \"\"}]"
}