{
    "summary": "## Cookies\n\nCookies maken de website van Nh1816 veiliger en zorgen voor een betere\ngebruikservaring. Noodzakelijke cookies maken inloggen makkelijker en\nanalytische cookies geven inzicht in het websitegebruik. De marketing cookies\nhelpen u de juiste informatie te geven. Hiervoor gebruiken wij cookies van\nderde partijen zoals Google en social media platformen. Per categorie kan\nworden aangegeven welke cookies geplaatst mogen worden.\n\nVerkoop of deel mijn persoonsgegevens niet\n\nAlleen noodzakelijke cookies Alle cookies toestaan Details tonen\n\nOK\n\nAlleen noodzakelijke cookies Selectie toestaan Alle cookies toestaan\n\nNoodzakelijk\n\nVoorkeuren\n\nStatistieken\n\nMarketing\n\nDetails tonen\n\nCookieverklaring [#IABV2SETTINGS#] Over\n\nNoodzakelijk (9) Voorkeuren (1) Statistieken (9) Marketing (34) Niet\ngeclassificeerd (6)\n\nNoodzakelijke cookies helpen een website bruikbaarder te maken, door\nbasisfuncties als paginanavigatie en toegang tot beveiligde gedeelten van de\nwebsite mogelijk te maken. Zonder deze cookies kan de website niet naar\nbehoren werken.\n\nNaam| Aanbieder| Doel| Vervaltermijn| Type  \n---|---|---|---|---  \nXSRF-TOKEN| bouwtimelapse.nl| Zorgt voor browsingveiligheid, door vervalsing\nvan cross-site verzoeken te voorkomen. Deze cookie is essentieel voor de\nveiligheid van de website en bezoeker.| 1 dag| HTTP  \n__RequestVerificationToken| businesssupport.nh1816.nl| Helpt Cross-Site\nRequest Forgery (CSRF) -aanvallen te voorkomen.| Session| HTTP  \nASP.NET_SessionId [x2]| businesssupport.nh1816.nl  \nwww.nh1816.nl| Houdt de sessiestatus van de bezoeker over paginavragen bij.|\nSession| HTTP  \nCookieConsent [x2]| businesssupport.nh1816.nl  \nCookiebot| Slaat de cookiestatus van de gebruiker op voor het huidige domein|\n1 jaar| HTTP  \n__cf_bm| Vimeo| Deze cookie wordt gebruikt om onderscheid te maken tussen\nmensen en bots. Dit is gunstig voor de website om juiste rapporten over het\ngebruik van de website te maken.| 1 dag| HTTP  \nDynamicweb.SessionVisitor| www.nh1816.nl| Houdt gebruikersstatussen over\npaginabezoeken bij.| 1 dag| HTTP  \nCONSENT| YouTube| Gebruikt om te detecteren of de bezoeker de\nmarketingcategorie in de cookie-banner heeft geaccepteerd. Deze cookie is\nnodig voor GDPR-naleving van de website.| 2 jaar| HTTP  \n  \nVoorkeurscookies zorgen ervoor dat een website informatie kan onthouden die\nvan invloed is op het gedrag en de vormgeving van de website, zoals de taal\nvan uw voorkeur of de regio waar u woont.\n\nNaam| Aanbieder| Doel| Vervaltermijn| Type  \n---|---|---|---|---  \nmaps/gen_204| Google| Wordt gebruikt in context met de kaartintegratie van de\nwebsite. De cookie slaat gebruikersinteractie met de kaart op om de\nfunctionaliteit ervan te optimaliseren.| Session| Pixel  \n  \nStatistische cookies helpen eigenaren van websites begrijpen hoe bezoekers hun\nwebsite gebruiken, door anoniem gegevens te verzamelen en te rapporteren.\n\nNaam| Aanbieder| Doel| Vervaltermijn| Type  \n---|---|---|---|---  \nc.gif| Microsoft| Verzamelt gegevens over de navigatie en het gedrag van de\nbezoeker op de website - Dit wordt gebruikt om statistische rapporten en\nheatmaps voor de website-eigenaar samen te stellen.| Session| Pixel  \n_clck| Microsoft| Verzamelt gegevens over de navigatie en het gedrag van de\nbezoeker op de website - Dit wordt gebruikt om statistische rapporten en\nheatmaps voor de website-eigenaar samen te stellen.| 1 jaar| HTTP  \n_clsk| Microsoft| Registreert statistische gegevens over het gedrag van\nbezoekers aan de website. Gebruikt voor interne analyse door de beheerder van\nde website.| 1 dag| HTTP  \n_ga| Google| Registreert een uniek ID die wordt gebruikt om statistische\ngegevens te genereren over hoe de bezoeker de website gebruikt.| 2 jaar| HTTP  \n_ga_#| Google| Verzamelt gegevens over het aantal keren dat een gebruiker de\nwebsite heeft bezocht, evenals data voor het eerste en meest recente bezoek.\nGebruikt door Google Analytics.| 2 jaar| HTTP  \nvuid| Vimeo| Verzamelt gegevens over de bezoeken van de gebruiker aan de\nwebsite, zoals welke pagina's zijn gelezen.| 2 jaar| HTTP  \n_cltk| Microsoft| Registreert statistische gegevens over het gedrag van\nbezoekers aan de website. Gebruikt voor interne analyse door de beheerder van\nde website.| Session| HTML  \nCLID| Microsoft| Verzamelt gegevens over de navigatie en het gedrag van de\nbezoeker op de website - Dit wordt gebruikt om statistische rapporten en\nheatmaps voor de website-eigenaar samen te stellen.| 1 jaar| HTTP  \ntd| Google| Registreert statistische gegevens over het gedrag van bezoekers\naan de website. Gebruikt voor interne analyse door de beheerder van de\nwebsite.| Session| Pixel  \n  \nMarketingcookies worden gebruikt om bezoekers te volgen wanneer ze\nverschillende websites bezoeken. Hun doel is advertenties weergeven die zijn\ntoegesneden op en relevant zijn voor de individuele gebruiker. Deze\nadvertenties worden zo waardevoller voor uitgevers en externe adverteerders.\n\nNaam| Aanbieder| Doel| Vervaltermijn| Type  \n---|---|---|---|---  \nMR [x2]| Microsoft| Gebruikt om bezoekers op meerdere websites te volgen, om\nrelevante advertenties te presenteren op basis van de voorkeuren van de\nbezoeker.| 7 dagen| HTTP  \nMUID [x2]| Microsoft| Veel gebruikt door Microsoft als een unieke gebruikers-\nID. De cookie maakt het volgen van gebruikers mogelijk door de ID in veel\nMicrosoft-domeinen te synchroniseren.| 1 jaar| HTTP  \nSRM_B| Microsoft| Gebruikt om de interactie van de bezoeker met de zoekfunctie\nvan de website te volgen. Deze gegevens kunnen worden gebruikt om de bezoeker\nrelevante producten of diensten te tonen.| 1 jaar| HTTP  \nANONCHK| Microsoft| Registreert gegevens over bezoekers die meerdere bezoeken\nbrengen en op meerdere websites. Deze informatie wordt gebruikt om de\nefficiëntie van advertenties op websites te meten.| 1 dag| HTTP  \nSM| Microsoft| Registreert een uniek ID die het apparaat van de gebruiker\nidentificeert tijdens terugkerende bezoeken op websites die hetzelfde\nadvertentienetwerk gebruiken. De ID wordt gebruikt om gerichte advertenties\ntoe te staan.| Session| HTTP  \nlastExternalReferrer|  Meta Platforms, Inc.| Achterhaalt op welke wijze de\ngebruiker naar de website is gekomen door zijn laatste URL-adres te\nregistreren.| Persistent| HTML  \nlastExternalReferrerTime|  Meta Platforms, Inc.| Achterhaalt op welke wijze de\ngebruiker naar de website is gekomen door zijn laatste URL-adres te\nregistreren.| Persistent| HTML  \nIDE| Google| Gebruikt door Google DoubleClick om de acties van de\nwebsitegebruiker te registreren en te rapporteren na het bekijken of klikken\nop een van de advertenties van de adverteerder met het doel de effectiviteit\nvan een advertentie te meten en om gerichte advertenties aan de gebruiker te\npresenteren.| 1 jaar| HTTP  \ntest_cookie| Google| Gebruikt om te controleren of de browser van de gebruiker\ncookies ondersteunt.| 1 dag| HTTP  \nads/ga-audiences| Google| Used by Google AdWords to re-engage visitors that\nare likely to convert to customers based on the visitor's online behaviour\nacross websites.| Session| Pixel  \npagead/1p-user-list/#| Google| In afwachting| Session| Pixel  \n_fbp|  Meta Platforms, Inc.| Gebruikt door Facebook om een reeks\nadvertentieproducten te leveren, zoals realtime bieden van externe\nadverteerders.| 3 maanden| HTTP  \n_gcl_au| Google| Gebruikt door Google AdSense om te experimenteren met de\nefficiëntie van advertenties op websites die hun services gebruiken.| 3\nmaanden| HTTP  \nDynamicweb| www.nh1816.nl| Bevat een uniek ID en de datum van het laatste\nbezoek van de gebruiker aan de website. Deze gegevens worden gebruikt om\nterugkerende gebruikers te herkennen om de inhoud van de website te\npersonaliseren en statistische gegevens te genereren.| 1 jaar| HTTP  \nLAST_RESULT_ENTRY_KEY| YouTube| Wordt gebruikt om de interactie van gebruikers\nmet embedded inhoud bij te houden.| Session| HTTP  \nLogsDatabaseV2:V#||LogsRequestsStore| YouTube| In afwachting| Persistent| IDB  \nnextId| YouTube| Wordt gebruikt om de interactie van gebruikers met embedded\ninhoud bij te houden.| Session| HTTP  \nremote_sid| YouTube| Noodzakelijk voor de implementatie en functionaliteit van\nYouTube-video's op de website.| Session| HTTP  \nrequests| YouTube| Wordt gebruikt om de interactie van gebruikers met embedded\ninhoud bij te houden.| Session| HTTP  \nTESTCOOKIESENABLED| YouTube| Wordt gebruikt om de interactie van gebruikers\nmet embedded inhoud bij te houden.| 1 dag| HTTP  \nVISITOR_INFO1_LIVE| YouTube| Probeert de bandbreedte van gebruikers te\nschatten op pagina's met geïntegreerde YouTube-video's.| 180 dagen| HTTP  \nVISITOR_PRIVACY_METADATA| YouTube| Slaat de cookiestatus van de gebruiker op\nvoor het huidige domein| 180 dagen| HTTP  \nYSC| YouTube| Registreert een unieke ID om statistieken bij te houden van\nwelke video's van YouTube de gebruiker heeft gezien.| Session| HTTP  \nytidb::LAST_RESULT_ENTRY_KEY| YouTube| Bewaart de voorkeuren van de\nvideospeler van de gebruiker met ingesloten YouTube-video| Persistent| HTML  \nYtIdbMeta#databases| YouTube| Wordt gebruikt om de interactie van gebruikers\nmet embedded inhoud bij te houden.| Persistent| IDB  \nyt-remote-cast-available| YouTube| Bewaart de voorkeuren van de videospeler\nvan de gebruiker met ingesloten YouTube-video| Session| HTML  \nyt-remote-cast-installed| YouTube| Bewaart de voorkeuren van de videospeler\nvan de gebruiker met ingesloten YouTube-video| Session| HTML  \nyt-remote-connected-devices| YouTube| Bewaart de voorkeuren van de videospeler\nvan de gebruiker met ingesloten YouTube-video| Persistent| HTML  \nyt-remote-device-id| YouTube| Bewaart de voorkeuren van de videospeler van de\ngebruiker met ingesloten YouTube-video| Persistent| HTML  \nyt-remote-fast-check-period| YouTube| Bewaart de voorkeuren van de videospeler\nvan de gebruiker met ingesloten YouTube-video| Session| HTML  \nyt-remote-session-app| YouTube| Bewaart de voorkeuren van de videospeler van\nde gebruiker met ingesloten YouTube-video| Session| HTML  \nyt-remote-session-name| YouTube| Bewaart de voorkeuren van de videospeler van\nde gebruiker met ingesloten YouTube-video| Session| HTML  \n  \nNiet-geclassificeerde cookies zijn cookies die we nog aan het classificeren\nzijn, samen met de aanbieders van afzonderlijke cookies.\n\nNaam| Aanbieder| Doel| Vervaltermijn| Type  \n---|---|---|---|---  \nbouwtimelapse_session| bouwtimelapse.nl| In afwachting| 1 dag| HTTP  \nmx3s| businesssupport.nh1816.nl| In afwachting| 1 dag| HTTP  \nmx3-version| businesssupport.nh1816.nl| In afwachting| Persistent| HTML  \nnavigationTags-nl| www.nh1816.nl| In afwachting| Persistent| HTML  \nRequestVerificationToken| www.nh1816.nl| In afwachting| Session| HTTP  \ntranslations-nl| www.nh1816.nl| In afwachting| Persistent| HTML  \n  \n[#IABV2_LABEL_PURPOSES#] [#IABV2_LABEL_FEATURES#] [#IABV2_LABEL_PARTNERS#]\n\n[#IABV2_BODY_PURPOSES#]\n\n[#IABV2_BODY_FEATURES#]\n\n[#IABV2_BODY_PARTNERS#]\n\nCookies zijn kleine tekstbestanden die door websites kunnen worden gebruikt om\ngebruikerservaringen efficiënter te maken.  \n  \nVolgens de wet mogen wij cookies op uw apparaat opslaan als ze strikt\nnoodzakelijk zijn voor het gebruik van de site. Voor alle andere soorten\ncookies hebben we uw toestemming nodig, als het gebruik leidt tot verwerking\nvan persoonsgegevens.\n\nCookieverklaring laatst bijgewerkt op 1/2/24 door Cookiebot\n\n__\n\nDyslexie\n\n__\n\n  *     * Voor adviseurs\n    * Mijn Polissen\n\n  * Verzekeringen\n  * Klantenservice\n    * Schade melden\n    * Schadeherstellers\n    * Preventietips\n    * VerzekeringApp\n    * Veelgestelde vragen\n    * Hulp bij betalen\n    * Prolongatie\n    * Heeft u een klacht?\n  * Zoek adviseur\n  * Over Nh1816\n    * Ons verhaal\n    * Werken bij Nh1816\n    * Maatschappelijk betrokken\n    * Stichting Goede Doelen\n    * Duurzaamheid\n    * Holding informatie\n    * Nieuwbouw Nh1816\n  * Coöperatie\n    * Over de coöperatie\n    * Ledenvoordelen\n    * Zest Magazine\n    * Samen Betrokken initiatieven\n    * Goede doelen projecten\n  * Nieuws\n\n__\n\n__\n\nZoek artikel\n\nKom in contact\n\n  * __Contact\n  * __Vind uw adviseur\n  * __IBAN: NL54ABNA0589215418\n  * __Noodnummer: 088-1121816\n\n# Camperverzekering\n\n  * Zorgeloos op reis met uw camper\n  * Zonneluifel mee te verzekeren\n  * Kies zelf of u de inventaris van uw camper meeverzekert\n  * Uw persoonlijke camperverzekering samengesteld met extra dekkingen\n\nKlantenservice __ Vind een adviseur __\n\n## Nh1816 Camperverzekering afsluiten\n\nAls trotse eigenaar van een camper wilt u zeker weten dat deze goed verzekerd\nis. Bescherm uw vakantieplezier daarom met een goede camperverzekering van\nNh1816 Verzekeringen. Schade aan de camper, diefstal van inboedel of\naccessoires of een verkeersongeval. Het zijn zaken die uw vakantie goed kunnen\nverpesten. En u vaak veel extra geld kosten. Uw vakantie of reis met de camper\nmoet dus goed verzekerd zijn. Uw camper verzekeren voor dagelijks gebruik? Ook\ndan is de camperverzekering van Nh1816 uiterst geschikt.\n\nOnze camperverzekering biedt uitstekende voorwaarden en met een prima\nschadeafhandeling. Dit blijkt ook uit de vele positieve reviews van klanten.\nSluit ook uw camperverzekering af bij de beste particuliere schadeverzekeraar\nvan Nederland!\n\n### Polisvoorwaarden\n\nPakketverzekering motorrijtuigen\n\nAansprakelijkheidsverzekering motorrijtuigen A(6)\n\nCasco- en inboedelverzekering kampeerauto\n\nOverige Polisvoorwaarden __\n\n### Dekkingen camper verzekeren\n\nWA Beperkt casco Casco\n\n### WA verzekering camper\n\nDe basis van onze camperverzekering is de wettelijk verplichte WA verzekering\ndie uiteraard voldoet aan alle Europese richtlijnen. Die schrijven een\nverzekerd bedrag van € 2.500.000,- voor zaakschade en € 5.600.000,- voor\nletselschade voor. De aansprakelijkheid als automobilist voor schade\ntoegebracht aan andere weggebruikers is dus prima verzekerd. Daarnaast kunt u\nde camperverzekering uitbreiden met één of meerdere aanvullende verzekeringen.\nEen betaalbare verzekering op maat is op deze manier voor iedereen bereikbaar.\nU kunt uw camperverzekering naar eigen wens samenstellen met onderstaande\nextra dekkingen.\n\n### Beperkt cascoverzekering camper\n\nHeeft u een wat oudere camper dan is de beperkt cascoverzekering een\nvoordelige keuze voor u. Met een beperkt cascoverzekering voor uw camper bent\nu bijvoorbeeld verzekerd tegen schade door brand, bliksem, hagel, een\noverstroming of een aanrijding met een dier. Welke soort cascoverzekering voor\nu het beste is, bespreekt en overlegt u met uw verzekeringsadviseur. Vind er\neen via het zoekfilter verder op deze pagina!\n\n\n\n### Cascoverzekering camper\n\nOok schade aan uw eigen camper is verzekerd als u kiest voor een volledig\ncasco camperverzekering. Kiest u voor een beperkt casco verzekering dan is\nniet alle schade aan uw eigen camper verzekerd. U bent bijvoorbeeld niet\nverzekerd voor schade aan je eigen camper door een verkeersongeval\n(aanrijding) die jij veroorzaakt. Daarvoor is **deze**  cascoverzekering.\n\n### Voordelen Nh1816\n\n  * __ Verzekerden geven ons een 9.1 voor service\n  * __ Digitale polisinformatie en schademelden via App\n  * __ Uitstekende producten met goede premiestelling\n  * __ Alleen via uw lokale verzekeringsadviseur\n\n## Aanvullende dekkingen\n\nWelke dekkingen passen goed in uw camperverzekering? Stel samen met een\nadviseur uw ideale camperverzekering samen.\n\n### Bonusbeschermer\n\nMet de bonusbeschermer houdt u na een geclaimde schade dezelfde korting voor\nschadevrij rijden. Deze Bonusbeschermer is 1x per jaar te gebruiken.\n\n### Ongevallen voor inzittenden\n\nMet deze verzekering zorgt u ervoor dat er een uitkering wordt gedaan wanneer\nde inzittenden die u met uw camper vervoert bij een verkeersongeval gewond\nraken of overlijden. U kunt kiezen uit verschillende combinaties van vaste\nuitkeringen.\n\n### Schadeverzekering voor inzittenden\n\nBij deze verzekering wordt de zaak- en/of letselschade van inzittenden die u\nmet uw camper vervoert na een verkeersongeval tot een maximum van naar keuze €\n500.000,- of  € 1.000.000,- verzekerd.\n\n### Pechhulp\n\nDe pechhulpdekking zorgt ervoor dat u bij pech onderweg wordt geholpen en zo\nsnel mogelijk weer mobiel bent. De pechhulpdekking kunt u afsluiten voor pech\nbinnen Nederland of binnen Europa.\n\n### Luifel\n\nU kunt ervoor kiezen om de zonneluifel van uw camper mee te verzekeren. Zo\nbent u extra goed verzekerd tegen schade.\n\n### Rechtsbijstand\n\nHet weggebruik is een bron van juridische conflicten. Een\nverhaalsrechtsbijstandverzekering geeft recht op juridische hulp bij het\nverhalen van verkeerschade. De uitgebreide rechtsbijstandverzekering voor\nautomobilisten biedt daarnaast ook hulp bij juridische kwesties bij het\ngebruik of het bezit van een camper. Ook hier geldt dat uw\nverzekeringsadviseur u graag helpt bij het kiezen van een geschikte\nrechtsbijstandverzekering.\n\n### Inboedelverzekering Camperverzekering\n\nU kunt ervoor kiezen om de inventaris van uw camper mee te verzekeren.\n\n### Camper verzekeren tegen nieuwwaarde\n\nUw camper is voor 1 jaar tegen de nieuwwaarde verzekerd als u de 1e eigenaar\nbent. U kunt ervoor kiezen om tegen een meerpremie deze nieuwwaarderegeling\nvoor 3 jaar af te sluiten. Hierdoor loopt u nog minder risico bij het total\nloss raken van uw camper!\n\n### Camper verzekeren tegen aanschafwaarde\n\nHeeft u uw camper tweedehands gekocht bij een BOVAG of merkendealer? Dan kunt\nu de aanschafwaarde voor drie jaar verzekeren. Hiervoor geldt een meerpremie.\n\n## Verzekeringskaarten\n\nVerzekeringskaart(en) maken informatie over de camperverzekering duidelijker\nen overzichtelijker. We gebruiken herkenbare iconen en korte, begrijpelijke\nteksten om duidelijk te maken waar een camperverzekering voor bedoeld is en\nwat wel en niet verzekerd is.\n\n__\n\n### Verzekeringskaart\n\nCamperverzekering\n\n__\n\n__\n\n### Verzekeringskaart\n\nVerhaalsrechtsbijstand ARAG\n\n__\n\n__\n\n### Verzekeringskaart\n\nVerhaalsrechtsbijstand DAS\n\n__\n\n__\n\n### Verzekeringskaart\n\nVerkeersrechtsbijstand ARAG\n\n__\n\n__\n\n### Verzekeringskaart\n\nVerkeersrechtsbijstand DAS\n\n__\n\n## Veelgestelde vragen\n\nMoet ik altijd mijn Nh1816 Verzekeringsbewijs bij me hebben? __\n\nIn Nederland is dat niet verplicht. In het buitenland moet u wel altijd een\nverzekeringsbewijs bij u hebben. Dat is het Nh1816 Verzekeringsbewijs. Bij\nNh1816 Verzekeringen wordt het verzekeringsbewijs op verschillende manieren\naangeboden. Het verzekeringsbewijs is 24/7 on- en offline onderdeel van de\nVerzekeringApp. Een papieren Nh1816 Verzekeringsbewijs wordt door uw\nverzekeringsadviseur op verzoek verstrekt.\n\nEr zijn landen waar een papieren verzekeringsbewijs vereist is. Vraag ernaar\nbij uw verzekeringsadviseur.\n\nVallen de inboedel en de luifel van mijn camper ook onder de\ncamperverzekering? __\n\nJa, als u bij het afsluiten van de verzekering de waarde daarvan apart hebt\nopgegeven, dan zijn de inboedel en de luifel van de camper ook verzekerd op de\nkampeerautoverzekering.\n\nZijn mijn accessoires ook verzekerd? __\n\nAccessoires zijn tot maximaal € 1.000,- inclusief btw gratis meeverzekerd.\nHeeft u meer aan accessoires, dan zijn die ook verzekerd als u die aan ons\nhebt opgegeven en de waarde ervan is opgeteld bij het verzekerd bedrag.\n\nWat kost een camperverzekering? __\n\nDe kosten van een camperverzekering kunnen sterk variëren, afhankelijk van\nfactoren zoals het gewicht van uw camper, het type verzekering dat u kiest, uw\nleeftijd en uw schadeverleden.\n\nHoeveel premie u betaalt is afhankelijk van de dekking en/of aanvullende\ndekkingen die u kiest. Een financieel adviseur biedt u graag een persoonlijk\nadvies. Zo weet u zeker dat u goed verzekerd bent én niet te veel betaalt.\nVind een adviseur bij u in de buurt!\n\nWat is de beste camperverzekering? __\n\nDat is afhankelijk van uw persoonlijke situatie; waar heeft u behoefte aan?\nEen financieel adviseur kan u daar het beste bij helpen. Hij of zij biedt een\nadvies op maat, passend bij uw wensen. Zo weet u zeker dat u een compleet\npakket met de juiste verzekeringen afsluit!\n\nKan ik rekenen op hulp bij pech onderweg? __\n\nU kunt optioneel kiezen voor de dekking pechhulp in Nederland of pechhulp in\nheel Europa. Vraag uw adviseur naar de voorwaarden!\n\nKan ik mijn elektrische camper ook verzekeren? __\n\nOok een elektrische camper kunt u bij Nh1816 uitstekend verzekeren. Wij maken\ngeen onderscheid tussen campers op brandstof of accu.\n\n## Verzekeringen\n\n**Doorlopende reisverzekering**\n\nLees meer __\n\n**Caravanverzekering**\n\nLees meer __\n\n**Bootverzekering**\n\nLees meer __\n\n**Recreatiewoning-verzekering**\n\nLees meer __\n\n## Vind een adviseur in uw buurt\n\n__ __\n\nToon adviseurs met beoordelingen\n\nUitgebreid zoeken __\n\n## Snel gevonden\n\n__\n\n## Schade melden\n\n__\n\n## Adviseur aan het woord\n\n__\n\n## VerzekeringApp\n\n__\n\n## Preventietips\n\n__\n\n## Polisvoorwaarden\n\n__\n\n## Reviews\n\nNaar boven  __\n\n  * __ Verzekerden geven ons een 9.1 voor service\n  * __ Digitale polisinformatie en schademelden via App\n  * __ Uitstekende producten met goede premiestelling\n  * __ Alleen via uw lokale verzekeringsadviseur\n\n## Over Nh1816\n\n  * Ons verhaal\n  * Vacatures\n  * Nieuws\n  * Klanttevredenheid\n\n## Verzekeringen\n\n  * Auto\n  * Inboedel\n  * Reis\n  * Caravan\n  * Aansprakelijkheid\n  * Ongevallen\n  * Nh1816 Combipolis\n  * Alle verzekeringen\n\n## Snelle links\n\n  * Schade melden\n  * Schadeherstellers\n  * Vind uw adviseur\n  * Mijn polissen\n  * Ledenvoordelen\n  * Zonnepanelen verzekeren\n\nDorpsstraat 820\n\n1724NT Oudkarspel\n\nPostbus 1\n\n1724 ZG Oudkarspel\n\nOpeningstijden\n\nT: 0226 - 33 18 16\n\nE: info@nh1816.nl\n\n  * Cookiestatement\n  * Privacyverklaring\n  * Disclaimer\n  * Sitemap\n  * Contact\n\nVolg ons op:\n\n__________\n\nContact Vind uw adviseur\n\n__\n\n  * __Contact\n  * __Vind uw adviseur\n  * __IBAN: NL54ABNA0589215418\n  * __Noodnummer: 088-1121816\n\n__ Zoeken\n\n",
    "links": "[{\"link\": \"https://www.nh1816.nl/voor-adviseurs\", \"text\": \"Voor adviseurs\"}, {\"link\": \"https://www.nh1816.nl/mijn-polissen\", \"text\": \"Mijn Polissen\"}, {\"link\": \"https://www.nh1816.nl/\", \"text\": \"\"}, {\"link\": \"https://www.nh1816.nl/Default.aspx?ID=7972\", \"text\": \"\"}, {\"link\": \"https://www.nh1816.nl/Default.aspx?ID=8899\", \"text\": \"\"}, {\"link\": \"https://www.nh1816.nl/Default.aspx?ID=7974\", \"text\": \"\"}, {\"link\": \"https://www.nh1816.nl/Default.aspx?ID=10015\", \"text\": \"\"}, {\"link\": \"https://www.nh1816.nl/Default.aspx?ID=7975\", \"text\": \"\"}, {\"link\": \"https://www.nh1816.nl/Default.aspx?ID=25963\", \"text\": \"\"}, {\"link\": \"https://www.nh1816.nl/Default.aspx?ID=8893\", \"text\": \"\"}, {\"link\": \"https://www.nh1816.nl/Default.aspx?ID=10028\", \"text\": \"\"}, {\"link\": \"https://www.nh1816.nl/Default.aspx?ID=1356\", \"text\": \"Zoek adviseur\"}, {\"link\": \"https://www.nh1816.nl/Default.aspx?ID=7976\", \"text\": \"\"}, {\"link\": \"https://www.nh1816.nl/Default.aspx?ID=7977\", \"text\": \"\"}, {\"link\": \"https://www.nh1816.nl/Default.aspx?ID=7978\", \"text\": \"\"}, {\"link\": \"https://www.nh1816.nl/Default.aspx?ID=7979\", \"text\": \"\"}, {\"link\": \"https://www.nh1816.nl/Default.aspx?ID=26025\", \"text\": \"\"}, {\"link\": \"https://www.nh1816.nl/Default.aspx?ID=7980\", \"text\": \"\"}, {\"link\": \"https://www.nh1816.nl/Default.aspx?ID=24737\", \"text\": \"\"}, {\"link\": \"https://www.nh1816.nl/Default.aspx?ID=10035\", \"text\": \"\"}, {\"link\": \"https://www.nh1816.nl/Default.aspx?ID=7981\", \"text\": \"\"}, {\"link\": \"https://www.nh1816.nl/Default.aspx?ID=7982\", \"text\": \"\"}, {\"link\": \"https://www.nh1816.nl/Default.aspx?ID=9933\", \"text\": \"\"}, {\"link\": \"https://www.nh1816.nl/Default.aspx?ID=25821\", \"text\": \"\"}, {\"link\": \"https://www.nh1816.nl/Default.aspx?ID=1364\", \"text\": \"Nieuws\"}, {\"link\": \"https://www.nh1816.nl/\", \"text\": \"\"}, {\"link\": \"https://www.nh1816.nl/contact\", \"text\": \"\"}, {\"link\": \"https://www.nh1816.nl/uw-adviseur\", \"text\": \"\"}, {\"link\": \"https://www.nh1816.nl/verzekeringen/camperverzekering#153016\", \"text\": \"\"}, {\"link\": \"https://www.nh1816.nl/verzekeringen/camperverzekering#152770\", \"text\": \"\"}, {\"link\": \"https://www.nh1816.nl/reviews\", \"text\": \"positieve reviews\"}, {\"link\": \"https://www.nh1816.nl/polisvoorwaarden\", \"text\": \"\"}, {\"link\": \"https://www.nh1816.nl/nieuws/hoe-kan-ik-mijn-elektrische-camper-verzekeren\", \"text\": \"elektrische camper\"}, {\"link\": \"https://www.nh1816.nl/verzekeringen/doorlopende-reisverzekering\", \"text\": \"\"}, {\"link\": \"https://www.nh1816.nl/verzekeringen/doorlopende-reisverzekering\", \"text\": \"\"}, {\"link\": \"https://www.nh1816.nl/verzekeringen/caravanverzekering\", \"text\": \"\"}, {\"link\": \"https://www.nh1816.nl/verzekeringen/caravanverzekering\", \"text\": \"\"}, {\"link\": \"https://www.nh1816.nl/verzekeringen/bootverzekering\", \"text\": \"\"}, {\"link\": \"https://www.nh1816.nl/verzekeringen/bootverzekering\", \"text\": \"\"}, {\"link\": \"https://www.nh1816.nl/verzekeringen/recreatiewoningverzekering\", \"text\": \"\"}, {\"link\": \"https://www.nh1816.nl/verzekeringen/recreatiewoningverzekering\", \"text\": \"\"}, {\"link\": \"https://www.nh1816.nl/klantenservice/schade-melden\", \"text\": \"\"}, {\"link\": \"https://www.nh1816.nl/zoek-adviseur/adviseurs-aan-het-woord\", \"text\": \"\"}, {\"link\": \"https://www.nh1816.nl/verzekeringapp\", \"text\": \"\"}, {\"link\": \"https://www.nh1816.nl/klantenservice/preventietips\", \"text\": \"\"}, {\"link\": \"https://www.nh1816.nl/polisvoorwaarden\", \"text\": \"\"}, {\"link\": \"https://www.nh1816.nl/reviews\", \"text\": \"\"}, {\"link\": \"https://www.nh1816.nl/over-nh1816/ons-verhaal\", \"text\": \"Ons verhaal\"}, {\"link\": \"https://www.nh1816.nl/vacatures\", \"text\": \"Vacatures\"}, {\"link\": \"https://www.nh1816.nl/nieuws\", \"text\": \"Nieuws\"}, {\"link\": \"https://www.nh1816.nl/over-nh1816/klanttevredenheid\", \"text\": \"Klanttevredenheid\"}, {\"link\": \"https://www.nh1816.nl/verzekeringen/autoverzekering\", \"text\": \"Auto\"}, {\"link\": \"https://www.nh1816.nl/verzekeringen/inboedelverzekering\", \"text\": \"Inboedel\"}, {\"link\": \"https://www.nh1816.nl/verzekeringen/doorlopende-reisverzekering\", \"text\": \"Reis\"}, {\"link\": \"https://www.nh1816.nl/verzekeringen/caravanverzekering\", \"text\": \"Caravan\"}, {\"link\": \"https://www.nh1816.nl/verzekeringen/aansprakelijkheidsverzekering\", \"text\": \"Aansprakelijkheid\"}, {\"link\": \"https://www.nh1816.nl/verzekeringen/ongevallenverzekering\", \"text\": \"Ongevallen\"}, {\"link\": \"https://www.nh1816.nl/verzekeringen/nh1816-combipolis\", \"text\": \"Nh1816 Combipolis\"}, {\"link\": \"https://www.nh1816.nl/verzekeringen\", \"text\": \"Alle verzekeringen\"}, {\"link\": \"https://www.nh1816.nl/klantenservice/schade-melden\", \"text\": \"Schade melden\"}, {\"link\": \"https://www.nh1816.nl/klantenservice/schadeherstellers\", \"text\": \"Schadeherstellers\"}, {\"link\": \"https://www.nh1816.nl/uw-adviseur\", \"text\": \"Vind uw adviseur\"}, {\"link\": \"https://www.nh1816.nl/mijn-polissen\", \"text\": \"Mijn polissen\"}, {\"link\": \"https://www.nh1816.nl/ledenvoordeel\", \"text\": \"Ledenvoordelen\"}, {\"link\": \"https://www.nh1816.nl/nieuws/brand-en-zonnepanelen-hoe-is-dat-verzekerd\", \"text\": \"Zonnepanelen verzekeren\"}, {\"link\": \"https://www.nh1816.nl/cookies\", \"text\": \"Cookiestatement\"}, {\"link\": \"https://www.nh1816.nl/privacyverklaring\", \"text\": \"Privacyverklaring\"}, {\"link\": \"https://www.nh1816.nl/disclaimer\", \"text\": \"Disclaimer\"}, {\"link\": \"https://www.nh1816.nl/sitemap\", \"text\": \"Sitemap\"}, {\"link\": \"https://www.nh1816.nl/contact\", \"text\": \"Contact\"}, {\"link\": \"https://www.nh1816.nl/contact\", \"text\": \"Contact\"}, {\"link\": \"https://www.nh1816.nl/uw-adviseur\", \"text\": \"Vind uw adviseur\"}, {\"link\": \"https://www.nh1816.nl/contact\", \"text\": \"\"}, {\"link\": \"https://www.nh1816.nl/uw-adviseur\", \"text\": \"\"}]",
    "priceAndPlans": "Error: Timeout 30000ms exceeded. =========================== logs\n=========================== navigating to\n\"http://web.archive.org/web/20240117022056/https://www.nh1816.nl/\", waiting\nuntil \"load\" ============================================================\n\n"
}