{
    "summary": "Cookie Policy\n\nDe website van Honig en Honig maakt gebruik van cookies, zodat deze optimaal\nwerkt. Door onze website te gebruiken, gaat u akkoord met het gebruik ervan.\nMeer informatie vindt u in onze privacy statement.Meer informatie |\nBedrijfsinformatie\n\nWeiger cookiesAccepteer cookies\n\n  * 072-5642669\n  * info@honigenhonig.nl\n  * Maandag - Vrijdag 09:00 tot 17:00 uur\n\n  *   * Bedrijf\n\n    * ### Bedrijfsverzekeringen\n\n      * Aanhangwagenverzekering zakelijk \n      * Aansprakelijkheidsverzekering voor bedrijven\n      * Bedrijfsschadeverzekering\n      * Beroepsaansprakelijkheidsverzekering\n      * Bestelautoverzekering\n      * Bestuurdersaansprakelijkheidsverzekering\n      * CAR-verzekering\n      * Computer- en Elektronicaverzekering\n      * Container- en trailer verzekering\n      * Cyber Risk verzekering\n      * Dierenverzekering\n      * Eigen vervoer verzekering\n      * Exploitatiekostenverzekering\n      * Extra kostenverzekering\n      * Garageverzekering\n      * Geldverzekering\n      * Glasverzekering bedrijven\n      * Huurdersbelangverzekering\n      * Inventaris- en goederenverzekering\n      * Machinebreukverzekering\n      * Milieuschadeverzekering\n      * Montageverzekering\n      * Opstalverzekering zakelijk\n      * Rechtsbijstandverzekering zakelijk\n      * Reconstructiekostenverzekering\n      * Reisverzekering zakelijk\n      * Schadeverzekering voor werknemers\n      * Transportverzekering\n      * Vervoerdersaansprakelijkheidsverzekering\n      * Vrachtautoverzekering\n      * Wagenparkverzekering\n      * WEGAS-verzekering\n      * Werkmaterieelverzekering\n      * Zakelijke autoverzekering \n      * Zakelijke fietsverzekering\n      * Zakelijke motorverzekering \n      * Alle brancheverzekeringen\n\n    * ### Bedrijfsverzekeringen ZZP\n\n      * Aansprakelijkheidsverzekering ZZP\n      * Arbeidsongeschiktheidsverzekering ZZP\n      * Beroepsaansprakelijkheid ZZP\n      * Bouw en Montage verzekering ZZP\n      * Eigen Vervoerverzekering ZZP\n      * Inventaris- en Goederenverzekering ZZP\n      * Rechtsbijstandverzekering ZZP\n      * Verzekeringspakket ZZP\n\n    * ### Tijdelijke bedrijfsverzekeringen\n\n      * Tijdelijke CAR-verzekering\n      * Tijdelijke CAR-/Montageverzekering\n      * Tijdelijke Montageverzekering\n\n  * Ondernemer\n\n    * ### Ondernemersverzekeringen\n\n      * AOV voor zware beroepen\n      * Arbeidsongeschiktheidsverzekering\n      * Bestuurdersaansprakelijkheid\n      * Ongevallenverzekering voor ondernemers\n\n  * Particulier\n\n    * ### Particuliere verzekeringen\n\n      * Aanhangwagenverzekering\n      * Aansprakelijkheidsverzekering particulier\n      * Autoverzekering\n      * Bestelautoverzekering particulier\n      * Bootverzekering\n      * Bromfietsverzekering\n      * Camperverzekering\n      * Caravanverzekering\n      * Fietsverzekering\n      * Inboedelverzekering\n      * Invalidenvoertuigverzekering\n      * Kostbaarhedenverzekering\n      * Kunstverzekering\n      * Motorverzekering\n      * Oldtimerverzekering\n      * Ongevallenverzekering\n      * Opstalverzekering\n      * Pechhulpverzekering\n      * Rechtsbijstandverzekering\n      * Recreatiewoningverzekering\n      * Reisverzekering\n      * Scooterverzekering\n      * Verzekeringspakket\n      * Woonverzekering\n      * Zorgverzekering\n\n    * ### Specials\n\n      * Can Am Ryker verzekering\n      * Can Am Spyder verzekering\n      * CAR verzekering (particulier)\n      * Exclusieve autoverzekering\n      * Piaggio MP3 verzekering\n      * Verzekeringen rieten dak\n      * Verzekering verhuurd woonhuis\n      * Werkmaterieelverzekering voor particulieren\n      * Woonbootverzekering\n\n  * Personeel\n\n    * ### Personeelsverzekeringen\n\n      * Arbo en re-integratie\n      * Collectieve ongevallenverzekering\n      * Collectieve zakenreisverzekering\n      * Collectieve zorgverzekering\n      * MKB verzuim ontzorgverzekering\n      * Verzuimverzekering\n      * WGA-ERD verzekering\n      * WGA-Hiaatverzekering\n      * WIA-Bodemverzekering\n      * WIA-Excedentverzekering\n      * WIA Vaste aanvulling verzekering \n      * ZW-ERD verzekering\n\n  * Vastgoed\n\n    * ### Vastgoed verzekeringen\n\n      * Aansprakelijkheidsverzekering onroerend goed\n      * Glasverzekering verhuurd onroerend goed\n      * Milieuschadeverzekering verhuurd onroerend goed\n      * Opstalverzekering verhuurd woonhuis\n      * Verzekeringen leegstaand onroerend goed\n      * Verzekeringen verhuurd onroerend goed\n\n    * ### VvE Verzekeringen\n\n      * Aansprakelijkheidsverzekering VvE\n      * Bestuurdersaansprakelijkheidsverzekering VvE\n      * Gebouwenverzekering VvE\n      * Glasverzekering VvE\n      * Ongevallenverzekering VvE\n      * Opstalverzekering VvE\n      * Rechtsbijstandverzekering VvE\n      * VvE Verzekeringspakket\n\n  * Klantenservice\n\n    * Adreswijziging\n    * Autowijziging\n    * Contact\n    * Adviseur Online (vh Digitale Polismap)\n    * Fiscale en sociale cijfers\n    * Formulieren\n    * Honig en Honig\n    * Nieuws\n    * Nieuwsbrief\n    * Preventie\n    * Privacy en AVG\n    * Schade melden\n\n#  Camperverzekering\n\nWelke camperverzekering? Met de camperverzekering bepaalt u zelf hoe u uw\ncamper verzekert. Met de verplichte WA-dekking bent u verzekerd voor schade\naan anderen. Wilt u ook schade aan uw camper verzekeren, bijvoorbeeld door\nbrand, storm of diefstal? Kies dan voor een Beperkt Casco-dekking of Volledig\nCasco-dekking. Bereken uw premie, vergelijk en sluit uw camperverzekering\nonline af!\n\n## Welk soort verzekering is de camperverzekering?\n\nDe camperverzekering vergoedt schade aan anderen die wordt veroorzaakt door of\nmet uw camper. De camperverzekering voor Wettelijke Aansprakelijkheid (WA) is\nverplicht. Schade aan of diefstal van uw eigen camper kunt u verzekeren met\neen beperkt casco-dekking of een volledig casco-dekking. Met de beperkt casco-\ndekking bent u verzekerd voor schade aan uw eigen camper door een aantal\ngebeurtenissen. Zoals brand en diefstal. U kunt ook een zonneluifel extra\nmeeverzekeren. Met de volledig casco-dekking bent u verzekerd voor schade aan\nuw eigen camper. U kunt ook een zonneluifel extra meeverzekeren. En bij de\nvolledig casco dekking kunt u kiezen hoeveel kilometers u per jaar rijdt.\n\n## Wat is verzekerd met de camperverzekering?\n\nHieronder staat welke schade door of aan uw camper verzekerd is.\n\n### Aansprakelijkheid (WA)\n\nAls u met uw camper schade veroorzaakt aan anderen of andermans auto of\nspullen. Dit is een wettelijk verplichte verzekering. U bent verzekerd voor de\nwettelijk vastgestelde bedragen bij letselschade en bij schade aan spullen.\n\n### Hulpverlening na een ongeval\n\nIs uw camper beschadigd of gestolen? En kunt u daardoor niet verder rijden?\nSchakel dan de alarmcentrale in. Dan vergoeden verzekeraars de kosten van\nhulpverlening. Bij hulpverlening moet u denken aan berging, slepen of het\nvervoer van de camper en bagage. Of vervoer van de bestuurder en de\npassagiers. Verzekeringsmaatschappijen vergoeden ook de huur van een\nvervangende camper of extra verblijfskosten. Let op: Pechhulp valt hier niet\nonder. Dat is een keuzedekking.\n\n### Keuze: Reparatie (bij beperkt casco en volledig casco)\n\nVerzekeraars vergoeden de reparatiekosten. Behalve als de camper technisch of\neconomisch total loss is. In die gevallen vergoeden zij de waarde van de\ncamper minus de waarde van de restanten. Laat u de schade niet repareren? Dan\nvergoeden sommige verzekeraars een percentage van de vastgestelde\nreparatiekosten. Met technisch total loss van de camper bedoelen verzekeraars\ndat de camper technisch niet meer in een staat is om veilig mee te rijden en\nreparatie onmogelijk of onverantwoord is. Met economisch total loss bedoelen\nzij dat de reparatiekosten hoger zijn dan het verschil tussen de waarde van de\ncamper direct voor de gebeurtenis en de waarde van de restanten na de\ngebeurtenis.\n\n### Keuze: Diefstal of total loss (bij beperkt casco en volledig casco)\n\n  * Beperkt casco: Bij diefstal of total loss van de camper krijgt u de dagwaarde.\n  * Volledig casco: Bij diefstal of total loss van de camper krijg je de nieuwwaarde, de dagwaarde of de aankoopwaarde. Dit is afhankelijk van de gekozen dekking en de ouderdom van de camper.\n\nHeeft u een eigengebouwde camper? Dan verzekeren verzekeringsmaatschappijen de\ncamper op basis van de taxatiewaarde uit een taxatierapport. Is het\ntaxatierapport ouder dan 3 jaar? Dan vergoeden zij de dagwaarde van de camper.\n\n### Keuze: Schade door brand of natuur (beperkt casco en volledig casco)\n\nU bent verzekerd voor schade door bijvoorbeeld brand, hagel, bliksem, storm,\noverstroming of aanrijding met een loslopend dier.\n\n### Keuze: Inboedel (beperkt casco en volledig casco)\n\nU bent verzekerd voor de spullen in de camper. Of verzekeraars bij diefstal de\nschade vergoeden, hangt af van of uw camper op slot was. Of hoe de spullen\nzijn opgeborgen (in een gesloten kast of uit het zicht). Let op: niet alle\nspullen zijn verzekerd. Bijvoorbeeld geld, horloges of sieraden zijn niet\nverzekerd.\n\n### Keuze: Ruitschade (beperkt casco en volledig casco)\n\nU bent verzekerd voor het breken of barsten van de autoruit of van het\npanorama- of zonnedak (hieronder valt ook het zogenaamde sterretje). En voor\nschade aan de camper die is veroorzaakt door scherven van de autoruit of van\nhet panorama- of zonnedak.\n\n### Keuze: Schade aan eigen camper (volledig casco)\n\nU bent verzekerd voor schade aan uw eigen camper. Ook als het uw eigen schuld\nis (bijvoorbeeld een aanrijding).\n\n### Keuze: Pechhulp\n\nDeze dekking biedt hulp bij pech onderweg. U krijgt ook een vergoeding voor\neen noodzakelijke vervangende camper. De dekking geldt alleen voor pech buiten\nde woonplaats. U kiest zelf of u pechhulp meeverzekert.\n\n### Keuze: Ongevallen verzekering inzittenden (OVI)\n\nDe ongevallen verzekering inzittenden (OVI) keert een bedrag uit bij blijvende\ninvaliditeit of overlijden van inzittenden door een verkeersongeval. U kunt\nkiezen uit verschillende verzekerde bedragen.\n\n### Keuze: Schade verzekering inzittenden (SVI)\n\nDe schade verzekering inzittenden (SVI) vergoedt schade aan inzittenden en hun\nspullen bij een verkeersongeval met de verzekerde camper. Is de schade door\neen andere verzekering gedekt? Dan geldt die verzekering.\n\n### Keuze: Rechtsbijstand Motorrijtuigen\n\nMet de rechtsbijstandverzekering motorrijtuigen krijgt u hulp bij het verhalen\nvan uw schade die is ontstaan tijdens deelname aan het verkeer met uw camper.\nOf rechtsbijstand bij een juridisch meningsverschil over de vergoeding of\nreparatie van een schade die verhaald wordt. Of bij een strafzaak. Vaak heeft\nu keuze uit drie verschillende dekkingen: de Verhaalservice, Rechtsbijstand\nBasis en Rechtsbijstand Uitgebreid.\n\n## Wat is niet verzekerd met de camperverzekering?\n\nU bent bijvoorbeeld niet verzekerd als je geen geldig rijbewijs heeft. Of bij\nschade door misbruik van alcohol of drugs. Of schade tijdens verhuur of\nvervoer tegen betaling. En ook niet bij schade door onvoldoende onderhoud of\nonvoldoende zorg (zoals overbelasting). Heeft u hierdoor schade aan een ander\nveroorzaakt? Dan vergoeden verzekeringsmaatschappijen de schade wel aan de\nbenadeelde partij. Maar zij hebben het recht de schade op u te verhalen. In\ndat geval moet u de schade terugbetalen.\n\n## Dekkingen camperverzekering\n\n#### Rubriek\n\n|\n\n#### WA\n\n|\n\n#### WA + Beperkt Casco\n\n|\n\n#### WA + Volledig Casco  \n  \n---|---|---|---  \n  \nReparatie\n\n|\n\nNiet verzekerd\n\n|\n\nVerzekerd\n\n|\n\nVerzekerd  \n  \nDiefstal of total loss\n\n|\n\nNiet verzekerd\n\n|\n\nVerzekerd\n\n|\n\nVerzekerd  \n  \nSchade door brand of natuur\n\n|\n\nNiet verzekerd\n\n|\n\nVerzekerd\n\n|\n\nVerzekerd  \n  \nInboedel (indien meeverzekerd\n\n|\n\nNiet verzekerd\n\n|\n\nVerzekerd\n\n|\n\nVerzekerd  \n  \nRuitschade\n\n|\n\nNiet verzekerd\n\n|\n\nVerzekerd\n\n|\n\nVerzekerd  \n  \nSchade aan eigen camper\n\n|\n\nNiet verzekerd\n\n|\n\nNiet verzekerd\n\n|\n\nVerzekerd  \n  \n\n\n### Fraude, opzet, strafbare activiteiten, molest\n\nU bent niet verzekerd als u bij het afsluiten van de camperverzekering of bij\neen schade fraude pleegt. Of als er bij schade sprake is van opzet of\nroekeloosheid of criminele en strafbare activiteiten. U bent ook niet\nverzekerd als de schade het gevolg is van molest of een atoomkernreactie.\nOnder molest verstaan verzekeraars: binnenlandse onlusten, burgeroorlog,\ngewapend conflict, muiterij, oproer en opstand.\n\n### Permanente bewoning\n\nU bent niet verzekerd als u permanent in de camper woont.\n\n## Zijn er dekkingsbeperkingen?\n\n### Eigen risico (beperkt casco of volledig casco)\n\nU kiest zelf uw eigen risico. Hoe hoger uw eigen risico, hoe lager uw premie.\nHet eigen risico geldt bij schade aan uw eigen camper en bij het vervangen van\neen ruit. Maar niet bij reparatie van een ruit ('sterretje'). Is de\nregelmatige bestuurder die op je polis staat 24 jaar of ouder? En is de schade\nontstaan tijdens het rijden (bijvoorbeeld een botsing). Maar is de werkelijke\nbestuurder van de camper jonger dan 24 jaar? Dan kan een er een extra eigen\nrisico gelden. Voor de WA-dekking is geen eigen risico van toepassing.\n\n### Beveiliging (beperkt casco of volledig casco)\n\nBij diefstal, joyrijden of inbraak vergoeden verzekeringsmaatschappijen de\nschade alleen als uw camper goed beveiligd was. Let op: zij kunnen voor uw\ncamper een speciaal beveiligingssysteem eisen. Informeer vooraf bij onze\nverzekeringsadviseur.\n\n### Ruitschade (beperkt casco of volledig casco)\n\nVerzekeraars vergoeden de reparatie of vervanging van de ruit door een\ngeselecteerd ruitschadeherstelbedrijf. Laat u de ruit repareren of vervangen\ndoor een ander ruitschadeherstelbedrijf? Dan verlagen zij vaak de\nschadevergoeding. Dit staat los van het eigen risico. Is reparatie of\nvervanging van de ruit bij een geselecteerd herstelbedrijf (technisch) niet\nmogelijk? Dan verlagen wij de schadevergoeding niet.\n\n## Waar ben ik gedekt?\n\nDeze camperverzekering dekt schade in de landen die zijn vermeld op de Groene\nkaart van uw camperverzekering en die niet zijn doorgekruist. Praktisch gezien\nzijn dit de landen van Europa en Israël, Marokko en Tunesië. De\ncamperverzekering eindigt op het moment dat uw camper meer dan de helft van\nhet jaar in het buitenland is gestald. Maar staat de camper gestald in een\nland binnen de Europese Unie? Dan eindigt de camperverzekering uiterlijk op de\neerstvolgende jaarlijkse verlengingsdatum van uw camperverzekering.\n\n## Wat zijn mijn verplichtingen?\n\nAls u de camperverzekering aanvraagt of u heeft schade, moet u alle vragen\neerlijk beantwoorden. U moet zoveel mogelijk doen om schade te voorkomen en te\nbeperken. Meld schade zo snel mogelijk. En geef veranderingen in uw situatie\nzo snel mogelijk door.\n\n## Wanneer en hoe betaal ik?\n\nU kunt kiezen of u uw premie maandelijks, per kwartaal, per half jaar of\neenmaal per jaar betaalt. Betalen kan via een automatische incasso of\n(digitale) nota.\n\n## Beloning bij geen schade\n\nVoor elk jaar dat u geen schade claimt, kunt u premiekorting krijgen vaak tot\neen maximum. Als u schade claimt, dan kan de korting (deels) vervallen.\nSommige verzekeraars kennen de zogenaamde 'no-blameregeling'. Heeft u schade,\nmaar is dat niet uw schuld? Dan heeft dat geen negatief gevolg voor uw\npremiekorting. Die korting stijgt zelfs nog, zolang u niet op het maximum zit.\n\n## Wanneer begint en eindigt de dekking?\n\nDe camperverzekering begint op de ingangsdatum die op de polis staat. Betaalt\nu de premie niet op tijd? Dan kunnen verzekeraars de camperverzekering\nstoppen.\n\n## Hoe zeg ik mijn contract op?\n\nU kunt de camperverzekering dagelijks opzeggen. De camperverzekering stopt dan\neen maand later. Dit kan schriftelijk of via mail bij onze\nverzekeringsadviseur of rechtstreeks bij de verzekeringsmaatschappij.\n\n## Algemene informatie camperverzekering\n\nBovenstaande informatie geeft een samenvatting van de camperverzekering. In de\npolisvoorwaarden staat uitgebreid waarvoor u wel en niet bent verzekerd.\n\n## De camperverzekering is onderdeel van het particulier verzekeringspakket\n\nDe camperverzekering kunt u afsluiten als onderdeel van het particulier\nverzekeringspakket. Hoe meer verzekeringen u afsluit, hoe hoger uw\npakketkorting kan zijn en u heeft al uw verzekeringen op één overzichtelijk\npolisblad. U ziet direct wat u wel en wat u niet heeft verzekerd. Voor elke\nverzekering in het particulier verzekeringspakket geldt: bepaal samen met onze\nadviseur wat u nodig heeft, dan betaalt u alleen wat u nodig heeft.\n\n## U kunt uw particulier verzekeringspakket samenstellen uit de volgende\nverzekeringen:\n\n### Gezin en Gezondheid\n\n  * Aansprakelijkheidsverzekering\n  * Ongevallenverzekering\n  * Rechtsbijstandverzekering\n\n### Huis en Wonen\n\n  * Inboedelverzekering\n  * Kostbaarhedenverzekering\n  * Opstalverzekering\n\n### Recreatie en Reis\n\n  * Bootverzekering\n  * Camperverzekering\n  * Caravanverzekering\n  * Reisverzekering\n  * Recreatiewoningverzekering\n\n### Verkeer en Voertuigen\n\n  * Aanhangerverzekering\n  * Autoverzekering\n  * Bestelautoverzekering\n  * Bromfietsverzekering\n  * Motorverzekering\n  * Oldtimerverzekering\n\n## Voordelen particulier verzekeringspakket\n\n### Onafhankelijk advies\n\nOnze onafhankelijk adviseur helpt u graag bij het kiezen van de juiste\nschadeverzekeringen en de dekking die bij u past. U betaalt alleen wat u nodig\nheeft.\n\n### Pakketkorting\n\nHet particulier verzekeringspakket heeft u al vanaf één verzekering. Hoe meer\nverzekeringen u afsluit in het particulier verzekeringspakket, hoe meer\nkorting u kunt krijgen.\n\n### Overzicht\n\nAl uw verzekeringen staan op een overzichtelijk polisblad hierop ziet u wat u\nwel en wat u niet heeft verzekerd. Met de digitale polismap heeft u uw\nparticulier verzekeringspakket altijd binnen handbereik.\n\n### Elk jaar een update\n\nOm te weten of uw particulier verzekeringspakket nog aansluit bij uw situatie,\nontvangt u elk jaar een handige checklist.\n\n### Overleg met onze adviseur\n\nOverleg met onze adviseur wat u eventueel wilt aanpassen. Verandert er\ntussentijds iets in uw persoonlijke situatie? Geef dat dan direct aan ons\ndoor. Ook dan kan uw particulier verzekeringspakket worden aangepast.\n\n## Voordelen camperverzekering\n\n  * 14 dagen bedenktijd\n  * Direct online dekking\n  * Nieuwwaarderegeling voor nieuwe campers en aankoopwaarderegeling voor tweedehands campers\n  * Een verzekering op maat waarvoor u minder betaalt\n  * Extra voordeel voor uw tweedehands camper\n  * Lage basispremie\n  * Overname schadevrije jaren autoverzekering en korting 2e motorrijtuig\n  * Uitgebreide dekkingen (inboedel of luifel meeverzekeren)\n  * Vervangende camper bij schade (All Risk)\n  * Voor iedere soort camper\n\n## Meer weten over de de camperverzekering?\n\nHeeft u vragen, wenst u meer informatie of wilt u een vrijblijvende offerte\nvan de camperverzekering? Neem dan contact op met Honig en Honig te Alkmaar en\nbel 072-5642669 of mail uw vraag naar info@honigenhonig.nl. Wij zijn u graag\nvan dienst met onafhankelijk advies, deskundige bemiddeling, professioneel\npolisbeheer en service bij schade.\n\nMeer in deze categorie:  « Doorlopende reisverzekering Bootverzekering »\n\nterug naar boven\n\n**Aangesloten bij:**\n\n|  |  |  \n---|---|---|---  \n  \n\n\n© 2001 - 2023 - Honig en Honig - Op www.honigenhonig.nl vindt u algemene\ninformatie over verzekeringen. In een offerte, de polisvoorwaarden, eventuele\nclausules en op het polisblad staat uitgebreid beschreven waar u wel of niet\nvoor verzekerd bent. Onze publicaties en werkzaamheden gelden onder voorbehoud\nvan acceptatie, inspectie, rendement en (wets-)wijzigingen. De\nproductinformatie op onze website geeft geen recht op dekking of\ndienstverlening.\n\nZoeken...\n\n  * Bedrijf\n  * Ondernemer\n  * Particulier\n  * Personeel\n  * Vastgoed\n    * VvE\n  * Klantenservice\n    * Adreswijziging\n    * Autowijziging\n    * Contact\n    * Adviseur Online (vh Digitale Polismap)\n    * Fiscale en sociale cijfers\n    * Formulieren\n    * Honig en Honig\n    * Nieuws\n    * Nieuwsbrief\n    * Preventie\n    * Privacy en AVG\n    * Schade melden\n\n  * 072-5642669\n  * info@honigenhonig.nl\n  * Maandag - Vrijdag 09:00 tot 17:00 uur\n\n",
    "links": "[{\"link\": \"https://www.honigenhonig.nl/\", \"text\": \"\"}, {\"link\": \"https://www.honigenhonig.nl/bedrijf\", \"text\": \"Bedrijf\"}, {\"link\": \"https://www.honigenhonig.nl/aanhangwagenverzekering-zakelijk\", \"text\": \"Aanhangwagenverzekering zakelijk \"}, {\"link\": \"https://www.honigenhonig.nl/aansprakelijkheidsverzekering-voor-bedrijven\", \"text\": \"Aansprakelijkheidsverzekering voor bedrijven\"}, {\"link\": \"https://www.honigenhonig.nl/bedrijfsschadeverzekering\", \"text\": \"Bedrijfsschadeverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/beroepsaansprakelijkheidsverzekering\", \"text\": \"Beroepsaansprakelijkheidsverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/bestelautoverzekering\", \"text\": \"Bestelautoverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/bestuurdersaansprakelijkheidsverzekering\", \"text\": \"Bestuurdersaansprakelijkheidsverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/car-verzekering\", \"text\": \"CAR-verzekering\"}, {\"link\": \"https://www.honigenhonig.nl/computer-en-elektronicaverzekering\", \"text\": \"Computer- en Elektronicaverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/container-en-trailer-verzekering\", \"text\": \"Container- en trailer verzekering\"}, {\"link\": \"https://www.honigenhonig.nl/cyber-risk-verzekering\", \"text\": \"Cyber Risk verzekering\"}, {\"link\": \"https://www.honigenhonig.nl/dierenverzekering\", \"text\": \"Dierenverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/eigen-vervoer-verzekering\", \"text\": \"Eigen vervoer verzekering\"}, {\"link\": \"https://www.honigenhonig.nl/exploitatiekostenverzekering\", \"text\": \"Exploitatiekostenverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/extra-kostenverzekering\", \"text\": \"Extra kostenverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/garageverzekering\", \"text\": \"Garageverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/geldverzekering\", \"text\": \"Geldverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/glasverzekering-bedrijven\", \"text\": \"Glasverzekering bedrijven\"}, {\"link\": \"https://www.honigenhonig.nl/huurdersbelangverzekering\", \"text\": \"Huurdersbelangverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/inventaris-en-goederenverzekering\", \"text\": \"Inventaris- en goederenverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/machinebreukverzekering\", \"text\": \"Machinebreukverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/milieuschadeverzekering\", \"text\": \"Milieuschadeverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/montageverzekering\", \"text\": \"Montageverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/opstalverzekering-zakelijk\", \"text\": \"Opstalverzekering zakelijk\"}, {\"link\": \"https://www.honigenhonig.nl/zakelijke-rechtsbijstandverzekering\", \"text\": \"Rechtsbijstandverzekering zakelijk\"}, {\"link\": \"https://www.honigenhonig.nl/reconstructiekostenverzekering\", \"text\": \"Reconstructiekostenverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/zakelijke-reisverzekering\", \"text\": \"Reisverzekering zakelijk\"}, {\"link\": \"https://www.honigenhonig.nl/schadeverzekering-voor-werknemers\", \"text\": \"Schadeverzekering voor werknemers\"}, {\"link\": \"https://www.honigenhonig.nl/transportverzekering\", \"text\": \"Transportverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/vervoerdersaansprakelijkheidsverzekering\", \"text\": \"Vervoerdersaansprakelijkheidsverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/vrachtautoverzekering\", \"text\": \"Vrachtautoverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/wagenparkverzekering\", \"text\": \"Wagenparkverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/wegas-verzekering\", \"text\": \"WEGAS-verzekering\"}, {\"link\": \"https://www.honigenhonig.nl/werkmaterieelverzekering\", \"text\": \"Werkmaterieelverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/zakelijke-autoverzekering\", \"text\": \"Zakelijke autoverzekering \"}, {\"link\": \"https://www.honigenhonig.nl/zakelijke-fietsverzekering\", \"text\": \"Zakelijke fietsverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/zakelijke-motorverzekering\", \"text\": \"Zakelijke motorverzekering \"}, {\"link\": \"https://www.honigenhonig.nl/alle-brancheverzekeringen\", \"text\": \"Alle brancheverzekeringen\"}, {\"link\": \"https://www.honigenhonig.nl/zzp-aansprakelijkheidsverzekering\", \"text\": \"Aansprakelijkheidsverzekering ZZP\"}, {\"link\": \"https://www.honigenhonig.nl/arbeidsongeschiktheidsverzekering-zzp\", \"text\": \"Arbeidsongeschiktheidsverzekering ZZP\"}, {\"link\": \"https://www.honigenhonig.nl/zzp-beroepsaansprakelijkheid\", \"text\": \"Beroepsaansprakelijkheid ZZP\"}, {\"link\": \"https://www.honigenhonig.nl/zzp-bouw-en-montage-verzekering\", \"text\": \"Bouw en Montage verzekering ZZP\"}, {\"link\": \"https://www.honigenhonig.nl/zzp-eigen-vervoerverzekering\", \"text\": \"Eigen Vervoerverzekering ZZP\"}, {\"link\": \"https://www.honigenhonig.nl/zzp-inventaris-en-goederenverzekering\", \"text\": \"Inventaris- en Goederenverzekering ZZP\"}, {\"link\": \"https://www.honigenhonig.nl/zzp-rechtsbijstandverzekering\", \"text\": \"Rechtsbijstandverzekering ZZP\"}, {\"link\": \"https://www.honigenhonig.nl/verzekeringspakket-zzp\", \"text\": \"Verzekeringspakket ZZP\"}, {\"link\": \"https://www.honigenhonig.nl/tijdelijke-car-verzekering\", \"text\": \"Tijdelijke CAR-verzekering\"}, {\"link\": \"https://www.honigenhonig.nl/tijdelijke-car-montageverzekering\", \"text\": \"Tijdelijke CAR-/Montageverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/tijdelijke-montageverzekering\", \"text\": \"Tijdelijke Montageverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/ondernemer\", \"text\": \"Ondernemer\"}, {\"link\": \"https://www.honigenhonig.nl/aov-voor-zware-beroepen\", \"text\": \"AOV voor zware beroepen\"}, {\"link\": \"https://www.honigenhonig.nl/arbeidsongeschiktheidsverzekering\", \"text\": \"Arbeidsongeschiktheidsverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/bestuurdersaansprakelijkheid\", \"text\": \"Bestuurdersaansprakelijkheid\"}, {\"link\": \"https://www.honigenhonig.nl/ongevallenverzekering-voor-ondernemers\", \"text\": \"Ongevallenverzekering voor ondernemers\"}, {\"link\": \"https://www.honigenhonig.nl/particulier\", \"text\": \"Particulier\"}, {\"link\": \"https://www.honigenhonig.nl/aanhangwagenverzekering\", \"text\": \"Aanhangwagenverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/aansprakelijkheidsverzekering-particulier\", \"text\": \"Aansprakelijkheidsverzekering particulier\"}, {\"link\": \"https://www.honigenhonig.nl/autoverzekering\", \"text\": \"Autoverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/bestelautoverzekering-particulier\", \"text\": \"Bestelautoverzekering particulier\"}, {\"link\": \"https://www.honigenhonig.nl/bootverzekering\", \"text\": \"Bootverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/bromfietsverzekering\", \"text\": \"Bromfietsverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/camperverzekering\", \"text\": \"Camperverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/caravanverzekering\", \"text\": \"Caravanverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/fietsverzekering\", \"text\": \"Fietsverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/inboedelverzekering\", \"text\": \"Inboedelverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/invalidenvoertuigverzekering\", \"text\": \"Invalidenvoertuigverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/kostbaarhedenverzekering\", \"text\": \"Kostbaarhedenverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/kunstverzekering\", \"text\": \"Kunstverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/motorverzekering\", \"text\": \"Motorverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/oldtimerverzekering\", \"text\": \"Oldtimerverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/ongevallenverzekering\", \"text\": \"Ongevallenverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/opstalverzekering\", \"text\": \"Opstalverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/pechhulpverzekering\", \"text\": \"Pechhulpverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/rechtsbijstandverzekering\", \"text\": \"Rechtsbijstandverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/recreatiewoningverzekering\", \"text\": \"Recreatiewoningverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/reisverzekering\", \"text\": \"Reisverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/scooterverzekering\", \"text\": \"Scooterverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/verzekeringspakket\", \"text\": \"Verzekeringspakket\"}, {\"link\": \"https://www.honigenhonig.nl/woonverzekering\", \"text\": \"Woonverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/zorgverzekering\", \"text\": \"Zorgverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/can-am-ryker-verzekering\", \"text\": \"Can Am Ryker verzekering\"}, {\"link\": \"https://www.honigenhonig.nl/can-am-spyder-verzekering\", \"text\": \"Can Am Spyder verzekering\"}, {\"link\": \"https://www.honigenhonig.nl/car-verzekering-particulier\", \"text\": \"CAR verzekering (particulier)\"}, {\"link\": \"https://www.honigenhonig.nl/exclusieve-autoverzekering\", \"text\": \"Exclusieve autoverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/piaggio-mp3-verzekering\", \"text\": \"Piaggio MP3 verzekering\"}, {\"link\": \"https://www.honigenhonig.nl/verzekeringen-rieten-dak\", \"text\": \"Verzekeringen rieten dak\"}, {\"link\": \"https://www.honigenhonig.nl/verzekering-verhuurd-woonhuis\", \"text\": \"Verzekering verhuurd woonhuis\"}, {\"link\": \"https://www.honigenhonig.nl/werkmaterieelverzekering-voor-particulieren\", \"text\": \"Werkmaterieelverzekering voor particulieren\"}, {\"link\": \"https://www.honigenhonig.nl/woonbootverzekering\", \"text\": \"Woonbootverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/personeel\", \"text\": \"Personeel\"}, {\"link\": \"https://www.honigenhonig.nl/arbo-en-re-integratie\", \"text\": \"Arbo en re-integratie\"}, {\"link\": \"https://www.honigenhonig.nl/collectieve-ongevallenverzekering\", \"text\": \"Collectieve ongevallenverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/collectieve-zakenreisverzekering\", \"text\": \"Collectieve zakenreisverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/collectieve-zorgverzekering\", \"text\": \"Collectieve zorgverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/mkb-verzuim-ontzorgverzekering\", \"text\": \"MKB verzuim ontzorgverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/verzuimverzekering\", \"text\": \"Verzuimverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/wga-erd-verzekering\", \"text\": \"WGA-ERD verzekering\"}, {\"link\": \"https://www.honigenhonig.nl/wga-hiaatverzekering\", \"text\": \"WGA-Hiaatverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/wia-bodemverzekering\", \"text\": \"WIA-Bodemverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/wia-excedentverzekering\", \"text\": \"WIA-Excedentverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/wia-vaste-aanvulling-verzekering\", \"text\": \"WIA Vaste aanvulling verzekering \"}, {\"link\": \"https://www.honigenhonig.nl/zw-erd-verzekering\", \"text\": \"ZW-ERD verzekering\"}, {\"link\": \"https://www.honigenhonig.nl/vastgoed\", \"text\": \"Vastgoed\"}, {\"link\": \"https://www.honigenhonig.nl/aansprakelijkheidsverzekering-onroerend-goed\", \"text\": \"Aansprakelijkheidsverzekering onroerend goed\"}, {\"link\": \"https://www.honigenhonig.nl/glasverzekering-verhuurd-onroerend-goed\", \"text\": \"Glasverzekering verhuurd onroerend goed\"}, {\"link\": \"https://www.honigenhonig.nl/milieuschadeverzekering-verhuurd-onroerend-goed\", \"text\": \"Milieuschadeverzekering verhuurd onroerend goed\"}, {\"link\": \"https://www.honigenhonig.nl/opstalverzekering-verhuurd-woonhuis\", \"text\": \"Opstalverzekering verhuurd woonhuis\"}, {\"link\": \"https://www.honigenhonig.nl/verzekeringen-leegstaand-onroerend-goed\", \"text\": \"Verzekeringen leegstaand onroerend goed\"}, {\"link\": \"https://www.honigenhonig.nl/verzekeringen-verhuurd-onroerend-goed\", \"text\": \"Verzekeringen verhuurd onroerend goed\"}, {\"link\": \"https://www.honigenhonig.nl/aansprakelijkheidsverzekering-vve\", \"text\": \"Aansprakelijkheidsverzekering VvE\"}, {\"link\": \"https://www.honigenhonig.nl/bestuurdersaansprakelijkheidsverzekering-vve\", \"text\": \"Bestuurdersaansprakelijkheidsverzekering VvE\"}, {\"link\": \"https://www.honigenhonig.nl/gebouwenverzekering-vve\", \"text\": \"Gebouwenverzekering VvE\"}, {\"link\": \"https://www.honigenhonig.nl/glasverzekering-vve\", \"text\": \"Glasverzekering VvE\"}, {\"link\": \"https://www.honigenhonig.nl/ongevallenverzekering-vve\", \"text\": \"Ongevallenverzekering VvE\"}, {\"link\": \"https://www.honigenhonig.nl/opstalverzekering-vve\", \"text\": \"Opstalverzekering VvE\"}, {\"link\": \"https://www.honigenhonig.nl/rechtsbijstandverzekering-vve\", \"text\": \"Rechtsbijstandverzekering VvE\"}, {\"link\": \"https://www.honigenhonig.nl/vve-verzekeringspakket\", \"text\": \"VvE Verzekeringspakket\"}, {\"link\": \"https://www.honigenhonig.nl/klantenservice\", \"text\": \"Klantenservice\"}, {\"link\": \"https://www.honigenhonig.nl/klantenservice/adreswijziging\", \"text\": \"Adreswijziging\"}, {\"link\": \"https://www.honigenhonig.nl/klantenservice/autowijziging\", \"text\": \"Autowijziging\"}, {\"link\": \"https://www.honigenhonig.nl/klantenservice/contact\", \"text\": \"Contact\"}, {\"link\": \"https://www.honigenhonig.nl/klantenservice/digitale-polismap\", \"text\": \"Adviseur Online (vh Digitale Polismap)\"}, {\"link\": \"https://www.honigenhonig.nl/klantenservice/fiscale-en-sociale-cijfers\", \"text\": \"Fiscale en sociale cijfers\"}, {\"link\": \"https://www.honigenhonig.nl/klantenservice/formulieren\", \"text\": \"Formulieren\"}, {\"link\": \"https://www.honigenhonig.nl/klantenservice/honig-en-honig\", \"text\": \"Honig en Honig\"}, {\"link\": \"https://www.honigenhonig.nl/klantenservice/nieuws\", \"text\": \"Nieuws\"}, {\"link\": \"https://www.honigenhonig.nl/klantenservice/nieuwsbrief\", \"text\": \"Nieuwsbrief\"}, {\"link\": \"https://www.honigenhonig.nl/klantenservice/preventie\", \"text\": \"Preventie\"}, {\"link\": \"https://www.honigenhonig.nl/klantenservice/privacy-en-avg\", \"text\": \"Privacy en AVG\"}, {\"link\": \"https://www.honigenhonig.nl/klantenservice/schade-melden\", \"text\": \"Schade melden\"}, {\"link\": \"https://www.honigenhonig.nl/media/k2/items/cache/2bd64d7b967017e313e305532023f668_XL.jpg\", \"text\": \"\"}, {\"link\": \"https://www.honigenhonig.nl/offerte-particuliere-verzekeringen\", \"text\": \"\"}, {\"link\": \"https://www.honigenhonig.nl/aansprakelijkheidsverzekering-particulier\", \"text\": \"Aansprakelijkheidsverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/ongevallenverzekering\", \"text\": \"Ongevallenverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/rechtsbijstandverzekering\", \"text\": \"Rechtsbijstandverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/inboedelverzekering\", \"text\": \"Inboedelverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/kostbaarhedenverzekering\", \"text\": \"Kostbaarhedenverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/opstalverzekering\", \"text\": \"Opstalverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/bootverzekering\", \"text\": \"Bootverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/camperverzekering\", \"text\": \"Camperverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/caravanverzekering\", \"text\": \"Caravanverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/doorlopende-reisverzekering\", \"text\": \"Reisverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/recreatiewoning-verzekering\", \"text\": \"Recreatiewoningverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/aanhangerverzekering\", \"text\": \"Aanhangerverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/autoverzekering\", \"text\": \"Autoverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/bestelauto-particulier-verzekeren\", \"text\": \"Bestelautoverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/bromfietsverzekering\", \"text\": \"Bromfietsverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/motorverzekering\", \"text\": \"Motorverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/oldtimerverzekering\", \"text\": \"Oldtimerverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/reisverzekering\", \"text\": \"« Doorlopende reisverzekering\"}, {\"link\": \"https://www.honigenhonig.nl/bootverzekering\", \"text\": \"Bootverzekering »\"}, {\"link\": \"https://www.honigenhonig.nl/camperverzekering#startOfPageId1702\", \"text\": \"\\n            terug naar boven        \"}, {\"link\": \"https://www.honigenhonig.nl/bedrijf\", \"text\": \"Bedrijf\"}, {\"link\": \"https://www.honigenhonig.nl/ondernemer\", \"text\": \"Ondernemer\"}, {\"link\": \"https://www.honigenhonig.nl/particulier\", \"text\": \"Particulier\"}, {\"link\": \"https://www.honigenhonig.nl/personeel\", \"text\": \"Personeel\"}, {\"link\": \"https://www.honigenhonig.nl/vastgoed\", \"text\": \"\"}, {\"link\": \"https://www.honigenhonig.nl/vve\", \"text\": \"VvE\"}, {\"link\": \"https://www.honigenhonig.nl/klantenservice\", \"text\": \"\"}, {\"link\": \"https://www.honigenhonig.nl/klantenservice/adreswijziging\", \"text\": \"Adreswijziging\"}, {\"link\": \"https://www.honigenhonig.nl/klantenservice/autowijziging\", \"text\": \"Autowijziging\"}, {\"link\": \"https://www.honigenhonig.nl/klantenservice/contact\", \"text\": \"Contact\"}, {\"link\": \"https://www.honigenhonig.nl/klantenservice/digitale-polismap\", \"text\": \"Adviseur Online (vh Digitale Polismap)\"}, {\"link\": \"https://www.honigenhonig.nl/klantenservice/fiscale-en-sociale-cijfers\", \"text\": \"Fiscale en sociale cijfers\"}, {\"link\": \"https://www.honigenhonig.nl/klantenservice/formulieren\", \"text\": \"Formulieren\"}, {\"link\": \"https://www.honigenhonig.nl/klantenservice/honig-en-honig\", \"text\": \"Honig en Honig\"}, {\"link\": \"https://www.honigenhonig.nl/klantenservice/nieuws\", \"text\": \"Nieuws\"}, {\"link\": \"https://www.honigenhonig.nl/klantenservice/nieuwsbrief\", \"text\": \"Nieuwsbrief\"}, {\"link\": \"https://www.honigenhonig.nl/klantenservice/preventie\", \"text\": \"Preventie\"}, {\"link\": \"https://www.honigenhonig.nl/klantenservice/privacy-en-avg\", \"text\": \"Privacy en AVG\"}, {\"link\": \"https://www.honigenhonig.nl/klantenservice/schade-melden\", \"text\": \"Schade melden\"}]",
    "priceAndPlans": "Error: Timeout 30000ms exceeded. =========================== logs\n=========================== navigating to\n\"http://web.archive.org/web/20230925062839/https://honigenhonig.nl/\", waiting\nuntil \"load\" ============================================================\n\n"
}