{
    "summary": "  * ZELFBOUW BOEKEN\n  * Camper bouwen\n    * BLOG\n    * VIDEO’S\n    * ZELFBOUW ONDERDELEN\n    * INLOG COMMUNITY & E-BOOKS\n  * UITBESTEDEN\n  * VANLIFE\n  * OVER ONS\n    * ONS VERHAAL\n    * BEKIJK ONZE CAMPER\n\n__\n\n  *   *   *   * \n\n  * ZELFBOUW BOEKEN\n  * Camper bouwen\n    * BLOG\n    * VIDEO’S\n    * ZELFBOUW ONDERDELEN\n    * INLOG COMMUNITY & E-BOOKS\n  * UITBESTEDEN\n  * VANLIFE\n  * OVER ONS\n    * ONS VERHAAL\n    * BEKIJK ONZE CAMPER\n\n__\n\n#  Camperverzekering vergelijken en afsluiten? Dit moet je weten!\n\nDoor  by NOMADS\n\nnovember 18, 2020\n\n## CAMPER VERZEKEREN? HIER MOET JE OP LETTEN\n\n_Een camperverzekering. Je hebt net een nieuwe camper gekocht of na maanden\nklussen is je zelfbouw camper eindelijk klaar. Of misschien ben je zelfs je\ncamper nog aan het bouwen. Voordat je zorgeloos de weg op kunt dien je jouw\ncamper te verzekeren. Een WA verzekering camper is verplicht. Je kunt ook\nkiezen voor een WA beperkt casco dekking of all risk camperverzekering. Maar\nwat zijn nou precies de verschillen tussen deze dekkingen? En waar moet je op\nletten bij het afsluiten van een kampeerautoverzekering? Door een\ncamperverzekering te vergelijken kun je geld besparen op de premie. Wij helpen\nje op weg en geven tips over hoe je het beste een camperverzekering kunt\nvergelijken._\n\n_**DISCLAIMER** : Dit blog is gebaseerd op uren research en eigen ervaring.\nDit maakt ons echter geen jurist. Regels en voorwaarden van de wet en van\nverzekeraars zijn onderhevig aan verandering. Daarom kunnen er aan dit artikel\ngeen rechten worden ontleend. Het is met zorg samengesteld, maar we raden je\naan om ook eigen onderzoek te verrichten._\n\n### VERZEKERING CAMPER: LEER VAN ONZE ERVARING\n\nTijdens de bouw van onze zelfbouw camper hebben wij een (dure) bestelauto\nverzekering afgesloten. Wat wij niet wisten is dat er ook voordeligere\nopbouwverzekeringen bestaan. Toen onze camper door de RDW was gekeurd hebben\nwe een camperverzekering afgesloten. Voorafgaand hieraan hebben we\nverschillende verzekeraars met elkaar vergeleken. Al snel ontdekten we dat de\npremie en voorwaarden per verzekeraar verschillen. Zo staat niet elke\nverzekeraar woon-werkverkeer toe. Ook verschilt de maximaal toegestane\naaneengesloten reisperiode.\n\nMaar dit was niet het enige wat wij ontdekten. Voor het eerst hoorden we\nnamelijk dat onze zelfbouw camper moest worden getaxeerd alvorens wij deze All\nRisk konden verzekeren. Eigenlijk vrij logisch want zo kan de exacte waarde\nvan de camper worden vastgesteld. Tijdens de wintermaanden kan zo’n taxatie op\nvrij korte termijn worden uitgevoerd, maar in de zomermaanden kunnen de\nwachttijden oplopen. Hierdoor zul je wellicht je reisplannen uitstellen of kun\nje de camper tijdelijk alleen casco verzekeren. Kortom: er komt best wat\nkijken bij het uitzoeken en afsluiten van een camperverzekering.\n\n### IS EEN CAMPERVERZEKERING VERPLICHT?\n\nJa. Een camper is een motorrijtuig en valt onder de Wet\nAansprakelijkheidsverzekering Motorrijtuigen (WAM). Daarom ben je verplicht om\nje camper minimaal WA te verzekeren. Net zoals dit geldt voor gewone auto’s.\nWA staat voor wettelijke aansprakelijkheid. Een WA camperverzekering dekt\nalleen schade die je met jouw camper aan anderen toebrengt.\n\n### WELKE VERZEKERINGSVORMEN ZIJN ER VOOR CAMPERS?\n\nNaast een WA camperverzekering zijn er nog twee aanvullende dekkingsvarianten:\nWA beperkt casco en All Risk. Wat deze verzekeringsvormen precies inhouden\nleggen we hieronder uit:\n\n#### WA\n\nWA is de afkorting van Wettelijke Aansprakelijkheid. Je bent verplicht jouw\ncamper minimaal WA te verzekeren. Een WA dekking vergoedt alleen schade die je\naan andere personen en andermans camper toebrengt. Daarmee zijn blikschade van\nandere campers en letselschade als gevolg van een ongeval te claimen op een WA\nverzekering.\n\n#### WA beperkt casco\n\nNaast de Wettelijke Aansprakelijkheid dekt beperkt casco ook schade aan jouw\neigen camper. De exacte oorzaken staan beschreven in de polisvoorwaarden van\ncamper verzekeraars. Meestal is er dekking voor schade aan je eigen camper die\nontstaan is door diefstal, joyriding, brand, storm, hagel, ruitschad en\nbotsing met dieren. Dus als de camper is gestolen en niet meer is\nteruggevonden, beschadigd is door een hagelbui of brand, of je hebt een\naanrijding gehad met een overstekend hert, dan is dit doorgaans te claimen op\nde WA beperkt casco dekking.\n\nDaarmee ben je tegen flink wat meer risico’s verzekerd dan met een standaard\nWA verzekering. Terwijl de premie vaak niet eens heel veel scheelt met een WA\nverzekering. Met name als je veel schadevrije jaren hebt opgebouwd (waarover\nlater meer).\n\n#### All Risk (ook wel WA + volledig casco genoemd)\n\nDe All Risk camperverzekering, ook wel WA + volledig casco genoemd, dekt ook\nschade aan je camper als gevolg van een aanrijding. Zelfs als deze schade is\nontstaan door je _eigen schuld_. Bijvoorbeeld wanneer je met je camper tegen\neen paaltje aanrijdt. Maar ook schade aan de camper veroorzaakt door omslaan,\nslippen en van de weg raken zijn verzekerd. En stel je bent de handrem\nvergeten en je camper rolt hierdoor van een helling af dan wordt dit gedekt\nmet een All Risk verzekering. De All Risk camperverzekering is het duurst,\nmaar vrijwel alle risico’s worden met deze verzekering gedekt en dat biedt\nzekerheid.\n\n### VOOR WELKE WAARDE KAN IK MIJN CAMPER VERZEKEREN?\n\nJe kunt jouw camper verzekeren tegen nieuwwaarde, aanschafwaarde,\ntaxatiewaarde en dagwaarde. Dit bepaalt welk bedrag er wordt uitgekeerd bij\ndiefstal en total loss en naast andere factoren ook de hoogte van de premie.\n\n_**Nieuwwaarde**_  \nIndien je een nieuwe camper koopt kun je de waarde van de camper voor een x\naantal jaar verzekeren tegen de nieuwwaarde. Wanneer de camper wordt gestolen\nof total loss is verklaard krijg je met deze regeling de nieuwwaarde van de\ncamper vergoed. Deze regeling geldt gemiddeld 5 tot 10 jaar, afhankelijk van\nde verzekeraar. Het biedt veel zekerheid, maar resulteert ook in een hoge\npremie.\n\n**Aanschafwaarde  \n**Als je een tweedehands camper hebt gekocht die nog relatief jong is kun je\nhem laten verzekeren tegen de aanschafwaarde. Je hebt hiervoor een factuur\nnodig van de aankoopwaarde.\n\n**Taxatiewaarde**  \nHeb je een zelfbouw camper of een camper die al wat ouder is dan kun je deze\nverzekeren tegen de taxatiewaarde. Bij diefstal of total loss wordt de\ntaxatiewaarde uitgekeerd. Deze is doorgaans hoger dan de dagwaarde.\n\n**Dagwaarde  \n**Als de camper een lage dagwaarde heeft dan zal deze bij een ongeluk sneller\ntotal loss worden verklaard. Een hoge premie betalen is dan eigenlijk ‘zonde’.\nBij verzekeren tegen de dagwaarde betaal je de laagste premie, maar het uit te\nkeren bedrag bij diefstal of total loss is ook het laagst.\n\n_NOTE: sommige verzekeraars eisen beveiligingssystemen zoals eenBearlock\nwanneer de camper een bepaalde waarde heeft. Bijvoorbeeld bij €75.000 of\nmeer._\n\n### IS DE VERZEKERING UIT TE BREIDEN MET AANVULLENDE DEKKINGEN?\n\nJazeker. Dit is uiteraard afhankelijk van wat de camper verzekeraar aanbiedt\nen wat er standaard onder de gekozen premie valt. Vaak kun je een camper\nverzekeren tegen onderstaande aanvullende dekkingen:\n\n  * **Rechtsbijstand**. Hiermee krijg je professionele juridische ondersteuning bij een juridisch conflict. Bijvoorbeeld bij een ongeval in binnen- of buitenland of bij een geschil met de garage.\n  * **Ongevallen-inzittenden verzekering**. Deze dekking vergoedt de werkelijk geleden schade voor jezelf en passagiers. Zowel letsel als materiële schade worden vergoed. Dus denk aan vergoeding voor medische behandeling, inkomstenderving en schade aan bagage en kleding. De hoogte van het verzekerde bedrag is doorgaans tot 1 miljoen euro, maar kan variëren per verzekeraar.\n  * **Inboedel**. Onder inboedel, ook wel inventaris genoemd, wordt verstaan de losse zaken in de camper zoals beddengoed, gasflessen, gordijnen en televisie. Maar ook een laptop, camera en koffiezetapparaat die je meeneemt op reis worden tot de inventaris gerekend. Bij sommige verzekeraars is de inventaris bij een All Risk verzekering gratis meeverzekerd. Vaak tot een bedrag van €3000 of €5000. Wil je dit bedrag verhogen dan gaat de premie omhoog.\n\n### WAT KOST EEN CAMPERVERZEKERING?\n\nDe hoogte van de premie wordt bepaald door verschillende factoren zoals: de\ngekozen dekking (WA, WA beperkt casco, All Risk) en eventuele aanvullende\ndekkingen. Hoe meer zekerheid je wilt, des te hoger de premie zal zijn. Maar\nook de volgende factoren zijn bepalend voor de hoogte van de premie:\n\n  * **De waarde van de camper, het type, bouwjaar en gewicht**. Hoe nieuwer en hoe hoger de waarde van de camper, des te hoger de premie. Verzekeraars kijken ook naar het gewicht van een camper. Want hoe zwaarder de camper, des te groter de impact bij een aanrijding.\n  * **No claim korting**. Heb je schadevrije jaren opgebouwd (met een auto, camper of bestelbus) dan valt de premie lager uit. Hoe meer schadevrije jaren, des te hoger de korting. Hoeveel korting je krijgt verschilt per verzekeraar.\n  * **Pakketkorting**. Als je meerdere verzekeringen bij een verzekeraar hebt afgesloten krijg je doorgaans korting op de premie. Hoe meer verzekeringen, des te hoger de korting.\n  * **Postcode**. Verzekeraars laten de premie deels afhangen van waar je woont. Hoe meer risico op diefstal en inbraak des te hoger de premie.\n  * **Leeftijd verzekeringnemer**. Jonge bestuurders tot 24 jaar moeten vaak een hogere premie betalen omdat ze in vergelijking met oudere bestuurders meer schade aanrichten. Soms gaat dit gepaard met een verhoogd eigen risico.\n\n### HOE VERZEKER IK MIJN ZELFBOUW BUS TIJDENS DE VERBOUWING?\n\nTijdens het ombouwen van bus naar camper kun je een bestelbus verzekering\nafsluiten. Camperverzekerd biedt echter de mogelijkheid om de bestelbus al te\nverzekeren als camper indien je de bus binnen 4 weken volledig laat ombouwen\nen bij de RDW laat keuren. Ook NKC biedt een **opbouwverzekering** aan. Deze\nbiedt alleen een WA dekking en alleen ritten van- en naar de bouwmarkt en de\nRDW keuring zijn toegestaan. In tegenstelling tot Camperverzekerd zit er bij\nde opbouwverzerkering van de NKC geen maximale duur aan de verzekering. De\npremie kost je een paar tientjes per maand. Wel verwacht/ eist NKC dat je na\nde opbouwverzekering een camperverzekering bij hen afsluit. Aveco biedt de\nmogelijkheid om jouw bus tijdens de bouw All Risk te verzekeren tegen de\ngeschatte taxatiewaarde. Mits de camper binnen een half jaar wordt omgebouwd\nen de camper een minimale waarde heeft van €15000.\n\nHet voordeel van een opbouwverzekering ten opzichte van een bestelbus\nverzekering is de lagere premie. Wij betaalden €150 per maand voor een\nbestelbus verzekering bij Univé. Met de kennis van nu zouden we kiezen voor\neen opbouwverzekering. Dit had ons veel geld bespaard. Wij raden je aan om bij\njouw gewenste verzekeraar telefonisch te informeren naar de mogelijkheden.\n\nWil je jouw bus schorsen tijdens de bouw? Ook dan is het raadzaam om te\ninformeren naar de verzekeringsmogelijkheden bij jouw gewenste verzekeraar.\n\n#### NA RDW KEURING CAMPERVERZEKERING AFSLUITEN\n\nNadat jouw bus door de RDW is gekeurd en dit administratief is verwerkt\nwijzigt de fiscale categorie van zakelijke bestelbus naar personenauto. Je\ngrijze kenteken is dan niet meer geldig. Je ontvangt van de RDW per post een\nnieuwe kentekenbewijs waarmee je zelf nieuwe kentekenplaten dient te laten\nmaken. Dit betekent ook dat je direct een **camperverzekering** moet afsluiten\nen je oude verzekering moet opzeggen of wijzigen.\n\nKies je een WA beperkt casco of All Risk dekking voor jouw zelfbouw camper dan\nzal de verzekeraar vragen om een taxatierapport. Verzekeraars hebben meestal\nhun eigen taxateurs. Tijdens zo’n taxatie wordt niet alleen de waarde van de\nzelfbouw camper vastgesteld, ook wordt er gekeken naar de veiligheid van de\nelektrische- en gasinstallatie. Doorgaans zijn de kosten voor taxatie voor\neigen rekening. Als je jouw camper in het voorjaar of in de zomer wilt laten\ntaxeren kunnen er wachttijden zijn.\n\n#### VOORDELEN CAMPER TAXATIE\n\nMet een taxatie weet je precies wat je camper waard is en of de gas- en\nelektrische installatie veilig zijn. Daarnaast is de camper voor een x aantal\njaar (afhankelijk van de verzekeraar) verzekerd voor het getaxeerde bedrag.\nDus als de camper verloren gaat door brand of diefstal of total loss is\nverklaard, dan wordt het getaxeerde bedrag uitgekeerd in plaats van de\ndagwaarde.\n\n### VERZEKERING & PERMANENT WONEN IN DE CAMPER\n\nWanneer jij in je camper gaat wonen dan is het belangrijk dat je een\nverzekering afsluit terwijl je nog op een woonadres staat ingeschreven. Anders\nwordt het lastig. Kies voor een verzekeraar die een reisduur van 365 dagen per\njaar dekt.\n\nNadat de camper is verzekerd kun je je inschrijven op een postadres. Hier kun\nje post ontvangen en zodoende behoud je het recht op toeslagen (sociale\nvoorzieningen) en verzekeringen. Je moet wel kunnen aantonen dat je minimaal 4\nmaanden per jaar in Nederland bent. Dit hoeft niet aaneengesloten te zijn. Ben\nje meer dan 8 maanden in het buitenland dan ben je verplicht om je uit te\nschrijven van de gemeente. Hierdoor kun je geen (wegen)belasting betalen en\nzal ook jouw Nederlandse kenteken hiermee vervallen. Dus ben je van plan om\nlanger dan 8 maanden in het buitenland te reizen, dan is het makkelijkst om je\ntijdelijk bij je ouders of iemand anders in te schrijven.\n\n### WAAR MOET IK OP LETTEN BIJ HET AFSLUITEN VAN EEN CAMPERVERZEKERING?\n\nAlhoewel camperverzekeringen van verschillende aanbieder in grote lijnen op\nelkaar lijken, bestaan er wel degelijk verschillen. Door\nkampeerautoverzekeringen met elkaar te vergelijken kun je enorm besparen op de\nkosten van de premie.\n\n### CAMPERVERZEKERING VERGELIJKEN OP PREMIE EN VOORWAARDEN\n\nEr zijn veel factoren waar je rekening mee dient te houden bij het afsluiten\nvan een verzekering. Laat je niet ‘misleiden’ door een lage premie. Het\nbelangrijkste is dat de verzekering aansluit bij jouw wensen. Jouw camper is\neen kostbaar bezit die je goed wil verzekeren. Check daarom altijd de\npolisvoorwaarden van een verzekeraar. Lees hieronder onze tips voor het\nvergelijken van camperverzekeringen.\n\n#### NIEUWWAARDE-, AANKOOPWAARDE- EN TAXATIEREGELING\n\nDeze verschillen per verzekeraar. Bij sommige is de nieuwwaarderegeling 10\njaar, terwijl een andere verzekeraar maximaal 5 jaar hanteert. Dat betekent\ndat een bus na bijvoorbeeld 5 jaar opnieuw moet worden getaxeerd. Hetzelfde\ngeldt voor de aankoopwaarde- en taxatieregeling.\n\n#### NO-CLAIM KORTING\n\nAls jij schadevrije jaren hebt opgebouwd kun je korting krijgen op de premie.\nBij de ene verzekeraar loopt deze korting sneller op dan bij de andere\nverzekeraar. Met andere woorden: een kortere bonus-malus ladder. Zo geeft NKC\nnou vijf opgebouwde schadevrije jaren al de maximale korting van 80% korting\nop de premie. ANWB geeft 80% korting na 8 schadevrije jaren. Bij Aveco is de\nmaximale korting 60% en deze bereik je na 10 jaar.\n\n#### HOOGTE EIGEN RISICO\n\nHet eigen risico is niet bij elke verzekeraar verplicht mits de schade wordt\nhersteld bij een aangesloten schadehersteller. Ook de hoogte van het eigen\nrisico varieert. Sommige verzekeraars bieden de mogelijkheid om het eigen\nrisico te verhogen en daarmee de premie te verlagen. Let op: voor het\nvervangen van een ruit moet je wel eigen risico betalen.\n\n#### INBOEDEL & ACCESSOIRES EN HOOGTE VERZEKERDE BEDRAG\n\nWat tot de inboedel wordt gerekend en de hoogte van het verzekerde bedrag\nverschillen per verzekeraar. Doorgaans worden kleding, elektronica en\nkostbaarheden niet tot de inboedel van de camper gerekend. En ook accessoires\nzoals een zonneluifel, fietsdrager of schotel worden niet door elke\nverzekeraar standaard gedekt. Vergelijk daarom altijd de polisvoorwaarden van\nde desbetreffende camperverzekeraars voor meer informatie. Check ook wat er\ndoor de doorlopende reisverzekering wordt vergoed.\n\n#### PECHHULP IN BINNEN EN BUITENLAND\n\nVind je het belangrijk dat in heel Europa goede pechhulp beschikbaar is? Denk\nhierbij aan vervangend vervoer na een ongeval of diefstal, maar ook\nrepatriëring en verzenden van onderdelen. Bij sommige verzekeraars is dit\nstandaard meeverzekerd (Aveco), maar niet bij alle. Check ook of de\nalarmcentrale dag en nacht bereikbaar is. Zo is de alarmcentrale van Centraal\nBeheer 7 dagen per week, 24u per dag bereikbaar. Het laatste wat je namelijk\nwil bij pech is dat je jouw verzekeraar niet kunt bereiken.\n\n#### MAXIMAAL AANEENGESLOTEN REISPERIODE EN KILOMETERGRENS\n\nBen je van plan om voor een lange aaneengesloten periode met de camper te gaan\nreizen? Dan is dit iets om rekening mee te houden. Zo mag je met de Centraal\nBeheer camperverzekering 180 aaneengesloten naar het buitenland, maar bij\nAveco, Camperverzekerd en NKC is het toegestaan om 365 aaneengesloten dagen te\nreizen (lees recreëren), mits je een officieel woon of postadres in Nederland\nhebt. Let wel op de APK verplichting. Sommige verzekeraars hanteren ook een\nkilometergrens. Bijvoorbeeld 7500 kilometer per jaar. Kom je boven die grens\nuit dan gaat de premie omhoog.\n\n#### DEKKINGSGEBIED\n\nGa jij met je camper door Europa reizen dan is dit wellicht niet van belang\nvoor jou. Maar ben je van plan om naar Marokko te reizen of bijvoorbeeld de\ncamper te verschepen naar Zuid Amerika, check dan van tevoren of je in deze\nlanden bent verzekerd.\n\n#### CAMPER VERHUUR\n\nSharing is caring! Wil jij je camper uitlenen aan vrienden of familie? Dan\ndien je dit aan te geven bij de verzekeraar. Er zijn verzekeraars die dit niet\ntoestaan. Of wil je jouw camper verhuren en geld verdienen? Ook dit wil je\nvooraf checken. Bij Aveco en NKC is verhuur aan derden tegen een toeslag\ntoegestaan. Maar bij ANWB en Camperverzekerd is dit niet toegestaan.\n\n_TIP: Wanneer je jouw camper viaGoboony verhuurt, kun je een dagverzekering\nafsluiten. Deze verzekering is alleen geldig tijdens de verhuur, dus je hebt\ngeen kosten wanneer de camper niet wordt verhuurd. Dit is de makkelijkste\nmanier voor extra financiële bescherming tijdens de verhuur van je camper.\nLees hier alles over het verhuren van je camper._\n\n#### WOON-WERKVERKEER\n\nGa je de camper niet alleen recreatief maar af en toe ook als woon-werkverkeer\ngebruiken? Niet elke verzekeraar staat dit toe. Verzekeraars die woon-\nwerkverkeer naast recreatief gebruik standaard toestaan zijn NKC en Aveco.\n\n#### HUISDIEREN\n\nNeem je huisdieren mee in je camper? Dan wil je dat deze ook goed zijn\nverzekerd. Kies daarom een camper- en reisverzekering die bij een aanrijding\ngeneeskundige kosten voor je huisdier vergoed en repatriëring mocht dat nodig\nzijn.\n\nOm het jou makkelijk te maken hebben we een handige ‘camper verzekering\nvergelijken’ checklist gemaakt:\n\n_Klikhier om de checklist te downloaden._\n\n### WAT IS DE BESTE CAMPER VERZEKERAAR?\n\nWat is de beste camper verzekeraar vraag je je wellicht af? Dat hangt geheel\naf van jouw situatie en wensen. Elke camper is uniek! Om jou op weg te helpen\nhebben we de plus en minpunten van de grootste camper verzekeraars op een rij\ngezet. Gebruik onze vergelijkingschecklist en ontdek welke camper verzekeraar\nhet beste bij jou past.\n\n#### ANWB CAMPERVERZEKERING\n\n\\+ 24/7 hulp ANWB alarmcentrale  \n\\+ Tot 80% no-claim korting (na 8 schadevrije jaren)  \n\\+ Leden 5% korting  \n\\+ Voordelig tweedehands camper verzekeren. Mogelijkheid om\naanschafwaardedekking voor 3 of 5 jaar af te sluiten.  \n\\+ Geen verplicht eigen risico bij schade indien de reparatie wordt uitgevoerd\ndoor een door de ANWB geselecteerd schadeherstelbedrijf  \n– Maximaal 6 aaneengesloten maanden verzekerd als je met camper naar\nbuitenland gaat. Wil je langer dan moet je dit doorgeven en moet de aanvraag\nworden beoordeeld.  \n– ANWB Camperverzekering geldt alleen voor recreatief gebruik. Verhuur tegen\nbetaling is niet toegestaan.  \n– Camper mag niet permanent worden bewoond.\n\nBezoek de website voor meer informatie over de ANWB camperverzekering.\n\n#### AVECO CAMPERVERZEKERING\n\n\\+ Woon-werkverkeer naast recreatief gebruik standaard toegestaan  \n\\+ Hulp bij pech en schade standaard meeverzekerd in heel Europa.  \n\\+ Gratis inventaris dekking t.w.v. € 5.000,-  \n\\+ 365 dagen aaneengesloten reizen met camper toegestaan  \n\\+ Stalling in buitenland gedekt tot 6 aaneengesloten maanden  \n\\+ Geen terugval in no-claimkorting bij luifel- en/of hagelschade  \n\\+ Uitlenen aan vrienden en familie meeverzekerd, verhuren via deelplatform\ntegen hogere premie.\n\nKlik hier voor meer informatie over de Aveco camperverzekering.\n\n#### CAMPERVERZEKERD\n\n\\+ Accessoires (luifel, fietsendrager, schotel, etc.) standaard meeverzekerd  \n\\+ Gratis € 5.000,- uitgebreide inboedeldekking op de (beperkt) casco\ncamperverzekering  \n\\+ Uitlenen van camper aan familie of kennissen toegestaan  \n\\+ 10 Jaar nieuwwaarderegeling voor nieuwe campers en 5 Jaar taxatiewaarde\ngarantie voor occasion campers bij een all-risk camperverzekering  \n\\+ No-claimkorting tot 80% (bij 8 jaar), wordt ook overgenomen van auto of\nmotor  \n\\+ Geen verplicht eigen risico en onbeperkte kilometrage  \n\\+ Verzekeren tijdens ombouwen van bus naar camper toegestaan onder bepaalde\nvoorwaarden  \n– Verhuur via deelplatform is niet toegestaan (!) Camper wordt in zijn geheel\nniet verzekerd als je de camper gaat verhuren via verhuur platforms.  \n– Woon-werkverkeer niet toegestaan.\n\nKlik hier voor informatie over de camperverzekering van Camperverzekerd.\n\n#### CENTRAAL BEHEER CAMPERVERZEKERING\n\n\\+ Tot 3 jaar na aankoop de aanschafwaarde terug bij diefstal en total loss\n(WA+ Beperkt Casco en All Risk).  \n__\\+ 24 uur per dag en 7 dagen per week hulp van de alarmcentrale.  \n\\+ Dekking in heel Europa,Turkije, Israël, Marokko en Tunesië.  \n\\+ Schade aan spullen die uitsteken of van de camper vallen zijn verzekerd.  \n\\+ Je kunt zelf de hoogte van je inventaris dekking kiezen (€1500, €3000,\n€4500 of €6000).  \n– Zakelijk gebruik van de camper is niet toegestaan noch verzekerd.  \n– Maximaal 180 dagen aaneengesloten reizen in het buitenland toegestaan.\n\nKlik om direct je premie te bereken of voor meer informatie over de Centraal\nBeheer camperverzekering.\n\n#### DE CAMPERVERZEKERING\n\n\\+ Lage premie  \n\\+ Aankoopwaarde garantie  \n\\+ Gratis vervangende camper en/of onderdelen (casco)  \n\\+ Zelfbouw camper verzekering\n\nLees hier meer informatie over De Camperverzekering.\n\n#### NKC CAMPERVERZEKERING\n\n\\+ Verhuur toegestaan in de camperverzekering voor camper t/m 15 jaar (tegen\ntoeslag)  \n\\+ Pechhulpdekking in binnen- en buitenland standaard verzekerd Beperkt Casco\nen Volledig Casco  \n\\+ 10 Jaar nieuwwaarderegeling voor nieuwe campers en en 5 Jaar taxatiewaarde\nregeling voor gebruikte campers  \n\\+ Biedt mogelijkheid tot WA verzekering voor tijdens het ombouwen van bus\nnaar camper  \n\\+ 80% no-claim korting na 5 schadevrije jaren, ook tot maximaal 80% korting\nop huidige personenautoverzekering  \n\\+ Woon-werkverkeer standaard en zonder extra kosten meeverzekerd  \n– Hoge premie\n\nKlik hier om direct jouw premie te bereken voor een NKC camperverzekering.\n\nNaast bovengenoemde camper verzekeraars kun je ook terecht bij Allianze, Aon,\nASR, Europeesche, NH1816, Interpolis, Rabobank, en Unigarant.\n\n#### LAATSTE TIP VOOR ONDERWEG\n\nZorg dat je altijd een Europees Schadeformulier op reis meeneemt. Bij schade\nben je namelijk verplicht om deze in te vullen anders gaat een verzekeraar\nniet over tot uitbetaling. Vul het formulier volledig en laat de andere\nbetrokkene ook het formulier ondertekenen. Daarnaast is het raadzaam om\ncontactgegevens uit te wisselen en een foto te maken van het kentekenbewijs\nvan degene die schade bij jou heeft veroorzaakt.\n\n\n\n### MEER AANBEVOLEN CAMPER BOUW BLOGS\n\n– Camper inbraak en diefstal voorkomen: alle opties op een rij  \n– Wetgeving & Papierwerk zelfbouw campers  \n– Camper isoleren met Armaflex isolatiemateriaal  \n– Wegenbelasting camper: voorkom dat je teveel betaalt\n\n_Dit blog bevat Affiliate Links. Lees er meer over in onzedisclaimer._\n\n\n\n##\n\n## CAMPER BOUWEN BLOGS\n\n\n\n### Camper Accu: AGM, GEL of Lithium?\n\nLees meer\n\n\n\n### Camper laten bouwen door ervaren camperbouwers\n\nLees meer\n\n\n\n### CAMPER BED MAKEN: SLAAPBANK OF VAST (LENGTE) BED\n\nLees meer\n\n\n\n### OMVORMER CAMPER: WELKE IS DE BESTE?\n\nLees meer\n\n\n\n### Camper elektra schema\n\nLees meer\n\n\n\n### Camper koelkast: absorptie vs compressor\n\nLees meer\n\n\n\n### Compressor camper koelkast: werking, verbruik & kosten\n\nLees meer\n\n\n\n### Camper absorptie koelkast: werking, verbruik & kosten\n\nLees meer\n\n\n\n### Camper Elektra Aanleggen: Zo hebben wij het aangepakt!\n\nLees meer\n\n\n\n### Top 7 meest geschikte bussen voor een camper\n\nLees meer\n\n\n\n### Watersysteem camper: onderdelen, montage handleiding & tips\n\nLees meer\n\n\n\n### Bus ombouwen tot camper kosten\n\nLees meer\n\n\n\n### Boodschappenlijst: Camper Elektra Onderdelen\n\nLees meer\n\n\n\n### Camper terugverdienen? Verhuur je camper!\n\nLees meer\n\n\n\n### Toilet camper: chemisch toilet of compost toilet kiezen?\n\nLees meer\n\n1  2  3\n\npagina 1 van 3\n\nCamper bouwen camper verzekeren camper verzekering Camperverzekering\nCamperverzekering vergelijken Kampeerautoverzekering\n\nCamperverzekering vergelijken en afsluiten? Dit moet je\nweten!2020-11-182023-04-28https://www.bynomads.nl/wp-\ncontent/uploads/2020/05/logo_bynomads_liggend-1.pngby NOMADS | Hét camperbouw\nblog van Nederland!https://www.bynomads.nl/wp-\ncontent/uploads/2020/09/camperverzekering.jpg200px200px\n\nShowing 11 comments\n\n  * Harrie Froeling december 3, 2020\n\nBeantwoorden\n\nWeer een mooie duidelijk brief met interessante onderdelen\n\n    * by NOMADS december 7, 2020\n\nBeantwoorden\n\nBedankt Harrie! We doen ons best 🙂\n\n  * Marissa december 4, 2020\n\nBeantwoorden\n\nHoi! Bedankt voor het goede overzicht. Nog even een toevoeging: Aveco\nverzekert geen campers die bij ingang van de polis ouder dan 20 jaar zijn.\nOnze zelfbouwcamper van een brandweerbus uit 1998 kan daar dus niet worden\nverzekerd!\n\n    * by NOMADS december 7, 2020\n\nBeantwoorden\n\nHoi Marissa, dank voor de waardevolle toevoeging :)!\n\n  * Miranda februari 23, 2021\n\nBeantwoorden\n\nHallo~ Dit is een zeer informatieve pagina. Ik ben van plan een camper te\nkopen of om te bouwen. Weten jullie misschien ook of je per se een Nederlands\nkenteken nodig hebt voor een Nederlandse verzekering? Ik heb navraag gedaan\nbij een paar verzekeraars en niemand doet aan verzekeringen met kentekens van\neen ander EU-land.\n\nMiranda\n\n    * by NOMADS maart 15, 2021\n\nBeantwoorden\n\nHoi Miranda, bedankt! Helaas hebben wij hier geen antwoord op. Je kunt\ninderdaad het beste zelf bij verschillende verzekeraars hierover informeren.\nSucces!\n\n  * Gerard februari 26, 2021\n\nBeantwoorden\n\nHoi,  \nJullie schrijven over permanente wonen in camper met een postbus adres.  \nMisschien weten jullie dit niet maar er is een misvatting over\npostbusadressen.  \nPostbusadressen kan voor bovengenoemde omschrijving gebruikt worden, maar…..\nje moet hierbij los hiervan een woonadres hebben. (dus een woning en\ningeschreven in het GBA van de gemeente.)  \nHeb je geen woning meer (dus ook niet ingeschreven in het GBA), en je wilt\npermanent in de camper wonen, dan is dit alleen mogelijk met een ‘briefadres’.\nDit accepteert de gemeente als ingeschreven (lees woonadres) de gemeente jou\nkan bereiken. Een legaal “woonadres”. dan maakt het niet uit waar je met je\ncamper bent c.q. verblijft.  \nDus:  \nbriefadres = ingeschreven in GBA (‘woonachtig’)  \npostadres = aparte woonadres vereist.\n\nGroet,  \nGerard\n\n  * Mariek augustus 5, 2021\n\nBeantwoorden\n\nToevallig met de anwb gebeld. Maar daar is recreatief gebruik door familie en\nvrienden wel verzekerd. Je mag er alleen niet mee verdienen.\n\n    * by NOMADS augustus 31, 2021\n\nBeantwoorden\n\nGoed om te weten! Thanks voor het doorgeven 🙂\n\n  * Dries december 27, 2021\n\nBeantwoorden\n\nEen camperverzekering wel of niet opschorten in de winterperiode?\n\n    * by NOMADS januari 12, 2022\n\nBeantwoorden\n\nHier hebben wij niet voor gekozen. Dit komt mede omdat we onze camper ook (of\njuist) in de stalling verzekerd willen hebben tegen bijvoorbeeld brand.\n\n###\n\nLaat een bericht achter\n\nReactie annuleren\n\nOnthoud mijn naam, email en website voor de volgende keer\n\n**Camper bouwen:**\n\nCamper bouwen  \nCamper isoleren  \nZelfbouw camper ideeën  \nCamperverzekering  \nZonnepaneel camper aansluiten  \nZonnepaneel camper  \nZonnepaneel camper berekenen  \nCamper ramen inbouwen  \nRegels & wetgeving camper bouwen  \nEmma Matras Korting  \nCamper onderdelen zelfbouw  \nOntdreuningsplaten  \nArmaflex  \nCamperbouwers  \nCamper elektra  \nCamper elektra schema\n\n**Vanlife:**\n\nInternet in de camper  \nVanlife  \nCamper verhuren\n\n**Roadtrips:**\n\nRoadtrip Nieuw-Zeeland  \nRoadtrip Canada  \nRoadtrip Amerika  \nRoadtrip Costa Rica  \nRoadtrip Mexico  \nRoadtrip Guatemala  \nRoadtrip IJsland  \nRoadtrip Nederland  \nVakantie Lapland\n\n**Navigatie:**\n\nContact  \nNieuwsbrief  \nPrivacy & Cookies  \nSamenwerken  \nOver ons  \nDuitsland\n\nVolg ons:\n\n  \n\n© 2023 by NOMADS\n\nBegin met typen en druk op enter\n\n__\n\n##### Cookies\n\nDeze website maakt gebruik van cookies om jouw gebruikerservaring te\nverbeteren. Door gebruik te maken van onze website en verder te surfen, ga je\nhier automatisch mee akkoord en erken je onze Privacy Policy. Meer informatie\nover deze verwerking van (persoons)gegevens en cookies kun je lezen in ons\nPrivacy Policy en Cookiebeleid.  \nAccepteerWeiger Lees meer  \n  \n\nPrivacy & Cookies Policy\n\nSluiten\n\n#### Privacy Overview\n\nThis website uses cookies to improve your experience while you navigate\nthrough the website. Out of these, the cookies that are categorized as\nnecessary are stored on your browser as they are essential for the working of\nbasic functionalities of the website. We also use third-party cookies that\nhelp us analyze and understand how you use this website. These cookies will be\nstored in your browser only with your consent. You also have the option to\nopt-out of these cookies. But opting out of some of these cookies may affect\nyour browsing experience.\n\nNecessary\n\nNecessary\n\nAltijd ingeschakeld\n\nNecessary cookies are absolutely essential for the website to function\nproperly. This category only includes cookies that ensures basic\nfunctionalities and security features of the website. These cookies do not\nstore any personal information.\n\nNon-necessary\n\nNon-necessary\n\nAny cookies that may not be particularly necessary for the website to function\nand is used specifically to collect user personal data via analytics, ads,\nother embedded contents are termed as non-necessary cookies. It is mandatory\nto procure user consent prior to running these cookies on your website.\n\nOPSLAAN & ACCEPTEREN\n\n",
    "links": "[{\"link\": \"https://www.bynomads.nl/camper-bouwen/camperverzekering/#respond\", \"text\": \"Reactie annuleren\"}, {\"link\": \"https://www.bynomads.nl/camper-bouwen/camperverzekering/\", \"text\": \"Camperverzekering\"}]"
}