{
    "summary": "  * Hypotheekadvies Terug Hypotheekadvies  Kosten hypotheekadvies  Leennormen (hypotheeknormen) 2024  Huizenprijzen verwachting  Kan ik een huis kopen?  Overwaarde  Maximale hypotheek berekenen 2024  Nieuwe hypotheek afsluiten  Tweede hypotheek  Overwaarde huis  Hypotheek verhogen  Overwaarde opnemen  Extra aflossen hypotheek  Hypotheek oversluiten  Hypotheekvormen  Starterslening  Hypotheek vanaf 57 jaar  Actuele rentestanden  Hypotheekrente verwachting  Hypotheek afsluiten  Hypotheek voor zzp  Hypotheekrenteaftrek  Einde rentevaste periode  Hypotheek zonder werkgeversverklaring  Rente-opslag  Nationale hypotheek garantie \n  * Financieel advies Terug Financieel advies  Pensioenadvies  Financiële blik  Verzekeringsadvies  Financiële planning  Consumptief krediet  Schenken  Scheiden  Arbeidsongeschiktheid  Onafhankelijk financieel advies \n  * Jouw (woon)situatie Terug Jouw (woon)situatie  Eerste huis kopen  Ander huis kopen  Nieuwbouwhuis kopen  Huis verbouwen  Huis verduurzamen  Hypotheek zonder vast contract \n  * Makelaardij Terug Makelaardij  Hypotheekakte  Huis kopen  Huis verkopen  Aankoopmakelaar  Verkoopmakelaar  Nieuwbouwhuis kopen  Bestaand huis kopen  Zelf een huis bouwen \n  * Over ons Terug Over ons  Het Oranje Fonds  Pers  Franchisenemer worden?  Onze dienstverlening  Contact  Vacatures  Begrippenlijst  Onze partners \n\n  * Huidige rente\n\n  * Vestiging zoeken\n\n  * Afspraak maken\n\n  * Chatten\n\n  * 0800 1600\n\n  *  __Inloggen\n\nZoek\n\n  * Disclaimer\n  * Privacyverklaring & Cookiebeleid\n\n  * Hypotheekadvies\n\nHypotheekadviesKosten hypotheekadviesLeennormen (hypotheeknormen)\n2024Huizenprijzen verwachtingKan ik een huis kopen?OverwaardeMaximale\nhypotheek berekenen 2024Nieuwe hypotheek afsluitenTweede hypotheekOverwaarde\nhuisHypotheek verhogenOverwaarde opnemenExtra aflossen hypotheekHypotheek\noversluitenHypotheekvormenStartersleningHypotheek vanaf 57 jaarActuele\nrentestandenHypotheekrente verwachtingHypotheek afsluitenHypotheek voor\nzzpHypotheekrenteaftrek Einde rentevaste periodeHypotheek zonder\nwerkgeversverklaringRente-opslag Nationale hypotheek garantie\n\n  * Financieel advies\n\nFinancieel adviesPensioenadviesFinanciële blikVerzekeringsadviesFinanciële\nplanningConsumptief kredietSchenkenScheidenArbeidsongeschiktheidOnafhankelijk\nfinancieel advies\n\n  * Jouw (woon)situatie\n\nJouw (woon)situatieEerste huis kopenAnder huis kopenNieuwbouwhuis kopenHuis\nverbouwenHuis verduurzamenHypotheek zonder vast contract\n\n  * Makelaardij\n\nMakelaardijHypotheekakteHuis kopenHuis\nverkopenAankoopmakelaarVerkoopmakelaarNieuwbouwhuis kopenBestaand huis\nkopenZelf een huis bouwen\n\n  * Over ons\n\nOver onsHet Oranje FondsPersFranchisenemer worden?Onze\ndienstverleningContactVacatures BegrippenlijstOnze partners\n\nMaak een afspraak  Vind jouw vestiging\n\n__\n\n__\n\n__\n\nKosteloos eerste gesprek\n\n100% onafhankelijke financieel advies\n\nWe vergelijken ruim 40 geldverstrekkers\n\nTelefonisch, online of op de vestiging\n\nKosteloos eerste gesprek\n\n100% onafhankelijke financieel advies\n\nWe vergelijken ruim 40 geldverstrekkers\n\nTelefonisch, online of op de vestiging\n\n  *   *   *   *   * \n\n# Camperverzekering\n\nMet een camper neem je altijd jouw eigen vakantieverblijf mee op reis. Een\ncamper is uiteraard geen voordelige aanschaf. Je zult er ongetwijfeld goed\nover nadenken voordat je een camper koopt. Dan is het ook fijn als je bij\neventuele schade goed gedekt bent en niet voor hoge kosten komt te staan.\nZoals je voor een auto een autoverzekering kunt afsluiten, zo kun je voor een\ncamper een camperverzekering nemen. Een WA-verzekering is wettelijk verplicht.\nDaarnaast kun je je extra laten verzekeren voor schade aan je eigen camper of\ndiefstal.\n\nMaak een afspraak\n\n  1. Home\n  2. Financieel advies\n  3. Verzekeringsadvies\n  4. Camperverzekering\n\n## Op deze pagina:\n\n  * Wat is een camperverzekering?\n  * Is een camperverzekering verplicht?\n  * Welke dekking heb jij nodig?\n  * Camperverzekering bij dagelijks gebruik\n  * Wat kost een camperverzekering?\n  * Persoonlijk advies over jouw verzekeringen?\n  * Veelgestelde vragen\n\n##\n\n## Wat is een camperverzekering?\n\nMet een camperverzekering verzeker je jezelf tegen schade die jij met je\ncamper veroorzaakt. Denk aan mogelijke schade bij botsingen of bij het\ninparkeren. De verzekeraar vergoedt die schade dan (onder bepaalde\nvoorwaarden) aan degene die hier nadeel van heeft. Het gaat daarbij om zowel\nmateriële schade aan andere voertuigen als om immateriële schade, zoals\nwanneer iemand tijdelijk arbeidsongeschikt is na een ongeluk.\n\nVan de camperverzekering bestaan, net als bij een autoverzekering, drie\nvarianten:\n\n  *  **WA-verzekering**. Deze camperverzekering is minimaal verplicht. Zonder die verzekering mag je de weg niet op met je camper. Met de WA-verzekering ben je gedekt voor schade die jij per ongeluk aan anderen toebrengt met je camper. Schade aan je eigen camper of diefstal van je camper valt niet onder deze dekking. Ook botsingen met loslopende dieren zijn vanuit deze verzekering niet gedekt.\n  *  **WA+ (beperkt casco) verzekering.** Deze dekking is iets uitgebreider. Je bent hiermee ten eerste verzekerd voor schade die je aan (eigendommen van) anderen toebrengt met je camper. Daarnaast ben je beperkt verzekerd voor diefstal en bepaalde schade aan je camper. Het gaat daarbij om schade door bijvoorbeeld brand, storm of een botsing met een dier. Is de schade ontstaan doordat iemand anders jou heeft aangereden of door vandalisme? Dan valt dat meestal niet onder de WA+-dekking. Voor de schade veroorzaakt door iemand anders ben je afhankelijk van de verzekering van die persoon.\n  *  **Allrisk (volledig casco)-verzekering.** Dit is de meest uitgebreide camperverzekering. Hiermee ben je verzekerd voor schade die je toebrengt aan anderen en voor vrijwel alle schades aan je eigen camper. Het gaat dan bijvoorbeeld ook om schades die ontstaan door een aanrijding, vandalisme of door brand, storm of ruitschade. Zelfs als iemand tegen je camper is gereden en geen briefje achterlaat, krijg je mogelijk een vergoeding.\n\nJe kunt daarnaast kiezen voor aanvullende dekkingen. De meest voorkomende is\nde inzittendenverzekering. Daarmee is ook schade aan de passagiers in je auto\nverzekerd. Stel: jij veroorzaakt een botsing en je meerijder raakt daardoor\nblijvend invalide, dan keert de verzekeraar hiervoor mogelijk een bedrag uit.\n\nVerder kun je vaak kiezen voor pechhulp. Dat betekent dat je hulp van de\nverzekeraar krijgt als jij met pech langs de weg staat met je camper.\n\n## Is een camperverzekering verplicht?\n\n **Ja, als je met een camper de weg op wilt, dan moet je een camperverzekering\nhebben.** Dat wil zeggen: je moet minimaal een WA-camperverzekering afsluiten.\nDe uitgebreidere dekkingen zijn optioneel.\n\nDat een camperverzekering, net als een autoverzekering, verplicht is, heeft\nermee te maken dat schade die je bij anderen veroorzaakt flink in de papieren\nkan lopen. Door een camperverzekering te nemen, hoef je niet bang te zijn dat\njij opeens voor een enorme kostenpost komt te staan. Andersom weet het\nslachtoffer zeker dat jij de kosten voor het ongeluk kunt betalen.\n\n## Welke dekking heb jij nodig?\n\nJe hebt dus de keuze tussen meerdere dekkingen. Welke daarvan past het beste\nbij jou? Dat hangt van allerlei zaken af. Uiteraard betaal je meer voor de\ncamperverzekering naarmate je een uitgebreidere dekking neemt. Toch kan een\nuitgebreide dekking soms wel handig zijn.\n\nJe loopt altijd het risico op diefstal of schade aan je camper. De kosten\ndaarvoor kunnen flink oplopen, zeker als je een nieuwe camper hebt. We raden\ndaarom met name voor nieuwe of duurdere campers aan om je in een allrisk- of\nWA+-dekking te verdiepen. Dat geldt overigens ook als je zelf weinig buffer\nhebt. Het is dan fijn als je een beroep kunt doen op de verzekering wanneer er\ntoch iets gebeurt en je hoge kosten moet maken.\n\n **Wil je weten welke dekking goed bij jou past voor je camper? Maak een\ngratis eerste afspraak met een van onze** **verzekeringsadviseurs** **voor\npersoonlijk advies.**\n\nGratis eerste afspraak\n\n>  **Let op:** bij sommige verzekeraars is ook de inboedel in je camper tot\n> een bepaald bedrag verzekerd. Daaronder vallen bijvoorbeeld je kookspullen\n> of luifel. Dit geldt niet voor elke camperverzekering. Kijk dus goed wat bij\n> jouw verzekering wel en niet gedekt is.\n\n## Camperverzekering bij dagelijks gebruik\n\nGebruik je een camper ook voor dagelijks vervoer? Dan zorgt dat soms voor\nlastige kwesties met de verzekeraar. De premie voor een camperverzekering is\ner namelijk op gebaseerd dat jij de camper beperkt gebruikt voor vakanties en\ndat je dus een beperkt aantal kilometers rijdt. Als je de camper ook privé\ngebruikt, rijd je er meer kilometers mee. Bovendien is het risico dat je\nschade veroorzaakt groter dan bij een auto, omdat een camper een groter\nvoertuig is.\n\nAls je je camper ook dagelijks gebruikt, kan het dus zijn dat je er een gewone\nautoverzekering of een bestelautoverzekering voor moet afsluiten. Overleg\nhierover met de verzekeraar of met je verzekeringsadviseur.\n\n>  **Let op:** meestal staan camperverzekeraars het niet toe om je camper te\n> verhuren. Als een huurder schade maakt met je camper, is de schade dus niet\n> gedekt. Je camper uitlenen aan familie kan soms wel. Maar check goed de\n> voorwaarden om te zien wat in die gevallen gedekt is bij schade.\n\n## Wat kost een camperverzekering?\n\nEen camperverzekering kost meestal minder dan een standaard autoverzekering.\nDit heeft er vooral mee te maken dat je met een camper over het algemeen\nminder rijdt dan met een auto. Dat verkleint het risico voor de verzekeraar op\neen claim.\n\nWat een camperverzekering voor jou kost, hangt af van een aantal factoren:\n\n  *  **de dekking** dat je kiest (voor all-risk betaal je meer dan voor WA+, en voor WA+ betaal je meer dan voor een gewone WA-verzekering);\n  * welke **aanvullende dekkingen** je eventueel neemt;\n  *  **de camper** waarin je rijdt (de leeftijd, de waarde, de grootte, het soort brandstof, etc.);\n  *  **hoeveel kilometer** je per jaar rijdt;\n  *  **de regio** waar je woont (in de Randstad is de kans op een aanrijding of inbraak groter dan in rustigere gebieden);\n  *  **je schadevrije jaren** (rijd jij al een paar jaar schadevrij in een camper, dan betaal je minder premie dan als je nog geen schadevrije jaren hebt).\n\nGa gemiddeld uit van ongeveer € 700,- per jaar voor een WA-verzekering. Voor\neen WA+-verzekering kun je rekenen op gemiddeld € 1.400,-. Kies je voor een\nall-risk-verzekering? Dan kan je premie oplopen tot gemiddeld € 2.400,- per\njaar.\n\n>  **Goed nieuws:** heb je schadevrije jaren opgebouwd met je auto? Dan kun je\n> die meenemen voor no-claimkorting voor je camperverzekering. Je hoeft dan\n> een stuk minder premie te betalen.\n\n## Persoonlijk advies over jouw verzekeringen?\n\nWil jij met je camper goed verzekerd de weg op gaan? Heb je misschien meer in\nhet algemeen vragen over jouw verzekeringspakket? Onze verzekeringsadviseurs\ngeven je graag persoonlijk advies over zowel je camperverzekering als andere\nlopende verzekeringen.\n\n **Ontdek wat passende verzekeringen zijn voor jou én hoe je bespaart op\npremie. Maak een gratis eerste afspraak met een van onze verzekeringsadviseurs\nen ontdek zo welke opties jij hebt.**\n\nGratis eerste afspraak\n\n## Veelgestelde vragen\n\n##  Wat is de goedkoopste camperverzekering?\n\nEen WA-verzekering is bij elke verzekeraar voordeliger dan een\ncamperverzekering met WA+- of all-risk-dekking. Wel is het zo dat niet voor\niedereen dezelfde camperverzekering als voordeligst uit de bus komt. Vergelijk\ndus het volledige verzekeringsaanbod en kijk ook zeker naar de voorwaarden. Zo\nkun je een camperverzekering kiezen die bij je past en die ook voordelig is.\nOnze verzekeringsadviseurs staan je hierin graag bij.\n\n##  Waar moet ik op letten bij het kiezen van een camperverzekering?\n\nNeem altijd goed de voorwaarden voor dekking door als je een camperverzekering\nkiest. Staar je daarbij niet blind op de tarieven, maar onderzoek ook wat je\nvoor de premie terugkrijgt. Zo is bij de ene verzekeraar wel de inboedel van\nje camper verzekerd en bij de andere niet. Check ook of pechhulp bij je\nverzekering is inbegrepen. Onderzoek verder wat bij de verschillende\nverzekeraars onder de WA+- en all-risk-dekking valt. Dit verschilt nogal per\nverzekeraar.\n\n##  Kun je een camperverzekering tijdelijk stopzetten?\n\nRijd je langere tijd niet in je camper en wil je daarom je camper tijdelijk\nniet verzekeren? Dan kun je via de website van de RDW een online schorsing\naanvragen voor maximaal één jaar. Je betaalt wel wat kosten voor de schorsing.\nJe kunt de camper voor maximaal één jaar schorsen. In die tijd heb je niet per\nse een camperverzekering nodig, maar het is soms alsnog handig om de\nverzekering aan te houden. Sowieso gaan verzekeraars niet altijd akkoord met\nhet tijdelijk stopzetten van de verzekering. Bovendien is je camper anders ook\nniet verzekerd voor bijvoorbeeld diefstal of schade.\n\n### Veelgestelde vragen verzekeringen\n\nWelke soort verzekeringen zijn er?\n\n  * \n\n### Veelgestelde vragen verzekeringen\n\n  * 10 tips voor het afsluiten van een autoverzekering\n  * Welke verzekeringen zijn verplicht? \n  * Welke soorten verzekeringen zijn er?\n  * Is een autoverzekering voor jongeren duurder dan voor ouderen?\n  * Wat dekt een reisverzekering?\n\n## VAN BRUGGEN ADVIESGROEP\n\nVan Bruggen Adviesgroep is sinds 1973 actief als financieel dienstverlener.\nOnze ruime kennis en ervaring zetten wij graag in om jou van dienst te zijn.\n\n#### Vind jouw vestiging\n\n## Afspraak maken?\n\nGa in gesprek met een van onze financieel adviseurs.\n\nMaak een afspraak\n\n## VAN BRUGGEN ADVIESGROEP\n\nVan Bruggen Adviesgroep is sinds 1973 actief als financieel dienstverlener.\nOnze ruime kennis en ervaring zetten wij graag in om jou van dienst te zijn.\n\n#### Vind jouw vestiging\n\n## Afspraak maken?\n\nGa in gesprek met een van onze financieel adviseurs.\n\nMaak een afspraak\n\n## blogs, vlogs en nieuws\n\n#### Inflatie eurozone weer iets omlaag\n\n05 december 2023\n\nNieuws\n\nDe inflatie in Nederland in november kwam volgens een snelle berekening van\nhet Centraal Bureau voor de Statistiek (CBS) uit op 1,6%. Dat is de inflatie\nop jaarbasis. Daarmee komt de inflatie op jaarbasis hoger uit dan in oktober,\ntoen het verschil op jaarbasis nog -0,4% was. Dat betekent overigens niet dat\nde prijzen op maandbasis zijn gestegen. Integendeel, de prijzen lagen in\nnovember ongeveer 1,1% lager dan in oktober. Voor de ontwikkeling van de\nrentes is niet zozeer de ontwikkeling van de inflatie in Nederland van belang,\nmaar die in Europa. Van de 20 eurozone-landen ging alleen de inflatie in\nNederland omhoog. De jaarlijkse inflatie in de hele eurozone kwam in november\nuit op 2,4%. Dat is lager dan de 2,9% in oktober. Christine Lagarde, president\nvan de Europese Centrale Bank (ECB), waarschuwt wel voor te veel optimisme. De\nprijzen stijgen nog altijd harder dan gewenst. Bovendien bestaat de kans dat\nde inflatie hierna toch een korte opleving krijgt. Bijvoorbeeld als de lonen\nper 1 januari stijgen en er automatische prijscorrecties aan het begin van het\nnieuwe jaar komen. Over twee weken is de volgende bestuursvergadering van de\nECB. De verwachting is dat de ECB haar rente ongewijzigd zal laten. Er is op\ndit moment geen reden om de rente te verhogen, omdat de inflatie behoorlijk\nhard naar beneden gaat. Maar voor een renteverlaging lijkt het nog veel te\nvroeg. Beleggers kijken op dit moment over het algemeen positief tegen de\ninflatieontwikkelingen aan. We zien dat de marktrentes toch iets verder naar\nbeneden gaan. Daardoor ontstaat er ook ruimte om de licht daling bij de\nhypotheekrentes voort te zetten.\n\nLees meer\n\n#### Hypotheekrente-verwachting 2024\n\n28 november 2023\n\nNieuws\n\nVan Bruggen Adviesgroep acht de kans het grootst dat de hypotheekrentes in\n2024 licht dalen. Maar het voorspellen van de hypotheekrente-ontwikkeling is\ngeen exacte wetenschap, meer een beredeneerde gok. Wij geven daarom liever een\naantal scenario’s, waarvan het ene waarschijnlijker is dan het andere. Daarbij\nmoet je wel in het achterhoofd houden dat onverwachte gebeurtenissen niet in\ndeze scenario’s verwerkt zijn. Zo werden wij en alle economen in 2022 verrast\ndoor de oorlog in Oekraïne. Die oorlog leidde tot een energiecrisis, hoge\ninflatie en enorm snel stijgende hypotheekrentes (van ongeveer 1% naar ruim\n4%). De ontwikkelingen in 2023 kwamen wat dat betreft meer overeen met ons\nmeest realistische scenario, namelijk een hypotheekrente (10 jaar vast) rond\nde 4% met een min of plus van een paar tienden. Uiteindelijk schommelde de 10\njaar vaste hypotheekrente met NHG in 2023 tussen de 3,99% en de 4,53%. Drie\nscenario’s We geven hierna drie scenario’s: 1) het scenario dat ons het meest\nreëel lijkt, 2) een positiever scenario, en 3) een negatiever scenario.\nDaarbij geven we aan waar deze scenario’s van afhankelijk zijn. Het blijft\ngelden dat alle scenario’s ingehaald kunnen worden door de werkelijkheid.\nScenario 1: de gemiddelde hypotheekrente 10 jaar vast met NHG daalt in de loop\nvan 2024 naar een niveau van tussen de 3,5% en 4% (meest realistische\nscenario, met 55% waarschijnlijkheid) In 2023 werden we een groot deel van de\ntijd heen en weer geslingerd bij de vraag of de inflatie voldoende naar\nbeneden te krijgen was. Er waren regelmatig twijfels of de forse\nrenteverhogingen van de centrale banken snel genoeg effect zouden hebben op de\ninflatie. Maar de laatste maand is dat beeld aan het draaien. De centrale\nbanken in Europa en de Verenigde Staten hebben dan ook op de pauzeknop\ngedrukt. De hoop wordt steeds groter dat we de renteverhogingen van de\ncentrale banken achter de rug hebben. Beleggers vragen zich nu eerder af\nwanneer de centrale banken de rente in 2024 gaan verlagen. Een renteverlaging\nvan de centrale banken betekent niet automatisch een renteverlaging van de\nlange rentes, zoals de hypotheekrentes. In 2023 heeft de Europese Centrale\nBank (ECB) haar rente verhoogd met 2% (van 2% naar 4%), maar de 10 jaar vaste\nhypotheekrente is nog geen half procent gestegen in 2023. De hypotheekrentes\nveranderen dus niet automatisch met renteverlagingen van de centrale banken\nmee. Maar onze verwachting is wel dat beleggers een renteverlaging door de\ncentrale banken positief ontvangen en dat een renteverlaging ook tot lagere\nhypotheekrentes zal leiden. Wel zullen centrale banken voorzichtig zijn met\nhet verlagen van hun rente. Ze zullen eerst willen zien dat de inflatie onder\ncontrole is. Daarvoor moet de inflatie nog verder naar beneden gaan. Toch\nhebben we goede hoop dat de dalende trend bij de inflatiecijfers in de loop\nvan 2024 aanleiding is voor renteverlaging, die gevolgd wordt door\nhypotheekrenteverlagingen. Wij schatten dat de 10 jaar vaste hypotheekrente\nmet NHG in de loop van 2024 daalt naar een niveau tussen de 4% en 3,5%.\nScenario 2: de gemiddelde hypotheekrentes dalen in 2024 richting de 3% (het\noptimistische scenario, 30% kans) In ons optimistische scenario daalt de\ngemiddelde hypotheekrente voor 10 jaar vast harder dan in het meest\nrealistische scenario, namelijk naar een niveau rond de 3%. Dat kan\nbijvoorbeeld gebeuren als de inflatie harder daalt dan verwacht. De centrale\nbanken hebben met hun renteverhogingen in 2022 en 2023 steeds meer impact op\nde vertraging van de economie. In sommige Europese landen zien we nu al een\nlichte recessie. Vaak zien we dat centrale banken het restrictieve beleid te\nlang doorzetten en dat een economie in een zwaardere recessie terechtkomt dan\nde centrale banken voor ogen hadden. Dat kan ertoe leiden dat centrale banken\nde teugels meer willen laten vieren en de rente eerder en meer gaan verlagen.\nMaar ook een einde aan de oorlog in Oekraïne of een zachte winter kan\nbijdragen aan een snel lagere inflatie als gevolg van lagere energieprijzen en\ndaardoor snellere renteverlaging door de centrale banken. Daarnaast kan de\nsituatie op de Nederlandse hypotheekmarkt een rol spelen bij een snellere\nverlaging van de hypotheekrentes. We hebben een behoorlijk concurrerende\nhypotheekmarkt, maar menig geldverstrekker zal graag meer aanvragen krijgen nu\ner veel minder hypotheken afgesloten worden dan twee jaar geleden. Het\nmakkelijkste middel daarvoor is de rente verlagen. We zien dat deze\nconcurrentie al een effect van een paar tienden (ongeveer 0,2%) heeft gehad in\n2023. Wellicht zet dit nog iets verder door in 2024. Scenario 3: de gemiddelde\nhypotheekrentes komen in 2024 uit tussen de 4% en 5% (pessimistische scenario,\n15% kans) In ons pessimistische scenario komen we uit op een gemiddelde 10\njaar vaste hypotheekrente met NHG van ongeveer het huidige niveau of een paar\ntienden lager of hoger: ergens tussen de 4% en 5%. Dit scenario zou\nwerkelijkheid kunnen worden als de positieve signalen van de laatste weken te\nvoorbarig blijken te zijn en de inflatie op het huidige niveau stabiliseert of\nslechts heel langzaam daalt. Door het positieve nieuws van de afgelopen maand\nzouden we haast vergeten dat de meeste beleggers dit in 2023 een behoorlijk\nrealistisch scenario vonden voor 2024. Ook kan de inflatie opnieuw toenemen\ndoor een nieuwe energiecrisis. Dat scenario is niet geheel ondenkbaar. Dit zou\nbijvoorbeeld kunnen gebeuren bij een verdere escalatie van de oorlog tussen\nIsraël en Hamas. Als daar ook andere Arabische landen en de Verenigde Staten\nbij betrokken raken, kan dit tot een groot conflict uitgroeien, waarbij de\nolieprijzen stijgen. Langere-termijnverwachting (2025-2028) Onze lange-\ntermijnverwachting voor de hypotheekrentes voor 2025 tot en met 2028 is\nongewijzigd ten opzichte van vorig jaar. Op de langere termijn (2025-2028)\nverwachten wij dat we naar meer neutrale rentes van de ECB gaan, dat de\ninflatie weer rond de 2% uitkomt en dat er voldoende geld voor hypotheken\nbeschikbaar is. Een terugkeer naar hypotheekrentes tussen de 1 en 2% lijkt ons\nniet waarschijnlijk, maar hypotheekrentes tussen de 3 en 3,5% lijken mogelijk.\nMaar ook voor de lange- termijnvoorspelling geldt dat we verrast kunnen worden\ndoor onverwachte economische of politieke ontwikkelingen.\n\n**Blijf op de hoogte**\n\nSchrijf je nu in voor de nieuwsbrief en blijf op de hoogte van het laatste\n(rente)nieuws.\n\nAanmelden\n\nBedankt voor uw aanmelding.\n\nLees meer\n\n#### Kleine verlagingen hypotheekrentes\n\n21 november 2023\n\nNieuws\n\nVoor de tweede week op rij verlaagden geldverstrekkers hun hypotheekrentes. De\ntrend is nu duidelijk dalend. Alle rentewijzigingen van vorige week waren\nverlagingen. Ongeveer 3 op de 5 geldverstrekkers verlaagden hun rentes. De\ngemiddelde vaste hypotheekrentes zijn de afgelopen twee weken met ongeveer\n0,1% gedaald. De hypotheekrentes konden licht naar beneden worden bijgesteld,\nomdat de marktrentes dalen. Dat komt dan weer doordat beleggers hoop hebben\ndat de centrale banken klaar zijn met de renteverhogingen. Daarvoor is het van\nbelang dat de inflatie hard genoeg blijft dalen. Vanuit de Verenigde Staten\n(VS) kwam het goede nieuws dat de consumentenprijzen daar in oktober stegen\nmet 3,2%. Dat was iets lager dan de verwachte 3,3% en ook een stuk lager dan\nde 3,7% van september. Beleggers verwachten dat de centrale bank van de VS de\nrente nu niet meer gaat verhogen. Het bijzondere is dat de Amerikaanse\neconomie ondanks een groot aantal renteverhogingen een hoge economische groei\ndoormaakt. In het derde kwartaal groeide de Amerikaanse economie op jaarbasis\nmet 4,9%. In Europa gaat het moeizamer. De economische groei in de eurozone\nkwam in het derde kwartaal uit op een schamele 0,1%. Overigens hanteren we\nhier wel andere cijfers dan in de VS. In Europa kijken we naar de groei van\nkwartaal op kwartaal. In de eurozone zien we wel dat de inflatie daalt, maar\ndat gaat dus – in tegenstelling tot de VS – niet gepaard met een substantiële\neconomische groei. Ook voor de Europese Centrale Bank (ECB) zullen de huidige\ncijfers aanleiding zijn om haar rentes de komende tijd niet te verhogen.\nBovenstaand nieuws zorgt voor licht dalende marktrentes. De hypotheekrentes\nvolgen in iets mindere mate het patroon van de marktrentes. Het blijft alleen\nlastig om de renteontwikkeling op de middellange termijn te voorspellen.\n\nLees meer\n\n#### Lichte hoop dat we het hoogste rentepunt hebben gehad\n\n14 november 2023\n\nNieuws\n\nEr is bij beleggers lichte hoop ontstaan dat de centrale banken wel eens klaar\nkunnen zijn met hun renteverhogingen. Bovendien lijkt het rentebeleid haar\nwerk te doen en lijkt de inflatie ook richting het niveau te gaan dat centrale\nbanken wensen. De marktrentes gingen de afgelopen weken dan ook naar beneden.\nNiet iedereen was daar even blij mee. Powell, de voorzitter van de Amerikaanse\ncentrale bank (Fed), gaf aan dat de Fed voorzichtig moet blijven handelen en\ndat we moeten uitkijken dat we niet misleid worden door een paar maanden aan\ngunstige data. Powell wilde waarschijnlijk met deze uitspraak de euforie op de\nbeurzen een beetje drukken en voorkomen dat de marktrentes te veel naar\nbeneden gaan, omdat dan de goede trend van de laatste maanden weer doorbroken\nkan worden. Als het signaal van de Fed wordt opgepikt, dan verwachten wij dat\nwe zeker de komende maanden een rente houden die ongeveer op het huidige\nniveau of net iets lager ligt. Maar spectaculaire verlagingen verwachten wij\nniet. Maar zolang er geen slecht nieuws komt van een stagnerende\ninflatiedaling verwachten wij wel dat de markt- en hypotheekrentes hun hoogste\npunt gehad hebben. Kleine hypotheekrente verlagingen Bijna alle hypotheekrente\nwijzigingen die afgelopen week werden doorgevoerd waren verlagingen. Het ging\nover het algemeen om kleine verlagingen; de meest voorkomende verlaging was\n0,05%-punt. De meeste verlagingen waren er voor de populairste renteperiode\nvan 10 jaar vast. Maar liefst 4 op de 5 geldverstrekkers verlaagden de 10 jaar\nvaste hypotheekrente met NHG. Voor hypotheken 10 jaar vast zonder NHG zagen we\nminder verlagingen en ook bij andere rentevaste periodes waren er ook minder\nverlagingen. Het lijkt erop dat dankzij de concurrentie geldverstrekkers met\nname een zo scherp mogelijke rente willen bieden voor de meest populaire\nrentevaste periode van 10 jaar.\n\nLees meer\n\n#### Alleenstaande leraar en verpleegkundige zien kans op koopwoning groeien\nin 2024\n\n11 januari 2024\n\nNieuws\n\nDe mogelijkheden voor eenverdieners op de woningmarkt zijn toegenomen. Dat\nblijkt uit een analyse van Van Bruggen Adviesgroep en Independer. Door de\ngroei van het gemiddeld inkomen valt het maximale hypotheekbedrag hoger uit in\n2024. Ook alleenstaande starters met een vitaal beroep hebben meer kansen,\ndoor verbeterde cao’s in bijvoorbeeld de zorg en het onderwijs. Het inkomen\nvan een alleenstaande woningzoeker lag in 2023 gemiddeld 7,6 procent hoger dan\nin 2022, zo blijkt uit cijfers van Independer. “Het verschil tussen het\ninkomen wat woningzoekers in de maximale hypotheekberekening invullen en de\neenverdieners die er daadwerkelijk in slagen om een woning te kopen, wordt\nsteeds kleiner”, aldus Marga Lankreijer, hypotheekexpert van Independer. Van\nBruggen Adviesgroep ziet relatief steeds meer alleenstaanden een huis kopen.\n“In 2024 verwachten wij dat deze groep groter wordt. Naast de stijging van het\ninkomen neemt de betaalbaarheid toe door de dalende hypotheekrente en\ngunstigere hypotheeknormen”, stelt Oscar Noorlag, hypotheekexpert van Van\nBruggen Adviesgroep. Leraren en verpleegkundigen ineens kansrijk Ook\nalleenstaande leraren in het lager- en voortgezet onderwijs hebben in 2024\nmeer kans op het bemachtigen van een koopwoning, mede door het verbeterde cao-\nakkoord. Waar een startende docent begin 2023 zelf gemiddeld maximaal een\nhypotheek kon krijgen van 175.000 euro, kan die begin 2024 liefst 204.000 euro\nlenen. Koopt hij of zij een woning met een A of B-energielabel dan is dit\nzelfs 214.000 euro. Volgens cijfers van HDN over 2023 hebben de meeste\nNederlanders ongeveer 42.000 euro aan eigen vermogen, uit spaargeld of middels\neen schenking, wat gebruikt wordt voor de aanschaf van een woning. “Dat zou\nbetekenen dat een alleenstaande, beginnende leraar ongeveer 256.000 euro te\nbesteden heeft als hij een woning met een energielabel A of B koopt”, aldus\nLankreijer, die een vergelijkbare situatie ziet bij (startende)\nverpleegkundigen. “Door de verbeterde cao en nieuwe hypotheeknormen kunnen\nverpleegkundigen in 2024 liefst vijftien tot twintig procent meer lenen dan\nbegin vorig jaar.” Meer hypotheek, maar duurdere woningen Hoewel de\nleencapaciteit van veel Nederlanders groeit, stijgen ook de huizenprijzen\nsinds de tweede helft van 2023. “De prijzen zullen naar verwachting\ndoorstijgen, mogelijk met meer dan vijf procent. Desondanks loont het om\nopnieuw te inventariseren hoeveel hypotheek je kan krijgen. Voor meer\neenverdieners komt het kopen van een woning in 2024 binnen bereik”, aldus\nNoorlag. Maximale hypotheek stellen kan lager uitvallen Ook voor stellen\nverandert de maximale hypotheek in 2024. Het gezamenlijk inkomen van een\nwoningzoekend stel is gemiddeld minder hard gestegen dan onder eenverdieners.\nVoor sommige stellen pakken de nieuwe hypotheeknormen bovendien minder gunstig\nuit dan voor alleenstaanden, waarschuwt Noorlag. Ook het verschil tussen\nzoekers en hypotheeksluiters werd groter in 2023 onder stellen, ten opzichte\nvan 2022.\n\nLees meer\n\n#### Populaire 10 jaar vaste hypotheekrente onder 4%\n\n19 december 2023\n\nNieuws\n\nDe eerste geldverstrekkers hanteren voor de populairste rentevaste periode van\n10 jaar vast met NHG weer een hypotheekrente van onder de 4%. De gemiddelde\nhypotheekrente ligt met 4,14% nog wel iets boven de 4%. De gemiddelde vaste\nhypotheekrentes dalen nu al voor de zevende week op rij. In die periode zijn\nde gemiddelde 5 en 10 jaar vaste hypotheekrente met ongeveer 0,4% gedaald. De\nrentes voor 20 jaar vast daalden met bijna 0,3% en die voor 30 jaar vast met\n0,25%. De daling van de hypotheekrentes volgt op een nog snellere daling van\nde lange rentes op de financiële markten. Het wordt interessant hoe beleggers\nkijken naar de toelichting van de Europese Centrale Bank (ECB) op het\nrentebesluit om de rente ongewijzigd te laten. Die beslissing kwam voor\nniemand als een verrassing, omdat de inflatie de afgelopen maanden is gedaald.\nDe ECB kwam wel met een waarschuwing: op korte termijn zal de inflatie\nwaarschijnlijk tijdelijk weer stijgen, vooral door hogere loonkosten. De ECB\nverwacht dat de inflatie (exclusief de kosten voor energie en\nvoedingsmiddelen) in 2024 uitkomt op 2,7%, in 2025 op 2,1% en in 2026 op 1,9%.\nDe ECB maakte duidelijk dat er voorlopig nog geen zicht is op een rentedaling:\n“Op basis van onze huidige beoordeling zijn we van mening dat de\nbasisrentetarieven van de ECB op een niveau staan dat, indien aangehouden voor\neen voldoende lange periode, een substantiële bijdrage gaat leveren aan dit\ndoel. Met onze toekomstige besluiten zullen we ervoor zorgen dat onze\nbasisrentetarieven zo lang als nodig worden vastgesteld op een niveau dat\nrestrictief genoeg is.” Deze week gaan we zien welke uitwerking de\nrentebesluiten van de ECB en de Fed (de Amerikaanse centrale bank) hebben op\nde ontwikkeling van de rentes op de financiële markten. De eerste reactie van\nbeleggers was positief, de rentes op de financiële markten nog iets verder\nomlaag.Het zou ons niet verbazen als de rentes op de financiële markten straks\nmet een lager tempo dalen, of als de trend zelfs tijdelijk licht stijgend\nwordt doordat de daling de afgelopen weken wel heel hard is gegaan. Wel\nblijven wij optimistisch dat de kans groot is dat we gedurende een groot deel\nvan 2024 een licht dalende trend van de rentes gaan zien. Dat geldt zeker als\nde verwachtingen van de ECB over de inflatieontwikkeling uitkomen.\nVerduurzamen loont Onderstaande grafiek toont de ontwikkeling van de\ngemiddelde hypotheekrentes voor variabel, 5, 10, 20 en 30 jaar vast in het\nafgelopen jaar. Met in de linker grafiek de tarieven met NHG en in de rechter\ngrafiek de tarieven zonder NHG, waarbij we uitgaan van de tarieven tot en met\n100% marktwaarde. Wat doet de ECB depositorente met de verschillende rentes In\nonderstaande grafiek tonen we de rente ontwikkeling van verschillende rentes\nin het jaar 2022 en 2023. Legenda: De groene lijn geeft de ECB-depositorente\nweer. In juli 2022 is die rente verhoogd van -0,5% naar 0%. Daarna volgden in\ntotaal nog negen verhogingen, waardoor de ECB-depositorente op dit moment op\n4% staat. De grootste rentestappen waren in 2022. In 2023 kwamen daar nog\nstapjes van eerst 0,5% en later 0,25% bij. In totaal bedroeg de stijging in\n2023 2,5%. De laatste verhoging was in september en, zoals het er nu naar\nuitziet, blijft het bij die laatste verhoging. In de lichtblauwe lijn zie je\nde ontwikkeling van de 3 maands-geldmarktrente. Eigenlijk loopt die lijn de\nhele tijd vooruit op de verwachte renteverhoging van de ECB. Omdat beleggers\ngeen renteverhoging van de ECB meer verwachten, is de geldmarktrente nagenoeg\ngelijk aan de ECB-depositorente.De donkerblauwe lijn geeft de gemiddelde\nvariabele hypotheekrente met NHG weer. Vanaf ongeveer juli vorig jaar stijgt\ndeze variabele rente in hetzelfde tempo als de geldmarktrente, behalve in de\nperiode vanaf de laatste rentewijziging van de ECB. Toen stopte de stijging\nvan de geldmarktrente, terwijl de gemiddelde variabele hypotheekrente nog heel\nlicht een aantal weken door steeg, om pas iets later te stabiliseren. De\ndonkergele lijn geeft de ontwikkeling van de kapitaalmarktrente weer, dus de\nrente voor Nederlandse staatsleningen van 10 jaar. We zien dat die\nkapitaalmarktrente al vóór de renteverhogingen van de ECB in 2022 aan het\noplopen is. Dat is niet zo raar, omdat beleggers bij de hoogte van de rente\nkijken naar de inflatieontwikkeling en de verwachting over de toekomstige\ninflatieontwikkeling. Gedurende 2022 loopt de kapitaalmarktrente op van rond\nde 0% naar boven de 2,5%. Gedurende 2023 beweegt de kapitaalmarktrente meer\nzijwaarts, met een licht stijgend patroon, tot iets boven de 3% eind oktober.\nDaarna zet weer een daling in richting 2,5%. De oranje lijn geeft de\ngemiddelde 10 jaar vaste hypotheekrente met Nationale Hypotheek Garantie weer.\nIn feite volgt die rente de kapitaalmarktrente voor een groot deel, alleen is\nde ontwikkeling van de 10 jaar vaste rente minder grillig. In 2022 stijgt de\n10 jaar vaste hypotheekrente van rond de 1% naar 4,5%. In 2023 beweegt de 10\njaar vaste hypotheekrente eigenlijk het hele jaar tussen de 4% en 4,5%. Dus\nondanks een stijging van 2,5% van de ECB-depositorente bleef de gemiddelde\nhypotheekrente binnen die smalle bandbreedte van 4% en 4,5% bewegen. Dat komt\ndoordat beleggers er vertrouwen in hebben dat de inflatie door het ECB-\nrentebeleid voldoende naar beneden zal gaan.We zien nu dat beleggers\nvooruitlopen op renteverlagingen van de ECB, die hopelijk ergens in de loop\nvan het tweede deel van 2024 plaatsvinden. Zij denken dat de inflatie op de\ngoede weg is. Daardoor zien we ook de gemiddelde 10 jaar vaste hypotheekrente\ndalen. Maar waar de gemiddelde 10 jaar vaste hypotheekrente iets minder steeg\ntot en met oktober van dit jaar, gaat de daling nu ook even iets minder hard.\nVoor een verdere daling van de rentes is het belangrijk dat het optimisme van\nde beleggers over de inflatieontwikkeling wel uitkomt. De ECB gaf afgelopen\nweek wel een waarschuwing af: zij verwacht dat de inflatie in ieder geval\ntijdelijk weer even gaat stijgen.\n\nLees meer\n\n#### Hypotheekrente beweegt tegen de stroom in verder omlaag\n\n15 januari 2024\n\nBlogs\n\nGeldverstrekkers hebben er zin in. Een nieuw jaar betekent voor veel\ngeldverstrekkers een nieuwe doelstelling over hoeveel hypotheken of, beter\nnog, hoeveel hypotheekomzet zij dit jaar willen behalen. Een extra uitdaging\ndaarbij is de krimpende hypotheekmarkt. In 2023 werden veel minder hypotheken\nafgesloten dan in 2022. In 2024 zal het aantal afgesloten hypotheken op\nongeveer hetzelfde aantal uitkomen als in 2023, of misschien nog wel lager.\nGeldverstrekkers moeten dus veel uit de kast trekken om hun eigen aantal\nafgesloten hypotheken op peil te houden. Daarom zien we nu dalende\nhypotheekrentes. Dat gaat tegen de trend in, want de rentes op de financiële\nmarkten stijgen juist licht. Onderstaande grafiek laat goed de dalende\nhypotheekrentes zien. Het goede nieuws is dat de vaste hypotheekrentes al elf\nweken op rij dalen. De grootste daling zien we bij de rentevaste periodes van\n5 en 10 jaar. De daling van de gemiddelde hypotheekrentes met NHG is sinds\neind oktober meer dan 0,7%-punt. Dat komt voor de 10 jaar vaste hypotheekrente\nmet NHG neer op een daling van 15% ten opzichte van de rente eind oktober. De\nrentedaling voor 20 en 30 jaar vast is iets minder hard, met respectievelijk\n0,6% en 0,55%. Ook zien we dat de hypotheekrentes zonder NHG iets minder hard\ndalen dan de rentetarieven voor hypotheken met NHG. Blijven de hypotheekrentes\ndalen? Of de hypotheekrentes blijven dalen, is op voorhand niet met zekerheid\nte zeggen. Dat is afhankelijk van een groot aantal factoren. Wij verwachten\ndat de daling hierna trager zal gaan. Afgelopen week zagen we al dat niet alle\ngeldverstrekkers meedoen met de renteverlagingen. Ongeveer 3 op de 5\ngeldverstrekkers verlaagde afgelopen week de hypotheekrentes. De kans is groot\ndat geldverstrekkers voorzichtig aan gaan doen met rentverlagingen. De\nbelangrijkste reden? De rentes op de financiële markten zijn de laatste drie\nweken licht aan het stijgen. Al zagen we de laatste 2 dagen van vorige week\neen lichte daling. Je ziet duidelijk de tegendraadse beweging als je de\nontwikkeling van de 10 jaar vaste hypotheekrente (de blauwe lijn) afzet tegen\nde ontwikkeling van de rente voor Nederlandse staats-leningen van 10 jaar (de\noranje lijn). Het is niet raar dat de rentes op de financiële markten overall\nlicht stijgen. De afgelopen maanden was het positieve nieuws over de\ninflatieontwikkeling al verwerkt in de rentetarieven. Beleggers werden weer\nmet beide benen op de grond gezet door een hogere inflatie van 2,9% in de\neurozone over de maand december, tegenover 2,4% in november. In de Verenigde\nStaten vielen de banencijfers hoger uit, waardoor de Fed (de centrale bank van\nde VS) de eerste renteverlaging voor 2024 waarschijnlijk verder voor zich\nuitschuift. Het wordt interessant hoe de rentes op de financiële markten zich\ngaan ontwikkelen. Toch zijn de vooruitzichten voor geheel 2024 positief. De\nhypotheekrentes zullen naar onze verwachting binnenkort ook pas op de plaats\nmaken. Het snelle tempo van verlagingen van de afgelopen twee maanden zal niet\ndoorzetten. Zo nu en dan kan er best een renteverhoging komen. Maar wij achten\nde kans groot dat de trend in 2024 vooral dalend zal zijn. Daarbij is de\nvoornaamste vraag met welk percentage de hypotheekrente zal dalen. Overigens\nkunnen onverwachtse gebeurtenissen altijd roet in het eten gooien bij dit\nzonnige plaatje. Denk aan internationale conflicten die verder escaleren of\nontwikkelingen die we nu nog niet kunnen voorzien. Nieuwbouw cruciaal voor\n“treintjes” verkoop bestaande woningen De NVM maakte bekend dat het\nwoningaanbod in het vierde kwartaal van 2023 verder gedaald is. Dat is een\nzorgwekkende ontwikkeling, waarbij de achterblijvende bouw en oplevering van\nnieuwbouwwoningen een belangrijke rol speelt. Voor de doorstroming op de\nwoningmarkt zijn namelijk “treintjes” van woningverkopen heel belangrijk. Aan\nhet begin van een treintje heb je vaak een starter die een woning wil kopen.\nAls een starter een nieuwbouwwoning koopt, heeft dat geen verder effect op de\nkoopwoningmarkt. Koopt een starter een bestaande koopwoning? Dan heeft dit tot\ngevolg dat de verkoper zijn woning wil verkopen. Er ontstaat een treintje als\ndeze woningverkoper op zijn beurt een andere, veelal duurdere, koopwoning\nkoopt. Die woning heeft ook weer een verkoper. Het treintje wordt steeds\nlanger, totdat er een verkoper is die geen bestaande koopwoning koopt. Dat kan\nbijvoorbeeld zijn omdat de verkoper is overleden en de nabestaanden de woning\nverkopen, of omdat de verkoper naar een huurwoning, verzorgingstehuis of het\nbuitenland gaat. Maar de belangrijkste reden is als een verkoper een\nnieuwbouwwoning koopt. Nieuwbouw dalende lijn Nu de oplevering van én de\nbouwplannen voor nieuwbouw een dalende lijn vertonen, gaat dit steeds meer\ninvloed hebben op de bestaande koopwoningmarkt. Potentiële starters zijn er\ngenoeg. Ook zijn er genoeg huizenbezitters die naar een andere koopwoning\nwillen verhuizen, maar dan moeten zij wel een andere woning kunnen vinden. Als\nde laatste wagon van het “treintje” (namelijk een nieuwbouwwoning kopen en de\nhuidige woning verkopen) stokt, zal het aanbod op de bestaande woningmarkt\nverder krimpen. Niet blind staren op starters Het is dan ook te hopen dat een\nnieuw kabinet de nieuwbouw een extra impuls kan geven. Daarbij moeten we er\nrekening mee houden dat het plannen en bouwen van nieuwbouw een behoorlijke\ndoorlooptijd kent. Een gunstige ontwikkeling is in ieder geval dat de rente\naan het dalen is. Dat is gunstig voor aannemers, maar ook voor\nnieuwbouwkopers. Daarnaast lijken de prijzen voor veel bouwmaterialen\ngunstiger te zijn dan de afgelopen jaren. Chris van Zantwijk van de NVM maakte\nin het NVM-persbericht nog een belangrijke opmerking: “Laten we ons bij\nnieuwbouw niet blind staren op alleen starterswoningen, maar juist ook\nwoningen voor doorstromers en senioren realiseren.” Als de focus alleen ligt\nop starters, dan is dat niet goed voor de doorstroming op de bestaande\nkoopwoningmarkt. Bovendien zijn er minder beleggers te vinden die willen\ninvesteren in alleen het goedkope segment. Als er voldoende gebouwd wordt,\nontstaat er vanzelf doorstroming, waardoor starters ook op de bestaande\nwoningmarkt betaalbare woningen kunnen kopen. Stijging woningprijzen zet door\nBij een grote vraag naar koopwoningen en een beperkt aanbod is het heel\nlogisch dat de huizenprijzen stijgen. Dat zal versterkt worden door de dalende\nhypotheekrente, stijgende inkomens en de nieuwe hypotheeknormen. Die factoren\nzorgen voor een hogere leencapaciteit en leiden in een markt met weinig aanbod\ntot hogere prijzen. De transactieprijs van de NVM stijgt al drie kwartalen op\nrij en de kans is groot dat die stijging doorzet en we in 2024 over het\nhoogtepunt van 2022 heen gaan. Gaan we in 2024 meer doorstromers zien?\nAfgelopen jaar zagen we dat het aantal hypotheekaanvragen voor woningaankopen\nbij starters nagenoeg gelijk was aan het aantal in 2022. Maar het aantal\nhypotheekaanvragen van doorstromers (koopwoningeigenaren die een volgende\nwoning kopen) daalde in 2023 met 14%. Ten opzichte van 2020 zagen we zelfs een\nafname van meer dan 32%. We zien dat starters ondanks de fors gestegen\nhypotheekrente nog steeds heel graag de woningmarkt willen betreden. Dat is\nook niet zo raar. Voor veel starters is de urgentie heel hoog. Dat is bij\ndoorstromers anders: zij hebben al een dak boven hun hoofd. Sommige\ndoorstromers willen wel graag naar een andere koopwoning, maar alleen onder\nbepaalde omstandigheden. Hoge hypotheekrente Een belangrijke bottleneck voor\nveel doorstromers is de hogere hypotheekrente. De afgelopen jaren hebben veel\nhuizenkopers en huizenbezitters net tegen een heel lage hypotheekrente hun\nhypotheek afgesloten of overgesloten. Dat betekent dat ze relatief lage\nhypotheeklasten hebben. Als zij een andere, duurdere woning kopen, dan kunnen\nze hun bestaande hypotheek (inclusief lage hypotheekrente) vaak meenemen. Maar\nvoor het deel dat ze extra nodig hebben, moeten ze wel de huidige, hogere\nhypotheekrente betalen. Psychologisch doet dat wat met doorstromers, omdat ze\nde hypotheeklasten fors zien toenemen als gevolg van het extra hypotheekdeel\ndat ze tegen de hoge rente moeten lenen. In feite zijn starters veel slechter\nuit. Zij moeten tenslotte over het gehele hypotheekbedrag de huidige hoge\nrente betalen. Maar starters hebben de nieuwe werkelijkheid van de hogere\nrente meer geaccepteerd dan doorstromers. Ze kunnen niet anders als ze een\nkoopwoning willen bemachtigen. Het goede nieuws is dat de hypotheekrente aan\nhet dalen is. We verwachten dan ook dat meer doorstromers de stap willen\nzetten naar een volgende woning. Trend van huizenprijzen weer gedraaid\nAchteraf gezien kunnen we zeggen dat het begin van het tweede kwartaal in 2023\neen prima moment was om een huis te kopen, als we kijken naar de\nwaardeontwikkeling. Maar psychologisch gezien hadden veel doorstromers sinds\nde zomer van 2022 minder zin om hun woning te verkopen. De prijzen daalden.\nDan is het lastig om te accepteren dat je misschien een lagere waarde voor je\neigen woning moet accepteren bij verkoop. Wat mensen zich soms niet\nrealiseren, is dat verkopen in een dalende woningmarkt voor veel mensen juist\ngunstiger is. Je krijgt minder voor je eigen woning, maar je hoeft ook minder\nte betalen voor je volgende koopwoning. Omdat veel mensen er een duurdere\nwoning voor terugkopen, is het prijsvoordeel van de aan te kopen woning in een\ndalende markt vaak groter dan het nadeel van de lagere prijs voor de verkochte\nwoning. Ondanks dit gegeven verwachten wij dat de stijgende huizenprijzen meer\ndoorstromers zal stimuleren om een ander huis te kopen en hun huidige woning\nte verkopen. Willen versus kunnen Wij verwachten dat in 2024 meer doorstromers\ngeïnteresseerd zijn in de aankoop van een andere woning. De grote vraag blijft\nwel of het ook gaat lukken om een interessante nieuwe koopwoning te vinden.\nHet beperkte aanbod van woningen blijft ook voor de doorstromer een\nstruikelblok.\n\nLees meer\n\n#### Concurrentie op Nederlandse hypotheekmarkt neemt toe\n\n09 januari 2024\n\nBlogs\n\nEen goede graadmeter voor de concurrentie op de Nederlandse hypotheekmarkt is\nhet verschil tussen de gemiddelde rente voor staatsleningen voor 10 jaar en de\ngemiddelde hypotheekrente voor 10 jaar vast met NHG. Naar mate de concurrentie\ngroter is, zien we over het algemeen dat het verschil kleiner wordt. In de\ncrisisjaren 2010 tot en met 2013 zien we dat het verschil behoorlijk oploopt.\nDat kwam enerzijds doordat de concurrentie afnam, doordat enkele\ngeldverstrekkers de Nederlandse hypotheekmarkt vaarwel zegden en sommige\nandere geldverstrekkers veel minder geïnteresseerd waren om veel hypotheken\nweg te zetten, door de toegenomen risico’s op de hypotheekmarkt. Overigens\nspeelde toen ook mee dat geldverstrekkers relatief gezien een stuk duurder\nmoesten lenen dan de overheid. Als we 2023 vergelijken met 2022 dan zien we\ndat het verschil iets is afgenomen. Dat heeft er onder andere mee te maken dat\nveel geldverstrekkers op een stuk kleinere hypotheekmarkt hun hypotheekvolume\nop peil willen houden. Het makkelijkste middel om dit te realiseren is te\nconcurreren met een scherp rentetarief. Omdat de hypotheekmarkt in 2024 naar\nverwachting op een vergelijkbaar of iets lager niveau uitkomt in vergelijking\nmet vorig jaar, verwachten wij dat de concurrentie ook in 2024 fors zal zijn.\nGoede start van het jaar met veel hypotheekrenteverlagingen De forse\nconcurrentie zien we ook terug bij de hypotheekrente ontwikkeling in het\nnieuwe jaar. Terwijl de rentes op de financiële markten licht omhoog gingen,\nverlaagden veel geldverstrekkers hun vaste hypotheekrentes (zie bijlage). De\ngemiddelde vaste hypotheekrentes gingen met 0,05% tot en met 0,08% omlaag.\nBijna alle geldverstrekkers verlaagden in de eerste week van het nieuwe jaar\nhun hypotheekrentes, maar in sommige gevallen ging het alleen om een verlaging\nvan de rente voor een beperkt aantal rentevaste periodes. De belangrijkste\nuitzondering was de Rabobank die geen verlaging doorvoerde afgelopen week,\nmaar dat deze week goed maakt met extra grote verlagingen tot wel 0,15% voor\nonder andere enkele van de populairste rentevaste periodes met NHG. Dat de\nrentes op de financiële markten een pas op de plaats maken is niet heel\nverrassend. De afgelopen twee maanden waren de rentes fors gedaald door het\noptimisme onder beleggers dat de inflatie sterk op zijn retour is en ze steeds\neerder in 2024 een renteverlaging verwachten van de centrale banken. Op een\nbepaald moment zit al dat positieve nieuws verwerkt in de rentes en is het\nwachten op nieuw positief nieuws, voordat de rentes weer serieus verder omlaag\nkunnen. Of juist weer iets omhoog kunnen gaan, als er negatief nieuws komt.\nZoals bijvoorbeeld een vertraging in de daling van de inflatie of zelfs een\nkorte stijging. 10 jaar vaste hypotheekrente daalde in 2014 van 4,06% naar\n3,00% Zijn de hypotheekrentes op dit moment hoog? Ja, als je dat vergelijkt\nmet een groot deel van de afgelopen 10 jaar wel. Maar in de jaren 2010 tot en\nmet 2013 lagen de hypotheekrentes nog een stukje hoger en dat gold ook voor\nveel van de jaren voor 2010. Nog een paar opvallende zaken als we kijken naar\nbovenstaande grafiek: De gemiddelde hypotheekrentes voor de verschillende\nvaste hypotheekrentes zijn steeds dichter naar elkaar toe gekropen. Dat wil\nzeggen dat de renteverschillen tussen de verschillende rentevaste periodes\nsteeds kleiner zijn geworden. Economisch gezien is het meest logisch dat een\nkorte rentevaste periode goedkoper is dan een langere rentevaste periode. Dat\nbetekent ook dat je mag verwachten dat de variabele hypotheekrente over het\nalgemeen lager ligt dan de vaste hypotheekrentes. Het bijzondere is dat dit\nniet het geval is van 2015 tot en met 2021. In 2022 zien we dat de vaste\nhypotheekrentes eerder stijgen, dan de variabele hypotheekrentes. Maar in 2023\nhalen de variabele hypotheekrentes de vaste hypotheekrentes in. Onze\nverwachting is dat uiteindelijk de variabele hypotheekrentes aan het eind van\n2024 weer veel dichter in de buurt van de vaste hypotheekrentes zullen staan.\nTot slot willen we de hypotheekrenteontwikkeling in 2014 er nog even\nuitlichten. De gemiddelde hypotheekrente 10 jaar vast met NHG daalde in 2014\nmet bijna een heel procent van 4,06% naar 3%. Voor wie is dat met name van\nbelang? Voor degene die in 2014 de rente voor 10 vast zette en sindsdien niet\neen andere woning heeft gekocht of de hypotheek heeft overgesloten. Want voor\nhen loopt dit jaar de rentevaste periode af en krijgen ze te maken met een\nnieuwe rente. Het is nog afwachten of die hoger of lager gaat uitpakken dan de\nrente die ze op dit moment bepalen. Zeker voor mensen met een hypotheek zonder\nNHG is het goed om op het moment van het renteaanbod te kijken of de\ngeldverstrekker rekening houdt met de gestegen waarde van de woning. Bovendien\nkan het soms interessant zijn om over te stappen naar een andere\ngeldverstrekker als je bijvoorbeeld in een duur product zit. Huizenprijzen\nmoeten inflatie nog goed maken Het Centraal Bureau voor de Statistiek (CBS)\nmaakte vorige week bekend dat de inflatie over de maand december bij een\nsnelle berekening uit kwam op 1,2%. In november kwam de inflatie nog uit op\n1,6%. Over heel 2023 zijn consumentengoederen en -diensten 3,8% duurder dan in\n2022. Dat betekent dat we ook de prijsontwikkeling van huizen zouden moeten\ncorrigeren voor de inflatie. Want we kunnen met een euro nu niet alleen minder\nconsumentengoederen en -diensten kopen, maar ook minder huis. Ontwikkeling\nhypotheekrentes afgelopen 12 maanden In de grafiek op de volgende pagina laten\nwe de ontwikkeling van de prijsindex van bestaande woningen zien in de periode\n2020 tot en met november 2023. In dezelfde grafiek laten we ook de\nontwikkeling van die zelfde prijsindex zien gecorrigeerd voor inflatie. Wat je\nin de grafiek kunt zien is dat vanaf juni de prijsindex van bestaande woningen\ndraait van dalend naar stijgend. In november staat de prijsindex op 183,2 is\ndaarmee nagenoeg gelijk aan de maand januari, toen de prijsindex 183,3\nbedroeg. De prijzen zijn daarmee nog wel verwijderd van het hoogste punt dat\nbereikt werd in juli 2022, toen de prijsindex 189,2 bedroeg. Ook de reële\nprijsindex gaat rond de zomer omhoog, maar de inflatie in 2023 zorgt er wel\nvoor dat reëel gezien woningen in november met een reële prijsindex van 144,9\nnog wel een paar procent in reële waarde zijn gedaald ten opzichte van\njanuari, toen de prijsindex op 148,8 stond. Doordat de inflatie in 2022 fors\nwas, lag het hoogtepunt van de reële prijsindex niet in juli 2022, maar in\njanuari 158,2. Ontwikkeling kapitaalmarktrente en hypotheekrente Zoals we\neerder al schreven, stegen in de eerste week van het nieuwe jaar de rentes op\nde financiële markten. Dat is ook niet zo raar naar het over-optimisme van\nbeleggers in de laatste twee maanden van 2023. De banencijfers in de Verenigde\nStaten (VS) vielen hoger uit dan verwacht, wat voor de Fed, de centrale bank\nvan de VS reden kan zijn om de eerste renteverlaging langer in de tijd vooruit\nte schuiven. In Nederland kwam de inflatie in december lager uit dan in\nnovember. Nederland was daarmee een uitzondering in Europa. De inflatie in de\neurozone kwam in december uit op 2,9%, iets hoger dan de 2,4% van november. De\nwaarden op de rechter-as geven de rente aan van de kapitaalmarktrente (oranje\nlijn) 10 jaar Nederland. De waarden op de linker-as geven de gemiddelde\nhypotheekrente 10 jaar vast met NHG aan (blauwe lijn). Het verschil tussen de\nwaarden op de linker-as en de rechter-as geeft het gemiddelde verschil aan dat\ner vorig jaar was tussen de kapitaalmarktrente en de gemiddelde hypotheekrente\n10 jaar vast. De hypotheekrente volgt meestal met enige vertraging de\nontwikkeling van de kapitaalmarktrente en heeft een iets minder grillig\nverloop.\n\nLees meer\n\n#### Inflatie eurozone weer iets omlaag\n\n05 december 2023\n\nNieuws\n\nDe inflatie in Nederland in november kwam volgens een snelle berekening van\nhet Centraal Bureau voor de Statistiek (CBS) uit op 1,6%. Dat is de inflatie\nop jaarbasis. Daarmee komt de inflatie op jaarbasis hoger uit dan in oktober,\ntoen het verschil op jaarbasis nog -0,4% was. Dat betekent overigens niet dat\nde prijzen op maandbasis zijn gestegen. Integendeel, de prijzen lagen in\nnovember ongeveer 1,1% lager dan in oktober. Voor de ontwikkeling van de\nrentes is niet zozeer de ontwikkeling van de inflatie in Nederland van belang,\nmaar die in Europa. Van de 20 eurozone-landen ging alleen de inflatie in\nNederland omhoog. De jaarlijkse inflatie in de hele eurozone kwam in november\nuit op 2,4%. Dat is lager dan de 2,9% in oktober. Christine Lagarde, president\nvan de Europese Centrale Bank (ECB), waarschuwt wel voor te veel optimisme. De\nprijzen stijgen nog altijd harder dan gewenst. Bovendien bestaat de kans dat\nde inflatie hierna toch een korte opleving krijgt. Bijvoorbeeld als de lonen\nper 1 januari stijgen en er automatische prijscorrecties aan het begin van het\nnieuwe jaar komen. Over twee weken is de volgende bestuursvergadering van de\nECB. De verwachting is dat de ECB haar rente ongewijzigd zal laten. Er is op\ndit moment geen reden om de rente te verhogen, omdat de inflatie behoorlijk\nhard naar beneden gaat. Maar voor een renteverlaging lijkt het nog veel te\nvroeg. Beleggers kijken op dit moment over het algemeen positief tegen de\ninflatieontwikkelingen aan. We zien dat de marktrentes toch iets verder naar\nbeneden gaan. Daardoor ontstaat er ook ruimte om de licht daling bij de\nhypotheekrentes voort te zetten.\n\nLees meer\n\n#### Hypotheekrente-verwachting 2024\n\n28 november 2023\n\nNieuws\n\nVan Bruggen Adviesgroep acht de kans het grootst dat de hypotheekrentes in\n2024 licht dalen. Maar het voorspellen van de hypotheekrente-ontwikkeling is\ngeen exacte wetenschap, meer een beredeneerde gok. Wij geven daarom liever een\naantal scenario’s, waarvan het ene waarschijnlijker is dan het andere. Daarbij\nmoet je wel in het achterhoofd houden dat onverwachte gebeurtenissen niet in\ndeze scenario’s verwerkt zijn. Zo werden wij en alle economen in 2022 verrast\ndoor de oorlog in Oekraïne. Die oorlog leidde tot een energiecrisis, hoge\ninflatie en enorm snel stijgende hypotheekrentes (van ongeveer 1% naar ruim\n4%). De ontwikkelingen in 2023 kwamen wat dat betreft meer overeen met ons\nmeest realistische scenario, namelijk een hypotheekrente (10 jaar vast) rond\nde 4% met een min of plus van een paar tienden. Uiteindelijk schommelde de 10\njaar vaste hypotheekrente met NHG in 2023 tussen de 3,99% en de 4,53%. Drie\nscenario’s We geven hierna drie scenario’s: 1) het scenario dat ons het meest\nreëel lijkt, 2) een positiever scenario, en 3) een negatiever scenario.\nDaarbij geven we aan waar deze scenario’s van afhankelijk zijn. Het blijft\ngelden dat alle scenario’s ingehaald kunnen worden door de werkelijkheid.\nScenario 1: de gemiddelde hypotheekrente 10 jaar vast met NHG daalt in de loop\nvan 2024 naar een niveau van tussen de 3,5% en 4% (meest realistische\nscenario, met 55% waarschijnlijkheid) In 2023 werden we een groot deel van de\ntijd heen en weer geslingerd bij de vraag of de inflatie voldoende naar\nbeneden te krijgen was. Er waren regelmatig twijfels of de forse\nrenteverhogingen van de centrale banken snel genoeg effect zouden hebben op de\ninflatie. Maar de laatste maand is dat beeld aan het draaien. De centrale\nbanken in Europa en de Verenigde Staten hebben dan ook op de pauzeknop\ngedrukt. De hoop wordt steeds groter dat we de renteverhogingen van de\ncentrale banken achter de rug hebben. Beleggers vragen zich nu eerder af\nwanneer de centrale banken de rente in 2024 gaan verlagen. Een renteverlaging\nvan de centrale banken betekent niet automatisch een renteverlaging van de\nlange rentes, zoals de hypotheekrentes. In 2023 heeft de Europese Centrale\nBank (ECB) haar rente verhoogd met 2% (van 2% naar 4%), maar de 10 jaar vaste\nhypotheekrente is nog geen half procent gestegen in 2023. De hypotheekrentes\nveranderen dus niet automatisch met renteverlagingen van de centrale banken\nmee. Maar onze verwachting is wel dat beleggers een renteverlaging door de\ncentrale banken positief ontvangen en dat een renteverlaging ook tot lagere\nhypotheekrentes zal leiden. Wel zullen centrale banken voorzichtig zijn met\nhet verlagen van hun rente. Ze zullen eerst willen zien dat de inflatie onder\ncontrole is. Daarvoor moet de inflatie nog verder naar beneden gaan. Toch\nhebben we goede hoop dat de dalende trend bij de inflatiecijfers in de loop\nvan 2024 aanleiding is voor renteverlaging, die gevolgd wordt door\nhypotheekrenteverlagingen. Wij schatten dat de 10 jaar vaste hypotheekrente\nmet NHG in de loop van 2024 daalt naar een niveau tussen de 4% en 3,5%.\nScenario 2: de gemiddelde hypotheekrentes dalen in 2024 richting de 3% (het\noptimistische scenario, 30% kans) In ons optimistische scenario daalt de\ngemiddelde hypotheekrente voor 10 jaar vast harder dan in het meest\nrealistische scenario, namelijk naar een niveau rond de 3%. Dat kan\nbijvoorbeeld gebeuren als de inflatie harder daalt dan verwacht. De centrale\nbanken hebben met hun renteverhogingen in 2022 en 2023 steeds meer impact op\nde vertraging van de economie. In sommige Europese landen zien we nu al een\nlichte recessie. Vaak zien we dat centrale banken het restrictieve beleid te\nlang doorzetten en dat een economie in een zwaardere recessie terechtkomt dan\nde centrale banken voor ogen hadden. Dat kan ertoe leiden dat centrale banken\nde teugels meer willen laten vieren en de rente eerder en meer gaan verlagen.\nMaar ook een einde aan de oorlog in Oekraïne of een zachte winter kan\nbijdragen aan een snel lagere inflatie als gevolg van lagere energieprijzen en\ndaardoor snellere renteverlaging door de centrale banken. Daarnaast kan de\nsituatie op de Nederlandse hypotheekmarkt een rol spelen bij een snellere\nverlaging van de hypotheekrentes. We hebben een behoorlijk concurrerende\nhypotheekmarkt, maar menig geldverstrekker zal graag meer aanvragen krijgen nu\ner veel minder hypotheken afgesloten worden dan twee jaar geleden. Het\nmakkelijkste middel daarvoor is de rente verlagen. We zien dat deze\nconcurrentie al een effect van een paar tienden (ongeveer 0,2%) heeft gehad in\n2023. Wellicht zet dit nog iets verder door in 2024. Scenario 3: de gemiddelde\nhypotheekrentes komen in 2024 uit tussen de 4% en 5% (pessimistische scenario,\n15% kans) In ons pessimistische scenario komen we uit op een gemiddelde 10\njaar vaste hypotheekrente met NHG van ongeveer het huidige niveau of een paar\ntienden lager of hoger: ergens tussen de 4% en 5%. Dit scenario zou\nwerkelijkheid kunnen worden als de positieve signalen van de laatste weken te\nvoorbarig blijken te zijn en de inflatie op het huidige niveau stabiliseert of\nslechts heel langzaam daalt. Door het positieve nieuws van de afgelopen maand\nzouden we haast vergeten dat de meeste beleggers dit in 2023 een behoorlijk\nrealistisch scenario vonden voor 2024. Ook kan de inflatie opnieuw toenemen\ndoor een nieuwe energiecrisis. Dat scenario is niet geheel ondenkbaar. Dit zou\nbijvoorbeeld kunnen gebeuren bij een verdere escalatie van de oorlog tussen\nIsraël en Hamas. Als daar ook andere Arabische landen en de Verenigde Staten\nbij betrokken raken, kan dit tot een groot conflict uitgroeien, waarbij de\nolieprijzen stijgen. Langere-termijnverwachting (2025-2028) Onze lange-\ntermijnverwachting voor de hypotheekrentes voor 2025 tot en met 2028 is\nongewijzigd ten opzichte van vorig jaar. Op de langere termijn (2025-2028)\nverwachten wij dat we naar meer neutrale rentes van de ECB gaan, dat de\ninflatie weer rond de 2% uitkomt en dat er voldoende geld voor hypotheken\nbeschikbaar is. Een terugkeer naar hypotheekrentes tussen de 1 en 2% lijkt ons\nniet waarschijnlijk, maar hypotheekrentes tussen de 3 en 3,5% lijken mogelijk.\nMaar ook voor de lange- termijnvoorspelling geldt dat we verrast kunnen worden\ndoor onverwachte economische of politieke ontwikkelingen.\n\n**Blijf op de hoogte**\n\nSchrijf je nu in voor de nieuwsbrief en blijf op de hoogte van het laatste\n(rente)nieuws.\n\nAanmelden\n\nBedankt voor uw aanmelding.\n\nLees meer\n\n#### Kleine verlagingen hypotheekrentes\n\n21 november 2023\n\nNieuws\n\nVoor de tweede week op rij verlaagden geldverstrekkers hun hypotheekrentes. De\ntrend is nu duidelijk dalend. Alle rentewijzigingen van vorige week waren\nverlagingen. Ongeveer 3 op de 5 geldverstrekkers verlaagden hun rentes. De\ngemiddelde vaste hypotheekrentes zijn de afgelopen twee weken met ongeveer\n0,1% gedaald. De hypotheekrentes konden licht naar beneden worden bijgesteld,\nomdat de marktrentes dalen. Dat komt dan weer doordat beleggers hoop hebben\ndat de centrale banken klaar zijn met de renteverhogingen. Daarvoor is het van\nbelang dat de inflatie hard genoeg blijft dalen. Vanuit de Verenigde Staten\n(VS) kwam het goede nieuws dat de consumentenprijzen daar in oktober stegen\nmet 3,2%. Dat was iets lager dan de verwachte 3,3% en ook een stuk lager dan\nde 3,7% van september. Beleggers verwachten dat de centrale bank van de VS de\nrente nu niet meer gaat verhogen. Het bijzondere is dat de Amerikaanse\neconomie ondanks een groot aantal renteverhogingen een hoge economische groei\ndoormaakt. In het derde kwartaal groeide de Amerikaanse economie op jaarbasis\nmet 4,9%. In Europa gaat het moeizamer. De economische groei in de eurozone\nkwam in het derde kwartaal uit op een schamele 0,1%. Overigens hanteren we\nhier wel andere cijfers dan in de VS. In Europa kijken we naar de groei van\nkwartaal op kwartaal. In de eurozone zien we wel dat de inflatie daalt, maar\ndat gaat dus – in tegenstelling tot de VS – niet gepaard met een substantiële\neconomische groei. Ook voor de Europese Centrale Bank (ECB) zullen de huidige\ncijfers aanleiding zijn om haar rentes de komende tijd niet te verhogen.\nBovenstaand nieuws zorgt voor licht dalende marktrentes. De hypotheekrentes\nvolgen in iets mindere mate het patroon van de marktrentes. Het blijft alleen\nlastig om de renteontwikkeling op de middellange termijn te voorspellen.\n\nLees meer\n\n#### Lichte hoop dat we het hoogste rentepunt hebben gehad\n\n14 november 2023\n\nNieuws\n\nEr is bij beleggers lichte hoop ontstaan dat de centrale banken wel eens klaar\nkunnen zijn met hun renteverhogingen. Bovendien lijkt het rentebeleid haar\nwerk te doen en lijkt de inflatie ook richting het niveau te gaan dat centrale\nbanken wensen. De marktrentes gingen de afgelopen weken dan ook naar beneden.\nNiet iedereen was daar even blij mee. Powell, de voorzitter van de Amerikaanse\ncentrale bank (Fed), gaf aan dat de Fed voorzichtig moet blijven handelen en\ndat we moeten uitkijken dat we niet misleid worden door een paar maanden aan\ngunstige data. Powell wilde waarschijnlijk met deze uitspraak de euforie op de\nbeurzen een beetje drukken en voorkomen dat de marktrentes te veel naar\nbeneden gaan, omdat dan de goede trend van de laatste maanden weer doorbroken\nkan worden. Als het signaal van de Fed wordt opgepikt, dan verwachten wij dat\nwe zeker de komende maanden een rente houden die ongeveer op het huidige\nniveau of net iets lager ligt. Maar spectaculaire verlagingen verwachten wij\nniet. Maar zolang er geen slecht nieuws komt van een stagnerende\ninflatiedaling verwachten wij wel dat de markt- en hypotheekrentes hun hoogste\npunt gehad hebben. Kleine hypotheekrente verlagingen Bijna alle hypotheekrente\nwijzigingen die afgelopen week werden doorgevoerd waren verlagingen. Het ging\nover het algemeen om kleine verlagingen; de meest voorkomende verlaging was\n0,05%-punt. De meeste verlagingen waren er voor de populairste renteperiode\nvan 10 jaar vast. Maar liefst 4 op de 5 geldverstrekkers verlaagden de 10 jaar\nvaste hypotheekrente met NHG. Voor hypotheken 10 jaar vast zonder NHG zagen we\nminder verlagingen en ook bij andere rentevaste periodes waren er ook minder\nverlagingen. Het lijkt erop dat dankzij de concurrentie geldverstrekkers met\nname een zo scherp mogelijke rente willen bieden voor de meest populaire\nrentevaste periode van 10 jaar.\n\nLees meer\n\n#### Alleenstaande leraar en verpleegkundige zien kans op koopwoning groeien\nin 2024\n\n11 januari 2024\n\nNieuws\n\nDe mogelijkheden voor eenverdieners op de woningmarkt zijn toegenomen. Dat\nblijkt uit een analyse van Van Bruggen Adviesgroep en Independer. Door de\ngroei van het gemiddeld inkomen valt het maximale hypotheekbedrag hoger uit in\n2024. Ook alleenstaande starters met een vitaal beroep hebben meer kansen,\ndoor verbeterde cao’s in bijvoorbeeld de zorg en het onderwijs. Het inkomen\nvan een alleenstaande woningzoeker lag in 2023 gemiddeld 7,6 procent hoger dan\nin 2022, zo blijkt uit cijfers van Independer. “Het verschil tussen het\ninkomen wat woningzoekers in de maximale hypotheekberekening invullen en de\neenverdieners die er daadwerkelijk in slagen om een woning te kopen, wordt\nsteeds kleiner”, aldus Marga Lankreijer, hypotheekexpert van Independer. Van\nBruggen Adviesgroep ziet relatief steeds meer alleenstaanden een huis kopen.\n“In 2024 verwachten wij dat deze groep groter wordt. Naast de stijging van het\ninkomen neemt de betaalbaarheid toe door de dalende hypotheekrente en\ngunstigere hypotheeknormen”, stelt Oscar Noorlag, hypotheekexpert van Van\nBruggen Adviesgroep. Leraren en verpleegkundigen ineens kansrijk Ook\nalleenstaande leraren in het lager- en voortgezet onderwijs hebben in 2024\nmeer kans op het bemachtigen van een koopwoning, mede door het verbeterde cao-\nakkoord. Waar een startende docent begin 2023 zelf gemiddeld maximaal een\nhypotheek kon krijgen van 175.000 euro, kan die begin 2024 liefst 204.000 euro\nlenen. Koopt hij of zij een woning met een A of B-energielabel dan is dit\nzelfs 214.000 euro. Volgens cijfers van HDN over 2023 hebben de meeste\nNederlanders ongeveer 42.000 euro aan eigen vermogen, uit spaargeld of middels\neen schenking, wat gebruikt wordt voor de aanschaf van een woning. “Dat zou\nbetekenen dat een alleenstaande, beginnende leraar ongeveer 256.000 euro te\nbesteden heeft als hij een woning met een energielabel A of B koopt”, aldus\nLankreijer, die een vergelijkbare situatie ziet bij (startende)\nverpleegkundigen. “Door de verbeterde cao en nieuwe hypotheeknormen kunnen\nverpleegkundigen in 2024 liefst vijftien tot twintig procent meer lenen dan\nbegin vorig jaar.” Meer hypotheek, maar duurdere woningen Hoewel de\nleencapaciteit van veel Nederlanders groeit, stijgen ook de huizenprijzen\nsinds de tweede helft van 2023. “De prijzen zullen naar verwachting\ndoorstijgen, mogelijk met meer dan vijf procent. Desondanks loont het om\nopnieuw te inventariseren hoeveel hypotheek je kan krijgen. Voor meer\neenverdieners komt het kopen van een woning in 2024 binnen bereik”, aldus\nNoorlag. Maximale hypotheek stellen kan lager uitvallen Ook voor stellen\nverandert de maximale hypotheek in 2024. Het gezamenlijk inkomen van een\nwoningzoekend stel is gemiddeld minder hard gestegen dan onder eenverdieners.\nVoor sommige stellen pakken de nieuwe hypotheeknormen bovendien minder gunstig\nuit dan voor alleenstaanden, waarschuwt Noorlag. Ook het verschil tussen\nzoekers en hypotheeksluiters werd groter in 2023 onder stellen, ten opzichte\nvan 2022.\n\nLees meer\n\n#### Populaire 10 jaar vaste hypotheekrente onder 4%\n\n19 december 2023\n\nNieuws\n\nDe eerste geldverstrekkers hanteren voor de populairste rentevaste periode van\n10 jaar vast met NHG weer een hypotheekrente van onder de 4%. De gemiddelde\nhypotheekrente ligt met 4,14% nog wel iets boven de 4%. De gemiddelde vaste\nhypotheekrentes dalen nu al voor de zevende week op rij. In die periode zijn\nde gemiddelde 5 en 10 jaar vaste hypotheekrente met ongeveer 0,4% gedaald. De\nrentes voor 20 jaar vast daalden met bijna 0,3% en die voor 30 jaar vast met\n0,25%. De daling van de hypotheekrentes volgt op een nog snellere daling van\nde lange rentes op de financiële markten. Het wordt interessant hoe beleggers\nkijken naar de toelichting van de Europese Centrale Bank (ECB) op het\nrentebesluit om de rente ongewijzigd te laten. Die beslissing kwam voor\nniemand als een verrassing, omdat de inflatie de afgelopen maanden is gedaald.\nDe ECB kwam wel met een waarschuwing: op korte termijn zal de inflatie\nwaarschijnlijk tijdelijk weer stijgen, vooral door hogere loonkosten. De ECB\nverwacht dat de inflatie (exclusief de kosten voor energie en\nvoedingsmiddelen) in 2024 uitkomt op 2,7%, in 2025 op 2,1% en in 2026 op 1,9%.\nDe ECB maakte duidelijk dat er voorlopig nog geen zicht is op een rentedaling:\n“Op basis van onze huidige beoordeling zijn we van mening dat de\nbasisrentetarieven van de ECB op een niveau staan dat, indien aangehouden voor\neen voldoende lange periode, een substantiële bijdrage gaat leveren aan dit\ndoel. Met onze toekomstige besluiten zullen we ervoor zorgen dat onze\nbasisrentetarieven zo lang als nodig worden vastgesteld op een niveau dat\nrestrictief genoeg is.” Deze week gaan we zien welke uitwerking de\nrentebesluiten van de ECB en de Fed (de Amerikaanse centrale bank) hebben op\nde ontwikkeling van de rentes op de financiële markten. De eerste reactie van\nbeleggers was positief, de rentes op de financiële markten nog iets verder\nomlaag.Het zou ons niet verbazen als de rentes op de financiële markten straks\nmet een lager tempo dalen, of als de trend zelfs tijdelijk licht stijgend\nwordt doordat de daling de afgelopen weken wel heel hard is gegaan. Wel\nblijven wij optimistisch dat de kans groot is dat we gedurende een groot deel\nvan 2024 een licht dalende trend van de rentes gaan zien. Dat geldt zeker als\nde verwachtingen van de ECB over de inflatieontwikkeling uitkomen.\nVerduurzamen loont Onderstaande grafiek toont de ontwikkeling van de\ngemiddelde hypotheekrentes voor variabel, 5, 10, 20 en 30 jaar vast in het\nafgelopen jaar. Met in de linker grafiek de tarieven met NHG en in de rechter\ngrafiek de tarieven zonder NHG, waarbij we uitgaan van de tarieven tot en met\n100% marktwaarde. Wat doet de ECB depositorente met de verschillende rentes In\nonderstaande grafiek tonen we de rente ontwikkeling van verschillende rentes\nin het jaar 2022 en 2023. Legenda: De groene lijn geeft de ECB-depositorente\nweer. In juli 2022 is die rente verhoogd van -0,5% naar 0%. Daarna volgden in\ntotaal nog negen verhogingen, waardoor de ECB-depositorente op dit moment op\n4% staat. De grootste rentestappen waren in 2022. In 2023 kwamen daar nog\nstapjes van eerst 0,5% en later 0,25% bij. In totaal bedroeg de stijging in\n2023 2,5%. De laatste verhoging was in september en, zoals het er nu naar\nuitziet, blijft het bij die laatste verhoging. In de lichtblauwe lijn zie je\nde ontwikkeling van de 3 maands-geldmarktrente. Eigenlijk loopt die lijn de\nhele tijd vooruit op de verwachte renteverhoging van de ECB. Omdat beleggers\ngeen renteverhoging van de ECB meer verwachten, is de geldmarktrente nagenoeg\ngelijk aan de ECB-depositorente.De donkerblauwe lijn geeft de gemiddelde\nvariabele hypotheekrente met NHG weer. Vanaf ongeveer juli vorig jaar stijgt\ndeze variabele rente in hetzelfde tempo als de geldmarktrente, behalve in de\nperiode vanaf de laatste rentewijziging van de ECB. Toen stopte de stijging\nvan de geldmarktrente, terwijl de gemiddelde variabele hypotheekrente nog heel\nlicht een aantal weken door steeg, om pas iets later te stabiliseren. De\ndonkergele lijn geeft de ontwikkeling van de kapitaalmarktrente weer, dus de\nrente voor Nederlandse staatsleningen van 10 jaar. We zien dat die\nkapitaalmarktrente al vóór de renteverhogingen van de ECB in 2022 aan het\noplopen is. Dat is niet zo raar, omdat beleggers bij de hoogte van de rente\nkijken naar de inflatieontwikkeling en de verwachting over de toekomstige\ninflatieontwikkeling. Gedurende 2022 loopt de kapitaalmarktrente op van rond\nde 0% naar boven de 2,5%. Gedurende 2023 beweegt de kapitaalmarktrente meer\nzijwaarts, met een licht stijgend patroon, tot iets boven de 3% eind oktober.\nDaarna zet weer een daling in richting 2,5%. De oranje lijn geeft de\ngemiddelde 10 jaar vaste hypotheekrente met Nationale Hypotheek Garantie weer.\nIn feite volgt die rente de kapitaalmarktrente voor een groot deel, alleen is\nde ontwikkeling van de 10 jaar vaste rente minder grillig. In 2022 stijgt de\n10 jaar vaste hypotheekrente van rond de 1% naar 4,5%. In 2023 beweegt de 10\njaar vaste hypotheekrente eigenlijk het hele jaar tussen de 4% en 4,5%. Dus\nondanks een stijging van 2,5% van de ECB-depositorente bleef de gemiddelde\nhypotheekrente binnen die smalle bandbreedte van 4% en 4,5% bewegen. Dat komt\ndoordat beleggers er vertrouwen in hebben dat de inflatie door het ECB-\nrentebeleid voldoende naar beneden zal gaan.We zien nu dat beleggers\nvooruitlopen op renteverlagingen van de ECB, die hopelijk ergens in de loop\nvan het tweede deel van 2024 plaatsvinden. Zij denken dat de inflatie op de\ngoede weg is. Daardoor zien we ook de gemiddelde 10 jaar vaste hypotheekrente\ndalen. Maar waar de gemiddelde 10 jaar vaste hypotheekrente iets minder steeg\ntot en met oktober van dit jaar, gaat de daling nu ook even iets minder hard.\nVoor een verdere daling van de rentes is het belangrijk dat het optimisme van\nde beleggers over de inflatieontwikkeling wel uitkomt. De ECB gaf afgelopen\nweek wel een waarschuwing af: zij verwacht dat de inflatie in ieder geval\ntijdelijk weer even gaat stijgen.\n\nLees meer\n\n#### Hypotheekrente beweegt tegen de stroom in verder omlaag\n\n15 januari 2024\n\nBlogs\n\nGeldverstrekkers hebben er zin in. Een nieuw jaar betekent voor veel\ngeldverstrekkers een nieuwe doelstelling over hoeveel hypotheken of, beter\nnog, hoeveel hypotheekomzet zij dit jaar willen behalen. Een extra uitdaging\ndaarbij is de krimpende hypotheekmarkt. In 2023 werden veel minder hypotheken\nafgesloten dan in 2022. In 2024 zal het aantal afgesloten hypotheken op\nongeveer hetzelfde aantal uitkomen als in 2023, of misschien nog wel lager.\nGeldverstrekkers moeten dus veel uit de kast trekken om hun eigen aantal\nafgesloten hypotheken op peil te houden. Daarom zien we nu dalende\nhypotheekrentes. Dat gaat tegen de trend in, want de rentes op de financiële\nmarkten stijgen juist licht. Onderstaande grafiek laat goed de dalende\nhypotheekrentes zien. Het goede nieuws is dat de vaste hypotheekrentes al elf\nweken op rij dalen. De grootste daling zien we bij de rentevaste periodes van\n5 en 10 jaar. De daling van de gemiddelde hypotheekrentes met NHG is sinds\neind oktober meer dan 0,7%-punt. Dat komt voor de 10 jaar vaste hypotheekrente\nmet NHG neer op een daling van 15% ten opzichte van de rente eind oktober. De\nrentedaling voor 20 en 30 jaar vast is iets minder hard, met respectievelijk\n0,6% en 0,55%. Ook zien we dat de hypotheekrentes zonder NHG iets minder hard\ndalen dan de rentetarieven voor hypotheken met NHG. Blijven de hypotheekrentes\ndalen? Of de hypotheekrentes blijven dalen, is op voorhand niet met zekerheid\nte zeggen. Dat is afhankelijk van een groot aantal factoren. Wij verwachten\ndat de daling hierna trager zal gaan. Afgelopen week zagen we al dat niet alle\ngeldverstrekkers meedoen met de renteverlagingen. Ongeveer 3 op de 5\ngeldverstrekkers verlaagde afgelopen week de hypotheekrentes. De kans is groot\ndat geldverstrekkers voorzichtig aan gaan doen met rentverlagingen. De\nbelangrijkste reden? De rentes op de financiële markten zijn de laatste drie\nweken licht aan het stijgen. Al zagen we de laatste 2 dagen van vorige week\neen lichte daling. Je ziet duidelijk de tegendraadse beweging als je de\nontwikkeling van de 10 jaar vaste hypotheekrente (de blauwe lijn) afzet tegen\nde ontwikkeling van de rente voor Nederlandse staats-leningen van 10 jaar (de\noranje lijn). Het is niet raar dat de rentes op de financiële markten overall\nlicht stijgen. De afgelopen maanden was het positieve nieuws over de\ninflatieontwikkeling al verwerkt in de rentetarieven. Beleggers werden weer\nmet beide benen op de grond gezet door een hogere inflatie van 2,9% in de\neurozone over de maand december, tegenover 2,4% in november. In de Verenigde\nStaten vielen de banencijfers hoger uit, waardoor de Fed (de centrale bank van\nde VS) de eerste renteverlaging voor 2024 waarschijnlijk verder voor zich\nuitschuift. Het wordt interessant hoe de rentes op de financiële markten zich\ngaan ontwikkelen. Toch zijn de vooruitzichten voor geheel 2024 positief. De\nhypotheekrentes zullen naar onze verwachting binnenkort ook pas op de plaats\nmaken. Het snelle tempo van verlagingen van de afgelopen twee maanden zal niet\ndoorzetten. Zo nu en dan kan er best een renteverhoging komen. Maar wij achten\nde kans groot dat de trend in 2024 vooral dalend zal zijn. Daarbij is de\nvoornaamste vraag met welk percentage de hypotheekrente zal dalen. Overigens\nkunnen onverwachtse gebeurtenissen altijd roet in het eten gooien bij dit\nzonnige plaatje. Denk aan internationale conflicten die verder escaleren of\nontwikkelingen die we nu nog niet kunnen voorzien. Nieuwbouw cruciaal voor\n“treintjes” verkoop bestaande woningen De NVM maakte bekend dat het\nwoningaanbod in het vierde kwartaal van 2023 verder gedaald is. Dat is een\nzorgwekkende ontwikkeling, waarbij de achterblijvende bouw en oplevering van\nnieuwbouwwoningen een belangrijke rol speelt. Voor de doorstroming op de\nwoningmarkt zijn namelijk “treintjes” van woningverkopen heel belangrijk. Aan\nhet begin van een treintje heb je vaak een starter die een woning wil kopen.\nAls een starter een nieuwbouwwoning koopt, heeft dat geen verder effect op de\nkoopwoningmarkt. Koopt een starter een bestaande koopwoning? Dan heeft dit tot\ngevolg dat de verkoper zijn woning wil verkopen. Er ontstaat een treintje als\ndeze woningverkoper op zijn beurt een andere, veelal duurdere, koopwoning\nkoopt. Die woning heeft ook weer een verkoper. Het treintje wordt steeds\nlanger, totdat er een verkoper is die geen bestaande koopwoning koopt. Dat kan\nbijvoorbeeld zijn omdat de verkoper is overleden en de nabestaanden de woning\nverkopen, of omdat de verkoper naar een huurwoning, verzorgingstehuis of het\nbuitenland gaat. Maar de belangrijkste reden is als een verkoper een\nnieuwbouwwoning koopt. Nieuwbouw dalende lijn Nu de oplevering van én de\nbouwplannen voor nieuwbouw een dalende lijn vertonen, gaat dit steeds meer\ninvloed hebben op de bestaande koopwoningmarkt. Potentiële starters zijn er\ngenoeg. Ook zijn er genoeg huizenbezitters die naar een andere koopwoning\nwillen verhuizen, maar dan moeten zij wel een andere woning kunnen vinden. Als\nde laatste wagon van het “treintje” (namelijk een nieuwbouwwoning kopen en de\nhuidige woning verkopen) stokt, zal het aanbod op de bestaande woningmarkt\nverder krimpen. Niet blind staren op starters Het is dan ook te hopen dat een\nnieuw kabinet de nieuwbouw een extra impuls kan geven. Daarbij moeten we er\nrekening mee houden dat het plannen en bouwen van nieuwbouw een behoorlijke\ndoorlooptijd kent. Een gunstige ontwikkeling is in ieder geval dat de rente\naan het dalen is. Dat is gunstig voor aannemers, maar ook voor\nnieuwbouwkopers. Daarnaast lijken de prijzen voor veel bouwmaterialen\ngunstiger te zijn dan de afgelopen jaren. Chris van Zantwijk van de NVM maakte\nin het NVM-persbericht nog een belangrijke opmerking: “Laten we ons bij\nnieuwbouw niet blind staren op alleen starterswoningen, maar juist ook\nwoningen voor doorstromers en senioren realiseren.” Als de focus alleen ligt\nop starters, dan is dat niet goed voor de doorstroming op de bestaande\nkoopwoningmarkt. Bovendien zijn er minder beleggers te vinden die willen\ninvesteren in alleen het goedkope segment. Als er voldoende gebouwd wordt,\nontstaat er vanzelf doorstroming, waardoor starters ook op de bestaande\nwoningmarkt betaalbare woningen kunnen kopen. Stijging woningprijzen zet door\nBij een grote vraag naar koopwoningen en een beperkt aanbod is het heel\nlogisch dat de huizenprijzen stijgen. Dat zal versterkt worden door de dalende\nhypotheekrente, stijgende inkomens en de nieuwe hypotheeknormen. Die factoren\nzorgen voor een hogere leencapaciteit en leiden in een markt met weinig aanbod\ntot hogere prijzen. De transactieprijs van de NVM stijgt al drie kwartalen op\nrij en de kans is groot dat die stijging doorzet en we in 2024 over het\nhoogtepunt van 2022 heen gaan. Gaan we in 2024 meer doorstromers zien?\nAfgelopen jaar zagen we dat het aantal hypotheekaanvragen voor woningaankopen\nbij starters nagenoeg gelijk was aan het aantal in 2022. Maar het aantal\nhypotheekaanvragen van doorstromers (koopwoningeigenaren die een volgende\nwoning kopen) daalde in 2023 met 14%. Ten opzichte van 2020 zagen we zelfs een\nafname van meer dan 32%. We zien dat starters ondanks de fors gestegen\nhypotheekrente nog steeds heel graag de woningmarkt willen betreden. Dat is\nook niet zo raar. Voor veel starters is de urgentie heel hoog. Dat is bij\ndoorstromers anders: zij hebben al een dak boven hun hoofd. Sommige\ndoorstromers willen wel graag naar een andere koopwoning, maar alleen onder\nbepaalde omstandigheden. Hoge hypotheekrente Een belangrijke bottleneck voor\nveel doorstromers is de hogere hypotheekrente. De afgelopen jaren hebben veel\nhuizenkopers en huizenbezitters net tegen een heel lage hypotheekrente hun\nhypotheek afgesloten of overgesloten. Dat betekent dat ze relatief lage\nhypotheeklasten hebben. Als zij een andere, duurdere woning kopen, dan kunnen\nze hun bestaande hypotheek (inclusief lage hypotheekrente) vaak meenemen. Maar\nvoor het deel dat ze extra nodig hebben, moeten ze wel de huidige, hogere\nhypotheekrente betalen. Psychologisch doet dat wat met doorstromers, omdat ze\nde hypotheeklasten fors zien toenemen als gevolg van het extra hypotheekdeel\ndat ze tegen de hoge rente moeten lenen. In feite zijn starters veel slechter\nuit. Zij moeten tenslotte over het gehele hypotheekbedrag de huidige hoge\nrente betalen. Maar starters hebben de nieuwe werkelijkheid van de hogere\nrente meer geaccepteerd dan doorstromers. Ze kunnen niet anders als ze een\nkoopwoning willen bemachtigen. Het goede nieuws is dat de hypotheekrente aan\nhet dalen is. We verwachten dan ook dat meer doorstromers de stap willen\nzetten naar een volgende woning. Trend van huizenprijzen weer gedraaid\nAchteraf gezien kunnen we zeggen dat het begin van het tweede kwartaal in 2023\neen prima moment was om een huis te kopen, als we kijken naar de\nwaardeontwikkeling. Maar psychologisch gezien hadden veel doorstromers sinds\nde zomer van 2022 minder zin om hun woning te verkopen. De prijzen daalden.\nDan is het lastig om te accepteren dat je misschien een lagere waarde voor je\neigen woning moet accepteren bij verkoop. Wat mensen zich soms niet\nrealiseren, is dat verkopen in een dalende woningmarkt voor veel mensen juist\ngunstiger is. Je krijgt minder voor je eigen woning, maar je hoeft ook minder\nte betalen voor je volgende koopwoning. Omdat veel mensen er een duurdere\nwoning voor terugkopen, is het prijsvoordeel van de aan te kopen woning in een\ndalende markt vaak groter dan het nadeel van de lagere prijs voor de verkochte\nwoning. Ondanks dit gegeven verwachten wij dat de stijgende huizenprijzen meer\ndoorstromers zal stimuleren om een ander huis te kopen en hun huidige woning\nte verkopen. Willen versus kunnen Wij verwachten dat in 2024 meer doorstromers\ngeïnteresseerd zijn in de aankoop van een andere woning. De grote vraag blijft\nwel of het ook gaat lukken om een interessante nieuwe koopwoning te vinden.\nHet beperkte aanbod van woningen blijft ook voor de doorstromer een\nstruikelblok.\n\nLees meer\n\n#### Concurrentie op Nederlandse hypotheekmarkt neemt toe\n\n09 januari 2024\n\nBlogs\n\nEen goede graadmeter voor de concurrentie op de Nederlandse hypotheekmarkt is\nhet verschil tussen de gemiddelde rente voor staatsleningen voor 10 jaar en de\ngemiddelde hypotheekrente voor 10 jaar vast met NHG. Naar mate de concurrentie\ngroter is, zien we over het algemeen dat het verschil kleiner wordt. In de\ncrisisjaren 2010 tot en met 2013 zien we dat het verschil behoorlijk oploopt.\nDat kwam enerzijds doordat de concurrentie afnam, doordat enkele\ngeldverstrekkers de Nederlandse hypotheekmarkt vaarwel zegden en sommige\nandere geldverstrekkers veel minder geïnteresseerd waren om veel hypotheken\nweg te zetten, door de toegenomen risico’s op de hypotheekmarkt. Overigens\nspeelde toen ook mee dat geldverstrekkers relatief gezien een stuk duurder\nmoesten lenen dan de overheid. Als we 2023 vergelijken met 2022 dan zien we\ndat het verschil iets is afgenomen. Dat heeft er onder andere mee te maken dat\nveel geldverstrekkers op een stuk kleinere hypotheekmarkt hun hypotheekvolume\nop peil willen houden. Het makkelijkste middel om dit te realiseren is te\nconcurreren met een scherp rentetarief. Omdat de hypotheekmarkt in 2024 naar\nverwachting op een vergelijkbaar of iets lager niveau uitkomt in vergelijking\nmet vorig jaar, verwachten wij dat de concurrentie ook in 2024 fors zal zijn.\nGoede start van het jaar met veel hypotheekrenteverlagingen De forse\nconcurrentie zien we ook terug bij de hypotheekrente ontwikkeling in het\nnieuwe jaar. Terwijl de rentes op de financiële markten licht omhoog gingen,\nverlaagden veel geldverstrekkers hun vaste hypotheekrentes (zie bijlage). De\ngemiddelde vaste hypotheekrentes gingen met 0,05% tot en met 0,08% omlaag.\nBijna alle geldverstrekkers verlaagden in de eerste week van het nieuwe jaar\nhun hypotheekrentes, maar in sommige gevallen ging het alleen om een verlaging\nvan de rente voor een beperkt aantal rentevaste periodes. De belangrijkste\nuitzondering was de Rabobank die geen verlaging doorvoerde afgelopen week,\nmaar dat deze week goed maakt met extra grote verlagingen tot wel 0,15% voor\nonder andere enkele van de populairste rentevaste periodes met NHG. Dat de\nrentes op de financiële markten een pas op de plaats maken is niet heel\nverrassend. De afgelopen twee maanden waren de rentes fors gedaald door het\noptimisme onder beleggers dat de inflatie sterk op zijn retour is en ze steeds\neerder in 2024 een renteverlaging verwachten van de centrale banken. Op een\nbepaald moment zit al dat positieve nieuws verwerkt in de rentes en is het\nwachten op nieuw positief nieuws, voordat de rentes weer serieus verder omlaag\nkunnen. Of juist weer iets omhoog kunnen gaan, als er negatief nieuws komt.\nZoals bijvoorbeeld een vertraging in de daling van de inflatie of zelfs een\nkorte stijging. 10 jaar vaste hypotheekrente daalde in 2014 van 4,06% naar\n3,00% Zijn de hypotheekrentes op dit moment hoog? Ja, als je dat vergelijkt\nmet een groot deel van de afgelopen 10 jaar wel. Maar in de jaren 2010 tot en\nmet 2013 lagen de hypotheekrentes nog een stukje hoger en dat gold ook voor\nveel van de jaren voor 2010. Nog een paar opvallende zaken als we kijken naar\nbovenstaande grafiek: De gemiddelde hypotheekrentes voor de verschillende\nvaste hypotheekrentes zijn steeds dichter naar elkaar toe gekropen. Dat wil\nzeggen dat de renteverschillen tussen de verschillende rentevaste periodes\nsteeds kleiner zijn geworden. Economisch gezien is het meest logisch dat een\nkorte rentevaste periode goedkoper is dan een langere rentevaste periode. Dat\nbetekent ook dat je mag verwachten dat de variabele hypotheekrente over het\nalgemeen lager ligt dan de vaste hypotheekrentes. Het bijzondere is dat dit\nniet het geval is van 2015 tot en met 2021. In 2022 zien we dat de vaste\nhypotheekrentes eerder stijgen, dan de variabele hypotheekrentes. Maar in 2023\nhalen de variabele hypotheekrentes de vaste hypotheekrentes in. Onze\nverwachting is dat uiteindelijk de variabele hypotheekrentes aan het eind van\n2024 weer veel dichter in de buurt van de vaste hypotheekrentes zullen staan.\nTot slot willen we de hypotheekrenteontwikkeling in 2014 er nog even\nuitlichten. De gemiddelde hypotheekrente 10 jaar vast met NHG daalde in 2014\nmet bijna een heel procent van 4,06% naar 3%. Voor wie is dat met name van\nbelang? Voor degene die in 2014 de rente voor 10 vast zette en sindsdien niet\neen andere woning heeft gekocht of de hypotheek heeft overgesloten. Want voor\nhen loopt dit jaar de rentevaste periode af en krijgen ze te maken met een\nnieuwe rente. Het is nog afwachten of die hoger of lager gaat uitpakken dan de\nrente die ze op dit moment bepalen. Zeker voor mensen met een hypotheek zonder\nNHG is het goed om op het moment van het renteaanbod te kijken of de\ngeldverstrekker rekening houdt met de gestegen waarde van de woning. Bovendien\nkan het soms interessant zijn om over te stappen naar een andere\ngeldverstrekker als je bijvoorbeeld in een duur product zit. Huizenprijzen\nmoeten inflatie nog goed maken Het Centraal Bureau voor de Statistiek (CBS)\nmaakte vorige week bekend dat de inflatie over de maand december bij een\nsnelle berekening uit kwam op 1,2%. In november kwam de inflatie nog uit op\n1,6%. Over heel 2023 zijn consumentengoederen en -diensten 3,8% duurder dan in\n2022. Dat betekent dat we ook de prijsontwikkeling van huizen zouden moeten\ncorrigeren voor de inflatie. Want we kunnen met een euro nu niet alleen minder\nconsumentengoederen en -diensten kopen, maar ook minder huis. Ontwikkeling\nhypotheekrentes afgelopen 12 maanden In de grafiek op de volgende pagina laten\nwe de ontwikkeling van de prijsindex van bestaande woningen zien in de periode\n2020 tot en met november 2023. In dezelfde grafiek laten we ook de\nontwikkeling van die zelfde prijsindex zien gecorrigeerd voor inflatie. Wat je\nin de grafiek kunt zien is dat vanaf juni de prijsindex van bestaande woningen\ndraait van dalend naar stijgend. In november staat de prijsindex op 183,2 is\ndaarmee nagenoeg gelijk aan de maand januari, toen de prijsindex 183,3\nbedroeg. De prijzen zijn daarmee nog wel verwijderd van het hoogste punt dat\nbereikt werd in juli 2022, toen de prijsindex 189,2 bedroeg. Ook de reële\nprijsindex gaat rond de zomer omhoog, maar de inflatie in 2023 zorgt er wel\nvoor dat reëel gezien woningen in november met een reële prijsindex van 144,9\nnog wel een paar procent in reële waarde zijn gedaald ten opzichte van\njanuari, toen de prijsindex op 148,8 stond. Doordat de inflatie in 2022 fors\nwas, lag het hoogtepunt van de reële prijsindex niet in juli 2022, maar in\njanuari 158,2. Ontwikkeling kapitaalmarktrente en hypotheekrente Zoals we\neerder al schreven, stegen in de eerste week van het nieuwe jaar de rentes op\nde financiële markten. Dat is ook niet zo raar naar het over-optimisme van\nbeleggers in de laatste twee maanden van 2023. De banencijfers in de Verenigde\nStaten (VS) vielen hoger uit dan verwacht, wat voor de Fed, de centrale bank\nvan de VS reden kan zijn om de eerste renteverlaging langer in de tijd vooruit\nte schuiven. In Nederland kwam de inflatie in december lager uit dan in\nnovember. Nederland was daarmee een uitzondering in Europa. De inflatie in de\neurozone kwam in december uit op 2,9%, iets hoger dan de 2,4% van november. De\nwaarden op de rechter-as geven de rente aan van de kapitaalmarktrente (oranje\nlijn) 10 jaar Nederland. De waarden op de linker-as geven de gemiddelde\nhypotheekrente 10 jaar vast met NHG aan (blauwe lijn). Het verschil tussen de\nwaarden op de linker-as en de rechter-as geeft het gemiddelde verschil aan dat\ner vorig jaar was tussen de kapitaalmarktrente en de gemiddelde hypotheekrente\n10 jaar vast. De hypotheekrente volgt meestal met enige vertraging de\nontwikkeling van de kapitaalmarktrente en heeft een iets minder grillig\nverloop.\n\nLees meer\n\n‹›\n\n#### Onze klanten over ons\n\n9,0\n\n **Zeer kundig en geduldig geholpen door Desirée** Prettig geholpen bij het\nverhogen van onze hypotheek. Fijn meegedacht over de mogelijkheden en grenzen.\nEn over de beste manier van financieren voor onze situatie. Hele fijne\nsamenwerking.\n\nKlantvriendelijk _10_ Afspraak nakomen _10_ Deskundig _10_\n\nVanessa\n\n15-01-2024\n\n **prettig geholpen** We zijn goed geholpen met ons probleem. Even afwachten\nof de afhandeling ook goed verloopt maar verder prima verlopen.\n\nKlantvriendelijk _10_ Afspraak nakomen _9_ Deskundig _10_\n\nJohnny\n\n15-01-2024\n\n **Goede service en alle begrip.** Wij kwamen binnen wandelen en werden meteen\ngeholpen. Waarna een afspraak werd ingepland super.\n\nKlantvriendelijk _9_ Afspraak nakomen _7_ Deskundig _9_\n\nJoop\n\n15-01-2024\n\n **Prima kennismaking** Het kosteloze oriëntatie-/kennismakingsgesprek leverde\ndusdanig nieuwe inzichten en een advies op waardoor vervolgacties vooralsnog\nniet nodig bleken te zijn.\n\nKlantvriendelijk _10_ Afspraak nakomen _10_ Deskundig _10_\n\nWim\n\n14-01-2024\n\n **Heldere uitleg en goede adviezen. Vriendelijk en deskundig te woord\ngestaan.** Door mijn gesprek kreeg ik een duidelijke kijk op de financiële\nsituatie en ben ik beter in staat om vervolgstappen te nemen. Van bruggen\nadviesgroep is in staat om een duidelijk beeld te schetsen van de financiële\nsituatie, nu en zeker ook in de toekomst bij mijn pensioen\n\nKlantvriendelijk _10_ Afspraak nakomen _10_ Deskundig _10_\n\nFrank\n\n14-01-2024\n\n **Beter dan ik had verwacht** Heel veel kennis, super klant vriendelijk en\naandachtig\n\nKlantvriendelijk _10_ Afspraak nakomen _10_ Deskundig _10_\n\nJose Madueno\n\n17-01-2024\n\n **Fijn en prettig gesprek.** Het gesprek met Tom heb ik als erg fujn en\nprettig ervaren. Alle vragen zijn op een duidelijke manier beantwoord.\n\nKlantvriendelijk _10_ Afspraak nakomen _10_ Deskundig _10_\n\nDanny\n\n16-01-2024\n\n **.** .\n\nKlantvriendelijk _10_ Afspraak nakomen _10_ Deskundig _10_\n\nMarlies\n\n16-01-2024\n\n **Behulpzaam en meedenkend.** \\-\n\nKlantvriendelijk _10_ Afspraak nakomen _10_ Deskundig _6_\n\nMark\n\n16-01-2024\n\n **Goed en deskundig** Snel en goed contact met de medewerkers. Deskundig en\nduidelijk wat er nodig was voor een nieuwe hypotheek.\n\nKlantvriendelijk _8_ Afspraak nakomen _8_ Deskundig _8_\n\nmeneer\n\n15-01-2024\n\n **Zeer kundig en geduldig geholpen door Desirée** Prettig geholpen bij het\nverhogen van onze hypotheek. Fijn meegedacht over de mogelijkheden en grenzen.\nEn over de beste manier van financieren voor onze situatie. Hele fijne\nsamenwerking.\n\nKlantvriendelijk _10_ Afspraak nakomen _10_ Deskundig _10_\n\nVanessa\n\n15-01-2024\n\n **prettig geholpen** We zijn goed geholpen met ons probleem. Even afwachten\nof de afhandeling ook goed verloopt maar verder prima verlopen.\n\nKlantvriendelijk _10_ Afspraak nakomen _9_ Deskundig _10_\n\nJohnny\n\n15-01-2024\n\n **Goede service en alle begrip.** Wij kwamen binnen wandelen en werden meteen\ngeholpen. Waarna een afspraak werd ingepland super.\n\nKlantvriendelijk _9_ Afspraak nakomen _7_ Deskundig _9_\n\nJoop\n\n15-01-2024\n\n **Prima kennismaking** Het kosteloze oriëntatie-/kennismakingsgesprek leverde\ndusdanig nieuwe inzichten en een advies op waardoor vervolgacties vooralsnog\nniet nodig bleken te zijn.\n\nKlantvriendelijk _10_ Afspraak nakomen _10_ Deskundig _10_\n\nWim\n\n14-01-2024\n\n **Heldere uitleg en goede adviezen. Vriendelijk en deskundig te woord\ngestaan.** Door mijn gesprek kreeg ik een duidelijke kijk op de financiële\nsituatie en ben ik beter in staat om vervolgstappen te nemen. Van bruggen\nadviesgroep is in staat om een duidelijk beeld te schetsen van de financiële\nsituatie, nu en zeker ook in de toekomst bij mijn pensioen\n\nKlantvriendelijk _10_ Afspraak nakomen _10_ Deskundig _10_\n\nFrank\n\n14-01-2024\n\n **Beter dan ik had verwacht** Heel veel kennis, super klant vriendelijk en\naandachtig\n\nKlantvriendelijk _10_ Afspraak nakomen _10_ Deskundig _10_\n\nJose Madueno\n\n17-01-2024\n\n **Fijn en prettig gesprek.** Het gesprek met Tom heb ik als erg fujn en\nprettig ervaren. Alle vragen zijn op een duidelijke manier beantwoord.\n\nKlantvriendelijk _10_ Afspraak nakomen _10_ Deskundig _10_\n\nDanny\n\n16-01-2024\n\n **.** .\n\nKlantvriendelijk _10_ Afspraak nakomen _10_ Deskundig _10_\n\nMarlies\n\n16-01-2024\n\n **Behulpzaam en meedenkend.** \\-\n\nKlantvriendelijk _10_ Afspraak nakomen _10_ Deskundig _6_\n\nMark\n\n16-01-2024\n\n **Goed en deskundig** Snel en goed contact met de medewerkers. Deskundig en\nduidelijk wat er nodig was voor een nieuwe hypotheek.\n\nKlantvriendelijk _8_ Afspraak nakomen _8_ Deskundig _8_\n\nmeneer\n\n15-01-2024\n\n‹›\n\n0800 1600Bel voor meer informatie\n\n### Blijf op de hoogte\n\nSchrijf je in voor onze nieuwsbrief!\n\nAanmelden\n\n9,0\n\nop basis van 5410 reviews!\n\n### Hypotheekadvies\n\nMaximale hypotheek berekenen 2024Nieuwe hypotheek afsluitenOverwaarde\nhuisHypotheek oversluitenHypotheekrente verwachtingHypotheek voor zzp\n\n### Financieel advies\n\nPensioenadviesVerzekeringsadviesFinanciële planningConsumptief\nkredietSchenkenScheidenArbeidsongeschiktheidOnafhankelijk financieel advies\n\n### Makelaardij\n\nHuis kopenHuis verkopen\n\n### Van Bruggen Adviesgroep\n\nOver onsVacaturesBegrippenlijst\n\n### Van Bruggen Adviesgroep\n\nOver onsVacaturesBegrippenlijstVeel gestelde vragen\n\n© Copyright 2024 Van Bruggen Adviesgroep\n\nKlachtenprocedureVoorwaardenDisclaimerPrivacyverklaring &\nCookiebeleidCookiebeleidPrivacyverklaring\n\n#####\n\n×\n\nSluiten\n\n",
    "links": "[{\"link\": \"https://www.vanbruggen.nl/\", \"text\": \"\"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies\", \"text\": \"\\n Hypotheekadvies\\n \"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies\", \"text\": \"\\n Hypotheekadvies\\n \"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/kosten-hypotheekadvies\", \"text\": \"\\n Kosten hypotheekadvies\\n \"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/leennormen\", \"text\": \"\\n Leennormen (hypotheeknormen) 2024\\n \"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/huizenprijzen-verwachting\", \"text\": \"\\n Huizenprijzen verwachting\\n \"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/kan-ik-een-huis-kopen\", \"text\": \"\\n Kan ik een huis kopen?\\n \"}, {\"link\": \"https://www.vanbruggen.nl/overwaarderedirect\", \"text\": \"\\n Overwaarde\\n \"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/jouw-maximale-hypotheek-berekenen\", \"text\": \"\\n Maximale hypotheek berekenen 2024\\n \"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/nieuwe-hypotheek-afsluiten\", \"text\": \"\\n Nieuwe hypotheek afsluiten\\n \"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/tweede-hypotheek\", \"text\": \"\\n Tweede hypotheek\\n \"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/overwaarde-huis\", \"text\": \"\\n Overwaarde huis\\n \"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/hypotheek-verhogen\", \"text\": \"\\n Hypotheek verhogen\\n \"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/onafhankelijk-hypotheekadvies/overwaarde-opnemen\", \"text\": \"\\n Overwaarde opnemen\\n \"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/extra-aflossen-hypotheek\", \"text\": \"\\n Extra aflossen hypotheek\\n \"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/hypotheek-oversluiten\", \"text\": \"\\n Hypotheek oversluiten\\n \"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/hypotheekvormen\", \"text\": \"\\n Hypotheekvormen\\n \"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/starterslening\", \"text\": \"\\n Starterslening\\n \"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/hypotheek-57-plusser\", \"text\": \"\\n Hypotheek vanaf 57 jaar\\n \"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/actuele-rentestanden\", \"text\": \"\\n Actuele rentestanden\\n \"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/hypotheekrente-verwachting\", \"text\": \"\\n Hypotheekrente verwachting\\n \"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/hypotheek-afsluiten\", \"text\": \"\\n Hypotheek afsluiten\\n \"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/zzp-hypotheek\", \"text\": \"\\n Hypotheek voor zzp\\n \"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/hypotheekrenteaftrek\", \"text\": \"\\n Hypotheekrenteaftrek \\n \"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/onafhankelijk-hypotheekadvies/einde-rentevaste-periode\", \"text\": \"\\n Einde rentevaste periode\\n \"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/hypotheek-afsluiten/hypotheek-zonder-werkgeversverklaring\", \"text\": \"\\n Hypotheek zonder werkgeversverklaring\\n \"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/onafhankelijk-hypotheekadvies/rente-opslag\", \"text\": \"\\n Rente-opslag \\n \"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/nationale-hypotheek-garantie\", \"text\": \"\\n Nationale hypotheek garantie\\n \"}, {\"link\": \"https://www.vanbruggen.nl/financieel-advies\", \"text\": \"\\n Financieel advies\\n \"}, {\"link\": \"https://www.vanbruggen.nl/financieel-advies\", \"text\": \"\\n Financieel advies\\n \"}, {\"link\": \"https://www.vanbruggen.nl/financieel-advies/pensioenadvies\", \"text\": \"\\n Pensioenadvies\\n \"}, {\"link\": \"https://www.vanbruggen.nl/financieel-advies/financiele-blik \", \"text\": \"\\n Financiële blik\\n \"}, {\"link\": \"https://www.vanbruggen.nl/financieel-advies/verzekeringsadvies\", \"text\": \"\\n Verzekeringsadvies\\n \"}, {\"link\": \"https://www.vanbruggen.nl/financieel-advies/financiele-planning\", \"text\": \"\\n Financiële planning\\n \"}, {\"link\": \"https://www.vanbruggen.nl/financieel-advies/consumptief-krediet\", \"text\": \"\\n Consumptief krediet\\n \"}, {\"link\": \"https://www.vanbruggen.nl/financieel-advies/schenken\", \"text\": \"\\n Schenken\\n \"}, {\"link\": \"https://www.vanbruggen.nl/financieel-advies/scheiden\", \"text\": \"\\n Scheiden\\n \"}, {\"link\": \"https://www.vanbruggen.nl/financieel-advies/arbeidsongeschiktheid\", \"text\": \"\\n Arbeidsongeschiktheid\\n \"}, {\"link\": \"https://www.vanbruggen.nl/financieel-advies/onafhankelijk-financieel-advies\", \"text\": \"\\n Onafhankelijk financieel advies\\n \"}, {\"link\": \"https://www.vanbruggen.nl/jouw-woonsituatie\", \"text\": \"\\n Jouw (woon)situatie\\n \"}, {\"link\": \"https://www.vanbruggen.nl/jouw-woonsituatie\", \"text\": \"\\n Jouw (woon)situatie\\n \"}, {\"link\": \"https://www.vanbruggen.nl/jouw-woonsituatie/eerste-huis-kopen\", \"text\": \"\\n Eerste huis kopen\\n \"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/ander-huis-kopen\", \"text\": \"\\n Ander huis kopen\\n \"}, {\"link\": \"https://www.vanbruggen.nl/jouw-woonsituatie/nieuwbouwhuis-kopen\", \"text\": \"\\n Nieuwbouwhuis kopen\\n \"}, {\"link\": \"https://www.vanbruggen.nl/financieel-advies/huis-verbouwen\", \"text\": \"\\n Huis verbouwen\\n \"}, {\"link\": \"https://www.vanbruggen.nl/financieel-advies/verduurzamen-woning\", \"text\": \"\\n Huis verduurzamen\\n \"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/hypotheek-zonder-vast-contract\", \"text\": \"\\n Hypotheek zonder vast contract\\n \"}, {\"link\": \"https://www.vanbruggen.nl/makelaardij\", \"text\": \"\\n Makelaardij\\n \"}, {\"link\": \"https://www.vanbruggen.nl/makelaardij\", \"text\": \"\\n Makelaardij\\n \"}, {\"link\": \"https://www.vanbruggen.nl/makelaardij/huis-kopen/hypotheekakte\", \"text\": \"\\n Hypotheekakte\\n \"}, {\"link\": \"https://www.vanbruggen.nl/makelaardij/huis-kopen\", \"text\": \"\\n Huis kopen\\n \"}, {\"link\": \"https://www.vanbruggen.nl/makelaardij/huis-verkopen\", \"text\": \"\\n Huis verkopen\\n \"}, {\"link\": \"https://www.vanbruggen.nl/makelaardij/financieel-adviseur-n-makelaar/aankoopmakelaar\", \"text\": \"\\n Aankoopmakelaar\\n \"}, {\"link\": \"https://www.vanbruggen.nl/makelaardij/financieel-adviseur-n-makelaar/verkoopmakelaar\", \"text\": \"\\n Verkoopmakelaar\\n \"}, {\"link\": \"https://www.vanbruggen.nl/makelaardij/financieel-adviseur-n-makelaar/nieuwbouwhuis-kopen\", \"text\": \"\\n Nieuwbouwhuis kopen\\n \"}, {\"link\": \"https://www.vanbruggen.nl/makelaardij/financieel-adviseur-n-makelaar/bestaand-huis-kopen\", \"text\": \"\\n Bestaand huis kopen\\n \"}, {\"link\": \"https://www.vanbruggen.nl/makelaardij/financieel-adviseur-n-makelaar/zelf-een-huis-bouwen\", \"text\": \"\\n Zelf een huis bouwen\\n \"}, {\"link\": \"https://www.vanbruggen.nl/over-ons\", \"text\": \"\\n Over ons\\n \"}, {\"link\": \"https://www.vanbruggen.nl/over-ons\", \"text\": \"\\n Over ons\\n \"}, {\"link\": \"https://www.vanbruggen.nl/oranjefonds\", \"text\": \"\\n Het Oranje Fonds\\n \"}, {\"link\": \"https://www.vanbruggen.nl/over-ons/pers\", \"text\": \"\\n Pers\\n \"}, {\"link\": \"https://www.vanbruggen.nl/wordfranchisenemer\", \"text\": \"\\n Franchisenemer worden?\\n \"}, {\"link\": \"https://www.vanbruggen.nl/dienstverlening\", \"text\": \"\\n Onze dienstverlening\\n \"}, {\"link\": \"https://www.vanbruggen.nl/contact\", \"text\": \"\\n Contact\\n \"}, {\"link\": \"https://www.vanbruggen.nl/over-ons/over-ons-overzicht/vacatures\", \"text\": \"\\n Vacatures \\n \"}, {\"link\": \"https://www.vanbruggen.nl/begrippenlijst\", \"text\": \"\\n Begrippenlijst\\n \"}, {\"link\": \"https://www.vanbruggen.nl/over-ons/partners\", \"text\": \"\\n Onze partners\\n \"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/hypotheekrente-nieuws\", \"text\": \"\"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadviseur-zoeken\", \"text\": \"\"}, {\"link\": \"https://www.vanbruggen.nl/afspraak-maken\", \"text\": \"\"}, {\"link\": \"https://www.vanbruggen.nl/disclaimer\", \"text\": \"Disclaimer\"}, {\"link\": \"https://www.vanbruggen.nl/privacy\", \"text\": \"Privacyverklaring  & Cookiebeleid\"}, {\"link\": \"https://www.vanbruggen.nl/\", \"text\": \"\"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies\", \"text\": \"Hypotheekadvies\"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies\", \"text\": \"Hypotheekadvies\"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/kosten-hypotheekadvies\", \"text\": \"Kosten hypotheekadvies\"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/leennormen\", \"text\": \"Leennormen (hypotheeknormen) 2024\"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/huizenprijzen-verwachting\", \"text\": \"Huizenprijzen verwachting\"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/kan-ik-een-huis-kopen\", \"text\": \"Kan ik een huis kopen?\"}, {\"link\": \"https://www.vanbruggen.nl/overwaarderedirect\", \"text\": \"Overwaarde\"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/jouw-maximale-hypotheek-berekenen\", \"text\": \"Maximale hypotheek berekenen 2024\"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/nieuwe-hypotheek-afsluiten\", \"text\": \"Nieuwe hypotheek afsluiten\"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/tweede-hypotheek\", \"text\": \"Tweede hypotheek\"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/overwaarde-huis\", \"text\": \"Overwaarde huis\"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/hypotheek-verhogen\", \"text\": \"Hypotheek verhogen\"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/onafhankelijk-hypotheekadvies/overwaarde-opnemen\", \"text\": \"Overwaarde opnemen\"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/extra-aflossen-hypotheek\", \"text\": \"Extra aflossen hypotheek\"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/hypotheek-oversluiten\", \"text\": \"Hypotheek oversluiten\"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/hypotheekvormen\", \"text\": \"Hypotheekvormen\"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/starterslening\", \"text\": \"Starterslening\"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/hypotheek-57-plusser\", \"text\": \"Hypotheek vanaf 57 jaar\"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/actuele-rentestanden\", \"text\": \"Actuele rentestanden\"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/hypotheekrente-verwachting\", \"text\": \"Hypotheekrente verwachting\"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/hypotheek-afsluiten\", \"text\": \"Hypotheek afsluiten\"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/zzp-hypotheek\", \"text\": \"Hypotheek voor zzp\"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/hypotheekrenteaftrek\", \"text\": \"Hypotheekrenteaftrek \"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/onafhankelijk-hypotheekadvies/einde-rentevaste-periode\", \"text\": \"Einde rentevaste periode\"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/hypotheek-afsluiten/hypotheek-zonder-werkgeversverklaring\", \"text\": \"Hypotheek zonder werkgeversverklaring\"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/onafhankelijk-hypotheekadvies/rente-opslag\", \"text\": \"Rente-opslag \"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/nationale-hypotheek-garantie\", \"text\": \"Nationale hypotheek garantie\"}, {\"link\": \"https://www.vanbruggen.nl/financieel-advies\", \"text\": \"Financieel advies\"}, {\"link\": \"https://www.vanbruggen.nl/financieel-advies\", \"text\": \"Financieel advies\"}, {\"link\": \"https://www.vanbruggen.nl/financieel-advies/pensioenadvies\", \"text\": \"Pensioenadvies\"}, {\"link\": \"https://www.vanbruggen.nl/financieel-advies/financiele-blik \", \"text\": \"Financiële blik\"}, {\"link\": \"https://www.vanbruggen.nl/financieel-advies/verzekeringsadvies\", \"text\": \"Verzekeringsadvies\"}, {\"link\": \"https://www.vanbruggen.nl/financieel-advies/financiele-planning\", \"text\": \"Financiële planning\"}, {\"link\": \"https://www.vanbruggen.nl/financieel-advies/consumptief-krediet\", \"text\": \"Consumptief krediet\"}, {\"link\": \"https://www.vanbruggen.nl/financieel-advies/schenken\", \"text\": \"Schenken\"}, {\"link\": \"https://www.vanbruggen.nl/financieel-advies/scheiden\", \"text\": \"Scheiden\"}, {\"link\": \"https://www.vanbruggen.nl/financieel-advies/arbeidsongeschiktheid\", \"text\": \"Arbeidsongeschiktheid\"}, {\"link\": \"https://www.vanbruggen.nl/financieel-advies/onafhankelijk-financieel-advies\", \"text\": \"Onafhankelijk financieel advies\"}, {\"link\": \"https://www.vanbruggen.nl/jouw-woonsituatie\", \"text\": \"Jouw (woon)situatie\"}, {\"link\": \"https://www.vanbruggen.nl/jouw-woonsituatie\", \"text\": \"Jouw (woon)situatie\"}, {\"link\": \"https://www.vanbruggen.nl/jouw-woonsituatie/eerste-huis-kopen\", \"text\": \"Eerste huis kopen\"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/ander-huis-kopen\", \"text\": \"Ander huis kopen\"}, {\"link\": \"https://www.vanbruggen.nl/jouw-woonsituatie/nieuwbouwhuis-kopen\", \"text\": \"Nieuwbouwhuis kopen\"}, {\"link\": \"https://www.vanbruggen.nl/financieel-advies/huis-verbouwen\", \"text\": \"Huis verbouwen\"}, {\"link\": \"https://www.vanbruggen.nl/financieel-advies/verduurzamen-woning\", \"text\": \"Huis verduurzamen\"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/hypotheek-zonder-vast-contract\", \"text\": \"Hypotheek zonder vast contract\"}, {\"link\": \"https://www.vanbruggen.nl/makelaardij\", \"text\": \"Makelaardij\"}, {\"link\": \"https://www.vanbruggen.nl/makelaardij\", \"text\": \"Makelaardij\"}, {\"link\": \"https://www.vanbruggen.nl/makelaardij/huis-kopen/hypotheekakte\", \"text\": \"Hypotheekakte\"}, {\"link\": \"https://www.vanbruggen.nl/makelaardij/huis-kopen\", \"text\": \"Huis kopen\"}, {\"link\": \"https://www.vanbruggen.nl/makelaardij/huis-verkopen\", \"text\": \"Huis verkopen\"}, {\"link\": \"https://www.vanbruggen.nl/makelaardij/financieel-adviseur-n-makelaar/aankoopmakelaar\", \"text\": \"Aankoopmakelaar\"}, {\"link\": \"https://www.vanbruggen.nl/makelaardij/financieel-adviseur-n-makelaar/verkoopmakelaar\", \"text\": \"Verkoopmakelaar\"}, {\"link\": \"https://www.vanbruggen.nl/makelaardij/financieel-adviseur-n-makelaar/nieuwbouwhuis-kopen\", \"text\": \"Nieuwbouwhuis kopen\"}, {\"link\": \"https://www.vanbruggen.nl/makelaardij/financieel-adviseur-n-makelaar/bestaand-huis-kopen\", \"text\": \"Bestaand huis kopen\"}, {\"link\": \"https://www.vanbruggen.nl/makelaardij/financieel-adviseur-n-makelaar/zelf-een-huis-bouwen\", \"text\": \"Zelf een huis bouwen\"}, {\"link\": \"https://www.vanbruggen.nl/over-ons\", \"text\": \"Over ons\"}, {\"link\": \"https://www.vanbruggen.nl/over-ons\", \"text\": \"Over ons\"}, {\"link\": \"https://www.vanbruggen.nl/oranjefonds\", \"text\": \"Het Oranje Fonds\"}, {\"link\": \"https://www.vanbruggen.nl/over-ons/pers\", \"text\": \"Pers\"}, {\"link\": \"https://www.vanbruggen.nl/wordfranchisenemer\", \"text\": \"Franchisenemer worden?\"}, {\"link\": \"https://www.vanbruggen.nl/dienstverlening\", \"text\": \"Onze dienstverlening\"}, {\"link\": \"https://www.vanbruggen.nl/contact\", \"text\": \"Contact\"}, {\"link\": \"https://www.vanbruggen.nl/over-ons/over-ons-overzicht/vacatures\", \"text\": \"Vacatures \"}, {\"link\": \"https://www.vanbruggen.nl/begrippenlijst\", \"text\": \"Begrippenlijst\"}, {\"link\": \"https://www.vanbruggen.nl/over-ons/partners\", \"text\": \"Onze partners\"}, {\"link\": \"https://www.vanbruggen.nl/afspraak-maken\", \"text\": \"\\n Maak een afspraak\\n \"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadviseur-zoeken\", \"text\": \"\\n Vind jouw vestiging\\n \"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadviseur-zoeken\", \"text\": \"\"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadviseur-zoeken\", \"text\": \"\"}, {\"link\": \"https://www.vanbruggen.nl/\", \"text\": \"Home\"}, {\"link\": \"https://www.vanbruggen.nl/financieeladvies\", \"text\": \"Financieel advies\"}, {\"link\": \"https://www.vanbruggen.nl/financieel-advies/verzekeringsadvies\", \"text\": \"Verzekeringsadvies\"}, {\"link\": \"https://www.vanbruggen.nl/financieel-advies/verzekeringsadvies/camperverzekering\", \"text\": \"Camperverzekering\"}, {\"link\": \"https://www.vanbruggen.nl/financieel-advies/verzekeringsadvies/veelgestelde-vragen\", \"text\": \"Veelgestelde vragen verzekeringen\"}, {\"link\": \"https://www.vanbruggen.nl/verzekeringen/veelgestelde-vragen-verzekeringen/waar-let-ik-op-bij-het-afsluiten-van-een-autoverzekering\", \"text\": \"10 tips voor het afsluiten van een autoverzekering\"}, {\"link\": \"https://www.vanbruggen.nl/financieel-advies/veelgestelde-vragen/welke-verzekeringen-zijn-verplicht\", \"text\": \"Welke verzekeringen zijn verplicht? \"}, {\"link\": \"https://www.vanbruggen.nl/financieel-advies/veelgestelde-vragen/welke-soorten-verzekeringen-zijn-er\", \"text\": \"Welke soorten verzekeringen zijn er?\"}, {\"link\": \"https://www.vanbruggen.nl/verzekeringen/veelgestelde-vragen-verzekeringen/is-een-autoverzekering-voor-jongeren-duurder-dan-voor-ouderen\", \"text\": \"Is een autoverzekering voor jongeren duurder dan voor ouderen?\"}, {\"link\": \"https://www.vanbruggen.nl/financieel-advies/veelgestelde-vragen/wat-dekt-een-reisverzekering\", \"text\": \"Wat dekt een reisverzekering?\"}, {\"link\": \"https://www.vanbruggen.nl/actueel/nieuws/2023/december/inflatie-eurozone-weer-iets-omlaag\", \"text\": \"\"}, {\"link\": \"https://www.vanbruggen.nl/actueel/nieuws/2023/december/inflatie-eurozone-weer-iets-omlaag\", \"text\": \"Lees meer\"}, {\"link\": \"https://www.vanbruggen.nl/actueel/nieuws/2023/november/hypotheekrente-verwachting-2024\", \"text\": \"\"}, {\"link\": \"https://www.vanbruggen.nl/actueel/nieuws/2023/november/hypotheekrente-verwachting-2024\", \"text\": \"Lees meer\"}, {\"link\": \"https://www.vanbruggen.nl/actueel/nieuws/2023/november/kleine-verlagingen-hypotheekrentes\", \"text\": \"\"}, {\"link\": \"https://www.vanbruggen.nl/actueel/nieuws/2023/november/kleine-verlagingen-hypotheekrentes\", \"text\": \"Lees meer\"}, {\"link\": \"https://www.vanbruggen.nl/actueel/nieuws/2023/november/lichte-hoop-dat-we-het-hoogste-rentepunt-hebben-gehad\", \"text\": \"\"}, {\"link\": \"https://www.vanbruggen.nl/actueel/nieuws/2023/november/lichte-hoop-dat-we-het-hoogste-rentepunt-hebben-gehad\", \"text\": \"Lees meer\"}, {\"link\": \"https://www.vanbruggen.nl/actueel/nieuws/2024/januari/alleenstaande-leraar-en-verpleegkundige-zien-kans-op-koopwoning-groeien-in-2024\", \"text\": \"\"}, {\"link\": \"https://www.vanbruggen.nl/actueel/nieuws/2024/januari/alleenstaande-leraar-en-verpleegkundige-zien-kans-op-koopwoning-groeien-in-2024\", \"text\": \"Lees meer\"}, {\"link\": \"https://www.vanbruggen.nl/actueel/nieuws/2023/december/populaire-10-jaar-vaste-hypotheekrente-onder-4\", \"text\": \"\"}, {\"link\": \"https://www.vanbruggen.nl/actueel/nieuws/2023/december/populaire-10-jaar-vaste-hypotheekrente-onder-4\", \"text\": \"Lees meer\"}, {\"link\": \"https://www.vanbruggen.nl/actueel/blogs/2024/januari/hypotheekrente-beweegt-tegen-de-stroom-in-verder-omlaag\", \"text\": \"\"}, {\"link\": \"https://www.vanbruggen.nl/actueel/blogs/2024/januari/hypotheekrente-beweegt-tegen-de-stroom-in-verder-omlaag\", \"text\": \"Lees meer\"}, {\"link\": \"https://www.vanbruggen.nl/actueel/blogs/2024/januari/concurrentie-op-nederlandse-hypotheekmarkt-neemt-toe\", \"text\": \"\"}, {\"link\": \"https://www.vanbruggen.nl/actueel/blogs/2024/januari/concurrentie-op-nederlandse-hypotheekmarkt-neemt-toe\", \"text\": \"Lees meer\"}, {\"link\": \"https://www.vanbruggen.nl/actueel/nieuws/2023/december/inflatie-eurozone-weer-iets-omlaag\", \"text\": \"\"}, {\"link\": \"https://www.vanbruggen.nl/actueel/nieuws/2023/december/inflatie-eurozone-weer-iets-omlaag\", \"text\": \"Lees meer\"}, {\"link\": \"https://www.vanbruggen.nl/actueel/nieuws/2023/november/hypotheekrente-verwachting-2024\", \"text\": \"\"}, {\"link\": \"https://www.vanbruggen.nl/actueel/nieuws/2023/november/hypotheekrente-verwachting-2024\", \"text\": \"Lees meer\"}, {\"link\": \"https://www.vanbruggen.nl/actueel/nieuws/2023/november/kleine-verlagingen-hypotheekrentes\", \"text\": \"\"}, {\"link\": \"https://www.vanbruggen.nl/actueel/nieuws/2023/november/kleine-verlagingen-hypotheekrentes\", \"text\": \"Lees meer\"}, {\"link\": \"https://www.vanbruggen.nl/actueel/nieuws/2023/november/lichte-hoop-dat-we-het-hoogste-rentepunt-hebben-gehad\", \"text\": \"\"}, {\"link\": \"https://www.vanbruggen.nl/actueel/nieuws/2023/november/lichte-hoop-dat-we-het-hoogste-rentepunt-hebben-gehad\", \"text\": \"Lees meer\"}, {\"link\": \"https://www.vanbruggen.nl/actueel/nieuws/2024/januari/alleenstaande-leraar-en-verpleegkundige-zien-kans-op-koopwoning-groeien-in-2024\", \"text\": \"\"}, {\"link\": \"https://www.vanbruggen.nl/actueel/nieuws/2024/januari/alleenstaande-leraar-en-verpleegkundige-zien-kans-op-koopwoning-groeien-in-2024\", \"text\": \"Lees meer\"}, {\"link\": \"https://www.vanbruggen.nl/actueel/nieuws/2023/december/populaire-10-jaar-vaste-hypotheekrente-onder-4\", \"text\": \"\"}, {\"link\": \"https://www.vanbruggen.nl/actueel/nieuws/2023/december/populaire-10-jaar-vaste-hypotheekrente-onder-4\", \"text\": \"Lees meer\"}, {\"link\": \"https://www.vanbruggen.nl/actueel/blogs/2024/januari/hypotheekrente-beweegt-tegen-de-stroom-in-verder-omlaag\", \"text\": \"\"}, {\"link\": \"https://www.vanbruggen.nl/actueel/blogs/2024/januari/hypotheekrente-beweegt-tegen-de-stroom-in-verder-omlaag\", \"text\": \"Lees meer\"}, {\"link\": \"https://www.vanbruggen.nl/actueel/blogs/2024/januari/concurrentie-op-nederlandse-hypotheekmarkt-neemt-toe\", \"text\": \"\"}, {\"link\": \"https://www.vanbruggen.nl/actueel/blogs/2024/januari/concurrentie-op-nederlandse-hypotheekmarkt-neemt-toe\", \"text\": \"Lees meer\"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies\", \"text\": \"Hypotheekadvies\"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/jouw-maximale-hypotheek-berekenen\", \"text\": \"Maximale hypotheek berekenen 2024\"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/nieuwe-hypotheek-afsluiten\", \"text\": \"Nieuwe hypotheek afsluiten\"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/overwaarde-huis\", \"text\": \"Overwaarde huis\"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/hypotheek-oversluiten\", \"text\": \"Hypotheek oversluiten\"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/hypotheekrente-verwachting\", \"text\": \"Hypotheekrente verwachting\"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/zzp-hypotheek\", \"text\": \"Hypotheek voor zzp\"}, {\"link\": \"https://www.vanbruggen.nl/financieeladvies\", \"text\": \"Financieel advies\"}, {\"link\": \"https://www.vanbruggen.nl/financieel-advies/pensioenadvies\", \"text\": \"Pensioenadvies\"}, {\"link\": \"https://www.vanbruggen.nl/financieel-advies/verzekeringsadvies\", \"text\": \"Verzekeringsadvies\"}, {\"link\": \"https://www.vanbruggen.nl/financieel-advies/financiele-planning\", \"text\": \"Financiële planning\"}, {\"link\": \"https://www.vanbruggen.nl/financieel-advies/consumptief-krediet\", \"text\": \"Consumptief krediet\"}, {\"link\": \"https://www.vanbruggen.nl/financieel-advies/schenken\", \"text\": \"Schenken\"}, {\"link\": \"https://www.vanbruggen.nl/financieel-advies/scheiden\", \"text\": \"Scheiden\"}, {\"link\": \"https://www.vanbruggen.nl/financieel-advies/arbeidsongeschiktheid\", \"text\": \"Arbeidsongeschiktheid\"}, {\"link\": \"https://www.vanbruggen.nl/financieel-advies/onafhankelijk-financieel-advies\", \"text\": \"Onafhankelijk financieel advies\"}, {\"link\": \"https://www.vanbruggen.nl/makelaardij\", \"text\": \"Makelaardij\"}, {\"link\": \"https://www.vanbruggen.nl/makelaardij/huis-kopen\", \"text\": \"Huis kopen\"}, {\"link\": \"https://www.vanbruggen.nl/makelaardij/huis-verkopen\", \"text\": \"Huis verkopen\"}, {\"link\": \"https://www.vanbruggen.nl/van-bruggen-adviesgroep\", \"text\": \"Van Bruggen Adviesgroep\"}, {\"link\": \"https://www.vanbruggen.nl/van-bruggen-adviesgroep/over-ons\", \"text\": \"Over ons\"}, {\"link\": \"https://www.vanbruggen.nl/van-bruggen-adviesgroep/vacatures\", \"text\": \"Vacatures\"}, {\"link\": \"https://www.vanbruggen.nl/van-bruggen-adviesgroep/begrippenlijst\", \"text\": \"Begrippenlijst\"}, {\"link\": \"https://www.vanbruggen.nl/van-bruggen-adviesgroep\", \"text\": \"Van Bruggen Adviesgroep\"}, {\"link\": \"https://www.vanbruggen.nl/van-bruggen-adviesgroep/over-ons\", \"text\": \"Over ons\"}, {\"link\": \"https://www.vanbruggen.nl/van-bruggen-adviesgroep/vacatures\", \"text\": \"Vacatures\"}, {\"link\": \"https://www.vanbruggen.nl/van-bruggen-adviesgroep/begrippenlijst\", \"text\": \"Begrippenlijst\"}, {\"link\": \"https://www.vanbruggen.nl/veelgestelde-vragen\", \"text\": \"Veel gestelde vragen\"}, {\"link\": \"https://www.vanbruggen.nl/hypotheekadvies/onafhankelijk-hypotheekadvies/advieswijzer\", \"text\": \"\"}, {\"link\": \"https://www.vanbruggen.nl/klachtenprocedure\", \"text\": \"Klachtenprocedure\"}, {\"link\": \"https://www.vanbruggen.nl/voorwaarden\", \"text\": \"Voorwaarden\"}, {\"link\": \"https://www.vanbruggen.nl/disclaimer\", \"text\": \"Disclaimer\"}, {\"link\": \"https://www.vanbruggen.nl/privacy\", \"text\": \"Privacyverklaring  & Cookiebeleid\"}, {\"link\": \"https://www.vanbruggen.nl/privacy/cookiebeleid\", \"text\": \"Cookiebeleid\"}, {\"link\": \"https://www.vanbruggen.nl/privacy/privacyverklaring\", \"text\": \"Privacyverklaring\"}]"
}