{
    "summary": "  * Industries\n\nClose\n\nBack\n\n## Industries\n\nOur teams can quickly analyze business conditions and needs with deep\ninstitutional knowledge, global perspective, and comprehensive technical\nskills.\n\nAll Industries\n\n    * Consumer & Industrial\n\nconsumer-and-industrial\n\nWith integrated teams focused on the consumer, hospitality, and manufacturing\nand distribution industries, we’ll help you leverage process innovation,\nmanage growth capital, and support your brand strategy.\n\nConsumer & Industrial\n\n      * Cannabis\n      * Consumer\n      * Hospitality\n      * Manufacturing & Distribution\n\n    * Financial Sponsors & Services\n\nfinancial-sponsors-and-financial-services\n\nWe provide award-winning advisory, tax, and compliance services supporting the\nentire investment management ecosystem –private equity firms and portfolio\ncompanies to hedge funds and independent sponsors.\n\nFinancial Sponsors & Services\n\n      * Broker Dealers\n      * Independent Sponsors\n      * Mortgage Lenders\n      * Real Estate Funds\n      * Family Offices\n      * Hedge Funds\n      * Private Equity\n      * Small Business Investment Companies (SBICs)\n      * Special Purpose Acquisition Companies (SPACs) Services\n      * Venture Capital\n\n    * Healthcare\n\nhealthcare\n\nHealthcare organizations face significant strategic, financial, and\noperational issues in today’s challenging marketplace.  Our comprehensive\nadvisory, audit, and tax solutions can help your organization transform its\nfinancial, operational, and strategic performance.\n\nHealthcare\n\n      * Performance Transformation\n\n    * Life Sciences\n\nlife-sciences\n\nHighly regulated, evolving industries need exceptional accounting, compliance,\nand advisory services to address reporting requirements and attract capital.\nWe help private, public, and venture and private equity-backed life sciences\ncompanies manage financial growth throughout their life cycles.\n\nLife Sciences\n\n    * Private Clients\n\nprivate-clients\n\nWealthy individuals and families, along with entertainment, law, and medical\nbusinesses, each have tax and accounting needs requiring a hands-on service\napproach. Learn how we help private clients protect and grow their assets.\n\nPrivate Clients\n\n      * Film & Entertainment\n      * Law Firms\n      * Medical Practices\n      * Private Clients\n\n    * Public Sector\n\npublic-sector\n\nHelping government agencies, contractors, and not-for-profit organizations\nadminister taxpayer and donor funding requires highly specialized experience.\nWe help public sector companies manage risk, maintain compliance, and deploy\ncapital that benefits society.\n\nPublic Sector\n\n      * Government Contracting\n      * Government\n      * Not-for-Profit & Education Real Estate\n\n    * Real Estate\n\nreal-estate\n\nOur largest practice group, we support community development involving both\nmarket rate and tax incentivized properties. Learn why developers, investors,\nsyndicators, and lenders turn to CohnReznick for our real estate services and\nexpertise.\n\nReal Estate\n\n      * Affordable Housing\n      * Commercial Real Estate\n      * Construction\n      * Opportunity Zones\n      * Tax Credits\n\n    * Renewable Energy\n\nrenewable-energy\n\nFrom complex wind and solar transactions to tax equity and infrastructure\nadvisory, we help renewable energy stakeholders create financially sound,\nsustainable businesses. Our solutions support developers, IPPs, EPCs,\nutilities, tax equity investors, and private equity funds.\n\nRenewable Energy\n\n    * Technology & Media\n\ntechnology-and-media\n\nInnovation is the life-blood of global commerce. We help emerging and\nestablished tech and media companies maintain tax compliance, complete\ntransactions, and drive revenue through tax incentives, licensing, and royalty\nagreements.\n\nTechnology & Media\n\nBack|Menu Name\n\n###\n\n  * Services\n\nClose\n\nBack\n\n## Services\n\nWe provide a wide range of industry-centered advisory, assurance, and tax\nservices. Our integrated approach is designed to help you improve performance\nand successfully manage risk.\n\nAll Services\n\n    * Accounting & Assurance\n\n      * Accounting\n      * Attest & Audit\n      * Employee Benefit Plans\n      * Lease Accounting\n\n    * Accounting Advisory\n\n1\n\n    * Business Performance\n\n1\n\n      * CFO Advisory\n      * Managed Services & Outsourcing\n      * Performance Improvement\n      * Restructuring\n\n    * ESG Solutions\n\n1\n\n    * Risk\n\n1\n\n      * Cybersecurity\n      * Dispute Resolution\n      * Governance\n      * Privacy\n      * Technology/Enterprise Risk\n\n    * Tax\n\n      * Federal Tax\n      * International Tax\n      * Exempt Organizations Tax Services\n      * Private Clients\n      * State & Local Tax\n      * Tax Credits\n      * Trusts & Estates\n\n    * Technology +\n\n1\n\n    * Transactions\n\n1\n\n      * Due Diligence\n      * Post-Merger Integration\n      * Project Finance & Consulting\n      * Valuation\n      * Value Creation\n\nBack|Menu Name\n\n###\n\n  * Insights\n\nClose\n\nBack\n\n## Insights\n\nSharing perspectives on trends and topics that matter to our clients enhances\nthe value we deliver to them. Explore videos, articles, and other resources\ndesigned for today’s business leaders.\n\nAll Insights\n\n    * Events\n\n    * Topics\n\n      * Affordable Housing Credit Study\n      * CohnReznick & Major League Baseball®\n      * The C-Suite Dashboard\n      * Gamechangers in ESG Awards\n      * Infrastructure Resource Center\n      * Real Estate Movement\n\n    * Subscribe\n\n    * All Insights\n\nBack|Menu Name\n\n###\n\n  * About us\n\nClose\n\nBack\n\n## About us\n\nDriven by purpose. Committed to corporate responsibility. Learn about\nCohnReznick and our value proposition for your business.\n\nLearn about us\n\n    * About CohnReznick\n\nabout\n\nAbout us\n\n    * Corporate Responsibility\n\ncorporate-social-responsibility\n\nCorporate Responsibility\n\n    * News\n\nnews\n\nNews\n\n    * Offices\n\noffices\n\nOffices\n\n    * People\n\npeople\n\nPeople\n\nBack|Menu Name\n\n###\n\n  * Careers\n\nClose\n\nBack\n\n## Careers\n\nJoin our winning team of advisory, assurance, and tax professionals. See how\nfar your talent can take you.\n\nLearn more\n\n    * Early career opportunities\n\n    * Experienced career opportunities\n\n    * Internships\n\n    * Life at CohnReznick\n\n    * Why CohnReznick?\n\nBack|Menu Name\n\n###\n\n  * Contact us\n\nClose\n\nBack\n\n## Contact us\n\nHave a question or request? Looking to contact a partner? Want more\ninformation on our services or an upcoming event?\n\nContact us today\n\nBack|Menu Name\n\n###\n\nClear\n\nSearchLoading\n\nClient Portal\n\n  * Back\n  * Home\n  * industries\n  * renewable-energy\n\n## Renewable Energy\n\nToday's renewable energy industry is a complex and evolving landscape of\ngrowth and opportunity. Companies active in this sector face a range of\nfinancial, tax, and audit issues that can be best addressed by a firm with\ndedicated expertise in renewables. CohnReznick's Renewable Energy Industry\nPractice can help your business move forward by proactively addressing even\nyour most complicated challenges and needs.\n\nContact us\n\n##  \n\n## Comprehensive services for renewable energy businesses\n\nOur integrated team is fully engaged in the industry across all the major\nenergy segments, delivering holistic solutions to complex problems facing\nrenewable energy participants.\n\n### **Broad sector expertise**\n\n  \n\nOur more than 100 clients across the renewable energy spectrum include\nindependent power producers, developers, EPCs, utilities, tax equity\ninvestors, and infrastructure and private equity funds.\n\n### **An expert in tax credit advisory**\n\n  \n\nFollowing extensive due diligence, we structure deals and fulfill the\naccounting, tax, and financial reporting requirements needed to support tax\nequity investing lenders, private equity, and other investors.\n\n### **Thought leaders**\n\n  \n\nCohnReznick is an active voice in the renewable energy industry at the\nnational and regional level. In addition to hosting our own Renewable Energy\nSummit and Accounting Forum, we are regularly called upon as experts to speak\nat events, offer insights, and contribute to publications. We work closely\nwith the following energy associations:\n\n##\n\nAmerican Council on Renewable Energy\n\nAmerican Wind Energy Association\n\nSolar Energy Industries Association\n\n## Integrated solutions for renewable energy companies\n\nCohnReznick’s integrated accounting, tax, and advisory capabilities serve\ncompanies at every point of the renewable energy business spectrum.\n\n### **Technical accounting consulting**\n\nComplex transactions –especially those involving tax credits – require\nspecialized accounting. We consult with clients on the accounting treatment of\ncomplex commodity contracts, align accounting policies as part of an\nacquisition, and manage the impact of new or proposed accounting standards and\ncontemplated deal structures — including modeling the impact of HLBV at the\nproject, sponsor, and investor levels.\n\n### **Tax and tax equity advisory**\n\nFor developers and investors, tax-planning strategies are the lynchpin of\nrenewable energy deals. We carefully assess tax and GAAP considerations for\npotential deal structures, modeling tax and GAAP impact to both the project\nand its sponsors.\n\n##  Infrastructure advisory\n\nNow is the time to start building your qualifications and capabilities to\nmaximize your potential to be awarded work on infrastructure projects. We can\nhelp you identify and understand likely government award criteria and make the\noperational changes necessary to strengthen your bids.­\n\nLearn more about our infrastructure advisory services\n\n# Issues and insights\n\nprv  Next\n\nDiscover more\n\nTopic\n\nInflation Reduction Act: Resource, guidance and application center\n\nInsight\n\nChasing proportional amortization method (PAM)\n\nInsight\n\nTurn clean energy credits into cash through direct pay\n\nInsight\n\nKey elements of a strong renewable energy valuation report\n\nInsight\n\nFinal regulations on low-income adder in IRA released\n\nInsight\n\nWhat IIJA, IRA funding can do for renewable energy investments\n\nInsight\n\nTools to help navigate the Inflation Reduction Act\n\n## Contact\n\n  * ##### Anton Cohen\n\nCPA, Partner, Renewable Energy Industry and Project Finance and Consulting\nPractice Leader\n\nGo to Bio\n\nContact Anton\n\nAnton+Cohen anton.cohen@cohnreznick.com\n\n##### Anton Cohen\n\nCPA, Partner, Renewable Energy Industry and Project Finance and Consulting\nPractice Leader\n\nGo to Bio\n\nClose\n\n## Contact\n\nLet’s start a conversation about your company’s strategic goals and vision for\nthe future.\n\nPlease fill all required fields*\n\nPlease verify your information and check to see if all require fields have\nbeen filled in.\n\nFirst Name\n\nLast Name\n\nPlease select job functionJob Function Please select job function Accounting\nAdministration Analytics Compliance Executive Finance Human Resources IT Legal\nOperations Risk Sales Marketing Tax Other\n\nPlease select job levelJob Level Please select job level Board Member Csuite\nVP Director Manager Staff Student Other\n\nEnter Job Level\n\nEmail address\n\nPlease select countryCountry Please select country United States Afghanistan\nAland Islands Albania Algeria American Samoa Andorra Angola Anguilla Anonymous\nProxy Antarctica Antigua and Barbuda Argentina Armenia Aruba AsiaPacific\nRegion Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados\nBelarus Belgium Belize Benin Bermuda Bhutan Bolivia Bosnia and Herzegovina\nBotswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam\nBulgaria Burkina Faso Burundi Cambodia Cameroon Canada Cape Verde Cayman\nIslands Central African Republic Chad Chile China Christmas Island Cocos\nKeeling Islands Colombia Comoros Congo Congo The Democratic Republic of the\nCook Islands Costa Rica Cote dIvoire Croatia Cuba Cyprus Czech Republic\nDenmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador\nEquatorial Guinea Eritrea Estonia Ethiopia Europe Falkland Islands Malvinas\nFaroe Islands Fiji Finland France France Metropolitan French Guiana French\nPolynesia French Southern Territories Gabon Gambia Georgia Germany Ghana\nGibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea\nGuinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See Vatican\nCity State Honduras Hong Kong Hungary Iceland India Indonesia Iran Islamic\nRepublic of Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan\nKazakhstan Kenya Kiribati Korea Democratic Peoples Republic of Korea Republic\nof Kuwait Kyrgyzstan Lao Peoples Democratic Republic Latvia Lebanon Lesotho\nLiberia Libyan Arab Jamahiriya Liechtenstein Lithuania Luxembourg Macao\nMacedonia Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands\nMartinique Mauritania Mauritius Mayotte Mexico Micronesia Federated States of\nMoldova Republic of Monaco Mongolia Montenegro Montserrat Morocco Mozambique\nMyanmar Namibia Nauru Nepal Netherlands Netherlands Antilles New Caledonia New\nZealand Nicaragua Niger Nigeria Niue Norfolk Island Northern Mariana Islands\nNorway Oman Other Country Pakistan Palau Palestinian Territory Panama Papua\nNew Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico\nQatar Reunion Romania Russian Federation Rwanda Saint Bartelemey Saint Helena\nSaint Kitts and Nevis Saint Lucia Saint Martin Saint Pierre and Miquelon Saint\nVincent and the Grenadines Samoa San Marino Sao Tome and Principe Satellite\nProvider Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore\nSlovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the\nSouth Sandwich Islands Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen\nSwaziland Sweden Switzerland Syrian Arab Republic Taiwan Tajikistan Tanzania\nUnited Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago\nTunisia Turkey Turkmenistan Turks and Caicos Islands Tuvalu Uganda Ukraine\nUnited Arab Emirates United Kingdom United States Minor Outlying Islands\nUruguay Uzbekistan Vanuatu Venezuela Vietnam Virgin Islands British Virgin\nIslands US Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe\n\nPlease select stateState Please select state AK AL AR AZ CA CO CT DC DE FL GA\nHI IA ID IL IN KS KY LA MA MD ME MI MN MO MS MT NC ND NE NH NJ NM NV NY OH OK\nOR PA RI SC SD TN TX UT VA VT WA WI WV WY\n\nCompany name\n\nPlease select industryIndustry Please select industry Affordable Housing\nCannabis Commercial Real Estate Construction Financial Services Government\nGovernment Contracting HealthCare Hospitality Life Sciences Manufacturing\nDistribution Not For Profit Education Private Client Services Private Equity\nFinancial Sponsors Renewable Energy Retail Consumer Products Technology Other\n\nEnter Industry\n\nPlease select topicTopic Please select topic Reconnecting Services we provide\nSchedule a meeting Careers Speaking engagement Other\n\nComment\n\nBy your submission of information in this form, you are consenting to our\ncollection, use, processing and storage of your information in accordance with\nthe CohnReznick Privacy Policy.\n\nI want to subscribe.\n\n## Related services\n\nOur solutions are tailored to each client’s strategic business drivers,\ntechnologies, corporate structure, and culture.\n\n  * Greenhouse Gas Reduction Fund Advisory Services\n\n  * Inflation Reduction Act\n\n  * Lease Accounting\n\n  * Accounting Services\n\n  * Attest & Audit\n\n  * Federal Tax\n\n  * Tax Credits\n\n  * Valuation\n\n  * Infrastructure Advisory\n\n  * Tax Equity Investor Services\n\nReceive CohnReznick insights and event invitations on topics relevant to your\nbusiness and role.\n\nSubscribe\n\n×\n\nVideo Player is loading.\n\nPlay Video\n\nPlayNext playlist itemSkip BackwardSkip Forward\n\nMute\n\nCurrent Time 0:00\n\n/\n\nDuration 0:00\n\nLoaded: 0%\n\nStream Type LIVE\n\nSeek to live, currently behind liveLIVE\n\nRemaining Time -0:00\n\n\n\n1x\n\nPlayback Rate\n\nChapters\n\n  * Chapters\n\nDescriptions\n\n  * descriptions off, selected\n\nCaptions\n\n  * captions settings, opens captions settings dialog\n  * captions off, selected\n\nAudio Track\n\nPicture-in-PictureFullscreen\n\nThis is a modal window.\n\nBeginning of dialog window. Escape will cancel and close the window.\n\nTextColorWhiteBlackRedGreenBlueYellowMagentaCyanOpacityOpaqueSemi-\nTransparentText\nBackgroundColorBlackWhiteRedGreenBlueYellowMagentaCyanOpacityOpaqueSemi-\nTransparentTransparentCaption Area\nBackgroundColorBlackWhiteRedGreenBlueYellowMagentaCyanOpacityTransparentSemi-\nTransparentOpaque\n\nFont Size50%75%100%125%150%175%200%300%400%Text Edge\nStyleNoneRaisedDepressedUniformDrop shadowFont FamilyProportional Sans-\nSerifMonospace Sans-SerifProportional SerifMonospace SerifCasualScriptSmall\nCaps\n\nReset restore all settings to the default valuesDone\n\nClose Modal Dialog\n\nEnd of dialog window.\n\nClose\n\nClose Modal Dialog\n\nThis is a modal window. This modal can be closed by pressing the Escape key or\nactivating the close button.\n\n“CohnReznick” refers to CohnReznick LLP or any of its subsidiaries or\naffiliates. Each entity is a separate legal entity and solely responsible for\nits own acts and/or omissions.\n\n  * About\n  * News\n  * Offices\n  * People\n  * Careers\n  * Contact Us\n  * Online Payments\n  * Affiliated Companies\n  * Subscribe\n\n  * Terms of Use & Disclosures\n  * Privacy Policy\n  * Accessibility\n\n  *   *   *   *   * \n\nCohnReznick LLP is a member firm of the “Nexia International” network. Nexia\nInternational Limited does not deliver services in its own name or otherwise.\nNexia International Limited and each of its member firms are separate legal\nentities and not part of a worldwide partnership. Nexia International Limited\ndoes not accept any responsibility for the commission of any act, or omission\nto act by, or the liabilities of, any of its members.\n\n© 2023 CohnReznick LLP, All Rights Reserved.\n\nCookie Settings\n\nWe use cookies for many different site operations such as improving website\nexperiences, analytics, remembering preferences or settings, interest-based\nadvertising, and marketing. Some of these cookies transmit information to\nthird parties. Our Privacy Policy provides more information and choices about\ncookies. By clicking “Accept All” you consent to our use of all cookies.\n\nCookie Settings ACCEPT ALL\n\n## Privacy Preference Center\n\nWhen you visit any website, it may store or retrieve information on your\nbrowser, mostly in the form of cookies. This information might be about you,\nyour preferences or your device and is mostly used to make the site work as\nyou expect it to. The information does not usually directly identify you, but\nit can give you a more personalized web experience. Because we respect your\nright to privacy, you can choose not to allow some types of cookies. Click on\nthe different category headings to find out more and change our default\nsettings. However, blocking some types of cookies may impact your experience\nof the site and the services we are able to offer.  \nMore information\n\nAllow All\n\n###  Manage Consent Preferences\n\n#### Functional Cookies\n\nFunctional Cookies\n\nThese cookies enable the website to provide enhanced functionality and\npersonalisation. They may be set by us or by third party providers whose\nservices we have added to our pages. If you do not allow these cookies then\nsome or all of these services may not function properly.\n\n#### Targeting Cookies\n\nTargeting Cookies\n\nThese cookies may be set through our site by our advertising partners. They\nmay be used by those companies to build a profile of your interests and show\nyou relevant adverts on other sites. They do not store directly personal\ninformation, but are based on uniquely identifying your browser and internet\ndevice. If you do not allow these cookies, you will experience less targeted\nadvertising.\n\n#### Strictly Necessary Cookies\n\nAlways Active\n\nStrictly Necessary Cookies\n\nThese cookies are necessary for the website to function and cannot be switched\noff in our systems. They are usually only set in response to actions made by\nyou which amount to a request for services, such as setting your privacy\npreferences, logging in or filling in forms. You can set your browser to block\nor alert you about these cookies, but some parts of the site will not then\nwork. These cookies do not store any personally identifiable information.\n\n#### Performance Cookies\n\nPerformance Cookies\n\nThese cookies allow us to count visits and traffic sources so we can measure\nand improve the performance of our site. They help us to know which pages are\nthe most and least popular and see how visitors move around the site. All\ninformation these cookies collect is aggregated and therefore anonymous. If\nyou do not allow these cookies we will not know when you have visited our\nsite, and will not be able to monitor its performance.\n\nConfirm My Choices\n\nBack Button\n\nBack\n\n### Performance Cookies\n\nVendor Search Search Icon Filter Icon\n\nClear Filters\n\nInformation storage and access\n\nApply\n\nConsent Leg.Interest\n\nAll Consent Allowed\n\nSelect All Vendors\n\nSelect All Vendors\n\nAll Consent Allowed\n\nConfirm My Choices\n\n",
    "links": "[{\"link\": \"https://www.cohnreznick.com/\", \"text\": \"\"}, {\"link\": \"https://www.cohnreznick.com/industries/financial-sponsors-and-financial-services/broker-dealers\", \"text\": \"Broker Dealers\"}, {\"link\": \"https://www.cohnreznick.com/industries/financial-sponsors-and-financial-services/independent-sponsors\", \"text\": \"Independent Sponsors\"}, {\"link\": \"https://www.cohnreznick.com/industries/financial-sponsors-and-financial-services/mortgage-lenders\", \"text\": \"Mortgage Lenders\"}, {\"link\": \"https://www.cohnreznick.com/industries/financial-sponsors-and-financial-services/real-estate-funds\", \"text\": \"Real Estate Funds\"}, {\"link\": \"https://www.cohnreznick.com/industries/financial-sponsors-and-financial-services/family-offices\", \"text\": \"Family Offices\"}, {\"link\": \"https://www.cohnreznick.com/industries/financial-sponsors-and-financial-services/hedge-funds\", \"text\": \"Hedge Funds\"}, {\"link\": \"https://www.cohnreznick.com/industries/financial-sponsors-and-financial-services/private-equity\", \"text\": \"Private Equity\"}, {\"link\": \"https://www.cohnreznick.com/industries/financial-sponsors-and-financial-services/sbics\", \"text\": \"Small Business Investment Companies (SBICs)\"}, {\"link\": \"https://www.cohnreznick.com/industries/financial-sponsors-and-financial-services/special-purpose-acquisition-companies\", \"text\": \"Special Purpose Acquisition Companies (SPACs) Services\"}, {\"link\": \"https://www.cohnreznick.com/industries/financial-sponsors-and-financial-services/venture-capital\", \"text\": \"Venture Capital\"}, {\"link\": \"https://www.cohnreznick.com/industries/healthcare/healthcare-performance-transformation\", \"text\": \"Performance Transformation\"}, {\"link\": \"https://www.cohnreznick.com/industries/private-clients/entertainment\", \"text\": \"Film & Entertainment\"}, {\"link\": \"https://www.cohnreznick.com/industries/private-clients/law-firms\", \"text\": \"Law Firms\"}, {\"link\": \"https://www.cohnreznick.com/industries/private-clients/medical-practices\", \"text\": \"Medical Practices\"}, {\"link\": \"https://www.cohnreznick.com/industries/private-clients/private-clients\", \"text\": \"Private Clients\"}, {\"link\": \"https://www.cohnreznick.com/industries/public-sector/government-contracting\", \"text\": \"Government Contracting\"}, {\"link\": \"https://www.cohnreznick.com/industries/public-sector/government\", \"text\": \"Government\"}, {\"link\": \"https://www.cohnreznick.com/industries/public-sector/not-for-profit-and-education\", \"text\": \"Not-for-Profit & Education Real Estate\"}, {\"link\": \"https://www.cohnreznick.com/industries/real-estate/affordable-housing\", \"text\": \"Affordable Housing\"}, {\"link\": \"https://www.cohnreznick.com/industries/real-estate/commercial-real-estate\", \"text\": \"Commercial Real Estate\"}, {\"link\": \"https://www.cohnreznick.com/industries/real-estate/construction\", \"text\": \"Construction\"}, {\"link\": \"https://www.cohnreznick.com/industries/real-estate/opportunity-zones\", \"text\": \"Opportunity Zones\"}, {\"link\": \"https://www.cohnreznick.com/industries/real-estate/tax-credits-advisory\", \"text\": \"Tax Credits\"}, {\"link\": \"https://www.cohnreznick.com/industries/renewable-energy\", \"text\": \"Renewable Energy\"}, {\"link\": \"https://www.cohnreznick.com/industries/renewable-energy\", \"text\": \"renewable-energy\"}, {\"link\": \"https://www.cohnreznick.com/insights/cohnreznick-and-major-league-baseball\", \"text\": \"CohnReznick & Major League Baseball®\"}, {\"link\": \"https://www.cohnreznick.com/insights/c-suite-dashboard\", \"text\": \"The C-Suite Dashboard\"}, {\"link\": \"https://www.cohnreznick.com/insights/esg-awards\", \"text\": \"Gamechangers in ESG Awards\"}, {\"link\": \"https://www.cohnreznick.com/insights/infrastructure\", \"text\": \"Infrastructure Resource Center\"}, {\"link\": \"https://www.cohnreznick.com/insights/real-estate-movement\", \"text\": \"Real Estate Movement\"}, {\"link\": \"https://www.cohnreznick.com/services/advisory/infrastructure\", \"text\": \"Learn more about our infrastructure advisory services\"}, {\"link\": \"https://www.cohnreznick.com/people/anton-cohen\", \"text\": \"\"}, {\"link\": \"https://www.cohnreznick.com/people/anton-cohen\", \"text\": \"\"}, {\"link\": \"https://www.cohnreznick.com/industries/renewable-energy/greenhouse-gas-reduction-fund-advisory\", \"text\": \"\"}, {\"link\": \"https://www.cohnreznick.com/services/accounting-and-assurance/lease-accounting\", \"text\": \"\"}, {\"link\": \"https://www.cohnreznick.com/services/accounting-and-assurance/accounting-services\", \"text\": \"\"}, {\"link\": \"https://www.cohnreznick.com/services/accounting-and-assurance/attest-and-audit\", \"text\": \"\"}, {\"link\": \"https://www.cohnreznick.com/services/tax/federal-tax\", \"text\": \"\"}, {\"link\": \"https://www.cohnreznick.com/services/tax/tax-credits\", \"text\": \"\"}, {\"link\": \"https://www.cohnreznick.com/services/advisory/valuation\", \"text\": \"\"}, {\"link\": \"https://www.cohnreznick.com/services/advisory/infrastructure\", \"text\": \"\"}, {\"link\": \"https://www.cohnreznick.com/services/tax/esg-tax-equity-investor\", \"text\": \"\"}, {\"link\": \"https://www.cohnreznick.com/subscription\", \"text\": \"\"}, {\"link\": \"https://www.cohnreznick.com/insights/cohnreznick-clients-can-pay-conveniently-securely-paytrace\", \"text\": \"Online Payments\"}, {\"link\": \"https://www.cohnreznick.com/services/affiliated-companies\", \"text\": \"Affiliated Companies\"}, {\"link\": \"https://www.cohnreznick.com/about/terms-of-use\", \"text\": \"Terms of Use & Disclosures\"}, {\"link\": \"https://www.cohnreznick.com/about/privacy-policy\", \"text\": \"Privacy Policy\"}, {\"link\": \"https://www.cohnreznick.com/accessibility-statement\", \"text\": \"Accessibility\"}]",
    "priceAndPlans": "Error: Timeout 30000ms exceeded. =========================== logs\n=========================== navigating to\n\"http://web.archive.org/web/20231220145301/https://www.cohnreznick.com/\",\nwaiting until \"load\"\n============================================================\n\n"
}