{
    "summary": "Manage Cookie Consent\n\nWe use cookies to improve your experience on the Leo Berwick website.\n\nFunctional Functional Always active\n\nThe technical storage or access is strictly necessary for the legitimate\npurpose of enabling the use of a specific service explicitly requested by the\nsubscriber or user, or for the sole purpose of carrying out the transmission\nof a communication over an electronic communications network.\n\nPreferences Preferences\n\nThe technical storage or access is necessary for the legitimate purpose of\nstoring preferences that are not requested by the subscriber or user.\n\nStatistics Statistics\n\nThe technical storage or access that is used exclusively for statistical\npurposes. The technical storage or access that is used exclusively for\nanonymous statistical purposes. Without a subpoena, voluntary compliance on\nthe part of your Internet Service Provider, or additional records from a third\nparty, information stored or retrieved for this purpose alone cannot usually\nbe used to identify you.\n\nMarketing Marketing\n\nThe technical storage or access is required to create user profiles to send\nadvertising, or to track the user on a website or across several websites for\nsimilar marketing purposes.\n\nManage options Manage services Manage {vendor_count} vendors Read more about\nthese purposes\n\nAccept Deny View preferences Save preferences View preferences\n\nPrivacy Notice {title}\n\n  * About\n    * About Leo Berwick\n    * Team\n  * Expertise\n    * Infrastructure\n    * Renewables\n    * Private Equity\n  * Services\n    * Buy-Side\n    * Sell-Side\n    * Tax Modeling\n    * Tax Insurance\n    * FIRPTA\n    * Post-Closing\n    * Property Tax Services\n  * Join Our Team\n  * News & Insights\n  * Store\n  * Contact\n\nSelect Page\n\n  * About\n    * About Leo Berwick\n    * Team\n  * Expertise\n    * Infrastructure\n    * Renewables\n    * Private Equity\n  * Services\n    * Buy-Side\n    * Sell-Side\n    * Tax Modeling\n    * Tax Insurance\n    * FIRPTA\n    * Post-Closing\n    * Property Tax Services\n  * Join Our Team\n  * News & Insights\n  * Store\n  * Contact\n\n# Renewable Energy & Energy Transition Tax Services\n\n## Move Fast. Stay Efficient. Get Results.\n\nLeo Berwick is a pure-play, M&A tax advisory firm with the capability to serve\nas a holistic transaction advisor on any energy transtion and renewables deal.\nWe’ve assisted our clients with transactions as small as $50mn and as large as\n$3bn, providing bespoke tax advice and a personal relationship you can be\nconfident in. Our approach is simple – provide our clients with practical\nadvice that considers their economic goals, all without hassle and red tape.\nLeo Berwick can assist at any point in a renewable deal or portfolio lifecycle\nand our service offerings and depth of expertise continue to grow at an\nincredible pace.\n\n## How Leo Berwick can assist.\n\n#### Bid-Stage\n\n  * LOI review​\n  * Tax due diligence​\n  * Develop/finalize tax model​\n  * Tax structuring​\n  * FIRPTA analysis\n  * Review legal agreements\n\n#### Portfolio & Pipeline Development\n\n  * Portfolio & fund level tax structuring\n  * Prevailing wage & apprenticeship services\n  * Cost segregation, valuation, and transfer pricing\n  * Tax compliance\n  * Tracking Model Maintenance\n  * Tax ownership analysis\n  * Property tax\n\n#### Tax Credits\n\n  * Tax credit qualification\n  * Tax credit transferability & diligence\n  * Tax credit-related financial accounting advisory\n\n#### Tax Insurance\n\n  * Overview\n  * Assembling tax insurance submissions for optimal coverage and lower premiums\n  * Comprehensive support through all stages of the tax insurance process\n\n#### Sell-Side Services\n\n  * Overview\n  * LOI review\n  * Sell-side due diligence\n  * Exit tax structuring\n  * Review legal agreements\n\n### Portfolio and Pipeline Development Services\n\n### Cost Segregation, Valuation, and Transfer Pricing\n\nWe provide cost segregation services to support the allocation of project\ncosts for investment tax credit and tax depreciation purposes. Additionally,\nwe can provide valuation services, including appraisals, to support project\nlifecycle, production tax credit project repowers, development fee mark-ups\nand value maximization strategies.\n\nTransfer pricing support can be provided to support development fee\nstructures, purchase and sale agreements, shareholder loans, O&M, and EPC\npricing and terms.\n\n### Property Tax\n\nLeo Berwick has the complex-industrial property tax expertise to provide\nguidance on the future tax implications of a transaction, new asset\ndevelopment, and ongoing operations. Property tax is administered on a state\nand local level and assessment methods used vary based on the geographic area.\nOur property tax team understands these nuances as well as the renewables\nindustry and we will work with you to provide clear guidance on your\ninvestments. We can work with our clients to classify assets appropriately for\nthe filling of the first property tax rendition and this often includes\nworking with the government assessors to obtain the most advantageous\nvaluations.\n\nWe are specialists in property tax modeling. We can create the property tax\nmodel or we can review the property tax assumptions and calculations within\nyour current model.\n\nProperty tax credits and incentives are a critical part of renewable projects.\nLeo Berwick can evaluate current PILOT’s and abatements. We can also assist in\nthe negotiations of new credits and incentives including tax increment\nfinancing, abatements and Fee-in-Lieu of Payments (FILOT).\n\nWe have extensive experience in multi-state property tax appeals. We can\nevaluate your current asset portfolio and identify property tax savings and\nrefund opportunities. This can include teaming with our cost segregation and\nvaluation specialists to support property tax values.\n\nOur team can work with you to build a full suite of post-close property tax\nservices including property tax compliance, controversy, and audit defense.\nThis can include annual updates to models and track property tax changes due\nto capex spend or rate changes during the project holding period.\n\n### Sales and Use Tax Recovery\n\nWhile there are many exemptions that are available for sales and use tax that\napply in the renewables space, we find that many of our clients do not have\nthe expertise and/or the resources to properly identify these opportunities.\nBy leveraging our team of sales and use tax experts with renewable and\nindustry expertise, we are able to review development costs and ongoing\noperational spend for sales and use tax refund opportunities. Given that the\nsales tax rate in many jurisdictions exceeds 8%, this can often result in\nsignificant cash savings and increased EBITDA.\n\n### Tax Credit Service\n\n### Tax Credit Qualification\n\nWe provide formal tax opinions, tax memoranda and ad-hoc advice in connection\nwith the determination of federal incentives that may be available across\nmyriad technologies under the following statutes::  \ni. Section 45, 48, 45Y, and 48E investment and production credits;\n\n  1. Section 45X and 48C manufacturing and production credits;\n  2. Section 45Q carbon oxide sequestration credit;\n  3. Section 45Z clean fuel production tax credit; and\n  4. Section 45V clean hydrogen production credit.\n\nWe prepare documentation, processes, and calculations to support 1) assertions\nof compliance with the prevailing wage and apprenticeship requirements 2) the\navailability of various federal tax credit “adders” available in connection\nwith energy and low-income communities, as well as domestic content 3) placed\nin service dates for tax depreciation and credit purposes and 4) start of\nconstruction analyses and 5) tax “repower” opinions for production tax credit\nprojects .\n\n### Tax Credit Transferability & Diligence\n\nWe assist clients with navigating the tax credit transferability rules\nintroduced under the Inflation Reduction Act, including the registration and\ntax reporting requirements included in proposed regulations.  \nFor potential credit purchasers, we assist with buy-side tax credit due\ndiligence, purchase and sale agreement review (including the review of buyer\ntax indemnities), and tax-capacity modeling (including consideration of CAMT,\nBEAT, and Pillar 2)\n\nFor potential credit sellers or brokers we can provide sell-side diligence\nservices, including the navigation of proposed sale requirements and\nreporting. In certain circumstances, our team can also provide limited tax\ncredit placement and sourcing support.\n\nFor tax credit insurers, we provide tax advisory to support underwriting\npolicies that backstop credit recapture or other events that might reduce a\nproject’s overall after-tax value.\n\n### Prevailing Wage & Apprenticeship\n\nIn connection with the prevailing wage and apprenticeship requirements\nestablished for various of the federal tax credit incentives, we provide 1)\nprocess design to capture and document compliance 2) ongoing compliance and\ntracking services 3) memoranda detailing client processes and procedures and\nour view as to the adequacy of those processes and procedures in fulfilling\nthese requirements (often in connection with sell-side diligence services) and\n4) buy-side diligence services in connection with the adequacy of a target’s\nattendant procedures.\n\n### Tax Ownership Analysis\n\nWe provide tax opinions, memoranda and ad-hoc advice to support assertions of\ntax ownership in complex financing and ownership structures. At Leo Berwick,\nwe’re familiar with identifying and designing complex tax ownership structures\nto drive the tax outcome you expect. Our team has a breadth of knowledge in\ncomplex lease and financing arrangements that often present questions\nregarding tax ownership. We have assisted developers and private equity backed\nplatforms navigate these issues to ensure that the tax credit and other tax\nbenefit being obtained as part of the transaction are appropriately allocated\nand that economic objectives are realized.\n\n### Tax credit-related Financial Accounting Advisory Services\n\nWe provide financial accounting advisory services for those mechanisms\ntypically attendant to tax credit monetization transactions including 1)\nhypothetical liquidation at book value (HLBV) and Proportional Amortization\nMethod (PAM) for tax equity transactions and 2) buyer and seller reporter for\nthe purchase and sale of credits under Code section 6418.\n\n### Recent Articles / Presentations\n\n\n\n##  Insights into the Advanced Manufacturing Production Tax Credit – Filling\nin the Blanks\n\nLast week, the Treasury released proposed regulations (the “Proposed\nRegulations”) that provide additional clarity around the energy manufacturing\ncredits under the Advanced Manufacturing and Production (“AMP”) credit\ncontained in section 45X of the Internal Revenue...\n\n##  Canadian Clean Technology Investment Tax Credit\n\nOn November 30, 2023, Deputy Prime Minister and Minister of Finance Chrystia\nFreeland tabled Bill C-59 in the House of Commons (the “Bill”). The Bill\nincludes legislation to implement the new Clean Technology Investment Tax\nCredit (“ITC”) first introduced in Budget...\n\n##  Leo Berwick Tax Alert on New Investment Tax Credit Regulations\n\nOn Friday, November 17, 2023, the Treasury issued Proposed Regulations in\nconnection with energy property. With some exceptions, these rules are\nintended to apply to property that is placed into service after December 31,\n2022. There are a number of items presented...\n\n#### Let’s work together.\n\nYou want an M&A tax expert who gets it. A commercially minded expert who\nunderstands deals, not just taxes. A partner who shares your drive for\nminimizing risk, maximizing value, and accelerating returns.\n\nThat’s Leo Berwick. The first call you make for any deal.\n\nGet In Touch\n\n  * Follow\n\n©2023 Leo Berwick. All rights reserved.  \nPrivacy Notice | Terms of Use\n\n#### Quick Links\n\nTeam  \nJoin Our Team  \nNews & Insights  \nContact\n\nManage consent\n\n╳\n\n",
    "links": "[{\"link\": \"https://www.leoberwick.com/renewables/#cmplz-manage-consent-container\", \"text\": \"Manage options\"}, {\"link\": \"https://www.leoberwick.com/renewables/#cmplz-cookies-overview\", \"text\": \"Manage services\"}, {\"link\": \"https://www.leoberwick.com/renewables/#cmplz-tcf-wrapper\", \"text\": \"Manage {vendor_count} vendors\"}, {\"link\": \"https://www.leoberwick.com/renewables/#cmplz-manage-consent-container\", \"text\": \"View preferences\"}, {\"link\": \"https://www.leoberwick.com/renewables/\", \"text\": \"\"}, {\"link\": \"https://www.leoberwick.com/renewables/\", \"text\": \"Renewables\"}, {\"link\": \"https://www.leoberwick.com/renewables/\", \"text\": \"Renewables\"}, {\"link\": \"https://www.leoberwick.com/services/buy-side/\", \"text\": \"Tax due diligence​\"}, {\"link\": \"https://www.leoberwick.com/services/modeling/\", \"text\": \"Develop/finalize tax model​\"}, {\"link\": \"https://www.leoberwick.com/services/buy-side/\", \"text\": \"Tax structuring​\"}, {\"link\": \"https://www.leoberwick.com/firpta/\", \"text\": \"FIRPTA analysis\"}, {\"link\": \"https://www.leoberwick.com/services/modeling/#tracking-model-maintenance\", \"text\": \"Tracking Model Maintenance\"}, {\"link\": \"https://www.leoberwick.com/services/tax-insurance-services/\", \"text\": \"Overview\"}, {\"link\": \"https://www.leoberwick.com/services/sell-side/\", \"text\": \"Overview\"}, {\"link\": \"https://www.leoberwick.com/services/sell-side/\", \"text\": \"Sell-side due diligence\"}, {\"link\": \"https://www.leoberwick.com/contact\", \"text\": \"Get In Touch\"}, {\"link\": \"https://www.leoberwick.com/privacy-notice\", \"text\": \"Privacy Notice\"}, {\"link\": \"https://www.leoberwick.com/terms-of-use\", \"text\": \"Terms of Use\"}, {\"link\": \"https://www.leoberwick.com/team\", \"text\": \"Team\"}, {\"link\": \"https://www.leoberwick.com/careers\", \"text\": \"Join Our Team\"}, {\"link\": \"https://www.leoberwick.com/blog\", \"text\": \"News & Insights\"}, {\"link\": \"https://www.leoberwick.com/contact\", \"text\": \"Contact\"}]",
    "priceAndPlans": "Error: Timeout 30000ms exceeded. =========================== logs\n=========================== navigating to\n\"http://web.archive.org/web/20240110181846/https://www.leoberwick.com/\",\nwaiting until \"load\"\n============================================================\n\n"
}