{
    "summary": "Mobirise Website Builder v4.12.0\n\n  * Home\n  * Tax Credits\n  * Project Finance\n  * About Us\n\n513-762-3692\n\nfree site builder\n\n##  \nTax Credit Advisory  \n\n### River Ridge provides technical and financial advisory services to:  \n\n  \n\n  * **Corporations** seeking to make tax-advantaged investments\n  * **Projects sponsors** seeking to utilize federal and state tax credit financing as part of their capital structure\n\n### Our expertise includes the following products\n\n  * New Markets Tax Credits \n  * Investment Tax Credits\n  * Historic Tax Credits\n\n#### **New Markets Tax Credits**\n\nRiver Ridge has robust experience with a diverse mix of project types, and\nmany of our clients’ projects have benefited from additional sources of\nfederal, state, or local subsidy capital to leverage or complement the NMTC\nbenefit. We maintain a broad, national network of industry relationships and\nhave earned high regard amongst Community Development Entities (“CDEs”),\ninvestors, and their legal counsel as a result of the value we provide to our\nclients. Since 2010, we have consulted on more than $500 million of NMTC\ntransactions.  \n  \n**For project sponsors, River Ridge:**  \n  \n **  •**  Provides technical expertise related to financial structuring and\nbenefit analysis  \n**  •  **Sources and arranges tax credit allocation from CDEs and equity\ninvestment from tax credit investors  \n  **•  **Manages the entire transaction closing process, including\n    coordination of due diligence, documentation requirements, and fund flows  \n  **•  **rovides post-closing support during the NMTC compliance period  \n  \n**For NMTC investors, River Ridge offers:**  \n  \n  **•** Transaction identification, origination, and due diligence  \n  **•** Structuring and underwriting NMTC investments  \n  **•** Negotiating and closing of investments, including oversight and\n    management of all legal and accounting aspects  \n  **•** Coordinating the financial reporting, accounting, and tax requirements\n    for investment  \n**  •  **Oversight of project’s ongoing programmatic compliance  \n\n#### **Investment Tax Credits**\n\nRiver Ridge provides advisory services to investors, developers, EPCs,\ngovernmental organizations, and non-profits on renewable energy projects. Our\nadvisory services and financing solutions focus on the development of solar,\nwind, fuel cells, and other energy assets.  \n  \n**For renewable energy project investors, River Ridge offers:** **  \n**  \n  **•  **Transaction identification, origination, and due diligence  \n  **•  **Structuring and underwriting ITC transaction investments  \n  **•  **Negotiating and closing of ITC investments, including oversight and\n    management of all legal and accounting aspects  \n  **•  **Coordinating the financial reporting, accounting, and tax\n    requirements for investment  \n**  •  **Oversight of project’s ongoing programmatic compliance  \n  \n**For project sponsors, we offer:**  \n  \n  **•  **Early stage project assessment  \n  **•  **Analysis, underwriting and structuring of ITC financing  \n  **•  **Sourcing tax equity  \n  **•  **Sourcing non-tax credit equity and debt  \n  **•  **Negotiating and closing ITC investments, including oversight and\n    management of entire transaction closing process and legal and accounting\n    aspects  \n\n#### **Historic Tax Credits**\n\nThe Federal Historic Rehabilitation Tax Credit (HTC) program allows building\nowners or third-party investors to receive a credit against Federal income\ntaxes for the rehabilitation of qualifying historic properties. A 20% credit\nis available for the substantial rehabilitation of commercial, industrial or\nresidential buildings that are certified as historic. The HTC totals 20% of\nthe “qualified rehabilitation expenses” of the project and is claimed over a\nfive-year compliance period.  \n  \n**Our HTC experience** ranges from large multi-faceted mixed-use and\ncommercial projects to smaller HTC transactions twinned with New Markets Tax\nCredits and/or other state and local financial incentives. For project\nsponsors, River Ridge provides pre-development, structuring, and closing\nexecution services, including:  \n  \n  **•  **Review of historic qualification/status  \n  **•  **Assessment of project viability and historic pre-development\n    benchmarks  \n  **•  **Provision of technical expertise related to financial structuring and\n    benefit analysis  \n**  •  **Structuring and underwriting HTC investments  \n**  •  **Negotiating and closing HTC investments, including oversight and\nmanagement of all legal and accounting aspects  \n**  •  **Supporting the sponsor with ongoing programmatic compliance  \n\n####  MOBILE FRIENDLY\n\nNo special actions required, all sites you make with Mobirise are mobile-\nfriendly. You don't have to create a special mobile version of your site, it\nwill adapt automagically.\n\n####  IT'S EASY AND SIMPLE\n\nCut down the development time with drag-and-drop website builder. Drop the\nblocks into the page, edit content inline and publish - no technical skills\nrequired.\n\n####  TRENDY WEBSITE BLOCKS\n\nChoose from the large selection pre-made blocks - full-screen intro, bootstrap\ncarousel, slider, responsive image gallery with, parallax scrolling, sticky\nheader and more.\n\nVIEW INFORMATION\n\n## YOU MIGHT ALSO BE INTERESTED IN PROJECT FINANCE ADVISORY\n\n#####  Headquarters\n\nCincinnati, Ohio\n\n#####  Contacts\n\nEmail: info@riverridgecap.com  \nPhone: (513) 762-3692  \n\n#####  Links\n\nTax Credit Advisory  \nProject Finance Advisory  \nAbout Us  \nLinked In  \n\n* * *\n\n© Copyright River Ridge Capital Advisors - All Rights Reserved\n\n__\n\n",
    "links": "[]"
}