{
    "summary": "  * 800.223.2273\n  * 100 Years of Cleveland Clinic\n  * MyChart\n  * Need Help?\n  * Giving\n  * Careers\n  * Search\n\n  * ClevelandClinic.org\n  * Find A Doctor\n  * Locations & Directions\n  * Patients & Visitors\n  * Health Library\n  * Institutes & Departments\n  * Appointments\n\nHome/\n\nHealth Library/\n\nTreatments & Procedures/\n\nKock Pouch\n\nAdvertisementAdvertisement\n\nAdvertisement\n\n# Kock Pouch\n\nIf you need to have an ileostomy, you might want to have a Kock pouch with it.\nThe K-pouch is an ileal pouch that attaches to your stoma on the inside.\nInstead of an ileostomy bag, the Kock pouch collects your poop inside your\nbody until you’re ready to drain it. You can drain it into the toilet by\ninserting a catheter into your stoma.\n\nContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and\nOutlookAdditional Common Questions\n\nContentsArrow DownOverviewProcedure DetailsRisks / BenefitsRecovery and\nOutlookAdditional Common Questions\n\n## Overview\n\n### What is a Kock pouch (K-pouch)?\n\nThe Kock pouch, or K-pouch, is a type of ileal pouch that you can have with an\nileostomy. You might need an ileostomy if you have to have your large\nintestine removed (colectomy).\n\nAn ileostomy redirects the end of your small intestine, called the ileum, to\nan opening (stoma) in your abdomen so that you can pass waste from your body.\nWith a stoma, you need a pouch to collect waste.\n\nIf you have a standard (Brooke) ileostomy, you’ll use an external pouch\n(ileostomy bag) that attaches to your stoma to collect your waste (poop).\nYou’ll remove the pouch to empty it throughout the day.\n\nThe Kock pouch is an alternative, internal pouch that your surgeon can\nconstruct to hold your poop inside your body. It attaches to your stoma, and\nyou can empty it at your convenience through a tube.\n\n#### What is a Kock pouch used for?\n\nThe Kock pouch is an option for people who have to have a permanent ileostomy\nbut don’t want to use an external ileostomy bag. It offers the ability to hold\nyour poop inside your body and empty it at will.\n\nAn ileostomy with a Kock pouch is also called a continence ileostomy. That’s\nbecause it prevents the fecal incontinence that usually comes with a stoma —\npoop coming out any time.\n\n#### What is a urinary Kock pouch?\n\nThe Kock pouch that we use as a fecal continence pouch today was originally\ndesigned as a urinary continence pouch. It was used to replace your bladder if\nyou had to have your bladder removed.\n\nA urostomy Kock pouch holds your urine and allows you to drain it through a\ncatheter inserted into a stoma. It’s still in use, although many newer urinary\nreconstruction and diversion models exist today.\n\n##### Why is it called a Kock pouch?\n\nThe Kock pouch is named for Nils Kock, the surgeon who invented it.\n\nAdvertisement\n\nCleveland Clinic is a non-profit academic medical center. Advertising on our\nsite helps support our mission. We do not endorse non-Cleveland Clinic\nproducts or services. Policy\n\n## Procedure Details\n\n### How do surgeons create a Kock pouch ileostomy?\n\nYour surgeon can create your Kock pouch at the same time they create your\nileostomy, or they can create it later in a separate surgery. You can have a\nKock pouch procedure any time after an ileostomy.\n\nTo construct the pouch, your surgeon will:\n\n  * Measure out about four loops at the end of your small intestine (about 18 inches) and fold this end up against the upper part of the intestine in a long “U” shape.\n  * Open up the intestine in the middle of the “U” and stitch the edges of the lining together, leaving the last few inches unconnected. This creates a pouch with a “tail” at the end.\n  * Use the tail to create a one-way valve at the opening of the pouch. They do this by folding the tissue to create a flap and securing it with stitches. The flap closes when the pouch fills up.\n  * Attach the tail” with the valve to the inside of your stoma. They’ll test the valve to make sure that fluids, solids and gases don’t leak through the opening.\n\n#### What happens after the Kock pouch procedure?\n\nAfter K-pouch surgery, you’ll recover in the hospital for three to five days.\nDuring this time, you’ll have various tubes placed in different parts of your\nbody to help you recover. These may include:\n\n  * IV fluids.\n  * IV nutrition.\n  * Wound drains.\n  * Urinary catheter.\n  * Pain pump.\n\nThe catheter in your stoma will stay in place for several weeks to drain\nfluids from your Kock pouch wound. A nurse will instruct you on caring for\nyour catheter until a healthcare provider removes it.\n\n#### How long does the recovery take?\n\nYou’ll spend a few weeks recovering at home before the wound drain can be\nremoved. After that, a nurse will teach you how to drain your K-pouch with the\nregular catheter you’ll use from now on.\n\nYou’ll have to drain the pouch about eight times a day in the beginning. After\na few months, when your pouch has fully healed and gradually enlarged, you’ll\nonly need to drain it two to four times a day.\n\nCare at Cleveland Clinic\n\nDigestive Care\n\nMake an Appointment\n\n## Risks / Benefits\n\n### What are the benefits of the Kock pouch?\n\nThe primary advantages of a continence ileostomy over a standard ileostomy\nare:\n\n  * You don’t have to wear or manage an ileostomy bag.\n  * You can have a more discreet stoma, covered by a gauze pad or bandage.\n  * You can empty your bowels when you choose, without leaking throughout the day.\n  * It’s easier to sleep with, and you don’t have to empty it at night.\n\nAdvertisement\n\n### What are the potential complications of the Kock pouch?\n\nPossible complications include:\n\n  *  **Valve complications**. Sometimes the valve your surgeon created to keep your pouch closed slips over time, which can cause leaking. The leaked stool can irritate your skin. You might need revision surgery to fix it. A slipped flap can also obstruct the opening of the pouch and make it hard to intubate and drain it. A total small bowel obstruction would be an emergency.\n  *  **Fistulas**. A fistula is an inappropriate tunnel that develops between parts of your body. Fistulas can develop from your pouch to your skin or other organs when the tissues between them are worn away. This usually happens because of persistent inflammation or loss of blood supply to the tissues. A fistula from your pouch can cause pain, infection and other complications.\n  *  **Pouchitis**. Pouchitis is irritation and inflammation inside your pouch, usually due to an infection. It’s common with all types of ileal pouches. Most of the time, antibiotics can quickly relieve it. Rarely, some people develop chronic pouchitis. If this happens, the pouch may fail.\n  *  **Stricture/stenosis**. Sometimes scar tissue at the opening of the pouch causes the opening to narrow (stricture or stenosis). This can make it hard to drain your pouch. If you can’t get your catheter in, you or a healthcare provider might have to stretch it using a dilator tool.\n  *  **Parastomal hernia**. This type of hernia occurs when a loop of your intestine emerges through your stoma. A hernia can grow over time and may block the stoma’s opening. This would require revision surgery. The opening could also pinch your intestine, creating a blockage.\n  *  **Short bowel syndrome**. If you have to have revision surgery for complications with your K-pouch — especially if your K-pouch was a revision surgery itself after another type of pouch failed — you run the risk of not having enough small bowel left after these surgeries. If you don’t have enough bowel, you might have difficulties digesting and absorbing enough nutrients.\n\n## Recovery and Outlook\n\n### What is the outlook with a Kock pouch?\n\nMost people choose the Kock pouch to make their lives easier, and, by design,\nit does. Whether you’re converting from a standard ileostomy or a failed\nJ-pouch, the K-pouch is an answer to several problems.\n\nBut the Kock pouch does have a higher rate of complications that require\nrevision surgery than other pouches do — up to 30%. This is mostly due to\nvalve failures, which are unique to the Koch pouch.\n\nDespite these setbacks, most people report improved quality of life with the\nK-pouch. You’ll discuss your personal risks, alternatives and health\nthoroughly with your healthcare provider before going forward.\n\n#### Should I adjust my diet while living with a K-pouch?\n\nA balanced, nutritious diet will help you restore your overall health. You may\nhave developed limited eating habits in the past to manage your chronic\ndisease. Now you can start to broaden your diet again.\n\nA registered dietitian can help you develop a personalized diet that meets\nyour nutritional and hydration needs. If your stool is too thick or too runny,\ndietary adjustments can help with this, too.\n\nAdvertisement\n\n## Additional Common Questions\n\n### What is the difference between the K-pouch vs. J-pouch?\n\nThe K-pouch was the first ileal pouch that was introduced for people having\nileostomy surgery. It offered people living with a permanent ileostomy a way\nto maintain some control over their bowel movements.\n\nThe J-pouch is a newer breed of ileal pouch that offers an alternative to\nhaving an ileostomy at all. This ileal pouch attaches to your anal canal so\nyou can poop the old-fashioned way, without a stoma.\n\nMost people today who have to have their whole colon and rectum removed (total\nproctocolectomy) prefer the J-pouch. But for the J-pouch to work, you have to\nhave a fully functioning anus (butthole).\n\nThe K-pouch remains an alternative for people who can’t have a “restorative”\nproctocolectomy that reconnects their bowel to their anus. It’s also a backup\noption if your J-pouch fails due to complications.\n\n#### What is the difference between the Koch pouch and ileostomy?\n\nA Kock pouch is an option that you can have with an end ileostomy. It’s the\nonly ileal pouch that works with a permanent ileostomy. An ileostomy with a\nKock pouch is also called a continence ileostomy.\n\n **A note from Cleveland Clinic**\n\nIf you’re contemplating a Kock pouch, you’ve already made the bigger decision\nto have a major bowel resection. This should bring relief from the chronic\ndisease that made your intestine unusable.\n\nWhile proctocolectomy might save your life, the Kock pouch exists to improve\nyour quality of life. When pooping is easier, everything is easier, and you\ncan begin to reclaim more of your favorite activities.\n\nMedically Reviewed\n\nLast reviewed by a Cleveland Clinic medical professional on 05/18/2023.\n\nLearn more about our editorial process.\n\n#### References\n\nAdvertisement\n\nCleveland Clinic is a non-profit academic medical center. Advertising on our\nsite helps support our mission. We do not endorse non-Cleveland Clinic\nproducts or services. Policy\n\nCare at Cleveland Clinic\n\nDigestive Care\n\nMake an Appointment\n\nAd\n\nAdvertisementAdvertisement\n\nAdvertisement\n\nAppointments 216.444.7000\n\nAppointments & Locations\n\nRequest an Appointment\n\nContact Us\n\nFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchat\n\n##### Actions\n\nAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive\nto Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual\nSecond OpinionsVirtual Visits\n\n##### Blog, News & Apps\n\nConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChart\n\n##### About Cleveland Clinic\n\n100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice\nof Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity\nCommitmentCareersFor EmployeesResources for Medical Professionals\n\n##### Site Information & Policies\n\nSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint &\nLicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-\nDiscrimination Notice\n\n9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2024 Cleveland\nClinic. All Rights Reserved.\n\n",
    "links": "[{\"link\": \"mailto:?subject=Cleveland Clinic - Kock Pouch&body=https://my.clevelandclinic.org/health/treatments/24996-kock-pouch\", \"text\": \"\"}]",
    "priceAndPlans": "Error: Timeout 30000ms exceeded. =========================== logs\n=========================== navigating to\n\"http://web.archive.org/web/20240119050429/https://my.clevelandclinic.org/\",\nwaiting until \"load\"\n============================================================\n\n"
}