{
    "summary": "  * 570-560-1016 \n  * stomaplex@gmail.com \n\n  *   * Account\n    * Sign in\n    * Register\n\nStomaplex  \nCall: 570-560-1016  \nFax: 570-651-9361\n\n0\n\n$0.00 __\n\nStomaplex\n\n0\n\nSearch\n\nCall Us\n\nSign in / Register\n\n  * Stoma Guards\n  * Ostomy Belts\n  * The Equalizer\n  * How to Wear\n  * Veterans\n  * Size Chart\n  * Reviews\n  * Contact Us\n  * Shipping & Returns\n\nSearch\n\nCall Us\n\nSign in / Register\n\n  * Stoma Guards\n  * Ostomy Belts\n  * The Equalizer\n  * How to Wear\n  * Veterans\n  * Size Chart\n  * Reviews\n  * Contact Us\n  * Shipping & Returns\n\n#  Stoma Guard\n\n## Ostomy Protection\n\nStomaplex provides the most customizable stoma guard and ostomy belt to\nprotect the stoma of a colostomy, ileostomy, or urostomy.\n\n## Wear Normal Clothes\n\nTuck your shirt into your pants and feel confident that the flow will not be\nrestricted.\n\n## Seatbelt Safety\n\nAlways wear you seatbelt. Now you can with a Stomaplex stoma guard.\n\n## Stay Active / Be Confident\n\nStay active to heal and gain strength. Protect your ostomy and prevent\nhernias.\n\n  \n\n* * *\n\nShop Now\n\n## WOCN Ostomy Belt Review\n\n**Stomaplex makes a protector** I, and many patients, have been waiting for –\nfinally someone designed a products that I can recommend to my patients in\nneed of protection. There are many reasons why patients should consider using\nthis ostomy belt, the most important being the safety and security it\nprovides. Of course, the number one reason is the ability to safely wear a\nseatbelt. Recommended for security and support.\n\n##### **Reviewed by, Pearl R. Harmany, BSN, RN, CWOCN**\n\n####  Need Help with Bags and Barriers? Call Convatec 1-800-422-8811\n\n### Customize Your Size\n\n* * *\n\n**Stomaplex guards** are contoured to your shape. The guard can be sized for\nthe depth, the width of the channel, and its overall dimensions. These\nproducts are shaped to allow the output to flow.\n\n## Choose your comfort\n\n##### Choose from three stomaguards and two belts.\n\n* * *\n\n##### Includes Microfiber Belt\n\n###  **Starting at $249.00**\n\n#### Freedom-Guard GTX\n\nThe Freedom-Guard GTX is the original guard. This is our favorite swim belt.\nInside there is a neoprene padding with a nylon covering. This padding is the\nsoftest of the three offered here. The padding cleans and dries quickly.\n\n* * *\n\n##### Includes Microfiber Belt\n\n###  **Starting at $249.00**\n\n#### Freedom-Guard ATX\n\nThe Freedom-Guard ATX is the toughest and most durable stomaguard. The inner\npadding of the guard is an FDA approved rubber. This will not absorb water.\nRecommended ostomy protection for sports and athletics.\n\n* * *\n\n##### Includes Microfiber Belt\n\n###  **Starting at $299.00**\n\n#### Pure-Comfort ATX\n\nThe Pure-Comfort ATX is the thinnest and most comfortable guard. Inside there\nis a padding made with leather. This guard is the thinnest and the lightest in\nweight. We recommend this product for those who need the lowest profile.\n\n* * *\n\n##### Stop Ostomy Leaks\n\n###  **Starting at $24.00**\n\n#### The Equalizer\n\n4 Sizes. Washable and Reusable. Press and hold for 10-20 seconds to create a\nbetter bond to your skin.\n\n* * *\n\n#### 2-Strap Support Belt: Ostomy Belt\n\n###  **Only $50.00**\n\n##### Guard not included\n\n3.0\" Wide  \nMade with a microfiber inner surface for maximum comfort. The dual strap\ndesign allows for greater adjustment. This belt is so comfortable, you'll\nforget you are wearing it. It is quick drying and great for athletics.\nDesigned to keep bag in the vertical direction for better flow.\n\n* * *\n\n#### 1-Strap Hernia Belt: Ostomy Wrap\n\n###  **Only $65.00**\n\n##### Guard not included\n\n4.5\" Wide  \nMade with a microfiber inner surface for maximum comfort. This belt has a\nsingle strap design. The tension allows for maximum compression. It is so\ncomfortable, you'll forget that you have it on. Wear it to help prevent\nhernias.\n\n* * *\n\n## These guards include your choice of microfiber belt.\n\n### Freedom-Guard GTX\n\nThe Freedom-Guard GTX has the softest padding of all Stomaplex. The outside\nsurface is covered in FDA approved rubber with a neoprene pad. This\ncombination creates a soft comfortable product. This Stomaplex comes clean and\ndries in minutes. The Freedom-Guard GTX is a great multi-purpose protector. It\nis soft, easy to clean, and very comfortable.\n\n### Freedom-Guard ATX\n\nThe Freedom-Guard ATX is our most durable product. The outside surface is\ncovered in an FDA approved rubber with same FDA approved rubber for an inner\npad. Stomaplex recommends this for anyone who is interested in a products that\nis easiest to clean. This is our favorite guard for sports.\n\n### Pure-Comfort ATX\n\nThe Pure-Comfort ATX is the finest of all Stomaplex. The outside surface is\ncovered in leather with a leather inner pad. This combination creates the\nthinnest and lightest guard available. Stomaplex recommends this for anyone\nwho is interested in the best there is to offer in stoma protection. This\nproduct is designed for comfort. The thin and light weight materials makes the\nbelt invisible over your ostomy.\n\n### Custom Sizing\n\nCustomize your size and material based on your activity.\n\n### Customer Reviews\n\n##### Backpacking in the Mountains\n\nPaul wears the Freedom-Guard ATX for protection from his backpack while hiking\nin the Canadian mountains.\n\n* * *\n\n### Swimming Review\n\n##### Hike, Bike, Swim\n\nSarah uses Freedom-Guard GTX for protection while swimming.\n\n* * *\n\n  \n\n###  Testimonials\n\nOh my goodness Bob!! Thank you so much! I was able to show the ostomy nurses\nyesterday the products I purchased from you. They were impressed! This morning\nis the first time I'll be able to visit my students since my surgery and give\nthem all the biggest hugs without being nervous about holding my tummy and\nprotecting my stoma! Bless you and your business! Most grateful to you!\n\nVickie (Iowa)\n\nIn spite of the wonderful testimonials you have received, I feel compelled to\nadd one more. For anyone who has an \"outie\" stoma (as I do) right on my belt\nline, the Stoma Guard covers, protects and smooths out my body profile. It's\nso comfortable I hardly know I am wearing it. The Stoma Guard provides the\nultimate in protection, my clothes fit better and I never have to worry about.\nI just enjoy the overall security the Stomaplex Stoma Guard gives me. If\nanyone is concerned about this accessory for their stoma appliance I can only\nsay \"try it, you'll love it!\" Thanks again for inventing such a great product\nthat really does improve the quality of my life,\n\nMike Lord (Vancouver, BC Canada)\n\n\"Bob sent me a Stomaplex Equalizer and once I started using it regularly, I\nrealized I cannot ever go without one. I actually now have 2 just in case I\nforget to pack one if I go somewhere. By not only pressing hard for 30 seconds\nafter you apply the wafer, but also bending the Stomaplex Equalizer and using\nthe sides to press down on every single corner of your wafer around the stoma\n(no matter how your stoma is shaped), the wear time of the wafer easily goes\nup. I think it doubles my wear time without question. Trying to use my fingers\nto press the wafer down, etc just doesn't allow the same sort of equal\npressure. Nor does it allow you to do the extra \"pressing\" from all sides. By\nusing both methods I described, the wear time of the wafer gets DAYS added on.\nI think it is a must have for anyone with an ostomy.\"\n\nAnahita (Maryland)\n\nI recently purchased the Freedom Guard and I LOVE IT! While riding in any\nvehicle, I was wearing a \"donut\" pillow (with a hole in the middle) around my\nstoma to protect it from my seat belt however, the pillow was always shifting\nunder the belt and it never felt secure. Having to bring my \"special\" pillow\ninto different vehicles made me feel exposed as if I was announcing myself as\nan ostomate. If I was driving, I spent as much time fiddling with the pillow\nas I did handling the steering wheel! Not good... The Freedom Guard stays put\non my body - secure and snug - without being too tight or binding on me. I\nlove that I can adjust the soft, comfortable straps for either a looser or\ntighter fit. I literally strap it on and go - and forget about it! One of the\nbest features to me is that I don't have to remove the Freedom-Guard to empty\nmy pouch. I simply push it up higher on my stomach and I'm good to do whatever\nI need to do, then lift and push it back down into place. It's really easy to\nuse. I have also tried another \"guard\" type currently on the market but\nbecause it didn't allow for output like the Freedom-Guard does it created a\nbig mess inside my pouch doubling my clean up time and this made me feel worse\nabout having my ostomy. The Freedom-Guard however allows me to put it on - and\nFORGET about it! I go about my day as usual with no worries. Now that's\nFREEDOM!! Thanks Bob!!\n\nA. Woods (Atlanta, GA)\n\nGot my Freedom Guard and belt yesterday tried it on to verify fit. Today I\nwent to work fully dressed with a belt and shirt tucked in for the first time\nsince my surgery “March 12th”. Wore it all day. Last week I was a sloppy\nPresident walking in with Sweats and shirt out. My wife was not happy with my\nappearance. I do a lot of ATV riding at my partners ranch in Texas “cattle and\nhorses”. In the fall I plan on Scuba Diving in Bermuda and the Stoma guard is\ngoing to make it all happen. You saved me from trying to make something that I\nwould never have the time or ability to create! Thank you so much!\n\nGary (Las Vegas, NV).\n\nI just wanted to let you know how impressed I've been with your product -\nPure-Comfort™ GTX Ostomy Belt & Stoma-Guard. I had an ileostomy in January\nafter being diagnosed with colon cancer and having to deal with colitis the\npast 10 years. After the surgery I have a pretty good size stoma that looks\nlike a downspout. I'm a bulk driver for Staples and deal with breaking down\nand delivering anywhere from 10-15,000 lbs worth of freight every day. I was\nso scared about going back to work that I wouldn't be able to do all the\nphysical activity that I'm used to doing. During my recovery time before\nreturning to work, I did a bunch of research and came upon your product.\nDespite all the testimonials, I was afraid that the product would be bulky,\nbut I decided to give it a try anyways. All that apprehension went away after\nthe first day of using it. I can't thank you enough about how great your\nproduct is. It's so comfortable and durable. It doesn't get in the way and I\ncan work just as hard as I did pre-surgery. It instills a lot of confidence.\nThanks again for helping what seemed like a bad situation in January so much\nbetter. I'll never work without it!\n\nJoe (Connecticut)\n\nI've found some of the most difficult challenges in adapting to a permanent\nileostomy to be the simplest of things, like comfortably wearing normal pants\nor a seatbelt. The Stomaplex belt and guard system has proved extremely\nhelpful in accomplishing those basic tasks and also in restoring my confidence\nand ability to return to many of my previous physical and work activities. I\nhave tried other similar products and believe Stomaplex offers the edge in\ncomfort, fit and low-profile appearance. The belt and guard are extremely well\ndesigned and made of top quality materials. The secure, highly-adjustable fit\nalso keeps my appliance more firmly in place, which has helped reduce skin\nirritation and extend wear time. Service is excellent as well, with quick and\nthorough responses to questions and rapid processing and delivery of orders. I\nrecently purchased my second Stomaplex belt and guard and have also found The\nEqualizer helpful in ensuring good adhesion of the flange. I would highly\nrecommend Stomaplex products to anyone seeking to make living with an ostomy a\nlittle easier.\n\nShawn (Canada)\n\nBob, I received my order and I am liking it a lot.\n\nI have not had a chance to golf with it. So, that is still not answered.\nHowever, practice swings show no sign of hindrance.\n\nWhat I do feel right away is the bag feels more secure and the belt is much\nmore comfortable than the 1\" belts sold by the ostomy companies.\n\nThanks for developing and selling this product.\n\nMichael (New York)\n\nYour guard has changed my mom's life. She had not been able to hardly leave\nthe house due to not being able to wear her normal clothes. Thank you. I do\nappreciate it greatly.\n\nMechelle KY\n\nNice product. Working well for me and provides the confidence to get active\nonce again. Thanks\n\nJohn (MN)\n\nI play golf 3 time a week in the summer. The Guard makes sure when I turn I\ndon't tear of my pouch.\n\nThanks again Tom (OK)\n\nHi Bob just to let you know that I have received my stoma guard ok and I put\nit on straight away and it feels really really great I can't begin to explain\nthe feeling it gives me also I am looking forward to wearing my normal clothes\nagain. I will certainly spread the word over on this side of the pond. Once\nagain cheers .\n\nPatrick (United Kingdom)\n\nAs a C-7 quadriplegic, I am at high risk for getting pressure sores,\nespecially on my bottom. Due to this risk, I generally tend to sleep on\nsomewhere in between my sides/stomach. However when I would do this on my\nright side (the side where my ostomy is), I noticed that I got frequent\nurinary tract infections (UTIs). Many of these UTIs required prescription\nantibiotics to treat me. Also some were so severe that I needed to be\nhospitalized.\n\nOver time I realized that my UTIs were being caused by the fact that when I\nslept on my right side the weight of my body was constricting my stoma, and\nthus preventing the flow of urine from my bladder. This enabled bacteria to\nincrease inside my bladder, often resulting a UTI.\n\nYour Stomaplex stoma guard/belt products shield my stoma from being pressed\nupon and allow free flow of urine from my body. I credit your products (along\nwith drinking more water) with saving my career (I work full-time). Prior to\nusing your products, I was seriously considering retiring from work, or taking\na leave of absence due to the frequency and severity of my UTIs which required\nme to take many sick days, make frequent visits to my doctor, and even be\nhospitalized multiple times (including several stays in the hospital's\nIntensive Care Unit). After I began to use your product, I began to\nimmediately get far fewer and less severe UTIs. I cannot thank you enough!!\n\nEd (Virginia)\n\nI received my guard today. Very comfortable, can finally wear pants and a belt\nagain. Thank You for making such a great product. Look forward to buying more\nproducts as I need them in the future.\n\nBrian (Canada)\n\nI greatly appreciate your engineering and customer service.\n\nDawn (Georgia)\n\n## External Review:\n\n##  Stoma Warrior Reviews The Equalizer\n\nOnce I had the system in place, before I added the click on bag, I would use a\nStomaplex Equalizer! This is a small piece of rubber tubing that I could use\nto apply pressure inside the base plate ring, I would hold it in place for\nabout 20 seconds and it would make a great seal between my skin and the base.\n\nThe Stomaplex Equalizer was the best thing I ever discovered for Fred and,\nalthough expensive in my opinion for what it is, it's worth every penny and\nmore!  \n  \nThe longer you can go between changes, the better for you and your skin, bag\nseals have ingredients in them to promote skin repair and constant changing is\npulling away a layer of skin each time making the site more vulnerable and\nsorer.\n\n### \\- Stoma Warrior.\n\n×\n\nOK\n\n#### Call us\n\n570-560-1016\n\n#### Do you have any questions?\n\nstomaplex@gmail.com\n\nStomaplex LLC 917 1st Avenue Williamsport, PA 17701 USA\n\n#### Subscribe to our newsletter\n\nGet the latest updates on new products and upcoming sales\n\nEmail Address\n\n#### Payments\n\n  *   *   *   *   * \n\n#### Navigate\n\n  * Site Map\n  * \\- \n  * Contact Us\n  * \\- \n  * Shipping and Returns\n  * \\- \n  * WOCN Review\n  * \\- \n  * About Us\n  * \\- \n  * FAQ\n  * \\- \n  * Privacy Policy\n\n#### What is Stomaplex Ostomy Belt?\n\nThe Stomaplex is designed to protect the ostomy. Each belt is designed to\naccept a Stomaplex guard. These belts are available in two styles: 1) Support\nBelt at 3.0\" wide, 2) Hernia Belt at 4.5\" wide. Both are made with comfortable\nmicrofiber. The support belt is designed with 2-straps for greater\nadjustability.\n\nStomaplex protects the stoma from direct impact.  \n  \nWe can help prevent leaks by applying pressure on the appliance. The pressure\nis only on the appliance.  \n  \nWhen size correctly they allow you to be more active and confident.  \n  \nWe will help you wear your clothing which is often the cause of a leak as the\nwaistband may restrict the flow.\n\nExercising with an ostomy. by Laura Cox.\n\nWe ship to Canada, United Kingdon, U.K., Australia, New Zealand ... Worldwide!\n\n© copyright 2024 Stomaplex LLC.\n\n__\n\n",
    "links": "[{\"link\": \"https://stomaplex.com/login.php\", \"text\": \"Sign in\"}, {\"link\": \"https://stomaplex.com/login.php?action=create_account\", \"text\": \"Register\"}, {\"link\": \"https://stomaplex.com/\", \"text\": \"\"}, {\"link\": \"https://stomaplex.com/cart.php\", \"text\": \"\"}, {\"link\": \"https://stomaplex.com/\", \"text\": \"\"}, {\"link\": \"https://stomaplex.com/cart.php\", \"text\": \"\"}, {\"link\": \"https://stomaplex.com/login.php\", \"text\": \"Sign in / Register\"}, {\"link\": \"https://stomaplex.com/stoma-guards/\", \"text\": \"Stoma Guards\"}, {\"link\": \"https://stomaplex.com/ostomy-belts-and-wraps/\", \"text\": \"Ostomy Belts\"}, {\"link\": \"https://stomaplex.com/equalizer/\", \"text\": \"The Equalizer\"}, {\"link\": \"https://stomaplex.com/video/\", \"text\": \"How to Wear\"}, {\"link\": \"https://stomaplex.com/veterans-ostomy-belt/\", \"text\": \"Veterans\"}, {\"link\": \"https://stomaplex.com/size-chart/\", \"text\": \"Size Chart\"}, {\"link\": \"https://stomaplex.com/stoma-guard-reviews/\", \"text\": \"Reviews\"}, {\"link\": \"https://stomaplex.com/contact-us/\", \"text\": \"Contact Us\"}, {\"link\": \"https://stomaplex.com/shipping-returns/\", \"text\": \"Shipping & Returns\"}, {\"link\": \"https://stomaplex.com/login.php\", \"text\": \"Sign in / Register\"}, {\"link\": \"https://stomaplex.com/stoma-guards/\", \"text\": \"Stoma Guards\"}, {\"link\": \"https://stomaplex.com/ostomy-belts-and-wraps/\", \"text\": \"Ostomy Belts\"}, {\"link\": \"https://stomaplex.com/equalizer/\", \"text\": \"The Equalizer\"}, {\"link\": \"https://stomaplex.com/video/\", \"text\": \"How to Wear\"}, {\"link\": \"https://stomaplex.com/veterans-ostomy-belt/\", \"text\": \"Veterans\"}, {\"link\": \"https://stomaplex.com/size-chart/\", \"text\": \"Size Chart\"}, {\"link\": \"https://stomaplex.com/stoma-guard-reviews/\", \"text\": \"Reviews\"}, {\"link\": \"https://stomaplex.com/contact-us/\", \"text\": \"Contact Us\"}, {\"link\": \"https://stomaplex.com/shipping-returns/\", \"text\": \"Shipping & Returns\"}, {\"link\": \"https://stomaplex.com/stoma-guards/\", \"text\": \"\"}, {\"link\": \"https://stomaplex.com/stoma-guards/\", \"text\": \"\\n            Shop Now\\n        \"}, {\"link\": \"https://stomaplex.com/wocn-review/\", \"text\": \"WOCN Ostomy Belt Review\"}, {\"link\": \"https://stomaplex.com/wocn-review/\", \"text\": \"Reviewed by, Pearl R. Harmany, BSN, RN, CWOCN\"}, {\"link\": \"https://stomaplex.com/size-chart/\", \"text\": \"\"}, {\"link\": \"https://stomaplex.com/size-chart/\", \"text\": \"\"}, {\"link\": \"https://stomaplex.com/ostomy-belt/\", \"text\": \"\"}, {\"link\": \"https://stomaplex.com/ostomy-support-belt/\", \"text\": \"\"}, {\"link\": \"https://stomaplex.com/ostomy-wrap/\", \"text\": \"\"}, {\"link\": \"https://stomaplex.com/size-chart/\", \"text\": \"Custom Sizing\"}, {\"link\": \"https://stomaplex.com/stoma-guard-reviews/\", \"text\": \"Customer Reviews\"}, {\"link\": \"https://stomaplex.com/stoma-guard-reviews/\", \"text\": \"Swimming Review\"}, {\"link\": \"https://stomaplex.com/sitemap.php\", \"text\": \"Site Map\"}, {\"link\": \"https://stomaplex.com/contact-us/\", \"text\": \"Contact Us\"}, {\"link\": \"https://stomaplex.com/shipping-returns/\", \"text\": \"Shipping and Returns\"}, {\"link\": \"https://stomaplex.com/wocn-review/\", \"text\": \"WOCN Review\"}, {\"link\": \"https://stomaplex.com/about-us/\", \"text\": \"About Us\"}, {\"link\": \"https://stomaplex.com/faq/\", \"text\": \"FAQ\"}, {\"link\": \"https://stomaplex.com/privacy-policy/\", \"text\": \"Privacy Policy\"}]"
}