{
    "summary": "Hundividen  \n\n  * Hem\n  * Tjänster och kursutbud\n  * Mer\n\n######  \n\n## Kursutbud\n\n##### Här kan du läsa mer om Hundividens tjänster\n\n#### Vem vänder sig kurserna till\n\nHundividen vill sprida kunskapen om belöningsbaserad hundträning. Kurserna\nsträcker sig från den nyblivna hundägaren till den som behöver mer stöd i\neventuella hinder i träningen.\n\n  \n\n### Utan-hund-plats\n\nFör dig som inte har en hund än, men vill lära dig mer om hundträning,\nerbjuder Hundividen platser på vissa kurser utan hund. För halva priset av\nkursen får du vara med på kursen utan hund, lyssna på teorin, se på de\npraktiska övningarna och själv ställa frågor. Vilka kurser som erbjuder detta\nstår under var och en kurs se \"antal utan-hund-platser\".\n\n#### Kurserna är i kategorierna:\n\n###### Vardagsviktiga kurser - valpkurser, unghundskurser, koppelkurser och\nhundmöten  \n\n###### Prova-på kurser: för dig som är nyfiken på hundkurs men inte bestämt\ndig vilken kurs du ska gå\n\n###### Blygerhundskurser - för den osäkra och rädda hunden\n\n###### Berikningskurser - lär känna din hund och ge hunden stimuli för dess\nnaturliga behov\n\n###### Privatträning\n\n###### Beteendeutredning\n\n#### Regler  \n\nDET ÄR INTE TILLÅTET ATT RYCKA, NYPA ELLER GE ANDRA KORRIGERINGAR TILL HUNDEN\n\nUTRUSTNING SOM ANTI-DRAG, HALTI OCH STRYP ÄR EJ TILLÅTET ATT ANVÄNDA PÅ KURS\nHOS HUNDIVIDEN. SELE ÄR ATT FÖREDRA, MEN VILL INTE DIN HUND BÄRA SELE ÄR DET\nSJÄLVKLART OKEJ, DÅ ÄR ETT FAST BRETT HALSBAND ETT KRAV. HAR DU SVÅRT ATT\nHITTA EN SELE PASSAR DIN HUND KAN DU SKICKA ETT MAIL SÅ HJÄLPER JAG TILL ATT\nTA FRAM EN PASSANDE SELE.\n\nETT FAST KOPPEL ÄR ATT FÖREDRA (DVS INTE FLEXIKOPPEL ELLER RULLKOPPEL) FAST\nKOPPEL FINNS ATT LÅNA PÅ PLATS\n\n  \n\n  \n\nAnmälan kurs Gå till beteendeutredning\n\n## VARDAGSVIKTIGA KURSER\n\nVardagsviktiga kurser är de kurser som du som nyhundsägare lär dig vad\nbelöningsbaserad hundträning är, hur du belönar hunden, hur du läser av din\nhund och hur du lär in det viktiga så som ensamhetsträning, koppelträning,\ninkallning och mycket mer.  \n\nVardagsviktigt\n\n#### Valpkurs\n\nStart vardag(tors) 4/4\n\nStart helg (sön) 7/4\n\nDenna kurs vänder sig till valpägaren som vill lära sig grunden i hundkunskap\noch hur du fortsätter att träna med din valp efter avslutad kurs. Du kommer få\nredskapen i hur du stärker relationen med din valp. Vi kommer att prata om\nvalpens utveckling, ensamhetsträning, olika belöningar, varför vi tränar med\nbelöningsbaserad hundträning, hur vi kan läsa av vår hund och mycket mer!\n\n###### 5 tillfällen á 1,5h\n\n###### Start vardag 4/4, resterande 11/4, 18/4, 25/4, 2/5 kl 18.00-19.30\n\n###### Start helg 7/4, resterande 14/4, 21/4, 28/4, 5/5 kl 11.00-12.30\n\n###### Kursen hålls utomhus, kläder efter väder Edsbergsparken, Sollentuna\n\n###### 2250:-\n\n###### Max 4 ekipage\n\n###### 2 utan-hund-platser\n\n###### Hela familjen är välkommen, det bjuds på fika och goodiebags.\n\nVardagsviktigt\n\n#### Unghundskurs\n\nStart helg(lör) 2/3\n\nStart vardag(mån) 1/4\n\nDenna kurs vänder sig till dig med en unghund i åldern 5 månader - 2 år, som\nhar gått valpkurs(behöver ej vara Hundividens valpkurs).\n\nAtt vara en unghund kan kännas jobbigt, då världen kan vara både intressant\noch läskig. Man vet inte vad man ska ta sig till med all energi. I den här\nkursen få du som ägare hjälp i att stimulera din unghund, du kommer få redskap\ni hur du boostar självförtroendet på din osäkra tonårshund. Hur du med hjälp\nav belöningsutveckling kan stärka relationen och hjälpa din hund genom hinder\nni stöter på genom hunden liv.\n\n###### 5 tillfällen á 1,5h\n\n###### Start helg 2 Mars resterande 9/3, 16/3, 23/3, 30/3 kl 11.00-12.30\n\n###### Start vardag 1 April, resterande 8/4, 15/4, 22/4, 29/4 kl 18.00-19.30\n\n###### Kursen hålls utomhus, kläder efter väder. Edsbergsparken, Sollentuna\n\n###### 2250:- har du gått valpkurs hos Hundividen får du 350:- rabatt!\n\n###### Hela familjen är välkommen, et bjuds på goodiebags och fika\n\n###### Max. 4 ekipage\n\n###### 2 utan-hund-platser\n\nVardagsviktigt\n\n#### Vardagsviktiga grunder\n\nFör hundägaren som inte gått någon valpkurs med sin hund, och skulle vilja\nlära sig mer om vardagsträning och grundlig hundkunskap.\n\nPassar även omplaceringar\n\nFör hundar mellan 6 månader och seniorhund.\n\n  \n\n###### Startdatum 1 Mars, resterande 8/3, 15/3, 22/3 kl 18.00-19.30  \n\n###### 1850:- Hela familjen är välkommen, det bjuds på fika och goodiebags.\n\n###### Plats: Edsbergsparken, Landsnoravägen\n\n  \n\nVardagsviktigt\n\n#### Koppel & Kontakt\n\nVill du ha hjälp med koppelträningen och få bättre kontakt me hunden på\npromenaderna? Då är denna mini kurs perfekt för dig. 2 tillfällen á 1,5h med\nfokus på kontaktövningar som kommer göra promenaderna lättare för dig. Bonus:\nfå till grunden till Inkallning!\n\n###### Datum torsdag 7 +14 Mars kl 18.00-19.30\n\nMax 4 ekipage.\n\n800:-\n\nHela familjen är välkommen, barn får ej störa de andra ekipagen.\n\nVardagsviktigt\n\n#### Skvallerbytta\n\n###### Hundmöteskurs\n\n###### Start April 2023 datum för de fysiska tillfällena släpps inom kort!\n\nGör din hund utfall i kopplet? Känner du dig spänd när ni går ut och tar\nomvägar för att slippa att er dag blir förstörd av ett enda möte? Då är denna\nkurs för dig!\n\nDu får redskapen till att kunna träna i förebyggande syfte, innan utfall\nuppstår.\n\nVi går in på frustrationshandling och hur du kan hjälpa hunden att avreagera\nsig. Samt vikten av återhämtning.\n\nDu får träna i en riggad miljö mot en tyghund, ett ekipage i taget. Ekipagen\nkommer inte att träna på varandras hundar. Vi ser till att var och en känner\nsig trygga och är bekväma i träningen.\n\nVälj mellan tillfällen som ensamt ekipage eller med 2 ekipage. Detta för att\nalla ekipage ska hinna träna de praktiska övningarna en och en i lugn och ro\nutan att distraheras från varandra. Är din hund väldigt känslig för andra\nhundar hänvisar jag till tillfällen som ensamt ekipage.\n\nSluten Facebookgrupp där livesändning körs veckovis under kursens gång, tid\nför frågor och återkoppling mellan de fysiska tillfällena. Vi peppar varandra\noch delar med oss av alla framsteg, stora som små.\n\nVi varvar teori med praktiska övningar. Detta för att hunden ska få pauser och\natt man ska kunna ta till dig information utan att behöva träna hund\nsamtidigt.\n\nHundar som inte kan sitta och vänta i bilen på sin tur får vara bakom\ninsiktsskydd med sin familj. Vi hjälps åt så alla hundar känner sig trygga när\nandra ekipage tränar.\n\n  \n\n4 Tillfällen á 2H\n\nEdsbergsparken , Sollentuna\n\n2350:-\n\nVill du förtidsboka din plats skicka ett mail till\nbeteendeutredning@hundividen.se\n\nGå till anmälan\n\n## Prova-på kurser\n\n##### För dig som är sugen att gå kurs men vet inte vad riktigt eller vill ha\nett bättre hum om hur jag jobbar som instruktör, då kan ni prova på en mini\nkurs på 1h.\n\n#### Prova-på kurser\n\n###### Få hjälp att komma igång med träningen för dig och din hund.\n\nOlika tillfällen med olika aktiviteter och fokusområden. De olika teman med\ndatum läggs upp på Hundividens instagram och Facebook löpande, så in och följ\ndär för att inte missa något!\n\nAlla tillfällen är på grundnivå som ger dig både redskapen till fortsatt\nträning och inspiration. Från 12 veckors valp till seniorhund. Hela familjen\när välkommen.\n\nNya datum för hösten, två tillfällen att välja på för varje tema.\n\n###### Datum: PÅSKVECKAN tema släpps inom kort!\n\nEtt tillfälle á 60 min.\n\n249:- /tillfälle. Hela familjen är välkommen\n\n  \n\n  \n\nInstagram Facebook\n\n## Klickerkurser\n\n##### Klicker är ett hjölpredskap i träningen och fungerar som en\nbelöningsmarkör. Den gör det tydligt för hunden och ger ett mer exakt taming\nför rätt beteende. Klicker kan vara både en rolig aktivering i freeshaping men\nockså en bra hjälp i vardagen. Har du inte använd klicker förut rekommenderar\njag att du går en nybörjarkurs först, så du får lära dig grunden i\nklickerträning samt klicka in hunden.\n\n#### Tricksa & Klicka\n\n###### Startdatum 3 Mars\n\nDen här kursen är till för dig som är nyfiken på vad klickerträning är för\nnågot och varför det är så omtalat.\n\nDu får kunskapen om varför belöningsmarkören klickern kan vara en bra hjälp i\nhundträningen. Hur man klickar in hunden, vad freeshaping är för något och hur\nman sätter signal på nya beteenden.\n\nDu kommer också få tips hur man kan använda sig av tricks som viktig träning i\nvardagen.\n\nDen här kursen bjuder på många skratt och hjälper dig som hundägare att vidga\ndina vyer i hundträningen.\n\nUnder 4 tillfällen kommer du få öva in användandet av klicker. Klicka in din\nhund, Testa på att freeshapa din hund och hjälpa din hund att bjuda nya roliga\nbeteenden. Din hund kommer att få prova på targets, och mycket mer!\n\n###### 4 tillfällen á 1h.\n\n###### Startdatum 3/3, kl 11.00-12.00, Edsbergsparken Sollentuna\n\n###### Resterande: 10/3, 17/3, 24/3\n\n###### Max 5 hundekipage\n\n###### 875:- Klicker ingår, Hela familjen är välkommen\n\n  \n\n  \n\nTill anmälan\n\n###### Superscript\n\n## Blygerhundskurser\n\n##### Dessa kurser är inspirerade av boken \"Blygerhundar - så gör du din hund\ntill en superhjälte\" skriven av Jessica Mann. Då jag är utbildad av Jessica\nfår jag hålla dessa guld värda kurser.\n\n\n\nEn blygerhund är en hund som tycker världen är otäck och behöver stärka sitt\nsjälvförtroende. På dessa kurser fokuserar vi på att stärka hundens\nsjälvförtroende med olika övningar, underlag och lekar.\n\nAtt leva med en blygerhund kan kännas tungt då man ser sin bästa vän vara rädd\noch har svårt att hantera vissa vardagliga situationer. Oavsett om din hund är\nrädd för andra hundar, människor, ljud, bilar osv så anpassar vi så just du\noch din hund ska känna er bekväma.\n\nPå Blygerhundskurserna är maxantalet på ekipage 4 hundar. Vi riggar miljön så\nalla hundar får utrymmet de behöver med hjälp av skymd sikt från varandra,\nstort avstånd och lätt att gå undan.\n\nKurserna hålls inomhus.\n\nÄr du medlem i BFF Strays? Då får du 15% rabatt på alla Blygerhundskurser!\nAdoptörer via BFF Strays får 50%rabatt på alla Blygerhundskurserna.\n\n  \n\nBlygerhundskurs\n\n#### SUPERHUNDAR\n\n###### Kommer våren 2023!\n\nDenna kurs passar dig som vill gå en kurs med hela konceptet blygerhund. Vi\nfokuserar på att stärka hundens självförtroende och hjälpa hunden att bli\ntryggare och våga ta för sig mer i livet. Du kommer få redskap till hur du kan\nstötta din blygerhund i vardagen.\n\n4 TILLFÄLLEN, 2H MED MÅNGA PAUSER\n\nBlygerhundskurs\n\n#### Modiga Hundar\n\n###### Kommer våren 2023\n\nDenna endags-kurs vänder sig till dig som är nyfiken på konceptet blygerhund\noch vill prova på hur man kan stärka hundens självförtroende.\n\n1 TILLFÄLLEN, 2H MED MÅNGA PAUSER\n\n  \n\nBlygerhundskurs\n\n#### Tappra Tassar\n\n###### Kommer våren 2023!\n\nDenna endags-kurs vänder sig till dig som är nyfiken på konceptet blygerhund\noch vill prova på olika sätt man kan få hunden att växa i sitt självförtroende\noch initiativtagande med hjälp av att stärka hundens muskler och balans.\n\n###### 1 TILLFÄLLEN, 2H MED MÅNGA PAUSER\n\nBlygerhundskurs\n\n#### Rescue Hjältar\n\n###### Kommer våren 2023!\n\nDenna kurs vänder sig till dig som har en omplacering antingen ifrån Sverige\nmen också en hund från ett shelter eller gatan utomlands.\n\nKursen fokuserar på att du ska få lära känna din hund på nya sätt genom\növningar som stärker hundens självförtroende, hjälper hunden att ta initiativ\noch bygger er relation ihop. Hunden behöver ha bott hos dig minst en månad, så\nni fått landa lite innan ni tar er av alla nya intryck som kommer med en\nfysisk kurs.\n\n######  \n\nGå till anmälan\n\n## Berikningskurser\n\n##### Berikning betyder att tillföra något som stimulerar hundens naturliga\nbehov och beteenden.\n\nInga förkunskaper krävs. Berikngskurserna är anpassade efter 12 veckors valpar\nupp till seniorhundar\n\n  \n\nBerikningskurs  \n\n#### Berikningsbanan: Kanin hålet\n\n###### Datum: 31 Mars\n\nBerikningsbana i påsktema! Med stort fokus på jaktstimuli och nosen.\n\nSamla inspiration och kunskap om hur du kan berika just din hund mer i\nvardagen. Se din hund ur nytt perspektiv, genom att låta den ta initiativ,\nvara modig, välja och rata. Helt upp till hunden vad som faller i dess tycke!\nDin uppgift blir att stötta och peppa, och se på när din hund njuter av att få\nvara hund.\n\n###### För vem? För alla hundar mellan 12 veckor upp till seniorer.\n\nVälj om du vill vara me di grupp eller som ensamt ekipage. Gruppen består av\nmax 4 ekipage, alla ekipage kommer hållas på avstånd ifrån varandra. Siktskydd\nfinns på plats för den som behöver pause.\n\n###### Datum 31 Mars\n\n###### Grupp 1 kl 11.00-12.30\n\n###### Grupp 2 kl 13.00-14.30\n\n###### Ensam 1 kl 15.00-15.45\n\n###### Ensam 2 kl 16.15-17.00\n\n###### Edsbergsparken, Sollentuna\n\n###### 350:- Per hund, hela familjen är välkommen men barn får ej störa de\nandra ekipagen. Det bjuds på fika och tid för att prata med beteendeutredare\npå plats.\n\nGå till anmälan\n\n## Privatträning\n\nVill du träna på ett specifikt beteende eller vill satsa mer i hundträningen,\ndå kan du boka in dig för privatkurs. Även för dig som har en hund som inte\nklarar av att träna samtidigt som andra ekipage.\n\nAlla kurser går att hållas som privatkurs, priset är då detsamma som\nprivatkurs per tillfälle.\n\nBeskriv vad du vill träna på tillsammans med din hund i din anmälan.\n\nDet går även att boka Privatgrupp om ni är ett sällskap på minst 3 ekipage.\n\n  \n\n###### Privatträning ensam\n\n###### 550:- för 60 min\n\n###### 3 tillfällen för 1200:-\n\n  \n\n###### Privatgrupp  \n\n###### Ett sällskap på minst 3 ekipage\n\n###### 325:-/ekipage för ett pass 60min\n\n###### 675:-/ekipage vid köp av 3 pass  \n\n  \n\n  \n\nKöp nu\n\n###### Hundividen erbjuder även\n\n## Beteendeutredning\n\n##### Jag är utbildad beteendeutredare via Attityd Hundkunskap. En\nbeteendeutredning går till att man utreder ett problembeteenden hunden har.\nDet kan vara ett eller flera beteenden som påverkar er så vardagen blir svår.\nBeteendet behöver inte alltid vara ett problem för hunden själv, utan det kan\nvara ett beteende som ägaren tycker är jobbigt, ett beteende som påverkar eran\nvardag eller omgivning.\n\n  \n\nBeteenden kan se olika ut beroende på situationen. Det kan kännas tungt och\nsvårt att inte veta hur en kan hjälpa sin hund. Därför är det viktigt och bra\natt söka hjälp. Hundividen bemöter alltid människor och hundar med empati och\nomtanke, för din trygghet.\n\n  \n  \n\nExempel på problembeteenden:\n\nSeparationsångest\n\nUfall i koppel vid hundmöten, människor, bilar osv\n\nLjudrädslor\n\nResursförsvar\n\nSvårt med hantering och/eller veterinärbesök\n\nÅksjuka\n\nOönskat skall på ringklockan eller i trädgården\n\nStress\n\nJaktproblem\n\n  \n  \nEn beteendeutredning hos Hundividen börjar alltid med att du mailar och får\nett formulär att fylla i om hundens beteende du behöver hjälp med, när de\nuppstår, vad hunden gör innan och efter, hur er vardag ser ut, om hundens\nhälsa, kost och bakgrund. Det är bra att göra en hälsokoll hos veterinären\ninnan vi påbörjar beteeutredningen, för att utesluta sjukdomar och smärta.\nDetta kan göras efter beteendeanalysen. Under intervjun kommer jag ställa mer\ndjupgående frågor om beteendet och hunden. Du kommer få en beteendeanalys och\nen träningsplan i hur vi kommer jobba de kommande träffarna. Räkna med ca 1h\nper träff. Hela familjen är välkommen, då det är bra om alla vet hur\nträningsplanen kommer att se ut.  \n  \nDu skickar ett mail till Beteendeutredning@hundividen.se du kommer sen få ett\nformulär att fylla i om din hund, er vardag och vad ni behöver hjälp med.  \n  \nHär nedan ser du Hundividens utbud I beteendeutredning. BFF Strays-adoptörer\nfår 50% rabatt vid köp av lilla startpaketet  \n  \n\nMIDSOMMAR ERBJUDANDE: mädenna helg erbjuder jag en första online konsultation-\ntillfälle för reaktiva hunden helt utan kostnad. (värde 650:-). Därefter 650:-\nper tillägg av fysiska träffar/online (värde 950:-/tillfälle)\n\nFör dig som vill ha råd i hur du kan förebygga stress och ge återhämtning för\ner hund med triggers inför sociala sammanhang. Det behöver inte vara du och\ndin hund mot världen. Det finns hjälp och stöd att få.\n\nFör kontakt: beteendeutredning@hundividen.se\n\nSkriv \"midsommar\" som rubrik\n\n  \n\nErbjudandet gäller tom sista ansökningsdag tisdag 27/6\n\n    \n\n#####  Paket\n\n|\n\n#####  Detta ingår\n\n|\n\n#####  Pris  \n  \n---|---|---  \n  \n##### Lilla paketet\n\n|\n\nIntervju och beteendeanalys ingår + 2 praktiska träningstillfällen med\nindividanpassad träningsupplägg. . Vill du lägga till extra tillfällen efter\nfår du rabatterat pris per tillfälle 450:-. 1h per tillfälle. OBS att\nintervjun kan variera med tiden 45min-1,5h. Du får beteendeanalysen skickad på\nmail efter överenskommelse. BFF Strays-adoptörer får 50%rabatt vid köp av\nlilla startpaketet\n\n|\n\n**1790 SEK **\n\n|  Anmälan  \n  \n##### Stora paketet\n\n|\n\nIntervju och beteendeanalys ingår + 4 praktiska träningstillfällen med\nindividanpassad träningsupplägg. . Vill du lägga till extra tillfällen efter\nfår du rabatterat pris per tillfälle 350:-. 1h per tillfälle. OBS att\nintervjun kan variera med tiden 45min-1,5h. Du får beteendeanalysen skickad på\nmail efter överenskommelse.  \n\n|\n\n**3350 SEK **\n\n|  Anmälan  \n  \n##### Endast intervju\n\n|\n\nIntervju fysiskt eller över videosamtal + beteendeanalys. Intervjun kan\nvariera mellan 45min-1,5h. Du får beteendeanalysen skickad på mail efter\növerenskommelse.\n\n|\n\n**650 SEK **\n\n|  Anmälan  \n  \n##### Köp av enskilda tillfällen efter intervju\n\n|\n\nEnskilda träningstillfällen med individanpassad träningsupplägg. efter köp av\nenskild intervju. 1h per tillfälle.\n\n|\n\n** 950 SEK  **\n\n|  Anmälan  \n  \n### Kursanmälan\n\n##### Fyll i formuläret för en anmälan för kursen du vill gå. Du kommer få ett\nsvar med bekräftelse på din anmälan samt betalningsinformation.\n\nNamn E-post Kurs + datum Hundens namn, ålder, ras/hundtyp Övrig info ex\nallergier, behov av mer utrymme, frågor\n\nSkicka in\n\n### Kontakt information\n\n#####  \n\nBeteendeutredning@hundividen.se\n\n  *   * \n\nHundividen  \n\n##### Detta är en blockbeskrivning. Klicka och skriv text för att ändra\nbeskrivningen, eller ersätt den med ditt eget innehåll. Använd det här\nutrymmet för att konvertera sidans besökare till kunder med ett erbjudande\n\n1:a Exempelgatan, Exempelstad, Exempelland\n\n+1 234 567 8910\n\nBeteendeutredning@hundividen.se\n\n  *   * \n\n  * Hem\n  * Funktioner\n  * Prissättning\n  * Vittnesmål\n  * Kontakt\n  * Blogg\n\n© 2024 Hundividen  \n\nClose Share Fullscreen Zoom\n\nArrow left Arrow right\n\n",
    "links": "[{\"link\": \"https://hundividen.se/\", \"text\": \"Hem\"}, {\"link\": \"https://hundividen.se/kursutbud/\", \"text\": \"Tjänster och kursutbud\"}, {\"link\": \"https://hundividen.se/kursutbud/#ws-block-contacts-with-contact-form-6tYIda8i\", \"text\": \"Anmälan kurs\"}, {\"link\": \"https://hundividen.se/kursutbud/#ws-block-pricing-with-table-BkgCaLFu\", \"text\": \"Gå till beteendeutredning\"}, {\"link\": \"https://hundividen.se/kursutbud/#ws-block-contacts-with-contact-form-6tYIda8i\", \"text\": \"Gå till anmälan\"}, {\"link\": \"https://hundividen.se/kursutbud/#ws-block-contacts-with-contact-form-6tYIda8i\", \"text\": \"Till anmälan\"}, {\"link\": \"https://hundividen.se/kursutbud/#ws-block-contacts-with-contact-form-AoE4Egs0\", \"text\": \"Gå till anmälan \"}, {\"link\": \"https://hundividen.se/kursutbud/#ws-block-contacts-with-contact-form-6tYIda8i\", \"text\": \"Gå till anmälan\"}, {\"link\": \"https://hundividen.se/kursutbud/#ws-block-contacts-with-contact-form-6tYIda8i\", \"text\": \"Köp nu\"}]"
}