{
    "summary": "Hoppa till innehåll\n\n# Maria Willers med Milton & Tryggve\n\n## Belöningsbaserad hundträning. – Egen träning. -Livet.\n\n# Primär meny\n\nMeny\n\n  * Hem\n  * Maria, Milton & Tryggve\n  * Maria Willers hundkraft\n\n#  Etikett belöningsbaserad träning\n\n# Tänk som om du vore din hund!\n\n4 mars, 2021Maria Willers Lämna en kommentar\n\nJag upplever att de personer som tränar mycket hund och är insatta i inlärning\nofta har lätt för att berömma sin hund och inte lägger ”fel” som sker i\nträningen på sin hund (inklusive mindre populära beteenden hunden kan tänkas\nutföra i vardagen) utan på sig själva. Helt rätt som sådant då hunden aldrig\ngör ”fel” utan kort och gott gör det den lärt sig och efter vad som lönar sig!\nMen jag upplever lika ofta att vi tvåbenta å andra sidan kan ha väldigt lätt\nför att döma oss själva när det inte går som vi vill.\n\nMin egna senaste fallgrop där jag dömt mig själv är att jag tänkt att ja men\ndet där KAN jag ju! Ändå gör jag det inte och tar mig inte i ”mål”, vilket\nskapar frustration/obehagskänslor då jag tycker jag är urkass som inte gör\nfast jag ju kan.\n\nMEN har ni tänkt på en sak… Tänk på en valp som ska lära sig sitt. Jag kan\nofta höra nya hundägare uttala att min hund KAN sitt men gör det inte och\nlyssnar inte på vad jag säger. Jag kan då lättsamt börja introducera tanken\noch prata om att frågan är om valpen verkligen KAN sitt då? Jag menar… vad\nmenas med att kunna saker som t.ex. sitt. Det är ju en sak att kunna sitt på\nsignal för valpen när den är i sin vana miljö på hemmaplan. Med en fokuserad\nägare och utan andra valpar, doftfläckar, människor, fladdrande löv… o.s.v.\nrunt sig.\n\nEn hund kan ju kunna en sak som t.ex. sitt i en specifik setup men inte i en\nannan. Vi kan inte förvänta oss att en hund ska kunna t.ex. SITT i alla\nmiljöer och kanske med en nervös matte som det lätt kan bli i till exempel en\nkurssituation eller för att inte tala om på tävling om det inte tränats och\nbelönats. Det behöver tränas, tränas och tränas och ges de förutsättningar som\nbehövs här och nu, där och då för att hunden ska kunna klara av att utföra\nSITT på signal. Här är det jag som ägare som behöver ta ansvaret att träna på\nett schysst, roligt och lagom lätt och utmanande med genomtänkta kriterier för\natt nå till målet tillsammans. Att till exempel stå och upprepa sitt, sitt,\nsitt… många gånger är inte en lösning för att få hunden att lära. För hunden\nblir beteendet bara mer och mer utjatat och det bli en avlärning istället för\ninlärning. Enkelt uttryckt kan man säga att hundar gör det som lönar sig i\nderas värld! (Sen är det ju lite mer ”komplext” än så rent träningsmässigt men\njag tror ni är med mig här).\n\nSå vad har då det här med oss tvåbeningar att göra. Jo, men det samma gäller\nväl också för oss?! Tillbaka till min frustration om att tycka jag är urkass\nsom inte gör fast jag ju kan. Då är kanske den relevanta frågan… Ja, men kan\njag det verkligen då? Om jag inte gör? Svaret är rätt så givet NEJ det kan jag\ninte. Kan jag inte så är det väl lika illa att tycka jag är kass som om jag\nskulle tycka att min hund beter sig kasst för att hen inte kan SITT när det\nspringer runt andra valpar m.m. när vi inte tränat på det och inte belönat upp\nbeteendet. Med hundar tänker jag alltid vad är det som gör att min hund inte\nkan t.ex. SITT i den här situationen? Är miljön runt för svår/ny? Är jag\notydlig? (t.ex. har jag fått byta min liggsignal till LÄGG då SITT och LIGG\nlät för lika varandra och jag blev alltså otydlig för min hund (tack husse för\natt du påtalade hur lika jag lät i mina uttal)). Har jag tillräckligt bra lön\ntill min hund så hen vill göra det jag ber om? Är min hund för trött/har ont?…\nVILL jag göra det jag tänker att jag ska göra? Behöver jag göra det? Om inte\nkanske jag ska släppa uppgiften helt och hållet. Hur är miljön runt mig?\nBehöver jag minimera störningar? Vad är det som stör ut? Vilka förutsättningar\nbehöver just JAG som individ för att göra eller inte göra det jag inte gör? 😉\n\nLite förlåtande kan tanken om att vi alla gör så gott vi KAN vara också när vi\nmöter personer som har en helt annan verklighetsuppfattning än en själv.\nTycker ordspråket; ”Där kunskapen tar slut träder våldet in (fysiskt eller\nverbalt)” passar in här. För att personer gör så gott som de kan så är det\ninte lika med att acceptera allt som görs eller sägs. Jag har själv brutit\nkontakter där våra möten inte supportat mig alls till att bli en gladare,\nnöjdare, mer avslappnad och bättre person. Tvärtemot har mötena präglats av\natt jag anpassat mig, fått mig att må sämre, bli spänd, tvivla mer och mer på\nmig själv och gett mig mindre självförtroende/självkänsla. Då är det bättre\natt bryta när en kan.\n\nVar reko och schysst både mot din hund OCH dig själv. Att tycka vi är kassa\nför att vi inte gör saker hjälper föga. VILL jag göra det till att börja med?\nBacka ett par steg (precis som i hundträning) och gör det enklare och se vad\nbehöver vi som individ innan, under, efter det beteende vi vill se mer av? Och\nfungerar inte de hjälper vi sätter in för att det ska funka? Då är det\nförmodligen inte just det som faktiskt är en hjälp utan någonting annat. 😉\n\nDET här blev en jättelång text och vad jag vill uttrycka är väl egentligen:\nSträck på dig, var stolt och umgås med personer som vill se dig blomma! För\nmin del är det personer som ser mig, som peppar, som vågar säga till mig på\nriktigt när jag håller på att fega ur eller om jag är på väg att göra/inte\ngöra saker som inte gagnar, som tror på mig, som finns där… Som också visar\nsig själva, ber om support och kan tycka annorlunda än jag. Ni är flera och\njag är så tacksam över att ni finns i mitt liv!\n\nNU väntar jag spänt på ett mejlsvar som kommer innebära en ytterligare\nutveckling av hundverksamheten framöver. 🙂 Jag kommer hoppa på och göra något\nsom jag i flera år sagt att nej det där är inte för mig. Fortsättning följer…\n\nKRAM till oss alla! Ha det hunderbart. 🙂\n\n# Att ge upp, eller är det acceptans?!\n\n9 september, 2020Maria Willers 2 kommentarer\n\nSkrev ett inlägg på facebook som löd ungefär så här:\n\n”Det är inte någon vits att försöka ändra på det som inte går att förändra.\nIbland är det oerhört svårt att acceptera. Ibland är det bara envist och\n”dumt”. Ge ditt allt för att förändra det du vill och det finns möjligheter\ntill. Sök kunskap så du får förstånd att kunna se skillnaden. Håller du på att\nge upp eller är det faktiskt acceptans till något du inte kan förändra hur\nmycket du än ger ditt allt.”\n\nMitt dagens ord den dag jag skrev inlägget var: ACCEPTANS.\n\nJag fick flera kommentarer på inlägget som jag gillade skarpt. Det här är ett\nav flera:\n\n”Kanske inte ett dagens ord, men jag har en diagnos. Man kan behövs påminna\nsig om den diagnosen ibland.”\n\nBroderi vid Sigtunastiftelsen, tack för bilden och fb.inlägg Bibbi.\n\nSå vad är det då jag accepterat. Det svåraste av svåraste tänker jag inte ens\nskriva om. Där har jag en bit kvar.\n\nNågot jag jobbat länge för och trott på är min löpning. Att komma tillbaka\ntill att springa och då inte bara några fjuttiga minuter utan att kunna\nspring, springa på riktigt. I alla fall 5km, eller varför inte  en mil eller\ntvå. Få springa lopp, springa med voffsing framför mig (canicross), agility\noch så karaten som kräver att hälsena/foten/jag håller för belastning med\nhopp, spring, djupa positioner… När jag blickar tillbaka så ser jag att jag\nhar gjort rehab, jag har tagit support i flera år och åren har till slut\nblivit rätt så många med både + & -. Det har inte hållit utan någon form av\nbakslag kommer när jag försöker öka om än så försiktigt och klokt (ibland har\njag även försökt öka väldigt oklokt 😮 ).\n\nSå med motvilliga känslor så har jag accepterat att nej jag får faktiskt\nacceptera att jag ska inte spring, springa… Min kropp håller inte för den\nbelastningen helt enkelt. Så jag har slutat med träningspassen som varit\ninriktade mot löpning, agilityinstruktörsutbildningen är avbruten, jag har\nmeddelat karateklubben (underbart gäng), jag har gått ur grupper runt\ncanicross, löpning o.s.v. Jag är säker på att min kropp och hälsena kommer\nmeddela mig om den känner sig läkt och bara måste få spring, springa igen (ja,\nhoppet finns ju kvar 😮 🙂 ).\n\nJag minns med glädje och tacksamhet känslan jag hade för inte så länge sedan\ndå jag sprang Lidingöloppet. Jag minns med värme mig, Mats och Magnus\ntillsammans springande vid torpet i Skåne. ❤ ❤ ❤ Och agilityn tillsammans med\nTim, timmelim mellispudelmys och även med bästis Puzzel. De väldigt trevliga\nturerna till djurgården med Puzzel springandes framför mig. Hur han nästan\nylade här hemma när jag tog fram dragselen då han blev så ivrig för att få\nkomma iväg. På väg tillbaka med färjan satt han uppkrupen i min famn och mös\nmed de långa benen spretandes åt alla håll och kanter. ❤ 😀 Imorgon fyller han\n12 år så då blir det party!\n\nNaturen finns kvar och härliga utevistelser tillsammans med mina härliga dogs\n(och med Mats förstås när vi är lediga samtidigt). Jag har hittat tillbaka\ntill den meditativa syssla som virkning och stickning kan vara efter drygt 30\nårs uppehåll (om det inte trasslar allt för mycket för då är det allt annat än\nmeditativt 😀 😀 ).\n\nJag har mer jobb än någonsin nu med hundkurser och privatträningar vilket är\njättekul! Något jag verkligen trivs med. Tävlingslydnaden kommer få mer plats\nfrån nu och under 2020/21. Jag gick tävlingslydnadsinstruktörsutbildningen\n2012 för duktiga Lotta som sedan ett par år finns på Lerkulans hundcenter. Men\ni ärlighetens namn så har jag inte tränat mycket tävlingslydnad sedan dess\näven om många grundfärdigheter är de samma inom flera hundsporter. Reglerna\nhar ändrats sedan dess o.s.v. Kort och gott så har jag påbörjat\nuppfräschning/vidareutveckling av mina kunskaper inom området. Mer om det\nframöver. Nu har jag två obokade dagar framför mig och jag ser bland annat\nfram emot att läsa den nya upplagan av boken: Med sikte på 10:an av Niina\nSvartberg och Kenth Svartberg (den röda till vänster).\n\nDen här gången blev det ett lååångt inlägg. 😉\n\n_Önskar er ALLA fina höstdagar! See you..  _\n\n# Cyklandes & promenerandes hundinstruktör i Stockholm med omnejd…\n\n1 maj, 2020Maria Willers Lämna en kommentar\n\nCykel inköpt, testad och godkänd även av Milton. ❤ Så nu är hundkurserna igång\nigen vid Universitetet. Funkar jättebra!\n\nHur vi gjorde? Först hade jag cykelkorgen i soffan så Milton fick ligga och\nmysa i den och samtidigt äta på ett gott tuggis. Sedan tog jag ut korgen som\nni ser på bilden ovan. Helt ok. sa Milton så då var det dags att haka på\nkorgen på cykeln och vi tog oss ut på en promenad med cykel och Milton i korg.\nÄtandes godis på botten i cykelkorgen och kikade ut på omgivningen. I början\nfick jag guida så han inte satte upp tassar på kanten när det gick förbi\nhundar eller annat spännande. Väldigt snabbt lärde han sig att lönen kommer\nnär man är helt och hållet nere i korgen. Så nu känner jag mig trygg i att han\när kvar i korgen när jag cyklar (har förstås ändå säkrat upp så han är\nfastspänd och inte kan hoppa ur om det t.ex. skulle dyka upp tja, vad vet jag…\nen hare eller nåt).\n\nApropå det här med tuggisar. Ett tips är att överdimensionera benen till era\nhundar. De ben jag har med till Milton på kurs, eller som han får då jag\npysslar med annat är alltid i storlek större. Då slipper en oron över att de\nska sätta sista lilla snutten i halsen. Jag byter hellre ut tuggisarna efter\nen stund mot något annat gott om jag inte vill de ska vara framme hela tiden.\n\nJag har kommit igång med kurserna på Skeppsholmen. 🙂 Varför har jag inte haft\nkurser där tidigare? 😉 Jag kommer minska ner utbudet vid Universitetet under\npandemin då cykelvägen dit inte är jätteskoj. Så Björkhagen och Skeppsholmen\nkommer vara mina huvudplatser. Kanske det även tillkommer någon mer plats. Det\när framförallt valpkurser, kurser i personspår och så privatlektioner jag\nerbjuder under våren (privat kan ni bli coachade i vardagslydnad, rally,\ntricks, klickerträningsfärdigheter, grundmoment för skoj/inför tävling). Är ni\nett gäng som vill att jag håller en i kurs i rally eller tricks t.ex. så går\ndet säkert att ordna.\n\nJag skulle inte kunna vara nöjdare än vad jag är nu med min lilla flock här\nhemma. De synkar så fint ihop alla tre. Milton och Dante leker tillsammans.\nPuzzel och Milton vilar tillsammans i samma bädd. Jag upplever att de alla tre\nhar utbyte av varandra här hemma men på olika vis. Sååå nöjd!\n\n_Ta hand om er, så hörs vi!_\n\n\n\n# Att hålla positivt & negativt ”samtidigt” + seeeemester!!!\n\n21 juni, 201721 juni, 2017Maria Willers Lämna en kommentar\n\nHar verkligen fått öva mig i att växla mellan positivt och negativt. Vi börjar\nmed det tråkiga. I fredags ringde min mans läkare och ville direkt ha in honom\nför datortomografi (för er som inte vet så har han haft cancer tidigare i två\nomgångar). Detta efter att ett blodprovssvar visade på alarmerande höga\nlevervärden. Nu har vi fått svar och det verkar vara grönt ljus. Jag är\nförsiktigt optimistisk och jag ska kunna släppa det här nu under vår semester\nsom börjar imorgon bitti fram till den 3:e juli. Läkaren hoppas och tror det\nkan vara ett felvärde… Håller tummarna för det och annars lär vi höra något,\nför nu är nya prover tagna. Så det känns mycket mer positivt nu än bara för\nnågon timme sedan. 😀\n\nRiktigt positiv var helgen som ägnats åt klickerträningsexamen vid Kungsängen\n(stolt över att jag kunde fokusera trots tankar på kära mannen & stor oro).\nBilder säger mer än ord, såå…\n\nEfter många timmar, mycket träning, många projektuppgifter och inlämnade\nfilmer så blev jag i helgen godkänd klickerinstruktör. Tusen tack för pepp och\nstöttning ALLA inblandade!\n\nDet dök ju upp en eller snarare två flyttar mitt i pluggandet som tog massor\nmed tid och energi på olika sätt. Så nu är det extra jätteskönt att jag\nfaktiskt tog mig igenom utbildningen. Ett extra tack till Morten Egtvedt som\ngett mig massor med bra feedback på alla mina frågor och funderingar och som\nbidrog mycket till att ge mig en fin examenshelg, till min man Mats förstås\nsom peppat mig till att prioritera tid för träning med Dante och strunta i\nröran på hemmaplan och så till Eva-Marie Wergård som funnits där i den viktiga\nbakgrunden med ord som att aldrig ge upp och tro på mig själv, att fortsätta\njobba även om det känns kört för allt kan ändra sig… Ett stort tack till min\nhärliga Dante som ivrigt hängt med på träningspassen med glädje och stor lust.\nHan är fantastisk trevlig att jobba med!\n\nSå här i efterhand kan jag bara konstatera att JA det var ett bra val att gå\nden här utbildningen. Tillsammans med Hundens hus instruktörsutbildning känns\ndet helt enkelt mer komplett. Vill inte vara utan någon av de två\nutbildningarna. Kompletterar varandra bra!\n\nJa som ni märker kan jag skriva hur mycket som helst så ska sluta nu för NU\ngår jag på en rätt kort men oj så välbehövlig och viktig ledighet. Vad jag/vi\nska göra? Rätt gissat! Precis INGENTING som i massor… d.v.s VARA, naturen,\nkanske simma, ta hand om mig, om oss, om hundarna… vara tillsammans. ❤\n\nHar också sett till att ha kryssat in ”helgdagar” i kalendern från det att\nledigheten är slut. Så viktigt när en faktiskt i stort sett jobbar varje helg\nhela året runt och vardagarna lätt blir uppbokade. Viktigt att ta ledigt och\nta hand om sig själv för att orka, bibehålla glädjen och för att orka\nfortsätta finnas där för andra. Sett flera andra instruktörer som gått in i\nden berömda väggen och den vägen vill jag inte vandra.\n\nMed det önskar jag ALLA en riktigt TREVLIG SOMMAR!! Back in business 3:e juli\nmed förnyad energi. Det ser jag fram emot. 😀\n\n# Lek med stor och liten hund.\n\n8 februari, 201419 juni, 2018Maria Willers Lämna en kommentar\n\nVare sig man har en stor eller en liten hund är det viktigt och roligt att\nkunna leka **tillsammans.**\n\nDet ökar samhörigheten, viljan till samarbete och det är riktigt bra att kunna\nbelöna med lek och inte alltid ”bara” med en gottabit. Finns mycket att skiva\nom belöning och lek… Men här kommer några bilder. 🙂\n\nAtt kunna ge sig hän i leken tillsammans, och samtidigt  ha kroppskontroll så\nman inte råkar ta fel på leksak och fingrar.\n\nAtt på ett positivt sätt lära sig att släppa på kommando. Bra jobbat!\n\nLeka matte!?\n\nLära sig att komma tillbaka med kastade leksaker. Det blir så mycket enklare\noch roligare då… I alla fall i längden. 😉 (Tänk på att det ofta är allt för\nstressande för hunden att springa efter en kastad pinne/leksak om och om\nigen).\n\n_Mer bus och lek imorgon. 😀_\n\nMARIA WILLERS HUNDKRAFT. För att komma till hemsidan och aktuella kurser,\nklicka på bilden ovan. Copyright 2018\n\n# Instagram\n\nInga Instagram-bilder hittades.\n\n# Sök på sidan\n\nSök\n\n# Följ bloggen\n\nAnge din e-postadress för att följa denna blogg och få meddelanden om nya\ninlägg via e-post.\n\nE-postadress:\n\nFölj\n\n# Hitta oss på Facebook\n\n# Kategorier\n\n  * Dogsen\n    * Dante\n    * Milton\n    * Puzzel\n  * Hundträning\n    * agility\n    * Grundträning\n    * Klickerträning\n    * Personspår\n    * Rallylydnad\n    * Tricks, freestyle\n  * Inlägg med film\n  * Min träning\n    * Löpning, canicross\n    * Prestationspsykologi\n    * Simning\n    * Smoothies, kost, recept\n  * Rest. kategorier ospecificerade\n\n# Arkiv\n\nArkiv Välj månad december 2023  oktober 2023  juli 2023  december 2022  juni\n2022  april 2022  februari 2022  maj 2021  mars 2021  februari 2021  december\n2020  september 2020  augusti 2020  juni 2020  maj 2020  mars 2020  februari\n2020  december 2019  oktober 2019  september 2019  augusti 2019  januari 2019\nnovember 2018  september 2018  juli 2018  juni 2018  april 2018  mars 2018\ndecember 2017  september 2017  juni 2017  april 2017  januari 2017  december\n2016  november 2016  oktober 2016  september 2016  augusti 2016  juli 2016\njuni 2016  april 2016  mars 2016  januari 2016  december 2015  november 2015\noktober 2015  september 2015  juli 2015  juni 2015  maj 2015  april 2015  mars\n2015  februari 2015  januari 2015  december 2014  november 2014  oktober 2014\nseptember 2014  augusti 2014  juli 2014  juni 2014  maj 2014  april 2014  mars\n2014  februari 2014  januari 2014  december 2013  november 2013  oktober 2013\nseptember 2013\n\n# Bloggstatistik\n\n  * 18 991 hits\n\nBlogg på WordPress.com.Sälj eller dela inte min personliga information\n\n  * Prenumerera Prenumenerad\n\n    * Maria Willers med Milton & Tryggve \n\nSkapa konto\n\n    * Har du redan ett WordPress.com-konto? Logga in nu.\n\n  *     * Maria Willers med Milton & Tryggve \n    * Anpassa\n    * Prenumerera Prenumenerad\n    * Registrera\n    * Logga in\n    * Rapportera detta innehåll \n    * Visa webbplats i Inläggsvyn \n    * Hantera prenumerationer\n    * Minimera detta fält\n\n\n\n##\n\n##\n\nLaddar in kommentarer …\n\n\n\nSkriv en kommentar …\n\nE-post (Obligatorisk) Namn (Obligatorisk) Webbplats\n\n###\n\nIntegritet och cookies: Den här webbplatsen använder cookies. Genom att\nfortsätta använda den här webbplatsen godkänner du deras användning.  \nOm du vill veta mer, inklusive hur du kontrollerar cookies, se:  Cookie-policy\n\n",
    "links": "[]"
}