{
    "summary": "Hoppa till primärt innehåll\n\nHoppa till sekundärt innehåll\n\n# Historien om Alf\n\n## Det startade som en blogg om taxarna Alf och Theo och deras vardag, som\nsedan har utvecklats till ett företag ECHOSIERRA HUND som erbjuder\nhundträningstimmar, webbföreläsningar, videocoachning och sorgesamtal via\nvideo, allt på vetenskaplig och etisk grund\n\nSök\n\n### Huvudmeny\n\n  * Blogg\n  * ECHOSIERRA HUND\n  * Tjänster\n    * Hundträningstimmar\n      * Trick\n        * Ansök om tricktitlar med registrering i USA\n      * Trick&Trams\n      * Frivillig hantering\n      * Klicker & kommunikation\n    * Webbföreläsningar\n      * Planera för ett husdjur\n      * Att förlora en vän – om sorg\n      * Ta hand om dig som hundägare\n      * Frustration och Tålamod\n    * Videocoaching\n    * Sorgesamtal för djurägare\n    * För företag och föreningar\n    * Hundkojan\n      * Hundkojan del 1\n      * Hundkojan del 2\n      * Hundkojan del 3\n      * Hundkojan del 4\n      * Hundkojan del 5\n      * Hundkojan del 6\n      * Hundkojan del 7\n      * Hundkojan del 8\n  * Prislista\n    * QR kod\n  * Bokning\n  * E-böcker\n  * ECHOSIERRAS Djurägarguide för föräldrar\n  * Om oss\n    * Kontakt\n    * Träningsmetoderna\n    * Möt din instruktör\n    * Om bloggen\n      * Om NTD ITD ATD ETD 2K9 AtoZ ITD Theo\n      * Integritetspolicy\n      * Om SEVCH RLN NTD ITD ATD ETD 2K9 AtoZ Alf\n  * Gästbok\n    * Polls archive\n  * ECHOSIERRA SKAPA\n\n#  Etikettarkiv: Belöningsbaserad träning\n\n# Forskning om hur hundar upplever att få skäll\n\nPublicerat 2022/01/03 av  Echosierra Hund\n\nSvara\n\nGenom att skaffa husdjur tar vi också på oss ansvaret för att de ska få det så\nbra som möjligt. Äntligen börjar man studera hur djuren faktiskt har det hos\noss människor. Vi vet till exempel att för barn som ofta får skäll hemma, så\nkan det ha skadliga effekter på barnets självkänsla och utveckling. Om någon\ntrodde att det var annorlunda för husdjur, läs nedan.\n\nOavsett om det handlar om att försöka hålla hunden borta från soffan eller\nnågot annat kan det tära på tålamodet och många hundägare kan känna sig\nfrestade att skälla på sina hundar för att tillrättavisa dem. Samtidigt som de\nallra flesta troligen känner i maggropen att det inte är en bra idé. Och den\nkänslan är rätt, en studie visar nämligen att bestraffning av din hund kan\nresultera i _“långsiktiga negativa effekter på hundens mentala tillstånd”._\nResultatet visar att hundar som tränats med bestraffning och skäll mådde sämre\njämfört med de hundar som tränats med belöningsbaserade metoder, både på kort\noch lång sikt.\n\nDe hundar som tränas med bestraffande metoder (som alla handlar om att orsaka\nobehag hos hunden i tro att det lär hunden något) uppvisade mer\n**stressrelaterat beteende**. Det syntes även på deras kroppshållning samt att\nde hade högre nivåer av kortisol efter ett träningspass. De var även mer\npessimistiska.\n\nEtt portugisiskt forskarteam undersökte 92 hundar, däribland 42 valpar som\ndeltagit i belöningsbaserad hundträning och 50 från träning med en mer\navskräckande stil. Forskarna gjorde bland annat filminspelningar av hundarna\nunder träningspassen samt tog salivprov, dels i samband med träning och dels\nnär hundarna var hemma med sin ägare för att mäta kortisolnivåerna. Forskarna\nanvände även bilder från träningspassen för att titta efter stressrelaterat\nbeteende och studera hundarnas humör. De fann att hundar som fick aversiv\nträning hade högre kortisolnivåer, även när de var hemma. Detta jämfört med\nhundar som genomgick belöningsbaserad träning.\n\nNär de en månad senare testade hundarna i att hitta en skål med godis bland\ntomma skålar som luktade korv fann de att de hundar som hade genomgått den\nbelöningsbaserade träningen letade sig snabbt fram till de skålar som innehöll\ngodis. Den andra gruppen hundar inte var lika angelägen om att utforska rummet\nför att hitta godbitarna.\n\n## **Bestraffning kan ge bestående men**\n\nSlutsatsen som presenterades i tidningen bioRxiv var att avskräckande och\nbestraffande metoder kan ge **bestående skada på hundarnas psyke.**\n\nHär får vi helt enkelt alla tänka till. Vi skäller ju en del på Theo när han\nfår sina utbrott (stressrelaterat garanterat) och bara tokskäller åt till\nsynes ingenting. Till slut hjälper inget annat än att ropa att han ska sluta.\nHan blir som blockerad… Det är ju synd om honom men vi har inte lyckas hitta\nnågot som lugnar ner honom. Han har ju en historia före han kom till oss. Vi\nhar provat Adaptil och div kurser och träningar för att få honom att stressa\nav. Han är även kastrerad i det syftet. Men han har sin ADHD vad det verkar.\nHan skäller även när han blir lycklig och glad, t ex vid trickträning.\n\nKälla:  _Science Alert_\n\n\"The world is changed by your exampel, not by your opinion\"\n\nPublicerat i Hundträning |  Märkt Belöningsbaserad träning, Bestraffning,\nForskning, Kunskap |  Lämna ett svar\n\n### Vi finns här\n\nFölj oss!\n\nDo no harm Echosierra Hund är en del av Force-FreeArmy!\n\n### Läsarundersökningar\n\n**Är en bok i taxträning något du skulle vilja läsa?**\n\n  * Ja, upplägget känns relevant och bra\n  * Nej, jag är inte intresserad\n  * Vet ej\n  * Jag skulle läsa den om någon av mina vänner säger att den är bra\n  * Om jag fick den av min uppfödare skulle jag läsa den\n  * Kanske\n\nView Results\n\n Loading ...\n\n  * Polls Archive\n\n### BLOGGKATEGORIER\n\n  * Alf och Theos vardag (1 477) \n  * Året i bilder (11) \n  * Återvinning (7) \n  * Att förlora en vän (5) \n  * Bakom knuten (1) \n  * Dag 1-20/1-26 (38) \n  * ECHOSIERRA HUND (36) \n  * Egentillverkat (30) \n  * Humor (37) \n  * Hundträning (67) \n  * Livet (4) \n  * Om rasen Tax (31) \n  * Rallylydnad (36) \n  * Samarbeten (1) \n  * Taxträning (1) \n  * Trick (67) \n  * Uppdateringar (25) \n  * Utställningar (17) \n  * Viltspår (12) \n\n### Etiketter\n\n  * 2020\n  * 2021\n  * 2022\n  * Alf\n  * Alf och Theos vardag\n  * Artikel\n  * Avel\n  * Bild\n  * Diskbråck\n  * Djurplågeri\n  * ECHOSIERRA HUND\n  * Film\n  * Hemmabygge\n  * Hundkurs\n  * Hundpromenad\n  * Hundraser\n  * Hundtrick\n  * Hundträning\n  * hundägare\n  * Husbygge\n  * Hälsa\n  * Inlärning\n  * Jakt\n  * Jakthund\n  * Kunskap\n  * Kyla\n  * Ledarskap\n  * Natur\n  * Nyheter\n  * Okunskap\n  * Positiv förstärkning\n  * Rallylydnad\n  * Scavenger hunt\n  * Sjukdom\n  * Sommar\n  * Sorg\n  * Sy\n  * Tax\n  * Taxar\n  * Taxbus\n  * Theo\n  * Varning\n  * Vinter\n  * Vinterutmaning 2020\n  * Värme\n\n### FODERBOXEN\n\n### Share\n\nIntegritetspolicy finner du HÄR\n\n### WAP\n\n### Obs!\n\nAllt material på denna webbsida är skyddat enligt lagen om upphovsrätt.\n\nWebmaster: maria.sofia.strom@gmail.com\n\nIntegritetspolicy Drivs med WordPress\n\nOriginal text\n\nRate this translation\n\nYour feedback will be used to help improve Google Translate\n\n",
    "links": "[{\"link\": \"https://www.echosierra.se/arkiv/tag/beloningsbaserad-traning\", \"text\": \"Belöningsbaserad träning\"}]"
}