{
    "summary": "top of page\n\nSkip to Main Content\n\n  * Hem\n\n  * Om mig\n\n  * Mina tjänster\n\n    * Mer info om tjänsterna\n    * Villkor\n    * Ensamhetsträning\n  * Onlinekurser/Webinar\n\n  * Blogg\n\n    * Sökresultat\n    * Kontakt\n  * More\n\nUse tab to navigate through the menu items.\n\nLog In\n\n#   Jag erbjuder reko, belöningsbaserad privatträning, hundkurser och\nbeteendeutredningar.  \n  \nOavsett var ni bor kan jag hjälpa er då alla mina tjänster också finns\ntillgängliga online.  \n  \nJag bor på en liten, rar gård utanför Järna, ca 40 min från Stockholm med bil.\nVill man åka kommunalt går det också bra eftersom busshållplats finns precis\nvid mig.  \n  \nHar man inte möjlighet att komma hit så knåpar jag ihop en digital lösning som\npassar just dig och din hund!  \n  \nLäs mer på:\n\nMina tjänster\n\n## \"Caroline har varit fantastisk på att guida oss rätt i vår träning och har\nett personligt bemötande som gör det otroligt lätt att ta till sig övningarna\noch komma framåt snabbt. Jag och min hund Rita har haft så himla kul med\nonlinekurserna vi gått! Så härligt att hon lyckas vända saker som kan kännas\nlite jobbiga till något roligt för både hund och människa. Så fort vi får\ntillfälle kommer vi på kurs i Ekhammar också!\" - Kajsa\n\n### \"Caroline är kunnig och pedagogisk, hon har den sällsynta förmågan att\nförmedla kunskaper på ett lättbegripligt och otroligt varmt sätt. Jag har känt\nmig lyssnad på och bemött med solida kunskaper, empati och mycket kärlek. Allt\nsom behövs för att öka lusten att lära sig nytt och känna att det mesta är\nmöjligt med övning, glädje och konsekvens.\" - Ana\n\n\"Caroline är så varm, närvarande och har fantastiskt kunskap om hundar och\ndess beteende som hon delar på förståligt och pedagogiskt sätt. Vi har fått\notrolig mycket kunskap både muntlig, skriftligt och på film vilket gör det\nlättare att fortsätta träna hemmavid. På kort tid ser vi stora förändringar på\nvår osäkra hund tack vare alla bra träningstips och övningar som gett en\nsjälvsäkrare och tryggare hund. Caroline är otrolig snabb på återkoppla och\nsvarar på frågor på ett ödmjukt och proffsigt sätt.\" - Åsa\n\nKlicka här för att läsa fler omdömen\n\n### Hör av dig:\n\nFörnamn\n\nEfternamn\n\nMejl\n\nTelefon\n\nMeddelande\n\nVar bor du?\n\nSkicka\n\nTack så mycket, hörs snart!\n\n​\n\nContact\n\nbottom of page\n\n",
    "links": "[{\"link\": \"https://www.ekhammarhund.com/om-mig\", \"text\": \"Om mig\"}, {\"link\": \"https://www.ekhammarhund.com/minatjänster\", \"text\": \"Mina tjänster\"}, {\"link\": \"https://www.ekhammarhund.com/about-3\", \"text\": \"Mer info om tjänsterna\"}, {\"link\": \"https://www.ekhammarhund.com/villkor\", \"text\": \"Villkor\"}, {\"link\": \"https://www.ekhammarhund.com/general-8-1\", \"text\": \"Ensamhetsträning\"}, {\"link\": \"https://www.ekhammarhund.com/challenges\", \"text\": \"Onlinekurser/Webinar\"}, {\"link\": \"https://www.ekhammarhund.com/blogg\", \"text\": \"Blogg\"}, {\"link\": \"https://www.ekhammarhund.com/search\", \"text\": \"Sökresultat\"}]"
}