{
    "summary": "  * Prenumerera\n  * Aktuellt\n  * Ämnen\n    * Mat & hälsa\n    * Aktivt hundliv\n    * Valpliv\n    * Hundskolor\n    * Bloggar\n    * Tips och tricks\n    * Quiz\n  * Tidningen\n    * E-tidning\n    * Vanliga frågor\n    * Mina sidor\n    * Prenumerera\n  * Kontakt\n  * Sök\n\n#  Vilket sätt är bäst för att träna en hund?\n\n25 februari, 2022 |  Elisabet Broome\n\nVilket sätt är bäst för att träna en hund?\n\n**Lyckliga och lydiga hundar är önskemålet. Men hur lyckas man på bästa vis nå\ndet?  Ja, vilket sätt är bäst för att träna en hund?**\n\nDet har sen länge funnits olika metoder för att träna hundar. Förr i tiden\nanvändes oftare en bestraffningsbaserad metod. När hunden gjorde fel sa man\n”Fy!”, eller  drog i kopplet. Numera använder de flesta en så kallad\nbelöningsbaserad metod, när hunden gör rätt blir det godis och beröm!\n\n## Träna hundar\n\nMan kan alltså göra en grov uppdelning av de olika träningsmetoderna,\nbestraffnings- och belöningsbaserade metoder. I den så kallad\nbestraffningsmetoden använder man sig av obehag för hunden när den inte beter\nsig som man önskar. I belöningsmetoden använder man sig av belöningar när\nhunden gör rätt. Båda sätten kan såklart användas för att få en hund att lära\nsig saker. Frågan är vad de har för effekt på hundens mående och dess\nrelationen till matte/husse?\n\n## Ny forskning\n\nMan vet sen tidigare att hundar som tränas med bestraffningsbaserad träning\nhar större risk att utveckla osäkerhet och olika beteendeproblem. Problemet är\natt den här forskningen har varit baserat på uppgifter på ägarnas egen\nbedömning av träningsmetoder och hundbeteende.\n\nI en studie som blev klar för ett år sen har en portugisisk forskargrupp\nanvänt sig av betydligt noggrannare metoder för att undersöka frågan. Och även\nhär drar forskarna slutsatsen att bestraffningsbaserad träning riskerar att\nförsämra hundars välfärd. Både under själva träningen och efter träning.\n\n## Högre nivåer av stress\n\nResultaten visade att hundar som tränades med bestraffningsbaserade metoder i\nstörre grad visade stressrelaterade beteenden under själva träningen. Hundarna\nhade dessutom högre nivåer av stresshormoner i salivprov som togs i anslutning\ntill lektionerna. Inte nog med det, hundarna var dessutom mer “pessimistiska”\ni ett av testen, vilket tyder på en långvarig negativ effekt på hundarnas\npsykiska tillstånd.\n\nSlutsats: Bestraffningsbaserad träning riskerar att försämra hundars välfärd.\nOch det gäller både under träning och efter träning.  \n\n## Vill du läsa mer:\n\nhttps://pubmed.ncbi.nlm.nih.gov/33326450/\n\n## Artiklar på samma ämnen\n\n  * __ Träna i naturen – 3 enkla grundövningar \n\n### Missa inget!\n\nPrenumerera kostnadsfritt på vårt nyhetsbrev.\n\n### Aktuellt\n\nLadda fler\n\nHittade inget...\n\n____  \n  \nPolicy för datahantering, integritet och cookies  \n  \n© 2024 Härliga Hund. All Rights Reserved.  \n\n",
    "links": "[]"
}