{
    "summary": "Hoppa till innehåll\n\nHuvudmeny\n\n  * Hem\n  * Mina tjänsterSlå på/av meny\n    * Hundkurser stenungssund, stora höga, kungälv, linné\n    * Hundpsykolog & videosamtal\n    * Privatträning hund, stenungssund, göteborg\n    * Ensamhetsträning på distans\n    * Kloklipp göteborg\n    * Allmänna villkor\n  * Labanbags\n  * Online kurserSlå på/av meny\n    * Alla hundkurser online\n    * Logga in till mina kurser\n    * Valpkurs mini – Ensamträning online\n    * Valpkurs mini – bit, rumsrenhet & puppy blues\n    * Hundmöten – Träning & teori\n    * Koppelträning, kontakt och inkallning med valp\n    * Valpkurs online\n    * Unghundsövningar\n    * Osäkerhet, rädsla och skällande hos hund\n  * Blogg\n  * Om mig\n  * Hundpensionat göteborg\n  * Kontakt\n\nKontakt\n\n# Belöningsbaserad kontra bestraffningsbaserad inlärning.\n\n  * __ Sofia \n  * __ november 14, 2020 \n  * __ 8:56 e m \n  * __ Inga kommentarer \n\nSabina nyström photography\n\n###  \n\n### Det finns olika träningsmetoder när de kommer till hundträning och oftast\nbaserar den sig på tradition eller erfarenhet, och då oftast bara från en enda\npersons filosofi.\n\n### Vad är belöningsbaserad inlärning kontra bestraffningsbaserad?\n\n### Hur effektiva är metoderna, samt hur de påverkar hundens välbefinnande.\n\n### Och vad säger forskningen?\n\n### Operant betingning\n\nVid operant betingning associerar djuret ett beteende med dess konsekvens. Om  \nkonsekvensen är fördelaktig så kommer djuret utföra mer av beteendet men om\nkonsekvensen  \när aversiv minskar beteendefrekvensen. Det finns fyra sätt med vilka man kan\npåverka  \nfrekvensen av ett beteende. Om de var något dom verkligen tryckte på att vi\nskulle kunna utantill på hundpsykolog utbildningen så var det detta. Om vi\ninte förstår hur vi formar beteenden liksom, ja då blir de väldigt svårt att\nträna hund.\n\n  * Positiv förstärkning: Tänk + alltså att du lägger till något (Tex. godis) i följd av ett beteende som du vill förstärka och se mer av. Tex. sitt, hunden sätter sig och du lägger till en godis som hunden vill ha.\n  * Negativ förstärkning: Tänk – alltså att de finns ett obehag som släpper när rätt beteende utförs. Kommande förväntad konsekvens  _uteblir / tas bort_  då rätt beteende utförs. Du nyper hundens öra, när hunden slutar göra de oönskade beteendet släpper du örat. Effekten av inlärningen blir att något som är obehagligt försvinner. Något obehagligt avbryts för hunden.\n  * Positiv bestraffning: Tänk + du lägger på ett obehag när du vill få bort ett beteende. Tex. Hunden drar i kopplet, du rycker hårt i kopplet och hunden slutar dra (för en liten stund). Det här är den vanligaste metoden och den värsta.\n  * Negativ bestraffning: Tänk – något försvinner när hunden tar till ett beteende för att få de den vill han. Tex. Om hunden hoppar efter din mat så tar du bort den eller äter upp den själv. När hunden sitter stilla får den.\n  * Utsläckning: Du ger ingen respons på hundens beteende. Hunden upplever att de beteendet inte fungerar för att få de den vill ha och beteendet försvinner.\n\n#### Det är lite klurigt att memorera dom olika, det tog mig lång tid att\nförstå.\n\n#### Sammanfattar och repeterer igen:\n\nPositiv förstärkning: lägg till något bra.\n\nNegativ förstärkning: Ta bort något dåligt.\n\nPositiv bestraffning: Lägg till något dåligt.\n\nNegativ bestraffning: Ta bort något bra.\n\n#### Hunden handlar antingen:  · för att uppnå något den vill ha · för att\nundvika något obehagligt.\n\n> **Förstärkning ökar ett beteende. Bestraffning minskar ett beteende.**\n\n### Belöningsbaserad kontra bestraffningsbaserad inlärning?\n\nBelöningsbaserad inlärning betyder att man jobbar med belöningar och markerar\nrätt beteenden, det man vill se mer av till följd av beröm. Man berömmer\nhunden och ger den gärna en lön (något den vill ha). Man undgår korrigeringar\neller visar hunden när något blivit fel. Blir något fel bryr man sig inte.\n**Bestraffningsbaserad inl** ärning betyder att du visar hunden när du är\nmissnöjd med dens beteende, du anmärker fel. Lägger gärna på obehag för att få\nfram dom beteendena man vill ha. Om man använder sig av straff (och straff\nbehöver inte vara fysiskt obehag alltid, utan kan ochså vara en stirrande\nblick eller ett strängt NEJ) så om man nu använder sig av obehag när något går\nfel då är basen en bestraffningsbaserad inlärning i min väld.\n\n### Påverkan på beteende, så säger forskningen:\n\nHundar som tränas enbart med positiv förstärkning visar färre problembeteenden\njämfört med  \nom bestraffning ingår i träningen (Hiby et al., 2004; Blackwell et al., 2008).  \nHiby et al. (2004) visade att antalet problembeteenden var korrelerat med\nfrekvensen av straff  \nmen att ingen korrelation fanns med antalet belöningar. Specifika samband som\nhittades var  \natt användande av straff gav högsta andelen separationsrelaterade problem\nmedan användande  \nav enbart positiv förstärkning innebar att färre hundar blev upphetsade.  \nEn kombination av positiv förstärkning, negativ förstärkning och positivt\nstraff i hundträning  \nger mer undvikande beteenden hos hunden jämfört med om endast positiv\nförstärkning  \nanvänds. Exempel på undvikande beteenden är att undvika eller gömma sig från\nmänniskor  \noch hundar. Om positivt straff används i träningen så visar hundarna\nsignifikant mer  \naggressivitet mot främmande/kända människor/hundar eller i samband med\nutfodring än om det inte används (Blackwell et al., 2008). Samband finns även\nmellan positivt straff och oönskade responser, exempelvis aggressivitet mot\ntränaren, vid tillsägning (Blackwell et al.,  \n2008; Herron et al., 2009)\n\nLär dig mer om inlärning här. Väldigt tydlig PP\n\n### Varför fungerar straff?\n\nStraff eller så kallad quickfix ger resultat direkt och det är kanske därför\nde attraherar människan så mycket. Hunden blir skrämd och vill direkt upphöra\nmed de den gör för att undgå obehaget. Överlevnad. Hunden visar oftast vad vi\nkallar ”lugnande signal” när dom märker att vi blir upprörda. Dom lite stänger\nav, apati. I längden får du fram något som kallas inlärd hjälplöshet (som\nbetecknar ett apatiskt tillstånd av vanmakt som beror på att individen utsatts\nför oförutsägbara eller okontrollerbara konsekvenser) och de blir svårt att\nträna hunden eftersom den är rädd för att göra fel. Samma sak gäller när man\növeröser hunden med intryck , så kallat ”flooding” översvämning. Praktiska\nexempel är när man går in på hundmässan med sin reaktiva hund, de blir så\nmycket hundar att den istället stänger av och inte gör utfall ”flooding”.\nCeasar milan jobbar med flooding och positiv bestraffning, samma sak sker när\nhan skall ta in en reaktiv hund till hans flock, hunden stänger av. Hunden\nblir överöst med intryck och väljer att visa sig undergiven.\n\n### Andra inlärningsprinciper hos hund\n\nInlärningsprinciper hund:  \n• Habituering/tillvänjning: anpassning till omgivningen  \n• Respondent inlärning: att lära via association (tex. klassisk betingning).  \n• Operant inlärning: att lära via konsekvenser  \n• Modellinlärning: att lära via observation\n\nEn bra bild-metafor om belöningsbaserad inlärning, från djur pedagogen.\n\n### Privatträning\n\nEn beteendeutredning är en analys och kartläggning på hundens vanor,\nerfarenheter och hälsostatus.\n\nLäs mer\n\n## Dela inlägget\n\n__\n\n__\n\n__\n\n__\n\n__\n\n### Lämna en kommentar Avbryt svar\n\nDin e-postadress kommer inte publiceras. Obligatoriska fält är märkta *\n\nSkriv här..\n\nNamn*\n\nE-post*\n\nWebbplats\n\nSpara mitt namn, min e-postadress och webbplats i denna webbläsare till nästa\ngång jag skriver en kommentar.\n\nFacebook-f __ Instagram __ Youtube __\n\nFölj mig för daglig hundvlogg & hundtips!\n\nkontakt@klemminghundar.se\n\n#### made by Oskar Design Agency\n\nRulla till toppen\n\n# Infoga/redigera länk\n\nStäng\n\nAnge destinationens URL\n\nURL\n\nLänktext\n\nÖppna länk i en ny flik\n\nEller länka till befintligt innehåll\n\nSök\n\n_Inget sökord specificerat. Visar senaste objekten._ _Sök eller använd\npiltangenterna (upp och ned) för att välja ett objekt._\n\nAvbryt\n\nAviseringar\n\n",
    "links": "[{\"link\": \"https://www.klemminghundar.se/beloningsbaserad-kontra-bestraffningsbaserad-inlarning/#respond\", \"text\": \"\"}, {\"link\": \"https://www.klemminghundar.se/beloningsbaserad-kontra-bestraffningsbaserad-inlarning/#respond\", \"text\": \"Avbryt svar\"}]"
}