{
    "summary": "  * Saunas\n    * Mobile Saunas\n    * Wood-Burning Saunas\n    * Electric Saunas\n    * Consults\n    * Sauna Plans\n    * Sauna building Class\n  * About\n  * Blog\n  * Contact\n\nSelect Page\n\n  * Saunas\n    * Mobile Saunas\n    * Wood-Burning Saunas\n    * Electric Saunas\n    * Consults\n    * Sauna Plans\n    * Sauna building Class\n  * About\n  * Blog\n  * Contact\n\n#\n\n# Mobile Saunas\n\n### You can take it with you! The mobile sauna is a perfect solution for\nrenters or for your vacation home. Take your mobile sauna to a gathering of\nfriends or your favorite location. Once you are sitting inside you forget that\nyou are on a trailer.\n\nRob Licht has been building traditional Finnish-style saunas for 35 years! Our\nsaunas are custom-designed and handcrafted with all the care you’d expect from\na quality home builder. Unlike our competitors, we use safe materials for high\ntemperatures and proper ventilation. The saunas we build are designed as wet\nspaces and get as hot (100°C +/-) and steamy as you’d like. Water is poured on\nthe pile of rocks to create löyly, steam, which is the authentic sauna\nexperience.\n\nWe offer traditional wood-fired or electric mobile saunas in your choice of\ncolor! These mobile saunas have all of the same attention to detail as our\nwood-burning and electric outdoor freestanding saunas.  bath.\n\n\n\n  * Follow\n  * Follow\n  * Follow\n\n## MOBILE SAUNA MODELS\n\n _We offer two sizes of mobile saunas (a sauna built on a trailer) starting\nwith standard options including your own unique color or stain!_\n\n_**Our mobile saunas can be wood-fired or electric  **_\n\n## “THE ESSENTIAL”\n\n##### mobile sauna 1.0\n\nSize: 5×8 ft (single room)  \nSeats: 4 comfortably  \nExterior siding: painted pine – choice color  \n **Heater:** Harvia M3 wood-fired from inside  \nOR Harvia Topclass Electric (240 Volt Plug-in)  \nInterior: Cedar  \nWeight: 2000 lbs\n\nBase price: $27,500*\n\n\n\n## “THE PURIST”\n\n##### mobile sauna 2.0\n\nSize: 6.5 x10 ft  \n(with or without an enclosed dressing room)  \nSeats: 4 comfortably  \nExterior siding: painted pine – choice color  \n **Heater:** Harvia M3 wood-fired from inside  \nOR Harvia Topclass Electric (240 Volt Plug-in)  \nInterior: Cedar  \nWeight: 3000 lbs\n\nBase price: $35,500*\n\n##\n\n## ADDITIONAL OPTIONS:\n\n_To further customize your sauna, we have  \nadditional options to choose from._\n\n**Lämpimämpi  Wood Stove:** A custom welded  \nwood-burning stove by Rob Licht wood-fired from the outside  \n(as seen in pictures): add $1500\n\n**Solar Lighting Package:** 20 watt solar powered  \nLED lighting: add $1000\n\n**Exterior:  **Knotty Cedar and bevel siding: add $750\n\n**Interior:  **Hot Yoga Conversion (fold-up benches): add $500 ****\n\n_Inquire about our off-the-grid Electric Solar option!_\n\n**We Deliver!**  \n$3.25/mile one way\n\n© Rob Licht Custom Saunas. 2023\n\n_*Prices subject to change due to availability and cost of materials. Prices\nare FOB frommy shop in Ithaca, NY and do not include taxes, title or\nregistration fees. There is no tax on out-of-state sales on mobile saunas._\n\n## “So thrilled with our sauna… We have named it ABUNDANCE, as a reminder of\nhow wonderful life is and continues to be. The mobility has allowed us to\nshare it with many people…”\n\n# \"I AM FORTUNATE TO HAVE, IN MY CARE, ONE OF YOUR WORKS OF ART.”\n\n## Follow the Saunas! Check out our sauna life in the finger lakes, new york.\nfacebook @customsaunas & instagram @saunasbyrob\n\n### Our mobile saunas are beautifully hand-built in the traditional finnish-\nstyle.\n\nThe rocks make the sauna hot (100°C +) and with water (Löyly) as steamy as\nyou’d like. The high and low benches offer places you and your guests can\nenjoy. These portable saunas can be wood-fired (with wood-burning sauna stove)\nor electric and are built with integrity for the road.  The saunas are\ndesigned and built to last with high-quality, and safe materials. They haul\nnicely to your favorite spot by a lake, coastal beach, pond or parked in your\nbackyard. Together we work with you to custom-build the sauna experience you\ndream of.  Tell us what you are interested in today>\n\n###\n\n© 2023 Rob Licht Custom Saunas, a division of Rob Licht Studio, LLC. All\nrights reserved. All Sauna Designs and Photos are intellectual property and\ncannot be used, adapted, copied, or published. without permission.\n\n",
    "links": "[{\"link\": \"https://roblichtcustomsaunas.com/saunas/mobile-saunas\", \"text\": \"Mobile Saunas\"}, {\"link\": \"https://roblichtcustomsaunas.com/saunas/mobile-saunas\", \"text\": \"Mobile Saunas\"}]"
}