{
    "summary": "HomeFaqupcoming EventsContactPricing\n\nBook Now\n\n## Woodfired  \nWellness  \nExperience\n\n# Mobile Sauna Delivered to Your Driveway, Campsite, or Business\n\nElevate any occasion with our mobile sauna and cold plunge experiences. This\ntime-honored wellness ritual promotes relaxation, recovery, and rejuvenation\nand offers a unique way to connect with friends and family—all from the\nconvenience of your own home, campsite, or business location.\n\nview Packages\n\n## Mobile Sauna Experiences Delivered to You\n\nYou may already be aware of the vast health and wellness benefits of a wood-\nfired sauna, but what you might not know is that now the sauna can come to\nyou!\n\n‍\n\nWhether you’re an avid athlete, a weekend warrior, or somewhere in between—the\nrelaxation, rejuvenation, and recovery benefits of a traditional wood-fired\nsauna can now be enjoyed just a few steps from your own front door.\n\n‍\n\nInspired by the authentic Finnish saunas found throughout Scandinavia, the\nfounders of Fyre Sauna were determined to bring the transformative wellness\nexperience of wood-fired saunas to their own community. Fyre Sauna delivers\nmobile sauna and cold plunge experience right to your chosen location so\neveryone can enjoy wood-fired wellness.\n\n## Wellness  \nWherever  \nYou GO\n\n### OUR MOBILE SAUNA TRAILER IS THE PERFECT ADD-ON TO SPECIAL EVENTS, CAMPING\nTRIPS, OR BUSINESS RETREATS.\n\n### Businesses Events & Popups\n\n### Treat your customers to a unique wellness experience\n\n### Special Occasions\n\n### Discover a new way to connect with friends and loved ones\n\n### Outdoor Adventures\n\n### Relax, recover, and unwind after a day of exploring the outdoors\n\n## Sauna Trailers  \nProvide a Holistic  \nExperience\n\n### Our mobile sauna trailers provide a holistic way to experience wellness\nfor the mind and body while connecting with others.\n\n### Recover\n\nAs your body sweats out toxins, your blood vessels open up, improving\ncirculation and boosting blood oxygen levels—aiding the muscle recovery\nprocess.\n\n### Relax\n\nDeeply penetrating heat targets muscle tension while improving blood\ncirculation—allowing endorphins to flow and anxieties to melt away.\n\n### Rejuvenate\n\nCold plunging creates a rush of energy from increased levels of\nnorepinephrine, which helps regulate blood pressure and boosts your body’s\ndopamine and serotonin production.\n\n### Reconnect\n\nThe sauna experience is a wonderful way to connect with friends and loved ones\nas you share in the powerful transformation of your mind and body.\n\n## Enjoy a Hassle-free  \nMobile Sauna Experience\n\n### All Fyre Sauna trailers are equipped with everything you need to maximize\nyour wellness and enjoy your wood-fired experience.\n\nSeats up to 10 people\n\nSmokeless stove\n\nAdjustable heat\n\n2 Cold plunge Tanks\n\nOutdoor seating\n\nFree set up & take down\n\nDelivered  \nto you\n\nNon-toxic cleaning\n\nOutdoor shower\n\nSustainable cedar\n\nCotton towels\n\nSolo stove fire pit\n\n### *Free Setup and take down within 25 mile radius of Woodinville, WA.  \nPlease contact us for delivery outside of this area.\n\n“Fyre Sauna was the perfect addition to our camping trip! Getting to end a\nlong hike with the sweat session and the cold plunge was exactly what we\nneeded to re-energize. I highly recommend booking a daily session to try it\nout!”\n\nSally Susan\n\n## Mobile SaunA  \nRental Pricing\n\n### Daily Rental\n\n$550 for 1st day  \n$400 for each additional day\n\n‍\n\nFree delivery, setup, and takedown within 25 miles of Woodinville, WA.\nOvernight rentals are limited to 2 days, please contact us for extended\nrentals.\n\nBook Now\n\n### Business events & popups\n\nWhether you’re hosting a wellness event, celebrating your gym opening, or\nplanning a corporate event, we’d love to be there!  Tell us more about your\nevent and we’ll be in touch with custom pricing options.\n\n‍\n\n **Current popup pricing:  **\n\n$30 for single popup spot\n\n$250 for private popup session\n\nElevate your event\n\n### Looking to Book  \na Unique Sauna Experience?\n\nTell us more about what you’re looking for and we’ll find a way to make it\nhappen!\n\nLet’s connect\n\n## About the  \nFyre sauna  \nTeam\n\nBringing authentic sauna experiences to the Pacific Northwest\n\nDuring a trip to Scandinavia, the founders of Fyre Sauna first experienced the\ntransformational benefits of the Finnish sauna experience. As a team of\nfirefighters and wellness enthusiasts, they’re passionate about sharing the\nauthentic sauna experience with all communities throughout the Pacific\nNorthwest.\n\n## Frequently  \nAsked Questions\n\nWhere do you deliver?\n\nWe deliver within a 25 mile radius of  Woodinville, Washington. Please contact\nus for deliveries outside this radius.  \n\nHow should I prepare for the delivery?\n\nIn order for us to park the trailer, you will need to have a clear flat space\nwide enough for us to back into and park the sauna. Set up and take down take\nabout 30–45 mins, depending on the site’s parking situation.  \n\nWhat are the health benefits of using a wood-fired sauna?\n\nSauna therapy provides a number of health benefits including:  \n\n_Aiding in muscle recovery • Improved heart health  • Reduced stress •\nImproved immune function • Improved sleep • Decreased inflammation • Sustained\nenergy levels throughout the day • Anti-aging properties • Increased\ncirculation • Detoxification • Increased endorphins helps fight depression •\nAnd more!_  \n\nWhat installation hookups do I need?\n\nJust a water source! In order to fill the cold plunge, you will need access to\na water spigot.  \n\n **No electricity is required to use the sauna.** All heat is produced from\nthe wood burning stove. The Bluetooth surround sound and LED lighting is\npowered by the exterior solar panel.  \n\nWhat is a cold plunge?\n\nThe cold plunge is an integral part of the traditional hot-cold contrast\ntherapy cycle. Typically, the sauna will be used for 15-20 mins and is\nimmediately followed by 1-5 mins in the cold plunge (time depends on cold\ntolerance level). This cycle can be repeated for up to 3-4 rounds.  \n\nOur cold plunge is a 100 gallon galvanized tank that we will fill with water\nupon delivery. We provide ice to chill the water for use.  \n\nWhat are the sanitizing practices?\n\nAfter every rental, our saunas are disinfected with highly effective natural\nproducts from top to bottom—no harsh cleaning chemicals required. The sauna\nreaches up to 200 degrees, which acts as a natural disinfectant during the\npost cleaning drying process. All towels are machine washed between rentals.  \n\n### For More Information,  \nVisit Our FAQ Page\n\nLearn more\n\n## Mobile Sauna Delivered to You For Any Occasion\n\nEnjoy woodfired wellness wherever you go—at events, out in nature, or in the\ncomfort of your own driveway.\n\nBook Now\n\n## Stay in  \nTouch\n\n### Sign up for our newsletter for special offers and details about upcoming\npopup events.\n\nThank you! Your submission has been received!\n\nOops! Something went wrong while submitting the form.\n\n© Copyright 2024 Fyre Sauna. All Rights Reserved. Privacy Policy.\ninfo@fyresauna.com\n\nWebsite created by Baylii Branding\n\n",
    "links": "[{\"link\": \"https://www.fyresauna.com/\", \"text\": \"Home\"}, {\"link\": \"https://www.fyresauna.com/faq\", \"text\": \"Faq\"}, {\"link\": \"https://www.fyresauna.com/events\", \"text\": \"upcoming Events\"}, {\"link\": \"https://www.fyresauna.com/contact\", \"text\": \"Contact\"}, {\"link\": \"https://www.fyresauna.com/#pricing\", \"text\": \"Pricing\"}, {\"link\": \"https://www.fyresauna.com/contact\", \"text\": \"Elevate your event\"}, {\"link\": \"https://www.fyresauna.com/contact\", \"text\": \"Let’s connect\"}, {\"link\": \"https://www.fyresauna.com/faq\", \"text\": \"Learn more\"}, {\"link\": \"https://www.fyresauna.com/privacy-policy\", \"text\": \"Privacy Policy.\"}]"
}