{
    "summary": "Skip to content\n\nMy Account\n\n$0.00 0 Cart\n\nMy Account\n\n$0.00 0 Cart\n\n  * Home\n  * Sauna Talk\n  * eBook\n  * Consultation\n  * Journal\n  * Sauna Map\n  * About\n  * Shop\n\nMenu\n\n  * Home\n  * Sauna Talk\n  * eBook\n  * Consultation\n  * Journal\n  * Sauna Map\n  * About\n  * Shop\n\nSearch\n\nSearch\n\nClose this search box.\n\n  * Home\n  * Sauna Talk\n  * eBook\n  * Consultation\n  * Journal\n  * Sauna Map\n  * About\n  * Shop\n\nMenu\n\n  * Home\n  * Sauna Talk\n  * eBook\n  * Consultation\n  * Journal\n  * Sauna Map\n  * About\n  * Shop\n\nSearch\n\nSearch\n\nClose this search box.\n\n# Mobile Saunas\n\n  * January 22, 2019 \n\n  * Mobile Saunas, Types of Saunas\n  * authentic, custom mobile saunas, fortune bay, hiki hut, mobile sauna, stokeyard, wood burning\n\n“The cool thing about a mobile sauna is that it goes where you go.”\n\n“The cool thing about a mobile sauna is that it goes where you go.” We’ve got\nthe Hiki Hut Sauna in Duluth, the 612 Society Sauna in Minneapolis, Custom\nMobile Saunas, Sisu, the Traveling Sauna, the Stokeyard Mobile Sauna, Fortune\nBay Mobile Sauna, and these are just the ones that Saunatimes has told you\nabout! (so far, and there’s more!).\n\nOnly in Minnesota can you go skate on smooth Minneapolis lake ice, then walk a\nfew steps to a mobile wood burning sauna. Mobile saunas are so awesome as we\ncan bring sauna to Nature. And we can bring Nature to sauna.\n\nSoon there may be a mobile sauna idling at many traffic lights around your\ntown. Until that time, all we can say is: “more mobile saunas!” Are you ready?\n\n## Why are Mobile Saunas More Popular in the US Than in Finland?\n\nIf you’re driving in Finland and stop at a convenience store, try striking up\na conversation with the clerk behind the counter. Ask them about sauna. 88%\nchance their eyes will light up, and you’ll have to politely cut the\nconversation short and back your way out the door, to get back on the road.\n\nDon’t believe me? Try it.\n\nNot so in the US. Undertaking this same scenario, whether in Sheboygan,\nChicago, or Charlotte, 88% chance that the clerk behind the counter in the US\nwill narrow their eyes in confusion or distrust, and will maneuver themselves\na little closer to the hidden button under the counter that summons the local\npolice.\n\nAttention Finns: This is the environment we have to deal with here in the US.\n(People generally think we are crazy).\n\n“In my opinion, foreign people who are really dedicated and into sauna by\ntheir own will, they have so much heart in it, which makes them also tougher…\nThere is a reason why they enjoy the sauna so much. They had to work to get to\na sauna. We were maybe born there, so it is different for us.”\n\n– Jesse Hämäläinen, Export Manager, Narvi Stoves\n\n## Chassis Considerations for a Mobile Sauna Build\n\nGuest post series continues. Please welcome Wade Litt to saunatimes who will\nhelp you with chassis considerations for your mobile sauna build. Wade started\nbombarding Glenn with mobile sauna questions, and before too long we realized\nthat Wade was very much up to speed on mobile sauna. He has done a lot of\nresearch and we are pleased to be able to share his story with you… for you!\nWelcome Wade!\n\n### Enter Wade\n\nMy parents had a traditional sauna built a few years ago and I’ve been hooked\never since. Not only has it been an amazing place to connect with family and\nfriends, but also a relaxing place to disconnect and find solitude. My\nenthusiasm for sauna has me planning a pilgrimage to Finland this winter if\ntravel restrictions allow, and with a rough road map full of ideas from\nGlenn’s 2019 trip and a good Finnish friend to boot, I should be set!\nApparently, though, my parents’ sauna and a trip to Finland isn’t enough to\nsmother my desire for a good sweat; my Kuuma stove just arrived. I’m going to\nbuild a mobile sauna!\n\n#### Mobile Sauna Trailer Research\n\nMy first step has been researching the various chassis to house both the hot\nroom and a small changing room – the winner of most unique being a sauna built\ninside a combine harvester, found in pictures from a 2018 mobile sauna\nfestival in Finland – their next go-round in July is another trip I’d love to\nmake next year. Although my county’s combine demolition derby is being held\nthis week and I could probably score a great deal on a fixer-upper combine, I\nwanted to consider more common mobile sauna chassis options.\n\nI was initially debating the tradeoff between a horse trailer (à la the Little\nRed Sauna in Maine. Or the one found in a recent Saunatimes article: “If you\nheat it, we will come!”) versus an enclosed trailer of some sort – perhaps\neither a cargo trailer or fish house trailer depending on budget\nconsiderations. I’ve also seen a couple built inside older, pull-behind camper\nshells.\n\n#### Law of Löyly and Mobile Sauna\n\nAs it turns out, researching the first step of a mobile sauna build can\nquickly lead one down the rabbit hole of researching the complete details of\nan entire sauna build. This is especially because space is a scarce resource\nin trailers. Stove selection, the width of walls and benches, and trading off\nspace for the hot room and changing room become important considerations. It\ndoesn’t seem too difficult to find long trailers – 12 and 16 foot are fairly\ncommon lengths. Height and width, however, are where sizing issues creep in.\nSix feet seems to be a common height and width for many horse and cargo\ntrailers. It becomes harder to adhere to the Law of Löyly in short-ceilinged\ntrailers and bench width and layout become more of a puzzle in narrow\ntrailers. Used trailers on Craigslist or Facebook Marketplace weren’t too\ndifficult to track down. However, from my search anyway, many trailers seemed\ntoo short or narrow for my ideal hot room.\n\nAesthetics are also an important part of the chassis debate. I may end up\nmaking a side business out of my sauna, although even if it ends up being\nlargely for personal use. I want it to look nice. If it does become a side\nhustle, however, it should be social media-ready to help it market itself.\nAlthough barrel saunas have superb aesthetic appeal, they lack the thermal\nqualities and tall, upper benches I’m after – there’s only so much good heat\nI’m willing to sacrifice for good looks! Horse trailers seem to have a nicer\nvisual appeal to me than cargo trailers. Maybe it’s a subtle nod to the\nagricultural and rural roots of traditional, old world saunas or, perhaps,\nit’s simply because I grew up in the country. Whatever it may be, I hope to\ninstall at least one scenic window in the hot room, and the chassis impacts\nthe ability to do this. One would either need to work around the current\nframing of the trailer, or be prepared to structurally reinforce any necessary\ncustomizations to install the perfect window in the perfect location.\n\n#### Mobile Sauna Chapter in Sauna Build Start to Finnish\n\nIt’s possible I only notice them more due to my own recent obsession. But I\nthink the phenomenon is real: mobile saunas are on the rise. They are still\nrelatively young in their development. However, and it has been tricky to find\nresources for the more technical questions I have been facing around topics\nlike chassis selection. After a sizeable amount of independent research, I\nfinally reached out to Glenn at Saunatimes to get his take. Much to my\ndelight, he is finishing an updated edition of his eBook, “Sauna Build, From\nStart to Finnish,” which includes a new chapter on mobile saunas. What’s more,\nthere is a section specifically on chassis options, including horse trailers,\ncargos trailers, fish house trailers, and homemade trailers. This topic is\njust what I had been researching!\n\nThe new chapter covers many of the topics I had been thinking about above, but\nalso other important considerations like homemade trailer chassis, weight\ndispersal around the axle, legal limits on trailer widths, solar power,\nsurrounding decking, and other topics. Reading an advance copy of Glenn’s\nsecond edition book gave me new ideas and useful technical details that will\nbe critically important in my build.\n\n#### Lots More Research\n\nArmed with the information in the newest edition of the Saunatimes eBook, I\ncontinued the search and debate on which chassis to use. My Dad is convinced\nthat his six-foot wide livestock trailer would be too narrow to be converted\ninto my sauna. I passionately resisted initially, especially because such\nsaunas already exist. But I have started to come around. Insulation, the vapor\nbarrier, an air gap, and siding on both sides really eats away at the finished\nwidth. Designing a roomy layout which also includes the critical upper bench\nbecomes tricky. Especially if it ends up being used on a commercial level with\nseveral people in the hot room at once, My online search continued with many\nmessages to sellers for the internal dimensions of their trailers. I began to\nget an eye for their dimensions and became better at filtering out trailers\nthat would be too small.\n\nWhether it was a random-chance ad or Facebook’s algorithm detected my\nnarrowing focus on larger chassis. An unexpected posting took my idea of a\nmobile sauna to an entirely new level. The new chapter in the Saunatimes eBook\nbriefly mentions vehicle considerations for towing a mobile sauna but doesn’t\ngo into great detail. The gist of it, though, is that you should probably have\na truck, which I do not. The unexpected Facebook Marketplace post solved this\nproblem while also providing a chassis that was slightly wider (6’10”), taller\n(6’9”), and longer (15’10”) than I been finding with the horse and cargo\ntrailers.\n\n#### Bread Truck Mobile Sauna\n\nI am now the proud new owner of a former bread truck. Taking this big step in\nmy mobile sauna build is exciting. The truck fits many of my desired\nspecifications slightly better than a conventional trailer chassis, although\nit has opened up an entirely new set of challenges. For some reason, the first\ninsurance company I called didn’t want to insure a vehicle with a giant wood\nstove in the back of it.\n\n## The Mobile Sauna Revolution Will Be Televised\n\n#### 09/12/2019\n\nFrom Minnesota to Maine, Britain to the Baltics, a massive independent fleet\nof mobile saunas are being constructed and activated, all in the spirit of\nbringing good sauna to people in very cool places. How is it that the mobile\nsauna revolution is happening right now?\n\n“Both evolution and innovation thrive in collaborative networks where\nopportunities for serendipitous connections exist. Great discoveries often\nevolve as slow hunches, maturing and connecting to other ideas over time.”\n\n-Steven Johnson, “Where Good Ideas Come From”\n\nIn Duluth Minnesota, we have Hiki Hut mobile sauna, making its way along the\nshores of Lake Superior, the World’s largest freshwater lake. You can read our\ninterview with the founders here.\n\nWe have Justin Juntunen who has “Finnished” the framing stage of his Cedar &\nStone Mobile Sauna installation, which promises to be deployed and activated\nfor locals and tourists in Duluth Minnesota, “Sauna Capital of the United\nStates!”.\n\nFurther North, Fortune Bay Resort and Casino has constructed their mobile\nsauna, where folks can “try their luck” with cool downs along the shores of\nLake Vermilion.\n\nIn Minneapolis, a fitness gym crew, with a bent towards thermogenesis\nwellness, are in the midst of building their wood fired trailer sauna for\nparking lot and frozen lake deployments.\n\nAt 4700 Nicollet Ave., South Stokeyard Outfitters, saunatimes, and Custom\nMobile Sauna‘s have turned a decomissioned power station into a pop-up Mobile\nSauna village and show room where two of Stokeyard Custom Mobile Saunas are\nactivated. You can read a recent article about sweating at The Yard here.\n\nThe budding Mobile Sauna building business, Custom Mobile Saunas, is currently\n“4-6 weeks out in production” says Eric Bongard, founder, as he checks with\nhis build team between welding mobile sauna frames.\n\nThe 612 Sauna Society is gearing up for its second season, deployed outside\nthe Trailhead, Theodore Wirth Park in Minneapolis. “After a hike, mountain\nbike, or ski through the old growth park trails, at Theo Wirth, you come upon\na beautiful view of the Minneapolis skyline, then look down into the\nforeground to see folks cooling down outside the 612 sauna, and i’m just in\nawe of how beautiful our city is, and how wonderful it is to exercise in\nNature, then sauna” declares Glenn Auerbach, board member, 612 Sauna Society.\n\nFurther East, The Little Red Sauna has been completed! This is Maine’s first\nwood-fired mobile sauna, and beckons not to be the last.\n\nEven further East, we have the just completed barrel sauna, thanks to Lewis\nJenkinson’s Regener8saunas. Lewis is keen to deploy his new mobile sauna to\nhelp others with “mental chilling out” and decompression from our busy lives.\n\nBrighton Beach Box wood fired sauna and spa is turning blistery cool Brighton\nevenings into warm community gathering wellness thermogenesis activations,\nthanks to their wood fired sauna.\n\nAnd not to be outdone, the Finnish Sauna Society, Helsinki, Finland, has\ncommissioned their own mobile sauna, to complement their 7 fixed saunas, most\nof which are smoke saunas.\n\nSaunatimes started their own mobile sauna revolution in 2010, and it’s been a\njoy to see the wave swell. The rising sauna tide is lifting all these mobile\nsauna boats. The collaboration between collaborators has been wonderful to be\na part of\n\n__Prev Previous Post\n\nNext Post __Next\n\n###### Recommended Posts\n\n######  Outdoor Sauna: Sizing, Flooring, Electricity?\n\nApril 5, 2009  93 Comments\n\n######  10 things you may want to know about barrel saunas\n\nSeptember 15, 2016  36 Comments\n\n######  A mobile sauna build project that the most amateur builder can Finnish\non their own\n\nApril 12, 2020  34 Comments\n\n###### 31 Comments\n\n### 31 thoughts on “Mobile Saunas”\n\n  1. Clint\n\nFebruary 11, 2010 at 11:13 pm\n\nThe Loppet festival was a blast! What a trip sitting in the sauna IN the\nparking lot of Old Chicago! Crazy! Can’t wait for the next event…\n\n  2. SCOTT OLSON\n\nJanuary 26, 2019 at 2:39 pm\n\nLove it  \nPontoons on mine  \nWayToGo Glen\n\n  3. Olli\n\nOctober 20, 2019 at 3:10 pm\n\nNice saunas! I saw a ton of ice fishing trailers last spring when I drove down\nto Cuyuna for my cycling club’s “Spring Ride” and immediately thought of those\nas a great platform for a mobile sauna. I am heading into a second winter with\nmy mobile sauna, which has been great, but the trailer I welded using scrap\nmetal I got for free is not the best design for a mobile sauna.\n\n  4. Teke O'Reilly\n\nNovember 11, 2019 at 8:42 pm\n\nSO AWESOME! Minor detail: This is 612 Sauna Society’s FOURTH season. Launched\nFeb 2017, winter 17/18, winter 18/19, and now winter 19/20.\n\n  5. Mike\n\nJanuary 2, 2020 at 9:42 pm\n\nLong Live The Who….\n\n  6. sergei Boutenko\n\nJanuary 20, 2020 at 10:21 pm\n\nGlenn,\n\nFirst and foremost, wow! Major respect! The work you’ve done in the sauna\nsector is unreal! Keep up the good word. My name is Sergei. I’m a Russian\nsauna lover and a filmmaker. I just bought a horse trailer that I’m going to\nconvert into a mobile sauna. I’d love to connect with you on this subject… If\nyou’d like to see a sample of my work, check out Van Boom on YouTube\n(https://youtu.be/OniYdmH6QKA).\n\nHope to hear from you!\n\nWarmly,\n\nSergei\n\n  7. Barrett Johnson\n\nJanuary 28, 2020 at 3:24 am\n\nHey Glenn, im gonna build a mobile sauna, i bought your e-book also and wanted\nto get your opinion on this: do you think that its crucial that i incorporate\na drain in my hot room or is a flat floor than can be mopped up sufficient. I\nhave spoken to a few sauna guys and they each have their own opinions on the\nnecessity of a drain in the hot room. Thanks!!\n\n  8. Glenn\n\nJanuary 30, 2020 at 4:06 pm\n\nBarrett: My opinion: We only have to mop up once, after a rockin’ sweaty sauna\nparty, to understand that a drain is a great idea for our sauna hot rooms. I\nshared more thoughts for you about the dual drain in the corner solution in\ncomments section here.\n\n  9. Daryl e Hronek\n\nMarch 1, 2020 at 3:55 am\n\nHey Glen Kuuma said your the man to ask  \nI bought a kuuma medium stove and will be installing it in a enclosed trailer\n. did not see no infro on height needed under the stove? for combustible, on\nsides will have heat shields and going with brick on walls front and one side.  \nthanks  \nDaryl  \nin green bay wi\n\n  10. Glenn\n\nMarch 1, 2020 at 2:55 pm\n\nHi Daryl: I”m happy to help you but it’ll cost you. When I get to Green Bay,\nyou better be ready to fire up your sauna and we sit on the bench together.\nDeal?\n\nPlease email me picture of your trailer and answer for me: 1) your insulation\nplan: blown in? 2) height to existing ceiling and plan(s) for firing out your\nceiling. 3) quick simple sketch of your build plan, including stove location.\nHINT: stove is best located over wheel wells. (bouncing around, tongue weight,\netc.). saunatimes@gmail.com. We’ll take it from there.\n\nSHORT ANSWER: You can transition from black stove pipe to silver insulated\nchimney pipe before the ceiling, thereby conforming to distance to non\ncombustibles above your stove.\n\n  11. Carol\n\nJune 1, 2020 at 1:21 pm\n\nHI Glen, thank you so much for creating such an informative sauna site! I have\na few. questions of my on starting my own mobile sauna business. I hoping to\nspeak with you.\n\n  12. Glenn\n\nJune 2, 2020 at 2:51 am\n\nHi Carol, happy to help. I shot you an email.\n\n  13. Glenn\n\nNovember 29, 2020 at 3:56 pm\n\nMost wonderful/kindred spirit, Rob! Like fans of the Clash before they became\npopular, our mobile sauna building days date back to garageland.. Here’s a\nmobile sauna I built in 2008. Link here.\n\nWant to do a joint guest post detailing the US early pioneer action?\n\nLooking forward to coming back to Ithaca and maybe we can wheel one of your\nmobile saunas up to the base of Buttermilk or Taughannock Falls. If you can\nsort out the permit, i’ll bring the firewood.\n\n  14. Rob Licht\n\nNovember 29, 2020 at 2:51 pm\n\nGlenn,  \nYou forgot about my mobile saunas- which I started making in 2013! Although\nthe concept has been around for a while, they certainly are taking off now,\nliterally. I have units being delivered from Long Island to Maine (and\nconsults too- I helped Hannah with the Little Sauna).\n\nbest,  \nRob\n\n  15. Glenn\n\nJanuary 12, 2021 at 1:52 am\n\nHere in US, our waiver forms have more capital letters in them than the waiver\nforms in Canada.\n\n  16. Eugene\n\nJanuary 11, 2021 at 10:57 pm\n\nI reside in Canada and am looking at going down the commercial sauna path. I\nwould love to speak to someone regarding how sauna establishments deal with\nliability insurance. I am sure there would be differences between Canada and\nthe US but and information is good information when your blind.\n\nThanks\n\n  17. Jaime\n\nAugust 24, 2021 at 10:09 pm\n\nI’m trying to start a mobile sauna business in Wisconsin. I found a local\nbusiness where I can park the sauna and use their bathrooms, electricity, etc.\nThe city is telling me that they do not consider trailers replacements for\npermanent structures and that I could only get a temporary structure permit\nthat would be good for 180 days. After that, I would need to make the sauna a\npermanent structure. I see people with mobile sauna businesses all over the\ncountry. Has anyone experienced this? Thank you.\n\nJaime\n\n  18. Juliet Travis\n\nNovember 10, 2021 at 9:32 pm\n\nHi Glenn! As you seem to be the all knowing about sauna’s – I had a question\nfor you! I recently ordered a Clearlight Outdoor Infared sauna [still hasn’t\narrived and won’t till January due to supply chain issues] and have heard\nthrough the grapevine that apparently infared sauna’s in general are not\ndesigned for outdoor and are not as effective. Is this true? This particular\nsauna is *sold* as an outdoor model so wanted to get your take.\n\nThank you so much in advance for your insight! –Juliet\n\n  19. Glenn\n\nNovember 11, 2021 at 5:55 pm\n\nHi Juliet. Well, i’m not all knowing, but a lifelong enthusiast/student.\n\nThe danger with asking me about infrared is that infrared is not a sauna.\nDespite industry attempts to make them look like saunas and call them saunas,\ninfrared therapy is quite different from sauna. The reasons why infrared\ncabins are made to look like saunas may be a matter of the fact that authentic\nsaunas have reported health benefits, and manufacturers of infrared therapy\nrooms are trying to hitch their wagons.\n\nI’ve got nothing against various forms of sweat therapy. Whatever works,\ngreat. But I have issue with the industry branding infrared as a sauna. It’s\nan education battle, and my jam is sauna. Authentic sauna.\n\n  20. Brian Simon\n\nNovember 28, 2021 at 2:43 am\n\nWade, the bread truck is intriguing, indeed! I built on an 8×12 snowmobile\ntrailer, which has proved effective as a size, though I’m unsure of how close\nI am to trailer capacity (over?).\n\nMy main point in replying, though, is to consider stove attachment. In a fixed\nlocation, gravity is quite sufficient to keep a kuuma in place. Mobile saunas\nlikely require some kind of fixed attachment. There are two holes in each\n‘leg’ you could use; I felt like trying to use them once the stove was in\nplace would be tricky. Perhaps with a good template, a builder could solve\nthat problem by predrilling attachment holes. My solution was to lay a piece\nof angle iron across each leg, and attach that through holes outside the stove\nwidth – and thus easier to access with the stove in place. They’re screwed\ninto pavers, which are adhered to the floor per Glenn’s normal instructions.\nPerhaps not a perfect solution, but should keep the stove in place for most\ntraffic events.\n\n  21. Glenn\n\nNovember 28, 2021 at 2:00 pm\n\nBrian..\n\nYou’re right, it’s tricky to line up the four holes in the base of the Kuuma\nto set bolts into the frame of the trailer. This next build, I will do the\nangle iron gig, as you describe, to lock down the Kuuma, with bolts beyond the\nstove. I am thinking of only two bolts, in the back, for aesthetic reasons,\nand thinking I can crank down on the plates enough to hold the Kuuma in place.\n\n  22. Glenn\n\nDecember 3, 2021 at 12:58 am\n\nHi Matt…\n\nno sealant (zero) of any kind in the hot room. Pls. trust me on this one.\nAwesome you are advancing with the mobile sauna revolution.\n\n  23. Matt\n\nDecember 2, 2021 at 10:31 pm\n\nGlen,\n\nI’m 3/4 complete in my build of a mobile sauna by having built it on good old\nfashioned skids.\n\nPretty excited to start cooking soon! My question is about sealing the cedar.\nShould I seal and what product should I use? Should I only do the benches or\ndo the walls as well?\n\n  24. Glenn\n\nDecember 7, 2021 at 8:46 pm\n\nFor sure, and you can order above, under “build a sauna” or via this link,\nright here.\n\n  25. Gary Noyce\n\nDecember 7, 2021 at 8:33 pm\n\nGlen,\n\nIs your book “Sauna Build, From Start To Finnish” still available?\n\nGary 12/7/21\n\n  26. Ben Gruetzmacher\n\nDecember 31, 2021 at 2:54 am\n\nHello from Clark County, Wisconsin. I have been digging into your E-book and\nhave run into a foundational question, literally.\n\nI want to make my sauna moveable (not necessarily far distances behind a truck\nbut on skids) so am debating on treated lumber versus aluminum. Any thoughts?\n\nI have a friend well-versed in the aluminum industry and we can get our hands\non it fairly easily. Just wondering if it would behoove us to step up the\nfoundation and make it out of aluminum. Our biggest question/concern is\nweight, but I dont feel a sauna would weigh much considering the fairly\nlightweight materials used within.\n\nThanks for any insight you can provide…\n\nBen\n\n  27. Glenn\n\nDecember 31, 2021 at 2:58 pm\n\nHi Ben:\n\nAluminum all the way! It’s a great idea. I am just now “Finnishing” a special\nbuild. 8×12 on aluminum chassis. it has come out great. Tuff Shed uses\nstainless steel studs for their shed bases.\n\nIf you have a well-versed friend in the aluminum industry and can source\nframing for a base, by all means, that will be your best option. Just beef up\nthe perimeter and frame it to how your well-versed friend suggests, and on you\ngo!\n\nPS.. we used angle iron aluminum for perimeter and the bottom plate snug right\nagainst that with a bead of construction adhesive and a few anchor screws,\natop plywood subfloor.\n\n  28. Luc\n\nMay 7, 2022 at 9:56 am\n\nI’m curious if you can help me. I’m considering converting a 6x12ft aluminum\nenclosed cargo trailer into a sauna. Do you think the expansion and\ncontraction of the alluminum compared to the wood be an issue? Look forward to\nhearing from you 🙂  \nOn a side note, would you tow a noble sauna while a fire is burning in the\nwoodstove, if the stove was latched closed securely?  \nThank you for loving saunas people!\n\n  29. Glenn\n\nMay 9, 2022 at 6:38 am\n\nHi Luc.\n\nMany build mobile saunas adapting from aluminum skinned trailers. There’s a\ndebate as to whether spray foam is a good thing or not a good thing, but with\na well insulated hot room, you’re heat transfer to the aluminum should be\nminimal.\n\nI’m a fan of traveling with the fire going in the wood sauna stove. It helps\nwave a flag of freedom. That said, there may be fire marshall’s that would red\nflag the practice. To me the trick is minimal air flow, and a well secured\nrain cap, and not traveling too far or fast.\n\n  30. Jeremy\n\nJune 30, 2022 at 8:29 pm\n\nSorry, I should have been more clear with my question. I’m looking for\ninformation on the types of insurance to rent out mobile saunas as a business.\n\n  31. Glenn\n\nJuly 2, 2022 at 2:14 pm\n\nHi Jeremy.\n\nThis comes up a fair bit. Insuring mobile saunas for rental businesses depend\nupon your carriers and where you live. It’s a crap shoot. One idea is to stop\ninto a rental company in your area, one that does party stuff, and see if you\ncan get some allegiance/alignment there, in your community.\n\n### Leave a Comment\n\nComment\n\nName Email Website\n\nΔ\n\n###### Share This Post\n\nFacebook Share\n\nEmail\n\nTwitter\n\nPinterest\n\nPrint\n\nWhatsApp\n\n###### Search\n\nSearch\n\nSearch\n\n##### Journal Categories\n\nJournal CategoriesSelect CategoryBuilding a Sauna  (183)   Burning Wood  (9)\nSauna Benches  (10)   Sauna Blueprints  (5)   Sauna Rocks  (3)   Sauna Stoves\n(27)   Saunas For Sale  (9)Featured Posts  (12)Glossary of Sauna Terms\n(6)Other  (12)Sauna Culture  (273)   Sauna Contests  (2)   Sauna Etiquette\n(11)   Sauna Events  (53)   Sauna Travel  (30)   Tips for Enjoying Sauna\n(100)Sauna How  (3)Sauna Information  (229)   Sauna Health and Wellness  (94)\nSauna in the News  (94)   Sauna Studies  (7)   Sauna Weather  (40)Sauna\nPhilosophy  (109)Sauna Products  (45)Sauna Talk Podcast  (89)Saunatimes Guest\nPosts  (83)Types of Saunas  (93)   Backyard Saunas  (13)   Cabin Saunas  (9)\nelectric saunas  (2)   Health Club Saunas  (6)   Hotel Saunas  (3)   Mobile\nSaunas  (18)   Public Saunas  (11)   sauna tents  (2)\n\n##### Journal Tags\n\n612 Sauna Society articles authentic backyard sauna benefits building build\nyour own sauna cabin sauna candle window clean rinse cold plunge cool down\nescape finland finnish sauna gasification health and wellness health club\nsauna hotel sauna how to infrared kuuma stove lake superior loyly mobile sauna\nnature nICE mug outdoor sauna rubber band theory sauna benches Sauna how to\nSauna Interviews sauna party sauna popularity Sauna Product Reviews sauna\nrocks Sauna Sweat Therapy sauna talk Sauna Yoga snow summer sauna weather\nwinter wood burning wood stove\n\n##### Recent Thoughts\n\n  * Glenn Auerbach on Tips to Think About for Your Own Authentic Sauna Build\n  * Glenn Auerbach on They couldn’t find it in Canada, so they decided to build a German style sauna in their garden\n  * Michael on They couldn’t find it in Canada, so they decided to build a German style sauna in their garden\n  * corey on Tips to Think About for Your Own Authentic Sauna Build\n  * Melissa Hornbein on A Montana sauna with a simple floor and extensive DIY action\n\n###### Listen to Sauna Talk\n\nListen on Apple Podcasts\n\nListen on Spotify\n\n###### Where to Find SaunaTimes\n\nFacebook Instagram Youtube\n\n###### Best Public Saunas\n\nSee All\n\nsabse garam chut wali sony bhabhi clear hindi.sex videos shaved gf sucks cock\nand fucks in different positions.  \nitsfreesex.org  \nwww.justporntube.net outdoor beautiful bang with sense.\n\n#### Building a Sauna\n\n  * Sauna Blueprints\n  * Types of Saunas\n  * Sauna Stoves\n  * Sauna Rocks\n\n#### Sauna Culture\n\n  * Sauna Philosophy\n  * Tips for Enjoying Sauna\n  * Sauna Products\n  * Sauna Weather\n\n#### SaunaTimes Shop\n\n  * Iki Electric Heaters\n  * Iki Wood Burning Sauna Stoves\n  * Kuuma Wood Burning Sauna Stoves\n  * Sauna Building Help\n\n#### Where to Find SaunaTimes\n\nFacebook Instagram Youtube\n\nDISCLAIMER: Sometimes, I like a product so much that I invest my time (and\nsometimes my own resources) to help get it off the ground. I most often post\nproduct info without any financial compensation at all.\n\nhttps://porn-thai.org  \nwww.hothdjizz.com\n\nNotifications\n\n",
    "links": "[{\"link\": \"https://www.saunatimes.com/types-of-saunas/mobile-saunas/mobile-saunas/#comment-2990\", \"text\": \"\"}, {\"link\": \"https://www.saunatimes.com/types-of-saunas/mobile-saunas/mobile-saunas/#comment-15076\", \"text\": \"\"}, {\"link\": \"https://www.saunatimes.com/types-of-saunas/mobile-saunas/mobile-saunas/#comment-37450\", \"text\": \"\"}, {\"link\": \"https://www.saunatimes.com/types-of-saunas/mobile-saunas/mobile-saunas/#comment-41094\", \"text\": \"\"}, {\"link\": \"https://www.saunatimes.com/types-of-saunas/mobile-saunas/mobile-saunas/#comment-49869\", \"text\": \"\"}, {\"link\": \"https://www.saunatimes.com/types-of-saunas/mobile-saunas/mobile-saunas/#comment-52946\", \"text\": \"\"}, {\"link\": \"https://www.saunatimes.com/types-of-saunas/mobile-saunas/mobile-saunas/#comment-54211\", \"text\": \"\"}, {\"link\": \"https://www.saunatimes.com/types-of-saunas/mobile-saunas/mobile-saunas/#comment-54652\", \"text\": \"\"}, {\"link\": \"https://www.saunatimes.com/types-of-saunas/mobile-saunas/mobile-saunas/#comment-59808\", \"text\": \"\"}, {\"link\": \"https://www.saunatimes.com/types-of-saunas/mobile-saunas/mobile-saunas/#comment-59876\", \"text\": \"\"}, {\"link\": \"https://www.saunatimes.com/types-of-saunas/mobile-saunas/mobile-saunas/#comment-62901\", \"text\": \"\"}, {\"link\": \"https://www.saunatimes.com/types-of-saunas/mobile-saunas/mobile-saunas/#comment-62912\", \"text\": \"\"}, {\"link\": \"https://www.saunatimes.com/types-of-saunas/mobile-saunas/mobile-saunas/#comment-66233\", \"text\": \"\"}, {\"link\": \"https://www.saunatimes.com/types-of-saunas/mobile-saunas/mobile-saunas/#comment-66228\", \"text\": \"\"}, {\"link\": \"https://www.saunatimes.com/types-of-saunas/mobile-saunas/mobile-saunas/#comment-67449\", \"text\": \"\"}, {\"link\": \"https://www.saunatimes.com/types-of-saunas/mobile-saunas/mobile-saunas/#comment-67439\", \"text\": \"\"}, {\"link\": \"https://www.saunatimes.com/types-of-saunas/mobile-saunas/mobile-saunas/#comment-70575\", \"text\": \"\"}, {\"link\": \"https://www.saunatimes.com/types-of-saunas/mobile-saunas/mobile-saunas/#comment-71474\", \"text\": \"\"}, {\"link\": \"https://www.saunatimes.com/types-of-saunas/mobile-saunas/mobile-saunas/#comment-71481\", \"text\": \"\"}, {\"link\": \"https://www.saunatimes.com/types-of-saunas/mobile-saunas/mobile-saunas/#comment-71638\", \"text\": \"\"}, {\"link\": \"https://www.saunatimes.com/types-of-saunas/mobile-saunas/mobile-saunas/#comment-71642\", \"text\": \"\"}, {\"link\": \"https://www.saunatimes.com/types-of-saunas/mobile-saunas/mobile-saunas/#comment-71684\", \"text\": \"\"}, {\"link\": \"https://www.saunatimes.com/types-of-saunas/mobile-saunas/mobile-saunas/#comment-71681\", \"text\": \"\"}, {\"link\": \"https://www.saunatimes.com/types-of-saunas/mobile-saunas/mobile-saunas/#comment-71746\", \"text\": \"\"}, {\"link\": \"https://www.saunatimes.com/types-of-saunas/mobile-saunas/mobile-saunas/#comment-71743\", \"text\": \"\"}, {\"link\": \"https://www.saunatimes.com/types-of-saunas/mobile-saunas/mobile-saunas/#comment-71977\", \"text\": \"\"}, {\"link\": \"https://www.saunatimes.com/types-of-saunas/mobile-saunas/mobile-saunas/#comment-71981\", \"text\": \"\"}, {\"link\": \"https://www.saunatimes.com/types-of-saunas/mobile-saunas/mobile-saunas/#comment-72540\", \"text\": \"\"}, {\"link\": \"https://www.saunatimes.com/types-of-saunas/mobile-saunas/mobile-saunas/#comment-72545\", \"text\": \"\"}, {\"link\": \"https://www.saunatimes.com/types-of-saunas/mobile-saunas/mobile-saunas/#comment-72768\", \"text\": \"\"}, {\"link\": \"https://www.saunatimes.com/types-of-saunas/mobile-saunas/mobile-saunas/#comment-72772\", \"text\": \"\"}]"
}