{
    "summary": "Jump to Content\n\nCareer Certificates\n\nFor Partners\n\nMore Resources\n\nAbout\n\n  * Career Certificates \n  * For Partners \n  * More Resources \n  * About \n  * Enroll now \n\n  * Certificates Overview\n  * Cybersecurity\n  * Data Analytics\n  * Digital Marketing & E-commerce\n  * IT Support\n  * Project Management\n  * UX Design\n\n  * Employers\n  * Academic Institutions\n  * Nonprofits and Community Organizations\n  * Educators\n\n  * Live Training\n  * Grow Your Career\n  * Grow Your Business\n\n  * News and Insights\n  * Stories\n  * Our Mission\n  * Expanding Opportunity\n\n  * Career Certificates \n    * Certificates Overview\n    * Cybersecurity\n    * Data Analytics\n    * Digital Marketing & E-commerce\n    * IT Support\n    * Project Management\n    * UX Design\n  * For Partners \n    * Employers\n    * Academic Institutions\n    * Nonprofits and Community Organizations\n    * Educators\n  * More Resources \n    * Live Training\n    * Grow Your Career\n    * Grow Your Business\n  * About \n    * News and Insights\n    * Stories\n    * Our Mission\n    * Expanding Opportunity\n  * Enroll now \n\nSubscribe\n\nEnroll now\n\nGrow with Google / Certificates / Cybersecurity Certificate\n\n#\n\n# Google Cybersecurity Certificate\n\nPrepare for a career as a cybersecurity analyst with a professional\ncertificate from Google. Learn job-ready skills that are in-demand, like how\nto identify common risks, threats, and vulnerabilities, as well as the\ntechniques to mitigate them.\n\nGet started  on\n\n  * No relevant experience necessary\n  * Built by Google cybersecurity experts\n  * Learn at your own pace\n\nWatch a quick intro video\n\n## Get a job in cybersecurity, with help from Google\n\nLearn the foundations of cybersecurity and get the job-ready skills you need\nto kick-start your career in a fast-growing field.\n\n$100,000+\n\nmedian entry-level salary in cybersecurity1\n\n213,000\n\nopen jobs in cybersecurity1\n\n## Qualify for in-demand jobs in cybersecurity\n\nCybersecurity analysts are responsible for monitoring and protecting networks,\ndevices, people, and data. They use a collection of methods and technologies\nto safeguard against outside threats and unauthorized access — and to create\nand implement solutions should a threat get through.\n\n  * Cybersecurity analyst\n  * Security analyst\n  * SOC analyst\n  * Information security analyst\n  * IT security analyst\n  * Cyber defense analyst\n\n### Learn more about the certificate\n\nFOUNDATIONAL\n\n### Cybersecurity Certificate\n\nThis fully online program provides the skills you need for an entry-level job\nin cybersecurity, even if you don't have prior experience. You'll use industry\nstandard tools like Python, Linux, SQL, Security Information and Event\nManagement (SIEM) tools, and Intrusion Detection Systems (IDS).\n\n**You’ll learn about:**\n\n  * Programming for cybersecurity tasks\n  * Frameworks and controls that inform security operations\n  * Using security information and event management (SIEM) tools for cybersecurity\n  * Detecting and responding to incidents using an intrusion detection system\n  * Performing packet capture and analysis\n\nGet started on Coursera\n\n3-6\n\nMonths completion time\n\n100%\n\nRemote, online learning\n\n**You’ll learn about:**\n\n  * Programming for cybersecurity tasks\n  * Frameworks and controls that inform security operations\n  * Using security information and event management (SIEM) tools for cybersecurity\n  * Detecting and responding to incidents using an intrusion detection system\n  * Performing packet capture and analysis\n\nCertificate curriculum:\n\n  * Foundations of Cybersecurity\n  * Play It Safe: Manage Security Risks\n  * Connect and Protect: Networks and Network Security\n  * Tools of the Trade: Linux and SQL\n  * Assets, Threats, and Vulnerabilities\n  * Sound the Alarm: Detection and Response\n  * Automate Cybersecurity Tasks with Python\n  * Put It to Work: Prepare for Cybersecurity Jobs\n\nGet started on Coursera\n\n####  More details\n\n####  Close details\n\n#### Preview the certificate material\n\nCYBERSECURITY CERTIFICATE\n\n## An introduction to cybersecurity\n\nDiscover what it takes to build a successful career in cybersecurity, gain an\nunderstanding of what it's like to be a security analyst, and learn how to\nprotect information and systems from unauthorized access and cyber threats.\n\n* * *\n\n### The full certificate program includes:\n\n  * Hands-on activities\n  * Quizzes and assignments\n  * Regular assessments\n\nWatch the video\n\n###\n\nGet on the fast track to in-demand jobs with top employers\n\nComplete a Google Career Certificate to get exclusive access to CareerCircle,\nwhich offers free 1-on-1 coaching, interview and career support, and a job\nboard to connect directly with employers, including over 150 companies in the\nGoogle Career Certificates Employer Consortium.\n\nHere’s how\n\nComplete online certificate courses, at your own pace and time.\n\nAccess career resources  like coaching sessions, mock interviews, and a resume\nbuilder tool.\n\nShare your resume  and get connected with national and local employers.\n\n####  CONNECT WITH +150 TOP EMPLOYERS, INCLUDING THESE:\n\n  *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   * \n\n##  Prepare for the CompTIA Security+ exam\n\nThe Google Cybersecurity Certificate helps prepare you for the CompTIA\nSecurity+ exam, the industry leading certification for cybersecurity roles.\nYou’ll earn a dual credential when you complete both.\n\n##  Prepare for the CompTIA Security+ exam\n\nThe Google Cybersecurity Certificate helps prepare you for the CompTIA\nSecurity+ exam, the industry leading certification for cybersecurity roles.\nYou’ll earn a dual credential when you complete both.\n\nCERTIFICATE TESTIMONIALS\n\nCERTIFICATE TESTIMONIALS\n\nComing into this not knowing anything about cybersecurity, I think it was a\ngreat introduction to the field. The order of the lessons, the variety of\ncontent, and the pacing kept me engaged and motivated to learn.\n\nJared, Google Cybersecurity Certificate graduate\n\nLeslie\n\nChizitere\n\nJared\n\nCertificate Testimonials\n\nCertificate Testimonials\n\nThe certificate has a variety of content to help you think like a\ncybersecurity analyst. From the course videos and reading material, to the\nhands-on labs to practice your skills, to the activities with example use\ncases, you feel prepared to start a career in this field.\n\nLeslie, Google Cybersecurity Certificate graduate\n\nLeslie\n\nChizitere\n\nJared\n\nCERTIFICATE TESTIMONIALS\n\nCERTIFICATE TESTIMONIALS\n\nI was always scared of learning SQL, but after this course, I'm in love with\nSQL. I appreciate the way the content was presented and organized, making it\neasy to follow - especially for someone with no experience.\n\nChizitere, Google Cybersecurity Certificate graduate\n\nLeslie\n\nChizitere\n\nJared\n\nCERTIFICATE TESTIMONIALS\n\nCERTIFICATE TESTIMONIALS\n\nComing into this not knowing anything about cybersecurity, I think it was a\ngreat introduction to the field. The order of the lessons, the variety of\ncontent, and the pacing kept me engaged and motivated to learn.\n\nJared, Google Cybersecurity Certificate graduate\n\nLeslie\n\nChizitere\n\nJared\n\nCertificate Testimonials\n\nCertificate Testimonials\n\nThe certificate has a variety of content to help you think like a\ncybersecurity analyst. From the course videos and reading material, to the\nhands-on labs to practice your skills, to the activities with example use\ncases, you feel prepared to start a career in this field.\n\nLeslie, Google Cybersecurity Certificate graduate\n\nLeslie\n\nChizitere\n\nJared\n\n##  Frequently asked questions\n\nExpand all  Collapse all\n\n###  What is cybersecurity?\n\nOrganizations must continuously protect themselves and the people they serve\nfrom cyber-related threats, like fraud and phishing. They rely on\ncybersecurity to maintain the confidentiality, integrity, and availability of\ntheir internal systems and information.\n\nCybersecurity analysts use a collection of methods and technologies to\nsafeguard against threats and unauthorized access — and to create and\nimplement solutions should a threat get through.\n\n###  What does a cybersecurity analyst do?\n\nCybersecurity analysts work to protect organizations and people from harm.\nJust as you’d need the right methods to secure your house from a storm,\ncybersecurity analysts rely on a variety of tools to quickly respond to\nthreats and minimize risk or damage.\n\nWhile cybersecurity analysts can react quickly to immediate disruptions and\nthreats, they also take a proactive role in safeguarding their organizations.\nThey continuously monitor systems and networks, and always ask questions and\nseek out solutions. If they discover a breach has occurred, cybersecurity\nanalysts will launch an investigation and report on their findings.\n\n###  Why start a career in cybersecurity?\n\nAs cyber-related threats continue to rapidly grow and evolve, cybersecurity is\na must-have for many organizations. Cybersecurity analysts are essentially\ndigital detectives. They investigate potential and ongoing threats, assess the\nsituation to find the best solution, and protect networks, devices, people,\nand data. Cybersecurity analysts use analytical and technical skills to crack\ncybersecurity puzzles, but also rely on creative thinking to address new\nthreats in unique ways. With so much riding on the safety of organizations'\ndata, cybersecurity analysts play a critical role and are in high demand.\n\n###  Who is the Google Cybersecurity Certificate for?\n\nYou! No prior cybersecurity experience or specific knowledge is required. All\nyou need is an interest in solving puzzles, investigating, and helping others.\n\n###  Why enroll in the Google Cybersecurity Certificate?\n\nThe Google Cybersecurity Certificate not only focuses on the technical skills\nyou need to be a cybersecurity analyst, but essential business acumen skills\nlike communication, critical thinking, collaboration and teamwork,\nprioritization, and escalation.\n\nYou’ll learn these job-ready skills in our certificate program through\ninteractive content (hands-on activities, discussion prompts, and quizzes) in\nunder six months, with 5-10 hours of study a week. Along the way, you'll work\nthrough a curriculum taught by experts at Google with decades of experience.\n\nAfter you’ve graduated from the program, you’ll have access to career\nresources and the opportunity to connect directly with over 150 employers who\nare committed to considering Google Career Certificate graduates for open\nentry-level jobs in cybersecurity.\n\n###  Which cybersecurity tools and platforms are taught in the Google\nCybersecurity Certificate?\n\nYou’ll learn to use programming for security tasks (e.g. Python, Linux, SQL)\nand security information and event management tools (e.g. Chronicle and\nSplunk). You’ll also use an intrusion detection system (e.g. Suricata), apply\nframeworks and controls to inform security operations (e.g. NIST CSF, NIST\nRMF, CIA Triad) and perform packet capture and analysis (e.g. tcpdump,\nWireshark).\n\n###  What cybersecurity courses are included in the Google Cybersecurity\nCertificate curriculum?\n\nThe cybersecurity courses included in the curriculum are…\n\n  * Foundations of Cybersecurity\n  * Play It Safe: Manage Security Risks\n  * Connect and Protect: Networks and Network Security\n  * Tools of the Trade: Linux and SQL\n  * Assets, Threats, and Vulnerabilities\n  * Sound the Alarm: Detection and Response\n  * Automate Cybersecurity Tasks with Python\n  * Put It to Work: Prepare for Cybersecurity Jobs\n\n###  Will completing the Google Cybersecurity Certificate certificate help me\nprepare for the CompTIA Security+ exam?\n\nThe Google Cybersecurity Certificate helps prepare graduates for the CompTIA\nSecurity+ exam. Graduates of the Google Cybersecurity Certificate can access\nthe CompTIA Security+ exam and additional training at a discounted price.\nYou’ll earn a dual credential when you complete both the Google Cybersecurity\nCertificate and the CompTIA Security+ exam, which can be shared with potential\nemployers.\n\n###  What kind of cybersecurity jobs can I get with the Google Cybersecurity\nCertificate?\n\nThe Google Cybersecurity Certificate can qualify you for in-demand\ncybersecurity jobs such as: cybersecurity analyst, security analyst, security\noperations center (SOC) analyst, information security analyst, IT security\nanalyst, and cyber defense analyst.\n\n###  What is the Google Career Certificates Employer Consortium? Can it help\nme find cybersecurity jobs?\n\nThe Google Career Certificates Employer Consortium consists of over 150 U.S.\ncompanies like American Express, Colgate-Palmolive, Mandiant (now part of\nGoogle Cloud), T-Mobile, Walmart, and of course, Google. These companies span\nmultiple sectors and are committed to considering Google Career Certificate\ngraduates for entry-level jobs. Upon completion of the Google Cybersecurity\nCertificate, you will gain access to an exclusive job platform where you can\neasily apply to opportunities from employers with open jobs.\n\n###  What other kind of support is available after I complete the Google\nCybersecurity Certificate?\n\nAt the end of the program, you'll get access to free 1-on-1 coaching, resume\nhelp, practice interviews, and job search support. You’ll be able to connect\nwith over 150 employers who are committed to considering hiring Google Career\nCertificate graduates.\n\n###  How much does the Google Cybersecurity Certificate cost?\n\nThe Google Cybersecurity Certificate costs $49 per month on Coursera after an\ninitial 7-day free trial period. All Google Career Certificates are completely\nself-paced. At about 10 hours of study per week, many learners complete a\nGoogle Career Certificate in three to six months.\n\n###  Is financial assistance available for the Google Cybersecurity\nCertificate?\n\nIf you are interested in financial assistance for the Google Cybersecurity\nCertificate, you may be eligible for financial aid via Coursera through the\ncourse page. Recipients of financial aid will have full access to course\ncontent and assignments required to earn a certificate. To apply, go to the\ncertificate course page on Coursera and click the “Financial aid available”\nlink next to the “Enroll” button.\n\n###  Where can I access the Google Cybersecurity Certificate?\n\nThe Google Cybersecurity Certificate is available globally in English on\nCoursera, an online learning platform that offers access to online courses.\nGoogle has worked with Coursera to make Google Career Certificates available\non their platform.\n\n###  Who designed the Google Cybersecurity Certificate?\n\nThe Google Cybersecurity Certificate was designed and built by subject-matter\nexperts and senior practitioners at Google. This certificate has been created\nto equip learners with theoretical and practical knowledge and real-life\nproblem-solving skills to be successful in an entry-level cybersecurity job.\n\n###  What languages is the Google Cybersecurity Certificate available in?\n\nThe Google Cybersecurity Certificate is currently available in English and we\nare working to offer this certificate in additional languages. Please check\nback here for updates.\n\nView more\n\nView less\n\n*Complete in 6 months, under 10 hours per week.  \n  \n1Lightcast™ US Job Postings (2022: Jan. 1, 2022 - Dec. 31, 2022).\n\nBack to top\n\n## Stay up to date on Google Career Certificates\n\nEmail\n\nPlease enter a valid email\n\nSubscribe\n\nBy clicking subscribe, you consent to receive email communication from Grow\nwith Google and its programs. Your information will be used in accordance with\nGoogle Privacy Policy and you may opt out at any time by clicking unsubscribe\nat the bottom of each communication.\n\n#### Thanks for subscribing to the Grow with Google newsletter!\n\n###  Subscribe to discover even more ways to grow\n\nEmail\n\nPlease enter a valid email\n\nSubscribe\n\nBy clicking subscribe, you consent to receive email communication from Grow\nwith Google and its programs. Your information will be used in accordance with\nGoogle Privacy Policy and you may opt out at any time by clicking unsubscribe\nat the bottom of each communication.\n\n#### Thanks for subscribing to the Grow with Google newsletter!\n\n### Footer links\n\n####  Career Certificates\n\n  * Cybersecurity Certificate \n  * Data Analytics Certificate \n  * Digital Marketing & E-commerce Certificate \n  * IT Certificate \n  * Project Management Certificate \n  * UX Design Certificate \n\n####  For Partners\n\n  * Employers \n  * Academic Institutions \n  * For Nonprofits and Community Organizations \n  * Educators \n\n####  Expanding Opportunity\n\n  * Veterans and Military Families \n  * Latino Community \n  * Women-Owned Businesses \n  * Justice-Impacted \n\n####  Programs\n\n  * Digital Coaches \n  * Applied Digital Skills \n  * Learning on YouTube \n\n####  More Initiatives from Google\n\n  * Google for Small Business \n  * Google for Startups \n  * Google for Education \n  * Google Developers \n  * Google.org \n  * Learning with Google \n\n  * About Google \n  * Google Products \n  * Privacy \n  * Terms \n  * Sitemap \n  * Cookies management controls \n\n  * Help \n  * English - United States  English - Africa  English – Europe  German - Germany  English - Canada  French - Canada  English - Australia  日本語 - 日本  हिन्दी – भारत  English - India  한국어 – 대한민국  ไทย – ไทย  Indonesia - Bahasa  English – Singapore  English – Philippines  English – Malaysia  Bahasa Melayu – Malaysia  Tiếng Việt – Việt Nam  English – Pakistan  中文（繁體中文）– 台灣  中文（繁體中文）– 香港  Magyar - Magyarország  Română - România  Español - España  Čeština - Česko  Polskie - Polska  Español - Estados Unidos \n\nThis site uses cookies from Google to deliver its services and to analyze\ntraffic.\n\nLearn more  OK, got it\n\n",
    "links": "[{\"link\": \"https://grow.google/\", \"text\": \"\"}, {\"link\": \"https://grow.google/\", \"text\": \"\"}, {\"link\": \"https://grow.google/certificates/\", \"text\": \"\\n                        Certificates Overview\"}, {\"link\": \"https://grow.google/certificates/cybersecurity/\", \"text\": \"\\n                        Cybersecurity\"}, {\"link\": \"https://grow.google/certificates/data-analytics/\", \"text\": \"\\n                        Data Analytics\"}, {\"link\": \"https://grow.google/certificates/digital-marketing-ecommerce/\", \"text\": \"\\n                        Digital Marketing & E-commerce\"}, {\"link\": \"https://grow.google/certificates/it-support/\", \"text\": \"\\n                        IT Support\"}, {\"link\": \"https://grow.google/certificates/project-management/\", \"text\": \"\\n                        Project Management\"}, {\"link\": \"https://grow.google/certificates/ux-design/\", \"text\": \"\\n                        UX Design\"}, {\"link\": \"https://grow.google/employers/\", \"text\": \"\\n                        Employers\"}, {\"link\": \"https://grow.google/certificates-academic-institutions/\", \"text\": \"\\n                        Academic Institutions\"}, {\"link\": \"https://grow.google/partners/\", \"text\": \"\\n                        Nonprofits and Community Organizations\"}, {\"link\": \"https://grow.google/educators/\", \"text\": \"\\n                        Educators\"}, {\"link\": \"https://grow.google/live-training/\", \"text\": \"\\n                        Live Training\"}, {\"link\": \"https://grow.google/grow-your-career/\", \"text\": \"\\n                        Grow Your Career\"}, {\"link\": \"https://grow.google/grow-your-business/\", \"text\": \"\\n                        Grow Your Business\"}, {\"link\": \"https://grow.google/news-insights/\", \"text\": \"\\n                        News and Insights\"}, {\"link\": \"https://grow.google/stories/\", \"text\": \"\\n                        Stories\"}, {\"link\": \"https://grow.google/our-mission/\", \"text\": \"\\n                        Our Mission\"}, {\"link\": \"https://grow.google/expanding-opportunity/\", \"text\": \"\\n                        Expanding Opportunity\"}, {\"link\": \"https://grow.google/certificates/\", \"text\": \"\\n                        Certificates Overview\"}, {\"link\": \"https://grow.google/certificates/cybersecurity/\", \"text\": \"\\n                        Cybersecurity\"}, {\"link\": \"https://grow.google/certificates/data-analytics/\", \"text\": \"\\n                        Data Analytics\"}, {\"link\": \"https://grow.google/certificates/digital-marketing-ecommerce/\", \"text\": \"\\n                        Digital Marketing & E-commerce\"}, {\"link\": \"https://grow.google/certificates/it-support/\", \"text\": \"\\n                        IT Support\"}, {\"link\": \"https://grow.google/certificates/project-management/\", \"text\": \"\\n                        Project Management\"}, {\"link\": \"https://grow.google/certificates/ux-design/\", \"text\": \"\\n                        UX Design\"}, {\"link\": \"https://grow.google/employers/\", \"text\": \"\\n                        Employers\"}, {\"link\": \"https://grow.google/certificates-academic-institutions/\", \"text\": \"\\n                        Academic Institutions\"}, {\"link\": \"https://grow.google/partners/\", \"text\": \"\\n                        Nonprofits and Community Organizations\"}, {\"link\": \"https://grow.google/educators/\", \"text\": \"\\n                        Educators\"}, {\"link\": \"https://grow.google/live-training/\", \"text\": \"\\n                        Live Training\"}, {\"link\": \"https://grow.google/grow-your-career/\", \"text\": \"\\n                        Grow Your Career\"}, {\"link\": \"https://grow.google/grow-your-business/\", \"text\": \"\\n                        Grow Your Business\"}, {\"link\": \"https://grow.google/news-insights/\", \"text\": \"\\n                        News and Insights\"}, {\"link\": \"https://grow.google/stories/\", \"text\": \"\\n                        Stories\"}, {\"link\": \"https://grow.google/our-mission/\", \"text\": \"\\n                        Our Mission\"}, {\"link\": \"https://grow.google/expanding-opportunity/\", \"text\": \"\\n                        Expanding Opportunity\"}, {\"link\": \"https://grow.google/\", \"text\": \"Grow with Google /\"}, {\"link\": \"https://grow.google/certificates\", \"text\": \"Certificates /\"}, {\"link\": \"https://grow.google/certificates/cybersecurity/\", \"text\": \"\\n                    Cybersecurity Certificate\\n                  \"}, {\"link\": \"https://grow.google/certificates/data-analytics/\", \"text\": \"\\n                    Data Analytics Certificate\\n                  \"}, {\"link\": \"https://grow.google/certificates/digital-marketing-ecommerce/\", \"text\": \"\\n                    Digital Marketing & E-commerce Certificate\\n                  \"}, {\"link\": \"https://grow.google/certificates/it-support/\", \"text\": \"\\n                    IT Certificate\\n                  \"}, {\"link\": \"https://grow.google/certificates/project-management/\", \"text\": \"\\n                    Project Management Certificate\\n                  \"}, {\"link\": \"https://grow.google/certificates/ux-design/\", \"text\": \"\\n                    UX Design Certificate\\n                  \"}, {\"link\": \"https://grow.google/employers/\", \"text\": \"\\n                    Employers\\n                  \"}, {\"link\": \"https://grow.google/certificates-academic-institutions/\", \"text\": \"\\n                    Academic Institutions\\n                  \"}, {\"link\": \"https://grow.google/partners/\", \"text\": \"\\n                    For Nonprofits and Community Organizations\\n                  \"}, {\"link\": \"https://grow.google/educators/\", \"text\": \"\\n                    Educators\\n                  \"}, {\"link\": \"https://grow.google/expanding-opportunity/military-community/\", \"text\": \"\\n                    Veterans and Military Families\\n                  \"}, {\"link\": \"https://grow.google/expanding-opportunity/latinx-community/\", \"text\": \"\\n                    Latino Community\\n                  \"}, {\"link\": \"https://grow.google/expanding-opportunity/women/\", \"text\": \"\\n                    Women-Owned Businesses\\n                  \"}, {\"link\": \"https://grow.google/justice-impacted/\", \"text\": \"\\n                    Justice-Impacted\\n                  \"}, {\"link\": \"https://grow.google/digital-coaches/\", \"text\": \"\\n                    Digital Coaches\\n                  \"}, {\"link\": \"https://grow.google/applied-digital-skills/\", \"text\": \"\\n                    Applied Digital Skills\\n                  \"}, {\"link\": \"https://grow.google/sitemap/\", \"text\": \"\\n            Sitemap\\n          \"}, {\"link\": \"https://grow.google/us-our-mission#FAQs\", \"text\": \"\"}]"
}