{
    "summary": "  * Why INE?\n  * Learning\n  * Business Solutions\n  * Resources\n  * Pricing & Plans\n\n  * Sign In\n  * Request Information\n  * Get Started Now\n\n# Cybersecurity Online Training & Certification Courses for Teams and\nIndividuals\n\nYour customers rely on you to keep their data safe from breaches, and your\nstakeholders expect your security protocols to work against cyber attacks. Our\nCybersecurity solutions have helped train tens of thousands of individuals and\nteams on the cutting edge of identifying threats, making better decisions, and\nupskilling professionals and security organizations for modern asymmetric\nwarfare.\n\nGet Started Now\n\nINE Business Plans\n\n## Cybersecurity Courses Online: Expert Instruction and Hands On Labs Set Our\nTraining Apart\n\nWhat differentiates our Cybersecurity training? It begins with our approach to\neducation. Training yourself or your team to handle today’s threat landscape\nrequires more than working through labs or reading a bunch of slides. Our\ninstructors are industry experts, combining hundreds of years of experience\nprotecting governments and businesses from cyber attacks. Let us do the same\nfor you.\n\nWe’ve developed a curriculum that integrates interactive and engaging video-\nbased learning, with the most advanced lab exercises available. Are you just\nstarting out? No problem! Our student learning paths are the perfect way to\njumpstart your Cybersecurity career. Already an expert? Our constantly\nevolving Cybesecurity course library will challenge you to keep your skills\ncyber sharp, so that you don’t allow undetected threats go unnoticed.\n\n71% of business leaders expect that their Cybersecurity team members will\nspend at least three hours a week upskilling themselves, with 40% of them\nexpecting 7 hours or more. Our online courses provide teams and individuals\nalike an economic solution that will allow them to continually fill their\nskills gaps. Our hands-on labs allow you to test your new techniques.  Promote\nyourself or hire within. Get started today.\n\nView All Paths\n\n## Red Team? We Got you! Blue Team? We can help you defend your turf! Purple\nTeam – That’s our passion.\n\nBusinesses around the world are demanding team members with expertise in both\nred and blue team tactics. INE’s learning paths provide you and your\norganization the ability to cross train, better preparing you for the threats\nahead.\n\nDefensiveBlue Team\n\nOffensiveRed Team\n\n## Cybersecurity Learning Paths\n\nLearning Paths are designed to expertly guide you through the most relevant\nred and blue team subjects so you can experience the ultimate in online\nCybersecurity training.\n\nNoviceProfessionalAdvancedView all paths\n\nCyber Security\n\n##  Novice\n\n###  Exploit Development Student\n\nIf you're looking for the most practical way into the exploit development and\nsoftware security world look no further. The Exploit Development Student\nLearning Path provides not only the fundamentals ...\n\nCyber Security\n\n##  Novice\n\n###  Penetration Testing Student\n\nThe hardest thing you will ever do in cybersecurity is to land your first job.\nThere are HR gateways, industry jargon, and companies unwilling to hire new\ntalent. To help combat these challenges, we h ...\n\nCyber Security\n\n##  Novice\n\n###  Enterprise Defense Administrat ...\n\nDesigned for professionals that are just starting their defensive\ncybersecurity or security engineering journey, this learning path will\nintroduce you to all of the concepts and skills you'll need to ...\n\n## The possibilities are endless. Explore hundreds of hours of Cybersecurity\ncourse materials.\n\nHone in on that skill you’ve been trying to perfect or learn entirely new ones\nwith our expert-led video instruction and hands-on exercises. Our learn-by-\ndoing platform features online courses, virtual labs, quizzes, and in-depth\ntraining so you can take your education and Cybersecurity career into your own\nhands.\n\nView paths\n\nCareers\n\n## What a Cybersecurity career looks like\n\n* * *\n\nOrganizations around the world are now looking for industry leaders that are\ncross-trained in offensive and defensive cyber tactics. Our Cybersecurity\ntraining gives you the opportunity to learn on-the-job skills while ensuring\nyou can nail the technical portions of interviews or certification exams.\n\n## Penetration Tester\n\nPenetration testers are in charge of identifying vulnerabilities in an\norganization’s network through an authorized and simulated attack.\n\nSalary: $80,000 – $130,000\n\n## Information Security Analyst\n\nThese positions are responsible for protecting sensitive information by\ncreating plans and implementing strategies to prevent attacks.\n\nSalary:$90,000 - $100,000\n\n## Chief Information Security Officer\n\nA CISO is a c-suite level executive responsible for maintaining an\norganization’s information and data / cyber security.\n\nSalary:$140,000 - $300,000\n\n## Security Architect\n\nA security architect analyzes security threats and develops solutions to\nprotect information and data.\n\nSalary: $120,000 - $190,000\n\n## Networking Security Engineer\n\nA Networking Security Engineer solves existing security issues, tests systems\nfor vulnerabilities, and maintains virtual private networks, firewalls, email\nsecurity, and web protocols.\n\nSalary:$87,000 - $128,000\n\n01 / 05\n\n### Cyber Security Certifications\n\nInformative LevelNovice LevelProfessional LevelExpert LevelView all\ncertifications\n\nCyber Security\n\nCybersecurity\n\nCompTIA Security+\n\n## Learn from our Cybersecurity experts!\n\nSearch near and far, and you still won’t find experts who love what they do or\nwho they do for more than ours. After spending decades in the Cybersecurity\nfield, they’re dedicating their time to ensure you have the best and most\naccurate learning material at your fingertips whenever you need it.\n\nKnow them all\n\n### Josh Mason\n\nSecurity+, CISSP, CTT+, eJPT\n\n### Jack Reedy\n\nDirector, Cyber Security & CISSP\n\n### Jason Alvarado\n\nGIAC Certified Forensic Analyst\n\n### Piotr Kaluzny\n\nCCIE Security (#25665) CCNA R&S/Security CCNP R&S/Security\n\n### Slavi Parpulev\n\neCTHP, eCPTX, OSCE, OSCP, GCFA, AZ-500, Microsoft INF260x\n\n### Nikhil Mittal\n\nInfoSec Researcher\n\n### Vivek Ramachandran\n\nCyber Security\n\n### Brian Olliff\n\nDefensive Cyber Security\n\n### Nishant Sharma\n\nSecurity Research Manager\n\n### Jeswin Mathai\n\nSenior Security Researcher\n\n03 / 10\n\n## Common questions about Cyber Security training\n\nIf you have a question you don’t see on this list, please visit our Frequently\nAsked Questions page by clicking the button below. If you’d prefer getting in\ntouch with one of our experts, we encourage you to call one of the numbers\nabove or fill out our contact form.  \n\nKnow them all\n\nCan I teach myself cyber security?\n\nHow long does it take to learn security?\n\nAre pentesters in demand?\n\nAre the cyber labs available within the Monthly Pass?\n\n/ Questions\n\n/ LET’S GET IN TOUCH\n\n## Have a question? We’re here to help!\n\nWhether you’d like more information on our training materials or are\ninterested in a free demo, please contact us at any time.\n\nMonday - Friday8:00 AM - 5:00 PM Eastern Time\n\nUS Customer1-877-224-8987\n\nOutside US+1-984-444-9917\n\nSales Emailinfo@ine.com\n\nSupport Emailsupport@ine.com\n\nFirst Name\n\nLast Name\n\nEmail\n\nphone number\n\nCompany\n\nType of inquiry Support Inquiry Sales Inquiry Billing Inquiry\n\nMessage\n\nSend\n\nAbout\n\n  * About us\n  * Careers\n  * Our Platform\n  * Community\n  * INE Live\n  * Newsroom\n  * Blog\n\nLearning\n\n  * Why INE?\n  * Networking\n  * Cyber Security\n  * Data Science\n  * Cloud\n  * Learning Paths\n  * Courses\n  * Instructors\n\nPlans\n\n  * Pricing & Plans\n  * Business Solutions\n\nSupport\n\n  * Help Center\n\n## Hey! Don’t miss anything - subscribe to our newsletter!\n\nEmail\n\nSubscribe\n\n© 2022 INE. All Rights Reserved. All logos, trademarks and registered\ntrademarks are the property of their respective owners.\n\nTerms of servicePrivacy policy\n\n×\n\n×\n\n",
    "links": "[{\"link\": \"https://ine.com/\", \"text\": \"\"}, {\"link\": \"https://ine.com/why-ine\", \"text\": \"Why INE?\"}, {\"link\": \"https://ine.com/learning/areas/cyber-security/blue-team\", \"text\": \"\"}, {\"link\": \"https://ine.com/learning/areas/cyber-security/red-team\", \"text\": \"\"}, {\"link\": \"https://ine.com/learning/paths\", \"text\": \"View all paths\"}, {\"link\": \"https://ine.com/learning/certifications\", \"text\": \"View all certifications\"}, {\"link\": \"https://ine.com/learning/certifications/external/comptia-security\", \"text\": \"\"}]"
}