{
    "summary": "Skip to main content\n\nToggle mobile menu\n\n  *   * Sign InRegister for free\n  * All Courses & Programs\n  * Degrees & ProgramsNew\n\n  * Boot Camps\n\n  * Schools & Partners\n  * edX For Business\n\nSearch for courses and programs\n\nLearn\n\nSubmit your search query\n\nSubmit your search query\n\nedX For Business\n\nSign In\n\nRegister for free\n\n#### By goal\n\nTake a course\n\nExplore the Earn a certificate goalExplore the Enroll in a boot camp\ngoalExplore the Earn a degree goal\n\n#### By topic\n\nExplore the Artificial Intelligence topicExplore the Data Science topicExplore\nthe Finance topicExplore the Business Administration topicExplore the\nCybersecurity topicExplore the Computer Science topicExplore the View all\ntopics topicExplore the Career resources resources\n\nSchools & Partners\n\n#### Still unsure?\n\nTry a course for free.\n\nFree online courses\n\n  * Home\n  * Learn\n  * Cybersecurity\n\n# Explore cybersecurity courses and certificates\n\nMany organizations have been victims of cybersecurity breaches. Cybersecurity\nspecialists play a critical role in protecting against these attacks. Learn\nhow to become a cybersecurity specialist with online cybersecurity courses\noffered through edX.\n\n  * What is cybersecurity?\n  * Browse online cybersecurity courses\n  * Cybersecurity jobs\n  * Cybersecurity FAQ\n\nWhat is cybersecurity?Browse online cybersecurity coursesCybersecurity\njobsCybersecurity FAQ\n\nGo to section\n\nSearch edX courses\n\n##\n\n### What is cybersecurity?\n\nCybersecurity is a subset of information technology associated with\nsafeguarding computer systems and information. Why is cybersecurity important?\nThere are many types of cybersecurity threats, including theft, hacking,\nviruses, and more. The computer security field has grown as more devices\nbecome internet-enabled and more services are moved online.\n\nCyberattacks may result in stolen credit card information, personal details,\nand other sensitive data. Security breaches typically occur when\norganizations’ and companies’ data centers are compromised. They can impact\nbanks, retail stores, online websites, and anywhere else consumers use their\ndigital information. Hackers also use fraudulent emails and social media to\naccess sensitive data from end-users. IT and cybersecurity experts are\nresponsible for assessing security risks in order to better protect customers.\n\nCompanies that collect and store private information employ cyber safety and\nsecurity measures to prevent the loss of data or disruption of business, and\nthe availability of cybersecurity jobs is tied to this need. These roles may\nbe specific to a division of cybersecurity, such as application security,\nnetwork security, cloud security, and mobile security. Additionally,\ncybersecurity specialists may participate in defensive security practices,\nwhile others may focus on testing through activities such as “white hat”\nhacking.\n\n## Browse online Cybersecurity courses\n\n### Find new interests and advance your career opportunities\n\nCoursesCourses\n\nExplore all courses\n\n#### Stand out in your field\n\nUse the knowledge and skills you have gained to drive impact at work and grow\nyour career.\n\n#### Learn at your own pace\n\nOn your computer, tablet or phone, online courses make learning flexible to\nfit your busy life.\n\n#### Earn a valuable credential\n\nShowcase your key skills and valuable knowledge.\n\nExplore all courses\n\n##\n\n#### Common types of cybersecurity threats\n\nInformation can be compromised through a variety of tactics. Examples of\ncommon cyberthreats include:Footnote 1\n\n  * **Malware:** Short for “malicious software,” malware variants include worms, viruses, trojans, and spyware. These types of software can give cyberattackers unauthorized access to data or cause damage to a computer system. \n\n  *  **Ransomware:** Ransomware is another type of malware that can lock down computer systems with the threat to destroy or compromise sensitive data unless a ransom is paid to the cyberattacker. \n\n  *  **Phishing:** Phishing is a tactic that attempts to trick users into providing sensitive information, such as their username and password to an account, credit card number, or personal information. This type of scam sends messages from seemingly legitimate organizations asking for the information they intend to steal for their use. \n\n  *  **Distributed denial-of-service (DDoS) attacks:** These types of cyberattacks attempt to crash a server, network, or website by overloading it with traffic. DDoS attacks typically use multiple coordinated systems to achieve the goal of overwhelming the system. \n\n####  Online cybersecurity course curriculum\n\nCybersecurity course curricula will vary based on the type of program, level\nof learning, and other factors. For example, an introductory course that\nfocuses on cybersecurity fundamentals may cover:\n\n  * Network and system administration basics, such as data integrity, confidentiality, and availability. \n\n  * Protections that cybersecurity professionals use to secure network infrastructures, monitor threats, and implement security solutions. \n\n  * The different branches of cybersecurity, including application security, network and infrastructure security, and digital forensics and incident response. \n\nCybersecurity analyst certification courses and cybersecurity boot camps can\nalso provide a more in-depth focus on cybersecurity tools and best practices\nfor aspiring professionals, including how to perform digital forensic\nanalysis, risk analysis, and vulnerability assessments in enterprise\nenvironments.\n\n#### Cybersecurity training for beginners\n\nFor those who are interested in exploring cybersecurity careers, it can be\nhelpful to take an introductory class to see if cybersecurity is a good fit.\nThere are many low-cost or free cybersecurity courses online that cover\ncybersecurity fundamentals, how to start a career in cybersecurity, and more.\nIntroductory classes may cover different areas of cybersecurity, such as\nsecure software development, network security, and cloud security. These\ncourses provide an overview on important cybersecurity terms, how security\ndesign works, industry standards and principles, and different models for\nsecurity.\n\n##\n\n###  Cybersecurity jobs\n\nThere are many types of cybersecurity jobs that play unique roles in keeping\ncomputer systems secure. One example is the position of information security\nanalyst.\n\nResponsibilities for this role can include:Footnote 2\n\n  * Monitoring an organization’s networks for security breaches.\n\n  * Using tools such as firewalls and data encryption programs to protect private information.\n\n  * Checking for potential cybersecurity threats and vulnerabilities.\n\n  * Researching the latest IT security trends.\n\n  * Developing security standards and best practices for their organization.\n\nOther cybersecurity careers include:  \n\n  *  **Cybersecurity architects,** who lead the process of planning, designing, testing, and implementing an organization’s cybersecurity infrastructure.Footnote 3\n\n  *  **Cybersecurity engineers,** who aid the cybersecurity team in planning, implementing, and monitoring an organization’s security systems.Footnote 4\n\n  *  **Cyber strategy consultants,** who assess an organization’s computer systems to identify potential vulnerabilities and provide solutions that can be implemented to address those issues. \n\n  *  **Solutions implementation engineers,** who assist the cybersecurity team with overall technical design and testing to maintain a business’s security systems. \n\n#### How to become a cybersecurity specialist online\n\nThere are multiple education paths an individual can take to learn\ncybersecurity, from short cybersecurity tutorials and _boot camps_, to\ntraditional degree programs. Some cybersecurity jobs may require candidates to\nhave a _bachelor’s degree_ or _master’s degree_ related to computer\ninformation technology. Other cybersecurity careers may be open to individuals\nwho have completed a _cybersecurity boot camp program_. Cybersecurity\ncertifications can also be earned through online programs.\n\n## More opportunities for you to learn\n\nWe've added 500+ learning opportunities to create one of the world's most\ncomprehensive free-to-degree online learning platforms.\n\nNew\n\n### Executive Education\n\nExpert-led, fully supported courses that build career-critical skills\n\nNew\n\n### Master's Degrees\n\nOnline degree programs from top universities\n\nNew\n\n### Bachelor's Degrees\n\nBegin or complete a degree; fully online\n\nNew\n\n### Boot Camps\n\nIntensive, hands-on, project-based training\n\n## Cybersecurity FAQ\n\nWhy is cybersecurity important?\n\nCybersecurity is important in today’s world, where smart devices, computers,\nand other technologies are all connected. Companies and individuals alike can\nbenefit from cybersecurity strategies, as having digital defense systems in\nplace can help prevent identity theft, leaked customer information, and loss\nof important data.\n\nWhat does a cybersecurity specialist do?\n\nDepending on the specific role, a cybersecurity specialist may be expected to\nmonitor an organization’s networks for security breaches, use tools such as\nfirewalls and data encryption programs to protect sensitive information, check\nfor potential vulnerabilities in a network infrastructure, and develop\nsecurity standards and best practices for an organization.\n\nHow long does it take to become a cybersecurity analyst?\n\nThe time it takes to become a cybersecurity analyst will vary based on an\nindividual’s existing education, job experience, and other factors. Some\ncybersecurity jobs may require a bachelor’s degree, which can take four years\nto complete, while others may be open to individuals who have completed a boot\ncamp or short courses.\n\nWhat skills does a cybersecurity specialist need?\n\nWhile every role is unique, helpful traits for cybersecurity specialists can\ninclude the ability to think analytically, creativity, an attention to detail,\nand problem-solving skills.\n\nDoes cybersecurity require coding?\n\nWhile many entry-level cybersecurity jobs do not involve coding, advanced\npositions may involve computer programming. The requirements for coding\nexperience will vary depending on an individual’s desired career path.\n\nCan I get a discount if I enroll 10+ employees in cybersecurity courses?\n\nYes. edX For Business offers subscription packages and volume discounts to\ncost-effectively upskill your employees and support your company culture of\nlearning. An edX For Business curriculum advisor can curate online learning\nexperiences to meet your workforce learning and development challenges. _Click\nhere_ to begin your custom curation and learn about volume discounts.\n\n  1. [1] _What Is Cybersecurity?_ Open link in a new tab _IBM._ Retrieved August 24, 2022. Return to footnote 1 reference in main content\n  2. [2] _Information Security Analysts._ Open link in a new tab (2022). _U.S. Bureau of Labor Statistics._ Retrieved August 24, 2022. Return to footnote 2 reference in main content\n  3. [3] _Computer Network Architects._ Open link in a new tab (2022). _U.S. Bureau of Labor Statistics._ Retrieved August 24, 2022. Return to footnote 3 reference in main content\n  4. [4] _Computer Hardware Engineers._ Open link in a new tab (2022). _U.S. Bureau of Labor Statistics._ Retrieved August 24, 2022. Return to footnote 4 reference in main content\n\nLast updated January 2024\n\n  * Like edX on Facebook\n\n  * Follow edX on Twitter\n\n  * Follow edX on LinkedIn\n\n  * Subscribe to the edX subreddit\n\n### BROWSE COURSES\n\n  * Learn Spanish\n  * Learn Python\n  * Learn Excel\n  * Learn Software Engineering\n  * Learn Blockchain\n  * Learn Computer Programming\n  * Learn Economics\n  * Learn Architecture\n  * Learn Project Management\n  * Learn Business Administration\n\nsee more Courses\n\n### START A NEW CAREER\n\n  * Coding Boot Camp\n  * Data Analytics Boot Camp\n  * Cybersecurity Boot Camp\n  * Digital Marketing Boot Camp\n  * UX/UI Boot Camp\n  * Technology Project Management Boot Camp\n\nsee more Boot Camps\n\n### STEP-BY-STEP GUIDES\n\n  * Become a Cybersecurity Analyst\n  * Become a Data Scientist\n  * Become a Social Media Manager\n  * Become a Software Developer\n  * Become a Software Engineer\n\nsee more Guides\n\n### COMPLETE YOUR BACHELOR'S ONLINE\n\n  * Bachelor's in Business\n  * Bachelor's in Computer Science / Data Science\n  * Bachelor's in Health and Nursing\n\nsee more Undergraduate Degrees\n\n### EARN YOUR ONLINE GRADUATE DEGREE\n\n  * Master's in Business Administration\n  * Master's in Public Health\n  * Master's in Social Work\n  * Master's in Nursing\n  * Master's in Data Science\n  * Master's in Engineering\n  * Master's in Speech Pathology\n  * Master's in Counseling/Psychology\n  * Master's Degree in Healthcare\n  * Master's Degree in Education\n\nsee more Graduate Degrees\n\n* * *\n\n## edX\n\n  * Boot Camps\n  * About\n  * edX For Business\n  * Affiliates\n  * Open edX\n  * 2U Advisory Council\n  * Careers\n  * News\n\n## Connect\n\n  * Idea Hub\n  * Contact Us\n  * Help Center\n  * Security\n  * Media Kit\n\n## Legal\n\n  * Terms of Service & Honor Code\n  * Privacy Policy\n  * Cookie Policy\n  * Accessibility Policy\n  * Trademark Policy\n  * Modern Slavery Statement\n  * Sitemap\n  * Your Privacy Choices\n\nChoose Language\n\nEnglishespañolApply\n\n© 2024 edX LLC. All rights reserved.  \n| 深圳市恒宇博科技有限公司 粤ICP备17044299号-2\n\nYour Opt Out Preference Signal is Honored\n\n## PRIVACY PREFERENCE CENTER\n\nWhen you visit our website, we store cookies on your browser to collect\ninformation. The information collected might relate to you, your preferences,\nor your device, and is mostly used to make the site work as you expect it to\nand to provide a more personalized web experience. However, you can choose not\nto allow certain types of cookies, which may impact your experience of the\nsite and the services we are able to offer. Click on the different category\nheadings to find out more and change our default settings according to your\npreference. You cannot opt-out of Strictly Necessary Cookies, as they are\ndeployed in order to ensure the proper functioning of our website. View our\nCookie Policy by clicking the link below.  \n  \n **DO NOT SELL OR SHARE MY PERSONAL INFORMATION**  \n  \nTo opt out of sale or sharing of your personal information for targeted\nadvertising, turn off the toggle in the Ad Targeting Cookies / Share or Sale\nof Personal Personal Information category below by swiping to it to the left\n(gray). Your selection is saved to this browser on this device. If you clear\nyour browser cookies, you will need to opt out again. To learn more about 2U’s\nuse of your data, please see our Privacy Policy, available at the link below.  \nView Our Cookie PolicyView Our Privacy Policy\n\nAllow All\n\n###  Manage Consent Preferences\n\n#### Strictly Necessary Cookies\n\nAlways Active\n\nThese cookies are necessary for the website to function and cannot be switched\noff in our systems. They are usually only set in response to actions made by\nyou which amount to a request for services, such as setting your privacy\npreferences, logging in or filling in forms.    You can set your browser to\nblock or alert you about these cookies, but some parts of the site will not\nthen work. These cookies do not store any personally identifiable information.\n\n#### Functional Cookies\n\nFunctional Cookies\n\nThese cookies enable the website to provide enhanced functionality and\npersonalisation, including in searches. They may be set by us or by third\nparty providers whose services we have added to our pages. If you do not allow\nthese cookies then some or all of these services may not function properly.\n\n#### Performance Cookies\n\nPerformance Cookies\n\nThese cookies allow us to count visits and traffic sources so we can measure\nand improve the performance of our site. They help us to know which pages are\nthe most and least popular and see how visitors move around the site.    All\ninformation these cookies collect is aggregated and therefore anonymous. If\nyou do not allow these cookies we will not know when you have visited our\nsite, and will not be able to monitor its performance.\n\n#### Ad Targeting Cookies/Share or Sale of Personal Information\n\nAd Targeting Cookies/Share or Sale of Personal Information\n\nWe disclose information to advertising partners to deliver ads that are more\nrelevant to you, which may be considered a “sale” or a “sharing” of\ninformation for targeted advertising under certain laws. To opt out of\n“sales,” “sharing,” and targeting advertising, you may turn off the toggle by\nswiping it to the left (gray). This will also opt you out of all targeting\ncookies.\n\n  * ##### Targeting Cookies\n\nSwitch Label\n\nThese cookies are set by our advertising partners to provide behavioral\nadvertising and re-marketing analytical data. They collect any type of\nbrowsing information necessary to create profiles and to understand user\nhabits in order to develop an individual and specific advertising routine. The\nprofile created regarding your browsing interest and behavior is used to\ncustomize the ads you see when you access other websites.\n\nBack Button\n\n### Cookie List\n\nSearch Icon\n\nFilter Icon\n\nClear\n\ncheckbox label label\n\nApply Cancel\n\nConsent Leg.Interest\n\ncheckbox label label\n\ncheckbox label label\n\ncheckbox label label\n\nConfirm My Choices\n\n",
    "links": "[{\"link\": \"https://www.edx.org/\", \"text\": \"\"}, {\"link\": \"https://www.edx.org/search\", \"text\": \"All Courses & Programs\"}, {\"link\": \"https://www.edx.org/schools-partners\", \"text\": \"Schools & Partners\"}, {\"link\": \"https://www.edx.org/\", \"text\": \"\"}, {\"link\": \"https://www.edx.org/search?tab=course\", \"text\": \"Take a course\"}, {\"link\": \"https://www.edx.org/schools-partners\", \"text\": \"Schools & Partners\"}, {\"link\": \"https://www.edx.org/free-online-courses\", \"text\": \"Free online courses\"}, {\"link\": \"https://www.edx.org/\", \"text\": \"Home\"}, {\"link\": \"https://www.edx.org/learn\", \"text\": \"Learn\"}, {\"link\": \"https://www.edx.org/search\", \"text\": \"\"}, {\"link\": \"https://www.edx.org/search?tab=course\", \"text\": \"Explore all courses\"}, {\"link\": \"https://www.edx.org/search?tab=course\", \"text\": \"Explore all courses\"}, {\"link\": \"https://www.edx.org/executive-education\", \"text\": \"\"}, {\"link\": \"https://www.edx.org/masters\", \"text\": \"\"}, {\"link\": \"https://www.edx.org/bachelors\", \"text\": \"\"}, {\"link\": \"https://www.edx.org/boot-camps\", \"text\": \"\"}, {\"link\": \"https://www.edx.org/learn/spanish\", \"text\": \"Learn Spanish\"}, {\"link\": \"https://www.edx.org/learn/python\", \"text\": \"Learn Python\"}, {\"link\": \"https://www.edx.org/learn/excel\", \"text\": \"Learn Excel\"}, {\"link\": \"https://www.edx.org/learn/software-engineering\", \"text\": \"Learn Software Engineering\"}, {\"link\": \"https://www.edx.org/learn/blockchain\", \"text\": \"Learn Blockchain\"}, {\"link\": \"https://www.edx.org/learn/computer-programming\", \"text\": \"Learn Computer Programming\"}, {\"link\": \"https://www.edx.org/learn/economics\", \"text\": \"Learn Economics\"}, {\"link\": \"https://www.edx.org/learn/architecture\", \"text\": \"Learn Architecture\"}, {\"link\": \"https://www.edx.org/learn/project-management\", \"text\": \"Learn Project Management\"}, {\"link\": \"https://www.edx.org/learn/business-administration\", \"text\": \"Learn Business Administration\"}, {\"link\": \"https://www.edx.org/learn\", \"text\": \"see more Courses\"}, {\"link\": \"https://www.edx.org/boot-camps/coding\", \"text\": \"Coding Boot Camp\"}, {\"link\": \"https://www.edx.org/boot-camps/data-analytics\", \"text\": \"Data Analytics Boot Camp\"}, {\"link\": \"https://www.edx.org/boot-camps/cybersecurity\", \"text\": \"Cybersecurity Boot Camp\"}, {\"link\": \"https://www.edx.org/boot-camps/digital-marketing\", \"text\": \"Digital Marketing Boot Camp\"}, {\"link\": \"https://www.edx.org/boot-camps/ux-ui-user-experience\", \"text\": \"UX/UI Boot Camp\"}, {\"link\": \"https://www.edx.org/boot-camps/tech-project-management\", \"text\": \"Technology Project Management Boot Camp\"}, {\"link\": \"https://www.edx.org/boot-camps\", \"text\": \"see more Boot Camps\"}, {\"link\": \"https://www.edx.org/become/how-to-become-a-cybersecurity-analyst\", \"text\": \"Become a Cybersecurity Analyst\"}, {\"link\": \"https://www.edx.org/become/how-to-become-a-data-scientist\", \"text\": \"Become a Data Scientist\"}, {\"link\": \"https://www.edx.org/become/how-to-become-a-social-media-manager \", \"text\": \"Become a Social Media Manager\"}, {\"link\": \"https://www.edx.org/become/how-to-become-a-software-developer\", \"text\": \"Become a Software Developer\"}, {\"link\": \"https://www.edx.org/become/how-to-become-a-software-engineer-without-a-degree\", \"text\": \"Become a Software Engineer\"}, {\"link\": \"https://www.edx.org/become\", \"text\": \"see more Guides\"}, {\"link\": \"https://www.edx.org/bachelors/business\", \"text\": \"Bachelor's in Business\"}, {\"link\": \"https://www.edx.org/bachelors/computer-data-sciences\", \"text\": \"Bachelor's in Computer Science / Data Science\"}, {\"link\": \"https://www.edx.org/bachelors/health-social-services\", \"text\": \"Bachelor's in Health and Nursing\"}, {\"link\": \"https://www.edx.org/bachelors\", \"text\": \"see more Undergraduate Degrees\"}, {\"link\": \"https://www.edx.org/masters/online-mba\", \"text\": \"Master's in Business Administration\"}, {\"link\": \"https://www.edx.org/masters/masters-in-public-health-online\", \"text\": \"Master's in Public Health\"}, {\"link\": \"https://www.edx.org/masters/online-msw-programs\", \"text\": \"Master's in Social Work\"}, {\"link\": \"https://www.edx.org/masters/online-msn-programs\", \"text\": \"Master's in Nursing\"}, {\"link\": \"https://www.edx.org/masters/online-masters-in-data-science\", \"text\": \"Master's in Data Science\"}, {\"link\": \"https://www.edx.org/masters/online-masters-in-engineering\", \"text\": \"Master's in Engineering\"}, {\"link\": \"https://www.edx.org/masters/online-slp-programs\", \"text\": \"Master's in Speech Pathology\"}, {\"link\": \"https://www.edx.org/masters/counseling-psychology\", \"text\": \"Master's in Counseling/Psychology\"}, {\"link\": \"https://www.edx.org/masters/healthcare\", \"text\": \"Master's Degree in Healthcare\"}, {\"link\": \"https://www.edx.org/masters/masters-in-education-online\", \"text\": \"Master's Degree in Education\"}, {\"link\": \"https://www.edx.org/masters\", \"text\": \"see more Graduate Degrees\"}, {\"link\": \"https://www.edx.org/boot-camps\", \"text\": \"Boot Camps\"}, {\"link\": \"https://www.edx.org/about-us\", \"text\": \"About\"}, {\"link\": \"https://www.edx.org/affiliate-program\", \"text\": \"Affiliates\"}, {\"link\": \"https://www.edx.org/careers\", \"text\": \"Careers\"}, {\"link\": \"https://www.edx.org/resources\", \"text\": \"Idea Hub\"}, {\"link\": \"https://www.edx.org/policy/security\", \"text\": \"Security\"}, {\"link\": \"https://www.edx.org/media-kit\", \"text\": \"Media Kit\"}, {\"link\": \"https://www.edx.org/edx-terms-service\", \"text\": \"Terms of Service & Honor Code\"}, {\"link\": \"https://www.edx.org/edx-privacy-policy\", \"text\": \"Privacy Policy\"}, {\"link\": \"https://www.edx.org/edx-privacy-policy/cookies\", \"text\": \"Cookie Policy\"}, {\"link\": \"https://www.edx.org/accessibility\", \"text\": \"Accessibility Policy\"}, {\"link\": \"https://www.edx.org/trademarks\", \"text\": \"Trademark Policy\"}, {\"link\": \"https://www.edx.org/modern-slavery-statement\", \"text\": \"Modern Slavery Statement\"}, {\"link\": \"https://www.edx.org/sitemap\", \"text\": \"Sitemap\"}]"
}