{
    "summary": "Insider Pro 20% OFF for Limited Time!\n\nUnlimited access to everything Cybrary to reach your cybersecurity career\ngoals\n\n20\n\ndays\n\n20\n\nhour\n\n20\n\nminutes\n\n20\n\nseconds\n\nSAVE 20% FOREVER\n\nCatalog\n\nCareer Paths\n\nLaunch or advance your career with curated collections of courses, labs, and\nmore.\n\nBack\n\nFoundations\n\nIT and Cybersecurity Foundations\n\nDefensive Security\n\nBecome an Incident Handler\n\nBecome a SOC Analyst - Level 3\n\nBecome a SOC Analyst - Level 2\n\nBecome a SOC Analyst - Level 1\n\nOffensive Security\n\nBecome a Penetration Tester\n\nEngineering and Operations\n\nBecome a Network Engineer\n\nBecome a Cyber Security Engineer\n\nBecome an Azure Cloud Engineer\n\nBecome a System Administrator\n\nGovernance, Risk Management & Compliance\n\nISO 27001:2013 - Information Security Management Systems\n\nCloud Governance Principles\n\nPrivacy Program Management\n\nNIST 800-53r5: Introduction to Security and Privacy Controls\n\nPCI DSS: Payment Card Industry Data Security Standard\n\nEnd User Cyber Fundamentals\n\nLeadership & Management\n\nBecome a CISO\n\n50 CISO Security Controls\n\n12 Competencies of the Effective CISO\n\nCertification Prep\n\nPrepare for and maintain leading cybersecurity certifications\n\nBack\n\nBeginner\n\nCompTIA Security+ (SY0-601)\n\nCompTIA Project+ (PK0-004)\n\nAZ-900 Microsoft Azure Fundamentals\n\nITIL 4 Foundation\n\nComputer Hacking and Forensics\n\nCompTIA A+ 220-1101\n\nView All\n\nIntermediate\n\nCertified Information Systems Auditor (CISA)\n\nCertNexus Cybersec First Responder\n\nCertified Cloud Security Professional (CCSP)\n\nAWS Certified Security-Specialty (2022)\n\nView All\n\nAdvanced\n\nCRISC\n\nAZ-305 Designing Microsoft Azure Infrastructure Solutions\n\nCompTIA CASP+ (CAS-004)\n\nCertified Information Systems Security Professional (CISSP)\n\nMission Readiness\n\nLearn how to detect and mitigate the latest threats and vulnerabilities.\n\nBack\n\nThreat Actor Campaigns\n\nMagic Hound\n\nRaspberry Robin\n\nDouble Trouble with Double Dragon\n\nWeak Link in the Supply Chain\n\nSpinning a Web Shell for Initial Access\n\nExfiltration and Extortion\n\nView All\n\nCVE Series\n\nCVE Series: F5 BIG-IP (CVE-2022-1388)\n\nCVE Series: CouchDB RCE (CVE-2022-24706)\n\nCVE Series: Atlassian Bitbucket Command Injection (CVE-2022-36804)\n\nCVE Series: Grafana Directory Traversal (CVE-2021-43798)\n\nCVE Series: Blind NoSQL Injection (CVE-2021-22911)\n\nCVE Series: Apache HTTPD (CVE-2021-42013)\n\nView All\n\nCybrary Challenges\n\nChallenge: Space Mission\n\nChallenge: A Message Within A Message\n\nChallenge: Don't Believe What You Hear\n\nChallenge: Chatting with ChatGPT\n\nChallenge: Saving a Fellow Monster\n\nChallenge: Gobble Gobble Conceal & Deceive\n\nView All\n\nMITRE ATT&CK\n\nMITRE ATT&CK\n\nBrowse the Catalog\n\nInstructors\n\nFor Individuals\n\nCareer Paths\n\nLaunch or advance your career with curated collections of courses, labs, and\nmore.\n\nBack\n\nFoundations\n\nIT and Cybersecurity Foundations\n\nDefensive Security\n\nBecome an Incident Handler\n\nBecome a SOC Analyst - Level 3\n\nBecome a SOC Analyst - Level 2\n\nBecome a SOC Analyst - Level 1\n\nOffensive Security\n\nBecome a Penetration Tester\n\nEngineering and Operations\n\nBecome a Network Engineer\n\nBecome a Cyber Security Engineer\n\nBecome an Azure Cloud Engineer\n\nBecome a System Administrator\n\nGovernance, Risk Management & Compliance\n\nLeadership & Management\n\nBecome a CISO\n\n50 CISO Security Controls\n\n12 Competencies of the Effective CISO\n\nForums\n\nDiscuss all things cybersecurity for free among the vast Cybrary community\n\nFree Access\n\nGet a taste of the catalog with certification prep, introductory courses, and\nmore.\n\nInsider Pro\n\nEverything you need to learn, practice, and prove your cybersecurity skills.\n\nFor Teams\n\nBuild your team’s cybersecurity skills and achieve new certifications, all in\none place\n\nCompare Plans\n\nCompare features across all plans.\n\nIndividual\n\nBack\n\nCybrary Insider Pro\n\nMITRE ATT&CK\n\nFree Access\n\nCareer Paths\n\nSuccess Stories\n\nFor Teams\n\nTeams Exclusive\n\nUpskill your team to better defend your organization from attacks.\n\nBack\n\nCybrary Select\n\nCybrary Live\n\nTeams Features\n\nBuild your team’s cybersecurity skills and achieve new certifications, all in\none place\n\nFor Government\n\nSupport your organization with a custom plan that works for your organization.\n\nMission Readiness\n\nLearn how to detect and mitigate the latest threats and vulnerabilities.\n\nBack\n\nThreat Actor Campaigns\n\nCVE Series\n\nCybrary Challenges\n\nMITRE ATT&CK\n\nMITRE ATT&CK\n\nBusiness Resources\n\nLearn how Cybrary can help your team thrive.\n\nBack\n\nCase Studies\n\nResearch Papers\n\nArticles\n\nWhite Pages\n\nTeams Pricing\n\nCompare features across all plans.\n\nTeams\n\nBack\n\nFor Security Teams\n\nMITRE ATT&CK\n\nBaselining\n\nFor Government\n\nTeams Resources\n\nPricing\n\nFree Teams DemoSign upLogin\n\nDashboard\n\nProfile\n\nMembership Settings\n\nAccount Settings\n\nSupport\n\nLogout\n\nStart learning with free on-demand video training\n\nSign upLogin\n\nAmazon Web Services is currently experiencing an outage that may impact your\nexperience on the Cybrary application. We apologize for any inconvenience and\nwill be monitoring this situation closely\n\n# The Best Way to Learn Cybersecurity Skills Online\n\nCybrary's accessible, affordable training platform provides curated career\npaths, threat-informed training, and certification preparation for\nprofessionals at all levels.\n\nGo to Dashboard\n\nStart Learning for Free\n\nCybrary for Teams\n\nTrusted by leading organizations\n\nCreate a free account to start exploring the platform.\n\nCreate a Free Account\n\nSign in\n\nThank you! Your submission has been received!\n\nOops! Something went wrong while submitting the form.\n\nor sign up with\n\nSign in\n\nView all SSO options\n\nCybrary for teams\n\nView all SSO options\n\n## Launch Your Career\n\nStart your cyber journey confidently with curated paths that teach the\nfoundational concepts related to real, on-the-job skills.\n\n## Get Certified\n\nAce the exam with certification prep content developed by industry-leading\ninstructors. Test yourself with our practice exams.\n\n## Upskill and Practice\n\nMaster hands-on skills and familiarize yourself with the latest\nvulnerabilities and threats so you can prepare for real-world attacks.\n\n### Learn\n\nLearn key concepts with expert-led video courses for all professional levels.\n\nStart learning\n\n### Practice\n\nPractice cybersecurity skills with hands-on, virtual labs.\n\nStart learning\n\n### Prove\n\nProve your abilities with practice tests and assessments.\n\nStart learning\n\n### Cybrary for Teams\n\nUpskill your team with Cybrary's suite of learning activities and management\ntools, including hands-on practice labs, assessments, and custom guided\npathways. Request a demo and learn how Cybrary tailors our deep library of\ntrainings to your team's unique needs.\n\nSchedule a Demo\n\n## Stand out from the crowd and advance your career with Cybrary\n\nCertification Prep\n\nCareer Paths\n\nCVE Series\n\nTrain Your Team\n\nThreat Actor Campaigns\n\nFree Content\n\n## Popular Courses\n\nFull Catalog\n\nCourse\n\nFree\n\n30\n\nH:\n\n52\n\nM\n\n7\n\n CEUS\n\n### Penetration Testing and Ethical Hacking\n\nTo assess the strength of your organization’s cybersecurity posture, you need\nto gather information, perform scanning and enumeration, and show how an\nadversary could hack into your systems. This ethical hacking course will give\nyou those skills and prepare you for related certification exams so you can\nprove your capabilities.\n\nLearn More & Enroll\n\nCourse\n\nFree\n\n18\n\nH:\n\n28\n\nM\n\n10\n\n CEUS\n\n### CompTIA Security+ (SY0-601)\n\nReady to start your cybersecurity journey? The CompTIA Security+ SYO-601\ncredential is one of the most essential certifications in the world of\ninformation security today. Learn about essential introductory security and\nrisk management concepts from world-famous cybersecurity instructor, Kelly\nHanderhan.\n\nLearn More & Enroll\n\nCourse\n\nFree\n\n32\n\nH:\n\n34\n\nM\n\n16\n\n CEUS\n\n### Certified Information Systems Security Professional (CISSP)\n\nCISSP certification is essential for cybersecurity professionals aiming to\nmove up in their career. This course will cover all aspects of security, risk\nmanagement, and architecture to help you prepare for the CISSP exam. Learn\nfrom experienced professionals and gain the knowledge needed to become a\ncertified security expert.\n\nLearn More & Enroll\n\nCourse\n\nFree\n\n27\n\nH:\n\n53\n\nM\n\n31\n\n CEUS\n\n### Cisco Certified Network Associate (CCNA) Certification\n\nOur online, self-paced Cisco Certified Network Associate CCNA training teaches\nstudents to install, configure, troubleshoot and operate LAN, WAN and dial\naccess services for medium-sized networks. You'll also learn how to describe\nthe operation of data networks.\n\nLearn More & Enroll\n\n## New Courses\n\nFull Catalog\n\nCourse\n\n0\n\nH:\n\n50\n\nM\n\n1\n\n CEUS\n\n### Registry Run Keys\n\nMany organizations do not monitor for additions to the Windows Registry that\ncould be used to trigger autostart execution on system boot or logon. This\nallows adversaries to launch programs that run at higher privileges and paves\nthe way for more damaging activity. Learn how to detect and mitigate this\nactivity to secure your network.\n\nLearn More & Enroll\n\nCourse\n\n0\n\nH:\n\n50\n\nM\n\n1\n\n CEUS\n\n### Obtain Capabilities: Tool\n\nWhile you may be prepared to detect the use of malware on your system, what if\nan adversary uses a legitimate software tool for a nefarious purpose?\nAdversaries may buy or steal software and use it in unexpected ways. Learn how\nadversaries leverage this technique so you can defend your organization.\n\nLearn More & Enroll\n\nCourse\n\n0\n\nH:\n\n50\n\nM\n\n1\n\n CEUS\n\n### Lateral Tool Transfer\n\nOnce adversaries compromise your network, they can transfer tools between\nsystems in order to stage them for later use or to support lateral movement.\nThey may use file sharing protocols or copy files with existing tools like\nscp, sftp and ftp. Learn how to spot and mitigate this behavior so you can\nstop adversaries in their tracks.\n\nLearn More & Enroll\n\nCourse\n\n0\n\nH:\n\n50\n\nM\n\n1\n\n CEUS\n\n### Scheduled Task\n\nSome organizations do not configure their operating systems and account\nmanagement to properly protect the use of task scheduling functionality. As a\nresult, adversaries can abuse this capability to execute malicious code on a\nvictim’s system. Get hands-on practice detecting this technique so you can\nprotect your organization.\n\nLearn More & Enroll\n\nCourse\n\n0\n\nH:\n\n50\n\nM\n\n1\n\n CEUS\n\n### User Discovery\n\nOnce on a victim's system, adversaries will perform user discovery to\ndetermine information, such as the primary user’s identity and capabilities.\nThey may seek out users with access to remote systems so they can cast their\nnet wider. Discover the attacker instead of the other way around with this\ndynamic, lab-based course!\n\nLearn More & Enroll\n\nCourse\n\n0\n\nH:\n\n50\n\nM\n\n1\n\n CEUS\n\n### Local Accounts\n\nOrganizations that do not enforce strong password policies and audit\nprivileged account management can fall victim to attackers who leverage access\nto local accounts. With it, they can gain initial access, persistence,\nprivilege escalation, or defense evasion. Learn how to detect and prevent this\ntype of activity in this dynamic lab-based course.\n\nLearn More & Enroll\n\nCourse\n\nFree\n\n1\n\nH:\n\n25\n\nM\n\n1\n\n CEUS\n\n### Active Scanning and Exploit Public-Facing Application\n\nThreat actors will often perform Active Scanning to learn the landscape of a\nvictim's network and plan their next steps. One of those next steps could be\nexploiting vulnerable public-facing applications to gain access and pursue\ntheir end-goals. Master the skills to detect and mitigate these techniques and\nsecure your network.\n\nLearn More & Enroll\n\nCourse\n\nFree\n\n1\n\nH:\n\n10\n\nM\n\n1\n\n CEUS\n\n### OS Credential Dumping\n\nOnce attackers have a presence on your system, they may dump credentials from\nthe operating system to gain further access and perform lateral movement.\nLearn to detect and dump attackers in this lab-based course.\n\nLearn More & Enroll\n\nCourse\n\nFree\n\n1\n\nH:\n\n10\n\nM\n\n1\n\n CEUS\n\n### Server Software Component: Web Shell\n\nBad actors can gain persistence on your network by abusing software\ndevelopment features that allow legitimate developers to extend server\napplications. In this way, they can install malicious code for later use.\nLearn to detect and thwart this activity and protect your network.\n\nLearn More & Enroll\n\nCourse\n\nFree\n\n1\n\nH:\n\n25\n\nM\n\n1\n\n CEUS\n\n### Exfiltration Over Alternative Protocol and Clear CLI History\n\nFinancially motivated adversaries will often steal valuable data and\nexfiltrate it over an alternate protocol like FTP, SMTP or, HTTP/S. They could\nalso encrypt or obfuscate these alternate channels to protect their nefarious\nactivities. Learn to exfiltrate the attackers by detecting and mitigating\nthese techniques.\n\nLearn More & Enroll\n\nCourse\n\nFree\n\n1\n\nH:\n\n2\n\nM\n\n1\n\n CEUS\n\n### OWASP Top 10 - 2021\n\nThe OWASP Top 10 features the most critical web application security\nvulnerabilities. Build your offensive security and penetration testing skills\nwith this one-of-a-kind course!\n\nLearn More & Enroll\n\nCourse\n\nFree\n\n14\n\nH:\n\n26\n\nM\n\n15\n\n CEUS\n\n### Advanced Penetration Testing\n\nThe Advanced Penetration Testing course teaches the cyber attack lifecycle\nfrom the perspective of an adversary. Become more familiar with the most\nwidely used penetration-testing tools, manipulate network traffic, and perform\nweb application attacks such as cross-site scripting and SQL injection.\n\nLearn More & Enroll\n\nCourse\n\nFree\n\n8\n\nH:\n\n41\n\nM\n\n9\n\n CEUS\n\n### CompTIA A+ 220-1101\n\nReady to start your career in IT and cybersecurity? Earn your CompTIA A+\ncertification on your journey to becoming a systems administrator, network\nadministrator, or other cybersecurity professional. Prepare to ace the updated\n220-1101 exam with this engaging course!\n\nLearn More & Enroll\n\nCourse\n\nFree\n\n9\n\nH:\n\n10\n\nM\n\n9\n\n CEUS\n\n### Intro to Malware Analysis and Reverse Engineering\n\nAre you on the path to becoming a SOC Analyst or preparing for your CEH exam?\nThis malware analysis course will help you advance your career and protect\nyour organization from critical threats. Learn how to perform analysis on all\nmajor files types, carve malicious executables from documents, and recognize\ncommon malware tactics.\n\nLearn More & Enroll\n\nCourse\n\nFree\n\n2\n\nH:\n\n26\n\nM\n\n3\n\n CEUS\n\n### PowerShell for Security Professionals\n\nUnlock the power! Learn to apply PowerShell from both the red and blue team\nperspectives. In this PowerShell for Security Professionals course, you will\nlearn the fundamentals of PowerShell and how it can be used to improve the\nautomation of tasks across large organizational networks.\n\nLearn More & Enroll\n\nCourse\n\n1\n\nH:\n\n40\n\nM\n\n2\n\n CEUS\n\n### System Binary Proxy Execution and a Spearphish Payload\n\nSpearphishing is one of the oldest tricks in the book, and in this course you\nwill learn more about how it actually works. Plus, see how adversaries can\nhide malicious code in compiled HTML files. Detect and mitigate these\ntechniques in our hands-on course.\n\nLearn More & Enroll\n\nCourse\n\n1\n\nH:\n\n25\n\nM\n\n1\n\n CEUS\n\n### Persistence via Windows Services\n\nWindows Services are the main vehicle used by the Windows OS to start and run\nbackground functions that do not require user interaction. Configuring malware\nto run as a service is a common strategy for trying to blend malicious code\nexecution in with other legitimate Windows functions. Prevent adversaries from\ngaining persistence in this course.\n\nLearn More & Enroll\n\nCourse\n\n1\n\nH:\n\n38\n\nM\n\n2\n\n CEUS\n\n### Local Account Discovery, Creation, and Manipulation\n\nAfter gaining initial access on a system, adversaries may want to do some\ndiscovery work on local accounts and maintain persistence on a victim system\nas they create and manipulate accounts in order to maintain their access.\nLearn to detect such suspicious activity in this course!\n\nLearn More & Enroll\n\nCourse\n\n1\n\nH:\n\n30\n\nM\n\n2\n\n CEUS\n\n### Automated Archive and Exfiltration\n\nOnce an adversary has firmly established access within a target environment\nand identified data of interest, they want to gather and exfiltrate that data.\nLearn to detect such late-stage threat actor campaign techniques of automated\narchive and exfiltration in our hands-on course.\n\nLearn More & Enroll\n\nCourse\n\n1\n\nH:\n\n20\n\nM\n\n1\n\n CEUS\n\n### Using LOLbins for Tool Downloads\n\nLOLbins won't have you laughing when threat actors \"live off the land\" to\nleverage tools and capabilities that are already present in the target\nenvironment to achieve objectives. Learn how to detect common adversary\ntechniques such as Ingress Tool Transfer in this course.\n\nLearn More & Enroll\n\nCourse\n\n1\n\nH:\n\n30\n\nM\n\n2\n\n CEUS\n\n### Ransomware with Recovery Disruption\n\nAfter an adversary has exfiltrated data from a target system, the potential\nfinal stages in an attack include encrypting data for impact and inhibiting\nsystem recovery. Learn how to detect endgame ransomware techniques before a\nthreat actor can accomplish their nefarious objectives!\n\nLearn More & Enroll\n\nCourse\n\nFree\n\n3\n\nH:\n\n50\n\nM\n\n4\n\n CEUS\n\n### Entry-Level Cybersecurity Training\n\nAre you new to cybersecurity and looking for a stepping stone into this\nexciting career field? Cybersecurity skills are in high demand, and the field\nis projected to grow 33% by 2030. This Entry-Level Cybersecurity Training\ncourse will give you the foundational knowledge you need to get started.\n\nLearn More & Enroll\n\nCourse\n\nFree\n\n2\n\nH:\n\n57\n\nM\n\n3\n\n CEUS\n\n### Intro to Python\n\nIf you need to learn the basics of Python for cyber security, then this\nintroductory Python course is right for you. Instructor Joe Perry teaches you\na framework that is a must-know for any cyber security professional.\nUnderstand the basics of the language, solve problems with scripts, and\nidentify useful Python modules.\n\nLearn More & Enroll\n\nCourse\n\nFree\n\n2\n\nH:\n\n43\n\nM\n\n3\n\n CEUS\n\n### Python for Cybersecurity Professionals\n\nComputing devices can be used for and against us. The way to get more done in\nless time is through the language of computers, which is programming. Python\nprovides a powerful, beginner-friendly platform for programming, and this\ncourse will teach you to develop basic python scripts that can be used in the\ncontext of cybersecurity.\n\nLearn More & Enroll\n\nCourse\n\n1\n\nH:\n\n19\n\nM\n\n1\n\n CEUS\n\n### Compromise Software Supply Chain\n\nThreat actors use the technique Compromise Software Supply Chain by altering\nsoftware that they know their victims will use. They include a backdoor that\nwill give them access to their victim's network once the software is\ninstalled. You will detect this technique in a virtual lab and master how to\nmitigate this threat.\n\nLearn More & Enroll\n\nCourse\n\n1\n\nH:\n\n10\n\nM\n\n1\n\n CEUS\n\n### Disable Windows Event Log and Timestomp\n\nSophisticated threat actors like APT29 will use the techniques Disable Windows\nEvent Logging and Timestomp for defense evasion to prevent defenders from\nseeing their presence on the network. You will detect this nefarious activity\nin our virtual lab so you can react to advanced attackers and outsmart them.\n\nLearn More & Enroll\n\nCourse\n\n1\n\nH:\n\n15\n\nM\n\n1\n\n CEUS\n\n### Unsecured Credentials and Domain Accounts\n\nThreat actors use the techniques Unsecured Credentials and Domain Accounts to\nobtain credential access and gain persistence. In this emulation of how the\nthreat group APT29 would use these techniques, you will get hands-on practice\ndetecting this activity so you can protect your organization from highly\nsophisticated advanced persistent threats.\n\nLearn More & Enroll\n\nCourse\n\n1\n\nH:\n\n10\n\nM\n\n1\n\n CEUS\n\n### Application Layer Protocol for C2 and Exfil to Cloud\n\nThreat actors like APT29 use Application Layer Protocols for Command and\nControl (C2) so they can blend in and avoid detection. They also may attempt\nto steal data and exfiltrate it to a cloud storage service as the end-goal of\ntheir attack. In this course, you will learn about these techniques and get\npractice detecting them in our virtual lab.\n\nLearn More & Enroll\n\nCourse\n\n1\n\nH:\n\n5\n\nM\n\n1\n\n CEUS\n\n### Lateral Movement: Windows Remote Management\n\nIn order to achieve lateral movement, threat actors will use a valid account\nto access remote systems, such as the Windows Remote Management service. In\nthis way, the threat actor can move around the network and search for valuable\ninformation or greater access. Learn more and get hands-on with this technique\nby detecting it in our virtual lab.\n\nLearn More & Enroll\n\nCourse\n\nFree\n\n5\n\nH:\n\n22\n\nM\n\n6\n\n CEUS\n\n### Command Line Basics\n\nIn this course you will learn the fundamentals of Command Line, a fundamental\ntool for any user of Windows and Linux machines. Command line allows\ndevelopers to manipulate files easily and quickly. Learning command line saves\ndevelopers time and resources.\n\nLearn More & Enroll\n\nCourse\n\nFree\n\n4\n\nH:\n\n20\n\nM\n\n5\n\n CEUS\n\n### Web Application Penetration Testing\n\nIf you want to be a penetration tester, you need to get inside the mind of a\nhacker and learn why sites get hacked. In this Web Application Penetration\nTesting course by Cydefe, you’ll build upon your existing Linux skills and get\nhands-on experience with setting up your own pentesting environment.\n\nLearn More & Enroll\n\nCourse\n\nFree\n\n11\n\nH:\n\n55\n\nM\n\n11\n\n CEUS\n\n### CompTIA A+ 220-1102\n\nReady to pass your CompTIA A+ 220-1102 exam on your path to becoming an IT and\ncybersecurity professional? In this course, you will learn the fundamentals of\noperating systems, security, software troubleshooting, and operating\nprocedures. Gain the skills you’ll need to become a systems administrator or\nnetwork administrator.\n\nLearn More & Enroll\n\nCourse\n\nFree\n\n2\n\nH:\n\n58\n\nM\n\n3\n\n CEUS\n\n### VMware Foundations\n\nIn the VMware Foundations course, students will learn virtualization basics\nand core concepts, the components and features of the VMware vSphere, and\nmanaging virtual machines. Upon completion, students will have a basic\nunderstanding of the vSphere.\n\nLearn More & Enroll\n\nCourse\n\nFree\n\n7\n\nH:\n\n20\n\nM\n\n6\n\n CEUS\n\n### AWS Certified Security-Specialty (2022)\n\nThe AWS Certified Security-Specialty (AWSCS-S) is for cloud professionals who\nare interested in the security side of AWS cloud infrastructure. In this\ncourse, you will learn the necessary knowledge to pass the AWS SCS-C01 exam.\nThis certification is recommended for those with two or more years of\nexperience with securing AWS cloud workloads.\n\nLearn More & Enroll\n\nCourse\n\n1\n\nH:\n\n35\n\nM\n\n2\n\n CEUS\n\n### Replication Through Removable Media\n\nIn this course, students will learn the basics of how an adversary can use\nremovable media devices to not only gain access to an unauthorized host, but\nalso enable autorun scripts to download additional infrastructure and payloads\nto a victim host.\n\nLearn More & Enroll\n\nCourse\n\n1\n\nH:\n\n35\n\nM\n\n2\n\n CEUS\n\n### System Binary Proxy Execution: Msiexec\n\nIn the course, you will learn how a malicious user can obfuscate some of their\npayload actions through downloaded DLL files by utilizing the built in\nrundll32.exe. By using rundll32, an attacker can make their activity look like\na normal Windows system binary process being executed under the rundll32.\n\nLearn More & Enroll\n\nCourse\n\n1\n\nH:\n\n35\n\nM\n\n2\n\n CEUS\n\n### System Binary Proxy Execution: Rundll32\n\nIn the course, you will learn how a malicious user can obfuscate some of their\npayload actions through downloaded DLL files using the built-in rundll32.exe.\nUsing rundll32, an attacker can make their activity look like a normal Windows\nsystem binary process being executed under rundll32.\n\nLearn More & Enroll\n\nCourse\n\n1\n\nH:\n\n35\n\nM\n\n2\n\n CEUS\n\n### Command and Scripting Interpreter: Windows Command Shell\n\nIn this course, you will learn how the native CMD scripting language for\nWindows can be abused to allow an attacker to execute remote commands,\nestablish persistence and create autorun files to carry out an attack within\nthe Raspberry Robin attack cycle.\n\nLearn More & Enroll\n\nCourse\n\n1\n\nH:\n\n35\n\nM\n\n2\n\n CEUS\n\n### Application Layer Protocol: Web Protocols\n\nIn this course, students will learn how C2 connections are established and\nused by attackers in a real-world demonstration to give learners a sense of\nhow to detect malicious HTTP traffic. This is the last course in the Raspberry\nRobin Attack series.\n\nLearn More & Enroll\n\nCourse\n\nFree\n\n0\n\nH:\n\n48\n\nM\n\n1\n\n CEUS\n\n### Corporate Cybersecurity Management\n\nCyber risk, legal considerations and insurance are often overlooked by\nbusinesses and this sets them up for major financial devastation should an\nincident occur.\n\nLearn More & Enroll\n\nCourse\n\n1\n\nH:\n\n35\n\nM\n\n2\n\n CEUS\n\n### Search Open Technical Databases: Scan Databases\n\nThis course covers various aspects of the Search Open Technical Databases:\nScan Databases TTP, including its components, associated risks, and detection\ntechniques. Participants will learn how to detect and mitigate the risks\nassociated with this TTP (T1596.005) and techniques for validating alerts and\nconducting pre and post-alert preparations.\n\nLearn More & Enroll\n\nCourse\n\n1\n\nH:\n\n35\n\nM\n\n2\n\n CEUS\n\n### Exploit Public-Facing Application\n\nThis course covers the MITRE technique T1190: Exploit Public-Facing\nApplication. This technique involves an adversary exploiting a vulnerability\nin a public-facing application to gain unauthorized access to a target\nnetwork. Students will learn about the types of public-facing applications and\ncommon vulnerabilities that attackers may target.\n\nLearn More & Enroll\n\nCourse\n\n1\n\nH:\n\n55\n\nM\n\n2\n\n CEUS\n\n### Ingress Tool Transfer\n\nThis course gives cybersecurity professionals an in-depth understanding of the\nMITRE TTP T1105 technique. This involves using legitimate tools to transfer\nmalicious files onto a target network and the techniques used to evade\ndetection. The course will also cover prevention strategies for this type of\nattack.\n\nLearn More & Enroll\n\nCourse\n\n0\n\nH:\n\n58\n\nM\n\n1\n\n CEUS\n\n### CISO Competency - Innovation\n\nThis is the first course in Ed Amoroso's Twelve Competencies of the Effective\nCISO, which focuses on the CISO Competency in Innovation. The habit of\ninnovation is an essential competency for any CISO trying to navigate variety\nof dynamic threats, risks, oppurtunities, and failures, so it is essential in\nan evolving business environment.\n\nLearn More & Enroll\n\nCourse\n\n0\n\nH:\n\n55\n\nM\n\n1\n\n CEUS\n\n### CISO Competency - Finance & Administration\n\nThis is the second course in Ed Amoroso's Twelve Competencies of the Effective\nCISO, which focuses on the CISO Competency in Finance & Administration. An\nawareness and understanding of corporate finance and business administration\nis essential to succeed as an exec. This includes expertise in competing for\nbudget, resources, staff, and more.\n\nLearn More & Enroll\n\nCourse\n\n1\n\nH:\n\n35\n\nM\n\n2\n\n CEUS\n\n### Exfiltration Over C2 Channel\n\nThis course covers the Mitre TTP T1041- Exfiltration Over C2 channel, which\ninvolves exfiltrating data over a command and control (C2) channel. This\ntechnique is commonly used by threat actors to evade detection and exfiltrate\nsensitive information from compromised networks.\n\nLearn More & Enroll\n\nCourse\n\n0\n\nH:\n\n59\n\nM\n\n1\n\n CEUS\n\n### CISO Competency - Security\n\nThis is the fourth course in Ed Amoroso's Twelve Competencies of the Effective\nCISO, which focuses on the CISO Competency in Cyber Security Expertise. The\nCISO must serve as the governing expert in cyber security for the\norganization. The CISO must possess excellent working-knowledge of critical\nsecurity issues.\n\nLearn More & Enroll\n\nCourse\n\n1\n\nH:\n\n0\n\nM\n\n1\n\n CEUS\n\n### CISO Competency - Business\n\nThis is the third course in Ed Amoroso's Twelve Competencies of the Effective\nCISO, which focuses on the CISO Competency in Business Operations. Modern\nCISOs must have in-depth knowledge in optimizing the increasingly-complex,\nconnection between security and business operations.\n\nLearn More & Enroll\n\nCourse\n\n1\n\nH:\n\n1\n\nM\n\n1\n\n CEUS\n\n### CISO Competency - Discretion\n\nThis is the fifth course in Ed Amoroso's Twelve Competencies of the Effective\nCISO, which focuses on the CISO Competency in Discretion and Trust. The CISO\nmust be able to exhibit and manage high levels of discretion and trust in\ndealing with sensitive information regarding threats, investigations, and on-\ngoing initiatives.\n\nLearn More & Enroll\n\nCourse\n\n0\n\nH:\n\n58\n\nM\n\n1\n\n CEUS\n\n### CISO Competency - Public Speaking\n\nThis is the sixth course in Ed Amoroso's Twelve Competencies of the Effective\nCISO, which focuses on the CISO Competency in Public Speaking. As a senior\nexecutive, the CISO must have the ability to speak confidently and effectively\nbefore groups ranging from large audiences to corporate boards.\n\nLearn More & Enroll\n\nCourse\n\n1\n\nH:\n\n2\n\nM\n\n1\n\n CEUS\n\n### CISO Competency - Productivity\n\nThis is the seventh course in Ed Amoroso's Twelve Competencies of the\nEffective CISO, which focuses on the CISO Competency in Personal Productivity.\nThe CISO should be able to optimize personal productivity by developing\neffective time management processes and prioritization skills.\n\nLearn More & Enroll\n\nCourse\n\n0\n\nH:\n\n56\n\nM\n\n1\n\n CEUS\n\n### CISO Competency - Technology\n\nThis is the eighth course in Ed Amoroso's Twelve Competencies of the Effective\nCISO, which focuses on the CISO Competency in Technology. The CISO must\nconsistantly produce deep insights into the current status and trends\nassociated with information technology, especially in relation to security.\n\nLearn More & Enroll\n\nCourse\n\n1\n\nH:\n\n2\n\nM\n\n1\n\n CEUS\n\n### CISO Competency - Threats\n\nThis is the ninth course in Ed Amoroso's Twelve Competencies of the Effective\nCISO, which focuses on the CISO Competency in Threat Insights. The CISO must\nmaintain accurate and realistic insights into the evolving threats facing\ncyber security teams, and produce qualitative and quantitative assessments for\nrisk decisions.\n\nLearn More & Enroll\n\nCourse\n\n0\n\nH:\n\n59\n\nM\n\n1\n\n CEUS\n\n### CISO Competency - Compliance\n\nThis is the tenth course in Ed Amoroso's Twelve Competencies of the Effective\nCISO, which focuses on the CISO Competency in Balancing Compliance. The\neffective CISO navigates compliance and security in supporting a balanced\ncyber risk management program, with an in depth understanding of industry\nframeworks.\n\nLearn More & Enroll\n\nCourse\n\n0\n\nH:\n\n59\n\nM\n\n1\n\n CEUS\n\n### CISO Competency - Risk\n\nThis is the eleventh course in Ed Amoroso's Twelve Competencies of the\nEffective CISO, which focuses on the CISO Competency in Risk Orientation.\nDeveloping a complete risk structure and framework for enterprise security\nprioritizes safeguards, minimizes expenses, and maximizes support and\nmitigation for business operations.\n\nLearn More & Enroll\n\nCourse\n\n1\n\nH:\n\n3\n\nM\n\n1\n\n CEUS\n\n### CISO Competency - Leadership\n\nThis is the twelfth course in Ed Amoroso's Twelve Competencies of the\nEffective CISO, which focuses on the CISO Competency in Leadership and Vision.\nEvery successful CISO incorporates leadership skills and a clear vision into\ntheir approach to guiding their program, staff, and other stakeholders,\nincluding the CEO and Board.\n\nLearn More & Enroll\n\nCourse\n\n0\n\nH:\n\n58\n\nM\n\n1\n\n CEUS\n\n### CISO Security Controls: Enterprise Controls\n\nThis is the first course in Ed Amoroso's 50 Security Controls, which covers\nthe enterprise controls derived from the TAG Cyber Fifty Enterprise Controls.\nThe enterprise controls provide students with an executive high-level strategy\nwith which to secure their organization from threats, data breach, and\nintrusion.\n\nLearn More & Enroll\n\nCourse\n\n0\n\nH:\n\n41\n\nM\n\n1\n\n CEUS\n\n### CISO Security Controls: Network Controls\n\nThis is the second course in Ed Amoroso's 50 Security Controls, which covers\nthe network controls derived from the TAG Cyber Fifty Enterprise Controls. The\nnetwork controls provide students with an executive high-level strategy in\nnetwork security and covers trends in the network control areas.\n\nLearn More & Enroll\n\nCourse\n\n0\n\nH:\n\n59\n\nM\n\n1\n\n CEUS\n\n### CISO Security Controls: Endpoint Controls\n\nThis is the third course in Ed Amoroso's 50 Security Controls, which covers\nthe endpoint controls derived from the TAG Cyber Fifty Enterprise Controls.\n\nLearn More & Enroll\n\nCourse\n\n0\n\nH:\n\n56\n\nM\n\n1\n\n CEUS\n\n### CISO Security Controls: Governance Controls\n\nThis is the fourth course in Ed Amoroso's 50 Security Controls, which covers\nthe governance controls derived from the TAG Cyber Fifty Enterprise Controls.\nThe governance controls provide students with executive strategies, to\nimplement and maintain a variety of dynamic security management domains.\n\nLearn More & Enroll\n\nCourse\n\n0\n\nH:\n\n57\n\nM\n\n1\n\n CEUS\n\n### CISO Security Controls: Data Controls\n\nThis is the fifth course in Ed Amoroso's 50 Security Controls, which covers\nthe data controls derived from the TAG Cyber Fifty Enterprise Controls. The\ndata controls provide students with a high-level overview of data security,\nencryption, and vulnerability management policy.\n\nLearn More & Enroll\n\nCourse\n\n0\n\nH:\n\n59\n\nM\n\n1\n\n CEUS\n\n### CISO Security Controls: Industry Controls\n\nThis is the sixth course in Ed Amoroso's 50 Security Controls, which covers\nthe industry controls derived from the TAG Cyber Fifty Enterprise Controls.\nThe industry controls provide students with an executive anlysis of trends in\nthe security industry in valued training and development.\n\nLearn More & Enroll\n\nCourse\n\nFree\n\n1\n\nH:\n\n46\n\nM\n\n2\n\n CEUS\n\n### Executive RMF\n\nThis course will discuss the NIST Risk Management Framework (RMF) from an\nexecutive perspective. Each module will not only address each step in the RMF\nprocess, but how this process can be implemented into your organization or\nbusiness.\n\nLearn More & Enroll\n\nCourse\n\nFree\n\n7\n\nH:\n\n47\n\nM\n\n9\n\n CEUS\n\n### Scanning, Enumeration, and Vulnerabilities\n\nThis course covers basic scanning, enumeration, and vulnerability scanning as\npart of a penetration test.\n\nLearn More & Enroll\n\nCourse\n\nFree\n\n17\n\nH:\n\n43\n\nM\n\n18\n\n CEUS\n\n### Computer Hacking and Forensics\n\nIf you love the idea of doing digital forensics investigations to catch\ncybercriminals and want to earn your CHFI certification, this course is for\nyou. Learn how to detect online criminal activity, gather evidence, and\nrecover deleted data. Prepare for the EC Council’s CHFI certification and be\nready to fill jobs that are in high demand.\n\nLearn More & Enroll\n\nCourse\n\nFree\n\n27\n\nH:\n\n53\n\nM\n\n31\n\n CEUS\n\n### Cisco Certified Network Associate (CCNA) Certification\n\nOur online, self-paced Cisco Certified Network Associate CCNA training teaches\nstudents to install, configure, troubleshoot and operate LAN, WAN and dial\naccess services for medium-sized networks. You'll also learn how to describe\nthe operation of data networks.\n\nLearn More & Enroll\n\nCourse\n\nFree\n\n11\n\nH:\n\n47\n\nM\n\n14\n\n CEUS\n\n### Sniffing\n\nThis course covers basic sniffing as part of a penetration test. Attackers and\npenetration testers use sniffing to analyze network packets for information.\n\nLearn More & Enroll\n\nCourse\n\nFree\n\n5\n\nH:\n\n8\n\nM\n\n5\n\n CEUS\n\n### Hyper-V\n\nMicrosoft Hyper-V is a technology that allows you to create virtual\nenvironments like operating systems, virtual servers, and virtual components\nlike hard drives and network switches. In this Hyper-V training, you’ll learn\nhow to build, configure, and understand virtual machines in both the server\nand client environments.\n\nLearn More & Enroll\n\nCourse\n\nFree\n\n1\n\nH:\n\n41\n\nM\n\n2\n\n CEUS\n\n### Cybersecurity Kill Chain™\n\nLearn a foundational concept within cybersecurity in this Cybersecurity Kill\nChain™ course. This course simulates an example attack and exposes the 7\nphases of the Lockheed Martin Cyber Kill Chain™. Then you’ll apply the\nknowledge gained to design a defense-in-depth model to defend against the\nattack.\n\nLearn More & Enroll\n\nCourse\n\n0\n\nH:\n\n4\n\nM\n\n0\n\n CEUS\n\n### How to Use binwalk (BSWJ)\n\nIn this “How to Use binwalk (BSWJ)” course, cybersecurity expert Joe Perry\ntakes you on another “Breaking Stuff with Joe” (BSWJ) adventure by showing you\nhow to use the analysis tool binwalk to find executable code and embedded\nfiles inside binary files. Such images can be used to crack IoT devices.\n\nLearn More & Enroll\n\nCourse\n\nFree\n\n13\n\nH:\n\n10\n\nM\n\n13\n\n CEUS\n\n### Penetration Testing Execution Standard (PTES)\n\nThis Penetration Testing Execution Standard (PTES) course provides a\ncomprehensive set of standards for penetration testing. The PTES guides\ninformation security professionals while also helping inform organizations\nwhat can be expected from penetration tests. Business and security\nprofessionals will benefit from this course.\n\nLearn More & Enroll\n\nCourse\n\nFree\n\n13\n\nH:\n\n15\n\nM\n\n14\n\n CEUS\n\n### Assembly\n\nAssembly is the lowest-level programming language and is useful in reverse\nengineering and malware analysis. It can also be used for direct hardware\nmanipulation or to address critical performance issues. This course requires a\nbackground in basic programming concepts and access to a Linux system. Learn\nAssembly online today!\n\nLearn More & Enroll\n\nCourse\n\nFree\n\n8\n\nH:\n\n29\n\nM\n\n10\n\n CEUS\n\n### Application of the MITRE ATT&CK Framework\n\nThis MITRE ATT&CK training is designed to teach students how to apply the\nmatrix to help mitigate current threats. Students will move through the 12\ncore areas of the framework to develop a thorough understanding of various\naccess ATT&CK vectors.\n\nLearn More & Enroll\n\nCourse\n\nFree\n\n1\n\nH:\n\n53\n\nM\n\n2\n\n CEUS\n\n### Azure Storage Accounts\n\nOn the path to becoming a Microsoft Azure Cloud Engineer? Azure Storage\nAccounts are essential for storing and securing your data in the cloud. This\ncourse covers storage account configuration options, as well as uploading,\nsecuring, and managing data in the accounts.\n\nLearn More & Enroll\n\nCourse\n\nFree\n\n3\n\nH:\n\n20\n\nM\n\n4\n\n CEUS\n\n### Cyber Network Security\n\nIf you want to become a network engineer, you’ll want to learn more about\nincident response and business continuity planning. In the Cyber Network\nSecurity course, cybersecurity analyst Pete Cipolone provides an overview of\nnetwork terminology. Learn about different threats, regulations, and\ncybersecurity ethical considerations.\n\nLearn More & Enroll\n\nCourse\n\nFree\n\n0\n\nH:\n\n29\n\nM\n\n1\n\n CEUS\n\n### Incident Response Steps\n\nIn Incident Response Steps, David Biser accentuates the significance of\nplanning out a response for when an incident occurs. He lays out an overview\nof the important steps of an incident response plan and gives a breakdown of\neach step.\n\nLearn More & Enroll\n\nCourse\n\n0\n\nH:\n\n53\n\nM\n\n1\n\n CEUS\n\n### Enterprise Security Leadership: Negotiation Skills for Cyber Leaders\n\nIn this session of Enterprise Security Leadership in the Modern Era, Ed\nAmoroso reviews the 8 rules of good negotiations and how they align not only\nto professional and personal life, but how they are central to maintaining\nproper Cybersecurity.\n\nLearn More & Enroll\n\nCourse\n\nFree\n\n1\n\nH:\n\n47\n\nM\n\n4\n\n CEUS\n\n### Malware Threats\n\nInterested in penetration testing and malware analysis? This malware course\nintroduces you to different types of malware, like viruses, worms, and\nTrojans. Gain hands-on experience in analyzing malicious files, identifying\nmalicious processes, and more.\n\nLearn More & Enroll\n\nCourse\n\nFree\n\n1\n\nH:\n\n59\n\nM\n\n2\n\n CEUS\n\n### Introduction to Splunk\n\nSplunk is a software platform that indexes data and makes it searchable,\nallowing it to be turned into operational intelligence. This Splunk training\ncourse will quickly introduce you to Splunk and its many capabilities for\norganizing and managing data. Take this course if you’re on the path to\nbecoming a SOC Analyst.\n\nLearn More & Enroll\n\nCourse\n\nFree\n\n1\n\nH:\n\n30\n\nM\n\n2\n\n CEUS\n\n### Phishing\n\nIf you’re looking to enter any field in cybersecurity, you’ll want to learn\nthe basics of phishing attacks. In this phishing course, you will learn how to\ncraft the perfect phishing email and defend against these increasingly clever\nsocial engineering attempts.\n\nLearn More & Enroll\n\nCourse\n\n1\n\nH:\n\n1\n\nM\n\n1\n\n CEUS\n\n### Enterprise Security Leadership: Conflict Resolution for Cyber Leaders\n\nLearn from Ed Amoroso and guest Chris Kubecka as they uncover the\nuncomfortable topic of conflict management, and reveal real-world examples and\nexperiences that leaders can use in current situations.\n\nLearn More & Enroll\n\nCourse\n\nFree\n\n1\n\nH:\n\n40\n\nM\n\n1\n\n CEUS\n\n### Kali Linux Fundamentals\n\nIf you’re interested in penetration testing and ethical hacking, then this\nKali Linux course is a great place to start your training. Learn about the\nindustry-standard tool for penetration and security testing. This is a\nfoundational course that is designed to provide the basics of Kali\ndistribution, installation, troubleshooting, and navigation.\n\nLearn More & Enroll\n\nCourse\n\nFree\n\n0\n\nH:\n\n25\n\nM\n\n2\n\n CEUS\n\n### Intro to Burp Suite Pro\n\nLearn to identify potential attack routes and security-related weaknesses in\nyour web applications using Burp Suite Pro, one of the web application\nscanning tools preferred by security engineers and ethical hackers. This Burp\nSuite training course will give you the basic knowledge you need to get up and\nrunning with this tool.\n\nLearn More & Enroll\n\nCourse\n\nFree\n\n7\n\nH:\n\n26\n\nM\n\n7\n\n CEUS\n\n### Incident Response and Advanced Forensics\n\nNeed some incident response training on your path to becoming a network\nengineer or cyber defense analyst? This course will introduce you to incident\nresponse and prepare you to conduct forensic collections. Learn how to develop\nprotection plans, dive into insider and malware threats, and commence incident\nrecovery.\n\nLearn More & Enroll\n\nCourse\n\nFree\n\n6\n\nH:\n\n17\n\nM\n\n7\n\n CEUS\n\n### NMAP\n\nThe network mapper (NMAP) is one of the highest quality and powerful free\nnetwork utilities in the cybersecurity professional's arsenal. This NMAP\ncourse offers the NMAP skills and commands needed to become a better network\nadministrator, incident responder, or penetration tester. Learn NMAP\nfundamentals and even create personal hands-on labs.\n\nLearn More & Enroll\n\nCourse\n\nFree\n\n1\n\nH:\n\n57\n\nM\n\n1\n\n CEUS\n\n### Social Engineering\n\nDo you have what it takes to learn the art of social engineering, or master\nmanipulation in cybersecurity? This social engineering course is essential for\nany aspiring penetration tester. Learn about different types of social\nengineering attacks and gain hands-on experience in two labs using the Social\nEngineering Toolkit (SET).\n\nLearn More & Enroll\n\nCourse\n\n0\n\nH:\n\n59\n\nM\n\n1\n\n CEUS\n\n### Enterprise Security Leadership: Team Dynamics for Cyber Leaders\n\nTeam dynamics, like many other areas of role and career development, is\nimportant in an industry plagued with misconceptions and global pressure.\nTaking on a leadership role in cybersecurity comes with a different set of\nresponsibilities.\n\nLearn More & Enroll\n\nCourse\n\n0\n\nH:\n\n59\n\nM\n\n1\n\n CEUS\n\n### Enterprise Security Leadership: Learning Methods for Cyber Leaders\n\nEd Amoroso and Cybrary’s own, Leif Jackson dive into the working model of\ntraining: Learn, Discuss, Practice, Apply, and Challenge.\n\nLearn More & Enroll\n\nCourse\n\nFree\n\n4\n\nH:\n\n13\n\nM\n\n5\n\n CEUS\n\n### Advanced Cyber Threat Intelligence\n\nDo you want to take your cyber threat intelligence skills to the next level so\nyou can better protect your organization? Learn to leverage existing data\nsources, reduce false positives, and use models like the Cyber Kill Chain, and\nthe MITRE ATT&CK framework to structure your analysis in this Advanced Cyber\nThreat Intelligence course.\n\nLearn More & Enroll\n\nCourse\n\nFree\n\n7\n\nH:\n\n56\n\nM\n\n11\n\n CEUS\n\n### Fundamentals of Vulnerability Management\n\nGet an introduction to protecting your network with this Fundamentals of\nVulnerability Management training. Ken Underhill explains how to use\nautomation to manage vulnerabilities and goes over the vulnerability\nmanagement lifecycle. You’ll walk away with a solid framework and\nunderstanding of different types of vulnerabilities and assessments.\n\nLearn More & Enroll\n\nCourse\n\nFree\n\n2\n\nH:\n\n41\n\nM\n\n3\n\n CEUS\n\n### Fundamentals of Cybersecurity Architecture\n\nThis cyber security architecture class aims to give an appreciation of the\nvarious aspects of consideration that goes into a proper security\narchitecture.\n\nLearn More & Enroll\n\nCourse\n\nFree\n\n1\n\nH:\n\n56\n\nM\n\n2\n\n CEUS\n\n### Open Source Intelligence (OSINT) Fundamentals\n\nOpen source intelligence (OSINT) is the process of collecting and analyzing\npublicly available information that can be exploited by adversaries. Learn\ntechniques for gathering intelligence from public data sources and how to\nleverage this knowledge to defend your organization from those who wish to do\nharm.\n\nLearn More & Enroll\n\nCourse\n\nFree\n\n1\n\nH:\n\n50\n\nM\n\n2\n\n CEUS\n\n### DFIR Investigations and Witness Testimony\n\nIs it time for you to testify? This course is for digital forensics and\nincident response professionals who are preparing to testify. Learn more about\nwhat makes an expert witness, as well as what is involved in the process from\ncollection and analysis to testimony. Gain confidence with defending your work\nbefore you take the witness stand!\n\nLearn More & Enroll\n\nCourse\n\nFree\n\n2\n\nH:\n\n6\n\nM\n\n3\n\n CEUS\n\n### Identifying Web Attacks Through Logs\n\nLog analysis involves reviewing and evaluating system activities to help\nmitigate risks. If you’re training to be a SOC Analyst, then you’ll need log\nanalysis training. This course will review web application infrastructure, web\nservers, and logs. You will explore attack scenarios and identify the attack\nthrough logs generated by the web server.\n\nLearn More & Enroll\n\nCourse\n\nFree\n\n1\n\nH:\n\n41\n\nM\n\n2\n\n CEUS\n\n### Introduction to IT & Cybersecurity\n\nAre you new to IT & cybersecurity and wondering which role might suit you\nbest? In this cybersecurity for beginners overview, we cover the roles of\nNetwork Administrator, Incident Responder, System Administrator, Penetration\nTester, Cloud Engineer, Cybersecurity Manager, and Privacy Analyst. Find the\nrole for you in this exciting field.\n\nLearn More & Enroll\n\nCourse\n\nFree\n\n1\n\nH:\n\n20\n\nM\n\n1\n\n CEUS\n\n### Password Cracking 101\n\nYou may wonder what a hash is and how adversaries exploit hashes to crack\npasswords. Learn how they do it and then practice doing it yourself in this\nPassword Cracking 101 course, which is perfect for both Red Teamers who are\nlearning privilege escalation and Blue Teamers who are learning how to audit\npassword strength.\n\nLearn More & Enroll\n\nCourse\n\nFree\n\n21\n\nH:\n\n49\n\nM\n\n22\n\n CEUS\n\n### Offensive Penetration Testing\n\nAs a pentester, you need to understand the methods of real-life attackers and\nuse the tools, techniques, and resources they exploit. Join ethical hacker\nClint Kehr as he guides you from basic hacking concepts to advanced\nexploitation techniques in this Offensive Penetration Testing Course. Develop\nthe hacker mindset or hone your existing skills.\n\nLearn More & Enroll\n\nCourse\n\nFree\n\n13\n\nH:\n\n3\n\nM\n\n13\n\n CEUS\n\n### Certified Cloud Security Professional (CCSP)\n\nAs you develop your skills for a cloud security engineer, architect, or\nmanager role, you’ll want to take this Certified Cloud Security Professional\n(CCSP) certification course. Information Security Analyst Graham Wicas will\ngive you the training to understand all six domains of the CCSP exam,\nincluding cloud data security and legal compliance.\n\nLearn More & Enroll\n\nCourse\n\nFree\n\n4\n\nH:\n\n1\n\nM\n\n4\n\n CEUS\n\n### Microsoft 365 Fundamentals (MS-900)\n\nMicrosoft 365 combines Microsoft Office with cloud-based software-as-a-service\nproducts and is one of the most widely used solutions today. Prove your\nfoundational knowledge of how to deploy and manage cloud services in Microsoft\n365 by getting the knowledge you need to pass the MS-900 certification in this\nMicrosoft 365 Fundamentals course.\n\nLearn More & Enroll\n\nCourse\n\n0\n\nH:\n\n5\n\nM\n\n0\n\n CEUS\n\n### How to Use Unicornscan (BSWR)\n\nAs a defender, you can use Unicornscan to evaluate your network and identify\nvulnerabilities. In this Unicornscan tutorial, Robert Smith shows you how to\nuse this popular port scanning tool to determine what ports are being used for\nnetwork communications so you can protect them. It’s another great Breaking\nStuff with Robert (BSWR) session.\n\nLearn More & Enroll\n\nnew release\n\nBaseline & Benchmark\n\nLearn how to start measuring the skills of your team -->\n\n## Industry-Leading  \n‍Certification Preparation\n\nExplore our on-demand courses developed by seasoned certified cybersecurity\npractitioners, aligned to the certification exam’s key learning objectives.\n\nStart learning for free\n\n## Words from our users\n\nWe're proud of our happy customers. Hear what our team customers have to say\nabout their experiences with our courses.\n\nI've been having concerns on how to start in terms of building my #cybercareer\nwith a sustained path. So I got introduced to Cybrary and I was able to enroll\nand startup early last week and I have gone through two sessions, getting to\nknow Cybrary and also a view of what cybersecurity is from their perspective.\nThat gave me an overall view of what jobs are found in the space, their\ngeneral responsibilities, required skills, necessary certifications and their\naverage salary pay... Cybrary has given me a greater reason to pursue my\nhearts desire at all cost.\n\nJamal O.\n\nStudent\n\nThanks to Cybrary I'm now a more complete professional! Everyone in [the]\ncybersecurity area should consider enrollment in any Cybrary courses.\n\nJoão S.\n\nIT Administrator - CISSP\n\nThe interviewer said the certifications and training I had completed on my own\ntime showed that I was a quick learner, and they gave me a job offer.\n\nJustin B.\n\nIT Specialist\n\nOur partnership with Cybrary has given us the opportunity to provide world-\nclass training materials at no cost to our clients, thanks to the funding\nwe’ve received from the government. Cybrary offers a proven method for\nbuilding a more skilled cybersecurity workforce.\n\nKatie Adams\n\nSenior Director\n\nAll of the knowledge, skills, and abilities gained through the program were\nessential to me impressing the employer during the interview.\n\nGabby H.\n\nSenior Security Analyst\n\nCybrary is a one-stop-shop for my cybersecurity learning needs. Courses on\nvulnerability management, threat intelligence, and SIEM solutions were key for\nmy early roles. As I grow into leadership roles influencing business policy,\nI’m confident Cybrary will continue developing the knowledge and skills I need\nto succeed.\n\nNo Name\n\nSenior Cybersecurity Consultant and Virtual CISO\n\nAfter tens of minutes, I proudly have achieved my certificate of continuing\neducation for Intro to Infosec... Doing everything I can to avoid retaking the\nCISSP test! Thanks Cybrary - 1 CPE at a time!\n\nAlex H.\n\nWe’ve had six students this summer, all with different schedules, so we’ve\nbeen trying to balance their learning experience with some practical work.\nIt’s not like they’re all sitting in a classroom at the same time, so the\nability for them to learn at their own pace without any additional support has\nprobably been the biggest benefit of using Cybrary.\n\nCollin Ricker\n\nBusiness Development Manager\n\nJust finished the third out of four MITRE ATT&CK Defender courses on\nCybrary... If anyone is interested in learning how to do ATT&CK based SOC\nassessments I would definitely recommend this course. The best part is that it\nis FREE!\n\nEric T.\n\nAWS Certified Cloud Practitioner\n\nExcellent new series of courses from Cybrary, each course covers a different\nCVE, demonstrates vulnerability and its mitigation.\n\nRaul C.\n\nCybersecurity Specialist\n\nI've successfully completed the career path provided by Cybrary to become a\nSOC Analyst - Level 2. Eventually, do what you love, and do it well - that's\nmuch more meaningful than any metric.\n\nWissal Ayari\n\nSOC Analyst\n\nCybrary is helping me proactively build skills and advance my career. Labs put\nconcepts immediately into practice, reinforcing the content (and saving me\ntime not having to spin up my own VM). Career paths lay everything out\nclearly, so I know what skills to prioritize.\n\nNo Name\n\nEnterprise Analyst\n\nI got a job as a cybersecurity analyst at Radware with a salary I've never\neven dreamed about AND with no prior experience.\n\nAlexei Z.\n\nCybersecurity Analyst\n\nThank you to Cybrary for providing this opportunity to complete the Cybrary\nOrientation Certification program with such sleekness and detail-oriented\nlearning.\n\nGanesh Y.\n\nSo far I have really been enjoying Cybrary's SOC Analyst Training, it has been\nvery informative. I just finished up with the command line section and now I'm\non to the more fun stuff (Malware Analysis). I think it's so dope that\nplatforms like this exist. This is a game changer.\n\nTobias Castleberry\n\nSOC Analyst, Security+ Certified\n\nI decided to check out Cybrary and the courses they had to offer after seeing\na few posts from people who had completed their courses. I'm happy to say that\ntheir instructors are knowledgeable and clear, and their course catalogues are\nextensive and offer relevant career path courses.\n\nNazli S.\n\nAWS Certified Cloud Practitioner\n\nGlad to have discovered Cybrary they are such a great tool to use to help\ndiversify your knowledge through lessons, assessments and practices. All\ncompact[ed] into highly detailed and informative chunks of information.\nFeeling very content with the results.\n\nTemi B.\n\nCisco Certified Network Associate\n\nWell, it took a long time, yet I struggled hard to complete the course \"Become\na SOC Analyst - Level 2\" by Cybrary. Cybrary is the best platform that I have\never come across. Tons of virtual labs, great in-depth insights from the\nexperts, and the best career path/learning modules.\n\nMadiraju Pranay Kashyap\n\nProgrammar Analyst Trainee\n\nI am currently working in a restaurant and going to school full time. But it\nis not stopping me from working on gaining more and more skills. I have\nalready spent more than 30 hours on Become a SOC Analyst level 1 [with]\nCybrary and still have 67 hours to go.\n\nAbibou F.\n\nSOC Analyst Level 1 Learner\n\n## Recent Articles\n\nView all posts\n\nTools & Applications\n\n### How to Make the Most of Blending Learning with Cybrary Live\n\nLearn how to get the most from your cybersecurity training platform by\nblending on-demand learning with virtual, live courses led by industry\nexperts.\n\nRead More\n\nNews & Events\n\n### Introducing the New Cybrary Learner Experience\n\nCybrary is launching a key update to the Cybrary Learner experience to elevate\nhands-on learning and measurement as guiding tenets of Cybrary’s mission.\n\nRead More\n\nBuilding a Security Team\n\n### Digital Forensics and Incident Response: What It Is, When You Need It, and\nHow to Implement It\n\nA quick guide to digital forensics and incident response (DFIR): what it is,\nwhen it’s needed, how to implement a cutting-edge program, and how to develop\nDFIR skills on your team.\n\nRead More\n\n## Start learning for free today\n\nJoin over 3 million professionals and 96% of Fortune 1000 companies improving\ntheir cybersecurity capabilities with Cybrary.\n\nCreate a free account\n\nCreate a Free Account\n\nSign in\n\nThank you! Your submission has been received!\n\nOops! Something went wrong while submitting the form.\n\nor sign up with\n\nSign in\n\nView all SSO options\n\nCybrary for teams\n\nView all SSO options\n\nSolutions\n\nFor Individuals\n\nFor Teams\n\nGovernment\n\nCompany\n\nAbout\n\nCareers\n\nPress\n\nCybrary Impact Hub\n\nPlatform\n\nCatalog\n\nInstructors\n\nAlliances\n\nResources\n\nBlog\n\nHelp Center\n\nThe Cybrary Podcast\n\nReport a Vulnerability\n\nPrivacy PolicyTerms of Service\n\nCybrary, Inc.© 2024\n\nRegister\n\nJoin over 3 million cybersecurity professionals advancing their career\n\nor sign up with\n\nEmail Address*\n\nPassword*\n\n _Your password does not meet the minimum security qualifications, please try\nagain._\n\nSee Password Requirements\n\nAt least 8 character(s)\n\nAt least 1 number(s)\n\nAt least 1 lowercase letter(s)\n\nAt least 1 uppercase letter(s)\n\nI want to receive new courses, feature updates, news, and discounts from\nCybrary\n\nBy creating an account, you agree to the Terms of Service and Privacy\nPolicyAlready have an account?\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of\nService apply.\n\nThank you! Your submission has been received!\n\nOops! Something went wrong while submitting the form.\n\nThis is some text inside of a div block.\n\nButton Text\n\n",
    "links": "[{\"link\": \"https://www.cybrary.it/\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/career-path\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/career-path/it-and-cybersecurity-foundations\", \"text\": \"IT and Cybersecurity Foundations\"}, {\"link\": \"https://www.cybrary.it/career-path/incident-handler\", \"text\": \"Become an Incident Handler\"}, {\"link\": \"https://www.cybrary.it/career-path/soc-analyst-level-3\", \"text\": \"Become a SOC Analyst - Level 3\"}, {\"link\": \"https://www.cybrary.it/career-path/soc-analyst-level-2\", \"text\": \"Become a SOC Analyst - Level 2\"}, {\"link\": \"https://www.cybrary.it/career-path/soc-analyst-level-1\", \"text\": \"Become a SOC Analyst - Level 1\"}, {\"link\": \"https://www.cybrary.it/career-path/penetration-tester\", \"text\": \"Become a Penetration Tester\"}, {\"link\": \"https://www.cybrary.it/career-path/network-engineer\", \"text\": \"Become a Network Engineer\"}, {\"link\": \"https://www.cybrary.it/career-path/cyber-security-engineer\", \"text\": \"Become a Cyber Security Engineer\"}, {\"link\": \"https://www.cybrary.it/career-path/microsoft-azure-cloud-engineer\", \"text\": \"Become an Azure Cloud Engineer\"}, {\"link\": \"https://www.cybrary.it/career-path/system-administrator\", \"text\": \"Become a System Administrator\"}, {\"link\": \"https://www.cybrary.it/course/iso-27001-2013-information-security-management-systems\", \"text\": \"ISO 27001:2013 - Information Security Management Systems\"}, {\"link\": \"https://www.cybrary.it/course/cloudtamer-io-cloud-governance-principles\", \"text\": \"Cloud Governance Principles\"}, {\"link\": \"https://www.cybrary.it/course/privacy-program-management\", \"text\": \"Privacy Program Management\"}, {\"link\": \"https://www.cybrary.it/course/nist-800-53-introduction-to-security-and-privacy-controls\", \"text\": \"NIST 800-53r5: Introduction to Security and Privacy Controls\"}, {\"link\": \"https://www.cybrary.it/course/pcidss\", \"text\": \"PCI DSS: Payment Card Industry Data Security Standard\"}, {\"link\": \"https://www.cybrary.it/course/end-user-cyber-fundamentals\", \"text\": \"End User Cyber Fundamentals\"}, {\"link\": \"https://www.cybrary.it/career-path/ciso\", \"text\": \"Become a CISO\"}, {\"link\": \"https://www.cybrary.it/career-path/50-ciso-security-controls\", \"text\": \"50 CISO Security Controls\"}, {\"link\": \"https://www.cybrary.it/career-path/12-competencies-of-the-effective-ciso\", \"text\": \"12 Competencies of the Effective CISO\"}, {\"link\": \"https://www.cybrary.it/certifications\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/comptia-security-plus\", \"text\": \"CompTIA Security+ (SY0-601)\"}, {\"link\": \"https://www.cybrary.it/course/comptia-project-plus-pk0-004\", \"text\": \"CompTIA Project+ (PK0-004)\"}, {\"link\": \"https://www.cybrary.it/course/az-900-microsoft-azure-fundamentals\", \"text\": \"AZ-900 Microsoft Azure Fundamentals\"}, {\"link\": \"https://www.cybrary.it/course/itil\", \"text\": \"ITIL 4 Foundation\"}, {\"link\": \"https://www.cybrary.it/course/computer-hacking-forensics-analyst\", \"text\": \"Computer Hacking and Forensics\"}, {\"link\": \"https://www.cybrary.it/course/comptia-a-plus\", \"text\": \"CompTIA A+ 220-1101\"}, {\"link\": \"https://www.cybrary.it/catalog?difficulty=beginner#CertificationPrep\", \"text\": \"View All\"}, {\"link\": \"https://www.cybrary.it/course/cisa\", \"text\": \"Certified Information Systems Auditor (CISA)\"}, {\"link\": \"https://www.cybrary.it/course/certnexus-cybersec-first-responder\", \"text\": \"CertNexus Cybersec First Responder\"}, {\"link\": \"https://www.cybrary.it/course/ccsp\", \"text\": \"Certified Cloud Security Professional (CCSP)\"}, {\"link\": \"https://www.cybrary.it/course/aws-certified-security-specialty-2022\", \"text\": \"AWS Certified Security-Specialty (2022)\"}, {\"link\": \"https://www.cybrary.it/catalog?difficulty=intermediate#CertificationPrep\", \"text\": \"View All\"}, {\"link\": \"https://www.cybrary.it/course/crisc\", \"text\": \"CRISC\"}, {\"link\": \"https://www.cybrary.it/course/az-305-designing-microsoft-azure-infrastructure-solutions\", \"text\": \"AZ-305 Designing Microsoft Azure Infrastructure Solutions\"}, {\"link\": \"https://www.cybrary.it/course/comptia-casp\", \"text\": \"CompTIA CASP+ (CAS-004)\"}, {\"link\": \"https://www.cybrary.it/course/cissp\", \"text\": \"Certified Information Systems Security Professional (CISSP)\"}, {\"link\": \"https://www.cybrary.it/mitre-attack\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/threat-actor-campaign\", \"text\": \"Threat Actor Campaigns\"}, {\"link\": \"https://www.cybrary.it/threat-actor-campaign/magic-hound\", \"text\": \"Magic Hound\"}, {\"link\": \"https://www.cybrary.it/threat-actor-campaign/raspberry-robin\", \"text\": \"Raspberry Robin\"}, {\"link\": \"https://www.cybrary.it/threat-actor-campaign/double-trouble-with-double-dragon\", \"text\": \"Double Trouble with Double Dragon\"}, {\"link\": \"https://www.cybrary.it/threat-actor-campaign/weak-link-in-the-supply-chain\", \"text\": \"Weak Link in the Supply Chain\"}, {\"link\": \"https://www.cybrary.it/threat-actor-campaign/spinning-a-web-shell-for-initial-access\", \"text\": \"Spinning a Web Shell for Initial Access\"}, {\"link\": \"https://www.cybrary.it/threat-actor-campaign/exfiltration-and-extortion\", \"text\": \"Exfiltration and Extortion\"}, {\"link\": \"https://www.cybrary.it/catalog?type=true#MissionReadiness\", \"text\": \"View All\"}, {\"link\": \"https://www.cybrary.it/course/cve-series-f5-big-ip-cve-2022-1388\", \"text\": \"CVE Series: F5 BIG-IP (CVE-2022-1388)\"}, {\"link\": \"https://www.cybrary.it/course/cve-series-couchdb-rce-cve-2022-24706\", \"text\": \"CVE Series: CouchDB RCE (CVE-2022-24706)\"}, {\"link\": \"https://www.cybrary.it/course/cve-series-atlassian-bitbucket-command-injection-cve-2022-36804\", \"text\": \"CVE Series: Atlassian Bitbucket Command Injection (CVE-2022-36804)\"}, {\"link\": \"https://www.cybrary.it/course/cve-series-grafana-directory-traversal-cve-2021-43798\", \"text\": \"CVE Series: Grafana Directory Traversal (CVE-2021-43798)\"}, {\"link\": \"https://www.cybrary.it/course/cve-series-blind-nosql-injection-cve-2021-22911\", \"text\": \"CVE Series: Blind NoSQL Injection (CVE-2021-22911)\"}, {\"link\": \"https://www.cybrary.it/course/cve-series-apache-httpd-cve-2021-42013\", \"text\": \"CVE Series: Apache HTTPD (CVE-2021-42013)\"}, {\"link\": \"https://www.cybrary.it/catalog?cve-3=true#MissionReadiness\", \"text\": \"View All\"}, {\"link\": \"https://www.cybrary.it/course/cybrary-challenge-space-mission1\", \"text\": \"Challenge: Space Mission\"}, {\"link\": \"https://www.cybrary.it/course/cybrary-challenge-a-message-within-a-message\", \"text\": \"Challenge: A Message Within A Message\"}, {\"link\": \"https://www.cybrary.it/course/cybrary-challenge-donot-believe-what-you-hear\", \"text\": \"Challenge: Don't Believe What You Hear\"}, {\"link\": \"https://www.cybrary.it/course/cybrary-challenge-chatting-with-chatgpt\", \"text\": \"Challenge: Chatting with ChatGPT\"}, {\"link\": \"https://www.cybrary.it/course/cybrary-challenge-saving-a-fellow-monster\", \"text\": \"Challenge: Saving a Fellow Monster\"}, {\"link\": \"https://www.cybrary.it/course/cybrary-challenge-gobble-gobble-conceal-and-deceive\", \"text\": \"Challenge: Gobble Gobble Conceal & Deceive\"}, {\"link\": \"https://www.cybrary.it/catalog?challenge-3=true#MissionReadiness\", \"text\": \"View All\"}, {\"link\": \"https://www.cybrary.it/mitre-attack\", \"text\": \"MITRE ATT&CK\"}, {\"link\": \"https://www.cybrary.it/mitre-attack\", \"text\": \"MITRE ATT&CK\"}, {\"link\": \"https://www.cybrary.it/catalog\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/instructor\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/career-path\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/career-path/it-and-cybersecurity-foundations\", \"text\": \"IT and Cybersecurity Foundations\"}, {\"link\": \"https://www.cybrary.it/career-path/incident-handler\", \"text\": \"Become an Incident Handler\"}, {\"link\": \"https://www.cybrary.it/career-path/soc-analyst-level-3\", \"text\": \"Become a SOC Analyst - Level 3\"}, {\"link\": \"https://www.cybrary.it/career-path/soc-analyst-level-2\", \"text\": \"Become a SOC Analyst - Level 2\"}, {\"link\": \"https://www.cybrary.it/career-path/soc-analyst-level-1\", \"text\": \"Become a SOC Analyst - Level 1\"}, {\"link\": \"https://www.cybrary.it/career-path/penetration-tester\", \"text\": \"Become a Penetration Tester\"}, {\"link\": \"https://www.cybrary.it/career-path/network-engineer\", \"text\": \"Become a Network Engineer\"}, {\"link\": \"https://www.cybrary.it/career-path/cyber-security-engineer\", \"text\": \"Become a Cyber Security Engineer\"}, {\"link\": \"https://www.cybrary.it/career-path/microsoft-azure-cloud-engineer\", \"text\": \"Become an Azure Cloud Engineer\"}, {\"link\": \"https://www.cybrary.it/career-path/system-administrator\", \"text\": \"Become a System Administrator\"}, {\"link\": \"https://www.cybrary.it/career-path/ciso\", \"text\": \"Become a CISO\"}, {\"link\": \"https://www.cybrary.it/career-path/50-ciso-security-controls\", \"text\": \"50 CISO Security Controls\"}, {\"link\": \"https://www.cybrary.it/career-path/12-competencies-of-the-effective-ciso\", \"text\": \"12 Competencies of the Effective CISO\"}, {\"link\": \"https://www.cybrary.it/free-content\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/cybrary-insider-pro\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/business\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/upgrade\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/cybrary-insider-pro\", \"text\": \"Cybrary Insider Pro\"}, {\"link\": \"https://www.cybrary.it/mitre-attack\", \"text\": \"MITRE ATT&CK\"}, {\"link\": \"https://www.cybrary.it/free-content\", \"text\": \"Free Access\"}, {\"link\": \"https://www.cybrary.it/career-path\", \"text\": \"Career Paths\"}, {\"link\": \"https://www.cybrary.it/success-stories\", \"text\": \"Success Stories\"}, {\"link\": \"https://www.cybrary.it/business\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/cybrary-select\", \"text\": \"Cybrary Select\"}, {\"link\": \"https://www.cybrary.it/cybrary-live\", \"text\": \"Cybrary Live\"}, {\"link\": \"https://www.cybrary.it/business\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/government\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/mitre-attack\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/threat-actor-campaign\", \"text\": \"Threat Actor Campaigns\"}, {\"link\": \"https://www.cybrary.it/mitre-attack\", \"text\": \"MITRE ATT&CK\"}, {\"link\": \"https://www.cybrary.it/mitre-attack\", \"text\": \"MITRE ATT&CK\"}, {\"link\": \"https://www.cybrary.it/business-resources\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/business-resources#case-studies\", \"text\": \"Case Studies\"}, {\"link\": \"https://www.cybrary.it/business-resources#research-papers\", \"text\": \"Research Papers\"}, {\"link\": \"https://www.cybrary.it/business-resources#articles\", \"text\": \"Articles\"}, {\"link\": \"https://www.cybrary.it/business-resources#white-papers\", \"text\": \"White Pages\"}, {\"link\": \"https://www.cybrary.it/upgrade\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/business\", \"text\": \"For Security Teams\"}, {\"link\": \"https://www.cybrary.it/mitre-attack\", \"text\": \"MITRE ATT&CK\"}, {\"link\": \"https://www.cybrary.it/baseline\", \"text\": \"Baselining \"}, {\"link\": \"https://www.cybrary.it/government\", \"text\": \"For Government\"}, {\"link\": \"https://www.cybrary.it/business-resources\", \"text\": \"Teams Resources\"}, {\"link\": \"https://www.cybrary.it/upgrade?ref=wwwnavpricing\", \"text\": \"Pricing\"}, {\"link\": \"https://www.cybrary.it/demo-request?ref=navbtn_bonz\", \"text\": \"Free Teams Demo\"}, {\"link\": \"https://www.cybrary.it/business\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/business\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/demo-request\", \"text\": \"Schedule a Demo\"}, {\"link\": \"https://www.cybrary.it/certifications\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/career-path\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/cve-series\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/business\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/threat-actor-campaign\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/free-content\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/catalog\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/ethical-hacking\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/comptia-security-plus\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/cissp\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/cisco-ccna\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/catalog\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/mitre-attack-registry-run-keys\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/mitre-attack-obtain-capabilities-tool\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/mitre-attack-lateral-tool-transfer\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/mitre-attack-scheduled-task\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/mitre-attack-user-discovery\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/mitre-attack-local-accounts\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/active-scanning-and-exploit-public-facing-application\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/mitre-attack-os-credential-dumping\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/mitre-attack-server-software-component-web-shell\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/mitre-attack-exfiltration-over-alternative-protocol-and-clear-cli-history\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/owasp\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/advanced-penetration-testing\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/comptia-a-plus\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/malware-analysis\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/powershell-for-security-professionals\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/mitre-attack-system-binary-proxy-execution-and-a-spearphish-payload\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/mitre-attack-persistence-via-windows-services\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/mitre-attack-local-account-discovery-creation-and-manipulation\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/mitre-attack-automated-archive-and-exfiltration\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/mitre-attack-using-lolbins-for-tool-downloads\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/mitre-attack-ransomware-with-recovery-disruption\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/entry-level-cybersecurity-training\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/python\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/python-for-cybersecurity-professionals\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/compromise-software-supply-chain\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/disable-windows-event-log-and-timestomp\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/unsecured-credentials-and-domain-accounts\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/application-layer-protocol-for-c2-and-exfil-over-c2\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/lateral-movement-windows-remote-management\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/command-line-basics\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/web-application-pen-testing\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/comptia-a-plus-part-2\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/vmware-foundations\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/aws-certified-security-specialty-2022\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/mitre-attack-replication-through-removable-media\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/mitre-attack-system-binary-proxy-execution-msiexec\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/mitre-attack-system-binary-proxy-execution-rundll32\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/mitre-attack-command-and-scripting-interpreter-windows-command-shell\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/mitre-attack-application-layer-protocol-web-protocol\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/corporate-cybersecurity-management\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/search-open-technical-databases-scan-databases\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/exploit-public-facing-application\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/ingress-tool-transfer\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/ciso-competency-innovation\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/ciso-competency-finance-and-administration\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/exfiltration-over-c2-channel\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/ciso-competency-security\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/ciso-competency-business\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/ciso-competency-discretion\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/ciso-competency-public-speaking\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/ciso-competency-productivity\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/ciso-competency-technology\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/ciso-competency-threats\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/ciso-competency-compliance\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/ciso-competency-risk\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/ciso-competency-leadership\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/enterprise-controls\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/security-controls-network-controls\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/security-controls-endpoint-controls\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/security-controls-governance-controls\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/security-controls-data-controls\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/security-controls-industry-controls\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/executive-rmf\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/scanning-enumeration-and-vulnerabilities\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/computer-hacking-forensics-analyst\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/cisco-ccna\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/sniffing\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/hyper-v\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/cybersecurity-kill-chain\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/binwalk-tutorial\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/penetration-testing-execution-standard-ptes\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/assembly\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/application-of-the-mitre-attack-framework\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/azure-storage-accounts\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/cyber-network-security\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/incident-response-steps\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/enterprise-security-leadership-negotiation-skills-for-cyber-leaders\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/malware-threats\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/intro-to-splunk\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/phishing\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/enterprise-security-leadership-conflict-resolution-for-cyber-leaders\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/kali-linux-fundamentals\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/intro-to-burp-suite-pro\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/incident-response-and-handling\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/nmap\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/social-engineering\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/enterprise-security-leadership-team-dynamics-for-cyber-leaders\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/enterprise-security-leadership-learning-methods-for-cyber-leaders\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/advanced-cyber-threat-intelligence-2020-07-09\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/fundamentals-vulnerability-management\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/fundamentals-of-cybersecurity-architecture\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/osint-fundamentals\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/dfir-investigations-and-witness-testimony\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/identifying-web-attacks-through-logs\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/introduction-to-it-and-cybersecurity\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/password-cracking-101\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/offensive-penetration-testing\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/ccsp\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/microsoft-365-fundamentals-ms-900\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/course/unicornscan-tutorial\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/baseline\", \"text\": \"Learn how to start measuring the skills of your team -->\"}, {\"link\": \"https://www.cybrary.it/blog\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/blog/how-to-make-the-most-of-blended-learning-with-cybrary-live\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/blog/introducing-the-new-cybrary-learner-experience\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/blog/digital-forensics-and-incident-response\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/business\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/cybrary-insider-pro\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/business\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/government\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/about\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/join-our-team\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/press\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/cybrary-impact-hub\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/catalog\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/instructor\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/alliances\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/blog\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/podcast\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/responsible-disclosure-program\", \"text\": \"\"}, {\"link\": \"https://www.cybrary.it/privacy-policy\", \"text\": \"Privacy Policy\"}, {\"link\": \"https://www.cybrary.it/terms-service\", \"text\": \"Terms of Service\"}]"
}