{
    "summary": "For IndividualsFor BusinessesFor UniversitiesFor Governments\n\nExplore\n\nOnline DegreesDegrees\n\n  * Online DegreeExplore Bachelor’s & Master’s degrees\n  * MasterTrack™Earn credit towards a Master’s degree\n  * University CertificatesAdvance your career with graduate-level learning\n\nFind your New Career\n\n  * Browse\n  * Top Courses\n  * Log In\n  * Join for Free\n\nList\n\n  * Browse\n  * Cybersecurity\n\n## Build Essential Cybersecurity Skills\n\nThe cybersecurity courses we offer are designed to help prepare you for a\ncareer in network security, ethical hacking, information assurance, and\ndigital forensics, providing you with the skills to protect and secure digital\nenvironments.\n\n### Filter by\n\nCredit Eligible (7)\n\nSubject\n\nRequired\n\n*\n\nInformation Technology (137)\n\nComputer Science (77)\n\nBusiness (17)\n\nSocial Sciences (13)\n\nShow more\n\nLanguage\n\nRequired\n\n*\n\nThe language used throughout the course, in both instruction and assessments.\n\nClose\n\nEnglish (226)\n\nFrench (155)\n\nSpanish (146)\n\nArabic (142)\n\nShow more\n\nLearning Product\n\nRequired\n\n*\n\nGuided Projects (12)\n\nBuild job-relevant skills in under 2 hours with hands-on tutorials.\n\nCourses (178)\n\nLearn from top instructors with graded assignments, videos, and discussion\nforums.\n\nSpecializations (44)\n\nGet in-depth knowledge of a subject by completing a series of courses and\nprojects.\n\nProfessional Certificates (12)\n\nEarn career credentials from industry leaders that demonstrate your expertise.\n\nDegrees (4)\n\nEarn your Bachelor’s or Master’s degree online for a fraction of the cost of\nin-person learning.\n\nLevel\n\nRequired\n\n*\n\nBeginner (179)\n\nIntermediate (44)\n\nAdvanced (5)\n\nMixed (18)\n\nDuration\n\nRequired\n\n*\n\nLess Than 2 Hours (12)\n\n1-4 Weeks (96)\n\n1-3 Months (95)\n\n3-6 Months (42)\n\n1-4 Years (4)\n\nSkills\n\nRequired\n\n*\n\nNetwork Security (71)\n\nSystem Security (64)\n\nSecurity Engineering (62)\n\nLeadership and Management (60)\n\nShow more\n\nSubtitles\n\nRequired\n\n*\n\nEnglish (239)\n\nFrench (158)\n\nSpanish (153)\n\nArabic (148)\n\nShow more\n\nEducator\n\nRequired\n\n*\n\nIBM (33)\n\nGoogle (29)\n\nLearnQuest (19)\n\nInfosec (18)\n\nShow more\n\n##\n\nChoose the Cybersecurity Course That Aligns Best With Your Educational Goals\n\n  * Google\n\n### Google Cybersecurity\n\n **Skills you'll gain:** Network Security, Python Programming, Linux, Cloud\nComputing, Algorithms, Computer Programming, Computer Security Incident\nManagement, Cryptography, Databases, Leadership and Management, Network\nArchitecture, Risk Management, SQL\n\n4.8\n\n(24K reviews)\n\nBeginner · Professional Certificate · 3 - 6 Months\n\n  * Google\n\n### Foundations of Cybersecurity\n\n **Skills you'll gain:** Linux, Computer Programming, Leadership and\nManagement, SQL\n\n4.9\n\n(17K reviews)\n\nBeginner · Course · 1 - 4 Weeks\n\n  * IBM\n\n### IBM Cybersecurity Analyst\n\n **Skills you'll gain:** Cryptography, Python Programming, Linux, Network\nSecurity, Security Strategy, Software Security, System Software, Computer\nSecurity Incident Management, Networking Hardware, Security Software, Cloud\nComputing, Cyberattacks, DevOps, Mobile Security, Computer Programming,\nDatabases, Leadership and Management, Operating Systems, SQL, System Security\n\n4.6\n\n(22K reviews)\n\nCredit Eligible\n\nBeginner · Professional Certificate · 3 - 6 Months\n\n  * Status: Free\n\nFree\n\nUniversity of Maryland, College Park\n\n### Cybersecurity for Everyone\n\n **Skills you'll gain:** Cyberattacks, Human Computer Interaction, Network\nSecurity, Security Engineering, Security Strategy, Computer Security Models,\nLeadership and Management, Risk Management, Software Security, Computer\nNetworking\n\n4.8\n\n(1.4K reviews)\n\nBeginner · Course · 1 - 3 Months\n\n  * Microsoft\n\n### Microsoft Cybersecurity Analyst\n\n **Skills you'll gain:** Cloud Computing, Computer Architecture, Data\nManagement, Leadership and Management, Microsoft Azure, Network Security,\nOperating Systems, System Security\n\n4.7\n\n(875 reviews)\n\nBeginner · Professional Certificate · 3 - 6 Months\n\n  * Status: Free\n\nFree\n\nCoursera Instructor Network\n\n### Introduction to Cybersecurity Fundamentals\n\n **Skills you'll gain:** Computer Security Incident Management\n\n4.6\n\n(44 reviews)\n\nBeginner · Course · 1 - 4 Weeks\n\n  * Google\n\n### Google IT Support\n\n **Skills you'll gain:** Computer Networking, Network Architecture, Network\nModel, Networking Hardware, Network Analysis, Computer Architecture, Critical\nThinking, Problem Solving, Communication, Human Computer Interaction, Network\nSecurity, Linux, System Security, Cloud Computing, Computer Programming,\nCustomer Support, Cryptography, Leadership and Management, Operating Systems\n\n4.8\n\n(185K reviews)\n\nCredit Eligible\n\nBeginner · Professional Certificate · 3 - 6 Months\n\n  * IBM\n\n### Introduction to Cybersecurity Tools & Cyber Attacks\n\n **Skills you'll gain:** Cryptography, Security Software, Cyberattacks,\nLeadership and Management\n\n4.6\n\n(15K reviews)\n\nBeginner · Course · 1 - 4 Weeks\n\n  * New York University\n\n### Introduction to Cyber Security\n\n **Skills you'll gain:** Security Engineering, Cyberattacks, Network Security,\nSystem Security, Security Strategy, Computer Networking, Security Software,\nComputer Security Models, Network Architecture, Strategy, Cryptography,\nProblem Solving, Software Security, Algorithms, Computer Security Incident\nManagement, Critical Thinking, Operational Analysis, Computational Thinking,\nBlockChain, Cloud Computing, Mobile Security\n\n4.7\n\n(3.4K reviews)\n\nBeginner · Specialization · 3 - 6 Months\n\n  * University of London\n\n### Master of Science in Cyber Security\n\nEarn a degree\n\nCredit Eligible\n\nDegree · 24 - 60 months\n\n  * IBM\n\n### IT Fundamentals for Cybersecurity\n\n **Skills you'll gain:** Cryptography, Network Security, Linux, Networking\nHardware, Security Software, System Software, Cloud Computing, Cyberattacks,\nDatabases, Leadership and Management, Operating Systems, SQL, System Security\n\n4.6\n\n(20K reviews)\n\nBeginner · Specialization · 3 - 6 Months\n\n  * Multiple educators\n\n### IBM and ISC2 Cybersecurity Specialist\n\n **Skills you'll gain:** Computer Security Incident Management, Leadership and\nManagement, Cloud Computing, System Security, Computer Networking, Risk\nManagement, Cloud Storage, Operating Systems, Network Security, Cloud\nPlatforms, Network Architecture, Networking Hardware, Cloud Applications,\nCloud Infrastructure, Computer Programming, Cyberattacks, Databases, DevOps,\nSecurity Engineering, Cryptography, IBM Cloud, Operations Management, Software\nEngineering\n\n4.7\n\n(8.5K reviews)\n\nBeginner · Professional Certificate · 3 - 6 Months\n\n## Searches related to cybersecurity\n\n _cybersecurity_ analyst\n\n _cybersecurity_ in healthcare (hospitals & care centres)\n\n _cybersecurity_ for everyone\n\n _cybersecurity_ free\n\n _cybersecurity_ and its ten domains\n\n _cybersecurity_ fundamentals\n\n _cybersecurity_ risk management framework\n\n _cybersecurity_ compliance framework & system administration\n\n1234…21\n\n## In summary, here are 10 of our most popular cybersecurity courses\n\n  * Google Cybersecurity: Google\n  * Foundations of Cybersecurity: Google\n  * IBM Cybersecurity Analyst: IBM\n  * Cybersecurity for Everyone: University of Maryland, College Park\n  * Microsoft Cybersecurity Analyst: Microsoft\n  * Introduction to Cybersecurity Fundamentals: Coursera Instructor Network\n  * Google IT Support: Google\n  * Introduction to Cybersecurity Tools & Cyber Attacks: IBM\n  * Introduction to Cyber Security: New York University\n  * Master of Science in Cyber Security: University of London\n\n## Learn Cybersecurity Online\n\nEmbark on a journey to safeguard digital landscapes with our comprehensive\ncybersecurity courses, designed for learners of all expertise levels. In our\ncurriculum, you'll start with the fundamentals of network security, data\nprotection, and threat assessment, building a solid foundation in the critical\naspects of cybersecurity. As you progress, explore advanced topics like\nethical hacking, cryptography, incident response, and the latest cybersecurity\ntechnologies and regulations. Our courses are taught by top universities and\nindustry professionals who bring real-world scenarios into the classroom,\nensuring that you learn the concepts and their practical applications. Whether\nyou're aiming to start a career in cybersecurity, enhance existing IT skills,\nor implement robust security practices in your organization, our courses\nprovide the depth and breadth of knowledge needed to navigate the complex\nworld of cybersecurity. With a mix of theoretical learning and hands-on\nexperience, you'll be well-prepared to tackle modern digital security\nchallenges. Join our community of cybersecurity professionals and start\nbuilding your defense against the cyber threats of today and tomorrow.\n\n## Skills you can learn in Computer Security And Networks\n\nGoogle (25)\n\nGoogle Cloud Platform (17)\n\nInternet (17)\n\nCryptography (16)\n\nNetwork Security (16)\n\nLinux (12)\n\nSoftware Testing (12)\n\nInformation Security (10)\n\nApplication Programming Interfaces (8)\n\nKubernetes (8)\n\nWeb (8)\n\nShow More\n\n## Frequently Asked Questions about Cybersecurity\n\nChevron Right\n\n### What are the best free cybersecurity courses?‎\n\nIf you're looking to learn all about cyber security, consider taking one of\nthe best free online cyber security courses. Cybersecurity for Everyone by the\nUniversity of Colorado System is a great introduction, especially if you have\nno background in the field. Alternatively, the Introduction to Cyber Security\nFoundations course from Michigan State University is a great place to start.\nFor those looking to understand how cyber security relates to healthcare, the\nCyber Security in Healthcare course from the University of Colorado Denver\noffers a comprehensive overview. For those interested in applying Artificial\nIntelligence for business, the AI for the Future of Work course from UC Davis\nwill be ideal. Finally, the Introduction to Applied Cryptography course from\nTel Aviv University is a great resource for learning the basics of\ncryptography.‎\n\nChevron Right\n\n### What are the best cybersecurity courses for beginners?‎\n\nIf you are looking for the best beginners cybersecurity courses, Cybersecurity\nfor Everyone offers several courses that focus on the fundamentals of\ncybersecurity. For a comprehensive introduction to cybersecurity, consider\nCybersecurity Foundations. If you are interested in learning more about\ncyberattacks, then Introduction to Cybersecurity: Cyber Attacks provides\nhelpful resources. Additionally, IT Security educates students on how to\nprotect networks and systems from malicious actors. Finally, Ethical Hacking\nEssentials can teach you how to use hacking techniques to protect your\norganization from cyber threats.‎\n\nChevron Right\n\n### What are the best advanced cybersecurity courses?‎\n\nIf you are looking for the best advanced cybersecurity courses available, then\ncheck out Data & Cyber Security, Palo Alto Networks Cloud Security\nFundamentals, Cybersecurity for Tech Professionals, IoT Cyber Security and IBM\nCybersecurity Analyst Assessment, courses to help you learn the essentials of\ncybersecurity.‎\n\nChevron Right\n\n### What is Cybersecurity, and why is it important to learn?‎\n\nCybersecurity involves tools, services, systems, and best practices designed\nto help with the detection, prevention, and mitigation of crime that involves\nthe internet. There are common types of cyberattacks that Cybersecurity aims\nto address, including phishing, malware, ransomware, and cyberterrorism. The\npurpose of cyberattacks varies, but some common motivations are to steal\nprivate information or demand money.\n\nCybercriminals continue to strengthen the intensity of their crimes. By 2021,\n$6 trillion in damages are expected to be paid by businesses responding to\ncyberattacks. Cybersecurity is critical to learn in order to help individuals\nand organizations in all sectors defend themselves against these crimes, and\nthe costly damages that happen as a result.\n\nCybersecurity is one of the trending job skills in Coursera's 2020 Global\nSkills Index (GSI). Download the 2020 edition of the GSI report.‎\n\nChevron Right\n\n### What jobs can you get in cybersecurity?‎\n\nOrganizations in various sectors and industries are in critical need of\nimproved cybersecurity. The U.S. Bureau of Labor Statistics expects 32 percent\ngrowth information security analyst hiring from 2022-2032*. Cybersecurity jobs\ninclude security systems administrator, penetration tester, security engineer,\nand cryptography engineer.\n\n**Read more:** 10 Cybersecurity Jobs: Entry-Level and Beyond\n\n*US Bureau of Labor Statistics. \"Occupational Outloook Handbook: Information Security Analysts, https://www.bls.gov/ooh/computer-and-information-technology/information-security-analysts.htm.\" Accessed ‎\n\nChevron Right\n\n### How can online courses help you learn Cybersecurity?‎\n\nCybersecurity courses offered through Coursera help learners understand modern\ninformation- and system- protection technology and methods; how to connect\ncybersecurity concepts to real business experiences; types of cyberattacks;\noperating system and database vulnerabilities; topics such as cryptography and\ndigital forensics; and more.\n\nLessons on Cybersecurity are taught by professors specializing in Computer\nScience, Information Security, and related disciplines, and are administered\nvia video lectures, interviews with experts, readings, quizzes, and more.‎\n\nChevron Right\n\n### How long does it take to get certified in cybersecurity?‎\n\nThe length of time you’ll need to prepare for a certification exam will depend\non what you already know and what you’ll need to learn. Preparing could take\nanywhere from a week to several months (assuming you meet the work\nprerequisites). Read our article about popular cybersecurity certifications to\nlearn more.‎\n\nChevron Right\n\n### What skills or experience do I need to already have before learning about\ncybersecurity?‎\n\nExcellent computer and internet skills are a must when you want to learn about\ncybersecurity. Any sort of job experience, internships, or high school or\ncollege classes involving information technology, like computer programming,\ndigital marketing, software development, and computer forensic analysis, can\nbe helpful too. You can also benefit from past experience or education on\ntopics like computer hardware, computer science, vulnerability assessment,\nsystem threats, information security, and statistics. A background in criminal\njustice or any kind of investigative work may even help when you study\ncybersecurity, as can experience in telecommunications, national security,\nfraud, financial security, and law enforcement. Knowledge of operating\nsystems, cloud networks, wireless networks, and mobile devices may also be\nnecessary.‎\n\nChevron Right\n\n### What kind of people are best suited for careers in cybersecurity?‎\n\nPeople who are curious, inquisitive, and like detective work are best suited\nfor roles in cybersecurity. You should also be a lifelong learner. New\nsecurity threats are popping up every day, and you'll need to continue your\neducation regularly to stay on top of them and find out how to combat them.\nPeople who work in cybersecurity need to be problem solvers; sometimes\nproblems in this field require creative solutions. Because you'll be\nmonitoring systems for threat, you'll need the ability to pay close attention\nto minor details. While cybersecurity can entail plenty of time spent working\nalone, you'll also need to be a good communicator. Whether you work for a\ncompany, a law enforcement agency, or a government agency, you'll need to\ninteract with other departments and keep them up to date on what's happening.‎\n\nChevron Right\n\n### How do I know if learning about cybersecurity is right for me?‎\n\nAnyone who wants a career that allows them to put their detective skills to\ngood use could benefit from learning cybersecurity. Learning about the topic\ncan also help open you up to other careers in information technology. If you\nalready work in the cybersecurity field, ongoing learning is a must to keep\nyour knowledge and skills up to date, so the more you study, the better you'll\nbe at your job. If you own a business or run your own website, learning\ncybersecurity may also be beneficial if you want to understand how to keep\nyour information safe.‎\n\nChevron Right\n\n### What are the benefits of taking an online Cybersecurity course?‎\n\nOnline Cybersecurity courses offer a convenient and flexible way to enhance\nyour knowledge or learn new Cybersecurity skills. Choose from a wide range of\nCybersecurity courses offered by top universities and industry leaders\ntailored to various skill levels.‎\n\nChevron Right\n\n### What Cybersecurity courses are best for training and upskilling employees\nor the workforce?‎\n\nWhen looking to enhance your workforce's skills in Cybersecurity, it's crucial\nto select a course that aligns with their current abilities and learning\nobjectives. Our Skills Dashboard is an invaluable tool for identifying skill\ngaps and choosing the most appropriate course for effective upskilling. For a\ncomprehensive understanding of how our courses can benefit your employees,\nexplore the enterprise solutions we offer. Discover more about our tailored\nprograms at Coursera for Business here.‎\n\nShow all 12 frequently asked questions\n\nThis FAQ content has been made available for informational purposes only.\nLearners are advised to conduct additional research to ensure that courses and\nother credentials pursued meet their personal, professional, and financial\ngoals.\n\nOther topics to explore\n\nArts and Humanities\n\n338 courses\n\nBusiness\n\n1095 courses\n\nComputer Science\n\n668 courses\n\nData Science\n\n425 courses\n\nInformation Technology\n\n145 courses\n\nHealth\n\n471 courses\n\nMath and Logic\n\n70 courses\n\nPersonal Development\n\n137 courses\n\nPhysical Science and Engineering\n\n413 courses\n\nSocial Sciences\n\n401 courses\n\nLanguage Learning\n\n150 courses\n\nCoursera Footer\n\nPopular AI Content\n\n  * Prompt Engineering for ChatGPT Course\n  * Machine Learning Specialization\n  * Data Science Professional Certificate\n  * AI For Everyone Course\n  * Generative AI with LLMs Course\n  * Supervised Machine Learning Course\n  * Deep Learning Specialization\n  * Introduction to Generative AI Course\n  * Applied AI Professional Certificate\n  * AI Product Management Specialization\n  * AI Engineering Professional Certificate\n  * All AI Courses\n\nPopular Programs\n\n  * Microsoft Cybersecurity Analyst Professional Certificate\n  * IBM Cybersecurity Analyst Professional Certificate\n  * Foundations of Cybersecurity Course\n  * Cybersecurity for Everyone Course\n  * Python for Cybersecurity Specialization\n  * Introduction Cybersecurity Cyber Attacks Course\n  * IT Fundamentals Cybersecurity Specialization\n  * Certified in Cybersecurity Specialization\n  * Blockchain Basics Course\n  * GRC Approach to Managing Cybersecurity Course\n  * Cybersecurity in Healthcare Course\n  * Penetration Testing, Incident Response & Forensics Course\n\nPopular Skills\n\n  * Blockchain Courses\n  * Ethical Hacking Courses\n  * Network Security Courses\n  * Information Security Courses\n  * Pen Testing Courses\n  * Cloud Security Courses\n  * Internet Security Courses\n  * Data Security Courses\n  * Cybersecurity Projects\n  * Beginner Cybersecurity Courses\n  * Cryptocurrency and Blockchain Courses\n  * Linux Courses\n\nPopular Career Resources\n\n  * Cybersecurity Career Paths\n  * Cybersecurity Jobs\n  * Cybersecurity Analyst Job Guide\n  * Is Cybersecurity Hard\n  * Information Security Analysts What They Do\n  * Cybersecurity Analyst Skills\n  * Cybersecurity Analyst Salary\n  * How To Get A Cybersecurity Internship\n  * Cybersecurity Degrees and Alternatives\n  * How To Get Into Cybersecurity\n  * Ethical Hacking Certifications\n  * What Is a Blockchain Developer\n\nCoursera\n\n  * About\n  * What We Offer\n  * Leadership\n  * Careers\n  * Catalog\n  * Coursera Plus\n  * Professional Certificates\n  * MasterTrack® Certificates\n  * Degrees\n  * For Enterprise\n  * For Government\n  * For Campus\n  * Become a Partner\n  * Coronavirus Response\n  * Social Impact\n  * Free Courses\n  * All Courses\n\nCommunity\n\n  * Learners\n  * Partners\n  * Beta Testers\n  * Translators\n  * Blog\n  * The Coursera Podcast\n  * Tech Blog\n  * Teaching Center\n\nMore\n\n  * Press\n  * Investors\n  * Terms\n  * Privacy\n  * Help\n  * Accessibility\n  * Contact\n  * Articles\n  * Directory\n  * Affiliates\n  * Modern Slavery Statement\n  * Do Not Sell/Share\n\nLearn Anywhere\n\n© 2024 Coursera Inc. All rights reserved.\n\n  *   *   *   *   *   * \n\n",
    "links": "[{\"link\": \"https://www.coursera.org/\", \"text\": \"\"}, {\"link\": \"https://www.coursera.org/degrees\", \"text\": \"\"}, {\"link\": \"https://www.coursera.org/mastertrack\", \"text\": \"\"}, {\"link\": \"https://www.coursera.org/certificates/learn\", \"text\": \"\"}, {\"link\": \"https://www.coursera.org/career-academy/?trk_ref=globalnav\", \"text\": \"Find your New Career\"}, {\"link\": \"https://www.coursera.org/browse\", \"text\": \"Browse\"}, {\"link\": \"https://www.coursera.org/courses\", \"text\": \"Top Courses\"}, {\"link\": \"https://www.coursera.org/courses?authMode=login&query=cybersecurity\", \"text\": \"Log In\"}, {\"link\": \"https://www.coursera.org/courses?authMode=signup&query=cybersecurity\", \"text\": \"Join for Free\"}, {\"link\": \"https://www.coursera.org/\", \"text\": \"\"}, {\"link\": \"https://www.coursera.org/professional-certificates/google-cybersecurity\", \"text\": \"Google Cybersecurity\"}, {\"link\": \"https://www.coursera.org/learn/foundations-of-cybersecurity\", \"text\": \"Foundations of Cybersecurity\"}, {\"link\": \"https://www.coursera.org/professional-certificates/ibm-cybersecurity-analyst\", \"text\": \"IBM Cybersecurity Analyst\"}, {\"link\": \"https://www.coursera.org/learn/cybersecurity-for-everyone\", \"text\": \"Cybersecurity for Everyone\"}, {\"link\": \"https://www.coursera.org/professional-certificates/microsoft-cybersecurity-analyst\", \"text\": \"Microsoft Cybersecurity Analyst\"}, {\"link\": \"https://www.coursera.org/learn/introduction-to-cybersecurity-fundamentals\", \"text\": \"Introduction to Cybersecurity Fundamentals\"}, {\"link\": \"https://www.coursera.org/professional-certificates/google-it-support\", \"text\": \"Google IT Support\"}, {\"link\": \"https://www.coursera.org/learn/introduction-cybersecurity-cyber-attacks\", \"text\": \"Introduction to Cybersecurity Tools & Cyber Attacks\"}, {\"link\": \"https://www.coursera.org/specializations/intro-cyber-security\", \"text\": \"Introduction to Cyber Security\"}, {\"link\": \"https://www.coursera.org/degrees/msc-cyber-security-london\", \"text\": \"Master of Science in Cyber Security\"}, {\"link\": \"https://www.coursera.org/specializations/it-fundamentals-cybersecurity\", \"text\": \"IT Fundamentals for Cybersecurity\"}, {\"link\": \"https://www.coursera.org/professional-certificates/ibm-isc2-cybersecurity-specialist\", \"text\": \"IBM and ISC2 Cybersecurity Specialist\"}, {\"link\": \"https://www.coursera.org/search?query=cybersecurity analyst\", \"text\": \"\"}, {\"link\": \"https://www.coursera.org/search?query=cybersecurity in healthcare (hospitals & care centres)\", \"text\": \"\"}, {\"link\": \"https://www.coursera.org/search?query=cybersecurity for everyone\", \"text\": \"\"}, {\"link\": \"https://www.coursera.org/search?query=cybersecurity free\", \"text\": \"\"}, {\"link\": \"https://www.coursera.org/search?query=cybersecurity and its ten domains\", \"text\": \"\"}, {\"link\": \"https://www.coursera.org/search?query=cybersecurity fundamentals\", \"text\": \"\"}, {\"link\": \"https://www.coursera.org/search?query=cybersecurity risk management framework\", \"text\": \"\"}, {\"link\": \"https://www.coursera.org/search?query=cybersecurity compliance framework & system administration\", \"text\": \"\"}, {\"link\": \"https://www.coursera.org/courses?query=cybersecurity\", \"text\": \"1\"}, {\"link\": \"https://www.coursera.org/courses?query=cybersecurity&page=2\", \"text\": \"2\"}, {\"link\": \"https://www.coursera.org/courses?query=cybersecurity&page=3\", \"text\": \"3\"}, {\"link\": \"https://www.coursera.org/courses?query=cybersecurity&page=4\", \"text\": \"4\"}, {\"link\": \"https://www.coursera.org/courses?query=cybersecurity&page=21\", \"text\": \"21\"}, {\"link\": \"https://www.coursera.org/courses?query=cybersecurity&page=2\", \"text\": \"\"}, {\"link\": \"https://www.coursera.org/professional-certificates/google-cybersecurity\", \"text\": \"Google Cybersecurity\"}, {\"link\": \"https://www.coursera.org/learn/foundations-of-cybersecurity\", \"text\": \"Foundations of Cybersecurity\"}, {\"link\": \"https://www.coursera.org/professional-certificates/ibm-cybersecurity-analyst\", \"text\": \"IBM Cybersecurity Analyst\"}, {\"link\": \"https://www.coursera.org/learn/cybersecurity-for-everyone\", \"text\": \"Cybersecurity for Everyone\"}, {\"link\": \"https://www.coursera.org/professional-certificates/microsoft-cybersecurity-analyst\", \"text\": \"Microsoft Cybersecurity Analyst\"}, {\"link\": \"https://www.coursera.org/learn/introduction-to-cybersecurity-fundamentals\", \"text\": \"Introduction to Cybersecurity Fundamentals\"}, {\"link\": \"https://www.coursera.org/professional-certificates/google-it-support\", \"text\": \"Google IT Support\"}, {\"link\": \"https://www.coursera.org/learn/introduction-cybersecurity-cyber-attacks\", \"text\": \"Introduction to Cybersecurity Tools & Cyber Attacks\"}, {\"link\": \"https://www.coursera.org/specializations/intro-cyber-security\", \"text\": \"Introduction to Cyber Security\"}, {\"link\": \"https://www.coursera.org/degrees/msc-cyber-security-london\", \"text\": \"Master of Science in Cyber Security\"}, {\"link\": \"https://www.coursera.org/courses?query=google\", \"text\": \"Google (25)\"}, {\"link\": \"https://www.coursera.org/courses?query=google%20cloud%20platform\", \"text\": \"Google Cloud Platform (17)\"}, {\"link\": \"https://www.coursera.org/courses?query=internet\", \"text\": \"Internet (17)\"}, {\"link\": \"https://www.coursera.org/courses?query=cryptography\", \"text\": \"Cryptography (16)\"}, {\"link\": \"https://www.coursera.org/courses?query=network%20security\", \"text\": \"Network Security (16)\"}, {\"link\": \"https://www.coursera.org/courses?query=linux\", \"text\": \"Linux (12)\"}, {\"link\": \"https://www.coursera.org/courses?query=software%20testing\", \"text\": \"Software Testing (12)\"}, {\"link\": \"https://www.coursera.org/courses?query=information%20security\", \"text\": \"Information Security (10)\"}, {\"link\": \"https://www.coursera.org/courses?query=api\", \"text\": \"Application Programming Interfaces (8)\"}, {\"link\": \"https://www.coursera.org/courses?query=kubernetes\", \"text\": \"Kubernetes (8)\"}, {\"link\": \"https://www.coursera.org/courses?query=web\", \"text\": \"Web (8)\"}, {\"link\": \"https://www.coursera.org/learn/cybersecurity-for-everyone\", \"text\": \"Cybersecurity for Everyone\"}, {\"link\": \"https://www.coursera.org/learn/introduction-to-cybersecurity-foundations\", \"text\": \"Introduction to Cyber Security Foundations\"}, {\"link\": \"https://www.coursera.org/learn/cybersecurity-in-healthcare\", \"text\": \"Cyber Security in Healthcare\"}, {\"link\": \"https://www.coursera.org/learn/ai-business-future-of-work\", \"text\": \"AI for the Future of Work\"}, {\"link\": \"https://www.coursera.org/learn/introduction-to-applied-cryptography\", \"text\": \"Introduction to Applied Cryptography\"}, {\"link\": \"https://www.coursera.org/learn/cybersecurity-for-everyone\", \"text\": \"Cybersecurity for Everyone\"}, {\"link\": \"https://www.coursera.org/learn/introduction-to-cybersecurity-foundations\", \"text\": \"Cybersecurity Foundations\"}, {\"link\": \"https://www.coursera.org/learn/introduction-cybersecurity-cyber-attacks\", \"text\": \"Introduction to Cybersecurity: Cyber Attacks\"}, {\"link\": \"https://www.coursera.org/learn/it-security\", \"text\": \"IT Security\"}, {\"link\": \"https://www.coursera.org/learn/ethical-hacking-essentials-ehe\", \"text\": \"Ethical Hacking Essentials\"}, {\"link\": \"https://www.coursera.org/learn/data-cybersecurity\", \"text\": \"Data & Cyber Security\"}, {\"link\": \"https://www.coursera.org/learn/palo-alto-networks-cloud-sec-fundamentals\", \"text\": \"Palo Alto Networks Cloud Security Fundamentals\"}, {\"link\": \"https://www.coursera.org/learn/cybersecurity-for-tech-professionals\", \"text\": \"Cybersecurity for Tech Professionals\"}, {\"link\": \"https://www.coursera.org/learn/iot-cyber-security\", \"text\": \"IoT Cyber Security\"}, {\"link\": \"https://www.coursera.org/learn/ibm-cybersecurity-analyst-assessment\", \"text\": \"IBM Cybersecurity Analyst Assessment\"}, {\"link\": \"https://www.coursera.org/business/products/skillsdashboard\", \"text\": \"Skills Dashboard\"}, {\"link\": \"https://www.coursera.org/business\", \"text\": \"Coursera for Business here\"}, {\"link\": \"https://www.coursera.org/browse/arts-and-humanities\", \"text\": \"\"}, {\"link\": \"https://www.coursera.org/browse/business\", \"text\": \"\"}, {\"link\": \"https://www.coursera.org/browse/computer-science\", \"text\": \"\"}, {\"link\": \"https://www.coursera.org/browse/data-science\", \"text\": \"\"}, {\"link\": \"https://www.coursera.org/browse/information-technology\", \"text\": \"\"}, {\"link\": \"https://www.coursera.org/browse/life-sciences\", \"text\": \"\"}, {\"link\": \"https://www.coursera.org/browse/math-and-logic\", \"text\": \"\"}, {\"link\": \"https://www.coursera.org/browse/personal-development\", \"text\": \"\"}, {\"link\": \"https://www.coursera.org/browse/physical-science-and-engineering\", \"text\": \"\"}, {\"link\": \"https://www.coursera.org/browse/social-sciences\", \"text\": \"\"}, {\"link\": \"https://www.coursera.org/browse/language-learning\", \"text\": \"\"}, {\"link\": \"https://www.coursera.org/courses?query=cybersecurity&productTypeDescription=Guided%20Projects\", \"text\": \"Cybersecurity Projects\"}, {\"link\": \"https://www.coursera.org/courses?query=cybersecurity&productDifficultyLevel=Beginner\", \"text\": \"Beginner Cybersecurity Courses\"}, {\"link\": \"https://www.coursera.org/browse\", \"text\": \"Catalog\"}, {\"link\": \"https://www.coursera.org/courseraplus\", \"text\": \"Coursera Plus\"}, {\"link\": \"https://www.coursera.org/professional-certificate\", \"text\": \"Professional Certificates\"}, {\"link\": \"https://www.coursera.org/mastertrack\", \"text\": \"MasterTrack® Certificates\"}, {\"link\": \"https://www.coursera.org/degrees\", \"text\": \"Degrees\"}, {\"link\": \"https://www.coursera.org/business?utm_campaign=website&utm_content=corp-to-home-footer-for-enterprise&utm_medium=coursera&utm_source=enterprise\", \"text\": \"For Enterprise\"}, {\"link\": \"https://www.coursera.org/government?utm_campaign=website&utm_content=corp-to-home-footer-for-government&utm_medium=coursera&utm_source=enterprise\", \"text\": \"For Government\"}, {\"link\": \"https://www.coursera.org/campus?utm_campaign=website&utm_content=corp-to-home-footer-for-campus&utm_medium=coursera&utm_source=enterprise\", \"text\": \"For Campus\"}, {\"link\": \"https://www.coursera.org/social-impact\", \"text\": \"Social Impact\"}, {\"link\": \"https://www.coursera.org/teaching-center\", \"text\": \"Teaching Center\"}, {\"link\": \"https://www.coursera.org/about/press\", \"text\": \"Press\"}, {\"link\": \"https://www.coursera.org/about/terms\", \"text\": \"Terms\"}, {\"link\": \"https://www.coursera.org/about/privacy\", \"text\": \"Privacy\"}, {\"link\": \"https://www.coursera.org/about/contact\", \"text\": \"Contact\"}, {\"link\": \"https://www.coursera.org/directory\", \"text\": \"Directory\"}, {\"link\": \"https://www.coursera.org/about/cookies-manage\", \"text\": \"Do Not Sell/Share\"}]"
}