{
    "summary": "Skip to content\n\nFREE CASE EVALUATION 855-752-0140\n\n  * Practice Areas\n    * Personal Injury\n    * Car Accidents\n      * Houston Car Accident Lawyer\n      * Katy Car Accident Lawyer\n      * New Orleans Car Accident Lawyer\n      * Baton Rouge Car Accident Lawyer\n      * Lafayette Car Accident Lawyer\n    * Truck Accidents\n    * Motorcycle Accidents\n    * Bicycle Accidents\n    * Drunk Driving Accidents\n    * Construction Worker Accidents\n    * Pedestrian Accidents\n    * Slip and Fall Accidents\n    * Wrongful Death\n  * Locations\n  * About\n    * Our Team\n    * Testimonials\n    * Blog\n    * In The Media\n  * Espanol\n  * Contact\n  * Search\n\n855-752-0140\n\n# Houston Insurance Company Claims Lawyer\n\nHouston Personal Injury Lawyer   >   Houston Insurance Company Claims Lawyer\n\nThe process of filing an accident claim is difficult and complex. You’re\nalready under a ton of stress, dealing with injuries, bills, damaged property,\nor all three. Predatory insurance companies will try to take advantage of you\nwhen you’re most vulnerable. When it comes to dealing with insurance companies\nafter an accident, denied claims, pending payments, or unfair settlements seem\nto come with territory. But they don’t have to! The good news is that by\nhiring the right **Houston insurance claims law firm** , you send an immediate\nmessage that you’re ready to fight for your rights. These companies know that\nStewart J. Guss and his team of legal professionals do **not** back down!\nCall us now for your FREE consultation at 866-501-2189, or you may contact us\nnow by CLICKING HERE to submit your case for review. There is absolutely no\ncost to get a free consultation right now. Should you choose to hire us,\nyou’ll pay nothing upfront and nothing at all unless we win your case! Plus,\nif you are uninsured or cannot afford health insurance deductibles or co-pays,\nwe may be able to help you obtain the medical treatment you need – _at no\nupfront out of pocket cost to you._ Your goals are our goals: a fair\nsettlement and a smooth recovery. Stand up and fight back against insurance\ncompanies. Contact a Houston personal injury lawyer today.  Since establishing\nour headquarters in Houston, Texas in 1999, our firm has grown to numerous\nlocations across the country, including hubs in Dallas, New Orleans, Los\nAngeles, and Atlanta. Along the way, we've built a trusted network of partners\nthroughout all 50 states who share our values and our commitment to\nexcellence. **No matter where you are, it's our mission to insure that you\nhave the finest representation for your case.** Reach out now to learn more\nabout how our personal injury lawyers can help.\n\n## **Types of Insurance Claims We Handle**\n\nDid you know that when you pursue an accident claim, you are not suing the\nindividual who hit you? Instead, you are holding their insurance company\naccountable. (That's the whole point of insurance!) Lawyers who sue insurance\ncompanies know the ins and outs of these cases - as well as the tricks used by\neach individual insurance company. They can help you reach a fair settlement\nand get your life back on track after an accident. When a valid claim is\npresented, you expect an insurance company to uphold its promises and put a\nprompt payment in your pocket. But don’t get your hopes up. Despite their\nconstant promises to be a “good neighbor” or that “you are in good hands,”\nplenty of insurance companies are difficult and stubborn. They may refuse to\npay a legitimate claim. One thing to keep in mind: insurers are corporations.\nJust like Walmart, Ford, or other major corporations, insurance companies are\nout to make money for **_themselves_** , not to protect you or other\npolicyholders. Often, this selfish approach leads to complications, delays,\nand denials of your claim. This is true no matter what types of insurance\npolicies you’re dealing with. Policyholders can be individuals, small\nbusinesses, or large corporations. As anyone involved in an insurance dispute\nknows, it’s hard to get paid what you deserve. The insurance process is often\na roller coaster of empty promises, complications, and attempts at\nmanipulation by adjusters. Even for an experienced insurance claims law firm,\nit often takes many rounds of negotiations before the insurer will make a fair\noffer. Without the right law firm, the process can seem hopeless. Fortunately,\nassistance with your insurance claim is right under your nose! Stewart Guss\nand his team of attorneys regularly assist clients with different types of\ninsurance claims. With over 20 years of experience, we’ve seen it all. Call us\nright now for a FREE consultation at 866-501-2189, or CLICK HERE to send us a\nquestion or get more information about your potential case. Below are some of\nthe insurance claims our law firm typically handles.\n\n## **Car Accident Claims**\n\nIn Texas, Insurance claims from traffic accidents are some of the most common.\nConsider the following statistics for Texas and Harris County, reported by the\nTexas Department of Transportation (TxDOT):\n\n  * 265,431 people suffered injuries in Texas crashes in just one year\n  * 17,602 people suffered serious injuries across the state\n  * Texas saw 3,794 traffic-related fatalities\n  * Harris County had 112,888 crashes reported\n  * Those crashes caused 33,140 “possible injuries,” 12,028 non-incapacitating injuries, 2,268 “suspected serious” injuries, and 447 fatalities\n\nThat’s more than one death on the road per day, in just **one** county. When\nyou think about how many people who suffer injuries in car accidents in the\nHouston area, it’s no surprise how many car accident insurance claims are\nfiled. Some specific types of claims include: **Claims against other\ndrivers:** Many car accidents involving two vehicles happen because one driver\nwas negligent in some way. Our law firm can identify when another driver\nshould be liable for your injuries and losses. Furthermore, we can help\nrelieve some of your stress by handling the filing of a claim with that\ndriver’s auto insurance policy. Auto insurance companies won’t simply accept\nyour side of the story and pay. Instead, your car accident attorney will have\nto work to prove liability on the part of the other driver. The insurer will\noften try to limit liability by claiming you were at least partially at fault\nfor the crash. We know how to combat these allegations and seek the full\namount you deserve from the negligent driver’s insurance company. **Uninsured\nmotorist claims:** Not every driver carries the minimum insurance that Texas\nlaw requires. In this case, a driver may decide to leave the scene of the\naccident to avoid responsibility, leaving you as the victim of a hit and run\nwithout any insurance information. If you find yourself in this unfortunate\nsituation, you can still file a claim with your own uninsured motorist policy.\nMany people think that because they pay their premiums on time, their own\ninsurance company will be more cooperative. However, **any** insurance company\ncan be difficult, whether it is yours or another driver’s. This can be\nparticularly frustrating, but our firm regularly helps clients with uninsured\nmotorist claims navigate their personal auto insurance policies and come out\non top. **Rideshare accidents: **Many people use rideshare companies like Uber\nand Lyft to get around the Houston area. While these services are convenient,\nrideshare drivers can get in accidents just like any other driver. Whether you\nare an Uber or Lyft passenger or in another vehicle hit by a rideshare driver,\nyou may need to file an insurance claim to recover for your losses. Rideshare\ndrivers should have their own personal auto insurance policies. However, if a\ndriver has inadequate insurance or the policy refuses to cover a specific\naccident, **Uber and Lyft each have $1 million insurance policies** covering\ndrivers who are actively engaged in a ride, i.e. picking up a passenger or\ntransporting a passenger for their app. These accidents may require a claim\nwith the corporation’s insurance, or even multiple insurance claims. A skilled\ninsurance claims lawyer will know how to handle these complicated claims and\nseek compensation for Uber and Lyft accident victims.\n\n## **Truck Accident Claims**\n\nAccidents involving commercial trucks can be particularly dangerous and may\nresult in severe injuries. Multiple parties may also be held liable: even if a\ntruck driver caused a crash, the driver’s employer may be strictly liable for\nthe negligence of its employee. This means you might file claims with the\ndriver’s individual auto policy _as well as_ the trucking company’s corporate\npolicy. Sound difficult? It is. Trucking companies have insurance companies\nand lawyers ready to fight against liability at all costs. They have their own\ninvestigators who will try to prove that _you_ were responsible for the\naccident in order to avoid paying you. This is why you need the expertise of a\nseasoned attorney on your side, every step of the way.\n\n## **Premises Liability Claims**\n\nNot all accidents happen on the road. You can suffer serious injuries while\ngrocery shopping, browsing at the mall, or visiting another large store,\nrestaurant, hotel, or establishment. When these businesses do not address\nhazards on their premises, visitors and customers can get hurt, and the\ncompany should cover the costs of their injuries. Whether you suffered a slip\nand fall accident, a fall down the stairs, a swimming pool accident, or any\nother incident on a company’s premises, there could be an insurance battle in\nyour future. You may think that a company and its insurer will own up to its\nwrongdoing and want to make the situation right. This is usually not the case.\nTake, for example, how Walmart handles slip and fall claims. The company has\nits very own insurance company, Claims Management, Inc., devoted to handling\n**only** claims against Walmart. The company’s entire goal is to **limit**\nWalmart’s liability for accidents that happen in-store. If they go through the\neffort of forming their own company for this purpose, you can imagine what\ntype of fight they will put up during your claims process! Premises liability\nclaims against companies are no easier than traffic accident claims.\nRegardless of what type of insurance claim is in your future, expect the\nunexpected. To ensure the best outcome possible and to limit your stress, call\nour Houston insurance claim law firm for help **before** you file your claim.\n\n## **Obstacles You Might Face During the Insurance Process**\n\nEven when you are well-prepared, the insurance process is rarely\nstraightforward. Instead, there are hiccups and obstacles at every turn. Many\ninsurance companies do this on purpose to frustrate claimants and drive them\nto accept a low settlement just to “get it over with.” After all, when you’re\nhealing from an injury, the last thing you want is to constantly grapple with\ninsurance adjusters! The following are some possible obstacles you may face\nafter filing an insurance claim:\n\n  * **The insurance adjuster wants you to give a recorded statement about what happened and your condition.** You should _never_ do this. Be aware that insurance adjusters do not have the right to a recorded statement from you unless litigation is already in process. Insurance companies will stoop to taking your statements out of context to use against you and limit your claim. It is always better to have a lawyer handle all communications for you.\n  * **The adjuster claims you are responsible for your accident.** Many insurance adjusters will use any information possible (see above) to insinuate that you were also at fault for your own injuries. In many cases, people don’t know how to fight these assertions or how to proceed. Our legal team regularly fights allegations of negligence regarding our clients. Additionally, under Texas law, even if you were 49% responsible for an accident, you still have the right to receive at least some compensation from the party that was 51% responsible.\n  * **The adjuster questions the value of your claim.** Often, insurance adjusters will approve certain damages you claimed but will refuse to pay others. They may justify a reduction in your claim by stating your injuries didn’t all result from the accident, that you didn’t need to miss as much work as you did, or that you didn’t need all the medical treatment you received. Our legal team is skilled at proving the severity and effects of all of your accident-related injuries in order to maximize your settlement.\n  * **The adjuster makes a lowball offer.** Almost every insurance company will start with a ridiculously low offer on the off-chance that you actually accept it. Always have your lawyer review a settlement offer before you accept _anything_.\n\nFacing obstacles like these in the insurance process is _much_ easier with the\nright legal team on your side. Our experienced lawyers and legal professionals\ncan help in many ways, guiding you through every step of your insurance claim.\n\n## **Why Choose Our Team?**\n\nInsurance companies will try every trick in the book to avoid making payouts.\nSo who do you turn to for help? It’s important to remember that not all law\nfirms have the same experience and values when it comes to handling insurance\nclaims. Some law firms will push clients to accept any offer so they can\nresolve a greater number of cases in a shorter period of time. These so-called\n“settlement mills” don’t always focus on what’s best for the client. Instead,\nthey want to get clients in and out the door as fast as possible… which rarely\nresults in a fair settlement. Attorney Stewart Guss and his legal team put our\nclients’ interests first. With decades of combined experience taking on\ninsurance companies and beating them at their own game, we’re ready to help\nyou. Let us take the stress out of this for you, and get you the full payment\nyou deserve. Let our next victory be yours! Remember, you don’t pay us\nanything unless we win your case! Initial consultations are free, and we are\navailable to answer your questions 24 hours a day, 7 days a week, at\n866-501-2189, or CLICK HERE to submit your claim and get an immediate response\nand evaluation.\n\n## **Choose a Houston Insurance Claims Law Firm With Strength, Integrity, and\nExperience**\n\nIt is easy to feel helpless when you’re up against an insurance company, but\nremember the law is on your side. Insurance companies don’t want you to know\nthat the law entitles you to compensation from liable parties. They will try\nanything to get you to back down. An experienced insurance law firm can stand\nup to giant insurance companies and ensure you and your claim are taken\nseriously. As an attorney who has practiced insurance law for many years,\nStewart Guss and his team are not afraid to go head to head with any insurance\ncompany around. Our law firm will fight for our clients’ rights and do\neverything in our power to see that insurance companies pay you what you are\nrightfully owed. You’ve always paid your premiums, so now it’s time to make\nsure they pay your claim! We’re equipped with knowledge from years of\nexperience dealing with all of the major insurance companies in Texas and\nthroughout the United States. We’re a choice you can feel good about. If you\nbelieve that your insurance company is not handling your claim fairly for\nwhatever reason, call the law office of Attorney Stewart Guss and discuss your\nsituation. Never sign anything from your insurer until you speak with us, or\nelse you risk losing some or all of the compensation that is due to you.\nProtect your rights and know your options.\n\n## **Contact Our Aggressive and Trusted Houston Insurance Claim Law Firm RIGHT\nAWAY!**\n\nStewart Guss and his team will do everything they can to obtain the best\npossible recovery on your claim, and we take pride in treating our clients\nlike family. Because we take all of our personal injury cases on a contingency\nfee basis, you will not owe us anything unless we win your case. We are\navailable 24 hours a day, seven days a week for a FREE consultation, so call\nus today at 866-501-2189 or contact us now by CLICKING HERE. The legal team,\nis nationally recognized for protecting the rights of injured victims for more\nthan 20 years. If you were injured in an accident and the insurance company is\nfighting against you in your search for justice, call our office right now to\nschedule a free consultation!\n\n### **Don’t take chances. One accident can change your life, but so can one\nvictory with us. Get help now.**\n\n**See what past clients have to say:**\n\nReview: 5/5 ★ ★ ★ ★ ★\n\n\"Stewart Guss Legal Services. Stewart Guss was very efficient in the handling\nof my case. He explained my rights thoroughly and kept me informed of all\nnegotiations. I would recommend his services to anyone needing assistance with\ntheir injury claim.\" **-Janet T.**\n\nSee more client testimonials here\n\n### How Can We Help?\n\nGet A FREE Virtual Consultation\n\nFirst Name*\n\nLast Name*\n\nEmail*\n\nPhone*\n\nMessage*\n\nTerms & Conditions*\n\nBy checking this box, I verify that this is my mobile number and consent to\nreceive text messages via automated technology to this number on behalf of\nStewart J Guss & Associates, PLLC. I also agree to the Terms and Conditions\nand the Privacy Policy. Message and Data rates may apply. Text STOP to\nunsubscribe.\n\nComments\n\nThis field is for validation purposes and should be left unchanged.\n\nSEND MESSAGE\n\nΔ\n\n## Testimonials\n\n__________\n\n\"We received QUALITY service, reliable guidance and we are VERY satisfied with\nthe outcome. Our treatment was both fair &…\"\n\n**Jeri B.**\n\n__________\n\n\"He IS an outstanding lawyer! I was nervous about seeking legal help due to\nall the bad jokes made at…\"\n\n**Patricia M.**\n\n__________\n\n\"Working with Mr. Guss was my first experience hiring an attorney on my own,\nbut I could not have been…\"\n\n**Chelsea O.**\n\nGet A FREE Virtual Consultation\n\nFull Name*\n\nEmail*\n\nPhone*\n\nMessage*\n\nTerms & Conditions*\n\nBy checking this box, I verify that this is my mobile number and consent to\nreceive text messages via automated technology to this number on behalf of\nStewart J Guss & Associates, PLLC. I also agree to the Terms and Conditions\nand the Privacy Policy. Message and Data rates may apply. Text STOP to\nunsubscribe.\n\nComments\n\nThis field is for validation purposes and should be left unchanged.\n\nSEND MESSAGE\n\nΔ\n\n## Here’s What Our Clients Say\n\n__________\n\n\"We received QUALITY service, reliable guidance and we are VERY satisfied with\nthe outcome. Our treatment was both fair &…\"\n\n**Jeri B.**\n\n__________\n\n\"He IS an outstanding lawyer! I was nervous about seeking legal help due to\nall the bad jokes made at…\"\n\n**Patricia M.**\n\n__________\n\n\"Working with Mr. Guss was my first experience hiring an attorney on my own,\nbut I could not have been…\"\n\n**Chelsea O.**\n\n## Get Legal Help Now!\n\nContact our attorneys to learn how we can help you achieve the justice you\ndeserve\n\nFirst Name*\n\nLast Name*\n\nEmail*\n\nPhone*\n\nMessage*\n\nTerms & Conditions*\n\nBy checking this box, I verify that this is my mobile number and consent to\nreceive text messages via automated technology to this number on behalf of\nStewart J Guss & Associates, PLLC. I also agree to the Terms and Conditions\nand the Privacy Policy. Message and Data rates may apply. Text STOP to\nunsubscribe.\n\nComments\n\nThis field is for validation purposes and should be left unchanged.\n\nSEND CASE DETAILS\n\nΔ\n\n###### Houston Principal Office\n\n(855) 752-0140  \n12777 Jones Rd # 297,  \nHouston, TX 77070\n\n###### Downtown Houston Office\n\n(713) 333-3940  \n808 Travis St #1507,  \nHouston, TX 77002\n\n###### Houston North Loop Office\n\n(713) 333-3950  \n1415 N Loop W #660B,  \nHouston, TX 77008\n\n###### Katy Office\n\n(281) 990-4415  \n6701 Hwy Blvd Suite 205,  \nKaty, TX 77494\n\n###### New Orleans Office\n\n(504) 608-1038  \n400 Poydras Tower Suite 1975,  \nNew Orleans, LA 70130\n\n###### Dallas Office\n\n(214) 903-0992  \n1910 Pacific Ave Suite 6000,  \nDallas, TX 75201\n\n###### Chicago Office\n\n(312) 757-8825  \n8 Michigan Ave #2210,  \nChicago , IL 60603\n\n###### Los Angeles Office\n\n(213) 908-1827  \n3600 Wilshire Blvd Ste 1136,  \nLos Angeles, CA 90010\n\n###### Atlanta Office\n\n(470) 568-2670  \n245 Peachtree Center Ave NE Suite 2445,  \nAtlanta, GA 30303\n\n###### San Antonio Office\n\n(210) 791-9988  \nOne Alamo Center 106 S St Mary's St ,  \nSan Antonio, TX 78205\n\n  * Practice Areas\n  * Locations\n  * Hear From People We’ve Helped\n  * About\n  * Resources\n  * Contact\n\n© Stewart J. Guss, Injury Accident Lawyers | Houston Personal Injury Lawyer  \nTerms and Conditions | Privacy Policy | Sitemap |\n\n__\n\n__\n\n__\n\nSearch\n\n__\n\n",
    "links": "[{\"link\": \"https://attorneyguss.com/\", \"text\": \"\"}, {\"link\": \"https://attorneyguss.com/areas-served/\", \"text\": \"Locations\"}, {\"link\": \"https://attorneyguss.com/about-us/\", \"text\": \"About\"}, {\"link\": \"https://attorneyguss.com/our-team/\", \"text\": \"Our Team\"}, {\"link\": \"https://attorneyguss.com/testimonials/\", \"text\": \"Testimonials\"}, {\"link\": \"https://attorneyguss.com/news-opinion/\", \"text\": \"Blog\"}, {\"link\": \"https://attorneyguss.com/about-us/in-the-media/\", \"text\": \"In The Media\"}, {\"link\": \"https://attorneyguss.com/contact-us/\", \"text\": \"Contact\"}, {\"link\": \"https://attorneyguss.com/\", \"text\": \"Downtown Houston Office\"}, {\"link\": \"https://attorneyguss.com/\", \"text\": \"Houston North Loop Office\"}, {\"link\": \"https://attorneyguss.com/disclaimer/\", \"text\": \"Terms and Conditions\"}, {\"link\": \"https://attorneyguss.com/privacy-policy/\", \"text\": \"Privacy Policy\"}, {\"link\": \"https://attorneyguss.com/user-sitemap/\", \"text\": \"Sitemap\"}]"
}