{
    "summary": "Contact Us Today (713) 659-0936\n\nContact Us Today\n\n(713) 659-0936\n\n  * About Us\n    * Personal Injury Lawyers in Houston\n    * Houston Legal Team\n    * Case Results\n    * Testimonials\n    * Houston Personal Injury Resources\n    * Attorney Referrals\n    * Community Involvement in Houston, TX\n  * Personal Injury\n    * Brain Injuries\n    * Medical Malpractice\n    * Personal Injury\n    * Product Liability\n    * Slip and Fall Accidents\n    * Workplace Injury\n    * Wrongful Death\n    * View All +\n  * Vehicle Accidents\n    * Car Accident Lawyer\n    * Motorcycle Accident Lawyer\n    * Truck Accident Lawyer\n  * Blog\n  * Español\n  * Contact Us\n  * Locations\n    * Houston\n  * Find Us\n    * Houston (Main Office)\n    * Houston East Freeway\n    * Houston (South Loop)\n  * Call Us\n\nHouston Insurance Bad Faith Attorney\n\nfree consultation\n\nHome / Insurance Bad Faith\n\n# Houston Insurance Bad Faith Attorney\n\nIf you suspect your insurance company is acting in bad faith, it may be time\nto file a lawsuit against them to seek the money you are owed. Attorney Brian\nWhite Personal Injury Lawyers, has more than 45 years of combined experience\nfighting insurance companies and their unfair tactics.\n\nContact our law firm for a free consultation, give us a call at (713) 659-0936\nto speak with a Houston insurance bad faith attorney who can help you.\n\nTable of Contents\n\nToggle\n\n  * How Attorney Brian White Personal Injury Lawyers Can Help with a Bad Faith Insurance Company\n  * What Are the Duties and Responsibilities of Insurance Companies in Houston, Texas?\n  * When Can an Insurance Company Rightfully Deny a Claim?\n  * What Is Insurance Bad Faith in Texas?\n  * How Can I Tell if My Insurance Company Is Acting in Bad Faith?\n  * What Damages Are Available in an Insurance Bad Faith Claim in Houston, TX?\n  * How Can I Prove Insurance Bad Faith in Houston, TX?\n  * Contact a Houston Insurance Bad Faith Attorney for a Free Consultation\n\n## How Attorney Brian White Personal Injury Lawyers Can Help with a Bad Faith\nInsurance Company\n\nDo you suspect your insurance company is acting in bad faith when processing\nyour claim? When you are not being treated fairly by an insurer, it can feel\nlike you have little recourse.\n\nAfter all, insurance law and policy language are complex and it can be\nchallenging to get an insurance company and its team of attorneys to take you\nseriously.\n\nAttorney Brian White Personal Injury Lawyers will act on your behalf to hold\nyour insurer accountable under Texas law. Founding attorney Brian White\nmaintains a 10.0 Superb AVVO rating and is a member of the Multi-Million\nDollar Advocates Forum.\n\nOur Houston, Texas law firm has 45 years of combined legal experience fighting\nagainst major insurance companies and protecting the rights of our clients.\n\nTrust a Houston personal injury lawyer at our firm to:\n\n  * Help you explore your legal options and offer legal advice\n  * Gather evidence that proves the validity and value of your claim\n  * Investigate the insurance company’s practices to determine how bad faith occurred\n  * Handle all communications with your insurer to stop bad faith actions\n  * Take your case to the courtroom and seek damages for bad faith if a fair settlement is not reached \n\nYou do not need to accept illegal and unfair insurance practices. Call\nAttorney Brian White Personal Injury Lawyers today for a free case review with\nan experienced bad faith insurance lawyer for help.\n\n## What Are the Duties and Responsibilities of Insurance Companies in Houston,\nTexas?\n\nYou count on your insurance company to be there for you when you finally need\nto make a claim. Sadly, for-profit insurance companies sometimes act in bad\nfaith and deny valid claims, make processing a claim difficult, or\nintentionally undervaluing a claim.\n\nInsurance companies in Texas have many legally mandated duties under the Texas\nInsurance Code. Chapter 541 of the code is called the Unfair Methods of\nCompetition and Unfair or Deceptive Acts or Practices Act.\n\nChapter 541.060 requires insurers to do the following when they process a\nclaim:\n\n  * Process the claim in a timely manner without unnecessary or unreasonable delays\n  * Provide accurate information regarding insurance coverage and terms\n  * Provide valid, reasonable reasons for any claim denial\n  * Attempt to settle valid claims fairly\n  * Release settlement funds without unnecessary requests for additional information \n\nChapter 541 of the Insurance Code bans bad faith practices by Texas insurers.\nTexas Insurance Code Chapter 542 is called the Unfair Claim Settlement\nPractices Act. It addresses a separate type of behavior that may also result\nin a claim against an insurance company.\n\nThese two chapters overlap somewhat, but Chapter 542 mostly addresses prompt\nclaim payment and the timing of payment and communications.\n\nUnder Chapter 542, Texas insurers are given clear deadlines to investigate and\nsettle all claims:\n\n  * Insurance companies have 15 days after receiving written notice to acknowledge a claim, begin an investigation, and request additional information.\n  * Insurance companies have 15 days after receiving any requested information to make a claim determination. This may be extended to up to 45 days in certain cases.\n  * Insurance companies must pay accepted claims within 5 business days. If the claim is denied, valid reasons should be provided.\n  * An insurance claim determination must be made within 60 days in most cases. \n\nIf an insurance company violates these deadlines, they may be liable for\npaying the policyholder’s attorney’s fees and damages with an 18% annual\npenalty.\n\nWhen the insurance company fails in their duties, they are acting in bad\nfaith. They may be held liable for this behavior through a bad faith insurance\nlawsuit.\n\n## When Can an Insurance Company Rightfully Deny a Claim?\n\nInsurance companies, of course, are not obligated to pay all claims made by\npolicyholders and third parties.\n\nThe most common legal reasons for a denied insurance claim include:\n\n  * The damage or incident is not covered by the policy\n  * State law was violated\n  * The claim involves an error\n  * A reporting or filing deadline was missed\n  * A procedure or other remedy is not medically necessary, experimental, or investigational \n\nIf your claim is denied, you have the right to appeal. Sometimes claims are\ndenied because the insurance company does not have enough information and\nfurther documentation must be submitted. It’s also possible a valid claim that\nshould be covered is denied due to bad faith.\n\n## What Is Insurance Bad Faith in Texas?\n\nInsurance bad faith happens when an insurance company violates its legal\nduties to its policyholders. Bad faith can refer to any type of behavior that\nis unfair, unreasonable, or deceptive.\n\nCommon examples of insurance bad faith are:\n\n  * Misrepresenting the terms of the policy\n  * Delaying claims adjustment\n  * Delaying payment of the claim\n  * Intentionally undervaluing the claim\n  * Pressuring the policyholder to not seek legal representation\n  * Changing the terms of the policy once a claim has been made\n  * Ignoring certain parts of the claim during an investigation or adjustment\n  * Failing to provide valid reasons for a claim denial\n  * Using biased third parties during the claims process and investigation\n  * Performing a sub-par investigation\n  * Alleging fraud on the part of the policyholder without any reasonable suspicion\n  * Requesting unneeded information or documentation to delay the claim \n\nBad faith insurance claims can be based on first-party or third-party claims.\nA first-party claim happens if your insurance company acts in bad faith when\nyou file a claim against your policy.\n\nA third-party claim involves liability coverage when your insurance company\nunfairly fails to indemnify, defend, or settle a claim against you.\n\n## How Can I Tell if My Insurance Company Is Acting in Bad Faith?\n\nBad faith can occur with any type of insurance claim including:\n\n  * Auto insurance claims for property damage and injuries after a car accident\n  * Homeowner’s insurance claims for property damage, theft, or liability\n  * Personal Injury Protection (PIP) claims\n  * Boat insurance claims\n  * Life insurance claims\n  * Health insurance claims \n\nIt can be difficult to recognize when your insurer acts in bad faith. Policy\nlanguage is intentionally complex, and you may not be sure if their behavior\nis normal or acceptable.\n\nYour insurance company may be violating Texas insurance laws if you believe\nany of the following has happened:\n\n  * The insurance company has tried to conceal important information such as policy information.\n  * Your claim has been denied without a valid reason.\n  * The insurance company did not acknowledge receipt of your claim.\n  * You have been pressured to accept a settlement or told you must accept the offer quickly\n  * The insurance company avoids easy communication by changing your point of contact or failing to respond to communication \n\nYou may have little more than suspicion when an insurance company acts in bad\nfaith. If you suspect your claim is not being processed fairly in good faith,\ndocument all correspondence with the insurance company. Contact an experienced\nbad faith insurance attorney to investigate your case, assess if any laws are\nbeing violated, and force the insurance company to act fairly.\n\n## What Damages Are Available in an Insurance Bad Faith Claim in Houston, TX?\n\nHouston bad faith insurance lawsuits generally allow you to recover the\nfollowing damages:\n\n  * The actual damages or value of your denied claim\n  * Reasonable attorney’s fees and court costs\n  * Relief the court considers proper \n\nYou can also recover three times your actual damages if the insurance company\nknowingly violated Chapter 541. This is called treble damages. Under Chapter\n542, you may also be entitled to interest on the outstanding payment amount.\n\nInsurance litigation is complex but may entitle you to not only the value of\nyour claim but additional compensation from your insurer. Our Houston bad\nfaith insurance lawyers can help you understand what your insurance bad faith\nclaim may be worth.\n\n## How Can I Prove Insurance Bad Faith in Houston, TX?\n\nA bad faith claim in Texas can be proved using one of two methods:\n\n  * Showing the insurer denied a claim despite reasonably clear liability, or\n  * Showing the insurance company did something prohibited by Chapter 541 or Chapter 542. This can include the types of behavior listed above or missing deadlines under Chapter 542.\n\nThe first option is known as a common law bad faith claim. This type of claim\ncannot be made by a third-party, only the policyholder. The second option,\ncalled a statutory bad faith claim, is generally the better option for holding\nan insurance company accountable for bad faith.\n\nProving bad faith requires showing the insurer didn’t simply make a mistake.\nInstead, they engaged in intentional wrongdoing or gross negligence that\ncaused you harm.\n\nSometimes bad faith is clear and fairly easy to prove such as changing policy\nterms or misrepresenting policy facts. Sometimes it is not clear, particularly\nwhen it comes to how your claim is valued.\n\nSimply undervaluing a claim is not always bad faith. To show the insurer was\nnot acting fairly, we will compare the insurance company’s reports and\ninvestigations to your claim and demonstrate that their value was not\nreasonable given the facts.\n\n## Contact a Houston Insurance Bad Faith Attorney for a Free Consultation\n\nYou pay your policy premiums faithfully and trust that your insurance policy\nwill protect you when you need to make a claim. When you are left with serious\ninjuries or property damage and your claim is unfairly denied or undervalued,\nthe insurance company should be held accountable for their bad faith\npractices.\n\nAttorney Brian White Personal Injury Lawyers is here to fight the insurance\ncompany on your behalf and help you recover the compensation you deserve. Call\nour law office today for a free consultation with a Houston insurance bad\nfaith attorney who can help.\n\nCall Us Today. It's Just That Easy\n\nToll Free\n\n(713) 659-0936\n\nSearch Our Site\n\nPractice Areas\n\n  * Houston Bicycle Accident\n  * Houston Brain Injuries\n  * Houston Car Accidents\n  * Houston Construction Accidents\n  * Houston Motorcycle Accidents\n  * Houston Pedestrian Accidents\n  * Houston Slip and Fall Accidents\n  * Houston Truck Accidents\n  * Houston Uber Accidents\n  * Houston Workplace Injuries\n  * Houston Wrongful Death\n  * See All +\n\nOur Offices\n\nHouston\n\nAttorney Brian White Personal Injury Lawyers  \n3120 Southwest Freeway,  \nSuite 350  \nHouston, Texas 77098  \n  \nHours: Open 24 hrs daily  \nHouston, TX Law Office Map  \nDirections\n\nCall: (713) 364-1466\n\nHouston Office East Freeway\n\nAttorney Brian White Personal Injury Lawyers - East Fwy  \n11811 East Freeway,  \nSuite 630-06  \nHouston, Texas 77029  \n  \nHours: Open 24 hrs daily  \nHouston East Freeway Law Office Map\n\nCall: (713) 804-7078\n\nHouston Office South Loop\n\nAttorney Brian White Personal Injury Lawyers - South Loop  \n2600 South Loop West,  \nSuite 293  \nHouston, Texas 77054  \n  \nHours: Open 24 hrs daily  \nHouston South Loop Law Office Map\n\nCall: (713) 804-6332\n\nfree case evaluation\n\n  * Name*\n\n  * Email*\n\n  * Phone Number*\n\n  * Describe Your Case*\n\n  *   *   *   *   *   *   * Email\n\nThis field is for validation purposes and should be left unchanged.\n\nΔ\n\n### Areas We Serve\n\nAt Attorney Brian White Personal Injury Lawyers, we serve the following areas:  \nDowntown Houston, Central Business District, East Downtown, Fourth Ward,\nMidtown, South Central Houston, Hyde Park, Montrose, Rice Military, River\nOaks, West University Place, Southampton, Rice Village, University Place,\nBellaire, Southside Place, Braeswood Place, Meyerland, Willowbend Area,\nAstrodome, Museum Park, Greater Third Ward, University Oaks, Greater Eastwood,\nSecond Ward, Magnolia Park, Pleasantville Area, Kashmere Gardens, Northeast\nHouston, Jacinto City, Galeria Park, and more.\n\n### About Our Firm\n\nAttorney Brian White Personal Injury Lawyers is a personal injury law firm in\nHouston, TX fighting for accident victims.\n\nOur Houston injury attorneys have recovered millions of dollars on verdicts\nand settlements. If you have been injured in Houston, contact our law firm for\na free consultation.\n\nContact Our Law Office\n\n### Houston\n\nAttorney Brian White Personal Injury Lawyers  \n3120 Southwest Freeway,  \nSuite 350  \nHouston, Texas 77098  \n  \nHours: Open 24 hrs daily  \nHouston, TX Law Office Map  \nDirections\n\nCall: (713) 364-1466\n\nCall: (713) 659-0936\n\nHouston Office East Freeway\n\nAttorney Brian White Personal Injury Lawyers - East Fwy  \n11811 East Freeway,  \nSuite 630-06  \nHouston, Texas 77029  \n  \nHours: Open 24 hrs daily  \nHouston East Freeway Law Office Map\n\nCall: (713) 804-7078\n\nHouston Office South Loop\n\nAttorney Brian White Personal Injury Lawyers - South Loop  \n2600 South Loop West,  \nSuite 293  \nHouston, Texas 77054  \n  \nHours: Open 24 hrs daily  \nHouston South Loop Law Office Map\n\nCall: (713) 804-6332\n\n© 2023 - Attorney Brian White Personal Injury Lawyers, Houston TX - All Rights\nReserved\n\nPrivacy Policy | Sitemap | Disclaimer | 18-Wheeler Accidents | Get Brian |\nHouston, TX\n\nGoogle Rating\n\n4.8\n\nBased on 392 reviews\n\n×\n\nCall Now Button\n\n",
    "links": "[{\"link\": \"https://attorneybrianwhite.com/privacy-policy/\", \"text\": \"Privacy Policy\"}, {\"link\": \"https://attorneybrianwhite.com/sitemap/\", \"text\": \"Sitemap\"}, {\"link\": \"https://attorneybrianwhite.com/disclaimer/\", \"text\": \"Disclaimer\"}, {\"link\": \"https://attorneybrianwhite.com/houston-truck-accident-attorney/\", \"text\": \"18-Wheeler Accidents\"}, {\"link\": \"https://attorneybrianwhite.com/get-brian/\", \"text\": \"Get Brian\"}]",
    "priceAndPlans": "Error: Timeout 30000ms exceeded. =========================== logs\n=========================== navigating to\n\"http://web.archive.org/web/20231202050417/https://attorneybrianwhite.com/\",\nwaiting until \"load\"\n============================================================\n\n"
}