{
    "summary": "3700 Buffalo Speedway, Suite 1150 Houston, Texas 77098  (713) 526-0200\ninfo@bergplummer.com\n\n  * Lawyers\n    * Geoffrey Berg\n    * James “Jim” C. Plummer\n    * Bruce Johnson\n    * Amar Raval\n    * Judge Mike Schneider (Ret.)\n    * Kathryn E. Nelson\n  * Commercial Litigation\n    * Houston Commercial Litigation\n    * Breach of Contract\n    * Partnership Disputes\n    * Business Divorce\n    * Non-Compete Disputes\n  * Insurance Litigation\n    * Health Insurance Claims\n    * Life Insurance Claims\n    * Disability Insurance Claims\n    * Accidental Death and Dismemberment Claims\n  * Insights\n    * Commercial Litigation\n    * Insurance Litigation\n  * Client Reviews\n    * Commercial Litigation Reviews\n    * Insurance Litigation Reviews\n  * Contact\n\n__ MENU\n\n__ __ __\n\n#### Insurance Litigation\n\n#  Houston Health Insurance Lawyers\n\nHealth insurance claim denials can be exceedingly difficult to handle from\nboth a financial and emotional perspective. In health insurance claim\ndisputes, not only are you saddled with the unique challenge of having to\nrecover from your injury or illness, but depending on the circumstances (e.g.,\nif your insurance provider makes a significantly undervalued offer or denies\nyour claim entirely), you could be left with significant bills.\n\nWhether your health insurance provider chooses to cover your treatment could\nspell the difference between bankruptcy and solvency – and in many cases the\ndifference between prompt treatment that can save a patient’s life and an\nunknown future. The stakes in health insurance disputes are often rather high.\nIf your insurer acts in bad faith, you may therefore be entitled to recover\ndamages for emotional distress, among various other losses.\n\nAs a general rule, insurers are incentivized to avoid or minimize their\npotential liabilities, even when a policyholder clearly qualifies for benefits\nunder their coverage contract. By ramping up the administrative cost for the\npolicyholder, insurers can effectively reduce their benefits liabilities and\nundermine the ability of policyholders to challenge the legitimacy of their\nactions.\n\nSuccessful insurance litigation requires client-oriented legal representation\nfrom beginning-to-end of the process. At Berg Plummer Johnson & Raval, LLP,\nour Houston insurance coverage and litigation attorneys have decades of\ncombined experience representing policyholders against their insurers for\nwrongful denial, delay, missed payments, underpayment, and other issues\nentitling the claimant to challenge the decision of the insurer.\n\n## We Fight for Texas Healthcare Policyholders to Get the Compensation They\nDeserve\n\nWhen it comes to health insurance, an injured policyholder who requires\nsignificant medical treatment may find themselves in a situation where they\nare held hostage to the whims of their insurer. If an insurer denies your\nclaim, underpays your claim, or delays payment, you could be left in financial\nlimbo with no means with which to pay your medical bills. An experienced\nHouston health insurance lawyer can help you recover the compensation you\ndeserve.\n\nBerg Plummer Johnson & Raval, LLP is committed to helping policyholders obtain\ntheir rightful benefits. We represent clients in Houston and throughout Texas\nwho were wrongfully denied a health insurance claim or whose claims were\nunjustly delayed.\n\n## Why Hire a Houston Health Insurance Attorney?\n\nThough one may believe that their claims are covered by their insurance\npolicy, the insurer benefits a great deal from interfering with the payout.\nFor example, if an insurer wrongfully denies a health insurance claim, and the\npolicyholder decides not to challenge the denial (and potentially recovering\ndamages), then the insurer will effectively avoid a payout that they otherwise\nwould have had to honor.\n\nAs health insurance providers are naturally in conflict with their\npolicyholders, it is critical that policyholders take an active role in making\nsure their claims are fairly considered and processed by their insurance\nproviders. If the insurer fails to act in accordance with their duties under\nthe law, you should connect with an experienced Houston health insurance\nlawyer who can counsel you through the process of obtaining a favorable\nresolution.\n\n## Common Reasons for Insurance Claim Delays or Denial\n\nDifficulties in having an insurance claim processed and accepted can be\nrelated to, but are not necessarily limited, to:\n\n  * Category of treatment not covered (e.g., mental health issues not being covered by the existing healthcare plan)\n  * Treatment considered “not medically necessary”\n  * Denial on the basis of incomplete evidence\n  * Administrative and clerical errors\n  * Delayed submissions\n  * Valuation of costs does not accurately reflect claim\n\n## Pre-Authorization Issues? We Can Help.\n\nIn some health insurance disputes, the policyholder may have failed to obtain\npre-authorization from the insurer before receiving treatment. Failure to\nobtain pre-authorization may result in a claim denial, but the denial will not\nnecessarily “stick.” If you can demonstrate that the treatment was necessary\nand would have been authorized by the insurer, then you may be able to\nsuccessfully challenge the denial.\n\nIf you have had your health insurance claims wrongfully denied, delayed,\nundervalued, or otherwise interfered with by the insurer, it’s important that\nyou connect to a qualified health insurance attorney with a track record of\nsuccess in challenging the decisions of insurance providers and obtaining\nfavorable results. Depending on the terms of the coverage, your attorney may\nhave to re-file your claim, challenge the denial through an internal\nadministrative process, and eventually file a lawsuit in court and take your\ncase to trial.\n\n## Contact a Houston Health Insurance Lawyer at Berg Plummer Today\n\nStruggling with an insurance claim issue in Texas? We can help you fight for\nyour rightful benefits. At Berg Plummer Johnson & Raval, LLP, our attorneys\nhave decades of experience helping clients litigate health insurance coverage\nissues and obtain the benefits they deserve. Our law firm is committed to\nproviding best-in-class legal representation that is considerate of our\nclients’ varying financial limitations and strategic needs. To that end, we\naim to provide our clients with their choice of fee arrangements that are\ncustomized to their particular needs. We will work with you to develop a\ncustomized strategic roadmap and budget that helps you accomplish your legal\nobjectives without excessive spending. Call (713) 526-0200 or fill out our\nonline form for more information.\n\n\"*\" indicates required fields\n\n### How can we help?\n\nName*\n\nEmail*\n\nPhone\n\nTell Us More*\n\nPhone\n\nThis field is for validation purposes and should be left unchanged.\n\nΔ\n\n### Connect with Us\n\n__ __ __\n\n## Tell us how we can help\n\nWhen you consult with Berg Plummer Johnson & Raval, LLP, an experienced\nHouston trial lawyer at our firm will engage you in a collaborative\npartnership. We understand the unique challenges associated with business and\ninsurance disputes, and how to navigate them successfully and in a manner that\naccomplishes our clients’ objectives. Our practical, results-oriented mindset\ndrives every facet of our legal representation. We are laser-focused on\nworking towards the best possible solution for each client.\n\n\"*\" indicates required fields\n\nFirst Name*\n\nLast Name*\n\nEmail*\n\nPhone\n\nMessage*\n\nComments\n\nThis field is for validation purposes and should be left unchanged.\n\nΔ\n\nHouston Business & Insurance Lawyers\n\n3700 Buffalo Speedway, Suite 1150  \nHouston, Texas 77098  GET DIRECTIONS __\n\n  * Phone: (713) 526-0200\n  * Fax: (832) 615-2665\n  * Email: info@bergplummer.com\n\n__ __ __\n\n  * Insurance Litigation\n  * Commercial Litigation\n  * Privacy Policy\n  * Disclaimer\n\nCopyright 2023 Berg Plummer Johnson & Raval, LLP. All rights reserved.\n\n__\n\n×\n\n* * *\n\n  * Lawyers\n    * Geoffrey Berg\n    * James “Jim” C. Plummer\n    * Bruce Johnson\n    * Amar Raval\n    * Judge Mike Schneider (Ret.)\n    * Kathryn E. Nelson\n  * Commercial Litigation\n    * Houston Commercial Litigation\n    * Breach of Contract\n    * Partnership Disputes\n    * Business Divorce\n    * Non-Compete Disputes\n  * Insurance Litigation\n    * Health Insurance Claims\n    * Life Insurance Claims\n    * Disability Insurance Claims\n    * Accidental Death and Dismemberment Claims\n  * Insights\n    * Commercial Litigation\n    * Insurance Litigation\n  * Client Reviews\n    * Commercial Litigation Reviews\n    * Insurance Litigation Reviews\n  * Contact\n\n* * *\n\n3700 Buffalo Speedway suite 1150, Houston, TX 77098, USA  __Get a free\nconsultation\n\n* * *\n\n__ __ __\n\n",
    "links": "[{\"link\": \"https://bergplummer.com/insurance-litigation/health/\", \"text\": \"Health Insurance Claims\"}, {\"link\": \"https://bergplummer.com/blog/commercial-litigation/\", \"text\": \"Commercial Litigation\"}, {\"link\": \"https://bergplummer.com/blog/insurance-litigation/\", \"text\": \"Insurance Litigation\"}, {\"link\": \"https://bergplummer.com/insurance-litigation/health/\", \"text\": \"Health Insurance Claims\"}, {\"link\": \"https://bergplummer.com/blog/commercial-litigation/\", \"text\": \"Commercial Litigation\"}, {\"link\": \"https://bergplummer.com/blog/insurance-litigation/\", \"text\": \"Insurance Litigation\"}, {\"link\": \"https://bergplummer.com/contact/\", \"text\": \"\"}]",
    "priceAndPlans": "3700 Buffalo Speedway, Suite 1150 Houston, Texas 77098  (713) 526-0200\ninfo@bergplummer.com\n\n  * Lawyers\n    * Geoffrey Berg\n    * James “Jim” C. Plummer\n    * Bruce Johnson\n    * Amar Raval\n    * Judge Mike Schneider (Ret.)\n    * Kathryn E. Nelson\n  * Commercial Litigation\n    * Houston Commercial Litigation\n    * Breach of Contract\n    * Partnership Disputes\n    * Business Divorce\n    * Non-Compete Disputes\n  * Insurance Litigation\n    * Health Insurance Claims\n    * Life Insurance Claims\n    * Disability Insurance Claims\n    * Accidental Death and Dismemberment Claims\n  * Insights\n    * Commercial Litigation\n    * Insurance Litigation\n  * Client Reviews\n    * Commercial Litigation Reviews\n    * Insurance Litigation Reviews\n  * Contact\n\n__ MENU\n\n__ __ __\n\n#### Insurance Litigation\n\n#  Houston Disability Insurance Lawyers\n\n## ERISA Lawyers\n\nWhether you have disability insurance coverage through your employer or\nindependently through your own personalized insurance coverage, you are\nentitled to receive disability benefits if you have a qualifying condition.\nInsurance policies can vary considerably. A disability insurance lawyer can\nassess your plan and the language of the contract and determine the\nobligations that apply to you, the claimant, and those that apply to the\ninsurer. Understanding the provisions and language of your disability\ninsurance policy and how it will be enforced is critical.\n\nIn some cases, insurers try to impose restrictive provisions to impede a\nclaimant’s ability to receive disability benefits. For example, a carrier may\nrequire a claimant to attend a medical examination at a facility located hours\naway from their home. Failure to attend this examination can be deemed a\nfailure to cooperate under the insurance policy.\n\nIf you are suffering from a disabling condition and are no longer able to\nwork, disability benefits can provide the lifeline you need to support\nyourself and your family. Whether your disability is short or long-term in\nnature, a denial or termination of benefits can be devastating. To ensure your\nright to compensation is protected, it is crucial you have a skilled Houston\ndisability insurance lawyer on your side.\n\n## Insurance Company Duty of Good Faith and Fair Dealing\n\nIf an insurance company denies a claim for disability benefits and the\nadministrative appeal does not succeed, then you may be entitled to sue them\nfor wrongful denial and for violating the duty of good faith and fair dealing\nthat is implied in the insurance contract. The duty of good faith is important\ngiven that insurers are in a position where they have superior bargaining\npower and resources.\n\nAn insurer may be found to have violated its duty of good faith by engaging in\nthe following bad faith conduct:\n\n  * Denying benefits without proper justification\n  * Unreasonably delaying or otherwise withholding payment of benefits\n  * Violating obligations imposed on them by contract\n  * Terminating existing disability benefits prematurely\n  * Intimidating or otherwise coercing the claimant\n\n## Qualifying For Disability Benefits\n\nApplying for and receiving disability benefits can be a procedurally,\nsubstantively, and emotionally challenging process. Although one might expect\nan insurance company to pay when a claimant has a legitimate disability\nentitling them to benefits they’ve paid for, insurers often deny disability\nclaims and frequently employ bad faith tactics that are intended to frustrate\nthe efforts of the disabled claimant.\n\nIn order for a claimant to be eligible to receive disability benefits, they\nmust show that their disability satisfies the requirements outlined by the\ninsurance plan. What constitutes a “disability” can vary significantly from\nplan to plan. In some cases, a disability insurance policy gives provides only\na general definition of disability, thus creating an opportunity for the\ninsurer to restrictively interpret the definition. In other cases, the policy\nprovides a general definition along with specific examples of covered\ndisabilities — presumptive disabilities — that by default qualify a claimant\nfor benefits under the contract.\n\nYour disability insurance policy’s definition of disability determines whether\nor not you qualify to receive benefits. Some of the factors that comprise\nvarious disability definitions include but are not limited to:\n\n  * Whether the condition restricts you from working at your current job\n  * Whether the condition restricts you from working at any job\n  * Whether the disability is partial or total\n  * Whether the disability is long-term/permanent or short-term/temporary\n  * Whether you are receiving disability income from other sources (e.g., social security disability)\n\nThe language in your disability insurance contract may be quite technical, so\nit’s important that you consult with an experienced disability insurance\nlawyer who is capable of assessing the terms of your insurance plan and\ndetermining whether your condition is likely to qualify for benefits.\n\nAppealing a denial of a disability benefits claim is often the last\nopportunity you will have to introduce a comprehensive record relating to your\ndisability (e.g., medical records, wage loss documentation, etc.). This\nadministrative record will be assessed during civil litigation if the appeal\nfails. It’s critical that you work with an attorney who is experienced in the\ndisability benefit appeals process and who can assist you in gathering the\nnecessary documentation to ensure your administrative record is comprehensive.\n\n## Types of Disability Insurance Claims\n\n### Long Term Disability Insurance Claims\n\nSome illnesses and injuries can prevent you from returning to work for several\nmonths or even years. In these situations, long-term disability insurance is\ndesigned to replace a portion of your income when you are unable to work for\nan extended period.\n\nUnfortunately, the insurance companies who issue disability insurance policies\noften make it very difficult to collect the benefits you have paid for. If you\nhave been denied long-term disability coverage or your benefits have been\nterminated, a disability insurance lawyer can help you get the financial\nsupport you need to make it through a very difficult time in your life.\n\nIf you have submitted a long-term disability claim and your insurer has denied\nit, delayed processing it, or significantly undervalued it, you may be\nentitled to appeal the carrier’s decision and, if needed, litigate against\nyour insurer for wrongful denial. A long-term disability lawyer can help you\nwith your claim, appeal, and lawsuit, and will fight to recover your rightful\nbenefits due and other compensation as allowed by law.\n\nWhile short-term disability benefits may expire after six months, long-term\ndisability benefits often last until retirement age or until you have\nsufficiently recovered such that you are capable of returning to work. The\nassumption of long-term disability coverage is that the long-term disability\nat issue will not necessarily be fully resolved.\n\nFor example, if you suffer an accident in Houston or elsewhere that renders\nyou a paraplegic, you may qualify for long-term disability insurance coverage.\nThis coverage is not intended to be a “stopgap” measure, as your disability\nwill not resolve itself after some length of time has passed.\n\nCritically, however, insurers will attempt to lower their payouts by arguing\nthat your health condition is such that you are only partially disabled, not\nfully disabled. If you are capable of working a lower-paying job, the insurer\nwill assert that you should take an alternative position so they can pay less\nbenefits or no benefits. With the aid of a skilled Houston disability\ninsurance lawyer, however, you can demonstrate that the jobs you can handle\npay significantly less than your pre-disability income, such that you are\nstill qualified to receive full long term disability benefits.\n\n### Short Term Disability Insurance Claims\n\nShort term disability benefits are temporary and are intended to provide\nreplacement income to tide you over until you are no longer disabled.\nUnfortunately, despite the fact that many disabilities (including short term\ndisabilities) are quite serious, insurance companies routinely deny and delay\nclaims, terminate existing benefits, and otherwise impede a claimant’s ability\nto receive full and adequate benefits. An experienced Houston disability\ninsurance lawyer can help you fight for the benefits you deserve.\n\nIn Texas, as in other states, insurance providers are required to act in good\nfaith when handling disability insurance claims. If an insurer has acted in\nbad faith in denying a disability claim — in other words, if it acted\nimproperly or unreasonably — then you may be entitled to sue and recover\ndamages.\n\nBad faith or wrongful conduct by an insurer includes, but is not necessarily\nlimited, to:\n\n  * Delaying payment of benefits\n  * Denying benefits when the evidence clearly justifies payment\n  * Intimidating or otherwise coercing the claimant\n  * Terminating benefits and/or coverage prematurely\n\nDepending on the terms of your short term disability insurance policy,\ncoverage may last for either a specified period of time (e.g., three months,\nsix months, or up to a year) or until you are sufficiently recovered to return\nto work. Given the short-term nature of these disability benefits,\nunscrupulous insurers will sometimes delay benefits or deny benefits so as to\nexhaust a claimant’s interest in obtaining benefits.\n\nThough short-term disability benefits are temporary, insurance companies are\naccustomed to denying these claims and making it difficult for disability\nclaimants to obtain the benefits necessary to replace or supplement their\nincome. Even if you have succeeded in obtaining short-term disability\nbenefits, your insurer may challenge the duration of these benefits by\nterminating them prematurely.\n\n### ERISA Disability Insurance Claims\n\nThe Employee Retirement Income Security Act ( _ERISA_ ) requires employer\ninsurance plan providers to provide participants with important plan\ninformation. The Act was designed to protect employee rights including group\ndisability insurance provided by an employer (not privately purchased\npolicies). If an employee becomes disabled, they act as a participant or\nbeneficiary and file a claim for benefits to the ERISA plan administrator,\nwhich is usually the insurer that issued the policy but can also be a variety\nof other people or entities.\n\nAn employee and/or their employer pay premiums for ERISA disability insurance.\nIf an employee becomes disabled, they deserve monthly disability insurance\nbenefits. Unfortunately, filing a claim for disability benefits is often not a\nsmooth process. Insurance companies will look for and find a reason to deny a\nlegitimate disability claim. While your company may have a human resources\ndepartment and/or an employee in charge of benefits, these folks cannot\nreplace the counsel of an experienced disability insurance lawyer.\n\nIf you file a claim and it’s denied, you will need to file an appeal. That is\na very good time to hire an attorney so they can help with your appeal. If the\ninsurer denies your appeal, your lawyer can help you file a lawsuit, as\nlitigation under employer-provided group insurance policies is different from\nother types of insurance litigation. ERISA preempts state law claims, meaning\nfederal law will apply, and you cannot get a jury trial and only have your\ncase heard by a federal judge.\n\n## Houston Disability Insurance Lawyers\n\nThe attorneys at Berg Plummer Johnson & Raval, LLP are committed to helping\npeople obtain the disability insurance benefits they rightfully deserve.\nWhether you are seeking benefits under a private disability policy or an\nemployer or union plan, our attorneys will do everything we can to get you the\nmoney you are entitled to. We know how large insurance companies handle\ndisability claims and we are prepared to represent our clients throughout the\nentire course of their claim, from submitting the initial application for\nbenefits to handling administrative appeals to filing a lawsuit and reaching a\nfavorable conclusion. Our disability insurance lawyers have years of\nexperience successfully handling disability claims and we will fight to\nrecover the benefits you rightfully deserve.\n\nGiven that many disability claimants have a limited budget and specific\nstrategic goals, we work closely with clients to provide dynamic fee\narrangements that are designed to cost-effectively achieve positive results.\n\n\"*\" indicates required fields\n\n### How can we help?\n\nName*\n\nEmail*\n\nPhone\n\nTell Us More*\n\nComments\n\nThis field is for validation purposes and should be left unchanged.\n\nΔ\n\n### Connect with Us\n\n__ __ __\n\n## Tell us how we can help\n\nWhen you consult with Berg Plummer Johnson & Raval, LLP, an experienced\nHouston trial lawyer at our firm will engage you in a collaborative\npartnership. We understand the unique challenges associated with business and\ninsurance disputes, and how to navigate them successfully and in a manner that\naccomplishes our clients’ objectives. Our practical, results-oriented mindset\ndrives every facet of our legal representation. We are laser-focused on\nworking towards the best possible solution for each client.\n\n\"*\" indicates required fields\n\nFirst Name*\n\nLast Name*\n\nEmail*\n\nPhone\n\nMessage*\n\nComments\n\nThis field is for validation purposes and should be left unchanged.\n\nΔ\n\nHouston Business & Insurance Lawyers\n\n3700 Buffalo Speedway, Suite 1150  \nHouston, Texas 77098  GET DIRECTIONS __\n\n  * Phone: (713) 526-0200\n  * Fax: (832) 615-2665\n  * Email: info@bergplummer.com\n\n__ __ __\n\n  * Insurance Litigation\n  * Commercial Litigation\n  * Privacy Policy\n  * Disclaimer\n\nCopyright 2023 Berg Plummer Johnson & Raval, LLP. All rights reserved.\n\n__\n\n×\n\n* * *\n\n  * Lawyers\n    * Geoffrey Berg\n    * James “Jim” C. Plummer\n    * Bruce Johnson\n    * Amar Raval\n    * Judge Mike Schneider (Ret.)\n    * Kathryn E. Nelson\n  * Commercial Litigation\n    * Houston Commercial Litigation\n    * Breach of Contract\n    * Partnership Disputes\n    * Business Divorce\n    * Non-Compete Disputes\n  * Insurance Litigation\n    * Health Insurance Claims\n    * Life Insurance Claims\n    * Disability Insurance Claims\n    * Accidental Death and Dismemberment Claims\n  * Insights\n    * Commercial Litigation\n    * Insurance Litigation\n  * Client Reviews\n    * Commercial Litigation Reviews\n    * Insurance Litigation Reviews\n  * Contact\n\n* * *\n\n3700 Buffalo Speedway suite 1150, Houston, TX 77098, USA  __Get a free\nconsultation\n\n* * *\n\n__ __ __\n\n"
}