{
    "summary": "Skip to content\n\n  * __\n\n4125 West Waco Dr\n\nWaco, Texas 76710\n\n  * __\n\n(254)753-6437\n\nFree Consultations\n\n  * __Free Case Evaluation\n\n__\n\n  * Waco Attorneys | Waco Lawyers Since 1925\n  * Practice Areas\n  * Attorneys\n  * Support Staff\n  * Contact Us\n\n__________\n\nDunnam Law > Insurance Claim Attorney in Waco\n\n# Waco Insurance Claim Denial Attorney\n\nIf your insurance company denied your claim, contact a Waco insurance denial\nattorney to discuss your matter. Policyholders pay for insurance so that\ninsurance pays when they need it most. But insurance companies make money by\nselling policies, and they lose money when they pay claims. After a tragedy\ndamages your property or business, you expect the insurance company to do the\njob you hired it to do. Insurance companies are notorious for using excuses to\navoid paying claims by delaying payments, deny claims, and act in bad faith.\nOur clients often feel hopeless after the insurance company does not pay. The\ninsurance company’s bad faith creates a significant financial burden for the\nperson who paid for insurance. Insurance law is complicated, and the amount of\ninformation and documentation required to prove a claim has been unfairly\ndenied is often overwhelming. Our insurance coverage advocates fight for those\nwho have been wrongfully denied insurance claims in Waco.\n\nThe Waco denied insurance claim attorneys at Dunnam & Dunnam are not\nintimidated by insurers. We wrestle with them all the time. Our Waco attorneys\nhave the legal knowledge, litigation experience, and courtroom reputation for\ngetting results for our insurance claim denial clients.\n\nCompanies and individuals who have a dispute with their insurance carriers\nshould quickly obtain representation with an insurance claim denial attorney\nbecause of the deadlines associated with these claims. Our insurance coverage\nlawyers carefully document insurance company bad faith so we can hold those\ncompanies accountable for their refusal to pay or diligently investigate and\nprocess claims.\n\n## **What do you do if your insurance claim was denied?  **\n\nIt is essential to document damages and not sign any documents from your\ninsurance company. If you feel like your claim was wrongfully denied or\ndelayed, contact our insurance claim denial attorneys. A Waco insurance claim\nattorney will fight for you to get the compensation that you deserve.\n\nBecause insurance companies need to receive more money than they payout, they\nhave pressure between paying policies and company profits. Because of this\npressure, the law requires that insurance companies act in good faith. This\nmeans that the insurance company must acknowledge and investigate your claim\nwithin 15 days. The law obligates the insurance company to send you a notice\nof rejection or acceptance within those 15 days. If your request was rejected,\nthe insurance company must explain why in writing. The most common reasons for\ndenying a claim include a late filing, an invalid claim, or unpaid premiums.\n\n## **What can an insurance denial attorney do?  **\n\nOur attorneys leave no stone unturned while we analyze your policy and the\nfacts surrounding the denial. When people have been wrongfully denied coverage\nfrom their insurance companies, it motivates us to make things right. Our\nattorneys have successfully handled hundreds of insurance claims for\npolicyholders. These have ranged from fire damage, sexual assault, hurricanes,\nbusiness interruption, officer and director liability, and theft. Disputes\nthat arise between a policyholder and an insurer often concern matters that\nrelate to the accurate documentation of the accident and injury. You do not\nwant to lose your ability to recover money because an adjustor failed to\ndocument your losses and the details of your case correctly. Get a\nknowledgeable insurance claim denial attorney on your side to prevent it from\nhappening.\n\n## **Bringing a lawsuit against an insurance company  **\n\nIf you have a dispute with your insurance company, the most common form of\nlegal relief is a declaratory judgment action. A declaratory judgment asks the\ncourt to interpret the policy and decide whether there is coverage or not.\nThis requires the court to do a careful analysis of the text of the insurance\npolicy and any exclusions. Also, an insurance claim denial attorney may bring\na “bad faith” insurance claim against your insurance company. The law allows\nfor you to bring a “bad faith” claim against your insurer when your insurance\ncompany: (1) wrongfully denying a claim; (2) delaying or failing to\ninvestigate a claim; (3) failing to defend or settle a lawsuit; (4) failing to\nprocess or settle a claim in a timely fashion.\n\n## **How can I afford an attorney to sue an insurance company?  **\n\nWe understand that the financial impact of a wrongfully denied claim is a\nburden. We work on contingency in these matters so that you don’t pay anything\nunless we recover money for you.\n\n## **What are examples of bad faith insurance in Texas?  **\n\nBecause your policy is a paid-for promise by your insurance company to provide\nyou with insurance protection, the company must ensure that protection and to\nnegotiate and settle claims in good faith. Insurance bad faith is when an\ninsurance company tries to renege on its obligations to its client. These\noften include:\n\n  * Misrepresentation of policy provisions\n  * Inadequate claim investigation\n  * Failing to respond in an adequate time\n  * Underpaying or denying valid claims\n\nTo prove bad faith, you must show that the insurance policy was valid and paid\nin full at the time of the loss, the insured policy complied with the terms of\nthe policy, and the insurance company breached the terms of the contract by\ndelaying or failing to make payment.\n\n## **What can I get back from the insurance company for a wrongfully denied\nclaim?  **\n\nThere are three main categories of damages for insurance bad faith litigation.\nThese damages often include the contract damages that you are owed under the\npolicy, the extra-contractual damages that involve the emotional distress and\neconomic losses incurred by the insured while waiting for the claim to be\npaid, and occasionally punitive damages.\n\n## **First-Party Insurance Claims  **\n\nThe first party is also called the insured. This is the person who is the car\nowner, homeowner, business owner, who wants to make sure that they have enough\nmoney to pay for damages to someone. A claim against your own insurance\ncompany is called a “first-party claim.” When you pay for an insurance policy,\nyou expect that a valid claim will be paid. But when that is not the case, you\nshould consult with an insurance claim denial attorney first. Many of the\nfirst party claims that our Waco attorneys often see involve:\n\n### **Life insurance  **\n\nA life insurance policy may be legitimately denied if there is a need to\ndetermine the proper person to pay or if more than one beneficiary makes a\nclaim. But the wrongful denial of benefits is an act of bad faith. Our\ninsurance attorneys can fight in court to collect the full amount of your life\ninsurance policy.\n\n### **Business insurance  **\n\nYour business has many types of insurance. This includes losses involving\nflood, fire, theft, or business disruption. An improper denial can permanently\nshutter your business, leaving you holding the bag. We can help you get the\ncoverage that you paid for in your business insurance policy.\n\nYour general ledger often reveals the impact on your business, accounts for\nextra costs, and inefficiencies of operation and payroll for those not\nworking. Our business insurance claim denial attorneys analyze the time and\ncauses of business interruption. We can advise you on how to mitigate further\nbusiness losses. We will then partner with experts to prepare financial\nprojections to show a jury what money you are owed under your business\ninterruption policy.\n\n### **Homeowners insurance claims  **\n\nHomeowners insurance covers a variety of matters that occur on your property,\nincluding damage to your home, theft, and even personal injuries that occur on\nyour property.\n\n### **Disability insurance  **\n\nIf you purchased disability insurance, you expected to be covered in the event\nof a significant illness or injury. However, disability claims are commonly\nchallenged by insurance companies and the doctors who work for them.\n\n### **Medical insurance  **\n\nMedical insurers may deny payment for a medical test or treatment because they\nbelieve a less expensive alternative exists. When that happens, an attorney\ncan help collect the records and evidence needed to prove the necessity of a\ntest or treatment. Proving a case of bad faith can be difficult, because there\nare many variables at play, such as the benefit limits established via an\ninsurance policy. With health insurance claims, in particular, the insured may\nhave to present a good deal of evidence to indicate that a specific treatment\nwas medically necessary.\n\n### **Storms like Hurricanes, Tornadoes, and Hailstorms  **\n\nStorm losses are devastating. You can lose everything. To make matters worse,\nit is difficult to show everything you lost. Following damage from a\nhurricane, tornado, or hailstorm, you should make sure everyone is safe. Then\nimmediately report the event to your carrier. Do not clean up the affected\narea quickly. You should document as much as you possibly can with photographs\nand videos. Use your camera to record the exterior of your structure,\nfoundation, windows, walls, siding, roofs including vents, skylights, solar\nequipment, concrete, paint, trim, fascia, gutters, exterior lights, air\nconditioning units, planters, patio furniture, decks, grills, play equipment,\nsheds, pools, and anything else that is outside of your property. Photograph\nevery room, the front, sides, and back of your structure, and try to get\ndifferent photographs from differing elevations.\n\nDunnam & Dunnam has represented thousands of homeowners and business owners\nacross Texas for insurance claims. The Waco insurance claim attorneys at\nDunnam & Dunnam are experienced and respected for their work. The claims\nincluded property damage and commercial losses as a result of winds, fires,\nhail, tornadoes, hurricanes, wildfires, water damage or drought.\n\n### **The Duty to Defend**\n\nYou get sued. And you send the lawsuit to your insurance company, only to find\nthat they have failed to defend you in the lawsuit. This is one of the most\ncritical provisions in an insurance policy, and it causes a lot of litigation.\nIf your insurance company responds that “we have no duty to defend you against\nthis lawsuit,” then your next remedy is to hire a lawyer to determine if there\nis a basis for litigation.\n\n### **Prompt Notice to the Insurance Company Is Important**\n\nYou are required to give prompt notice of any potential loss to the insurance\ncompany. If you do not, they have the right to decline to cover you. This\nrequirement protects the insurance company and allows it to have a say in how\nthe claim will be resolved.\n\n## **Third-party insurance claims**\n\nThe third party is the person who is hurt, or in death cases, it is the family\nor beneficiaries of the person who is killed. You may have a significant claim\nagainst the insurance policy of an individual or company that caused your\nloss. This is known as a third-party claim. Situations that require the filing\nof a third-party insurance claim include:\n\n  * Serious Auto Accidents\n  * Transportation Accidents\n  * Work Injuries\n  * Premises Injuries\n  * Injuries to Children\n  * Brain or Spinal Injuries\n\nThird-party insurance claims are routinely contested in court. If you have a\nvalid claim, our firm aggressively pursues the compensation you deserve.\n\n## **Contact a Waco Insurance Claim Denial Attorney  **\n\nWhen you file a significant insurance claim, you are going up against a\nsizeable experienced corporation. You can quickly be taken advantage of\nwithout an experienced insurance coverage attorney on your side. Our attorneys\novercome the obstacles the insurance company places. You can depend on us to\nwork tirelessly in your case to give you the best chance of achieving results.\nWhen an insurance company has unfairly denied or improperly handled your\ninsurance claim, Dunnam & Dunnam lawyers can help with a 100% free\nconsultation. Contact our Central Texas insurance claim attorneys at\n254-753-6437.\n\n### Andrea Michelle Mehta\n\nAndrea's practice focuses primarily in Appellate Law, Civil Trial Law, Family\nLaw, and General Law.\n\nRead More\n\n### Carolina Truesdale\n\nCarolina G. Truesdale graduated from Texas Tech University School of Law, Cum\nLaude.\n\nRead More\n\n### Eleeza Johnson\n\nEleeza's practice areas include: Personal Injury Law, Civil Trial Law,\nCommercial Law, Family Law and Pharmaceutical Law.\n\nRead More\n\n### Gerald R. Villarrial\n\nGerald R. Villarrial has practiced family law, criminal law and civil\nlitigation for over 20 years.\n\nRead More\n\n### Hunter Slocum\n\nHunter Slocum is an associate attorney at Dunnam & Dunnam, L.L.P working with\ncivil trial law.\n\nRead More\n\n### Jim Dunnam\n\nJim Dunnam is a Board Certified Specialist in both Civil Trial Law and Family\nLaw.\n\nRead More\n\n### Mason Dunnam\n\nMason Dunnam is the fourth generation of Dunnam attorneys at the firm since\n1925\n\nRead More\n\n### Merrilee L. Harmon\n\nMerrilee L. Harmon is a Family Law specialist, Board Certified by the Texas\nBoard of Legal Specialization since 1985.\n\nRead More\n\n### Vance Dunnam\n\nVance has 60 years of experience as a lawyer in Waco, Texas handling all types\nof cases in both the office and the courtroom.\n\nRead More\n\n__\n\nContact an insurance claim attorney at Dunnam & Dunnam by calling us at\n254-753-6437 for a free consultation about why your insurance claim was\nimproperly handled.\n\n  * __\n\n4125 West Waco Dr\n\nWaco, Texas 76710\n\n  * __\n\n(254)753-6437\n\nFree Consultations\n\n  * __Free Case Evaluation\n\nSearch for:\n\n# Contact us for a free consultation\n\n## CONTACT US:\n\nBy Phone: (254) 753-6437  \nBy Fax: (254) 753-7434  \nContact Us Online\n\n## Office Location:\n\n4125 West Waco Drive Waco, Texas 76710\n\nCopyright © Dunnam & Dunnam, L.L.P. All Rights Reserved. Prior results do not\nguarantee a similar outcome. Dunnam & Dunnam LLP maintains this website to\nprovide you with general information concerning itself and its attorneys, as\nwell as to facilitate communications with persons and entities possibly\ndesiring to establish an attorney-client relationship with a law firm or an\nattorney. Information provided by and through this website does not create any\nkind of attorney-client relationship with Dunnam & Dunnam or any of its\nattorneys and, furthermore, does not constitute and should not to be relied\nupon by you as any kind of legal advice or service by Dunnam & Dunnam or any\nof its attorneys. Dunnam & Dunnam L.L.P. assumes no liability for the use or\ninterpretation of information contained herein. This publication is provided\n“AS IS” WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING,\nBUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A\nPARTICULAR PURPOSE, OR NON-INFRINGEMENT.\n\n__\n\n",
    "links": "[{\"link\": \"https://dunnamlaw.com/contact-us\", \"text\": \"\"}, {\"link\": \"https://dunnamlaw.com/contact-us\", \"text\": \"\"}]",
    "priceAndPlans": "Error: Timeout 30000ms exceeded. =========================== logs\n=========================== navigating to\n\"http://web.archive.org/web/20231030235148/https://dunnamlaw.com/\", waiting\nuntil \"load\" ============================================================\n\n"
}