{
    "summary": "Skip to content\n\n## Feldman & Feldman\n\n## Civil Litigation Law Firm\n\n  * About Us\n    * Notable Cases\n    * Cris Feldman\n    * David Feldman\n    * Gordon Hall\n    * Derek Bauman\n    * Fernando De Leon\n    * Shannon Almes\n    * Kimberly Dang\n    * Lara Hall\n  * Commercial Litigation\n    * Breach of Contract\n    * Breach of Fiduciary\n    * Business Fraud\n    * Business Partnership Disputes\n    * Insurance Disputes\n  * Business Law\n    * Franchise Law\n    * Business Contracts\n    * Oil & Gas\n    * Real Estate\n    * Construction Law\n  * Civil Litigation\n    * Appellate Law\n    * Clergy Sexual Abuse\n    * Education Law\n    * Municipal Law\n  * Employment\n    * Discrimination & Harassment\n    * Sexual Harassment\n    * Overtime\n    * Wage and Hour\n    * Wrongful Termination\n  * News\n  * Contact Us\n\nHome » Practice Areas » Houston Bad Faith Insurance Lawyers\n\nHolding Insurance Companies Accountable For Bad Faith Tactics\n\n# Houston Bad Faith Insurance Lawyers\n\nInsurance gives people peace of mind knowing the things that are most\nimportant to them, including their real property, are protected in the event\nof a disaster.\n\nWhile insurance companies have the right to investigate the legitimacy of\nclaims, many carriers use bad faith tactics to avoid paying claims. When this\nhappens, a Houston bad faith insurance lawyer can handle the bad faith\ninsurance case.\n\nInsurance is supposed to provide protection and security. Unfortunately,\ninsurance companies create obstacles in an attempt to avoid paying claims,\nincluding delaying payments past statutory deadlines, refusing to pay for\ncontractors they previously approved, requiring the insured to resubmit\npaperwork multiple times, and denying claims for frivolous reasons, among\nother bad faith tactics. When this happens, you need a dedicated and dogged\nbad faith lawyer by your side to pursue the fullest compensation available\nunder your insurance policy. Feldman & Feldman has the experience necessary to\npursue claims against insurance companies operating in bad faith.\n\nWhen you make an insurance claim, the law in Texas places a duty of “good\nfaith and fair dealing” upon the insurance company during claims\ninvestigation. Yet all too often, insurance companies seek to profit by\ndealing in bad faith with their insured by unfairly denying, delaying, or\nunderpaying benefits without a reasonable basis. If your insurance company has\ntreated you unfairly and failed to fulfill its legal obligations, it is\nimportant to consult with an **experienced bad faith attorney**.\n\n## Bad Faith Tactics\n\nInsurance companies often go to extreme lengths to minimize or completely deny\nclaims. Some of the most common bad faith tactics used by insurance companies\nin Texas include:\n\n  * Causing unnecessary delays throughout the claims process\n  * Causing unreasonable delays\n  * Failing to confirm or deny coverage in a reasonable period of time\n  * Hiring biased third parties to handle portions of the claims process\n  * Making threatening statements\n  * Misrepresenting the law\n  * Misrepresenting the terms of an insurance policy by stating some items are not covered when in fact they are\n  * Offering less money than a claim is worth\n  * Performing haphazard investigations of property damage and other insurance claims\n  * Refusing reasonable requests for documentation\n  * Undervaluing claims\n  * Wrongfully claiming damage is due to inadequate maintenance\n  * Wrongfully claiming damage is due to normal wear and tear\n\nIf you experience any one of these bad faith tactics, you need to immediately\ncontact an experienced bad faith lawyer. Insurance companies are first and\nforemost a business, so they are never in a rush to pay out on claims.\nOftentimes, insurance companies take advantage of the fact that most\npolicyholders are completely unaware of their rights. However, all\npolicyholders are legally entitled to a thorough, prompt, and fair\ninvestigation of their claims.\n\nAlthough insurance carriers should honor valid claims, our attorneys know some\ncompanies underpay or simply refuse to pay claims. At Feldman & Feldman, we\nunderstand these denials have devastating financial consequences for claimants\nwhose business or residential properties are in need of urgent repair.\n\n## Bad Faith Damages\n\nWhen you file an insurance damage claim and it turns into a bad faith\ninsurance claim, a bad faith insurance attorney can help you actually obtain\ncompensation at an amount higher than the original face value of your policy.\nIf you have a bad faith insurance claim case, your insurer may be required to\npay damages far beyond what’s listed on your insurance claim. You can actually\nrecover three times your actual damages (known as “treble damages”) if you can\nprove the insurer “knowingly” violated Chapter 541 of the Texas Insurance\nCode.\n\nFor example, in addition to paying the full cost of damages to your property,\nan insurer may be required to pay for the following:\n\n  * Statutory Penalties\n  * Statutory Interest\n  * Liability for Judgments in Excess of Policy Limits\n  * Attorneys Fees\n  * Emotional Distress\n  * Economic Loss\n  * Punitive Damages\n\nSpecifically in Texas, the following damages are available in a bad faith\nlawsuit:\n\n  * The amount of actual damages\n  * Court costs and reasonable attorneys’ fees\n  * Any other relief the court deems proper\n\nThere’s one thing in common across all bad faith insurance claims: the more\nreprehensible an insurer acts, the greater the damages possible for the\npolicyholder. The worse your insurance company treats you, the more\ncompensation you can win in bad faith litigation.\n\n## Get Help From a Houston Bad Faith Insurance Lawyer\n\nWhen you or your business have carefully selected insurance coverage to suit\nyour specific circumstances and faithfully paid your premiums, you don’t\nexpect to find a lack of coverage – especially at a time when you probably\nneed it the most. When your insurance company denies your insurance claim with\nlittle or no explanation, unreasonably delays paying, or offers only a\npittance compared to what you have coming, you need experienced legal help\nfrom a Houston bad faith insurance lawyer.\n\nAt Feldman & Feldman, we take great pride in helping victims. Policyholders\nthat regularly pay their premiums deserve full protection under their\npolicies. If your insurance company is acting evasively, offering you much\nless than you anticipated, or flat out denying your claim, don’t wait to call\nus. We can analyze your situation, provide accurate estimates of damages and\nlosses, and pursue your rightful compensation. Contact Feldman & Feldman today\nto schedule a consultation to discuss your case.\n\n* * *\n\n## FAQs: Bad Faith Insurance Claims\n\n#### Is bad faith the same as negligence?\n\nThese terms both refer to a party not fulfilling contractual obligations.\nHowever, for a party to act in bad faith, they have to knowingly or\nmaliciously refuse to fulfill a contractual obligation. In situations of\nnegligence, the party may be unaware that they are not adequately fulfilling\ntheir contractual obligations. ** **\n\n#### Can I sue an insurance company for bad faith?\n\nYes. If you believe an insurance company is purposely not fulfilling their\nobligation to you, such as failing to pay you for a claim, you can file a\nlawsuit against them. A bad faith attorney can help you pursue legal action\nagainst the insurance company and possibly enable you to receive greater\ncompensation than you were originally seeking due to statutory penalties and\nother additional available damages. ** **\n\n#### How is bad faith committed?\n\nThere are a few different ways that insurance companies will commit bad faith.\nSome examples include failing to properly investigate a claim, purposely\ndelaying the claims process, denying benefits clearly stated on the insurance\npolicy, offering less money than a claim is worth, and other dishonest\ntactics. ** **\n\n#### What constitutes a bad faith insurance claim?\n\nWhen an insurance company fails to promptly reply to a policyholder’s claim,\nit is considered to be acting in bad faith. This can come in the form of\nfailure to pay out on a claim, refusing to reply to the policyholder when they\nattempt to contact the insurance company regarding their claim, and other bad\nfaith tactics.\n\n#### How do I prove I have a bad faith insurance case?\n\nThese cases can be difficult to prove, which is why you need the help of\nexperienced bad faith attorneys. Feldman & Feldman can review the facts of\nyour situation and determine whether the insurance company acted in bad faith.\nIf so, we can help you get the compensation you deserve. ** **\n\n#### Can a third party sue for bad faith?\n\nIn some cases, a third party may have reason to sue an insurance company for\nbad faith. This is only possible in certain situations and the details are\ncomplicated. Consult with a bad faith attorney to determine whether or not you\nhave the right to sue.\n\n#### What is the statute of limitations for bad faith in Texas?\n\nIn the state of Texas, you have two years from the date of the bad act to file\na lawsuit. In some cases, you may get an additional 180 days with proof that\nthe insurance company influenced you in some way to refrain from filing a\nlawsuit.\n\n#### What are examples of a bad faith insurance claim?\n\n  * Your claim is denied with no reasonable explanation.\n  * The amount paid for your claim was much less than what it was worth.\n  * The insurance company took an unreasonable amount of time to pay your claim.\n  * The insurance company purposely delayed the processing of your claim. ** **\n\n#### How do you file a bad faith insurance claim in Texas?\n\nThe best way to file a bad faith insurance claim in Texas is to contact a\nfirst party insurance coverage attorney. Feldman & Feldman can help you file\nyour claim and handle every step of the process until you get compensation. **\n**\n\n#### How do you win a bad faith insurance claim?\n\nA key element in winning a bad faith insurance claim is hiring an experienced\ninsurance attorney. You need someone who has a thorough understanding of the\nlaw surrounding insurance claims and bad faith tactics. The trial attorneys of\nFeldman & Feldman have been representing clients in bad faith insurance cases\nfor decades, helping them get justice against insurance companies.\n\nPractice Areas\n\n  * Houston Clergy Sexual Abuse Lawyer\n  * Houston Construction Lawyer\n  * Houston Bad Faith Insurance Lawyers\n  * Houston Fiduciary Lawyers\n  * Houston Appellate Lawyer\n  * Houston Business Litigation Attorneys\n  * Houston Contract Lawyer\n  * Texas Education Lawyers\n  * Houston Employment Lawyers\n  * Houston Business Fraud Lawyer\n  * Texas Municipal Lawyers\n  * Houston Business Partnership Dispute Lawyers\n  * Election Campaign and Political Law Attorneys\n  * Houston Real Estate Attorneys\n\n\"*\" indicates required fields\n\n###  Contact Us\n\nWe take each case as a distinct story impacting the lives of our clients.\n\nName*\n\nPhone*\n\nEmail*\n\nMatter Type*\n\nSelect matter type *Bad Faith InsuranceBreach of Fiduciary DutyCivil\nAppealsClergy Sexual AbuseCommercial LitigationContract Drafting, Negotiation,\nand ReviewEducationElection Campaign and Political\nLawEmploymentFraudGovernment EntitiesPartnership/Shareholder DisputesReal\nEstate and ConstructionWill and ProbateOther\n\nMessage*\n\nEmail\n\nThis field is for validation purposes and should be left unchanged.\n\nΔ\n\nConnect Facebook LinkedIn Yelp\n\nMonday| 8:30 AM - 5:30 PM  \n---|---  \nTuesday| 8:30 AM - 5:30 PM  \nWednesday| 8:30 AM - 5:30 PM  \nThursday| 8:30 AM - 5:30 PM  \nFriday| 8:30 AM - 5:30 PM  \nSaturday| Closed  \nSunday| Closed  \n  \n3355 W Alabama St #1220, Houston, TX 77098  \n\np 713-986-9471 f 713-986-9472\n\ninfo@feldman.law\n\n  * About Us\n  * Practice Areas\n  * News\n  * Contact Us\n  * Site Map\n\n© 2023 Feldman & Feldman, PC.\n\nPrivacy Policy | Disclaimer\n\n",
    "links": "[{\"link\": \"https://feldman.law/\", \"text\": \"Civil Litigation\"}, {\"link\": \"https://feldman.law/practice-areas/bad-faith-insurance-claims/\", \"text\": \"Houston Bad Faith Insurance Lawyers\"}]",
    "priceAndPlans": "Skip to content\n\n## Feldman & Feldman\n\n## Civil Litigation Law Firm\n\n  * About Us\n    * Notable Cases\n    * Cris Feldman\n    * David Feldman\n    * Gordon Hall\n    * Derek Bauman\n    * Fernando De Leon\n    * Shannon Almes\n    * Kimberly Dang\n    * Lara Hall\n  * Commercial Litigation\n    * Breach of Contract\n    * Breach of Fiduciary\n    * Business Fraud\n    * Business Partnership Disputes\n    * Insurance Disputes\n  * Business Law\n    * Franchise Law\n    * Business Contracts\n    * Oil & Gas\n    * Real Estate\n    * Construction Law\n  * Civil Litigation\n    * Appellate Law\n    * Clergy Sexual Abuse\n    * Education Law\n    * Municipal Law\n  * Employment\n    * Discrimination & Harassment\n    * Sexual Harassment\n    * Overtime\n    * Wage and Hour\n    * Wrongful Termination\n  * News\n  * Contact Us\n\n# How Title Insurance Works\n\nPosted on July 9, 2018September 22, 2023\n\nIf you want to buy a house, you’re going to need title insurance, but very few\nhomeowners know what title insurance is or how it works. This is a shame\nbecause while title insurance is very rarely needed, it can protect homeowners\nfrom huge financial losses.\n\n### **What Is Title Insurance?**\n\nAnytime an individual decides to buy or refinance a house, they will have to\nget title insurance. Title insurance is a type of insurance that protects\nbuyers and lenders from financial loss if ownership of the property or title\nis challenged. Title insurance was created over one hundred years ago when\ndishonest individuals would sell property they didn’t actually own. With the\nrise of the Internet, determining whether or not a seller actually holds the\ntitle to the property is much easier, but unfortunately, not foolproof.\nAlthough every homeowner will purchase title insurance, very few are actually\naware of their rights if they need to submit a claim.\n\n#### **The Rising Cost Of Title Insurance and Bad Faith Claims**\n\nYou would think that because technology has made searching for information\nabout property titles easier that title insurance would become less expensive.\nHowever, prices for title insurance are actually increasing. One of the\nlargest title insurance companies, First American, has actually doubled its\nprices over the past decade. This is easy for title insurance companies to do,\nbecause most states have laws in place preventing other insurance companies\nfrom offering title insurance. This means the title insurance market is small\nand faces little competition. In total, title insurance is an $18 billion\nindustry.\n\nNot only are the costs of title insurance rising, but many policyholders are\nalso discovering the hard way that title insurance companies often use bad\nfaith tactics to avoid paying out on claims. Like any other type of insurance,\na title insurance company’s first objective is to make money, and some\ncompanies take this objective too far by wrongfully denying valid claims.\nUnfortunately, many policyholders are completely unaware of their rights and\naccept the claim denial at face value.\n\n## **Get Help With You Title Insurance Claim**\n\nBuying any type of property is a huge investment, so before you sign on the\ndotted line, it’s important to make sure all related contracts are fair. At\nFeldman & Feldman, we can review title insurance policies to make sure they\nprovide proper coverage. If property has already been purchased, we can help\nwith any title insurance disputes. Call us today to schedule an appointment to\nlearn how we can help.\n\nPosted in Real Estate\n\n## Post navigation\n\nPrevious: Why Sexual Assault Victims Should File A Civil Lawsuit\n\nNext: Feldman & Feldman File Lawsuit On Behalf Of San Antonio Firefighters\n\n## Categories\n\n  * Appellate\n  * Bad Faith Insurance\n  * Business Law\n    * Business Contracts\n    * Business Fraud\n    * Commercial Litigation\n    * Franchise Law\n    * Oil and Gas\n  * Civil Law\n  * Construction Law\n  * Educational Entities\n  * Election Law\n  * Employment Litigation\n  * Feldman & Feldman\n  * Fiduciary Duty\n  * Media Coverage\n  * Public Law\n  * Real Estate\n  * Sexual Assault\n\n\"*\" indicates required fields\n\n###  Contact Us\n\nWe take each case as a distinct story impacting the lives of our clients.\n\nName*\n\nPhone*\n\nEmail*\n\nMatter Type*\n\nSelect matter type *Bad Faith InsuranceBreach of Fiduciary DutyCivil\nAppealsClergy Sexual AbuseCommercial LitigationContract Drafting, Negotiation,\nand ReviewEducationElection Campaign and Political\nLawEmploymentFraudGovernment EntitiesPartnership/Shareholder DisputesReal\nEstate and ConstructionWill and ProbateOther\n\nMessage*\n\nName\n\nThis field is for validation purposes and should be left unchanged.\n\nΔ\n\nConnect Facebook LinkedIn Yelp\n\nMonday| 8:30 AM - 5:30 PM  \n---|---  \nTuesday| 8:30 AM - 5:30 PM  \nWednesday| 8:30 AM - 5:30 PM  \nThursday| 8:30 AM - 5:30 PM  \nFriday| 8:30 AM - 5:30 PM  \nSaturday| Closed  \nSunday| Closed  \n  \n3355 W Alabama St #1220, Houston, TX 77098  \n\np 713-986-9471 f 713-986-9472\n\ninfo@feldman.law\n\n  * About Us\n  * Practice Areas\n  * News\n  * Contact Us\n  * Site Map\n\n© 2023 Feldman & Feldman, PC.\n\nPrivacy Policy | Disclaimer\n\n"
}