{
    "summary": "  * Home\n  * About\n    * Back\n    * Our Mission\n    * Staff\n    * Board\n    * Supporters\n    * Recognition\n    * Work with UP\n    * Volunteer with UP\n    * Contact UP\n  * Media\n    * Back\n    * UPdates\n      * Back\n      * UP in the News\n      * Tip of the Month\n      * Bach Talk\n      * Guest Blogs\n      * Catch UP\n      * Print News\n      * eNews\n    * Surveys\n    * Studies & Reports\n    * Share your story with the media\n  * Recovery Help\n    * Back\n    * Roadmap to Recovery®\n    * Disaster Recovery Help\n    * Claim Guidance Library\n    * State by State Help\n    * Sample Letters and Claim Documents\n    * Professional “Find Help” Directory\n    * Ask An Expert\n  * Get Prepared\n    * Back\n    * Roadmap to Preparedness\n    * Buying Tips Library\n    * WRAP Resource Center – Wildfire Mitigation Help\n    * Dropped by your home Insurer?\n    * Wise UP\n  * Advocacy\n    * Back\n    * How We Advocate\n    * Amicus Library\n    * Legislation\n    * Regulation\n    * UP at the NAIC\n  * Events\n    * Back\n    * Program Events\n    * Fundraising Events\n      * Back\n      * Online Auction\n  * Community\n    * Back\n    * Ask An Expert\n    * Forums\n  * Support UP\n\n  * Log In \n  * Ask An Expert\n  * Forums\n\nSearch for:\n\n  * Home\n  * About\n    * Our Mission\n    * Staff\n    * Board\n    * Supporters\n    * Recognition\n    * Work with UP\n    * Volunteer with UP\n    * Contact UP\n  * Media\n    * UPdates\n      * UP in the News\n      * Tip of the Month\n      * Bach Talk\n      * Guest Blogs\n      * Catch UP\n      * Print News\n      * eNews\n    * Surveys\n    * Studies & Reports\n    * Share your story with the media\n  * Recovery Help\n    * Roadmap to Recovery®\n    * Disaster Recovery Help\n    * Claim Guidance Library\n    * State by State Help\n    * Sample Letters and Claim Documents\n    * Professional “Find Help” Directory\n    * Ask An Expert\n  * Get Prepared\n    * Roadmap to Preparedness\n    * Buying Tips Library\n    * WRAP Resource Center – Wildfire Mitigation Help\n    * Dropped by your home Insurer?\n    * Wise UP\n  * Advocacy\n    * How We Advocate\n    * Amicus Library\n    * Legislation\n    * Regulation\n    * UP at the NAIC\n  * Events\n    * Program Events\n    * Fundraising Events\n      * Online Auction\n  * Community\n    * Ask An Expert\n    * Forums\n  * Support UP\n\n  *   * \n\n# Claim Guidance Library\n\n  * Browse:\n  * Home\n  * Claim Guidance\n  * Hiring an Attorney for an Insurance Claim\n\n  * Annuities\n  * Auto\n  * Business\n  * Disability\n  * Earthquake\n  * Fire\n  * Flood\n  * General\n  * Green\n  * Hail\n  * Hurricane\n  * Life\n  * Long Term Care\n  * Mold\n  * Renters\n  * Title\n  * Travel\n  * Water Damage\n  * Windstorm\n\n  * __ Share\n\n    * __\n    * __\n    * __\n\n  * __ Print\n  * __ PDF\n\nRoadmap to Recovery __\n\nTaking Care of Yourself Along the Way\n\nGetting help if/when you need it\n\nWorking with Your Mortgage Company\n\n# Hiring an Attorney for an Insurance Claim\n\nYou’ve suffered a major loss from fire, theft, or some other calamity and\nyou’ve filed an insurance claim. You’re not sure what your rights are, and\nyou’re worried about trusting your insurance company. You should be. Your\nfinancial interests and your insurance company’s financial interests are in a\nnatural conflict – You want a maximum payout, your insurer a minimum. An\ninsurance claim is a business negotiation, pure and simple. So although you\npaid good money for coverage and good claim service, you may have to fight for\nit. And you may need professional help in that fight. In an ideal world no one\nwould need to hire a lawyer to get an insurance claim paid on time and in\nfull, but in this world, many do.\n\nTo ensure a fair settlement of a large claim (in excess of $10,000), educate\nyourself by reading our Claim Tips and taking advantage of the resources that\nUnited Policyholders offers. And you must be a “squeaky wheel” and know when\nand how to get the right professional help if you need it. If you’re reading\nthis publication, you’re on the right track.\n\nDo you need professional help? Do you need a lawyer? Do you need a public\nadjuster? What is a public adjuster? Can you handle it on your own? The first\nthing you need before making these decisions is a complete copy of your\npolicy, including the “Declarations Page” and all “Endorsements” and “Riders”.\n\nYour Declarations Page is generally the first or second page of the policy. It\nstates the dollar limits applying to each category of coverage, and lists the\nendorsements and riders, (extras) that you have in addition to the basic\npolicy. Each such addition will be listed by a code number or letter, or\ncombination thereof. Review your basic coverage categories; Dwelling, Contents\n(Personal Property), and Loss of Use (sometimes called “Additional Living\nExpenses”.)\n\nQUESTIONS AND ANSWERS\n\nQ: I’ve filed a claim under my homeowners policy. I’ve met with adjusters from\nmy company.  A dispute has arisen. I’m getting frustrated. Do I need a lawyer?\n\nA: If you are communicating in writing and in person with your insurer with\nconfidence, polite assertiveness, and insistence on your rights and your\ninsurer is responding, keep going on your own. If you feel like you’ve “hit a\nwall”, are losing patience, feeling frustrated, angry or anxious, or are\nworried about time passing and/or losing your rights, a qualified attorney can\nhelp.   An attorney can help you get the respect and claim results you\ndeserve.  If the dispute is only relates to the extent or value of property\ndamage, and your insurer is cooperating in trying to resolve the dispute\ninformally – hiring an attorney may not be necessary.  If you live in a state\nthat licenses and regulates public adjusters and there are experienced and\nreputable ones available in your area, interview both lawyers and public\nadjusters before deciding which one would be best suited to resolve your\nparticular situation.\n\nQ: Once I hire an attorney, should I let them to do all the talking to my\ninsurer?\n\nA: Not necessarily. You can try having an attorney give you advice on your\nrights and continue to communicate with your insurer. If an aggressive\nattorney contacts your insurer early in the claims process, it may aggravate\nand prolong a dispute that you might have resolved yourself. However, if\nyou’ve given it your best shot and the insurance company won’t treat you\nfairly; let a professional take over on your behalf. Once the insurance\ncompany has dug in its heels and you’ve hired an attorney, let the attorney\ncommunicate with the insurance company. Most attorneys will insist on this and\nit’s for your own protection.\n\nQ: Can I hire my family lawyer to represent me…the one who did my will last\nyear?\n\nA: You can, but you shouldn’t. Your lawyer should be experienced in\nrepresenting policyholders (people like you) in insurance coverage or bad\nfaith litigation. Insurance companies generally hire very experienced\ninsurance defense counsel to represent them and yours should be a worthy\nadversary. Insurance companies will assess the risk of not settling with you\nby considering the strength of your representative.\n\nQ: How can I find the right lawyer?\n\nA: Be an astute consumer; get referrals from friends, family members, or\nreputable attorneys who have personal contacts with an insurance specialist.\nGo to the “Find Help” section and click on your state to find professionals\nwho specialize in representing policyholders and who support United\nPolicyholders’ work. Interview potential candidates about their insurance\nexpertise and trial experience and get references from former clients. Check\nreferences. A lawsuit is a major undertaking but may be the most effective way\nto fairly resolve a major claim. The attorney you select should have your\nutmost confidence…and deserve it!\n\nQ: Do I have to sue my insurance company to get what I am entitled to under my\npolicy?\n\nA: Absolutely not. On most small dollar claims, your insurer will pay your\nclaim with little fuss and bother. Basic negotiating will resolve most\ninsurance disputes. There are laws and regulations in most states that make it\nillegal for insurance companies to force consumers to file suit to recover\ntheir policy benefits.\n\nQ: What are the alternatives to litigation?\n\nA: Mediation, Arbitration, Appraisal are three of the most popular\nalternatives to litigation.\n\nIn  **MEDIATION** , the parties work with a third party to negotiate a\nresolution of their dispute in an informal, voluntary process.\n\nAn  **ARBITRATION**  may be binding or non-binding, and is more formal than a\nmediation. The arbitrator may dictate the result, or simply work with the\nparties to reach a result.\n\n**APPRAISAL**  is a procedure that can be used to resolve a dispute over the\namount of an insured loss. It has no relation to real estate appraisals. It\ncan be fast and economical or slow and expensive, depending on the appraisers\nand umpire selected by both sides.\n\nQ: How do I find a mediator or arbitrator?\n\nA: Look in your phone book under “Mediation Services” or “Attorneys –\nMediators”. Word of mouth.\n\nQ: If I do hire a lawyer, what will it cost?\n\nA: You can pay by the hour, or enter into a “Contingency Fee Agreement.”\n\nQ: What is a “Contingency Fee Agreement?\n\nA: Many policyholders in dispute with their insurer cannot afford to pay a\nlawyer by the hour. Most lawyers who represent policyholders in disputes with\ninsurers will work under contingent fee agreements. Under such agreements, the\nattorney is only paid if the client recovers money in a lawsuit or settlement.\nThen, the lawyer takes a percentage of the recovery.\n\nIf a case settles before a case goes to trial, most attorneys set their\ncontingency fee at 33% of the recovery. If a case goes to trial, the range\nincreases to 33-40%.\n\nHere is a useful article on hiring an attorney for insurance claim help after\na disaster.\n\nQ: What do lawyers charge by the hour?\n\nA: Hourly fees for lawyers vary according to firm size, experience of the\nattorney, and geographic location. Consumers retaining a partner in a law firm\ncan expect to pay $200-$450 per hour.  Rates for law firm associates range\nfrom $125-$300 per hour. Consumers retaining a rural attorney in private\npractice can expect to pay lower hourly fees. If you have to sue your\ninsurance company, you’ll want your attorney on a contingent fee agreement or\nyour legal bills will add up very quickly.\n\nQ: Do I have to pay litigation costs on top of attorney fees?\n\nA: Some attorneys will advance litigation costs, but the client is generally\nultimately responsible for them. Whether you pay hourly or on a contingency,\nyou may have to pay costs, even if you lose your case. You can set a cost\nreserve in advance with your attorney, and request that he or she try to stay\nwithin that amount.\n\nQ: What do litigation costs run for an average case?\n\nA: That question cannot be answered with certainty. It depends on the facts of\nthe case, the location of witnesses, and the complexity of the dispute.\n\nQ: How long can I wait to hire an attorney?\n\nA: That depends on your circumstances, but the safest course is to consult\nwith an attorney at least a month before the one year anniversary of the event\nthat caused your loss. There are hard and fast rules called “statutes of\nlimitations” that cut off your right to sue when a certain amount of time has\npassed, and once that time passes – you can no longer file a lawsuit to right\na wrong.\n\nYou generally have a shorter time window to sue an agent or broker than an\ninsurer. Statutes of limitations are complicated and not to be taken lightly.\nDon’t wait too long to consult with or hire a lawyer or your options may be\nvery limited. And, if your insurer wants to examine you under oath, (EUO), or\nhave their lawyer question you, consult a qualified attorney before you\nproceed.\n\nQ: What recourse do I have if I am not satisfied with my attorney?\n\nA: A client has an absolute right to discharge their attorney at any time, and\nfor any reason. You may be liable to pay your attorney for the reasonable\nvalue of their time, and, if you fire them soon before the case settles or is\ntried, you may have to pay them extra. You can hire a second attorney, but\nmake sure you iron out the question of payments you may owe to the first\nattorney.\n\nThe State Bar of California has a Hotline to answer questions about attorneys.\nThey will also process a complaint against an attorney, and if appropriate,\nmay bring disciplinary proceedings.  The Hotline number is 1-800-843-9053. If\nyou’re outside California, check with the agency that licenses and regulates\nlawyers, every state has one.\n\n  * Home\n  * About\n  * Media\n  * Recovery Help\n  * Get Prepared\n  * Advocacy\n  * Events\n  * Community\n  * Support UP\n\n© 2023 United Policyholders The material on this site is for informational\npurposes only and is not a substitute for legal advice.\n\n  * Privacy Policy\n  * Terms of Use\n  * Contact UP\n  * Log In\n\nPowered by WordPress & Inti Foundation\n\n  * __\n  * __\n  * __\n  * __\n  * __\n\n__\n\nThis is part of the roadmap to recovery timeline. Navigation from the steps\nbelow for information dealing with your situation.\n\n",
    "links": "[{\"link\": \"https://www.twitter.com/share?url=https%3A%2F%2Ftinyurl.com%2Fy9rs2qss&text=Hiring+an+Attorney+for+an+Insurance+Claim&via=uphelp\", \"text\": \"\"}, {\"link\": \"https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Fuphelp.org%2Fclaim-guidance-publications%2Fhiring-an-attorney-for-an-insurance-claim%2F&t=Hiring+an+Attorney+for+an+Insurance+Claim\", \"text\": \"\"}, {\"link\": \"https://www.linkedin.com/cws/share?url=https%3A%2F%2Fuphelp.org%2Fclaim-guidance-publications%2Fhiring-an-attorney-for-an-insurance-claim%2F\", \"text\": \"\"}, {\"link\": \"https://uphelp.org/claim-guidance-publications/hiring-an-attorney-for-an-insurance-claim/?print=print\", \"text\": \"\"}, {\"link\": \"https://uphelp.org/claim-guidance-publications/hiring-an-attorney-for-an-insurance-claim/?print=pdf\", \"text\": \"\"}]"
}