{
    "summary": "Log InSign Up\n\nin\n\nSearch\n\n  * Find a Lawyer\n  * Ask a Lawyer \n  * Research the Law\n  * Law Schools\n  * Laws & Regs\n  * Newsletters\n  * Marketing Solutions\n\n    * Justia Connect\n    * Pro Membership\n    * Basic Membership\n\n    * Justia Lawyer Directory\n    * Platinum Placements\n    * Gold Placements\n\n    * Justia Elevate\n    * SEO\n    * Websites\n    * Blogs\n\n    * Justia Amplify\n    * PPC Management\n    * Google Business Profile\n    * Social Media\n\n    * Justia Onward Blog\n\nJustia Lawyer Directory Insurance Claims Texas Attorneys\n\n# Texas Insurance Claims Lawyers\n\n**Browse By** CitiesCounties\n\n**Find **Texas Insurance Claims** Lawyers by City**\n\n  * Austin\n  * Dallas\n  * El Paso\n  * Fort Worth\n  * Houston\n  * San Antonio\n\n  * Abilene\n  * Amarillo\n  * Arlington\n  * Beaumont\n  * Brownsville\n  * Conroe\n  * Corpus Christi\n  * Denton\n  * Edinburg\n  * Garland\n  * Grand Prairie\n  * Humble\n  * Irving\n  * Katy\n  * Killeen\n  * Laredo\n  * Lubbock\n  * McAllen\n  * McKinney\n  * Mesquite\n  * Midland\n  * Mission\n  * Odessa\n  * Pasadena\n  * Plano\n  * Round Rock\n  * Spring\n  * Sugar Land\n  * Tyler\n  * Waco\n\nShow More Cities »\n\n**Find **Texas Insurance Claims** Lawyers by County**\n\n  * Bexar County\n  * Collin County\n  * Dallas County\n  * Harris County\n  * Tarrant County\n  * Travis County\n\n  * Bell County\n  * Brazoria County\n  * Cameron County\n  * Denton County\n  * El Paso County\n  * Fort Bend County\n  * Galveston County\n  * Hidalgo County\n  * Lubbock County\n  * Montgomery County\n  * Nueces County\n  * Williamson County\n\nShow More Counties »\n\nServices\n\n** Services **\n\nBad Faith Insurance  Business Insurance  Disability Insurance  Health\nInsurance  Life Insurance  Motor Vehicle Insurance  Property Insurance\n\nLawyer Rating\n\n** Lawyer Rating **\n\n9+  7+\n\nVideo Conferencing\n\n**Video Conferencing **\n\nOffers Video Conferencing\n\nFree Consultation & Fees\n\n**Free Consultation & Fees  **\n\nOffers Free Consultation  Accepts Credit Cards\n\nMore Filters\n\n**More Filters **\n\n**Languages**\n\nSpanish  Arabic  Chinese  French  German  Italian  Japanese  Korean  Russian\nClear\n\n**Experience**\n\n20+ years  10+ years  5+ years  Clear\n\n**Profile Includes** Attorney Photo  Awards  Certifications  Claimed Profiles\nProf. Associations  Publications  Videos  Website\n\nClear Filters\n\nShow More Filters\n\nSponsored Listings\n\nPREMIUM\n\n** Mark Steven Humphreys  **\n\nInsurance Claims Lawyer Serving Texas\n\n  * (972) 263-3722\n  * Free Consultation\n\nGrand Prairie, TX Insurance Claims Lawyer with 29 years of experience\n\nI tell you what you need to hear - not what you want to hear. Law has been a\nsecond career for me. I grew up and lived in and worked in the \"real world\"\nbefore becoming an attorney. My parents died when I was seven and... **Read\nMore »**\n\nView Profile\n\n**Free Consultation**\n\nView Website View Profile Call Email Lawyer Email Lawyer\n\nCompare Save\n\nClaimed Lawyer ProfileQ&ASocial Media\n\n** James Michael Moore  **\n\n**10.0**   (1 Peer Review)\n\n**(956) 631-0745 ** 4900 N 10th St  \nSuite F3  \nMcAllen, TX 78504\n\nMcAllen, TX Insurance Claims Lawyer with 32 years of experience  \nInsurance Claims and Personal Injury  \nMichigan State University\n\nShow Preview\n\nView Website View Lawyer Profile Email Lawyer\n\nWith over 25 years of litigation experience, I have committed my practice,\nMoore Law Firm, in helping not only the people within my Rio Grande Valley\ncommunity but across the entire State of Texas. My law firm stands on the\nprinciple that everyone should have access to quality representation in our\nTexas courts.  \n  \nTo all prospective clients of Moore Law Firm, I personally look forward to\npartnering with you on your legal matter.  \n  \nLegal Career:  \n  \nAdmitted to the Texas State Bar in 1991; Licensed to practice in Texas State\ncourts, admitted to the bar of various Federal District Courts. 1991 – 1994:\nAssociate...\n\nCompare Save\n\nClaimed Lawyer ProfileOffers Video ConferencingQ&ABlawg SearchSocial Media\n\n** Gregory S Baumgartner  **\n\n**10.0**   (1 Peer Review)\n\n**(281) 587-1111 ** 6711 Cypress Creek Pkwy  \nHouston, TX 77069\n\nFree ConsultationOffers Video ConferencingVideo ConfHouston, TX Insurance\nClaims Lawyer with 40 years of experience  \nInsurance Claims, Maritime, Personal Injury and Products Liability  \nUniversity of Nebraska-Lincoln College of Law\n\nShow Preview\n\nView Website View Lawyer Profile Email Lawyer\n\nPreeminent rated Houston Personal Injury lawyer helping the seriously injured\nfor over three decades. Our law practice limited to severe injury and wrongful\ndeath from 18-wheeler crashes, car accidents, bar negligence, and daycare\ninjury claims. We have a client-first approach and strictly limit new cases in\norder to provide the very best service for your case! Protecting the financial\nfuture of Texas families after an accident for over 35 years! Never a charge\nfor an initial injury accident consultation. Proudly honoring professional\nreferrals.\n\nCompare Save\n\nClaimed Lawyer ProfileQ&ALII GoldBlawg SearchSocial Media\n\n** Mark Steven Humphreys  **\n\nGrand Prairie, TX Insurance Claims Lawyer with 29 years of experience\n\n**(972) 263-3722 ** 702 Dalworth St  \nGrand Prairie, TX 75050\n\nFree ConsultationInsurance Claims  \nTexas Wesleyan University School of Law - Texas Wesleyan University\n\nShow Preview\n\nView Website View Lawyer Profile Email Lawyer\n\nI tell you what you need to hear - not what you want to hear. Law has been a\nsecond career for me. I grew up and lived in and worked in the \"real world\"\nbefore becoming an attorney. My parents died when I was seven and grew up with\nfinancially poor relatives. My first jobs were in construction and then the\ntrucking industry. I do not take money from people unless I am very\ncomfortable that something good can be done for them. Over 95% of my cases are\nhandled on a contingency fee basis. This means I believe...\n\nCompare Save\n\nClaimed Lawyer ProfileBlawg SearchSocial Media\n\n** Eric Reyes  **\n\nBedford, TX Insurance Claims Lawyer with 35 years of experience\n\n**(817) 332-1522 ** 312 Harwood Rd  \nBedford, TX 76021\n\nFree ConsultationInsurance Claims, Nursing Home, Personal Injury and Workers'\nComp  \nUniversity of Houston - Main Campus\n\nShow Preview\n\nView Website View Lawyer Profile Email Lawyer\n\nEric Reyes has been practicing law in Texas since 1988. He is Board Certified\nin Personal Injury Trial Law by the Texas Board of Legal Specialization. Only\n3% of all attorneys licensed to practice law in Texas are Board Certified in\nPersonal Injury Trial Law. Additionally, Eric Reyes was selected in 2015 by\nthe National Trial Lawyers Association as one of the \"Top 100 Trial Lawyers \"\nin Texas in the area of Civil Plaintiff Law. This is an honor extended to\nattorneys that exemplify superior qualifications, trial results, and\nleadership in their respective state. In...\n\nCompare Save\n\nClaimed Lawyer ProfileSocial Media\n\n** Aaron Alan Herbert  **\n\nDallas, TX Insurance Claims Attorney with 21 years of experience\n\n**(214) 200-4878 ** 8330 Lyndon B Johnson Fwy #700  \nDallas, TX 75043\n\nFree ConsultationInsurance Claims, Animal, Personal Injury and Products\nLiability  \n\nShow Preview\n\nView Website View Lawyer Profile Email Lawyer\n\nDallas Personal Injury Attorney Aaron A. Herbert is a specialist in personal\ninjury trial law and is proud to be one of less than 2% of personal injury\nattorneys in the State of Texas Board Certified in Personal Injury Trial Law\nby the Texas Board of Legal specialization. Hiring Dallas Personal Injury\nAttorney Aaron Herbert means hiring an attorney that has been certified by the\nTexas Board of Legal Specialization as an attorney that has substantial,\nrelevant experience in the area of Personal Injury law as well as\ndemonstrated, and tested, special competence in that area of law which\nfrequently...\n\nCompare Save\n\nClaimed Lawyer ProfileOffers Video ConferencingQ&ASocial Media\n\n** Ard Ardalan  **\n\n**10.0**   (1 Peer Review)\n\n**(512) 387-5062 ** 1211 W. 6th Street  \nSuite 600-122  \nAustin, TX 78703\n\nOffers Video ConferencingVideo ConfAustin, TX Insurance Claims Attorney  \nInsurance Claims, Personal Injury and Products Liability  \nUniversity of Texas - Austin\n\nShow Preview\n\nView Website View Lawyer Profile Email Lawyer\n\nArd Ardalan is a trial lawyer and has worked in litigation during his entire\nprofessional career. A proud graduate of the University of Texas School of\nLaw, he has represented hundreds of individuals against large corporations and\ninsurance companies. Ard founded Ardalan Law Firm PLLC in Austin, Texas to\nhelp injured Texans stand up to insurance giants and reckless corporations.\nOver his career he has helped recover millions for his clients. He is a\nzealous advocate, passionately dedicated to his cases and clients.\n\nCompare Save\n\nClaimed Lawyer ProfileOffers Video ConferencingQ&ASocial MediaResponsive Law\n\n** Jason Oxner  **\n\n**10.0**   (1 Peer Review)\n\n**(281) 930-5512 ** 16060 Dillard Drive  \nSuite 100  \nJersey Village, TX 77040\n\nOffers Video ConferencingVideo ConfJersey Village, TX Insurance Claims Lawyer\nwith 9 years of experience  \nInsurance Claims, Estate Planning, Personal Injury and Probate  \nSt. John's University School of Law and Texas Southern University Thurgood\nMarshall School of Law\n\nShow Preview\n\nView Website View Lawyer Profile Email Lawyer\n\nAttorney Jason Oxner primarily practices civil law, with a focus on Estate\nPlanning, Business Litigation and Transactions, Probate, and Civil Law.\nAttorney Jason Oxner graduated summa cum laude in the top 5% and currently\nholds a Law Degree and Masters of Law Degree. During law school, Jason was an\nassociate editor on Law Review, elected as Mr. Thurgood Marshall School of\nLaw, and taught Real Property for two years. Jason Oxner is a Canadian citizen\nwho moved to Massachusetts on an academic and athletic (hockey & rowing)\nscholarship at the Groton School in 2002. Jason continued with his rowing\ncareer at...\n\nCompare Save\n\nClaimed Lawyer ProfileOffers Video ConferencingQ&ASocial Media\n\n** Patrick Mason Dennis  **\n\nHouston, TX Insurance Claims Attorney with 19 years of experience\n\n**(713) 554-9076 ** 3401 Allen Parkway  \nSuite 100  \nHouston, TX 77019\n\nOffers Video ConferencingVideo ConfInsurance Claims, Maritime, Personal Injury\nand Workers' Comp  \nUniversity of Texas - Austin\n\nShow Preview\n\nView Website View Lawyer Profile Email Lawyer\n\nPatrick obtained a B.S. in Political Science at The University of Houston,\nwhere he graduated summa cum laude. At The University of Houston, Patrick was\nactive in the Spirit of Houston Marching Band and supporting Cougar Athletics.  \n  \nPatrick received his J.D. from The University of Texas School of Law, where he\ngraduated with Honors. Patrick practiced litigation at Vinson & Elkins in\nHouston for three years before joining Doyle LLP in 2007. Patrick was admitted\nto the Texas Bar in 2004 and the Arizona Bar in 2012.  \n  \nPatrick’s trial experience includes successfully serving as first chair trial\nattorney of a Jones Act/Maritime...\n\nCompare Save\n\nClaimed Lawyer ProfileQ&ASocial Media\n\n** Donivan Flowers  **\n\n**10.0**   (1 Peer Review)\n\n**(903) 965-2000 ** 310 South Vine Ave.  \nTyler, TX 75702\n\nFree ConsultationTyler, TX Insurance Claims Lawyer with 19 years of experience  \nInsurance Claims, Arbitration & Mediation and Personal Injury  \nUniversity of Houston - Main Campus\n\nShow Preview\n\nView Website View Lawyer Profile Email Lawyer\n\nMy firm proudly helps people throughout East Texas with various types of legal\nmatters. Our attorneys handle:  \n  \nPersonal Injury, Car Accidents, and Trucking Accidents  \n  \nFamily Law, Custody, and Divorce  \n  \nMediation and Arbitration  \n  \nWe offer flexible fees and reasonable cost legal services.  \n\nCompare Save\n\nClaimed Lawyer ProfileOffers Video ConferencingQ&ASocial Media\n\n** Doug Goyen  **\n\nAddison, TX Insurance Claims Attorney with 26 years of experience\n\n**(972) 599-4100 ** 15851 Dallas Pkwy  \n#605  \nAddison, TX 75001\n\nFree ConsultationOffers Video ConferencingVideo ConfInsurance Claims, Animal,\nPersonal Injury and Products Liability  \nSouthern Methodist University\n\nShow Preview\n\nView Website View Lawyer Profile Email Lawyer\n\nDallas personal injury lawyer licensed in Texas since 1997. Attorney Goyen\nprovides legal representation and services for those involved in car wrecks,\ntruck crashes, construction accidents, and other types of injury accidents in\nthe Dallas, Fort Worth, and North Texas areas. Client satisfaction is key to\nour success. We offer a free phone consultation and strategy session regarding\nyour case where get the facts of your case, identify the legal issues\ninvolved, and identify those legal issues that will most help your case. Doug\nGoyen graduated from Southern Methodist University School of Law in 1997. His\nundergraduate degree is in Business...\n\nCompare Save\n\nSponsored Listings\n\nPREMIUM\n\n** Adam Voyles  **\n\nInsurance Claims Lawyer Serving Texas\n\n  * (713) 284-5200\n  * Free Consultation\n\nHouston, TX Insurance Claims Lawyer with 26 years of experience\n\nUniversity of Houston - Main CampusTexas and New York\n\nView Profile\n\n**Free Consultation**\n\nView Website View Profile Call Email Lawyer Email Lawyer\n\nCompare Save\n\nClaimed Lawyer ProfileSocial Media\n\n** Michael Patrick Doyle  **\n\nHouston, TX Insurance Claims Lawyer with 33 years of experience\n\n**(888) 571-1001 ** 3401 Allen Parkway  \nSuite 100  \nHouston, TX 77019\n\nInsurance Claims, Health Care, Maritime and Personal Injury  \nUniversity of Texas - Austin\n\nShow Preview\n\nView Website View Lawyer Profile Email Lawyer\n\nMike’s trial practice includes the representation of plaintiffs in maritime\npersonal injury, international and trans-national personal injury, including\nwork and holiday injury claims, and insurance bad faith. Mike is Board\nCertified in Personal Injury Trial Law by the Texas Board of Legal\nSpecialization and is a Fellow in the National College of Advocacy of the\nAmerican Association for Justice. Mike has obtained many multi-million dollar\nverdicts, judgments, and settlements. Mike obtained a B.A. in History at the\nUniversity of Virginia and a J.D. from the University Of Texas School Of Law.\nMike has also completed coursework in marine insurance, international...\n\nCompare Save\n\nClaimed Lawyer ProfileQ&ASocial MediaResponsive Law\n\n** Grant Gerleman  **\n\nAddison, TX Insurance Claims Lawyer with 11 years of experience\n\n**(214) 891-3382 ** 15455 Dallas Parkway  \nSte 540  \nAddison, TX 75001\n\nFree ConsultationInsurance Claims, Personal Injury and Products Liability  \nUniversity of Arkansas - Fayetteville\n\nShow Preview\n\nView Website View Lawyer Profile Email Lawyer\n\nBoard Certified Personal Injury Attorney born and raised in Northeast Iowa and\npracticing out of Dallas, Texas. Veteran of 90 jury trials, million-dollar\nadvocate, and one of the winningest civil attorneys in the state of Texas for\nthe years of 2014, 2015, and 2016.\n\nCompare Save\n\nClaimed Lawyer ProfileSocial Media\n\n** Bill Lee Voss  **\n\nThe Woodlands, TX Insurance Claims Lawyer with 19 years of experience\n\n**(713) 861-0015 ** 26619 Interstate 45 South  \nThe Woodlands, TX 77380\n\nFree ConsultationInsurance Claims, Consumer and Real Estate  \n\nShow Preview\n\nView Blog View Lawyer Profile\n\nBill Voss and the attorneys at The Voss Law Firm, P.C. have expertise in areas\nof commercial and business insurance litigation, business claim law, insurance\nfraud litigation, residential claims, commercial claims, church claims,\napartment claims, and other first party insurance claims. If you need legal\nassistance and want results, contact The Voss Law Firm, P.C. toll free at\n866-276-6179.\n\nCompare Save\n\nClaimed Lawyer ProfileSocial Media\n\n** Wayne Wright  **\n\nSan Antonio, TX Insurance Claims Attorney with 45 years of experience\n\n**(800) 237-3334 ** 5707 W Interstate 10  \nSan Antonio, TX 78201\n\nFree ConsultationInsurance Claims, Personal Injury and Products Liability  \nNorthern Illinois University College of Law\n\nShow Preview\n\nView Website View Lawyer Profile Email Lawyer\n\nWayne Wright handles trucking and auto accident cases and other consumer\nrelated matters. Mr. Wright is licensed to practice law in eight states\n(Arizona, Illinois, Massachusetts, Oklahoma, Missouri, Nebraska, Tennessee,\nand Texas) plus the District of Columbia. Mr. Wright has been named as a Top\n100 Trial Lawyer by the National Trial Lawyers Association and is a life\nmember of both the Multi-Million Dollar Advocates Forum and the Million Dollar\nAdvocates Forum. Mr. Wright also serves as a leader in providing legal\nservices to pro bono programs and is a frequent speaker at lawyer CLE programs\nnationwide.\n\nCompare Save\n\nClaimed Lawyer ProfileSocial MediaResponsive Law\n\n** Ryan L. Thompson  **\n\n**10.0**   (6 Peer Reviews)\n\n**(214) 617-0227 ** 3300 Oak Lawn Ave.  \nSuite 300  \nDallas, TX 75219\n\nFree ConsultationDallas, TX Insurance Claims Attorney with 19 years of\nexperience  \nInsurance Claims, Nursing Home, Personal Injury and Products Liability  \nBaylor Law School\n\nShow Preview\n\nView Website View Lawyer Profile Email Lawyer\n\nRyan L. Thompson is the Founder and Managing Partner of Thompson Law LLP. Ryan\nfocuses on representing clients who have been wronged by the tortious acts of\nothers, including cases such as catastrophic personal injury, wrongful death,\nproducts liability, pharmaceutical and medical devices, and other injury-\nrelated actions. Ryan is highly skilled trial lawyer who aggressively\nadvocates on behalf of his clients who have been injured by another party’s\nnegligent or wrongful conduct. Thompson Law has recovered over $1.8 billion\nnet for its clients under Ryan’s leadership. Call today for a free\nconsultation. You only pay if we win your...\n\nCompare Save\n\nClaimed Lawyer ProfileOffers Video ConferencingQ&ASocial Media\n\n** Randy Sorrels  **\n\nHouston, TX Insurance Claims Attorney with 36 years of experience\n\n**(713) 496-1100 ** 5300 Memorial Dr., Ste. 270  \nHouston, TX 77007\n\nOffers Video ConferencingVideo ConfInsurance Claims, Medical Malpractice,\nPersonal Injury and Products Liability  \nSouth Texas College of Law\n\nShow Preview\n\nView Website View Lawyer Profile Email Lawyer\n\nRandy Sorrels holds the unique distinction of being the only Texas Board\nCertified Plaintiffs’ Lawyer ever to have been both elected to serve as\nPresident of the State Bar of Texas and selected as one of the Top 100 lawyers\nin the state by Texas Super Lawyers magazine. His passionate representation of\nclients and lawyers has garnered statewide recognition and numerous\nprestigious awards. In short, whether it is in the courtroom or in the\nboardroom, Randy has an unparalleled track record of success for his clients\nand the organizations he leads. As a leader, Randy was voted by Texas lawyers\nto...\n\nCompare Save\n\nClaimed Lawyer ProfileOffers Video ConferencingQ&ASocial MediaResponsive Law\n\n** Rahlita D. Thornton  **\n\n**10.0**   (3 Peer Reviews)\n\n**(713) 401-3998 ** 3730 Kirby Dr  \n#1200  \nHouston, TX 77098\n\nFree ConsultationOffers Video ConferencingVideo ConfHouston, TX Insurance\nClaims Attorney with 32 years of experience  \nInsurance Claims, Divorce, Family and Personal Injury  \nTexas Southern University Thurgood Marshall School of Law\n\nShow Preview\n\nView Website View Lawyer Profile Email Lawyer\n\nHouston FAMILY LAWYER and ACCIDENT LAWYER and Attorney Rahlita D. Thornton has\nbeen committed to personal attention to clients for almost 30 years dealing\nwith Family Law Matters, Divorce, Custody as well as Trucking Accidents, Car\nAccidents, Injury or Wrongful Death. The main goal is to obtain maximum\ncompensation after a personal injury occurs. Free consultations (713)\n401-3998. Ride-Share Accidents, Car Accidents, 18 wheeler truck accidents,\npersonal injury law, bus accidents, motorcycle accidents, pedestrian\naccidents, bicycle accidents, commercial vehicle accidents, distracted driving\naccidents, drunk driving accidents, fatality accidents involving catastrophic\ninjuries are among those handled. Attorney Rahlita...\n\nCompare Save\n\nClaimed Lawyer ProfileSocial Media\n\n** Robert Smead Hogan  **\n\nLubbock, TX Insurance Claims Lawyer with 27 years of experience\n\n**(806) 771-7900 ** 1210 Avenue R.  \nLubbock, TX 79401\n\nInsurance Claims, Appeals, Immigration and Personal Injury  \nTexas Tech University School of Law\n\nShow Preview\n\nView Website View Lawyer Profile Email Lawyer\n\nPracticing law in Lubbock over the last twenty years has allowed me to work\nfor some of the finest, most hard-working people. I have enjoyed having the\nchance to earn the respect and trust of my clients as we work for them. I have\nbeen privileged to handle personal injury cases, wrongful death cases, train\ncollisions, automobile collisions, truck wrecks, insurance claims, and the\nmany other types of cases in state and Federal courts.  \n  \nTogether with my outstanding staff members, we make it a priority to treat\neach client like the only client, and help navigate through the complicated\nlegal system....\n\nCompare Save\n\nClaimed Lawyer ProfileBlawg SearchSocial Media\n\n** Mr. Jonathan Sol Harris  **\n\nHouston, TX Insurance Claims Lawyer with 27 years of experience\n\n**(800) 282-2122 ** 3200 Travis Street  \n#300  \nHouston, TX 77006\n\nFree ConsultationInsurance Claims, Asbestos, Maritime and Medical Malpractice  \nSouth Texas College Of Law\n\nShow Preview\n\nView Website View Lawyer Profile Email Lawyer\n\nI have experience working both sides of the docket. I worked for an insurance\ncompany and gained inside knowledge on how the other side evaluates claims,\nand what make a strong case for plaintiffs. I specialize in auto, motorcycle,\nand trucking accidents. I am Board Certified in Personal Injury Trial Law by\nthe Texas Board of Legal Specialization, was selected as a Rising Star by\nTexas Monthly’s Super Lawyers Magazine, and am one of H Magazine’s Top Lawyers\nfor the People.\n\nCompare Save\n\nClaimed Lawyer ProfileSocial Media\n\n** Sean Timmons  **\n\nHouston, TX Insurance Claims Attorney with 14 years of experience\n\n**(832) 241-5888 ** 2925 Richmond Avenue  \n12th Floor  \nHouston, TX 77098\n\nInsurance Claims, Appeals, Military and Securities  \nSouth Texas College of Law\n\nShow Preview\n\nView Website View Lawyer Profile Email Lawyer\n\nSean’s years of experience as an active-duty US Army Captain in the selective\nand prestigious US Army Judge Advocate General’s (JAG) Corps are a valuable\nasset to Tully Rinckey PLLC’s military law practice group. Having served his\ncountry honorably at the largest military installation in the world in Fort\nHood, Texas as a Judge Advocate from 2009 until 2013, Sean is an aggressive\nand tenacious advocate for all service members facing legal issues. He is able\nto pull from his significant and diverse experience as an active-duty attorney\nin the Army JAG Corps, and as a civilian military law attorney,...\n\nCompare Save\n\nClaimed Lawyer ProfileOffers Video ConferencingSocial Media\n\n** Lindsey M. McKay  **\n\nDallas, TX Insurance Claims Lawyer with 15 years of experience\n\n**(214) 347-0620 ** 2101 Cedar Springs Rd  \nSte 1050  \nDallas, TX 75201\n\nFree ConsultationOffers Video ConferencingVideo ConfInsurance Claims, Personal\nInjury and Products Liability  \nTexas Wesleyan University School of Law - Texas Wesleyan University\n\nShow Preview\n\nView Website View Lawyer Profile Email Lawyer\n\nRaised and educated in Dallas, Texas, Attorney Lindsey McKay was an All-\nAmerican Cheerleader and notable scholarship candidate for a top women’s\ncollege soccer program. Prior to attending law school, Ms. McKay devoted\nherself to intellectual pursuits and travel while attending college at the\nUniversity of Colorado, Boulder. Ms. McKay graduated college in three years\nearning a Bachelor of Science degree in Economics and a minor in Spanish.\nDuring her college career, she lived with international families in\nCuernavaca, Mexico, and Costa Rica learning Spanish and immersing herself in\nthe Latin culture. Ms. McKay also lived in Southern Germany with a...\n\nCompare Save\n\nClaimed Lawyer ProfileSocial Media\n\n** Shane Kadlec  **\n\nHouston, TX Insurance Claims Lawyer with 27 years of experience\n\n**(281) 643-2000 ** 9575 Katy Freeway  \nSuite 200  \nHouston, TX 77024\n\nFree ConsultationInsurance Claims, Medical Malpractice, Personal Injury and\nProducts Liability  \nSouth Texas College of Law\n\nShow Preview\n\nView Website View Lawyer Profile Email Lawyer\n\nBoard Certified Personal Injury Lawyer. Shane Kadlec has successfully resolved\nthousands of cases for clients and litigated hundreds of lawsuits all over\nTexas. A lawyer you can speak with and trust with your important decision in\nhiring a lawyer you can depend on. Call to speak directly about your case and\nlearn how Shane Kadlec can help.\n\nCompare Save\n\nClaimed Lawyer ProfileOffers Video ConferencingSocial Media\n\n** Mike Regitz  **\n\n**10.0**   (1 Peer Review)\n\n**(214) 414-3815 ** 1700 Pacific Avenue  \nSuite 2610  \nDallas, TX 75201\n\nFree ConsultationOffers Video ConferencingVideo ConfDallas, TX Insurance\nClaims Attorney with 18 years of experience  \nInsurance Claims, IP, Patents and Trademarks  \nSouthern Methodist University\n\nShow Preview\n\nView Website View Lawyer Profile Email Lawyer\n\nRegitzMauck Mission: To provide value-based legal services to cost-conscious\nclients seeking high quality legal representation in intellectual property,\ncybersecurity, and data privacy matters and disputes.  \n  \nMike Regitz focuses his practice on intellectual property and technology\ndisputes, counseling, and licensing.  \n  \nAs a Certified Information Privacy Professional (CIPP/US), Mike also assists\nfirm clients with cybersecurity, data privacy, and cyber insurance coverage\nissues and disputes.  \n  \nMike is licensed to practice law in Texas and is admitted to various federal\ncourts across the country. He is also registered to practice before the U.S.\nPatent and Trademark Office, and his patent and trademark prosecution practice\nincludes...\n\nCompare Save\n\nClaimed Lawyer ProfileOffers Video ConferencingSocial MediaResponsive Law\n\n** Benjamin R. Roberts  **\n\nHouston, TX Insurance Claims Attorney\n\n**(713) 609-1898 ** 5252 Westchester St  \nSte 210  \nHouston, TX 77005\n\nFree ConsultationOffers Video ConferencingVideo ConfInsurance Claims,\nBusiness, Maritime and Personal Injury  \nSouth Texas College of Law\n\nShow Preview\n\nView Website View Lawyer Profile Email Lawyer\n\nMr. Roberts founded Benjamin Roberts Law, PLLC in 2018. He is a third-\ngeneration Texan and a native Houstonian. Since founding his firm, Mr. Roberts\nhas recovered millions of dollars on behalf of those injured as a result of\nanother’s negligence. Mr. Roberts takes special interest in battling insurance\ncompanies for fair and just results on behalf of his clients. Since 2015, Mr.\nRoberts Mr. Roberts been named a Rising Star by Super Lawyers, and in 2019 he\nwas inducted into the Million Dollar Advocates Forum for substantial\nsettlement achieved in product liability case. In addition, Mr. Roberts was\nselected by...\n\nCompare Save\n\nClaimed Lawyer ProfileSocial Media\n\n** Henrietta Nneka Ezeoke  **\n\nMissouri City, TX Insurance Claims Lawyer with 23 years of experience\n\n**(713) 234-0030 ** 7070 Knights CT, Suite 1104  \nMissouri City, TX 77459\n\nInsurance Claims and Personal Injury  \nSouth Texas College Of Law\n\nShow Preview\n\nView Website View Lawyer Profile Email Lawyer\n\nHenrietta Ezeoke is a Missouri City & Houston based personal injury lawyer\nwith a J.D from the Missouri City College of Law (Formerly South Texas College\nof Law) (2000). For more than 20 years, Henrietta has been representing\nindividuals recover compensations in personal injury cases. Many accident\nvictims are afraid and do not know who to turn to or who to trust. Henrietta\nlets her clients know they can trust her. She brings to her law practice moral\nstandards that stem from her strong christian background. She guides and\nrepresents her clients with integrity and compassion. She is passionate for\nher...\n\nCompare Save\n\nClaimed Lawyer ProfileQ&ASocial Media\n\n** Mark Oxford  **\n\nLeague City, TX Insurance Claims Attorney with 10 years of experience\n\n**(888) 413-3964 ** PO Box 751  \nLeague City, TX 77058\n\nInsurance Claims, Consumer, Family and Immigration  \nWestern Michigan University and Western Michigan University\n\nShow Preview\n\nView Website View Lawyer Profile Email Lawyer\n\nAttorney Mark Oxford, founder of the Oxford Law Firm, is licensed to practice\nlaw in California, Texas and Minnesota. At the firm, our mission is to provide\nthe highest quality legal representation to all of our clients. We handle all\ncases, no matter how small or large the business, corporation or legal\nproblem. We offer our legal service in English, Arabic language and Russian\nlanguage. Attorney Oxford, a former civilian employee of the United States\nDepartment of Defense, has J.D. degree in law with concentration on\nAdministrative Law, an M.A. degree in National Security and Counter-Terrorism,\nand an LL.M.degree...\n\nCompare Save\n\nClaimed Lawyer ProfileSocial Media\n\n** Jeffrey Raizner  **\n\nHouston, TX Insurance Claims Attorney with 31 years of experience\n\n**(844) 554-9099 ** 2402 Dunlavy St  \nHouston, TX 77006\n\nInsurance Claims, Maritime, Personal Injury and Products Liability  \nUniversity of Houston - Main Campus\n\nShow Preview\n\nView Website View Lawyer Profile Email Lawyer\n\nJeff Raizner is an extremely successful trial lawyer and negotiator. He has\nbeen named aSuper Lawyer every year since 2007, recognized for his continued\nsuccess in representing clients in claims against major insurers for both\ncommercial and residential losses, and against large corporations for\ncompensation in pharmaceutical and other mass tort claims as well as maritime\npersonal injury disputes. Mr. Raizner is a member and former director and\nExecutive Committee member of Texas Trial Lawyers Association, a past\npresident of Houston Trial Lawyers Association and a member of the American\nAssociation for Justice. His practice includes nationwide representation...\n\nCompare Save\n\nClaimed Lawyer ProfileOffers Video ConferencingQ&ASocial Media\n\n** Adrian Bower  **\n\n**10.0**   (5 Peer Reviews)\n\n**(214) 799-2142 ** 1910 Pacific Ave.  \nSuite 10700  \nDallas, TX 75201\n\nFree ConsultationOffers Video ConferencingVideo ConfDallas, TX Insurance\nClaims Lawyer with 11 years of experience  \nInsurance Claims, Business, Energy and Personal Injury  \nSt. Mary's University School of Law and Beihang University\n\nShow Preview\n\nView Website View Lawyer Profile Email Lawyer\n\nLitigation:  \nAdrian represents clients in adversarial proceedings covering civil, criminal,\nand administrative matters.  He has achieved favorable results in the form of\njury/bench verdicts and relief being granted at each of these levels,\nincluding on appeals.  Additionally, Adrian has been able to recover on\noffensive claims and defeat defensive claims simply by issuing letters, thus\ngenerating significant cost savings.  \n  \nEnergy:  \nAdrian cut his teeth in the oil and gas industry.  He takes personal pride in\nhaving built his client base by identifying and recovering unpaid (or stolen)\nroyalties.  Those successes have led to Adrian taking over leasing operations\nfor hundreds of thousands...\n\nCompare Save\n\nClaimed Lawyer ProfileSocial Media\n\n** Wade D. Moriarty  **\n\nHouston, TX Insurance Claims Attorney with 19 years of experience\n\n**(713) 807-7800 ** 4900 Travis Street  \nHouston, TX 77002\n\nFree ConsultationInsurance Claims, Consumer, Maritime and Personal Injury  \nSouth Texas College Of Law\n\nShow Preview\n\nView Website View Lawyer Profile Email Lawyer\n\nTrial lawyer for over 28 years. Senior Litigation Attorney at Law Offices of\nJavier Marcos. Personal Injury/Civil Trial\n\nCompare Save\n\nClaimed Lawyer ProfileOffers Video ConferencingSocial MediaResponsive Law\n\n** Kyle Lynn Mathis  **\n\n**10.0**   (2 Peer Reviews)\n\n**(682) 444-4444 ** 400 South Industrial Blvd.  \nEuless, TX 76040\n\nFree ConsultationOffers Video ConferencingVideo ConfEuless, TX Insurance\nClaims Lawyer with 10 years of experience  \nInsurance Claims and Personal Injury  \nUniversity of Alabama School of Law\n\nShow Preview\n\nView Website View Lawyer Profile Email Lawyer\n\nKyle Mathis is the Chief Operating Officer at McCormick Law Firm. He has\nsettled over $20 million worth of personal injury cases and is known for the\nvolume and complexity of cases he has settled over his career. Clients have\nreferred to Mr. Mathis as “professional and patient” and praised his ability\nto resolve cases in a timely manner. Prior to joining McCormick Law, Mr.\nMathis worked for a large firm based in San Antonio as both a manager and\nlitigation attorney. Mr. Mathis received his Juris Doctorate from the\nUniversity of Alabama School of Law in 2013, and also...\n\nCompare Save\n\nClaimed Lawyer ProfileSocial MediaResponsive Law\n\n** Mark Underwood  **\n\nMcKinney, TX Insurance Claims Attorney with 34 years of experience\n\n**(972) 535-6377 ** 2530 W White Avenue  \nSuite 200  \nMcKinney, TX 75071\n\nFree ConsultationInsurance Claims, Environmental, Personal Injury and Social\nSecurity Disability  \nPepperdine University School of Law\n\nShow Preview\n\nView Website View Lawyer Profile Email Lawyer\n\nMark Underwood is the owner of Underwood Law Office, Inc. He makes the world\nsafer by representing victims needlessly injured by others.  \n  \nHis cases have ranged from the catastrophic, including: (1) the 2010 Upper Big\nBranch coal mine explosion that killed 29 coal miners where he represented 11\nminers that suffered brain injuries; (2) the 2013 West TX Fertilizer Plant\nExplosion that killed 15 and injured 3300 where he represented 185 victims;\n(3) the 2014 Freedom Industries MCHM chemical spill that poisoned the water\nfor 300,000 people in Charleston, WV where he represented six of 14 class\nrepresentatives in the...\n\nCompare Save\n\nClaimed Lawyer ProfileBlawg SearchSocial Media\n\n** Lonnie Roach  **\n\n**10.0**   (2 Peer Reviews)\n\n**(512) 454-4000 ** 4100 Duval Rd, Bldg 1, # 200  \nAustin, TX 78759\n\nFree ConsultationAustin, TX Insurance Claims Attorney with 32 years of\nexperience  \nInsurance Claims, Appeals and Social Security Disability  \nUniversity of Texas - Austin\n\nShow Preview\n\nView Website View Lawyer Profile Email Lawyer\n\nLonnie Roach works aggressively to help clients who have been denied or lost\ntheir long term disability benefits, social security disability benefits\n(SSDI), ERISA appeals or insurance benefits. He assists clients in Austin, San\nAntonio, Houston, Dallas, Fort Worth, El Paso, Galveston, Corpus Christi and\nthroughout the state of Texas. Roach is an AV rated attorney pursuant to the\nMartindale-Hubbell Peer Review Ratings and has been successfully helping\npeople fight for their rights against big insurance companies and the\ngovernment since 1993. He was named to the prestigious Super Lawyers list of\nThomson Reuters in 2016. A...\n\nCompare Save\n\nClaimed Lawyer ProfileOffers Video ConferencingSocial Media\n\n** Sarnie Randle Jr  **\n\nHouston, TX Insurance Claims Attorney with 48 years of experience\n\n**(713) 626-8600 ** 5177 Richmond Ave, Suite 635  \nHouston, TX 77056\n\nOffers Video ConferencingVideo ConfInsurance Claims, Medical Malpractice,\nNursing Home and Personal Injury  \nUniversity of Houston - Main Campus\n\nShow Preview\n\nView Website View Lawyer Profile Email Lawyer\n\nSarnie Randle has been an attorney since 1975 and board certified in Personal\nInjury Trial Law since 1984. He is highly regarded as a competent trial lawyer\nwith over 35 years experience representing injured victims in personal injury\nclaims such as auto accidents, truck accidents, motorcycle accidents, wrongful\ndeaths, pedestrian accidents, dog bites, slip-n-falls, construction accidents,\nmedical malpractice, nursing home abuse\\negligence, premises liabilities,\nproducts liabilities, breach of contract and deceptive trade practices. Sarnie\nRandle is committed to fighting for the rights of individuals and their\nfamilies who have suffered injuries and wrongful deaths due to the negligent\nconduct of...\n\nCompare Save\n\nClaimed Lawyer ProfileBlawg SearchSocial Media\n\n** Bill Berenson  **\n\nFort Worth, TX Insurance Claims Lawyer with 43 years of experience\n\n**(888) 801-8585 ** 1701 River Run  \n#900  \nFort Worth, TX 76107\n\nFree ConsultationInsurance Claims and Personal Injury  \nSMU Dedman School of Law\n\nView Website View Lawyer Profile Email Lawyer\n\nCompare Save\n\nClaimed Lawyer ProfileSocial Media\n\n** Lloyd Edward Bemis III  **\n\n**10.0**   (2 Peer Reviews)\n\n**(512) 454-4000 ** 4100 Duval Rd, Bldg 1, # 200  \nAustin, TX 78759\n\nFree ConsultationAustin, TX Insurance Claims Attorney with 39 years of\nexperience  \nInsurance Claims and Social Security Disability  \nUniversity of Texas - Austin\n\nShow Preview\n\nView Website View Lawyer Profile Email Lawyer\n\nLloyd Bemis is an Austin, Texas social security and disability attorney\ndedicated to helping clients who have been denied or lost their long term\ndisability benefits, social security disability benefits (SSDI), ERISA appeals\nor insurance benefits. He assists clients in Austin, San Antonio, Houston,\nDallas, El Paso, and throughout the state of Texas. Bemis is an AV rated\nattorney pursuant to the Martindale-Hubbell Peer Review Ratings, and has been\nsuccessfully helping people fight for their rights against big insurance\ncompanies and the government since 1993. Mr. Bemis grew up in Austin, Texas\nand graduated with highest honors from the...\n\nCompare Save\n\nClaimed Lawyer ProfileOffers Video ConferencingSocial Media\n\n** Jason Aron Itkin  **\n\nHouston, TX Insurance Claims Lawyer with 22 years of experience\n\n**(888) 493-1629 ** 6009 Memorial Drive  \nHouston, TX 77007\n\nFree ConsultationOffers Video ConferencingVideo ConfInsurance Claims,\nMaritime, Medical Malpractice and Personal Injury  \nThe University of Texas School of Law\n\nShow Preview\n\nView Website View Lawyer Profile Email Lawyer\n\nJason is one of the nation's top trial lawyers for one reason: when he\nrepresents a client, he's all in. No matter how tough the fight. No matter how\nbig the challenge. When it matters most, he's there for people who have been\nwronged. He takes every case personally, treating each client like family\nwhile he fights to rebuild their lives.  \n  \nWhen people need to win, they call Jason. He's won several verdicts and\nsettlements worth more than $100 million, dozens of results worth more than\n$10 million, and more than 200 results worth $1 million or more. In total,...\n\nCompare Save\n\nClaimed Lawyer ProfileOffers Video ConferencingSocial MediaResponsive Law\n\n** Elliott Harlos  **\n\nEuless, TX Insurance Claims Attorney with 2 years of experience\n\n**(682) 444-4444 ** 400 South Industrial Blvd  \nEuless, TX 76040\n\nFree ConsultationOffers Video ConferencingVideo ConfInsurance Claims and\nPersonal Injury  \nSt. Mary's University School of Law\n\nShow Preview\n\nView Website View Lawyer Profile Email Lawyer\n\nElliott Harlos is a personal injury attorney at the McCormick Law Firm. After\nearning his Bachelors in Business Administration from Texas Tech University,\nMr. Harlos received his JD from St. Mary's University School of Law. Mr.\nHarlos is an ardent advocate for his clients to ensure they receive the\nsettlement they deserve after an accident.\n\nCompare Save\n\nClaimed Lawyer ProfileBlawg SearchSocial Media\n\n** Chelsie King Garza  **\n\nHouston, TX Insurance Claims Lawyer with 23 years of experience\n\n**(713) 893-8808 ** 3663 N. Sam Houston Parkway E.  \n6th Floor #200  \nHouston, TX 77032\n\nInsurance Claims, Medical Malpractice, Nursing Home and Personal Injury  \nThe Catholic University of America Columbus School of Law\n\nShow Preview\n\nView Website View Lawyer Profile Email Lawyer\n\nChelsie Garza is an experienced litigator who has tried cases extensively in\nstate and federal court. Outside of the office, Chelsie Garza's life is\ndedicated to her two children. In order to balance a busy litigation docket\nand a family life, she hones her skill of multi-tasking and exploits her\ninability to accept down time. Chelsie grew up sharing time between the small\nCalifornia Death Valley town Trona and New York/New Jersey metroplex. This\ndichotomy between small town and big city illustrates her ability to fit in\nanywhere. She was educated on the East Coast,...\n\nCompare Save\n\nClaimed Lawyer Profile\n\n** David Wayne Hodges  **\n\nHouston, TX Insurance Claims Lawyer with 27 years of experience\n\n**(877) 342-2020 ** 4409 Montrose Blvd.  \nSte. 200  \nHouston, TX 77006\n\nInsurance Claims, Appeals, Employment and Personal Injury  \nUniversity of Houston - Main Campus\n\nShow Preview\n\nView Website View Lawyer Profile\n\nDavid Hodges, founding partner at Hodges & Foty, LLP, was born in McAllen,\nTexas, and moved to Cypress when he was seven. He attended Cy-Fair Senior High\nSchool, and discovered he wanted to go to law school after participating in a\nmock trial in his senior government class.  \n  \nAfter graduation, he joined the Corps of Cadets and attended Texas A&M\nUniversity where he earned his B.S. degree in 1989. After graduating from\nTexas A&M University, he was immediately commissioned in the Navy and deployed\nto the Persian Gulf. When he transferred from active duty to the Navy\nReserves, he...\n\nCompare Save\n\nClaimed Lawyer Profile\n\n** Kevin Richard Michaels  **\n\nHouston, TX Insurance Claims Lawyer with 31 years of experience\n\n**(281) 496-9889 ** 888 W. Sam Houston Pkwy. S.  \nSuite 226  \nHouston, TX 77042\n\nFree ConsultationInsurance Claims, Arbitration & Mediation and Business  \nSouth Texas College Of Law\n\nShow Preview\n\nView Lawyer Profile Email Lawyer\n\nKevin graduated from the University of Houston- Downtown Campus after serving\nin the U.S. Army where he received several decorations and awards. While\nworking full time at O'Quinn & Laminack, a major plaintiff's law firm, Kevin\nattended South Texas College of Law, graduating in May 1992. After being\nlicensed in November 1992, Kevin practiced law at O'Quinn & Laminack for over\n5 1/2 years, focusing on consumer and commercial disputes, wrongful\ntermination, medical malpractice, personal injury, premise liability and toxic\ntort cases. In July 1997, Kevin joined Davis & Shank, P.C., a well-respected\ndefense firm. At Davis & Shank, Kevin's...\n\nCompare Save\n\nNext\n\nFAQ Lawyers Get Listed\n\nRelated Practice Areas\n\nHealth Care Law  \nInsurance Defense  \nPersonal Injury\n\nResearching Attorney Discipline\n\nFind out whether an attorney has ever been disciplined.\n\nResources for Lawyers\n\n  * About Justia Lawyer Directory Badges\n  * Lawyer Directory FAQs\n  * Claim your Profile\n  * About Premium Placements\n  * About Justia Lawyer Rating and Reviews\n\nToggle tool\n\n(0) Recent (0)\n\n(0) Saved (0)\n\n(0/3) Compare (0/3)\n\nThere are no recently viewed profiles.\n\nView all\n\nThere are no saved profiles.\n\nView all\n\nThere are no profiles to compare.\n\nCompare\n\n© 2023 Justia Justia Connect Legal Portal Company Help Terms of Service\nPrivacy Policy Marketing Solutions\n\n",
    "links": "[{\"link\": \"https://accounts.justia.com/?destination=https://www.justia.com/lawyers/insurance-claims/texas\", \"text\": \"Log In\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims\", \"text\": \"Insurance Claims\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/austin\", \"text\": \"Austin\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/dallas\", \"text\": \"Dallas\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/el-paso\", \"text\": \"El Paso\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/fort-worth\", \"text\": \"Fort Worth\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/houston\", \"text\": \"Houston\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/san-antonio\", \"text\": \"San Antonio\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/abilene\", \"text\": \"Abilene\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/amarillo\", \"text\": \"Amarillo\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/arlington\", \"text\": \"Arlington\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/beaumont\", \"text\": \"Beaumont\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/brownsville\", \"text\": \"Brownsville\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/conroe\", \"text\": \"Conroe\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/corpus-christi\", \"text\": \"Corpus Christi\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/denton\", \"text\": \"Denton\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/edinburg\", \"text\": \"Edinburg\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/garland\", \"text\": \"Garland\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/grand-prairie\", \"text\": \"Grand Prairie\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/humble\", \"text\": \"Humble\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/irving\", \"text\": \"Irving\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/katy\", \"text\": \"Katy\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/killeen\", \"text\": \"Killeen\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/laredo\", \"text\": \"Laredo\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/lubbock\", \"text\": \"Lubbock\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/mcallen\", \"text\": \"McAllen\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/mckinney\", \"text\": \"McKinney\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/mesquite\", \"text\": \"Mesquite\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/midland\", \"text\": \"Midland\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/mission\", \"text\": \"Mission\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/odessa\", \"text\": \"Odessa\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/pasadena\", \"text\": \"Pasadena\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/plano\", \"text\": \"Plano\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/round-rock\", \"text\": \"Round Rock\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/spring\", \"text\": \"Spring\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/sugar-land\", \"text\": \"Sugar Land\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/tyler\", \"text\": \"Tyler\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/waco\", \"text\": \"Waco\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/all-cities\", \"text\": \"Show More Cities »\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/bexar-county\", \"text\": \"Bexar County\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/collin-county\", \"text\": \"Collin County\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/dallas-county\", \"text\": \"Dallas County\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/harris-county\", \"text\": \"Harris County\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/tarrant-county\", \"text\": \"Tarrant County\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/travis-county\", \"text\": \"Travis County\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/bell-county\", \"text\": \"Bell County\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/brazoria-county\", \"text\": \"Brazoria County\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/cameron-county\", \"text\": \"Cameron County\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/denton-county\", \"text\": \"Denton County\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/el-paso-county\", \"text\": \"El Paso County\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/fort-bend-county\", \"text\": \"Fort Bend County\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/galveston-county\", \"text\": \"Galveston County\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/hidalgo-county\", \"text\": \"Hidalgo County\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/lubbock-county\", \"text\": \"Lubbock County\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/montgomery-county\", \"text\": \"Montgomery County\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/nueces-county\", \"text\": \"Nueces County\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/williamson-county\", \"text\": \"Williamson County\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas/all-counties\", \"text\": \"Show More Counties »\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-claims/texas?page=2\", \"text\": \"Next\"}, {\"link\": \"https://www.justia.com/lawyers/health-care-law/texas\", \"text\": \"Health Care Law\"}, {\"link\": \"https://www.justia.com/lawyers/insurance-defense/texas\", \"text\": \"Insurance Defense\"}, {\"link\": \"https://www.justia.com/lawyers/personal-injury/texas\", \"text\": \"Personal Injury\"}]",
    "priceAndPlans": "The Wayback Machine -\nhttp://web.archive.org/web/20231215153110/https://www.justia.com/\n\nLog In Sign Up\n\n  * Find a Lawyer\n  * Ask a Lawyer \n  * Research the Law\n  * Law Schools\n  * Laws & Regs\n  * Newsletters\n  * Marketing Solutions\n\n    * Justia Connect\n    * Pro Membership\n    * Basic Membership\n\n    * Justia Lawyer Directory\n    * Platinum Placements\n    * Gold Placements\n\n    * Justia Elevate\n    * SEO\n    * Websites\n    * Blogs\n\n    * Justia Amplify\n    * PPC Management\n    * Google Business Profile\n    * Social Media\n\n    * Justia Onward Blog\n\n####  Legal Guides\n\n**Injury Law**  \nCar Accidents, Medical Malpractice...\n\n**Family Law**  \nDivorce, Child Custody and Support, Adoption...\n\n**Estate Planning**  \nTrusts, Wills, Probate, Guardianships...\n\n**Home Ownership**  \nBuying a Home, Mortgages and Refinancing...\n\n**Intellectual Property**  \nCopyright, Patent, Trademarks...\n\n**Employment& Labor**  \nDiscrimination, Sexual Harassment, Wages...\n\n**Criminal Law**  \nDrunk Driving, Drug Crimes, Sex Crimes...\n\n**Business Law**  \nStarting a Business, Managing a Business...\n\n**Immigration**  \nWork Visas, Green Cards, Citizenship,...\n\n**Bankruptcy**  \nChapter 7, Chapter 13, Business Bankruptcy...\n\n####  Legal Research & Law Practice\n\n**Laws: Cases& Codes **  \nUS Constitution, US Laws, State Laws...\n\n**US Courts**  \nUSSC, Fed Courts, State Courts...\n\n**Law Schools**  \nLaw Reviews, Outlines, Law Prof Blogs...\n\n**Law Blogs**  \nBusiness Law, Family Law, Podcasts...\n\n**50-State Surveys**  \nAbortion Laws by State...\n\n**US Federal Government**  \nExecutive, Congress, Courts...\n\n**US States**  \nCalifornia, Florida, New York, Texas...\n\n**Legal Forms**  \nUS Federal, US States,  Biz Contracts...\n\n**Experts& Expert Witnesses**  \nAccident Reconstruction, Medical Experts\n\n**Legal News**  \nCompany Profiles, Federal Dockets...\n\n####  Lawyers, Legal Aid & Pro Bono Services\n\n**Personal Injury**  \nMedical Malpractice, Workers' Comp...\n\n**Criminal Law**  \nDUI/DWI, Traffic Tickets, White Collar...\n\n**Family Law**  \nDivorce, Domestic Violence, Immigration...\n\n**Business Law**  \nBankruptcy, Employment, Securities...\n\n**Tax Law**  \nEstate Planning, Probate, Investor Fraud...\n\n**California**  \nLos Angeles, San Diego, San Francisco...\n\n**New York**  \nNew York City, Bronx, Brooklyn...\n\n**Texas**  \nAustin, Dallas, Houston, San Antonio...\n\n**Other US States**  \nFlorida, Illinois, Ohio, Pennsylvania...\n\n**Other US Cities**  \nAtlanta, Chicago, Miami, Philadelphia...\n\n####  Latin America\n\n**Mexico**  \nBaja California, Distrito Federal, Coahuila, Estado de México, Jalisco, Nuevo\nLeón...\n\n**Central America & Caribbean**  \nBelize, Costa Rica, Cuba, Dominican Republic, El Salvador, Guatemala,\nHonduras, Nicaragua, Panama\n\n**South America**  \nArgentina, Bolivia, Brasil, Chile, Colombia, Ecuador, Paraguay, Peru, Uruguay,\nVenezuela\n\n####  Cases in the News - Documents\n\n**Apple Lawsuits** \\- Antitrust, patent and other lawsuits involving Apple,\nincluding Apple e-books antitrust litigation.\n\n**Camp Lejeune Lawsuits** \\- Injury lawsuits based on contaminated water at a\nmilitary base.\n\n**Facebook Lawsuits** \\- Copyright, patent, contract and other lawsuits\ninvolving Facebook.\n\n**Google Lawsuits** \\- Copyright, patent, contract and other lawsuits\ninvolving Google.\n\n**Tesla Motors Lawsuits** \\- Securities, patent, personal injury and other\nlawsuits involving Tesla Motors.\n\nExplore the membership connecting legal professionals with resources and\nbenefits to achieve their professional and practice-growth goals. Free Justia\nConnect Basic Memberships unlock access to core program features, while\nupgraded Justia Connect Pro Memberships offer expanded benefits.\n\nVisit Justia Connect\n\nDecember 14, 2023\n\nMichael Cohen’s Lawyer Might Have Cited Fake Cases\n\nMichael Cohen’s lawyer was ordered to produce copies of three cases on Tuesday\nafter neither a lawyer nor the judge could find the cases cited in his motion\nto end Cohen’s supervised release early. Read More.\n\n####  Public Interest and Pro Bono Projects\n\n**Stanford Copyright and Fair Use Center**  \nThis site contains a wealth of primary and secondary copyright and fair use\nresources including sample copyright and fair use guidelines for librarians.\n\n**COVID-19 Laws and Legal Resources Center**  \nOur COVID-19 center describes the changes to laws and procedures caused by the\ncoronavirus pandemic. These involve issues related to employment, housing,\nsmall businesses, taxes, immigration, bankruptcy, and more.\n\n**Supreme Court Center**  \nJustia provides a searchable and browsable database of all US Supreme Court\ndecisions since the 1790s, as well as links to related sources. We also\nsponsor the Oyez Project, a multimedia archive that contains audio of Supreme\nCourt oral arguments.\n\n**LGBTQ+ Legal Resource Center**  \nJustia's LGBTQ+ Legal Resource Center provides up-to-date information about\nlegal issues uniquely or disproportionately affecting LGBTQ+ individuals in\nareas including family law, employment law, immigration, housing, military\nservice, juvenile law, and other topics.\n\n**Consumer & Business Legal Forms**  \nThese surveys provide links to forms and resources in areas such as divorce\nand family law, estate planning, real estate, bankruptcy, immigration,\nintellectual property, and business formation and incorporation. Many forms\nare available at no cost. The surveys also describe key laws and procedures\nthat govern these issues in each state.\n\n**Sports Law Center**  \nOur recently updated Sports Law center provides information on issues such as\ncontracts, endorsements, collective bargaining, and doping regulations. We\nalso cover rules specific to college sports, such as Title IX and the new\nstate laws on monetizing the name, image, and likeness rights of student-\nathletes.\n\n#### Upcoming Justia CLE & Webinars\n\nJustia offers free webinars for all lawyers and virtual CLE courses for Justia\nConnect Pro members. Check out our upcoming programs below, or explore our\nfull catalog in the Justia CLE & Webinars Center.\n\nDec **15**\n\n**Podcasting 101: Advising Clients in Preproduction, Production, and\nDistribution **\n\n**Alexia Bedat** , Klaris Law PLLC\n\n**Learn More ›**\n\nDec **18**\n\n**SEO for Lawyers: 2023 Highlights & 2024 Forecasts **\n\n**Ana Hidalgo** , Justia\n\n**Gustavo Montes** , Justia\n\n**Tim Stanley** , Justia\n\n**Learn More ›**\n\nJustia Connect\n\nLawyers, access your free Justia Connect membership dashboard.\n\nLog In\n\nUnfamiliar with Justia Connect?  \nLearn More ›\n\nToday on Verdict\n\nJustices Thomas and Alito Want a Constitutional Right to Pray Away the Gay\n\nCornell Law professor Michael C. Dorf discusses the Supreme Court’s refusal to\nhear a case challenging Washington State’s ban on conversion therapy, _Tingley\nv. Ferguson_ , and specifically the implications of the dissent from Justices\nClarence Thomas and Samuel Alito.\n\nFind a Lawyer\n\n**Lawyers - Get Listed Now!** Get a free directory profile listing\n\nAsk a Lawyer\n\n**Question:**\n\nAdd details\n\n120\n\n**More Information:**\n\n1000\n\nAsk Question\n\nJustia Legal Resources\n\nFind a Lawyer\n\n  * Bankruptcy Lawyers\n  * Business Lawyers\n  * Criminal Lawyers\n  * Employment Lawyers\n  * Estate Planning Lawyers\n  * Family Lawyers\n  * Personal Injury Lawyers\n  * More... \n\nIndividuals\n\n  * Bankruptcy\n  * Criminal\n  * Divorce\n  * DUI\n  * Estate Planning\n  * Family Law\n  * Personal Injury\n  * More...\n\nBusiness\n\n  * Business Formation\n  * Business Operations\n  * Employment\n  * Intellectual Property\n  * International Trade\n  * Real Estate\n  * Tax Law\n  * More... \n\nLaw Students\n\n  * Law Schools\n  * Admissions\n  * Financial Aid\n  * Course Outlines\n  * Law Journals\n  * Blogs\n  * Employment\n  * More...\n\nUS Federal Law\n\n  * US Constitution\n  * US Code\n  * Regulations\n  * Supreme Court\n  * Circuit Courts\n  * District Courts\n  * Dockets & Filings\n  * More...\n\nUS State Law\n\n  * State Constitutions\n  * State Codes\n  * State Case Law\n  * California\n  * Florida\n  * New York\n  * Texas\n  * More... \n\nOther Databases\n\n  * Legal Dictionary\n  * Legal Blogs\n  * Business Forms\n  * Product Recalls\n  * Patents\n  * Trademarks\n  * Countries\n  * More...\n\nMarketing Solutions\n\n  * Justia Connect Membership\n  * Justia Lawyer Directory\n  * Justia Premium Placements\n  * Justia Elevate (SEO, Websites)\n  * Justia Amplify (PPC, GBP)\n  * Justia Onward Blog\n  * Testimonials\n  * More...\n\n© 2023 Justia Justia Connect Legal Portal Company Help Terms of Service\nPrivacy Policy Marketing Solutions\n\nWe use cookies to improve the experience of our website. By continuing to use\nour website, you consent to the use of cookies. To understand more about how\nwe use cookies, please see our Privacy Policy.\n\nAccept & Continue\n\n"
}