{
    "summary": "Open Accessibility Menu\n\n  * Skip to Content\n  * Skip to Menu\n  * Increase Text Size\n  * Clear All\n\n**Call for a Free Consultation  \nYou Only Pay If We Win** (512) 430-4844\n\nclose\n\nHow Can We Help?\n\n  * Back \n  * Home\n  * About Us\n\n    * Back \n    * Our Attorneys\n    * Testimonials\n    * Case Results\n\n  * Attorneys\n\n    * Back \n    * Randy Howry\n    * Sean Breen\n    * Timothy J. Herman\n    * Glen Wilkerson\n    * John E. Carlson\n    * Matt A. Kelley\n    * Hayden Hatch\n\n  * Practice Areas\n\n    * Back \n    * Personal Injury\n    * Business & Commercial Litigation\n    * Insurance Litigation\n    * Oil & Gas Litigation\n    * Real Estate Litigation\n\n  * Results\n  * News\n  * Videos\n\n    * Back \n    * Firm Videos\n\n  * Contact Us\n\n  * Attorneys \n  * Results \n  * Contact \n  * \n\n#  Insurance Litigation Lawyers in Austin\n\n##  Helping People Get Back on Their Feet after a Wrongfully Denied Claim or\nNatural Disaster\n\nInsurance is meant to protect individuals and businesses in the event of a\ndisaster or loss. Unfortunately, however, many insurance companies will deny\nrightful claims. Even if they don’t reject your claim outright, they might\noffer a too-low settlement that doesn’t even come close to covering your\ndamages.\n\nAt Howry Breen & Herman, we protect individuals, homeowners, business owners,\nranchers, and other people dealing with difficult insurance companies. We have\nhelped our clients through some of the worst natural disasters in our area,\nincluding devastating wildfires, floods, and storms.\n\nOur insurance litigation lawyers in Austin are experienced in helping our\nclients aggressively prosecute and resolve their claims so that they can start\nrebuilding their lives.\n\nIf you need help dealing with an insurance company or have had your just claim\ndenied, contact us online or by phone at (512) 430-4844. We offer free initial\ncase evaluations.\n\n### Types of Insurance Litigation We Handle\n\nAfter a natural disaster, unexpected injury, or commercial loss, insured\nindividuals typically turn to their insurance provider in an effort to recover\nsustained damages. Insurance companies have a duty to honor their policies and\npay out rightful claims.\n\nHowever, it is often in the insurance company’s best interest to avoid paying\nout the full amount—or any amount at all. At Howry Breen & Herman, we take on\ninsurance companies that seek to wrongfully devalue or deny policyholders’\nclaims.\n\n**Our Austin insurance litigation attorneys can assist you with:**\n\n  * **Coverage Disputes:** In such cases, the insurance company and the policyholder disagree about what is covered under the current policy. Often, insurance companies try to exploit ambiguous policy language to avoid paying rightful claims. \n  * **Bad Faith Insurance Claims:** With bad faith claims, the policyholder argues that his or her insurance company has incorrectly or wrongfully estimated the amount of compensation he or she qualifies for. Insurance companies will often undervalue losses to avoid paying out the full amount a policyholder is owed. \n\nThis list is not exhaustive; our team can help you with any insurance dispute\nor litigation matter you may be facing. With nearly **25 years of jury trial\nexperience** and thousands of cases handled, we are equipped to take on even\nthe toughest of cases.\n\n### What Are Punitive Damages?\n\nWhen a defendant in a civil case harmed the plaintiff through criminal means\nor egregious negligence, the court can approve of punitive damages that\nfurther penalize them. In most cases, punitive damages are not an option\nbecause they are difficult to justify, and they are not covered by the\ndefendant’s insurance provider. However, when dealing with insurance\nlitigation, the situation is different because the defendant _is_ an insurance\ncompany, not someone being represented by one.\n\nOur Austin insurance litigation attorneys can discuss your chances of securing\npunitive damages with you while your case develops. We want to give you a\nrealistic expectation based on the specifics of your case.\n\nAs mentioned, punitive damages are rare, so we won’t mislead you into thinking\nyou are automatically eligible to receive them. On the other hand, if they\nwould be justified based on what the defendant did to mishandle your insurance\nclaim, then you can be confident that we will do what we can to pursue every\nlast penny of punitive damages.\n\n### Assisting All Types of Clients with Insurance Litigation\n\nUnfortunately, natural disasters, like fires and floods, are relatively common\nhere in Texas. At Howry Breen & Herman, we assist clients who have suffered\ndevastating property loss and other damages after a natural disaster.\n\nWe also help individuals dealing with difficult automobile insurers after a\ncar or motorcycle accident, as well as business owners who have had their\ncommercial insurance claim wrongfully denied.\n\n**Our insurance litigation lawyers have fought on behalf of:**\n\n  * Homeowners\n  * Small businesses\n  * Large corporations\n  * Farmers\n  * Ranchers\n  * Churches\n\nIn every instance, our goal is simple: to help you recover the full and fair\ncompensation you are owed. We rely on an aggressive approach to trial in order\nto help our clients achieve the best possible outcomes for their cases.\n\nWe have even helped clients recover legal fees from liable insurance companies\nin some cases. Our team can handle every aspect of your case so that you can\nfocus on moving forward with your life. We offer contingent fees, meaning you\ndon’t owe us anything unless/until we win your case.\n\nCall (512) 430-4844 or fill out an online contact form to request a no-cost\nconsultation today.\n\n#### Practice Areas\n\n  * Personal Injury\n  * Business & Commercial Litigation\n  * Insurance Litigation\n  * Oil & Gas Litigation\n  * Real Estate Litigation\n\nOur Victories\n\n  * **$53.9 Million Verdict**\n\nHBH won a 53.9 million dollar verdict against Oncor Electric Delivery.\nFollowing a two-week trial, a Dallas jury has awarded $53.9 million in damages\nto victim James Stacey Taylor of Graham, Texas, after finding that actions by\nOncor, the state's largest electric delivery power company, caused the tragic\n2015 incident that left Mr. Taylor a quadriplegic.\n\nThe case is _Taylor v. Oncor Electric Delivery Co. Inc._ , __Case No.\nDC-16-01615 in Dallas County.\n\nCatastrophic Injury\n\n  * **$15.8 Million**\n\nHBH won a record-setting 15.8 Million Dollar jury verdict for a client and her\nfamily after she was rendered quadriplegic when she was struck and run over by\na defective runaway E-Z-GO golf cart/utility vehicle. It is the largest\npersonal injury verdict in the history of that federal district. HBH also\nprotected the verdict on appeal, winning that too. After a $7,367,684\nreduction for credits and offsets, $4,038,316.00 net to client, $600,000 case\nexpenses; $3,794,000 attorney’s fees.\n\nProduct Liability\n\n  * **$12.4 Million**\n\nHBH won a record-setting 12.4 Million Dollar jury verdict for a young man\nparalyzed in a diving accident in an apartment swimming pool. The verdict was\nthe largest premises liability verdict in Texas at the time and led to changes\nin pool safety at apartment complexes that catered to college students. After\na $7,578,417 reduction for contributory negligence and settlement on appeal,\n$2,475,000 net to client; $321,583 case expenses; $2,025,000 attorney’s fees.\n\nPremises Liability\n\n  * **$10 Million**\n\nHBH won an Arbitration award for a client against an insurance company for bad\nfaith non-payment of policy proceeds. The litigation spanned two years and\ninvolved witnesses from all over the world and with experts in numerous\nfields. Net to Client $6,890,665.62; Costs $364,545.90; Attorney Fees\n2,744,789.48\n\nBad Faith Insurance\n\n  * **$10 Million**\n\nHBH secured a settlement for a multi-story building that was suffering damage\ndue to construction defects. The recovery included all attorney’s fees and\nexpenses to repair the building. $6,558,000 net to client; $745,000 case\nexpenses; $3,597,000 attorney’s fees.\n\nConstruction Defects\n\n  * **Substantial and Confidential**\n\nHBH secured a recovery for construction defects to a multi-level condominium\ntower with systemic water damage. The settlement covered repairs, property\ndamage, stigma, loss of use and attorney’s fees.\n\nConstruction Defects\n\n  * **SUBSTANTIAL AND CONFIDENTIAL**\n\nHBH won a settlement for victims of a multi-truck crash on the highway.\nSeveral trucks were involved in the crash and HBH secured insurance limits\nfrom all of them due to joint responsibility.\n\nTruck Accident\n\n  * **$7.4 Million**\n\nHBH won a multi-party settlement for the family and young son of a woman\ntragically killed in a boating crash. HBH was the lead firm on the case.\n$4,400,000 net to client; $150,000 case expenses $2,900,000 attorney’s fees.\n\nWrongful Death\n\n  * **SUBSTANTIAL AND CONFIDENTIAL**\n\nHBH recovered a settlement for the family of a victim who was killed by 18\nwheeler that was traveling at an illegally slow rate of speed in the highway.\nWhen the police initially investigated, the truck driver lied and claimed he\nwas traveling at the speed limit. After HBH got involved and sued, HBH\nuncovered the truth that he was killing time driving slow because he was ahead\nof schedule.\n\nWrongful Death\n\n  * **$6 Million**\n\nHBH secured a settlement prior to trial for a client who was permanently\ninjured by a premises liability and construction defect. Our client suffered\nspinal damage and other life-long injuries and required medical treatment the\nrest of her life. $3,365,000 net to client; $235,300 case expenses; $2,400,000\nattorney’s fees.\n\nConstruction Defects\n\nView More\n\nOur Attorneys\n\n  * **Randy Howry**\n\nPartner\n\n  * **Sean Breen**\n\nPartner\n\n  * **Timothy J. Herman**\n\nPartner\n\n  * **Glen Wilkerson**\n\nAttorney\n\n  * **John E. Carlson**\n\nAttorney\n\n  * **Matt A. Kelley**\n\nPartner\n\n  * **Hayden Hatch**\n\nAttorney\n\n  * Howry, Breen & Herman is proud to have been named a Tier 1, 2 and 3 Austin “Best Law Firm” in 9 practice areas by U.S. News – Best Lawyers® (“U.S. News” and BL Rankings, LLC). Law firms are selected for inclusion in this prestigious ranking based on a series of quantitative and qualitative criteria. Our specialty and tiers are listed here: https://bestlawfirms.usnews.com/profile/howry-breen-herman-llp/overview/36628\n\n  * Howry Breen & Herman, LLP was selected the Top Personal Injury Law Firm in Austin by Texas Lawyer, “Best of 2020”. The annual special supplement contains the results of Texas Lawyer readers’ poll, wherein readers cast their votes for the best providers of services and goods to the legal profession. \n\n  * Attorney Sean Breen and Attorney Chris Lavorato placed in California’s Top 100 Settlements for 2019, as tracked by The Recorder and VerdictSearch. \n\n  * Our law firm is proud to have been recognized in the Texas Verdicts Hall of Fame. Texas Lawyer in conjunction with VerdictSearch, recognize attorneys and law firms for their verdicts of $10 million or more. In 2011 Sean Breen was a Hall of Fame Award Recipient for the #1 Premises Liability Top Texas Verdict, awarded by Texas Lawyer, for the jury verdict award in the case VanDusen v. Aspen Square Management. In 2016 Sean Breen was inducted into the Texas Verdicts Hall of Fame, awarded by Texas Lawyer, for an outstanding verdict in Nester v. Textron. \n\n  * Selection to America’s Top 100 Personal Injury Attorneys® is by invitation only and is reserved to identity the nation’s most exceptional litigators for high-value personal injury, catastrophic injury, wrongful death, product liability, and medical malpractice matters. HBH is proud that Sean Breen has been selected for this award. Less than one-half percent (0.5%) of active attorneys in the United States will receive this honor — truly the most exclusive and elite level of attorneys in the community. (2017-2022) \n\n  * Howry, Breen & Herman is proud to have been named a Tier 1, 2 and 3 Austin “Best Law Firm” in 7 practice areas by U.S. News – Best Lawyers® (“U.S. News” and BL Rankings, LLC). Law firms are selected for inclusion in this prestigious ranking based on a series of quantitative and qualitative criteria. Our specialty and tiers are listed here: https://bestlawfirms.usnews.com/profile/howry-breen-herman-llp/overview/36628\n\n  * Best Lawyers - Lawyer of the Year | Litigation - Trusts & Estates (by BL Rankings, LLC d/b/a Best Lawyers and Co., LLC) \n\n  * Best Lawyers - Lawyer of the Year | Personal Injury - Plaintiffs (by BL Rankings, LLC d/b/a Best Lawyers and Co., LLC) \n\n  * Lifetime Achievement selection to America’s Top 100 Attorneys® is by invitation only and is reserved to identify the nation’s most exceptional attorneys whose accomplishments and impact on the legal profession merit a Lifetime Achievement award. Selection is not achieved based on a single accomplishment or a single great year of success, but rather on a lifetime of hard work, ethical standards, and community enriching accomplishments that are inspiring among the legal profession. Both Sean Breen (2017) and Randy Howry (2018) are honored to receive this award. \n\n  * America’s Top 100 High Stakes Litigators® is reserved to identify the nation’s most exceptional trial attorneys in high value, high stakes legal matters. To be considered for selection, an attorney must have litigated (for either plaintiff or defendant) a matter (1) with at least $2,000,000 in alleged damages at stake or (2) with the fate of a business worth at least $2,000,000 at stake. These minimum qualifications are required for initial consideration. Thereafter, candidates are carefully screened through comprehensive Qualitative Comparative Analysis based on a broad array of criteria, including the candidate’s professional experience, litigation experience, significant case results, representative high stakes matters, peer reputation, and community impact in order to rank the candidates throughout the state. HBH is privileged to honor Partners Sean Breen (2017- 2021) and Randy Howry 2017, 2019, 2020 and 2021 for selection of this award. \n\n  * Expertise - Howry Breen & Herman was recognized and featured in an article by expertisecommunity.com as one of the Best Real Estate Lawyers in Austin. 2020 \n\n  * America’s Premier High-Stakes Trial Lawyers®” – 7 Figure Litigators®, 8 Figure Litigators®, is meant to recognize the nation’s most respected and preeminent high-stakes trial lawyers based on their verifiable verdicts and/or settlements. It is a tremendous honor for Sean Breen (2019) and Randy Howry (2020) to be recognized among this elite group. \n\n  * America’s Premier High-Stakes Trial Lawyers®” – 7 Figure Litigators®, 8 Figure Litigators®, is meant to recognize the nation’s most respected and preeminent high-stakes trial lawyers based on their verifiable verdicts and/or settlements. It is a tremendous honor for Sean Breen (2019) and Randy Howry (2020) to be recognized among this elite group. \n\n  * The National Trial Lawyers – Top 100, a highly respected legal organization that limits its members to premier trial attorneys who demonstrate superior qualifications of leadership, reputation, influence, stature and public profile measured by strict qualification requirements. Sean Breen Top 100 Civil Plaintiff, 2009 – 2020. \n\n  * Top 10 Business Tort Trial Lawyers by the National Trial Lawyers. Randy Howry 2012-2013; Sean Breen since 2016. \n\n  * _The Best Lawyers in America®_ recognizes the top 5% of the most skilled attorneys in the nation. The robust selection process requires attorneys to nominate and review fellow lawyers based on their ethics, skill, knowledge, and ability to obtain results for their clients. _The Best Lawyers in America®_ list is a way for plaintiffs to identify the leading attorneys in their region, known for their ability to get results with honesty, strength, and skill. Tim Herman, Sean Breen & Randy Howry have been featured by _The Best Lawyers in America®_ (2006-2020) running alongside some of the most qualified firms in the nation. More info here. \n\n  * Top Attorneys As Published In Texas Monthly \n\n  * Sean Breen was honored by TopVerdict.com for recovering one of the Top 50 Verdicts in Texas in 2017. This is an honorable distinction, reserved for those attorneys that achieve the highest settlements and verdicts in the state. \n\n  * Sean Breen is a member of the Multi-Million Dollar Advocates Forum, a renowned legal organization whose membership is restricted to trial attorneys who have achieved seven-figured settlements and/or jury verdicts. 2011. \n\n  * We are proud to have Sean Breen who is a member of the Million Dollar Advocates Forum. In order to become a member, an attorney must demonstrate that he or she has successfully achieved at least one six-figure settlement or jury verdict. 2011. \n\n  * Martindale-Hubbell® is widely regarded as one of the most renowned peer-review rating organizations in the legal field. Randy Howry (2018), Sean Breen (2001), Tim Herman (1998), Glen Wilkerson (2014) and Chris Lavorato (2014) at Howry, Breen & Herman have achieved the organization’s highest distinction of AV Preeminent®. \n\n  * Each year, Super Lawyers® magazine publishes its list of peer-nominated/evaluated and independently reviewed attorneys. We are proud to have attorneys who have been selected for inclusion in the prestigious Texas Super Lawyers® List, by Thomas Reuters since 2003, running through 2020. \n\n  * Membership in Top American Lawyers is limited to only 1% of all attorneys in the United States. Randy Howry is proud to be honored with a Lifetime Charter Membership in this exclusive organization (2017). \n\n#### Contact Us Today\n\n  * First Name:\n\nPlease enter your first name.\n\n  * Last Name:\n\nPlease enter your last name.\n\n  * Phone\n\nThis isn't a valid phone number.\n\n  * Email:\n\nThis isn't a valid email address.\n\nPlease enter your email address.\n\n  * Are you a new client?\n\nAre you a new client? Yes, I am a potential new client No, I'm a current\nexisting client I'm neither\n\nPlease make a selection.\n\n  * Message\n\nPlease enter a message.\n\nSubmit Information\n\n  * > **\"They gave me hope and then delivered!\"**\n>\n> \\- M.A.\n\n  * > **\"We are so grateful they believed in us and partnered with us to handle this case!\"**\n>\n> \\- J.K.\n\n  * > **\"We were always one step ahead!\"**\n>\n> \\- T.B.\n\n  * > **\"They were so fierce and tough with the other side while being so caring towards my family.\"**\n>\n> \\- L.P.\n\n  * > **\"I greatly admired their advocacy and professionalism!\"**\n>\n> \\- S.O.\n\n  * > **\"It was like having true friends as my attorneys!\"**\n>\n> \\- C.B.\n\n  * > **\"They are true trial attorneys!\"**\n>\n> \\- G.N.\n\n  * > **\"I always felt confident in Howry Breen & Herman and knew I could trust them.\"**\n>\n> \\- J.M.\n\n  * > **\"Definitely recommend, they are the best.\"**\n>\n> \\- J.R.\n\n  * > **\"Thank you for helping my father through his case!\"**\n>\n> \\- B.M.\n\n  * > **\"I could have not found more caring people!\"**\n>\n> \\- M.A.\n\n  * > **\"Sean and his team were the breath of fresh air that we needed. Still thanking you guys, 9 years later!\"**\n>\n> \\- A.L.\n\n  * > **\"Thank you for taking our case.\"**\n>\n> \\- L.M.\n\n  * > **\"They exceeded all expectations.\"**\n>\n> \\- T.R.\n\nView More\n\n**Quick Links**\n\n  * Home\n  * About Us\n  * Attorneys\n  * Practice Areas\n  * Contact Us\n  * Site Map\n  * l Privacy Policy\n\n  *   *   *   *   * \n\n**Austin Office** 1900 Pearl Street  \nAustin, TX  78705 Map / Directions\n\n**Georgetown Office** 117 West 7th Street, Suite 5  \nGeorgetown, Texas  78626  \n(By Appointment Only) Map / Directions\n\n**California Office** 310 Capitol Street  \nSalinas, CA  93901  \n(By Appointment Only) Map / Directions\n\n**Colorado Office** Snowmass Center  \n16 Kearns Road, Suite 301F  \nSnowmass Village, CO  81615  \n(By Appointment Only)\n\n**Call Us** (512) 430-4844 **Fax Us** (512) 474-8557\n\nAustin Personal Injury Lawyer © All Rights Reserved\n\n  *   *   *   *   * \nhttps://www.howrybreen.com/\n\nThe information on this website is for general information purposes only.\nNothing on this site should be taken as legal advice for any individual case\nor situation. This information is not intended to create, and receipt or\nviewing does not constitute, an attorney-client relationship. The verdicts and\nsettlements listed on this site are intended to be representative of cases\nhandled by Howry, Breen & Herman LLP. These listings are not a guarantee or\nprediction of the outcome of any other claims.\n\n",
    "links": "[{\"link\": \"https://www.howrybreen.com/\", \"text\": \"\"}, {\"link\": \"https://www.howrybreen.com/\", \"text\": \"Home\"}, {\"link\": \"https://www.howrybreen.com/about-us/\", \"text\": \"About Us\"}, {\"link\": \"https://www.howrybreen.com/attorneys/\", \"text\": \"Our Attorneys\"}, {\"link\": \"https://www.howrybreen.com/testimonials/\", \"text\": \"Testimonials\"}, {\"link\": \"https://www.howrybreen.com/results/\", \"text\": \"Case Results\"}, {\"link\": \"https://www.howrybreen.com/attorneys/\", \"text\": \"Attorneys\"}, {\"link\": \"https://www.howrybreen.com/attorneys/randy-howry/\", \"text\": \"Randy Howry\"}, {\"link\": \"https://www.howrybreen.com/attorneys/sean-breen/\", \"text\": \"Sean Breen\"}, {\"link\": \"https://www.howrybreen.com/attorneys/timothy-j-herman/\", \"text\": \"Timothy J. Herman\"}, {\"link\": \"https://www.howrybreen.com/attorneys/glen-wilkerson/\", \"text\": \"Glen Wilkerson\"}, {\"link\": \"https://www.howrybreen.com/attorneys/john-e-carlson/\", \"text\": \"John E. Carlson\"}, {\"link\": \"https://www.howrybreen.com/attorneys/matt-a-kelley/\", \"text\": \"Matt A. Kelley\"}, {\"link\": \"https://www.howrybreen.com/attorneys/hayden-hatch/\", \"text\": \"Hayden Hatch\"}, {\"link\": \"https://www.howrybreen.com/practice-areas/\", \"text\": \"Practice Areas\"}, {\"link\": \"https://www.howrybreen.com/personal-injury/\", \"text\": \"Personal Injury\"}, {\"link\": \"https://www.howrybreen.com/business-commercial-litigation/\", \"text\": \"Business & Commercial Litigation\"}, {\"link\": \"https://www.howrybreen.com/insurance-litigation/\", \"text\": \"Insurance Litigation\"}, {\"link\": \"https://www.howrybreen.com/oil-gas-litigation/\", \"text\": \"Oil & Gas Litigation\"}, {\"link\": \"https://www.howrybreen.com/real-estate-litigation/\", \"text\": \"Real Estate Litigation\"}, {\"link\": \"https://www.howrybreen.com/results/\", \"text\": \"Results\"}, {\"link\": \"https://www.howrybreen.com/blog/\", \"text\": \"News\"}, {\"link\": \"https://www.howrybreen.com/videos/\", \"text\": \"Videos\"}, {\"link\": \"https://www.howrybreen.com/videos/firm-videos/\", \"text\": \"Firm Videos\"}, {\"link\": \"https://www.howrybreen.com/contact-us/\", \"text\": \"Contact Us\"}, {\"link\": \"https://www.howrybreen.com/attorneys/\", \"text\": \"\\n\\t\\t\\t\\t\\tAttorneys\\n\\t\\t\\t\\t\"}, {\"link\": \"https://www.howrybreen.com/results/\", \"text\": \"\\n\\t\\t\\t\\t\\tResults\\n\\t\\t\\t\\t\"}, {\"link\": \"https://www.howrybreen.com/contact-us/\", \"text\": \"\\n\\t\\t\\t\\t\\tContact\\n\\t\\t\\t\\t\"}, {\"link\": \"https://www.howrybreen.com/about-us/\", \"text\": \"Howry Breen & Herman\"}, {\"link\": \"https://www.howrybreen.com/contact-us/\", \"text\": \"contact us\"}, {\"link\": \"https://www.howrybreen.com/personal-injury/\", \"text\": \"injury\"}, {\"link\": \"https://www.howrybreen.com/results/\", \"text\": \"thousands of cases\"}, {\"link\": \"https://www.howrybreen.com/personal-injury/car-accidents/\", \"text\": \"car\"}, {\"link\": \"https://www.howrybreen.com/personal-injury/motorcycle-accidents/\", \"text\": \"motorcycle accident\"}, {\"link\": \"https://www.howrybreen.com/contact-us/\", \"text\": \"contact form to request a no-cost consultation\"}, {\"link\": \"https://www.howrybreen.com/practice-areas/\", \"text\": \"\"}, {\"link\": \"https://www.howrybreen.com/personal-injury/\", \"text\": \"Personal Injury\"}, {\"link\": \"https://www.howrybreen.com/business-commercial-litigation/\", \"text\": \"Business & Commercial Litigation\"}, {\"link\": \"https://www.howrybreen.com/insurance-litigation/\", \"text\": \"Insurance Litigation\"}, {\"link\": \"https://www.howrybreen.com/oil-gas-litigation/\", \"text\": \"Oil & Gas Litigation\"}, {\"link\": \"https://www.howrybreen.com/real-estate-litigation/\", \"text\": \"Real Estate Litigation\"}, {\"link\": \"https://www.howrybreen.com/results/\", \"text\": \"\"}, {\"link\": \"https://www.howrybreen.com/results/\", \"text\": \"View More \"}, {\"link\": \"https://www.howrybreen.com/attorneys/randy-howry/\", \"text\": \"\"}, {\"link\": \"https://www.howrybreen.com/attorneys/sean-breen/\", \"text\": \"\"}, {\"link\": \"https://www.howrybreen.com/attorneys/timothy-j-herman/\", \"text\": \"\"}, {\"link\": \"https://www.howrybreen.com/attorneys/glen-wilkerson/\", \"text\": \"\"}, {\"link\": \"https://www.howrybreen.com/attorneys/john-e-carlson/\", \"text\": \"\"}, {\"link\": \"https://www.howrybreen.com/attorneys/matt-a-kelley/\", \"text\": \"\"}, {\"link\": \"https://www.howrybreen.com/attorneys/hayden-hatch/\", \"text\": \"\"}, {\"link\": \"https://www.howrybreen.com/blog/2012/may/top-texas-verdicts-of-2011/\", \"text\": \"VanDusen v. Aspen Square Management\"}, {\"link\": \"https://www.howrybreen.com/documents/Howry-Breen-Top-Verdicts-Settlements-2017.pdf\", \"text\": \"Nester v. Textron\"}, {\"link\": \"https://www.howrybreen.com/testimonials/\", \"text\": \"View More \"}, {\"link\": \"https://www.howrybreen.com/\", \"text\": \"Home\"}, {\"link\": \"https://www.howrybreen.com/about-us/\", \"text\": \"About Us\"}, {\"link\": \"https://www.howrybreen.com/attorneys/\", \"text\": \"Attorneys\"}, {\"link\": \"https://www.howrybreen.com/practice-areas/\", \"text\": \"Practice Areas\"}, {\"link\": \"https://www.howrybreen.com/contact-us/\", \"text\": \"Contact Us\"}, {\"link\": \"https://www.howrybreen.com/site-map/\", \"text\": \"Site Map\"}, {\"link\": \"https://www.howrybreen.com/privacy-policy/\", \"text\": \"Privacy Policy\"}]"
}