{
    "summary": "  * Home\n  * Practice Areas\n    * New Jersey Personal Injury Attorney\n      * Car Accidents\n      * Motorcycle Accident\n      * Construction Accident\n      * Professional Malpractice\n      * Negligence\n      * Wrongful Death\n      * Product Liability\n    * Civil Litigation\n      * Breach of Contract\n      * Consumer Fraud\n      * Insurance Claim\n      * Whistleblower Claims\n    * Commercial Litigation\n      * Business Dispute\n      * Contract Dispute\n      * Insurance Dispute\n      * Shareholder Dispute\n    * Real Estate Law\n      * Residencial Purchase/Sale\n      * Commercial Purchase/Sale\n  * Our Team\n    * Jeffrey W. Varcadipane\n    * Dawn M. Pinnisi\n    * Sophia Soraya\n    * Joseph C. Stimmel\n    * Kayla A. Berrios\n    * Jeremy L. Yela\n    * Emma M. Duffy\n    * Corinne Pinnisi\n  * Results\n    * Testimonials\n  * Blog\n    * Firm News\n    * Legal News\n    * Personal Injury\n    * Civil Litigation\n    * Commercial Litigation\n  * Careers\n    * Attorney\n    * Paralegal\n    * Law Clerk – Internship\n    * Legal Assistant/Receptionist\n    * Executive Assistant\n  * Contact\n    * Frequently Asked Questions\n    * Privacy Policy\n    * Disclaimer\n\n### Cases  \nWe Handle\n\n###### Personal Injury\n\n  * Car Accidents\n  * Slip & Falls\n  * Medical Malpractice\n  * Wrongful Death\n  * Birth-Related Injuries\n  * Construction Accidents\n  * Motorcycle Accidents\n  * Product Liability\n  * Negligence\n  * Dog Bites\n\n###### Civil Litigation\n\n  * Breach of Contract\n  * Consumer Fraud\n  * Insurance Claim\n  * Whistleblower Claims\n  * Judgement Enforcement\n\n###### Commercial Litigation\n\n  * Business Dispute\n  * Contract Dispute\n  * Insurance Dispute\n  * Shareholder Dispute\n\n###### Real Estate Law\n\n  * Residential Purchase/Sale\n  * Commercial Purchase/Sale\n\n#### (800) 616-2916\n\nCALL FOR A FREE CONSULTATION\n\n# New Jersey Insurance Claims Lawyer\n\n  *   *   *   *   *   *   * \n\n  * Home\n  * New Jersey Insurance Claims Lawyer\n\n## New Jersey Insurance Claims Attorneys\n\nFar too often, innocent people struggle to get the fair compensation they\ndeserve after filing insurance claims for property damage or personal\ninjuries. Unfortunately, insurance companies are typically focused on\nprotecting their bottom line rather than treating claimants and their\npolicyholders fairly when they file claims.\n\nAs such, most claimants can benefit from the representation of an experienced\nNew Jersey insurance claims attorney. When you hire an attorney from\nVarcadipane & Pinnisi, PC, they will be a tireless advocate for your\ninterests, as opposed to the insurance company, which will do everything it\ncan to deny or lowball your claim. With legal representation, you are more\nlikely to receive the compensation you deserve for your damages.\n\n### How New Jersey Insurance Claims Attorneys Can Help\n\nOur well-versed New Jersey insurance claims lawyers are prepared and honored\nto represent clients in numerous different types of cases involving\nhomeowner’s insurance and car insurance. This includes those arising from\ndamages from natural disasters like tornadoes and sinkholes or those involving\nuninsured/underinsured motorist coverage claims.\n\nWe will be here to represent you throughout the insurance claims process:\n\n  * Helping you file your claim\n  * Dealing with the insurer on your behalf\n  * Negotiating fair settlement for your compensation \n\nWe also represent injured parties who contact us after struggling\nindependently to obtain compensation from an insurance company. Our New Jersey\ninsurance claims lawyer can help determine the reason why the claimant is\nhaving a hard time and what the next best steps are. Sometimes it’s to file a\nlawsuit for the claim; other times, it’s to file a claim against the insurance\ncompany itself for their unethical behavior.\n\n### What is Bad Faith Insurance in New Jersey?\n\nBad faith is dishonest dealing, sometimes with the intent to defraud. When an\ninsurance company isn’t processing a claim promptly or can’t show good cause\nfor why they aren’t paying someone fairly for their claim, they are likely\nacting in bad faith.\n\nTo prove a claim for bad faith, the policyholder must establish that the\ninsurance company doesn’t have a reasonable basis for not extending benefits\nof the policy and that they know of their reckless disregard or the lack of\nreasonable basis for denying the claim.\n\nWe take cases involving insurance companies that act in bad faith by:\n\n  * Unfairly denying claims and therefore not providing compensation that the claimant deserves\n  * Delaying the processing of the claim or payments\n  * Ignoring your attempts to contact them—not returning phone calls or emails\n  * Making arbitrary demands for evidence of your injuries or for the amount of damages you sustained\n  * Making threatening statements\n  * Misrepresenting the law or policy language\n  * Denying or delaying decisions on claims or requests for approval for medical treatment\n  * Failing to conduct a complete and prompt investigation\n\nIt’s common for insurance companies to attempt to use loopholes in the\ninsurance policy’s language to deny your claim or offer a much lower\nsettlement than what your claim is worth. For example, the insurance company\nmay assert that:\n\n  * Your damages or injuries are expressly excluded from coverage under the policy\n  * Your policy lapsed because you didn’t pay your premium, or there was a delay in the payment of your premium\n  * Your injuries aren’t within the scope of your coverage, as per the insurer’s independent experts\n  * Your damages are less than what you say they are\n\nAn insurance policy is a contract between you and the insurance company. If\nyou fail to abide by the policy terms, such as by failing to pay your premium\nor not making a timely report of an accident, they can cancel your policy.\nHowever, if you are performing under the terms of the contract, they must do\nthe same. If they are refusing to pay for your damages, accusing you of not\npaying a premium that was paid on time, or purports that you are inflating or\nmaking up your damages, they aren’t abiding by the contract. In this scenario,\na New Jersey insurance claims lawyer could help you exercise your legal\nrights.\n\n### New Jersey Insurance Claims Attorney\n\nIf you are attempting to recover compensation from your insurance policy,\ncontact the New York or New Jersey insurance claims lawyers today at\nVarcadipane & Pinnisi, PC, for a free, no-obligation legal consultation. With\nvery little information, we can quickly tell you what services we offer and\nour legal fees. We can help you determine the best way to seek the\ncompensation you are entitled to receive. Suppose your insurance company is\nacting in bad faith. In that case, we can help you pursue a bad faith\ninsurance claim as well. You can count on us to be by your side throughout the\nentire process. We can be reached at 800-616-2916 or online.\n\n### Let Us Fight For You\n\nNeed Help? Contact us 24/7\n\nFree Consultation (800) 616-2916\n\n**New York & New Jersey Personal Injury & Litigation Lawyers**\n\n### Request Your  \nFree Consultation\n\nSchedule a free consultation with one of our experienced lawyers by filling\nout the form below, or call us at (800) 616-2916\n\n  *   *   *   * How Did You Find Our Firm?Google/Internet SearchAttorney ReferralFormer Client ReferralOther\n\n  *   * \\-- Select Your Case Type --Personal InjuryMedical MalpracticeCivil LitigationCommercial LitigationReal Estate\n\n  * \\-- Select Your Case Venue --New YorkNew JerseyFlorida\n\n  *   * \n\n####  Practice Areas\n\n  * Personal Injury\n  * Civil Litigation\n  * Commercial Litigation\n  * Real Estate\n\n  * ##### \"I would highly recommend Varcadipane & Pinnisi for the dedication to your individual case and your needs. They’re timely in response to your questions, they get you the answers you need, they are honest and reliable. We all n...\"\n\n**Korean M.** Client\n\n  * ##### \"They are very good lawyers and they are very kind thanks for everything 😊😊 \"\n\n**Gustavo R.** Client\n\n  * ##### \"It has truly been an incredible experience working with Ms. Sophia Soraya and the Varcadipane & Pinnisi Law Firm. They have been extremely professional, diligent, and committed. Despite any challenges that appeared along the road...\"\n\n**Anthony G.** Client\n\n  * ##### \"We Hired Varcadipane & Pinnisi for a situation we had back In NJ last year with a moving company that did not do right by us, they were supposed to deliver our household goods from NJ to our new home in FL and instead took all of...\"\n\n**Juan M.** Client\n\n  * ##### \"Sophia was amazing, as was her team. She was there for me through everything; super supportive and ensured I felt comfortable with every decision made. She never gave up and ultimately made a very challenging life event much easier t...\"\n\n**Chelsey M.** Client\n\n  * ##### \"Jeff and his team were so helpful in solving our legal issue. Everyone was thorough and communicated every step of the process to us. We really appreciate everything they did and would highly recommend!! \"\n\n**Justin L.** Client\n\n  * ##### \"I was very satisfied with Varcadipane & Pinnisi. They were professional and courteous in handling my case., which they handled with speed and brought a very favorable outcome to my case. I would Whole heartily recommend to anyone...\"\n\n**Vincent H.** Client\n\n  * ##### \"Everyone at this law office is very courteous and professional. I was being kept in the loop at every step in the process, and we reached a satisfactory outcome. \"\n\n**Boris S.** Client\n\n  * ##### \"The law firm lead by Mr. Varcadipane provided service that was first rate. From our first conversation, till the final settlement, this firm provided me a level of comfort and expertise which was second to none. I would surely recomm...\"\n\n**Bruce H.** Client\n\n  * ##### \"Dawn Pinnisi is a caring and responsible attorney who worked assiduously on my behalf. Highly recommend. \"\n\n**Michele A.** Client\n\n  * ##### \"To be successful in a matter involving a business dispute requires an attorney who not only knows the law but who has spent significant time in the courtroom dealing with complex business litigation. Varcadipane & Pinnisi is that...\"\n\n**Carlo R.** Client\n\n  * ##### \"Varcadipane & Pinnisi were successful in negotiating our claim. Professional and knowledgeable \"\n\n**E.C.M.** Business Client\n\n  * ##### \"They were outstanding in every way and I couldn’t be more pleased! \"\n\n**Ana R.** Client\n\n  * ##### \"I would like to start off by telling everyone at the firm how thankful I am for all who were involved in my case. I was always treated professionally, like family, kind, and considerate and with a friendly smile. Moreover, my experie...\"\n\n**Cheri C.** Client\n\n  * ##### \"Words can’t adequately express my gratitude to Dawn for taking on my medical malpractice case. At our first meeting Dawn had compassion for I went through and took the time to listen to everything I had to say. Throughout the e...\"\n\n**Rick P.** Client\n\n  * ##### \"Dawn Pinnisi was recommended to me from another lawyer. From the moment I spoke with her, I left it all in her hands. I live 2 hours away and I never had to go to her office! She settled my lawsuit so fast and for more that I ever ex...\"\n\n**Jennifer S.** Client\n\n  * ##### \"I would like to start off by telling everyone at the firm how thankful I am for all of you who were involved in my case. I was always treated professionally, with a friendly smile and greeting anytime I was at the office. Moreover, m...\"\n\n**Kenneth K.** Client\n\n  * ##### \"I have known Jeff Varcadipane for over 7 years, during which time he has advised me on several real estate and civil claims issues. Most recently, he assisted with my complicated real estate transaction in NYC. He was very responsive...\"\n\n**Andrew L.** Client\n\n  * ##### \"The best way to describe Dawn is if you are looking for a person that will go to bat for you, to fight for your cause, that puts in the energy, research, and effort that is required to get you the settlement that you deserve, then lo...\"\n\n**Charles D.** Client\n\n  * ##### \"Great law firm! Dawn Pinnisi is a great lawyer, very easy to work with, and got me a more than fair settlement on my case. Highly recommend this law firm. \"\n\n**Donna H.** Client\n\n  * ##### \"When forming my business, it was important that I started with the right structure. Jeff took the time to explain the pros and cons from a legal perspective and I was able to make a confident decision. Varcadipane & Pinnisi got m...\"\n\n**Richard L.** Brandbliss\n\n  * ##### \"The legal process is complicated and at times frustrating but Jeff has managed to translate this process so it is clear to me. He has been patient in walking me through this step by step. Jeff has been timely in providing me with upd...\"\n\n**I.S.** Client\n\n  * ##### \"Dawn is the best she won 2 cases for me for over $300,000. The first one was very difficult being that the company had no insurance, but Dawn handled it with such persistence and professionalism that we won. If you want a lawyer who ...\"\n\n**Anonymous** Client\n\n  * ##### \"I highly endorse this lawyer. Dawn is smart and personable. She is known to be a great litigator and she is extremely knowledgeable about the law as well as being fiercely defensive of her clients. I have attended many court appearan...\"\n\n**Peer Review** Birth Injury Attorney\n\n  * ##### \"I had the pleasure of working with Ms. Pinnisi for 14 years. She is one of the most outstanding attorneys with whom I have dealt. Ms. Pinnisi meticulously prepares and researches cases and advocates zealously on behalf of her clients...\"\n\n**Peer Review** Personal Injury Attorney\n\n  * ##### \"Dawn Pinnisi is a fantastic attorney with whom I have worked on numerous cases. Dawn is someone I am proud to call a friend. Over the years I have seen how personally invested she becomes in each of her cases, stopping at nothing to ...\"\n\n**Peer Review** Car Accident Attorney\n\n  * ##### \"Dawn really helped me out in a time of need after my accident. I wasn’t sure if I had a case or not but after my consultation, she gave me hope. I felt like I could trust her and she always returned my phone calls after reachin...\"\n\n**Anonymous** Client\n\n  * ##### \"I highly recommend Dawn Pinnisi for medical malpractice, car accident, and personal injury cases. Not only is she one of the most experienced attorneys in the field she’s an honest, trustworthy, and caring person in the litigat...\"\n\n**Peer Review** Criminal Defense Attorney\n\n  * ##### \"I had the pleasure of working with Ms. Pinnisi for 14 years. She is one of the most outstanding attorneys with whom I have dealt. Ms. Pinnisi meticulously prepares and researches cases and advocates zealously on behalf of her clients...\"\n\n**Peer Review** Personal Injury Attorney\n\n  * $4M\n\nOPPRESSED MINORITY SHAREHOLDER\n\nview all case results\n\n  * $3.5M\n\nStructured Settlement For Infant Injured At Birth\n\nview all case results\n\n  * $2.5M\n\nSettlement for client injured in a truck accident\n\nview all case results\n\n  * $1.85M\n\nRecovery in Fraudulent Conveyance Action\n\nview all case results\n\n  * $1.75M\n\nJeffrey W. Varcadipane Secures $750,000 Of Assets In Excess Of Insurance\nPolicy Limit Of $1,000,000, Paving Way For Plaintiff’s Settlement\n\nview all case results\n\n## From The Blog\n\n  * January 30, 2023\n\n###### How Much Is a Speeding Ticket 30 Miles Over?\n\nExcessive Speeding and Accidents: What You Should Know We live in a world\nwhere time is of the essence. Unfortunately, people don’t think about the\nconsequences of speeding until they are pulled o...\n\n  * January 26, 2023\n\n###### Personal Injury Laws in New York, New Jersey, and Florida\n\nWhether you have a personal injury claim in New York, New Jersey, or Florida,\nyou need to show negligence and must file a claim within a certain amount of\ntime. To file a claim, you need to understan...\n\n  * January 18, 2023\n\n###### SUV vs. Sedan Safety\n\nEvery day, there are millions of cars on the roads in New Jersey. Within this\nhighly-populated state where commuters rely on their vehicles for\ntransportation, it is common for accidents to happen. F...\n\n  * January 12, 2023\n\n###### Can I be fired for being injured on the job?\n\nInjuries can happen anywhere, and when a serious injury happens when you are\nat your job, the situation can be especially stressful. In some cases, workers\nmight worry that they will be fired if they...\n\nview more blog posts\n\n## Request Your Free Consultation\n\nSchedule a free consultation with one of our experienced lawyers by filling\nout the form below, or call us at (800) 616-2916\n\n  *   *   *   * How Did You Find Our Firm?Google/Internet SearchAttorney ReferralFormer Client ReferralOther\n\n  * \\-- Select Your Case Type --Personal InjuryMedical MalpracticeCivil LitigationCommercial LitigationReal Estate\n\n  * \\-- Select Your Case Venue --New YorkNew JerseyFlorida\n\n  *   * \n\n  * __\n  * __\n  * __\n  * __\n\nNew Jersey Law Office\n\n  * 45 Eisenhower Drive, Suite 220, Paramus, NJ 07652\n  * (201) 588-1500\n\nNew York Law Office\n\n  * 28 Liberty Street, 39th Floor,New York, NY 10005\n  * (212) 390-8275\n\nFlorida Law Office\n\n  * 5011 Gate Parkway, Bldg 100, Suite 100,Jacksonville, FL 32256\n  * (904) 373-7565\n\n  * Home\n  * Practice Areas\n  * Our Team\n  * Results\n  * Blog\n  * Careers\n  * Privacy Policy\n  * Contact\n\n© 2023 Varcadipane & Pinnisi, P.C. | All Rights Reserved\n\n**Disclaimer** : Information on this website is not legal advice. Reviewing\nthe information on this website does not create an attorney-client\nrelationship with our law firm. Please click here to read our full disclaimer.\n\n",
    "links": "[{\"link\": \"https://www.vpattorneys.com/insurance-claims/\", \"text\": \"Insurance Claim\"}, {\"link\": \"https://www.vpattorneys.com/\", \"text\": \"Varcadipane & Pinnisi, PC\"}]",
    "priceAndPlans": "Error: Timeout 30000ms exceeded. =========================== logs\n=========================== navigating to\n\"http://web.archive.org/web/20230614212522/https://www.vpattorneys.com/\",\nwaiting until \"load\"\n============================================================\n\n"
}