{
    "summary": "  * Home\n  * About\n    * Firm Overview\n    * Blog\n    * Video Center\n  * Attorneys\n    * Ethan L. Shaw\n    * John P. Cowart\n    * Brandon K. Spaur\n    * View All +\n  * Practice Areas\n    * Personal Injury\n    * Business Litigation\n    * Truck Accident\n    * Car Accident\n    * Medical Malpractice\n    * Workplace Injuries\n    * Wrongful Death\n    * View All+\n  * Results\n  * Testimonials\n  * Serving\n    * Austin\n    * Cedar Park\n    * Leander\n    * Pflugerville\n    * Round Rock\n    * **and Nationwide**\n  * Contact\n\nCall for your free consultationFree Consultation\n\nPhone 512-499-8900\n\nMenu\n\nReal trial attorneys who get results\n\nClick for Free Consultation\n\n_ _\n\n# Austin Insurance Dispute Lawyer\n\n* * *\n\nClick for Free Consultation\n\nWhen you have reliably paid your monthly insurance premiums, you rightfully\nexpect that the insurance company will honor its obligations in the case of a\ndisaster, accident, health crisis, or death. Policyholders may feel victimized\na second time if the insurer denies the claim, substitutes a lower benefit, or\ntakes an unreasonable amount of time to pay.\n\n## Why Choose Our Insurance Dispute Attorneys In Austin?\n\nAfter an accident, trying to get the benefits that should have been paid to\nyou without dispute can be daunting and frustrating during an already\nstressful time in your life when you may have gotten a serious or personal\ninjury. If you are getting the runaround or if your claim has been denied, our\ninsurance claim attorneys can intervene with the insurance company to\nnegotiate forcefully and effectively on your behalf.\n\nOur Austin injury attorneys are not afraid to take on the largest insurers,\nand we have a good track record of results in a wide range of insurance\ncoverage disputes. Our insurance claim attorneys know how to deal with\ninsurance companies. Our lawyers in Austin will fight to ensure your rights\nare protected. If you are being treated unfairly by your insurance company,\ncontact our dispute attorneys in Austin for a free case evaluation. We\nrepresent homeowners and consumers in Central Texas and statewide.\n\n## Representing Policyholders In Insurance Disputes at Austin\n\nInsurance companies have a vested interest in paying as little as possible in\nresolving claims, even when the claim is covered under the terms of the\npolicy. Some insurers systematically deny or delay payments, knowing that a\ncertain percentage of claimants (especially those without legal\nrepresentation) will take no for an answer or accept a lower payment.\n\n**The insurance companies know that these tactics will not work with claimants\nwho qualified and experienced insurance dispute lawyers represent.**  They\nknow that a persistent attorney will not back down. They know that such an\nattorney will demand full compensation and will be willing and prepared to go\nto trial if necessary to get satisfaction. Shaw Cowart’s involvement in these\ndisputes routinely results in a fair and timely resolution of claims.\n\nStorm damage is one of the most common scenarios of insurance coverage\ndisputes. Some insurers are notorious for slow-pay tactics or denying these\nclaims outright without any basis. We handle homeowner claims for hurricane\ndamage, wind damage, flood damage, fire loss, and other covered catastrophes.\nWe also handle other types of insurance coverage disputes, such as health\ninsurance, life insurance, and car insurance claims. In the event you have\nbeen in a car accident, contact our Austin car accident lawyers.\n\n## Can You Sue an Insurance Company for Lying?\n\nYes. If an insurance company either knowingly lies to you or misleads you, it\nis possible to make a bad faith claim against them. Generally, if the\ninsurance company does not handle your claim in a fair and reasonable manner,\nyou have legal recourse.\n\n## What Should You Not Say to Your Insurance Company After an Accident?\n\nAfter your accident, you need to be very careful about what you say to any\ninsurance company, whether it is your own or another driver’s. Even a\nseemingly harmless comment can be used against you during your claim.\nFollowing your accident, make sure you **do not** :\n\n  * Admit fault\n  * Say you have no injuries\n  * Give a recorded statement\n  * Give your insurance company access to medical records\n  * Accept a settlement offer without consulting us\n\nAny of this information will be used by the insurance company to minimize or\noutright deny your claim. If an insurance company asks for a recorded\nstatement or your medical records, call us right away.\n\n## Can an Insurance Company Refuse to Pay a Claim?\n\nYes, an insurance company can deny your claim. However, they are required to\nprovide a rationale for their denial, including evidence and coverage\ninformation.\n\n## What Happens if Your Insurance Denies a Claim?\n\nIf your insurance company denies your claim, you have a chance to appeal their\ndecision. For the appeal to be successful, you will need to make sure your\nclaim doesn’t have any mistakes and gather enough evidence to support it. This\nis where our experienced insurance coverage dispute lawyers can help.\n\n## Do Insurance Adjusters Lie?\n\nUnfortunately, there are many insurance adjusters who resort to lying or\nmisrepresentation to minimize a personal injury payout. This includes telling\nthe claimant that their policy doesn’t cover certain damages, forcing the\nclaimant to give a recorded statement, and pressuring the claimant to settle\nby a certain date. In reality, most of these deceptive tactics are used to get\nyou to accept a low settlement offer so that the insurance company saves\nmoney. At Shaw Cowart, LLP, our Austin insurance claim attorneys know these\ntactics and can help manage your claim and communication with the insurance\ncompany.\n\n## Why Might Your Insurance Coverage Claim Be Denied?\n\nTypically, an insurance company may refuse to pay your claim due to lack of\ncoverage, expired coverage, claim filing mistakes, failure to notify, or not\nseeking medical treatment. In many cases, the adjuster may just deny your\nclaim because of a dishonest interpretation of your coverage. For this reason,\nit is important to hire one of our experienced Austin insurance dispute\nattorneys.\n\n### Should You Speak to an Attorney Before Contacting the Insurance for a\nCoverage Claim?\n\nAbsolutely. The primary goal of the insurance company is to make money by\nminimizing compensation for claimants. Insurance adjusters will do almost\nanything to reduce or deny your claim, so having an attorney on your side can\nhelp level the playing field. Our insurance coverage dispute lawyers will\nhandle all communication with the insurance company on your behalf so you can\nfocus on recovery.\n\n### Read what our patients are saying!\n\n> \" Absolutely a pleasure working with the team. Mrs. Yvette is so sweet and\n> caring you can tell that she actually cares about your situation and all\n> that you are going through. I am glad that I chose these guys, at such a\n> traumatizing and confusing time, they kept me in the loop about my case, and\n> we're mindful of how traumatic it had been for us. With everything happening\n> and COVID hitting they were exactly who we needed for our case we never\n> could have done it ourselves and for that I will always be greatful. PSA if\n> you don't know where to turn to and your browsing on Google please reach out\n> to these guys at least get a consultation I promise once you do that you\n> will know immediately that they are the ones for you, I did. \"\n\nClick here to read more reviews.\n\n### Austin Insurance Coverage Litigation Attorney in Texas\n\nOur lawyers have resolved many claims through negotiation, arbitration and\nlitigation, including recovery of damages for insurance bad faith. Contact us\nif you have had trouble with your valid insurance claim:\n\n  * Extended “investigation” of your claim\n  * Delayed payout of benefits\n  * A “lowball” settlement offer\n  * Denied insurance claim\n  * Policy interpretation\n  * Policy not in force\n  * Refusal to defend you if you have been sued\n\nOur Austin insurance coverage dispute attorneys are respected as highly\nethical and knowledgeable in plaintiff representation. For a free initial\nconsultation, call **512-499-8900.**\n\nSchedule a Consultation Today\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n## Call Shaw Cowart’s Austin Insurance Dispute Attorneys Today\n\nOur insurance dispute attorneys in Austin are here to help you. Suppose you\nneed to appeal a denial of compensation or your insurance company is delaying\nyour benefits. In that case, we will do everything in our power to make sure\nyou get the compensation you deserve.\n\nCall us today at 512-499-8900 or contact us and fill out our form and we will\nschedule your appointment for a free case consultation.\n\n###  Request  \nyour Free Consultation\n\nFirst Name*\n\nLast Name*\n\nPhone*\n\nEmail*\n\nPlease describe your case*\n\n _*_ Required Fields\n\nEmail\n\nThis field is for validation purposes and should be left unchanged.\n\nSubmit\n\nΔ\n\n### Practice Areas\n\n  * Personal Injury\n  * Bicycle Accidents\n  * Birth Injuries\n  * Brain Injuries\n  * Boating Accidents\n  * Burn Injuries\n  * Bus Accidents\n  * Car Accidents\n  * Catastrophic Injuries\n  * Construction Injuries\n  * Defective Product\n  * Drunk Driving Accidents\n  * Insurance Coverage Disputes\n  * Motorcycle Accidents\n  * Oil Refinery Accidents\n  * Pedestrian Accidents\n  * Roundup Cancer Claims\n  * Truck Accidents\n  * Sexual Abuse\n  * Slip & Fall\n  * Spinal Cord Injuries\n  * Uber/Lyft Accidents\n  * Workplace Injuries\n  * Wrongful Death\n\n###  Contact - Footer\n\nRequest Your Free Consultation\n\nFirst Name*\n\nLast Name*\n\nPhone*\n\nEmail*\n\nPlease describe your case*\n\n _*_ Required Fields\n\nEmail\n\nThis field is for validation purposes and should be left unchanged.\n\nSubmit\n\nΔ\n\n##### Austin Location\n\n1609 Shoal Creek Blvd  \nSte 301  \nAustin, TX 78701\n\nMap\n\n##### Call us NOW!\n\nPhone 512-499-8900\n\n##### Social\n\n  *   *   *   * \n\n© 2023 Shaw Cowart  |  All rights reserved\n\n  * Disclaimer\n\nNotifications\n\n👋🏼 How can we help you?\n\n👋🏼 How can we help you?\n\n👋🏼 How can we help you?\n\nCar Accident\n\nWrongful Death\n\nWorkplace Injury\n\nTruck Accident\n\nMedical Malpractice\n\nOther Injuries\n\nLitigation\n\nScroll\n\nRequest a call back\n\nSubmit a phone number\n\nselect\n\nPLease enter valid phone number\n\nYou’ve requested a call for\n\n",
    "links": "[{\"link\": \"https://www.shawcowart.com/\", \"text\": \"\"}, {\"link\": \"https://www.shawcowart.com/personal-injury-lawyers-austin/\", \"text\": \"Austin injury attorneys\"}, {\"link\": \"https://www.shawcowart.com/car-accident-lawyer-austin/\", \"text\": \"Austin car accident lawyers\"}, {\"link\": \"https://www.shawcowart.com/contact\", \"text\": \"contact us\"}, {\"link\": \"https://www.shawcowart.com/insurance-coverage-dispute-lawyer-austin/\", \"text\": \"Insurance Coverage Disputes\"}]",
    "priceAndPlans": "Error: Timeout 30000ms exceeded. =========================== logs\n=========================== navigating to\n\"http://web.archive.org/web/20230805141248/https://www.shawcowart.com/\",\nwaiting until \"load\"\n============================================================\n\n"
}