{
    "summary": "  * Skip to content\n\nSearch\n\nTravefy Academy\n\nWin and retain more business.\n\nMenu\n\n  * About\n  * Webinars\n  * Podcast\n  * Contribute\n  * Travefy Software\n\n# A Guide to Email Marketing for Travel Agents\n\nBy Travefy Academy\n\nWhen it comes to marketing your travel business you might rely heavily on your\nwebsite, social media, personal branding, and others but one of the marketing\nstrategies you should also have in place if you don’t already is email\nmarketing! Did you know that 49% of consumers said that they would like to\nreceive emails from their favorite brands weekly (Statista)? Email Marketing\ndoesn’t have to be complicated either, it can be a simple solution to keep in\nconstant contact with your potential and current clients.\n\nIn this article, we will explore how to get started if you’re new to email\nmarketing and also share tips, tricks, and inspiration for anyone already\nsending emails to clients.\n\n* * *\n\n## How to Start an Email List\n\nThe most important part of email marketing is having an email list to send\nthem to so it’s important to organize your email list strategically. You may\nonly need one email list for everyone, including potential new clients and\nolder clients alike. However, it’s also smart to separate these lists out if\nyou decide to share alternative email marketing to each type of customer.\n\nFor example, you might have an email list for current and old clients who\nreceive emails about upcoming promotions, updates, etc. Then, you may have a\nseparate list for people who have reached out or shown interest in booking\nwith you. They could receive emails that are part of an email campaign to help\nget them into your sales funnel.\n\nIf you don’t have many emails yet and need to begin building your list, below\nare a couple of ways to begin building your email list:\n\n#### Lead Magnets\n\nA lead magnet is one of the most popular ways to acquire email addresses for\nmarketers! A lead magnet is a download, incentive, or “freebie” that someone\ncan receive in exchange with sharing their email with you. Examples of lead\nmagnets that travel agents can offer is an itinerary download, a travel guide,\neBook, PDF checklist, and so much more! Click here for a guide to creating\nlead magnets.\n\nTravefy Academy previously hosted a webinar with Cyndi Williams and discussed\nthe power of lead magnets and how to use them to build your email list. You\ncan watch this webinar below:\n\n#### Email Sign Up Forms\n\nAnother option to gather email addresses is to simply have a form that people\ncan sign up to receive future emails from you. Typically, you can create these\nforms with the email software tool you use but you can also put together a\nsimple Google Form and embed it onto your website to collect emails. You can\nalso add this to your social media channels too!\n\n* * *\n\n## Email Marketing Software\n\nSo you have your email list, now what? Finding the right tool to use is\ncrucial because it will be the main organizational system of your email\naddresses and allow you to effectively and efficiently build an email campaign\nand send marketing. Below are some of the most popular email software tools to\nuse along with pricing. It’s important to note that pricing depends on how\nlarge your email address list is with each software so be sure to research how\nmany email addresses you can send to.\n\n  * MailChimp (Freemium) \n  * Emma ($89/month+)\n  * Constant Contact ($20/month+)\n  * ConvertKit (Freemium) \n  * MailerLite (Freemium) \n  * Drip ($19/month+)\n  * AWeber ($19/month+)\n  * and more! \n\n**Pro Tip:** If you’re uncomfortable with spending too much money on email\nmarketing, according to the DMA, for every $1 you spend on email marketing,\nyou can expect an average return of $42!\n\n#### Other Helpful Software for Email Marketing\n\nThere are a lot of additional resources you might rely on for effective email\nmarketing. Below are some of our favorites:\n\n  * Unpslash: Get free images to use for email marketing!\n  * Canva: A great option to easily create graphics. \n  * Google Forms: A simple solution if you need to collect email addresses outside of your email software tool. \n\n* * *\n\n## Email Content Ideas\n\nOnce you have your email list and software in place, it’s time to start\ncreating email marketing content! Below you will find different ideas to\nimplement for your email marketing strategy.\n\n**A Welcome Email**\n\nThis is especially important if you have an email signup form or lead magnet,\nconsider sharing a simple welcome email to introduce yourself and share links\nto connect on your social media and website. This is also a great place to\nshowcase your expertise and tell the reader how you can help them in planning\ntheir future trips.\n\nAccording to GetResponse, a welcome email gets an average of 82% open rate!\n\n**Promotions and Sales**\n\nOne of the great things with having an email marketing strategy in place is\nthat it’s an easy way to share upcoming promotions and sales to your clients.\nYou can share supplier promotions and your own!\n\n**Business News and Announcements**\n\nBe sure to keep your email viewers in the loop with any new business\nannouncements that you might have or keep them up to date on what you’re up to\nand what you’re adding to your business. For example, if you attended a\nconference and learned about new suppliers to offer your client amazing\nexperiences, share this with them!\n\n**Curated Content of Industry News**\n\nYou’re the expert and your clients look to you for travel industry updates and\nnews. Share an email linking to various articles that will keep them updated\nand if you specialize in particular destinations you can curate this news\nbased on where your clients typically travel to.\n\n**Blog Posts and Content You’ve Created**\n\nIf you create content like blog articles on your website, you can always\npackage these articles up in an email for them to check out.\n\n**Invitation to Events You Are Hosting**\n\nIf you are hosting an upcoming live event in-person or online be sure to let\nyour audience know by sending them an email!\n\n**Relationship Building**\n\nConsider implementing emails that will help build a relationship with your\nemail list. You can send emails for important dates like birthdays,\nanniversaries, and even check-in emails 1 year after they took their last trip\nyou helped plan.\n\n**Email Campaigns**\n\nWe saved the best for last! Email campaigns are extremely effective and allow\nyou to curate a string of emails that can be automated once a new email\naddress is added to your database. An email campaign can consist of multiple\nemails that are strategically lined up for the subscriber to receive. Here’s\nan example of a simple email campaign for new leads that come to you:\n\n_Email #1: Welcome Email  \n_ Introducing the new subscriber to your email and letting them know what to\nexpect and learn more about who you are and what you can provide to them.  \n  \n_Email #2: Travel Inspiration  \n_ Highlight the destinations and travel experiences you specialize in. You can\nshare it in photos and text or link it back to your website that they can\nfurther explore.  \n  \n _Email #3: Client Testimonies  \n_ You’re the expert and you’re good at your job so show them this! Share with\nthem reviews and testimonials of past clients and this might encourage them to\nbegin booking travel with you.  \n  \n_Email #4: Industry Updates  \n_ This can be an email that you update once a month but this is another great\nway to share your expertise so that they know they can come to you for any\ntravel-related questions.\n\nOf course, your email campaign can look different but these are just ideas to\nhelp get you started. You can schedule each email to go out once a week or\nmaybe the second email comes three days after the welcome email and the rest\ncome a week later. It’s also helpful to check out the open rates and\nunsubscribe rates to adjust accordingly if needed.\n\n* * *\n\n## When Should I Send Emails?\n\nThis is one of the most popular questions when sending emails, you want them\nto be effective but you also don’t want to overdo it sending them to press the\nunsubscribe button. Unfortunately, when researching through data of this you\nmight see different results which is why it’s important to find what works\nbest for you.\n\nHowever, according to many resources, including Sleeknote, Tuesday and\nThursday are the best days. Typically, weekends should be avoided but there\nhas been data shown that for business-to-consumer emails, weekends actually do\nwell since consumers might be more likely to read their emails on the weekend\nduring more downtime.\n\nTiming is also important! According to optinmonster, 8 am and 4 pm seems to be\nthe best time to send emails.\n\nWe would encourage you to always reevaluate what is working and what is not\nfor your email list and adjust accordingly. Feel free to experiment with\ndifferent times and days as well!\n\n* * *\n\n© 2012 - 2020 TRAVEFY, INC. ALL RIGHTS RESERVED.  \nTerms of Use and Privacy Policy | Image Attribution Policy\n\n",
    "links": "[]"
}