{
    "summary": "  * All Features \n\nEmail features\n\nEasy Start Features\n\n    * Email Builder\n    * Bulk email service\n    * Personalization\n    * Signup forms\n    * Pop-ups\n    * Email analytics\n\nExpert Level Features\n\n    * A/B testing\n    * Audience segmentation\n    * Triggered emails\n    * Automation\n    * Transactional emails\n    * API\n    * Integrations\n\nSee all email features\n\n  * Pricing\n  * Services \n\nServices\n\n    * Email campaign management\n    * Affiliate program\n\n  * Resources \n\nResources\n\n    * Blog\n    * Knowledge base\n    * Comparisons\n    * Free tools\n    * Benchmarks\n    * Free marketing webinars\n\n  * Company \n\nCompany\n\n    * About Us\n    * Careers\n    * Contact Us\n    * Why choose Selzy\n    * Case studies\n\nLog in Start for free\n\n...\n\n  * Blog\n  * Tips and Tricks\n  * Starter Kit\n  * Inspiration\n  * Specials\n\nSearch posts by keywords\n\nMain page / Blog / Inspiration / Travel Agency Email Marketing: How To Do It\nRight\n\nInspiration\n\n# Travel Agency Email Marketing: How To Do It Right\n\n07 August, 2022 • ... • 8322 views\n\nby **Daria Zhuravleva**\n\nIn this article\n\n  * Why email marketing for travel agencies is so important\n  * The key aspects of a successful travel agent email to a client\n  * Most popular travel agency email types\n  * How to set up a campaign\n  * Best travel agency email examples\n  * Final thoughts\n\nShare:\n\nTry Selzy for free\n\nEasy-to-use drag-and-drop email builder, 100+ free templates, automation\ntools, in-depth analytics. Send like a pro, even if it’s your first campaign!\n\nTry it now\n\nStay in touch\n\nSubscribe to our blog digest and get tips and inspo every 2 weeks. Plus,\nyou’ll get our Foolproof Guide To Email List Building\n\nSubscribe By submitting the form, I consent to the processing of personal data\nprotected by the privacy policy.\n\nPlease, read the Privacy Policy and check the box first. We need your consent\nto get the ball rolling :)\n\nNow that the pandemic restrictions are lifted, more people start traveling. If\nyou work for a travel agency, it’s time to start an email marketing campaign\nto boost the recovery of your business and engage new customers. Read this\narticle and learn about tips and best practices and create effective travel\nagency emails.\n\n## Why email marketing for travel agencies is so important\n\nTourism was affected by the COVID-19 pandemic — people traveled less due to\nrestrictions and infection threat. According to UNWTO, in 2020 international\ntourism receipts dropped by 62% compared to 2019. International arrivals\nfollowed this trend — the decrease reached 72%.\n\nSource: World Tourism Organization\n\nAnd lockdowns were not the only factor. Measures were less strict in 2021 but\npeople still were not ready to travel. For example, according to Statista, 42%\nof Spanish citizens planned to decrease their travel budgets for 2021.\n\nSource: Statista\n\nBut what about 2022? Consider this graph.\n\nTourist arrivals in Europe from January 2019 to March 2022. Source: Statista\n\nAs you can see, people started traveling more often than in 2020 or even last\nyear. And that’s why email marketing for travel agencies is important — it’s\nan easy way to re-engage your former clients and boost the recovery of your\nbusiness.\n\n## The key aspects of a successful travel agent email to a client\n\nNow that you know the importance of email marketing for travel agencies, let’s\ntake a look at the recipe for a good email campaign in this industry.\n\n### Personalization\n\n71% of customers expect personalized communication from brands. When it comes\nto personalization in email marketing, it’s more than including your\ncustomer’s name in the greeting or the subject. One of the ways to make your\nmarketing emails more personal is giving relevant recommendations.\n\nSource: Really Good Emails\n\nFor example, Airbnb implemented location-based personalization. Right after\nthe customer arrives somewhere, they suggest what to do and where to go.\n\n### Subject lines\n\nA good email subject line can vastly improve your open rates. Here’s how you\ncan create catchy subject lines specifically for travel agency emails:\n\n**Appeal to the value of traveling.** People travel for different reasons —\ndepending on the niche of your agency, you can use different buzzwords in your\nsubject lines. Possible options include:\n\n  * Discovery, Enlightenment, Experience\n  * Relaxation, Vacation, Getaway, Weekend\n  * Adventure, Bucket list, Road trip\n\nThese word groups appeal to different audiences — know your customers and use\nwhat triggers them.\n\n**Use urgency markers.** Word combinations like “Last chance”, “Starts now”,\n“Don’t miss it”, and other similar subject lines will trigger FOMO. But don’t\noverdo this — some words might get you a one-way ticket to the spam folder.\n\n**Use jokes and puns.** A funny email subject is a great way to stand out in\nyour customer’s inbox. Examples include “Czech this out: 10 places to see in\nPrague” or “Been to South America? I don’t Bolivia”. Opportunities are endless\n— use your sense of humor to increase sales.\n\n**Get down to business.** For sales emails, the best tactic is to describe\nyour offer in the subject line. Examples include “Get 30% off our July package\nholidays” or “Save money on your next dream vacation”.\n\n### Use of visual aids\n\nThere are many ways to use visual aids. You can use photos, GIFs, videos, and\nillustrations — or come up with a minimalist email design that only highlights\nthe important elements. Typefaces and layouts also count — they make customers\npay attention to important parts of email content like CTAs.\n\nSource: Email Competitors\n\nThis World Food Day email from Contiki Travel Tours uses vibrant pictures and\nwarm colors to create a certain mood. But aside from photos, they accentuated\nthe part with CTA with an all-caps header and a bold yellow frame. These\nsimple tricks instantly draw attention to the button.\n\n### Sense of urgency\n\nThe usage of FOMO in email marketing is not limited to travel agencies. For\nexample, it’s often used in retail during Black Friday or holiday-related\npromotion campaigns.\n\nSource: Email Competitors\n\nThis email from Friendly Planet is a great example of how urgency works in\ncampaigns for travel agents. Its subject line is “Our newest trips + Last\nchance to save!” and we see a big “Deals expire tonight!” header in the email\nbody. Urgency is created via verbal cues — use them in email subjects and\ncontent copies.\n\n### Shared opportunities\n\nEven the most aesthetically pleasing email with the funniest subject line\nwouldn’t work without a valuable offer. Here are some ideas for what you can\nsuggest to your customers via email:\n\n  * Promo codes and discounts\n  * Last-minute tours that are cheaper than regular tours\n  * Convenience — for example, a fully-planned vacation plan\n  * Helpful content related to traveling — for example, guides on packaging or what to see in a certain city\n  * Unique experiences — these offers work best for niche travel agencies\n\n## Most popular travel agency email types\n\nAnother promo code is not the only reason to send emails. Let’s take a look at\nthe most popular travel agency email types. Most of these email types are not\nspecific to the industry — but they work well for travel agencies too.\n\n### Welcome emails\n\nSending a welcome email to a new customer is like giving a house tour to a\nfirst-time guest. If you show your guest where the bathroom is and offer them\ntea, they will be more comfortable staying at your place and might come over\nagain.\n\nIt works the same with email marketing. According to GetResponse, welcome\nemails have a 50% open rate, which is 86% better compared to newsletters.\n\nSource: Really Good Emails\n\nThis email from AllTrails is a great example of onboarding — they give the\nguide on using the service right away.\n\n### Newsletters\n\nA newsletter is an email you send regularly to share updates. They can be used\nfor introducing new offers, giving them something fun or useful to read, or\ninviting them to take part in a contest. Newsletters are great because:\n\n  * It’s a good source of traffic for your website.\n  * It increases brand recognition — the tone of voice and the choice of content add more details to your brand personality and make it more charismatic.\n  * It increases customer loyalty — by regular communication, you build stronger relationships between customers and your business.\n  * It gives room for personalization — by tailoring suggested website content, you can increase customer satisfaction. \n\nAnd speaking of personalization, here’s a great example from Airbnb.\n\nSource: Really Good Emails\n\nThey came up with a newsletter specifically for hosts — and included lifehacks\nand policy updates.\n\n### Confirmation emails\n\nCustomers need confirmation emails so they know that the transaction was\nsuccessful. They also need these emails to get important information like\ndelivery details or the hotel’s address. Confirmation emails also give further\ndirections for the next step in the customer flow — that’s why they are so\nimportant.\n\nSource: Really Good Emails\n\nA good example of a confirmation email is this one from Vacasa. It contains\nall the necessary information for checking in — the lockbox code, the address\nand driving directions, and even the weather forecast for easier packing.\n\n### Thank you messages\n\nThank you messages are sent after a customer completes the target action —\nlike buying something or subscribing to an email list. They might not be as\nimportant for the customer journey as confirmation emails. But thank you notes\nexpress appreciation and help you build warmer relationships with your\ncustomers.\n\nSource: Really Good Emails\n\nThis email from HotelTonight is a great example of a thank you note for a\ntraveling business. They don’t just show appreciation with words — they\nsuggest what to do next, including taking part in a loyalty program.\n\n### Informational emails\n\nThere is a difference between newsletters and informational emails.\nNewsletters are sent weekly or monthly and they give an overview of the latest\nupdates. And informational emails are sent in case of emergency.\n\nSource: Really Good Emails\n\nFor example, this Airbnb informational email is about current policies and how\nthe company handles the situation.\n\n### Re-engagement emails\n\nImagine that your best friend hasn’t reached you in three months and has been\nignoring your text messages where you suggested hanging out or watching a\nmovie they liked. If you forget them and move on, you will lose a friend. But\na wellness check message will increase the chance to win your friend back.\n\nEmail marketing works the same. You will lose customers — just like you will\ngrow apart from friends. But you can decrease these losses if you send re-\nengagement emails.\n\nSource: Really Good Emails\n\nThis is a great example of a personalized re-engagement email from\nTripAdvisor. They saw that a customer was browsing Boston-related pages — and\nbased on the hypothesis that this customer was too confused to make a\ndecision, they provided extra information on this region.\n\n### Seasonal offers\n\nMany industries have seasonal offers to give. But traveling is probably the\nmost season-driven industry. According to Eurostat, one-third of the nights\nEuropeans spent in tourist facilities were in July and August. And it’s\nreasonable — people plan long trips for summer and short trips for holidays.\nThat’s why travel agencies should send emails with seasonal offers.\n\nThis email by Sonder is a great example of how to do a seasonal offer message\nright. They don’t just give an offer — they also give useful information on\nplanning a summer trip, which adds more value to the email.\n\n### Upsell emails\n\nUpsell emails suggest a more expensive version of the same product or service\nafter your customer completed the transaction. Not only does this type of\nemail increase sales — it also raises brand awareness and increases your\ncustomers’ lifetime value.\n\nThis email from Scott’s Cheap Flights is a perfect example of upselling. After\na new customer used their app, they suggested a premium membership and\nexplained its value. They also offered a free trial period so customers won’t\nfeel pressured to spend money right now and try it out instead.\n\nKeep in mind that these are not all the possible types of emails that can be\nused for promoting travel-related businesses — we’ve listed the most popular\ntypes. And these types can be mixed together. For example, you can include a\nthank you note in a confirmation email or add a seasonal offer to a monthly\nnewsletter — it depends on the goal of your campaign.\n\n## How to set up a campaign\n\nSetting up a campaign for a travel agency is not different from other\nindustries. Here’s a short recap of the whole process.\n\n**Setting up a travel agency email campaign**  \n---  \n**Preparation** | **Content** | **Testing**  \nDefine the goals 📈 | Choose the type 🖊️ | QA testing 🧪  \nBuild your list 🗒️ | Design your email 🎨 | Split testing 💡  \nSegment the list 🥧 |   |  \n  \n###  \n\n### Define the goals\n\nEvery campaign starts with an email marketing strategy. You need to understand\nwhy you’re running a campaign in the first place — for example, to increase\nsales.\n\nThe next step is defining success criteria using the SMART framework:\n\n  * Specific\n  * Measurable\n  * Achievable\n  * Relevant\n  * Time-bound\n\nFor example, if your goal was to increase your website blog’s readership, your\nsuccess criteria would look like “Increase the number of daily unique visitors\nby 30% by the end of this month”.\n\n### Build your mailing list\n\nA mailing list is a list of users who will receive your marketing emails. Keep\nin mind that buying readymade email lists online and using them for marketing\ncampaigns is illegal. Build your list using opt-in forms and pop-ups. To learn\nmore, read our article about building an email list.\n\n### Segment the list\n\nSegmenting your email list is important for sending relevant emails. There are\nmany segmentation criteria — age, location, website activity, and so on. The\nchoice of criteria depends on your campaign and your market niche. To learn\nmore about segmentation with Selzy, visit this page.\n\n### Decide on the type of content\n\nThe type of content you chose will affect the subject line, the copy, the CTA,\nand the email layout. Choose the content type depending on your marketing\ncampaign goal.\n\nOne of the types of emails often used for travel agencies is last chance\nemails. Use these emails for promoting seasonal offers — and use our guide on\nlast chance emails with writing tips and best practices.\n\n### Design your email\n\nGood email design draws attention to CTAs, improves email readability and\nhelps you express the charisma of your brand. And a trendy look will keep your\nsubscribers engaged.\n\nTo learn more, read our guide on email design with tips and best practices.\n\n### Test and analyze the results\n\nOnce you’re done with your email content and design, test your emails before\nsending:\n\n  * QA testing — to make sure that your email campaign is set correctly, all the hyperlinks work as intended and customers won’t receive an email with a “Hello <undefined>” greeting.\n  * Split testing — to validate your ideas and hypotheses and make smarter marketing decisions. \n\nAnd this is how you set up a campaign for a travel agency. And if you’re\nafraid to miss something, use our email marketing checklist.\n\n## Best travel agency email examples\n\nNow that you know how to set up an email campaign for a travel agency, let’s\ntake a look at some examples of great campaigns in the industry. We’ve picked\n4 good travel agency emails for your inspiration.\n\n### Vacasa: Wanderlust-worthy road trips\n\nVacasa is a rental management company that operates in North and Central\nAmerica. And although their business is focused on destinations, they ran a\ncampaign that’s all about the journey.\n\nSource: Really Good Emails\n\nDomestic and rural tourism were a big traveling trend in 2021 — and it’s\npredicted to continue in 2022. Vacasa caught up on this trend and made a guide\non interesting road trip destinations within the US. We love how visually\nappealing this campaign is — and the lovely “Life is a Highway” CTA button.\nAnother good thing about this email is that you can look through rentals right\naway if you like a certain destination — it’s convenient for customers.\n\n### Intrepid: Celebrating BIPOC culture\n\nIntrepid is a US-based company that specializes in small group tours and\nadventure trips. Since the questions of oppression and justice in the\npostcolonial world have been around for a long time, they rolled out a series\nof educational tours and ran an email campaign.\n\nSource: Email Competitors\n\nIt’s hard to run a campaign like this without being offensive. Educational\ntours are great but they shouldn’t look like a trip to a zoo where the\nprivileged group looks down on the culture of those who survived genocide and\noccupation. Intrepid handled the subject matter gracefully — they give the\nword to local experts and aim at educating, not just entertaining. And the\ncampaign itself is great — it’s well-written, and beautiful pictures and\nminimalist email design create a stylish look.\n\n### Oliver’s Travels: God Save The Queen!\n\nOliver’s Travels is an agency that specializes in luxury vacations and high-\nend real estate rental in Europe. And they’ve prepared something special for\nThe Queen’s Jubilee.\n\nSource: Email Competitors\n\nFirst of all, just because you’re a luxury brand doesn’t mean you can’t throw\na pun in an email. And they didn’t stop here. Apart from the invitation, they\nadded topic-related blog articles and links to luxury castles in the UK. Maybe\nthey overdid it with CTAs. But overall, this email makes you feel like a\nqueen. Or a king.\n\n### Tripaneer: Yoga in the USA\n\nTripaneer is a travel agency that specializes in wellness holidays like\nretreats for mindfulness, weight loss, spiritual growth, and so on.\n\nSource: Email Competitors\n\nThis email about US-based yoga retreats doesn’t have a lot of text — but it’s\nincredibly well-written. And we appreciate creative CTAs — like the one about\nrolling down mats. We also like that Tripaneer added a link to a guide on\ntheir website instead of writing the whole article for the email.\n\n## Final thoughts\n\nRunning an email campaign for a travel agency is a good way to re-engage your\ncustomers who stopped traveling due to lockdowns and increase sales. Some\ncommon types of emails for campaigns in this industry include:\n\n  * Welcome emails — use them to introduce customers to your service and explain how it works.\n  * Newsletters — it’s a great way to draw more traffic to your website and stay in touch with your customers.\n  * Confirmation emails — use them to share valuable information and notify that the transaction was successful.\n  * Thank you messages — this type of email increases customer loyalty and helps you build stronger relationships.\n  * Informational emails — unlike newsletters, these emails are not sent regularly and are used to share important information, for example, about emergencies.\n  * Seasonal offers — since tourism is a season-driven industry, emails with summer vacation or holiday offers will help both you and your customers.\n  * Upsell emails — suggesting a more expensive version of what your customers already bought will increase your revenue.\n\nTo run a successful campaign for a travel agency, don’t forget about:\n\n  * Personalizing your campaign to give more relevant offers\n  * Catchy subject lines — use humor, add a personal greeting, or appeal to the value of traveling depending on your niche\n  * Visual aids — they will gently coax your customer into clicking on the CTA button\n  * Sense of urgency — verbal urgency cues will trigger FOMO\n  * Shared opportunities — offer your customers something valuable.\n\n07 August, 2022\n\n#travel\n\nArticle by\n\n43 articles\n\nDaria Zhuravleva\n\nI'm a writer with 3 years of experience, knowledge and interest in all things\nIT and marketing, and a passion for the English language. As a staff author at\nSelzy, I see my mission as an educator who makes your life easier by\nexplaining complex topics in a digestible and somewhat entertaining way.\nHobbies include birdwatching, all things music and art, writing freeform\npoetry, and hiding in the woods.\n\nVisit Daria's\n\nPrevious post\n\n### How To Warm Up an Email for Your Marketing Campaign\n\nNext post\n\n### How To Write a Good Webinar Follow-Up Email\n\n## Latest Articles\n\nby **Maria Bidogaeva**\n\nInspiration\n\nSt. Patrick’s Day Email Marketing Examples for Engagement\n\n20 February, 2024 • 4 views\n\nby **Varvara Potekhina**\n\nTips and Tricks\n\nBest Telegram Bots Every Marketer Should Know About\n\n19 February, 2024 • 38 views\n\nby **Anastasia Ushakova**\n\nTips and Tricks\n\nA Definitive Guide on What Is Substack and How It Works\n\n17 February, 2024 • 48 views\n\nby **Daria Zhuravleva**\n\nSpecials\n\nQuiz: Some of These AI Tools Don’t Exist. Can You Spot Them?\n\n14 February, 2024 • 36 views\n\nby **Ana Balashova**\n\nTips and Tricks\n\nHow To Use Email Marketing and SEO Together?\n\n13 February, 2024 • 24 views\n\nby **Natasha Zack**\n\nTips and Tricks\n\nPowerful Email Subject Lines for a Successful International Women’s Day\nCampaign\n\n12 February, 2024 • 1744 views\n\nSee more articles\n\n## Trending\n\nby **Ana Balashova**\n\nInspiration\n\n10 Most Important Email Marketing Trends That You Can Focus on in 2024 Year\n\n21 January, 2024 • 41183 views\n\nby **Valeria Shulga**\n\nSpecials\n\nHoliday Email Marketing Calendar: A Complete List of Important E-Commerce\nEvents 2024\n\n16 December, 2023 • 35508 views\n\nby **Selzy Team**\n\nSpecials\n\nIf There Were Oscars for Email Marketing, These Brands Would Sweep the Awards\n\n14 March, 2023 • 35009 views\n\nby **Selzy Team**\n\nSpecials\n\nMake Emails Not War: How Brands Helped Ukraine In 2022\n\n21 February, 2023 • 34219 views\n\nby **Valeria Shulga**\n\nInspiration\n\nChristmas Email Templates and Ideas for This Holiday Season\n\n21 November, 2023 • 29560 views\n\nby **Diana Kussainova**\n\nInspiration\n\nHeart Touching Valentine’s Day Marketing Ideas To Try Out\n\n12 January, 2024 • 27630 views\n\nby **Sara Kurczyńska**\n\nTips and Tricks\n\n10 Best Temporary Email Services in 2023\n\n24 August, 2023 • 26521 views\n\nby **Eugene Vasilev**\n\nSpecials\n\nNaughty or Nice: Which Kind of Email Marketer Have You Been This Year?\n\n15 November, 2023 • 17194 views\n\nby **Eugene Vasilev**\n\nTips and Tricks\n\nEmail Avatar: Why It Can Make a Difference for Business & How to Add It\n\n06 September, 2023 • 16277 views\n\n## The Foolproof Guide To Email List Building\n\nOthers just make a list of ways. We actually explain how to make the most of\neach way.\n\n**21 surefire ways to grow your email list** with detailed explanations and\nhand-picked examples. Based on research and **10+ years experience** in email\nmarketing.\n\nSend me the guide  I have read and agreed to Privacy Policy. By entering my\nemail I agree to subscribe to the email marketing digest by Selzy.\n\nPlease, read the Privacy Policy and check the box first. We need your consent\nto get the ball rolling :)\n\nCompany\n\n  * About Us\n  * Careers\n  * Prices\n  * Knowledge base\n  * Blog\n  * Integrations\n  * API docs\n  * Brand Book\n  * Sitemap\n\nFeatures\n\n  * Bulk email service\n  * Email builder\n  * A/B testing\n  * Email analytics\n  * Pop-ups\n  * Segmentation\n  * Automation\n  * Triggered emails\n\nLegal documents\n\n  * Terms of use\n  * Anti-spam policy\n  * Privacy policy\n  * GDPR\n  * Cookies Policy\n  * Refund\n  * Bank accounts\n  * Bug Bounty Program\n\nContacts\n\n  * support@selzy.com\n  * Ask us anything\n\nUS **+1 (929) 235-12-93**\n\n  * US **+1 (929) 235-12-93**\n  * Ukraine **0 (800) 217-095**\n  * Kazakhstan **+7 (717) 269-61-98**\n\n© 2021–2024 Selzy\n\n## Thank you!\n\nCheck your email — the guide is on it’s way to your inbox.\n\n",
    "links": "[{\"link\": \"https://selzy.com/\", \"text\": \"\"}, {\"link\": \"https://selzy.com/en/features/email/free-template-builder/\", \"text\": \"Email Builder\"}, {\"link\": \"https://selzy.com/en/features/email/\", \"text\": \"Bulk email service\"}, {\"link\": \"https://selzy.com/en/features/email/personalized/\", \"text\": \"Personalization\"}, {\"link\": \"https://selzy.com/en/features/email/subscription-forms/\", \"text\": \"Signup forms\"}, {\"link\": \"https://selzy.com/en/features/email/subscription-popup/\", \"text\": \"Pop-ups\"}, {\"link\": \"https://selzy.com/en/features/email/analytics/\", \"text\": \"Email analytics\"}, {\"link\": \"https://selzy.com/en/features/email/a-b-testing/\", \"text\": \"A/B testing\"}, {\"link\": \"https://selzy.com/en/features/email/list-segmentation/\", \"text\": \"Audience segmentation\"}, {\"link\": \"https://selzy.com/en/features/email/trigger/\", \"text\": \"Triggered emails\"}, {\"link\": \"https://selzy.com/en/features/email/marketing-automation/\", \"text\": \"Automation\"}, {\"link\": \"https://selzy.com/en/features/email/transactional/\", \"text\": \"Transactional emails\"}, {\"link\": \"https://selzy.com/en/support/category/api/\", \"text\": \"API\"}, {\"link\": \"https://selzy.com/en/support/category/integration/\", \"text\": \"Integrations\"}, {\"link\": \"https://selzy.com/en/features/\", \"text\": \"See all email features\"}, {\"link\": \"https://selzy.com/en/prices/\", \"text\": \"Pricing\"}, {\"link\": \"https://selzy.com/en/services/managed-email-campaigns/\", \"text\": \"Email campaign management\"}, {\"link\": \"https://selzy.com/en/partners/affiliate-program/\", \"text\": \"Affiliate program\"}, {\"link\": \"https://selzy.com/en/blog/\", \"text\": \"Blog\"}, {\"link\": \"https://selzy.com/en/support/\", \"text\": \"Knowledge base\"}, {\"link\": \"https://selzy.com/en/comparisons/\", \"text\": \"Comparisons\"}, {\"link\": \"https://selzy.com/en/free-tools/\", \"text\": \"Free tools\"}, {\"link\": \"https://selzy.com/en/benchmarks/\", \"text\": \"Benchmarks\"}, {\"link\": \"https://selzy.com/en/webinars/\", \"text\": \"Free marketing webinars\"}, {\"link\": \"https://selzy.com/en/about/\", \"text\": \"About Us\"}, {\"link\": \"https://selzy.com/en/about/careers/\", \"text\": \"Careers\"}, {\"link\": \"https://selzy.com/en/contacts/\", \"text\": \"Contact Us\"}, {\"link\": \"https://selzy.com/en/about/why-choose-selzy/\", \"text\": \"Why choose Selzy\"}, {\"link\": \"https://selzy.com/en/cases/\", \"text\": \"Case studies\"}, {\"link\": \"https://selzy.com/en/blog/\", \"text\": \"Blog\"}, {\"link\": \"https://selzy.com/\", \"text\": \"\"}, {\"link\": \"https://selzy.com/en/legal/privacy-notice/\", \"text\": \"the privacy\\npolicy\"}, {\"link\": \"https://selzy.com/en/blog/articles/\", \"text\": \"See more articles\"}, {\"link\": \"https://selzy.com/en/legal/privacy-notice/\", \"text\": \"Privacy\\nPolicy\"}, {\"link\": \"https://selzy.com/\", \"text\": \"\"}, {\"link\": \"https://selzy.com/en/about/\", \"text\": \"About Us\"}, {\"link\": \"https://selzy.com/en/about/careers/\", \"text\": \"Careers\"}, {\"link\": \"https://selzy.com/en/prices/\", \"text\": \"Prices\"}, {\"link\": \"https://selzy.com/en/support/\", \"text\": \"Knowledge base\"}, {\"link\": \"https://selzy.com/en/blog/\", \"text\": \"Blog\"}, {\"link\": \"https://selzy.com/en/support/category/integration/\", \"text\": \"Integrations\"}, {\"link\": \"https://selzy.com/en/support/category/api/\", \"text\": \"API docs\"}, {\"link\": \"https://selzy.com/en/about/brand-book/\", \"text\": \"Brand Book\"}, {\"link\": \"https://selzy.com/en/sitemap/\", \"text\": \"Sitemap\"}, {\"link\": \"https://selzy.com/en/features/email/\", \"text\": \"Bulk email service\"}, {\"link\": \"https://selzy.com/en/features/email/free-template-builder/\", \"text\": \"Email builder\"}, {\"link\": \"https://selzy.com/en/features/email/a-b-testing/\", \"text\": \"A/B testing\"}, {\"link\": \"https://selzy.com/en/features/email/analytics/\", \"text\": \"Email analytics\"}, {\"link\": \"https://selzy.com/en/features/email/subscription-popup/\", \"text\": \"Pop-ups\"}, {\"link\": \"https://selzy.com/en/features/email/list-segmentation/\", \"text\": \"Segmentation\"}, {\"link\": \"https://selzy.com/en/features/email/marketing-automation/\", \"text\": \"Automation\"}, {\"link\": \"https://selzy.com/en/features/email/trigger/\", \"text\": \"Triggered emails\"}, {\"link\": \"https://selzy.com/en/legal/terms/\", \"text\": \"Terms of use\"}, {\"link\": \"https://selzy.com/en/legal/antispam/\", \"text\": \"Anti-spam policy\"}, {\"link\": \"https://selzy.com/en/legal/privacy-notice/\", \"text\": \"Privacy policy\"}, {\"link\": \"https://selzy.com/en/legal/gdpr/\", \"text\": \"GDPR\"}, {\"link\": \"https://selzy.com/en/legal/cookies-policy/\", \"text\": \"Cookies Policy\"}, {\"link\": \"https://selzy.com/en/legal/refund/\", \"text\": \"Refund\"}, {\"link\": \"https://selzy.com/en/legal/accounts/\", \"text\": \"Bank accounts\"}, {\"link\": \"https://selzy.com/en/legal/vulnerability-disclosure-policy/\", \"text\": \"Bug Bounty Program\"}, {\"link\": \"https://selzy.com/en/contacts/\", \"text\": \"Ask us anything\"}]"
}