{
    "summary": "  * Pricing\n  * Services\n    * All-in-One Services List\n    * Email Marketing For Travel Advisors\n    * Social Media Marketing For Travel Advisors\n    * Website and Logo Design For Travel Advisors\n  * How It Works\n  * Team\n    * Our Advisory Board\n    * Meet The Team\n  * Dashboard\n\n# Use the #1 method of online marketing to attract new clients to your _travel\nadvisor_ business.\n\nGet our **_DONE-FOR-YOU_** monthly email campaign service and send your\nclients branded newsletters that sell your services on autopilot.\n\n********SIGN UP********\n\n**Book a Demo**\n\n### Send email campaigns that  \nare designed to inspire\n\n### Sell More Experiences  \nEach Month\n\n### Grow a List of  \nReady-to-Buy Travel Leads\n\n## **Email works better than _any_ other form of online marketing, but there’s\na problem…**\n\n* * *\n\n### Technical Expertise Required\n\n# You don't have the technical expertise to set up your services and\ncampaigns.\n\n### Content Creation & Design Skills Required\n\n# Designing and writing email newsletters that work is hard - with lots of\nroom to mess it up.\n\n### Campaign Management Required\n\n# Managing your own campaigns takes up too much time.\n\n### Too Costly to Hire a Specialist\n\n# You can’t afford to hire a full-time marketing specialist.\n\nWith Truevail’s Done-for-You Email Newsletter Campaigns, you’ll never have to\nworry about managing, creating, scheduling, sending, or reporting.\n\n****************Sign Up Now****************\n\n****Book a demo****\n\n## **Spend your time serving your clients while we create and send beautiful,\ninspiring email newsletters on your behalf.**\n\n* * *\n\n# Effortlessly attract travel clients through email every month.\n\n# Send beautiful, professional emails that make your travel business stand\nout.\n\n# Be seen as a trusted travel expert by your audience.\n\n# Grow your business for a fraction of the cost of other email marketing\nservices.\n\n************SIGN UP************\n\n**Book a Demo**\n\n## **Want to see just how much value is packed into our inspiring monthly\nemail newsletters?**\n\n* * *\n\nConnect with your clientele through a regular cadence of stunning,\nprofessionally designed newsletters that are as informative as they are\ninspiring. Choose between 1 or 2 newsletters per month, tailored to your\nbrand’s message.  \n  \nYou maintain complete editorial control, with the flexibility to edit or\nremove content as needed, ensuring each newsletter perfectly resonates with\nyour vision. For an added personal touch, you have the option to personalize\neach newsletter with your own introduction.  \n\nHere are some examples of what your monthly newsletter might look like:\n\n**View SAMPLE #1  **\n\n****VIEW SAMPLE #2****\n\n****VIEW SAMPLE #3****\n\n****VIEW SAMPLE #4****\n\n## **Here’s why you MUST add email to your marketing efforts…**\n\n* * *\n\nMost travel advisors struggle to find the time for marketing their business.\nThey know they should be using powerful marketing tools like email, but aside\nfrom the **time** it takes to set up, create, and manage month after month,\nthey don’t have the **technical expertise** , **design skills** , or **writing\nability** to make email work for them.\n\nAnd doing it wrong could be worse than not doing it all.\n\n **Email marketing is the #1 way to market your travel business online** , but\nif you aren’t doing it, you’re missing out on a huge segment of ready-to-buy\ncustomers every month.\n\nTruevail makes email marketing as easy as possible for travel advisors - **we\ndo it for you!**  And we make email marketing **surprisingly affordable** \\- a\nsmall fraction of the cost of hiring someone to do it.\n\nWith a board of seasoned travel advisors guiding our content, we deliver\ntimely, authentic, and aspirational marketing that resonates with your\nclientele.\n\nGive our email marketing service a try and start sending your clients curated\ncontent that **converts** , while you spend your time doing what you love:\nserving your travel clients.\n\n##  **Frequently Asked Questions**\n\n#### What is your Cancellation Policy?\n\nYour subscription is month to month, and you can cancel anytime, with no\npenalties or additional charges.\n\n#### How many newsletters can I send a month?\n\nYou have the flexibility to choose how often you connect with your audience.\nYou can opt for one monthly newsletter to keep your clients engaged or\nincrease the frequency to twice a month to maintain top-of-mind awareness. The\nchoice is yours, and we’re here to accommodate your preferred pace.  \n\n#### What are the next steps after I sign up?\n\nAfter signing up with Truevail, you'll embark on a streamlined setup process:\nactivate your account, customize your brand preferences, select your desired\nservices, and upload your contact list securely. You’ll then have the\nopportunity to review and fine-tune the content we craft for you before\nanything goes live. For a more detailed walk-through of each step, visit our\nHow it Works page\n\n#### How do I upload my list? Is my client database list safe?\n\nUploading your contact list is a secure and straightforward part of your\ninitial account setup. Rest assured, your data is protected with industry-\nstandard security measures. Each client’s list is kept confidential and is\naccessible only through a private login, ensuring that your information\nremains exclusive to you. Aside from sending out your newsletter to your\nclients, we will never share, sell, market to, or contact your clients for any\nreason.\n\n#### Is there a limit to how many contacts are on my list?\n\nAt Truevail, we believe in unlimited potential. That's why we've set no upper\nlimit on the number of contacts you can include in your list. Whether you're\nreaching out to a select group of high-value clients or a growing audience,\nour platform is designed to scale with your business. (Lists over 10k contacts\nmust be approved/cleaned).\n\n#### Do I need to give you any materials like content or images for the\nnewsletter?\n\nNo, we do everything for you! The newsletter is written by our professional\nand experienced travel writers. Our creative specialists handle the newsletter\nlayout, imagery, and design, and our excellent support team takes care of the\nscheduling and reporting for you.\n\n#### Will I receive a preview of each campaign?\n\nYes. Every campaign you will receive a preview of the newsletter a week before\nit goes out to ensure your information is up to date, and that the content\nmakes sense for your clients.\n\n#### What happens if a section of the newsletter doesn't fit in with the\nservices I offer?\n\nYou can delete any section(s) that do not work for you by contacting our\nsupport team.\n\n#### Who is the ‘sender’ name and ‘sender’ email? Will it come from me?\n\nAbsolutely, it will come from you. You can personalize the 'from' name to make\nit recognizable to your clients (e.g., 'Mary from Inspired Travels').\nAdditionally, you have the option to authenticate your own domain for sending\nemails, ensuring they resonate with your personal or agency brand, or you can\nuse a specialized email address provided by us, maintaining consistency and\nprofessionalism in your communications.\n\n#### Can I edit or add my own content to the newsletter?\n\nYes, you have full control over your newsletter's content. Not only can you\nedit and personalize the content we create, but you're also free to add your\nown custom introduction or conclusion to each newsletter to give it a personal\ntouch that resonates with your brand and audience.\n\n#### How do you come up with the monthly content?\n\nOur content creation process is driven by insights from our advisory board,\nwhich meets monthly to ensure that the material is not only current but also\nforward-thinking. Drawing on their wealth of industry experience, we curate\ncontent that speaks directly to the interests and aspirations of luxury\ntravelers.\n\n#### Can I send out my own custom newsletter?\n\nWhile our team provides expertly crafted newsletters, you retain full control\nto make edits or add your own custom content, ensuring every message aligns\nwith your brand's voice. Plus, keep an eye out for our upcoming DIY model, set\nto launch early next year, giving you even more creative control to design\nnewsletters from scratch .\n\n## **Join Truevail and transform your marketing from time-consuming to time-\ncelebrating. Let’s inspire together.**\n\n****Sign up Now****\n\n**Book a demo**\n\n  * Pricing\n  * Services\n  * About\n  * How It Works\n  * Testimonials\n  * Privacy Policy\n  * Terms and Conditions\n  * Legacy Account\n  * Contact & Support\n  * Dashboard Login\n\n© Copyright 2024 Truevail, all rights reserved.\n\n##### **Get access to our FREE marketing guide**\n\n###  **\"5 Key Marketing Techniques You _Aren't Doing_ as a Busy Travel\nAdvisor\"**\n\n**YES, I WANT THE FREE GUIDE**\n\nNo, thanks!\n\nx\n\n``\n\nx\n\nNotifications\n\n",
    "links": "[{\"link\": \"https://truevail.com/services/email-marketing/\", \"text\": \"Email Marketing For Travel Advisors\"}]",
    "priceAndPlans": "  * Pricing\n  * Services\n    * All-in-One Services List\n    * Email Marketing For Travel Advisors\n    * Social Media Marketing For Travel Advisors\n    * Website and Logo Design For Travel Advisors\n  * How It Works\n  * Team\n    * Our Advisory Board\n    * Meet The Team\n  * Dashboard\n\n# Truevail Essentials Basic Membership\n\n🔍\n\n$69.00 / month with 1 month free trial and a $199.00 sign-up fee\n\nIncludes:\n\nMonthly Branded and Automated E-Newsletter Campaign\n\nLead Capture Opt-In Forms for Your Current Website\n\nMonthly E-Newsletter Campaign Reporting\n\nQuarterly Lead Engagement Reporting\n\nAccess to members only Educational and Marketing Materials\n\nUp to 999 Contacts: Additional fee of $10/mo per additional 1000 Contacts\n(Contact amount assessed during setup)\n\n- Truevail Essentials Basic Membership quantity +\n\nSign Up Now\n\nCategory: Memberships\n\n## Related products\n\n  * ## Truevail Essentials Plus Membership\n\n$69.00 / month with a 4-week free trial and a $299.00 sign-up fee Sign Up Now\n\n  * ## Single Page Website – Creation and Hosting (Tradeshow Special)\n\n$29.00 / month with a 2-month free trial and a $199.00 sign-up fee Sign Up Now\n\n  * ## Seven (7) Page Website – Creation and Hosting\n\n$29.00 / month with 1 month free trial and a $699.00 sign-up fee Sign Up Now\n\n  * ## Truevail Essentials Custom Plus Membership – Agency\n\n$79.00 / month Sign Up Now\n\n#### Get in touch\n\n### Join Truevail community.\n\nGet curated content to your inbox from our trainers, instructors and nutrition\nexperts to keep you feeling your best.\n\nSign Up\n\n## test\n\nRead More\n\n## Website Newsletter Opt-In Form Update Request\n\nRead More\n\n  * Pricing\n  * Services\n  * About\n  * How It Works\n  * Testimonials\n  * Privacy Policy\n  * Terms and Conditions\n  * Legacy Account\n  * Contact & Support\n  * Dashboard Login\n\n© Copyright 2024 Truevail, all rights reserved.\n\nNotifications\n\n"
}