{
    "summary": "Sign up for free\n\nSkip to content\n\n  * Features \n    * Features Overview\n    * Email Template Builder\n    * Segmentation\n    * Personalization\n    * Marketing Automation\n    * Transactional Email\n    * Analytics\n    * AI\n    * Integrations\n    * Signup Forms\n    * SMS\n    * Expert Services\n    * What's New\n  * Pricing \n  * Resources \n  * Customers \n  * Gallery \n  * Agencies \n  * Support\n  * Sales \n\n  * Try it free \n  * Log in \n  * Contact us \n\nASK US YOUR QUESTIONS\n\nRequest a live demo Contact the sales team Contact the support team\n\nResources Hub » Blog  » 10 Tips for Wildly Successful Travel and Hospitality\nEmail Marketing Campaigns\n\n###### 10 minute read time\n\n# 10 Tips for Wildly Successful Travel and Hospitality Email Marketing\nCampaigns\n\nCampaign Monitor - Nov 21, 2019\n\n_Article first published June 2017, updated November 2019_\n\nAs travelers crisscross the globe, they’re spending money on flights,\naccommodations, food, and activities. In 2016, 1.2 billion people traveled\ninternationally and spent $1.5 trillion, according to the U.S. Travel\nAssociation.\n\nTo help captivate travelers, increase loyalty, and give reservations a boost,\nhere’s a look at ten wildly successful email marketing campaigns that you can\nmimic this year. However, before we jump into those campaigns, let’s first\ntalk about why email marketing is vital to the travel and hospitality sectors.\n\n## Why email marketing matters for hospitality\n\nThe travel and hospitality industries are two of the most competitive\nindustries, and, to succeed in these industries, you must make every\nexperience matter for each of your customers. While some marketing\nprofessionals may believe that the experience is in the stay, it’s vital to\nremember that email marketing can and will play an essential role in your\ncustomer’s overall experience.\n\nWhen it comes to driving revenue, email marketing is the single most\nbeneficial channel that can be utilized. With an average return on investment\nof $38 for every $1 spent, email marketing has the best ROI.\n\nHowever, to maximize your ROI, you need to make sure that you’re staying on\ntop of your campaign’s benchmarks and utilizing email marketing best\npractices, such as email personalization and A/B testing before sending.\n\n**_Source:_** _Campaign Monitor_\n\n###### Plan their path\n\nWith powerful segmentation, easily create customized journeys for your\nsubscribers.\n\nLearn More\n\nWhen it comes to maximizing your email marketing efforts, there are several\nkey things to keep in mind. The first is personalization.\n\nMore and more consumers simply expect personalized emails from brands they\nfrequent, and that includes the travel and hospitality industry. In fact,\npersonalized subject lines produce an average 65% open rate in the travel\nindustry, while personalized emails deliver a transactional rate 6 times\nhigher.\n\nPersonalization can come in several different forms, including:\n\n  * Subject lines\n  * Personalized travel suggestions\n  * Itinerary suggestions\n  * Travel content relevant to the user’s browsing behavior\n\n**_Source:_** _Really Good Emails_\n\nThe best way to help you personalize your campaigns to the needs of your\nreaders is through email list segmentation. Email marketers have found email\ncampaigns that have been properly segmented see an average 760% increase in\nrevenue. Segment your lists in different ways, including:\n\n  * Gender\n  * Browsing history\n  * Purchase history\n  * Average spend amount\n  * Travel time booked and more\n\nWhile personalization helps to intrigue your email subscribers into opening\nand skimming your email messages, it’s the design and choice of images that\nare going to make your emails stand out from the rest of the crowd. The\naverage individual remembers 80% of what they see, compared to only 20% of\nwhat they read. To encourage your readers to not only remember your brand, but\nengage with it, include a variety of beautiful images, videos, and maybe even\nsome interactive content to help them stay interested in what it is you have\nto say.\n\n## 10 tips for successful travel and hospitality email marketing campaigns\n\nUnderstanding just how vital email marketing can be to the travel and\nhospitality industry is only the first step when it comes to developing your\nbrand’s email marketing strategy. The next step is to start developing email\ncampaign ideas to send to those who’ve opted into your email subscription.\n\nNeed help getting started? Here are 10 tips to help guide your planning\nprocess:\n\n### 1\\. Give travelers a warm welcome.\n\nWhen a traveler signs up for your emails, it’s time to roll out the red\ncarpet. Send your new contact a welcome email with a warm greeting and\ninformation that encourages the subscriber to learn more about your brand.\n\nYou can automate welcome emails triggered to arrive in a subscriber’s inbox\nimmediately following their signup. Research shows welcome emails that are\nsent in real time have an 88% open rate and a 29% click-through rate, which is\nsignificantly higher than welcome emails that are sent in batches that garner\n52% open rates and 12% click-through rates, according to Experian.\n\nHere’s a great example of a welcome email sent by Fairmont Hotels to its new\nsubscribers. It encourages subscribers to check out destinations where\nFairmont Hotels are available:\n\n### 2\\. Provide travel inspiration.\n\nWith so many places to go, travelers need some inspiration. Research shows a\ngrowing number of travelers are looking to visit lesser known areas or non-\ntouristy locales, according to the 2016 Virtuoso Luxe Report.\n\nCreate and send emails that showcase exotic places to visit or little cities\nthat are off the beaten path.\n\nNo matter what destinations you tout, make sure you include awesome images to\ngo with it. Images not only draw attention, but they also help travelers\nimagine themselves sitting under a palm tree or touring the streets of a city.\n\nFlight Centre does a great job inspiring subscribers with these newsletter-\nlike emails that showcase great destinations (with compelling images) at a low\nprice.\n\n**Pro tip** : The secret to success for these emails is that Flight Centre\nuses data they have about their customers with dynamic content to deliver\ndeals that’ll appeal to preferences, prior purchases, and web browsing\nbehaviors.\n\n### 3\\. Personalize travel ideas and deals.\n\nWhile sending emails filled with fun travel destinations is a great start, you\ncan up your email game by personalizing those emails, like we saw in the\nFlight Centre email.\n\nA personalized email is more relevant to a subscriber, which makes him or her\nmore likely to open it and click through.\n\nTo personalize emails, you should capture information from your subscribers or\nuse data from other third-party apps like your booking app, ecommerce app, or\nyour CRM. Every piece of information you gain provides more insight into your\ncustomer and gives you the ability to provide customized travel offers.\n\nCheck out Campaign Monitor’s latest acquisition, which will make this easier\nthan ever.\n\nDuring the email sign up process, Air Canada asks new subscribers to tell them\ntheir home airport and what destinations they’re interested in. Using this\ninformation, the company sends promotions that are relevant to the\nsubscriber’s interests.\n\nThe flight deals depart from the subscriber’s home airport—which, in this\ncase, is Montreal—and go to destinations that the subscriber is specifically\ninterested in.\n\n### 4\\. Provide gift ideas on holidays.\n\nCase Study\n\n##### With hyper-personalized emails, Bluetent experiences huge wins in the\nhospitality space.\n\nLearn how\n\nWhen a holiday rolls around, send travel ideas. People are always hunting for\na great gift, so why not encourage them to think outside of the gift-giving\nbox?\n\nFlight Centre sent its subscribers an email on Mother’s Day that said, “Brunch\nis nice, but a trip is better.” It’s humorous, timely, and, most importantly,\nit could encourage two bookings—not just one.\n\nIn this example, subscribers can enter to win a Mother’s Day trip by giving\nfeedback. You can try that, or just send a promotional email on a holiday of\nyour choice.\n\n### 5\\. Provide testimonials.\n\nTravelers aren’t just scouring the web for the most affordable trip; they’re\nalso reading reviews. Ninety-three percent of travelers worldwide say their\nbooking decisions are influenced by online reviews, according to research from\nTripAdvisor.\n\nSince travelers are so dependent on reviews, why not help them out? Consider\ncreating an email that has several testimonials from happy customers and give\nsubscribers a link to read more.\n\nFairmont Hotels sends this testimonial email with a CTA that leads subscribers\nto read stories from real guests.\n\n### 6\\. Encourage travelers to join your loyalty program.\n\nLoyalty is a hard nut to crack in the travel and hospitality business.\nTravelers tend to search for the best deals rather than favor a specific\nbrand. However, if you have a rewards program, you can use it to encourage\nloyalty and repeat business.\n\nResearch shows members of a loyalty program generated 12 to 18% more revenue\nfor a brand than non-members did in 2016, according to Accenture.\n\nSend current subscriber’s emails that focus on the program and its benefits.\nInclude a call to action that leads subscribers to an easy signup form. Here’s\nan email from Fairmont Hotels that does exactly that:\n\n### 7\\. Give loyalty members incentives to travel.\n\nAfter attracting subscribers to your loyalty program, you can send emails that\nare specific to this niche. Consider segmenting this list into smaller groups\nbased on buying behavior, popular destinations, or location.\n\nBy segmenting your list, you can provide relevant travel ideas and incentives\nthat encourage travelers to take action.\n\nFor instance, you can email subscribers in Los Angeles a travel deal that\ndeparts out of LAX or give members double points for making a reservation.\n\nBritish Airways offers its loyalty members a chance to double their air miles\nby booking a flight in the next 45 days. The email even includes the member’s\npoints status in the email.\n\nBy using email to promote its loyalty program, British Airways can incentivize\nmore travelers to book a trip.\n\n### 8\\. Provide access to experiences.\n\nTravelers are looking for an experience, not just a destination. That’s why\nit’s important to promote activities that are available to travelers. By\nfocusing on the journey and not just the destination, you can create memorable\ncustomer experiences.\n\nFor instance, don’t just promote great rates on a room; promote all of the\nservices that are available at your hotel as well. Appeal to the business\ntraveler with an email promoting your business center or tell families about\nthe Olympic-sized pool that’s sure to keep the kids entertained.\n\nThink of ways to give travelers a unique experience like Virgin Experience\nDays does with this email that offers a chance at virtual reality skydiving.\n\n### 9\\. Offer a limited-time deal.\n\nSeventy-six percent of business travelers and 70% of leisure travelers book\nwith a specific brand because of price, according to Google.\n\nConsidering the priority of great pricing, send emails to your subscribers\nthat give them the chance to take a great trip for an unbeatable price. Show\nsubscribers how sweet these deals are by putting a time limit on them.\n\nThe tight deadline should encourage subscribers to act fast. Flight Centre\nused this idea in a recent email that offered cheap deals to New York City. To\nconvey this limited time offer, Flight Centre added a countdown clock to the\nbottom of the email.\n\n### 10\\. Give travelers a chance at spontaneity.\n\nIt takes the average traveler 45 days to book a vacation, according to\nresearch from Expedia. However, not every traveler invests that kind of\nplanning time.\n\nIn fact, some travelers are looking to get away quickly. Give subscribers the\nchance to take a spontaneous trip with a can’t-resist email offer. Flight\nCentre sent this email to subscribers with a link to last-minute vacations\nthat start at $530. Read all about how Flight Centre increased their click-\nthroughs by 57%.\n\n## Wrap up\n\nWhile competition in the travel and hospitality industry is fierce, all of\nthese tips are designed to help you attract and retain subscribers. Sending a\nvariety of emails that focus on deals, destinations, fun experiences, and\nloyalty programs gives you a competitive edge and keeps travelers coming back\nfor more.\n\nSome email marketing campaigns that you should consider adding to your email\nmarketing strategy can include:\n\n  * Welcome series\n  * Travel inspiration\n  * Personalized travel deals\n  * Gift suggestions for the holiday season\n  * User testimonials\n  * Loyalty program invitations\n  * Loyalty programs incentives to travel\n  * Access to experiences\n  * Limited-time deals\n  * Offer chances for spontaneity\n\n_**Ready to take your travel and hospitality email marketing to the next\nlevel?Schedule your live demo today and see what Campaign Monitor can do for\nyou.**_\n\n### Travel comms made easy\n\nSimplify your travel and hospitality emails with our global team and unique\nintegrations.\n\nLearn more\n\nThis blog provides general information and discussion about email marketing\nand related subjects. The content provided in this blog (\"Content”), should\nnot be construed as and is not intended to constitute financial, legal or tax\nadvice. You should seek the advice of professionals prior to acting upon any\ninformation contained in the Content. All Content is provided strictly “as is”\nand we make no warranty or representation of any kind regarding the Content.\n\nTwitter Facebook LinkedIn\n\n###### Get started with one of our free templates.\n\nBuild an email\n\n###### Start sending now\n\nTry it for free\n\nPress CTRL+D to Bookmark this page\n\n## You should also check out this other helpful content.\n\n###### Blog Post\n\n#### 7 Travel and Hospitality Digital Marketing Tips: A Cheat Sheet\n\nOur cheat sheet gives marketers tips for excellent experiences and repeat\nbookings.\n\n###### Blog Post\n\n#### 10 Travel and Hospitality Marketing Trends You Need to Know\n\nThe top 10 trends to boost bookings in 2019 for your travel and hospitality\ncampaign.\n\n###### Blog Post\n\n#### 10 Tips for Wildly Successful Travel and Hospitality Email Marketing\nCampaigns\n\nHere’s a look at ten wildly successful email marketing campaigns that you can\nmimic this…\n\nProduct\n\n    Features\n    Pricing\n    Integrations\n    API\n    Email Templates\n\nEmail Marketing\n\n    Agencies\n    Retail\n    Nonprofit\n    Entertainment\n    Publishing\n    Technology\n    Travel\n\nCommunity\n\n    Get Started\n    Customers\n    Resources\n    Blog\n    Email Academy\n    Support\n\nCompany\n\n    About us\n    Leadership\n    Trust Center\n    Careers\n    In the news\n    Sitemap\n    Modern Slavery Statement\n    \n\nLinkedIn Twitter Facebook Instagram\n\nTerms & Policies Do not sell my personal information © 2024 All Rights\nReserved\n\nCampaign Monitor by Marigold: where relationships take root.\n\n  \n\nSome U.S. state privacy laws offer their residents specific consumer privacy\nrights, which we respect as described in our privacy statement. To exercise\nother rights you may have related to cookies, select \"More Info\" or see this\n\"Do Not Sell My Personal Information\" link.\n\nMore Info\n\n",
    "links": "[{\"link\": \"https://www.campaignmonitor.com/email-marketing/\", \"text\": \"email marketing\"}, {\"link\": \"https://www.campaignmonitor.com/blog/email-marketing/the-ultimate-guide-to-email-marketing-for-the-hotel-industry/\", \"text\": \"travel and hospitality industries\"}, {\"link\": \"https://www.campaignmonitor.com/email-marketing-best-practices/\", \"text\": \"email marketing best practices\"}, {\"link\": \"https://www.campaignmonitor.com/travel-and-hospitality/\", \"text\": \"Campaign Monitor\"}, {\"link\": \"https://www.campaignmonitor.com/resources/infographics/24-email-marketing-stats-need-know/\", \"text\": \"760% increase in revenue\"}, {\"link\": \"https://www.campaignmonitor.com/blog/email-marketing/how-to-use-a-welcome-email-to-engage-your-subscribers-from-the-start/\", \"text\": \"automate welcome emails\"}, {\"link\": \"https://www.campaignmonitor.com/customers/flight-centre/\", \"text\": \"Flight Centre\"}, {\"link\": \"https://www.campaignmonitor.com/blog/email-marketing/how-to-use-personalization-in-email-marketing-campaigns/\", \"text\": \" personalizing those emails\"}, {\"link\": \"https://www.campaignmonitor.com/resources/collections/personalization/\", \"text\": \"A personalized email\"}, {\"link\": \"https://www.campaignmonitor.com/blog/email-marketing/call-to-action-email-marketing/\", \"text\": \"call to action\"}, {\"link\": \"https://www.campaignmonitor.com/demo/direct/?sv=seo-travel\", \"text\": \"Schedule your live demo today\"}, {\"link\": \"https://www.campaignmonitor.com/blog/email-marketing/10-tips-successful-travel-hospitality-email-marketing-campaigns/\", \"text\": \"\"}]"
}