{
    "summary": "Skip to main content\n\nNew in Litmus! Listen to your subscribers and drive engagement with Live\nPolls.  **Learn more.** __ __\n\n  * Capabilities\n\nCapabilities\n\nLitmus is an all-in-one email marketing solution that helps you optimize and\npersonalize every email to maximize your ROI and create exceptional brand\nexperiences for every subscriber.\n\n    * Why Litmus\n    * Email Design\n    * Email Building\n    * Email Personalization\n    * Email Testing\n    * Spam Testing\n    * Email Analytics\n    * Email Collaboration and Review\n    * Technology Integrations\n    * AI & Emerging Email Technologies\n\nWhat's New\n\nOur latest updates to make your email marketing even more effective.\n\n* * *\n\nGive subscribers a voice and watch your email engagement soar\n\nNew Live Polls in Litmus Personalize make it easy and fun for subscribers to\nshare their opinion with your brand. In return, gain insight into what your\naudience cares about most to strengthen first-party data and ensure every\ncampaign is better than the last.\n\nCreate omni-channel brand experiences in minutes\n\nConnect the power of social media to your email campaigns with easy-to-\nconfigure Instagram Feeds. Showcase your brand’s latest Instagram posts in\nemail campaigns to create a visually compelling and consistent omni-channel\nbrand experience that invites users to engage with your brand.\n\nLearn more\n\n  * Solutions\n\nEmail Service Provider\n\nLitmus gives you a powerful set of tools to increase conversions and get more\nROI from your ESP.\n\n    * Acoustic Campaign\n    * Adobe Campaign Standard\n    * Adobe Marketo\n    * Campaign Monitor\n    * HubSpot\n    * Klaviyo\n    * Mailchimp\n    * Oracle Eloqua\n    * Oracle Responsys\n    * Pardot\n    * Salesforce Marketing Cloud\n    * SAP Marketing Cloud\n\n700,000+ users across companies of all industries and sizes trust Litmus to\nincrease conversions and ROI.\n\nBy Industry\n\n    * Marketing & Ad Agencies\n    * Financial Services\n    * Retail & eCommerce\n    * Software & Technology\n    * Travel\n    * Sportsbook & Casino\n\nBy Role\n\n    * Designers & Developers\n    * Marketers\n    * Marketing Leadership\n\n  * Pricing\n\nSee All Plans\n\n**Say goodbye to broken emails in less than 2 minutes.**  \nFind the Litmus plan that’s just right for your team.\n\n __Compare Plans\n\n* * *\n\nLitmus Basic\n\n**Starting at $79 per month.** Build and test emails that drive results and\nlook great in every inbox.\n\nSee Litmus Basic features\n\nLitmus Plus\n\n**Starting at $159 per month.** Test more efficiently and improve future sends\nwith advanced email QA and analytics.\n\nSee Litmus Plus features\n\nLitmus Enterprise\n\n**Customized pricing.** Make the most of every send with seamless\ncollaboration, advanced security, and robust integrations.\n\nSee Litmus Enterprise features\n\nLitmus Personalize\n\n**Customized pricing.** Get powerful results with uniquely personalized,\nengaging email experiences that boost customer loyalty and drive revenue.\n\nSee Litmus Personalize features\n\n  * Resources\n\nEmail marketing content\n\nElevate your email marketing with our expert insights, tips, trends, and\ntools.\n\n    * Resource Center\n    * Blog\n    * Ebooks and Reports\n    * State of Email Reports\n    * Convince Your Team\n\nFree Tools\n\nLeverage these free tools from Litmus to enhance your email marketing today.\n\n    * Email Client Market Share\n    * Templates\n    * Gmail Tabs Check\n    * Litmus Scope\n\nCustomers\n\nThousands of brands across every size and industry trust Litmus to send better\nemail, faster.\n\n    * Community\n    * Customer Success Stories\n    * Email Gallery\n    * Litmus Academy\n    * Help Center\n\nEvents\n\nJoin us at an upcoming event, conference, or view previous events on-demand.\n\n    * Upcoming Events\n    * Previous Events\n\n  * Company\n\nCompany\n\nHere at Litmus, we help companies get more from their entire marketing mix by\nputting the most dependable channel—email—first.\n\n    * Our Story\n    * Careers\n    * News\n    * Partner With Litmus\n    * Co-Marketing With Litmus\n    * Leadership\n\nContact Us\n\nHeadquarters - Boston675 Massachusetts Avenue, 10th Floor  \nCambridge, MA 02139  \n+1 (866) 787-7030  \nhello@litmus.com\n\nSilicon Valley231 2nd Avenue  \nSan Mateo, CA 94401\n\nLondonFloor 3, 9 Devonshire Square  \nLondon EC2M 4YF\n\n________\n\nSearch\n\nClose search ×\n\nLogin Try for Free\n\n# Litmus for real-time, personalized travel industry email marketing\n\nGet accurate, relevant updates to travelers at the very moment they need it.\nLitmus empowers hotels, airlines, travel agencies, and travel brands to send\nemails that result in the best customer experience.\n\nGet started today\n\n## Make every send count with Litmus\n\nLitmus is the all-in-one marketing platform that empowers you to build,\npersonalize, test, review and analyze emails more effectively than ever.\n**With Litmus, you can:**\n\n### **Build It**\n\nBoost the efficiency of your email marketing team with all the tools you need\nto design, create, and personalize emails for every traveler at scale.\n\n### **Test It**\n\nSay goodbye to manual email testing and lengthy review and approval processes\nand hello to error-free emails that inspire subscribers to take action.\n\n### **Trust It**\n\nGet the uptime, security, and reliable email analytics needed to ensure every\nsubscriber has the most up-to-date, relevant travel details at all times.\n\n> “Litmus Personalize has helped elevate our email content to the next level\n> and is much more to come. We are really pleased with our current results,\n> the technology has made a huge difference to the number of bookings we’ve\n> received from email!”\n\n**Andy Brewer,**  \nSales Manager, Blue Sea Holidays\n\n**35%**  \nmore bookings\n\n> Using a combination of behavioral data, improved segmentation, and geo-\n> targeting capabilities within Litmus Personalize, Blue Sea Holidays sends\n> dynamic follow up emails with custom deals for each subscriber, increasing\n> engagement and revenue.\n\n## Elevate your content and drive more conversions through your email\ncampaigns\n\nIn an ever-changing world where every moment matters, personalizing emails at\nthe time they’re sent puts relevancy at risk. Litmus Personalize gives travel\nbrands the tools to personalize individual traveler email marketing\nexperiences, boosting customer loyalty and driving more revenue. The best\npart? Emails are personalized at the moment they’re opened.\n\n## **Display the latest travel deals in real time to drive revenue**\n\nStay top-of-mind by combining a feed with your top deals and promotions with\ncompelling imagery to automatically promote the latest travel deals. Automate\nthe content travelers want to see, and provide timely deals they don’t want to\nmiss.. Create beautiful designs that show or hide callouts or stickers like\n“last-chance” or “almost sold out” based on flags in your feed.\n\nSee how to automate dynamic content\n\n## **Create urgency and drive bookings with content automation in browse\nabandonment triggers**\n\nRemind travelers of the deals they might miss out on or have left behind. Use\ncontent automation in browse abandonment data from your CRM to automatically\npopulate browse abandonment emails with real-time travel deal information—like\nthe latest pricing, availability, and offers associated with the abandoned\ndeal.\n\n## **Build traveler brand trust by displaying hyper-personalized content at\nthe moment of open**\n\nConnect your CRM data to create compelling emails that will display content\nbased on specific data for each and every recipient, like products related to\ntheir past purchase history, or travel loyalty information. At every open, the\nAPI retrieves the most up-to-date content so recipients always see the latest\ndeal information including prices, discounts and availability.\n\nLearn More About Email Personalization\n\n## Join the top travel brands that trust Litmus to create better emails\n\n## It’s time to get more from your marketing—with a partner you can count on\n\nLitmus empowers you to make every send count. It’s a core component of your\ntech stack that allows you to create, personalize, test, review, and analyze\nevery email you send.\n\nGet Started Today\n\n×\n\n*\n\nWork Email\n\n*\n\nFirst Name\n\n*\n\nLast Name\n\n*\n\nCompany\n\n*\n\nJob Title\n\n*\n\nPhone\n\n*\n\nWhich is the primary provider you use to send email campaigns?\n\nSelect...AcousticAdobeCampaign\nMonitorEloquaEpsilonHubSpotKlaviyoMailchimpMarketoNoneOtherPardotResponsysSalesforce\nMarketing Cloud (Formerly ExactTarget)SAP Marketing Cloud\n\n*\n\nHow did you hear about Litmus?\n\nLitmus uses the information you provide us to bring you great content about\nemail marketing trends, stats, events and relevant products and services. You\nmay unsubscribe from these communications at any time. For more information,\ncheck out our Privacy Policy.\n\nRequest Enterprise Pricing →\n\nEmail marketing made better\n\n**Contact**  \n675 Massachusetts Ave., 10th Floor  \nCambridge, MA 02139  \n+1 (866) 787-7030  \nhello@litmus.com\n\n  * Capabilities\n    * Why Litmus\n    * Email Design\n    * Email Building\n    * Email Personalization\n    * Email Testing\n    * Email Analytics\n    * Email Collaboration & Review\n    * Technology Integrations\n  * Resources\n    * What’s New\n    * Blog\n    * Events\n    * Ebooks & Reports\n    * Litmus Live 2023\n    * Customer Success Stories\n    * Convince Your Team\n    * Templates\n    * Community\n  * Company\n    * Our Story\n    * Careers\n    * Leadership\n    * News\n  * Support\n    * Contact Us\n    * Help Center\n    * System Status\n    * Trust Center\n\n© Litmus Software, Inc. 2005-2024. All rights reserved\n\n  * Privacy Policy\n  * Terms of Service\n\nLitmus does not engage in the sale of customer data.\n\nView Information about CCPA/CPRA Compliance\n\n  *   *   *   * \n\ntwitterfacebooklinkedinyoutube-playinstagramsearch envelope\n\n",
    "links": "[{\"link\": \"https://www.litmus.com/industry/retail/travel-email-marketing\", \"text\": \"Travel\"}, {\"link\": \"https://www.litmus.com/pricing/\", \"text\": \"Try for Free\"}, {\"link\": \"https://www.litmus.com/customers/\", \"text\": \"Customer Success Stories\"}, {\"link\": \"https://www.litmus.com/about/\", \"text\": \"Company\"}, {\"link\": \"https://www.litmus.com/press/\", \"text\": \"News\"}]"
}