{
    "summary": "By clicking “Accept all cookies”, you agree to the storing of cookies on your\ndevice to enhance site navigation, analyze site usage, and assist in our\nmarketing efforts. View our Cookie Policy.\n\nCookies settings\n\nDo not sell or share my personal informationAccept all cookies\n\nAllow selection\n\nStrictly Necessary Cookies (32)\n\nShow details (Strictly Necessary Cookies)\n\nThese cookies are crucial to a website, they are necessary to provide you with\nServices available through our website and to use some of its features, such\nas access to secure areas, login-related cookies, which we use when you are\nlogged in so that we can remember this fact. This prevents you from having to\nlog in every single time you visit a new page. You can refuse or delete these\ncookies, but in this case, our website page might not function properly.\n\nName| Provider| Purpose| Expiry| Type  \n---|---|---|---|---  \ntheme| MailerLite| This cookie is part of a bundle of cookies which serve the\npurpose of content delivery and presentation. The cookies keep the correct\nstate of font, blog/picture sliders, color themes and other website settings.|\nPersistent| HTML  \n__cf_bm [x2]| MailerLite  \nThinkific| This cookie is used to distinguish between humans and bots. This is\nbeneficial for the website, in order to make valid reports on the use of their\nwebsite.| 1 day| HTTP  \n__stripe_mid| Stripe| This cookie is necessary for making credit card\ntransactions on the website. The service is provided by Stripe.com which\nallows online transactions without storing any credit card information.| 1\nyear| HTTP  \n__stripe_sid| Stripe| This cookie is necessary for making credit card\ntransactions on the website. The service is provided by Stripe.com which\nallows online transactions without storing any credit card information.| 1\nday| HTTP  \n_thinkific_session| MailerLite| Preserves the visitor's session state across\npage requests.| Session| HTTP  \nCookieConsent [x5]| Cookiebot| Stores the user's cookie consent state for the\ncurrent domain| 1 year| HTTP  \nsso_session| MailerLite| Pending| 1 day| HTTP  \nXSRF-TOKEN [x3]| MailerLite| Ensures visitor browsing-security by preventing\ncross-site request forgery. This cookie is essential for the security of the\nwebsite and visitor. | 1 day| HTTP  \nPHPSESSID| MailerLite| Preserves user session state across page requests.|\nSession| HTTP  \npersist:hs-beacon-#-#-#-#-#| beacon-v2.helpscout.net| Pending| Persistent|\nHTML  \npersist:hs-beacon-message-#-#-#-#-#| beacon-v2.helpscout.net| Pending|\nPersistent| HTML  \nmailerlite_session [x2]| MailerLite| Session cookie set by MailerLite| 7 days|\nHTTP  \ntest_cookie| Google| Used to check if the user's browser supports cookies.| 1\nday| HTTP  \n_GRECAPTCHA| Google| This cookie is used to distinguish between humans and\nbots. This is beneficial for the website, in order to make valid reports on\nthe use of their website.| 180 days| HTTP  \nrc::a| Google| This cookie is used to distinguish between humans and bots.\nThis is beneficial for the website, in order to make valid reports on the use\nof their website.| Persistent| HTML  \nrc::b| Google| This cookie is used to distinguish between humans and bots. |\nSession| HTML  \nrc::c| Google| This cookie is used to distinguish between humans and bots. |\nSession| HTML  \n1.gif| Cookiebot| Used to count the number of sessions to the website,\nnecessary for optimizing CMP product delivery. | Session| Pixel  \nli_gc| LinkedIn| Stores the user's cookie consent state for the current\ndomain| 180 days| HTTP  \nm| Stripe| Determines the device used to access the website. This allows the\nwebsite to be formatted accordingly. | 400 days| HTTP  \n_ab| Stripe| This cookie is necessary for making credit card transactions on\nthe website. The service is provided by Stripe.com which allows online\ntransactions without storing any credit card information.| Session| HTML  \n_mf| Stripe| This cookie is necessary for making credit card transactions on\nthe website. The service is provided by Stripe.com which allows online\ntransactions without storing any credit card information.| Session| HTML  \nid| Stripe| Pending| Session| HTML  \nbscookie| LinkedIn| This cookie is used to identify the visitor through an\napplication. This allows the visitor to login to a website through their\nLinkedIn application for example.| 1 year| HTTP  \n  \nFunctional Cookies (5)\n\nShow details (Functional Cookies)\n\nThese cookies are used to improve the performance and functionality of our\nwebsites, allow to remember the choices you make, to provide enhanced and more\npersonal features. Functional cookies will not track your activity on other\nwebsites. These cookies are not strictly necessary, however, without them,\ncertain services may be unavailable.\n\nName| Provider| Purpose| Expiry| Type  \n---|---|---|---|---  \nadroll#adroll [x4]| MailerLite| Stores the user's cookie consent state for the\ncurrent domain| Persistent| IDB  \nlocale| MailerLite| The cookie determines the preferred language and country-\nsetting of the visitor - This allows the website to show content most relevant\nto that region and language.| 10 days| HTTP  \n  \nPerformance Cookies (16)\n\nShow details (Performance Cookies)\n\nThese cookies help improve the way a website and Service work. They may\nmeasure usage of our website, track things, such as how long you spend on the\nsite and the pages that you visit. For example, performance cookies may show\nthe most frequently visited pages, help to record any difficulties with a\nwebsite and show whether advertising on a website is effective or not.\nPerformance cookies do not collect Personal Data and all the information that\nis collected by these cookies is aggregated and anonymous.\n\nName| Provider| Purpose| Expiry| Type  \n---|---|---|---|---  \n_ga [x2]| Google| Registers a unique ID that is used to generate statistical\ndata on how the visitor uses the website.| 2 years| HTTP  \n_gat [x2]| Google| Used by Google Analytics to throttle request rate| 1 day|\nHTTP  \n_gid [x2]| Google| Registers a unique ID that is used to generate statistical\ndata on how the visitor uses the website.| 1 day| HTTP  \nbounce| Appnexus| Determines if a user leaves the website straight away. This\ninformation is used for internal statistics and analytics by the website\noperator. | Session| Pixel  \nAnalyticsSyncHistory| LinkedIn| Used in connection with data-synchronization\nwith third-party analysis service. | 30 days| HTTP  \n1| Stripe| Registers data on visitors' website-behaviour. This is used for\ninternal analysis and website optimization. | Session| HTML  \n_ga_#| Google| Used by Google Analytics to collect data on the number of times\na user has visited the website as well as dates for the first and most recent\nvisit. | 2 years| HTTP  \n_hjSession_#| Hotjar| Collects statistics on the visitor's visits to the\nwebsite, such as the number of visits, average time spent on the website and\nwhat pages have been read.| 1 day| HTTP  \n_hjSessionUser_#| Hotjar| Collects statistics on the visitor's visits to the\nwebsite, such as the number of visits, average time spent on the website and\nwhat pages have been read.| 1 year| HTTP  \n_hjTLDTest| Hotjar| Registers statistical data on users' behaviour on the\nwebsite. Used for internal analytics by the website operator. | Session| HTTP  \nPugT| PubMatic| Used to determine the number of times the cookies have been\nupdated in the visitor's browser. Used to optimize the website's server\nefficiency. | 30 days| HTTP  \npersonalization_id| Twitter Inc.| This cookie is set by Twitter - The cookie\nallows the visitor to share content from the website onto their Twitter\nprofile. | 400 days| HTTP  \ntd| Google| Registers statistical data on users' behaviour on the website.\nUsed for internal analytics by the website operator. | Session| Pixel  \n  \nTargeting Cookies (67)\n\nShow details (Targeting Cookies)\n\nThese cookies are used to deliver adverts which are more relevant to you and\nyour interests while also limiting the number of times you see the same advert\non a website. These cookies record your visit to the website, the pages you\nhave visited and the links you have followed. We may also share this\ninformation with third-parties for this purpose. Several partners advertise on\nour behalf and affiliate-tracking cookies simply allow us to see if our\nCustomers have come to the website through one of our partner sites so that we\ncan credit them appropriately, and where applicable, allow our affiliate\npartners to provide any bonus that they may provide you for making a purchase.\n\nName| Provider| Purpose| Expiry| Type  \n---|---|---|---|---  \nxuid| Triplelift| Presents the user with relevant content and advertisement.\nThe service is provided by third-party advertisement hubs, which facilitate\nreal-time bidding for advertisers.| Session| Pixel  \n__adroll_consent_params [x4]| Adroll Group| Collects information on user\nbehaviour on multiple websites. This information is used in order to optimize\nthe relevance of advertisement on the website.| Session| HTTP  \n__adroll_fpc [x4]| Adroll Group| Used to identify the visitor across visits\nand devices. This allows the website to present the visitor with relevant\nadvertisement - The service is provided by third party advertisement hubs,\nwhich facilitate real-time bidding for advertisers. | 1 year| HTTP  \n__ar_v4 [x4]| Adroll Group| Optimises ad display based on the user's movement\ncombined and various advertiser bids for displaying user ads.| 1 year| HTTP  \n_te_ [x4]| Adroll Group| Registers a unique ID that identifies a returning\nuser's device. The ID is used for targeted ads.| Session| HTTP  \nmp_#_mixpanel [x2]| cdn.mxpnl.com| Pending| 1 year| HTTP  \nanj| Appnexus| Registers a unique ID that identifies a returning user's\ndevice. The ID is used for targeted ads.| 3 months| HTTP  \nreceive-cookie-deprecation [x3]| Appnexus  \nAdroll Group  \nAdroll| Pending| 400 days| HTTP  \nsetuid| Appnexus| This cookie is set by the audience manager of the website to\ndetermine the time and frequencies of visitor data synchronization - cookie\ndata synchronization is used to synchronize and gather visitor data from\nseveral websites.| Session| Pixel  \nuuid2| Appnexus| Registers a unique ID that identifies a returning user's\ndevice. The ID is used for targeted ads.| 3 months| HTTP  \nXANDR_PANID| Appnexus| Pending| 3 months| HTTP  \n__adroll_shared| Adroll Group| Collects data on the user across websites -\nThis data is used to make advertisement more relevant.| 13 months| HTTP  \n_uetsid| Microsoft| Used to track visitors on multiple websites, in order to\npresent relevant advertisement based on the visitor's preferences. |\nPersistent| HTML  \n_uetsid_exp| Microsoft| Contains the expiry-date for the cookie with\ncorresponding name. | Persistent| HTML  \n_uetvid| Microsoft| Used to track visitors on multiple websites, in order to\npresent relevant advertisement based on the visitor's preferences. |\nPersistent| HTML  \n_uetvid_exp| Microsoft| Contains the expiry-date for the cookie with\ncorresponding name. | Persistent| HTML  \nMSPTC| Microsoft| This cookie registers data on the visitor. The information\nis used to optimize advertisement relevance. | 1 year| HTTP  \nMUID| Microsoft| Used widely by Microsoft as a unique user ID. The cookie\nenables user tracking by synchronising the ID across many Microsoft domains.|\n1 year| HTTP  \nCMID| Casale Media| Collects visitor data related to the user's visits to the\nwebsite, such as the number of visits, average time spent on the website and\nwhat pages have been loaded, with the purpose of displaying targeted ads.| 1\nyear| HTTP  \nCMPRO| Casale Media| Collects data on visitor behaviour from multiple\nwebsites, in order to present more relevant advertisement - This also allows\nthe website to limit the number of times that they are shown the same\nadvertisement. | 3 months| HTTP  \nCMPS| Casale Media| Collects visitor data related to the user's visits to the\nwebsite, such as the number of visits, average time spent on the website and\nwhat pages have been loaded, with the purpose of displaying targeted ads.| 3\nmonths| HTTP  \nrum| Casale Media| Collects data related to the user's visits to the website,\nsuch as the number of visits, average time spent on the website and what pages\nhave been loaded, with the purpose of displaying targeted ads.| Session| Pixel  \n__mpq_#_#| cdn.mxpnl.com| Collects data on user behaviour and interaction in\norder to optimize the website and make advertisement on the website more\nrelevant. | Persistent| HTML  \nfbssls_#|  Meta Platforms, Inc.| Collects data on the visitor’s use of the\ncomment system on the website, and what blogs/articles the visitor has read.\nThis can be used for marketing purposes. | Session| HTML  \nlastExternalReferrer|  Meta Platforms, Inc.| Detects how the user reached the\nwebsite by registering their last URL-address.| Persistent| HTML  \nlastExternalReferrerTime|  Meta Platforms, Inc.| Detects how the user reached\nthe website by registering their last URL-address.| Persistent| HTML  \n__adroll| Adroll| Registers a unique ID that identifies a returning user's\ndevice. The ID is used for targeted ads.| 13 months| HTTP  \ncm/#/out| Adroll| Collects information on user behaviour on multiple websites.\nThis information is used in order to optimize the relevance of advertisement\non the website.| Session| Pixel  \nsegment/#/#| Adroll| Collects information on user behaviour on multiple\nwebsites. This information is used in order to optimize the relevance of\nadvertisement on the website.| Session| Pixel  \nIDE| Google| Used by Google DoubleClick to register and report the website\nuser's actions after viewing or clicking one of the advertiser's ads with the\npurpose of measuring the efficacy of an ad and to present targeted ads to the\nuser.| 1 year| HTTP  \npagead/landing| Google| Collects data on visitor behaviour from multiple\nwebsites, in order to present more relevant advertisement - This also allows\nthe website to limit the number of times that they are shown the same\nadvertisement. | Session| Pixel  \nads/ga-audiences| Google| Used by Google AdWords to re-engage visitors that\nare likely to convert to customers based on the visitor's online behaviour\nacross websites.| Session| Pixel  \nNID| Google| Registers a unique ID that identifies a returning user's device.\nThe ID is used for targeted ads.| 6 months| HTTP  \npagead/1p-user-list/#| Google| Tracks if the user has shown interest in\nspecific products or events across multiple websites and detects how the user\nnavigates between sites. This is used for measurement of advertisement efforts\nand facilitates payment of referral-fees between websites.| Session| Pixel  \nrc::f| Google| This cookie is used to distinguish between humans and bots. |\nPersistent| HTML  \nbcookie| LinkedIn| Used by the social networking service, LinkedIn, for\ntracking the use of embedded services.| 1 year| HTTP  \nli_sugr| LinkedIn| Collects data on user behaviour and interaction in order to\noptimize the website and make advertisement on the website more relevant. | 3\nmonths| HTTP  \nlidc| LinkedIn| Used by the social networking service, LinkedIn, for tracking\nthe use of embedded services.| 1 day| HTTP  \nUserMatchHistory| LinkedIn| Ensures visitor browsing-security by preventing\ncross-site request forgery. This cookie is essential for the security of the\nwebsite and visitor. | 30 days| HTTP  \n_fbp|  Meta Platforms, Inc.| Used by Facebook to deliver a series of\nadvertisement products such as real time bidding from third party\nadvertisers.| 3 months| HTTP  \n_gcl_au| Google| Used by Google AdSense for experimenting with advertisement\nefficiency across websites using their services. | 3 months| HTTP  \n_uetsid| Microsoft| Collects data on visitor behaviour from multiple websites,\nin order to present more relevant advertisement - This also allows the website\nto limit the number of times that they are shown the same advertisement. | 1\nday| HTTP  \n_uetvid| Microsoft| Used to track visitors on multiple websites, in order to\npresent relevant advertisement based on the visitor's preferences. | 1 year|\nHTTP  \nw/1.0/sd| Openx| Registers data on visitors such as IP addresses, geographical\nlocation and advertisement interaction. This information is used optimize the\nadvertisement on websites that make use of OpenX.net services. | Session|\nPixel  \nAdServer/Pug| PubMatic| Sets a timestamp for when the visitor entered the\nwebsite. This is used for analytical purposes on the website. | Session| Pixel  \nKRTBCOOKIE_#| PubMatic| Registers a unique ID that identifies the user's\ndevice during return visits across websites that use the same ad network. The\nID is used to allow targeted ads.| 3 months| HTTP  \n1/i/adsct [x2]| Twitter Inc.| Collects data on user behaviour and interaction\nin order to optimize the website and make advertisement on the website more\nrelevant. | Session| Pixel  \nmuc_ads| Twitter Inc.| Collects data on user behaviour and interaction in\norder to optimize the website and make advertisement on the website more\nrelevant. | 400 days| HTTP  \nguest_id| Twitter Inc.| Collects data related to the user's visits to the\nwebsite, such as the number of visits, average time spent on the website and\nwhich pages have been loaded, with the purpose of personalising and improving\nthe Twitter service.| 400 days| HTTP  \nguest_id_ads| Twitter Inc.| Collects information on user behaviour on multiple\nwebsites. This information is used in order to optimize the relevance of\nadvertisement on the website.| 400 days| HTTP  \nguest_id_marketing| Twitter Inc.| Collects information on user behaviour on\nmultiple websites. This information is used in order to optimize the relevance\nof advertisement on the website.| 400 days| HTTP  \n  \nUnclassified Cookies (7)\n\nShow details (Unclassified Cookies)\n\nThese cookies are a type of cookie for which the purpose or category is not\nyet determined.\n\nName| Provider| Purpose| Expiry| Type  \n---|---|---|---|---  \nlp_custom| MailerLite| Pending| Session| HTML  \n__mp_opt_in_out_# [x2]| cdn.mxpnl.com  \nThinkific| Pending| Session| HTTP  \npersist:hs-beacon-session-01cbe03b-a146-44f5-98a4-2d7880e95c35|\nbeacon-v2.helpscout.net| Pending| Session| HTML  \ni18n_default_en_en-translation| Thinkific| Pending| Persistent| HTML  \nlp_custom| MailerLite| Pending| 2 years| HTTP  \npartnero_session_uuid| app.partnero.com| Pending| 10 years| HTTP  \n  \nDo not sell or share my personal informationAllow selection\n\nCookie declaration last updated on 2/10/24 by Cookiebot\n\nFeatures\n\nSend emails\n\nEmail marketing\n\nGrow your audience and build stronger relationships.\n\nAutomation\n\nSend perfectly-timed and targeted emails automatically.\n\nNewsletter editors\n\nDesign emails yourself with an ai-powered drag & drop editor.\n\nTransactional emails\n\nPersonalize these emails to build stronger customer loyalty.\n\nBuild websites\n\nWebsite builder\n\nBuild stunning websites on your own and let your business shine.\n\nCreate a blog\n\nDrive traffic and engage visitors with an easy-to-build blog.\n\nCollect leads\n\nLanding pages\n\nCreate pages to collect leads, sell products and more.\n\nSignup forms\n\nInvite people from across the web to become subscribers.\n\niPad Subscribe App\n\nCollect subscribers at your event or store - even offline!\n\nEmail verifier\n\nClean and optimize email lists to improve deliverability.\n\nSell products\n\nDigital products\n\nSell e-books, downloads and more to grow your income.\n\nE-commerce\n\nIntegrate your e-store with email marketing to boost sales.\n\nPaid newsletter subscriptions\n\nEasily set up recurring payments to offer paid subscriptions.\n\nPricing\n\nGallery\n\nExamples\n\nNewsletters\n\nSee designs for various occasions and industries.\n\nLanding pages\n\nGet inspired by examples made by customers like you.\n\nAutomations\n\nAutomation examples\n\nCheck out these email automation ideas to inspire your own.\n\nAutomation templates\n\nBuild professional email workflows quickly using pre-built templates.\n\nTemplates Use these expertly-designed templates to quickly build effective\nnewsletters, web pages and forms.\n\nNewsletters Websites Landing pages Pop-ups\n\nWhy Lite\n\nResources\n\nKnowledge base\n\nGet quick answers to the most common MailerLite questions.\n\nVideo tutorials\n\nLearn at your own pace with short and sweet instructional videos.\n\nHire an expert\n\nFind approved consultants to help your business grow.\n\nBlog\n\nRead stories and how-to articles to level up your strategies.\n\nBest practices by industry\n\nDiscover the best email marketing practices for your industry.\n\nEmail marketing guide\n\nExplore the email essentials for a successful campaign.\n\n###### Curious about email marketing?  \nYou’re in good hands.\n\nJoin free online courses and get certified in our Academy.\n\nView all Academy courses\n\nCheck out our newest how-to guides:\n\nMigrating from Classic to the new MailerLite | Authenticating your domain to\nmaintain deliverability\n\nen\n\nEnglish Español Polski\n\nLog in Sign up\n\nen\n\nEnglish Español Polski\n\nFeatures\n\nSend emails\n\nEmail marketing\n\nGrow your audience and build stronger relationships.\n\nAutomation\n\nSend perfectly-timed and targeted emails automatically.\n\nNewsletter editors\n\nDesign emails yourself with an ai-powered drag & drop editor.\n\nTransactional emails\n\nPersonalize these emails to build stronger customer loyalty.\n\nBuild websites\n\nWebsite builder\n\nBuild stunning websites on your own and let your business shine.\n\nCreate a blog\n\nDrive traffic and engage visitors with an easy-to-build blog.\n\nCollect leads\n\nLanding pages\n\nCreate pages to collect leads, sell products and more.\n\nSignup forms\n\nInvite people from across the web to become subscribers.\n\niPad Subscribe App\n\nCollect subscribers at your event or store - even offline!\n\nEmail verifier\n\nClean and optimize email lists to improve deliverability.\n\nSell products\n\nDigital products\n\nSell e-books, downloads and more to grow your income.\n\nE-commerce\n\nIntegrate your e-store with email marketing to boost sales.\n\nPaid newsletter subscriptions\n\nEasily set up recurring payments to offer paid subscriptions.\n\nPricing Gallery\n\nExamples\n\nNewsletters\n\nSee designs for various occasions and industries.\n\nLanding pages\n\nGet inspired by examples made by customers like you.\n\nAutomations\n\nAutomation examples\n\nCheck out these email automation ideas to inspire your own.}\n\nAutomation templates\n\nBuild professional email workflows quickly using pre-built templates.\n\nTemplates\n\nUse these expertly-designed templates to quickly build effective newsletters,\nweb pages and forms.\n\nNewsletters  Websites  Landing pages  Pop-ups\n\nWhy Lite Resources\n\nKnowledge base\n\nGet quick answers to the most common MailerLite questions.\n\nVideo tutorials\n\nLearn at your own pace with short and sweet instructional videos.\n\nHire an expert\n\nFind approved consultants to help your business grow.\n\nBlog\n\nRead stories and how-to articles to level up your strategies.\n\nBest practices by industry\n\nDiscover the best email marketing practices for your industry.\n\nEmail marketing guide\n\nExplore the email essentials for a successful campaign.\n\nMailerLite Academy\n\nJoin free online courses and get certified in our Academy.\n\nCheck out our newest how-to guides: Migrating from Classic to the new\nMailerLite Authenticating your domain to maintain deliverability\n\nLog in Sign up\n\nClose\n\nNo results were found...\n\nEmail Marketing By Industry\n\n# Travel email marketing: Selling sunsets, not plane tickets\n\nWhy email marketing Build customer relationships 7 types of emails Growing an\nemail list Travel email examples Subject line inspiration It's time to fly\nhigh!\n\nThe travel industry has had a bumpy ride over the last two years. But luckily\nthere was one marketing channel that helped businesses to stay connected with\ncustomers: email marketing.\n\nFrom virtual experiences to local getaways, many travel agencies adapted to\nthe challenges of the pandemic and used email to stay close to their audiences\nthrough thick and thin. And now, travel bookings are starting to climb again.\n\nTravel email newsletters can inspire with alluring footage, convince people\nwith captivating travel stories, and offer ideas to ease into traveling again.\nIt can help you go beyond selling tickets and make it all about the experience\nyou’re selling.\n\nFasten your seatbelts, and let’s springboard into how travel businesses can\nuse email marketing to build airtight customer relationships.\n\n* * *\n\n## Why email marketing matters for travel\n\nOur _2022 benchmarks_ show that the tourism industry’s open rates are slowly\nstarting to climb back up, from 25.88% in 2020 to 28.76% in 2021.\n\nMeanwhile, travel bookings are rising again. For example, Carnival Corp has\nannounced that cruise bookings for the second half of 2022 are ahead of pre-\npandemic levels.\n\nThings are starting to look up for travel companies—which makes this the\nperfect time to get your travel email marketing campaigns in shape.\n\nWith email marketing, you can create a direct line of communication, allowing\nyou to connect with your customers at any time. It also offers a high ROI (\n_$42 for every dollar spent_). With the right email strategy, you can build an\naudience of engaged subscribers so that your travel promotions, loyalty\nprograms and deals get the attention they deserve.\n\n* * *\n\n## How to build relationships and travel far with your subscribers\n\nWhen it comes to email marketing success, the content of your newsletters is\nkey. As a travel agency, you’re competing with big shots like Google and\nKayak, so it’s important to build meaningful customer relationships. This way,\nyou’ll capture their hearts and diversify yourself from the crowd.\n\nIt all starts with relevant, engaging and helpful travel content. Don’t just\nsend out sales pitches for good travel deals, but offer valuable information.\n\n **You'll want content ideas like:**\n\n  * Travel e-book (one of our customers offers a free cookbook with recipes that they collected whilst traveling Asia, Africa and Central America)\n\n  * Downloadable lists\n\n  * City guides and other useful information\n\n  * Travel tips\n\n  * Personal travel stories\n\n  * Calendar with the best times to book\n\n  * Quizzes\n\n  * Live tracking of which countries are on the ‘green list’ to travel\n\n### Before we continue...\n\nWhy not open a free MailerLite account and build your email campaign as you're\nreading?\n\nSign up\n\n**Tip:** Read how to create engaging email content in the guide below.\n\nHow to craft email content people care about\n\n* * *\n\n## 7 types of travel email content to send for mile-high results\n\n### **1\\. Say welcome aboard with a welcome email**\n\nA warm welcome sets the tone for the entire experience. Virtually, you need to\ndo the same with a _welcome email_.\n\nWelcome emails have a _42% higher read rate_ than standard email marketing\ncampaigns (which spells good news for your conversion rates)! With _email\nautomation_, you can magically make them arrive in your subscribers’ inboxes\nthe very moment they sign up.\n\n  *  **Pro tip:** Here’s how to set up a _welcome email series_ with MailerLite, our straightforward email marketing software. 🤓 Or, check out our introduction to automation below.\n\nYour welcome email should greet your new pen pal and tell them more about you.\nA lot of travel sites tell subscribers what to expect. Some will also include\na special deal or promotion to get the ball rolling.\n\nHere’s how Sonder greets its new subscribers, with a stunning apartment photo\nto catch attention, plus a stand-out call to action (CTA).\n\nImage credit: Sonder\n\n  * **Pro tip:** A CTA button should work together with all the other elements of the email newsletter to influence subscribers to take a course of action. Learn more about creating highly-effective CTAs.\n\nSkyrocket conversion rates with the perfect email call-to-action (CTA)\n\n* * *\n\n### 2\\. Send a personalized greeting\n\nImagine walking into your hotel room and seeing a bottle of champagne and a\npersonalized welcome card with your name on it. That would definitely put a\nsmile on your face!\n\n _82% of travelers_ believe that personalization is one of the most luxurious\ntravel customer experiences—so why not extend that to your email marketing\ncampaigns?\n\nReaders want tailored travel newsletters with content that they can actually\nuse. Sure, you can send American readers newsletters about how great it is\nDown Under, but how many of your subscribers can quickly hop on a plane to\nAustralia? Probably not many. It makes a lot more sense to talk about travel\ndestinations your reader can actually plan and book.\n\n _Segmentation_ lets you group your subscribers based on shared traits so that\nyou can send them tailored messages that resonate. For example, use\ninformation on the places your subscribers have visited or whether or not they\nhave children. Check the available data and see how you can use this to create\ngroups.\n\nFor example, Booking.com sends this personalized message to a subscriber who\nis just finishing their stay in a London hotel. There’s even information about\nbooking a ride from their hotel to the airport!\n\nImage credit: Booking.com\n\n  * **Pro tip:** If you don’t know certain information, ask! Gather data through subscriber preferences, _embedded surveys_ or contests.\n\n* * *\n\n### 3\\. Catch attention with the right imagery\n\nMany of us have no idea what other places in the world look like. That’s why\nwe search for images and create Pinterest boards with all the dreamy\ndestinations we want to visit.\n\nTraveling is about experiences and emotions. Using the right images in your\nemail design can motivate readers to put your offer on top of their bucket\nlist.\n\nFor example, Vacasa tells its subscribers to ‘Reach their dream destination’,\nand then lets this stunning tropical paradise photo do the rest of the\ntalking…\n\nImage credit: Vacasa\n\n  * **Pro tip:** Want to design professional-looking travel email newsletters on your own? We break down the process into two design elements in our guide on designing emails that people will read.\n\nHow to design emails people will read\n\n* * *\n\n### 4\\. YOLO! Express urgency in your travel newsletter\n\nTraveling costs money, but you also only have one life to explore the world.\nPlay with this sense of urgency to get people to act.\n\nUse offers and special occasions to create limited promotions. In January, you\ncan promote last-minute offers to sunny paradises. For Easter, you can\nhighlight discounted family-friendly packages.\n\nCombining your promotions with _email personalization_ makes sure your offer\nis a perfect fit for each of your subscribers.\n\nThe Hoxton promotes their limited-time 20% discount and includes “What to tell\nyour boss” excuses that surely gave their readers a good laugh.\n\nImage credit: The Hoxton\n\n  * **Pro tip:** Did you know that you can create _email coupons_ with MailerLite? Use them to boost your sale and ramp up engagement with your travel agency.\n\n* * *\n\n### 5\\. Share educational content\n\nThink about why your subscribers should sign up for YOUR travel newsletter. Do\nyou have insights about certain locations? Travel hacks or hidden gems? Can\nyou tell readers never-heard-before stories about a culture? Or debunk\nstereotypes and myths about places?\n\nInformative content from destinations or travel brands can influence the\ndecision-making process and make people go places!\n\nWhen you spread your knowledge using travel email marketing, your content\nstays within the newsletter. Just for you and your tribe to know. Use this\nexclusiveness as a USP to attract more subscribers.\n\nIn this travel newsletter, National Geographic teaches readers about Morocco.\n\nImage credit: National Geographic\n\n  * **Pro tip** : If you can package your content in the form of videos, even better, as people can remember _95% of a message in video form_, compared to 10% when they read it.\n\n* * *\n\n### 6\\. Start a conversation\n\nHave you ever searched on Facebook for traveling groups? Spoiler alert: There\nare LOADS. People love to get together and talk about their experiences in\nforeign countries. Use this community feeling in your travel email marketing\ncampaigns.\n\nAccording to Bright Local, _77%_ of people will ‘always’ or ‘regularly’ check\nlocal business reviews before buying. People want to hear other people’s\nopinions before making up their minds.\n\nTo gain trust and add a personal touch, add customer reviews to your travel\nemail campaigns. Or collect them first using your travel agency newsletter!\n\nIn this personalized email, a hotel in Barcelona makes it super easy for\nreaders to leave reviews. In-email _NPS surveys_ work well to find out how\nsatisfied your customers are.\n\nImage credit: Silken Ramblas Barcelona\n\n* * *\n\n### 7\\. Let’s get social\n\nIt’s been found that _86% of people_ have researched a travel destination\nafter seeing a social media post about it!\n\nYep, _email marketing and social media_ go together like a good glass of wine\nand a beautiful sunset. Spread your exposure and encourage people to get\nsocial with you. You can _add social media posts directly_ to your travel\nemail campaign, or add social media buttons—just like Tropicfeel did below.\n\nImage credit: Tropicfeel\n\n  * **Pro tip:** _85% of travelers_ use their phones to manage different aspects of their trips. That’s why you need to make all your travel email templates responsive, so users don’t need to pinch and zoom to see your content on mobile.\n\n* * *\n\n## How to grow your travel email list\n\nYour email list is the driving force behind your travel email marketing\ncampaigns. Building one is easy! All you need is a way to collect email\naddresses—offline and/or online.\n\nWe'll quickly cover how you can gather emails here. If you want to learn how\nto grow a high-quality email list, we've got a guide for that too!\n\nHow to grow a high-quality email list\n\n### **Collecting email addresses in person**\n\nAsk people to sign up for your emails when you talk to them face to face. The\nsimplest way is to use an _offline email collection_ app that works on mobile\ndevices and smartphones. This method is GDPR-compliant and hassle-free, as it\nautomatically syncs your new subscribers to your travel email list.\n\n###  **Collecting email addresses through your website**\n\nTo get people to opt-in to your email list via your website, you can use _pop-\nups_ and _embedded forms_.\n\n####  **Pop-ups**\n\nPop-ups work well because they literally pop up in your face. Integrating pop-\nups is easy when you use an email tool. Set the frequency to a level where\nit’s not annoying for your visitors.\n\nThis is how Luxury Travel Magazine uses pop-ups. They provide a clear reason\nfor signing up for their travel newsletter and only ask for an email address.\nThe sea background adds vacation vibes.\n\nImage credit: Luxury Travel Magazine\n\n#### Embedded forms\n\nYou’ll often find embedded forms in the website footer and blog sidebar. This\nis the signup form Iconic Luxury Hotel uses for people to sign up for their\ntravel agency newsletter.\n\nImage credit: Iconic Luxury Hotel\n\n#### **(Bonus) Incentives: Something to brighten people’s moods**\n\nYou’re asking for their email, so why not give subscribers something in\nreturn? Here are some email incentive ideas for travel agencies:\n\n  * One-time discount\n\n  * The first chapter of an e-book\n\n  * Exclusive information, like receiving deals first\n\n  * Free tickets to your travel event, conference or fair\n\nNot only do these ideas make great incentives, but they can also be used as\ncontent ideas for your next newsletter.\n\nYou can also create a _travel landing page_ to promote a contest or giveaway.\nIn order to participate, people need to sign up. The winner is then announced\nvia email.\n\nThis page from Harrison Beach Hotel shows how website visitors have a chance\nto win a free 1-night stay (up to a $300 value) by simply subscribing.\n\nImage credit: Harrison Beach Hotel\n\nTravel blogger Tara Cannon of Pint Size Pilot also uses lead magnets as a\nsmart way to collect new subscribers.\n\nImage credit: Pint Size Pilot\n\n* * *\n\n## Travel email marketing examples\n\nSo who in the travel agency industry is doing their email marketing right?\n\nLet’s get inspired.\n\n###  **Tropicfeel**\n\nThis newsletter does a great job of selling a more local travel experience,\nwith a large aesthetically-pleasing image and spot-on email copy (e.g.\n‘Adventure is just around the corner’).\n\nImage credit: Tropicfeel\n\n### **Selina**\n\nThis travel newsletter is bound to make people smile, with the fun header and\ntantalizing glimpses of different travel locations. Plus, the travel company\neven helps people to schedule their pre-departure tests, if needed.\n\nImage credit: Selina\n\n### Vacasa\n\nCan we just take a minute to appreciate the gorgeous illustrations in this\ntravel email? It celebrates the travelers who were able to ‘get back out\nthere’ in 2021. The complementary colors instantly catch the eye and make the\nreader want to scroll down to see the most-loved homes that people visited.\n\nImage credit: Vacasa\n\n### Southwest\n\nTravel emails aren’t just pretty scenery, it’s also about appreciating your\nreaders.\n\nThis email from Southwest Airlines does exactly that. The personalization is\ntop-notch—from the customer’s name to their travel history and loyalty program\npoints earned. The smiling faces of the diverse employees reflect Southwest’s\nimage as one of the friendliest airlines in the sky.\n\nImage credit: Southwest\n\n### **Travel Triangle**\n\nThis Hong Kong guide from Travel Triangle offers a stunning selection of\ntravel ideas, complete with eye-catching photos to help the readers visualize\nthemselves there! With clear headings and bold CTAs, you can grab your\nsubscribers’ attention and get them to take action.\n\nImage credit: Travel Triangle (designed with MailerLite)\n\n**P.S.** You can find more travel email campaigns in _our travel newsletter\nexample gallery_.\n\n* * *\n\n## Travel email subject lines\n\nHere are some ideas from actual email subject lines that will inspire you.\nLike writing content that your subscribers will care about, remember to craft\nsubject lines that stand out in your subscriber's inbox to ramp up your click-\nthrough rate.\n\nGive them a compelling reason to click open your email and read on!\n\nTravel newsletter email subject lines\n\n**Katie & Ben - Two Wandering Soles **\\- Here is your Ultimate Japan Packing\nList\n\n **Azamara Club Cruises** \\- Here’s one destination we can’t stop thinking\nabout.\n\n **Jack @ Jack's Flight Club** \\- How cheap flights work\n\n **Tours4fun** \\- You've got over $10 worth of points!\n\n **Priceline.com** \\- ❤️️ Treat Yourself, Jonas! Ridiculously good Rental car\ndeals from ridiculously low prices!\n\n **Vueling Air** \\- Allergic to the cold? Soak up Spring at one of our\ndestinations\n\n **Jessie on a Journey** \\- Notes on maintaining relationships while traveling\n❤ ✈\n\n **Delta Air Lines** \\- It's Time To Check-In\n\n **Expedia.com** \\- ✈ Paging passenger Jonas Fischer: You’re getting the\nflight deal of a lifetime\n\n **Nomads With A Purpose** \\- Reset your life in 30 days + Summer is just\naround the corner 😲\n\n **Momondo** \\- Prices going down for your flight from AMS to DPS.\n\n **Dipaways** \\- Do women solo travel more than men?\n\n **Booking.com** \\- A reminder about your trip\n\n **Jetsetter** \\- 10 Pro Tips for Packing Lighter Every Time\n\n **Captivating Compass** \\- How to save on transportation during family travel\n& more!\n\n **Wanderlust** \\- Gift a year of travel inspo - perfect for Father's Day\n\nTo learn more, we cover how to write subject lines that boost open rates in\nanother Ultimate guide.\n\nHow to write the best email subject lines and boost engagement\n\n* * *\n\n## Email marketing strategy for travel agents: It’s time to fly high!\n\nTo end this trip on a high note: Travel email marketing can definitely help\nyou acquire new customers! Well-curated emails also help you to retain and\nencourage your readers to keep following your journey.\n\nSending engaging, personalized and valuable content is your answer to turning\nsubscribers with wanderlust into loyal customers that trust your travel\nexpertise and happily book your offers.\n\nAs a travel agency, you’ll want to take your readers on many trips, but let’s\nnot forget the journey that leads to the purchase. Butter them up with travel\ninspo and insider knowledge, and be a genuine help to make sure each\nindividual subscriber finds their dream destination.\n\n **Now go out there and find some new travel followers, and don’t forget to\nenjoy the ride!**\n\n **  \n**\n\n### Create your first travel email campaign in minutes!\n\nOur free plan includes email marketing automation, landing pages and more\namazing features.\n\nSign up for free\n\n## Next up in email marketing by industry\n\nShow all\n\nHotels\n\n## Email marketing for hotels: A complete guide to filling rooms\n\nHealthcare\n\n## Healthcare provider’s guide to email marketing\n\nProduct\n\n  * Email marketing\n  * Automations\n  * Websites\n  * Integrations\n  * Compare MailerLite\n  * Compare paid newsletters\n  * Developer API\n  * Status\n  * What's new\n\nSupport\n\n  * Knowledge base\n  * Video tutorials\n  * Academy\n  * Hire an Expert\n  * Migration service\n  * Support\n  * Report abuse\n\nCompany\n\n  * About us\n  * Why Lite\n  * Company values\n  * Jobs Hiring \n  * Become a partner\n  * Contact us\n  * Wall of love\n  * Newsroom\n\nLet's keep in touch\n\nSign up for our weekly email marketing newsletter and MailerLite updates.\n\nEnter your email\n\nSubscribe Subscribe\n\nFor more details, review our Privacy Policy.\n\nThank you! Look for a confirmation email shortly to complete your\nsubscription.\n\n  *   *   * \n\n2010 - 2024 © MailerLite. All rights reserved.\n\nTerms of Service Cookies Settings Brand Assets\n\nGDPR Compliant  Your data is safe with us\n\n",
    "links": "[{\"link\": \"https://www.mailerlite.com/\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/features/email-marketing\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/features/automation\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/features/newsletter-editors\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/features/transactional-emails\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/features/website-builder\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/features/create-a-blog\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/features/landing-pages\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/features/signup-forms\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/features/ipad-app\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/features/email-verifier\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/features/sell-digital-products\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/features/email-marketing-for-ecommerce\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/features/paid-newsletter-subscriptions\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/pricing\", \"text\": \"Pricing\"}, {\"link\": \"https://www.mailerlite.com/newsletter-examples\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/landing-page-examples\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/automation-examples\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/automation-templates\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/templates\", \"text\": \"Templates\"}, {\"link\": \"https://www.mailerlite.com/templates/newsletters\", \"text\": \"Newsletters\"}, {\"link\": \"https://www.mailerlite.com/templates/websites\", \"text\": \"Websites\"}, {\"link\": \"https://www.mailerlite.com/templates/landing-pages\", \"text\": \"Landing pages\"}, {\"link\": \"https://www.mailerlite.com/templates/pop-ups\", \"text\": \"Pop-ups\"}, {\"link\": \"https://www.mailerlite.com/why-lite\", \"text\": \"Why Lite\"}, {\"link\": \"https://www.mailerlite.com/help\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/video-tutorials\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/experts\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/blog\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/email-marketing-by-industry\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/ultimate-guide-to-email-marketing\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/migration-resources\", \"text\": \"Migrating from Classic to the new MailerLite\"}, {\"link\": \"https://www.mailerlite.com/email-authentication-policy-changes\", \"text\": \"Authenticating your domain to maintain deliverability\"}, {\"link\": \"https://www.mailerlite.com/email-marketing-by-industry/traveling\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/es/email-marketing-by-industry/traveling\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/signup\", \"text\": \"Sign up\"}, {\"link\": \"https://www.mailerlite.com/email-marketing-by-industry/traveling\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/es/email-marketing-by-industry/traveling\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/features/email-marketing\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/features/automation\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/features/newsletter-editors\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/features/transactional-emails\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/features/website-builder\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/features/create-a-blog\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/features/landing-pages\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/features/signup-forms\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/features/ipad-app\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/features/email-verifier\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/features/sell-digital-products\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/features/email-marketing-for-ecommerce\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/features/paid-newsletter-subscriptions\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/pricing\", \"text\": \"Pricing\"}, {\"link\": \"https://www.mailerlite.com/newsletter-examples\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/landing-page-examples\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/automation-examples\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/automation-templates\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/templates\", \"text\": \"Templates\"}, {\"link\": \"https://www.mailerlite.com/templates/newsletters\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/templates/websites\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/templates/landing-pages\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/templates/pop-ups\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/why-lite\", \"text\": \"Why Lite\"}, {\"link\": \"https://www.mailerlite.com/help\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/video-tutorials\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/experts\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/blog\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/email-marketing-by-industry\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/ultimate-guide-to-email-marketing\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/migration-resources\", \"text\": \"Migrating from Classic to the new MailerLite\"}, {\"link\": \"https://www.mailerlite.com/email-authentication-policy-changes\", \"text\": \"Authenticating your domain to maintain deliverability\"}, {\"link\": \"https://www.mailerlite.com/signup\", \"text\": \"Sign up\"}, {\"link\": \"https://www.mailerlite.com/signup\", \"text\": \"Sign up\"}, {\"link\": \"https://www.mailerlite.com/ultimate-guide-to-email-marketing/content\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/ultimate-guide-to-email-marketing/content\", \"text\": \"How to craft email content people care about\"}, {\"link\": \"https://www.mailerlite.com/ultimate-guide-to-email-marketing/call-to-action\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/ultimate-guide-to-email-marketing/call-to-action\", \"text\": \"Skyrocket conversion rates with the perfect email call-to-action (CTA)\"}, {\"link\": \"https://www.mailerlite.com/ultimate-guide-to-email-marketing/design\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/ultimate-guide-to-email-marketing/design\", \"text\": \"How to design emails people will read\"}, {\"link\": \"https://www.mailerlite.com/ultimate-guide-to-email-marketing/email-list\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/ultimate-guide-to-email-marketing/email-list\", \"text\": \"How to grow a high-quality email list\"}, {\"link\": \"https://www.mailerlite.com/email-marketing-by-industry/traveling\", \"text\": \"embedded forms\"}, {\"link\": \"https://www.mailerlite.com/ultimate-guide-to-email-marketing/subject-line\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/ultimate-guide-to-email-marketing/subject-line\", \"text\": \"How to write the best email subject lines and boost engagement\"}, {\"link\": \"https://www.mailerlite.com/signup\", \"text\": \"Sign up for free\"}, {\"link\": \"https://www.mailerlite.com/email-marketing-by-industry/hotels\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/email-marketing-by-industry/healthcare-providers\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/features/email-marketing\", \"text\": \"Email marketing\"}, {\"link\": \"https://www.mailerlite.com/features/automation\", \"text\": \"Automations\"}, {\"link\": \"https://www.mailerlite.com/features/website-builder\", \"text\": \"Websites\"}, {\"link\": \"https://www.mailerlite.com/integrations\", \"text\": \"Integrations\"}, {\"link\": \"https://www.mailerlite.com/compare\", \"text\": \"Compare MailerLite\"}, {\"link\": \"https://www.mailerlite.com/paid-newsletter-platform\", \"text\": \"Compare paid newsletters\"}, {\"link\": \"https://www.mailerlite.com/whats-new\", \"text\": \"What's new\"}, {\"link\": \"https://www.mailerlite.com/help\", \"text\": \"Knowledge base\"}, {\"link\": \"https://www.mailerlite.com/video-tutorials\", \"text\": \"Video tutorials\"}, {\"link\": \"https://www.mailerlite.com/experts\", \"text\": \"Hire an Expert\"}, {\"link\": \"https://www.mailerlite.com/migration\", \"text\": \"Migration service\"}, {\"link\": \"https://www.mailerlite.com/support\", \"text\": \"Support\"}, {\"link\": \"https://www.mailerlite.com/report-abuse\", \"text\": \"Report abuse\"}, {\"link\": \"https://www.mailerlite.com/about\", \"text\": \"About us\"}, {\"link\": \"https://www.mailerlite.com/why-lite\", \"text\": \"Why Lite\"}, {\"link\": \"https://www.mailerlite.com/company-values\", \"text\": \"Company values\"}, {\"link\": \"https://www.mailerlite.com/jobs\", \"text\": \"\"}, {\"link\": \"https://www.mailerlite.com/become-a-partner\", \"text\": \"Become a partner\"}, {\"link\": \"https://www.mailerlite.com/contact-us\", \"text\": \"Contact us\"}, {\"link\": \"https://www.mailerlite.com/wall-of-love\", \"text\": \"Wall of love\"}, {\"link\": \"https://www.mailerlite.com/newsroom\", \"text\": \"Newsroom\"}, {\"link\": \"https://www.mailerlite.com/legal/privacy-policy\", \"text\": \"Privacy Policy\"}, {\"link\": \"https://www.mailerlite.com/legal\", \"text\": \"Terms of Service\"}, {\"link\": \"https://www.mailerlite.com/brand-assets\", \"text\": \"Brand Assets\"}, {\"link\": \"https://www.mailerlite.com/gdpr-compliance\", \"text\": \"\"}]"
}