{
    "summary": "This website stores cookies on your computer. These cookies are used to\ncollect information about how you interact with our website and allow us to\nremember you. We use this information in order to improve and customize your\nbrowsing experience and for analytics and metrics about our visitors both on\nthis website and other media. To find out more about the cookies we use, see\nour Privacy Policy.\n\nIf you decline, your information won’t be tracked when you visit this website.\nA single cookie will be used in your browser to remember your preference not\nto be tracked.\n\nAccept  Decline\n\nProduct\n\nSell more tickets\n\nSell more tickets through your website, POS, or resellers.\n\nManage your sales\n\nSpend minutes and not hours on managing your customers.\n\nGrow your business\n\nUpsell, automate, and help you boost your online reputation.\n\nAll features\n\nIndustry\n\nAttractionsTour OperatorsEvent OrganisersCultural Sites\n\nComparisons\n\nPeek ProFareHarborEventbriteSoftur\n\nResources\n\nIntegrations\n\nWe integrate with all major OTAs and hardware. Check our full list.\n\nBlog\n\nRead our collection of latest industry news, insider secrets, and latest\nstrategies.\n\nCustomer stories\n\nDiscover how other businesses like yours found success with us.\n\nAbout us\n\nSee who's behind TicketingHub and what drives our product's growth.\n\nHelp Desk\n\nGot stuck? Access our help portal and kickstart your journey with us.\n\nReviews\n\nCheck what customers are saying about us and why they chosen TicketingHub.\n\nPricingContact\n\nLog inBook a demo\n\nMenu\n\nDiscover TicketingHub\n\nProduct\n\nSell more tickets\n\nSell more tickets through your website, POS, or resellers.\n\nManage your sales\n\nSpend minutes and not hours on managing your customers.\n\nGrow your business\n\nUpsell, automate, and help you boost your online reputation.\n\nAll features\n\nIndustry\n\nAttractionsTour OperatorsEvent OrganisersCultural Sites\n\nComparisons\n\nPeek ProFareHarborEventbriteSoftur\n\nResources\n\nIntegrations\n\nWe integrate with all major OTAs and hardware. Check our full list.\n\nBlog\n\nRead our collection of latest industry news, insider secrets, and latest\nstrategies.\n\nCustomer stories\n\nDiscover how other businesses like yours found success with us.\n\nAbout us\n\nSee who's behind TicketingHub and what drives our product's growth.\n\nHelp Desk\n\nGot stuck? Access our help portal and kickstart your journey with us.\n\nReviews\n\nCheck what customers are saying about us and why they chosen TicketingHub.\n\nPricingContact\n\nLog inRequest a demo\n\nBlog\n\nTour Booking Software News\n\nTours and Activities We Love\n\nGetting Started\n\nTicketingHub | How-To\n\nTravel Marketing Trends\n\nHomeBlogTicketingHub | How-To\n\n# How to Use Travel Email Marketing to Boost Travel Bookings\n\nGeraldine Denzon\n\nJanuary 15, 2023\n\n•\n\n13\n\nmin read\n\nGeraldine is a skilled professional with a rich background in the travel\nsector. Joining TicketingHub a year ago, she has since been sharing her wealth\nof knowledge and enthusiasm for discovering unique tools to help tour\noperators.\n\nEmail marketing is an incredibly powerful tool for travel agencies. It allows\nyou to connect with your customers in a personal way, and build relationships\nthat will encourage them to book travel with you.\n\nIn this blog post, we will discuss the email marketing tips that every travel\nagency should know. We'll cover everything from creating a welcome email to\ngrowing your email list. By following these tips, you can create an email\nmarketing campaign that will help you achieve your business goals!\n\nLet's get started!\n\n## Why email marketing matters for travel\n\nEmail marketing is a must-have tool that travel businesses can no longer\nignore. It's an effective way to keep customers engaged with travel brands and\nbuild relationships with travel fans who might become loyal customers.\n\nWith email marketing, travel companies can directly reach their intended\ncustomer base and gain insight into customer preferences by collecting\nfeedback through surveys, surveys, or campaigns.\n\nMoreover, travel emails are less likely to be blocked by spam filters compared\nto other forms of online advertising and promotions, so you don't have to\nworry about missing out on potential bookings.\n\nWhat's more, an effective travel email marketing campaign leveraging the right\ndata can result in increased sales for travel companies. It also provides them\nwith a reliable source of revenue and helps ensure their long-term growth and\nstability in this ever-fluctuating industry.\n\nThe travel industry is quickly adapting to the power of travel email\nmarketing, and the results have been nothing short of incredible.\n\nRecent research shows that travel email marketing provides marketers with a\n$42 return for each dollar invested, making it one of the single most\nefficient forms of online advertising available today.\n\nTravel businesses engaging in travel email marketing can use tools like\nautomated welcome emails and segmented campaigns to maximize their impact on\ncustomers while delivering personalized messages that encourage brand loyalty\nand engagement.\n\nIts effectiveness has been proven time and again, and travel email continues\nto power growth for travel brands around the world.\n\n## How to build relationships and expand your audience\n\nWhen it comes to email marketing success, the content of your newsletters is\nkey. Your newsletter should be more than just a sales pitch for good travel\ndeals. For one thing, its content needs to be relevant and genuinely helpful\nto the journey planner.\n\nBy diversifying yourself from the competition with this kind of engaging\ncontent, you’ll capture their emotional attention and be sure that they’re\nreturning to you again and again for the valuable information. And when it\ncomes to choosing what kind of content to offer, creativity is really your\nbest friend!\n\nSo, put on the hat of a teacher and provide interesting educational advice.\nLet your subscribers learn something they didn’t before interacting with your\nemails.\n\nIf you offer valuable content that resonates with travelers, they’ll begin to\ntrust you as an expert resource not just as a vendor, and that's when you'll\nsee stronger engagement and loyalty.\n\n### You'll want content ideas like:\n\n  * Travel e-books\n  * Various travel ideas\n  * Videos and podcasts\n  * Travel tips\n  * Lists of must-see travel destinations\n  * Interviews with experienced travelers\n  * City guides and other useful information\n\nNow, what are the types of travel email content you can use? Let's dig deeper.\n\n## 7 Travel email content types for mile-high results\n\n### Say hello by sending a welcome email\n\nWelcome emails are like the first impression for a business that can sway\neither way on the customer experience. It is essential to ensure that your\nwelcome email makes the right impression and properly sets the tone for their\nfuture interactions with you.\n\n> A recent study found that welcome messages have a 42% higher read and click\n> through rate than standard email marketing campaigns, meaning your customers\n> are more likely to open, read, and engage with your message!\n\nThis means that your conversion rates will see a boost when using this in your\nmarketing strategy.\n\n **Pro tip: Right there and then, don't forget to add a call-to-action button.\nThis will influence your subscribers to take a course of action.**\n\n### Give your greetings a personal touch\n\nGoing beyond basic customization with your email marketing campaigns isn't\njust about providing good service, it's about creating an experience. Even\nwhen customers aren't traveling, they still want to be heard and no type of\ncommunication conveys that better than personalization.\n\nWith personalized emails, travel agents can stand out in the inbox and\nguarantee a better return on investment.\n\n> It's no wonder why 82% of travelers believe that the most luxurious travel\n> customer experiences come from those that take the time to personalize their\n> communications—and those same principles go for any other industry as well.\n\nTour companies can tap into this powerful connection by implementing\nthoughtful touches in their emails.\n\n **Pro tip: To send tailored messages, segmentation is one tactic that groups\nyour subscribers into categories based on their preferences or behavior to\ndeliver content that's more relevant to them. You can gather data through\nsurveys, contests, and other preferences.**\n\n### Make your visuals stand out\n\nTraveling is so much more than a place we go. It’s an attribute that not only\nembraces culture, food, and activities but feelings and emotions too.\n\nEmail design plays an important role in motivating readers to make travel part\nof their bucket list, adding more vibrancy when used with the right imagery.\n\nPictures invoke emotion and can show someone how others may have experienced a\nplace before them, providing just the motivation one needs to take the trip.\nVisuals are irreplaceable for storytelling and help the reader stay engaged\nfrom beginning to end – tempting them to embark on a journey of their own.\n\nThey provide images that break boundaries between real-life experience,\nunderstanding, and Fantasyland.\n\n**Pro tip: By effectively utilizing images in your email design you will be\nmore successful in getting readers to become travelers themselves.**\n\n### Send travel newsletters that express urgency\n\nTraveling can be a life-changing experience that we all strive for. It's\nsomething that everyone should take advantage of, and now is the perfect time\nto start planning a trip! That's why sending out travel newsletters that\nexpress a sense of urgency is key.\n\nThis sense of urgency can motivate people to act more quickly than they might\notherwise, providing them with an opportunity to make their dream trip come\ntrue.\n\nYou can play with this appeal by offering limited promotions such as discounts\nor early bird events for special occasions when decision-making needs to\nhappen quickly.\n\nPair this urgency with attractive offers and special occasions, and you've got\nyourself a powerful incentive! Make sure your newsletters clearly state the\nofferings and relevant time frames, as well as how long those deals are valid.\n\nThese simple but meaningful tactics will help boost sales from both loyal\ncustomers, as well as those on the fence about your product or service.\n\n **Pro tip: Use email coupons to boost your sale and ramp up engagement.**\n\n### Provide educational content about the travel industry\n\nTake note of your \"why's.\" This means that knowing your goals in sharing\ncontent on your newsletter can influence the decision-making process and make\npeople go places!\n\nIf spreading your knowledge is your goal, then crafting engaging marketing can\nbe a great way to do so. It's important to keep in mind that when you use such\nmarketing techniques, the content you create will only stay within the\nboundaries of your newsletter.\n\nAs such, it can become an exclusive resource for sharing knowledge only with\nthose subscribed or connected to you or your business in some fashion.\n\nThis kind of exclusiveness should be used as a unique selling point (USP) to\ndraw people into signing up for what you have to offer – and allow them to be\npart of a special tribe within this environment.\n\n **Pro tip: Use videos! People can remember up to 95% of a message when they\nwatch it on video, all the while experiencing a greater emotional\nconnection.**\n\n### Engage your audience\n\nWhen people are planning their next vacation, the first thing they do is talk\nto friends and families who have been to the same place. Why?\n\nHearing about someone else's experience abroad gives them valuable insight,\nhelps us build community connections, and builds our trust in a certain\ndestination or travel agency.\n\nThis shared attitude of experiencing foreign places together is why\nincorporating customer reviews into travel email marketing campaigns can be so\npowerful.\n\nWhen readers see firsthand what past travelers thought about their trip and\nrecommend it to others via an email campaign, companies can tap into this\npositive sense of community and use it to gain trust among readers.\n\nAs such, using customer reviews in your travel agency newsletters and\nmarketing campaigns is a great way not only to garner more trust but also to\nadd a personal touch that will capture the attention of potential customers!\n\n **Pro tip: Make it easy for your customers to leave a review and participate\nin your loyalty program. Read our** **detailed guide** **on how to do so.**\n\n### It's time to socialize, travel agencies!\n\nIt’s amazing to see how influential social media really is when it comes to\ntravel.\n\n> According to a study, an incredible 86% of people research a travel\n> destination after seeing a post on social media, underlining its potency as\n> an effective marketing tool.\n\nThe takeaway here is that if you want your message and promotions to have the\nmaximum reach, then there's no better way than combining email marketing and\nsocial media outreach.\n\nDoing so will ensure both parties work in unison and synergize with each\nother, leading to greater success down the road - not just for the travel\nagency but for potential new customers too!\n\nAdding some simple social media buttons to your emails gives readers the\nability to quickly share your posts across their own networks. Plus, including\nposts or content directly in the email itself offers greater context for the\nemail recipient about what you’re doing online.\n\n **Pro tip: Make your travel email templates responsive and mobile-friendly as\nmore users use their mobile phones now.**\n\n## How to grow your travel email list\n\nWhen it comes to digital marketing, having an email list is essential. Gaining\nsubscribers for your list isn't as difficult as it sounds, either! With the\nright strategy, you can quickly grow a high-quality email list with ease.\n\n### Collecting email addresses in person\n\nAsk people to sign up for your emails when you talk to them face-to-face.\nWhile this may be time-consuming, it's an effective way to get emails from\npotential customers and clients.\n\nPlus, you can use this opportunity to give out discounts and other offers\nright away to incentivize sign-ups.\n\nThanks to the advancements in mobile technology, we now have access to an\narray of email collection apps that can be operated from various mobile\ndevices or smartphones.\n\n### Collecting email addresses through your website\n\n#### Pop-ups\n\nPop-ups are one of the most effective ways to build your subscriber list and\ngrow an email database. Sure, they may be a bit annoying to visitors. But when\nused correctly, pop-ups can be an essential part of success for both large and\nsmall travel agencies.\n\nThey not only grab attention with their bold placement but also encourage\nsubscribers to act quickly by providing them with a convenient signup option\nthat is straightforward to use.\n\n **Pro tip: A clever marketing message in the form of a pop-up can quickly\nmove someone from “just browsing” to engaging with your travel business.**\n\n#### Embedded forms\n\nEmbedded forms are a great way to collect email addresses. They are typically\nplaced in the sidebar of a website, and they allow visitors to quickly sign up\nfor your newsletter or promotional emails without having to navigate away from\nthe page they’re on.\n\nThese forms are also very effective when used with other CTAs, such as\n“Download our whitepaper\" or \"Download our tips for traveling abroad\".\n\n **Pro tip: Email incentives such as exclusive information and even a one-time\ndiscount can attract more people to sign up**.\n\n## How to set up a travel email marketing campaigns\n\n### Define the goals\n\nBefore diving into the task of creating an effective email marketing campaign,\nit is essential to get clear on why you're setting that campaign up in the\nfirst place.\n\nAsk yourself: What are your goals? Are you trying to get more website traffic,\nincrease conversions or boost brand loyalty?\n\nA clearly defined goal allows you to define success and measure progress along\nthe way as well as create a focused strategy toward reaching it. If you don't\nset specific objectives upfront, your efforts may result in wasted time and\nresources.\n\nFiguring out why you’re implementing an email marketing campaign should always\nbe the first step as it will provide a foundation for how to launch, track,\nand optimize your campaigns over time.\n\nBy having your campaign goals in mind from the get-go, you give yourself a far\nbetter chance of being successful with your marketing strategy.\n\n### Build your mailing list\n\nNow, it's time to create a mailing list. You can start with the emails that\nyou have collected through your website or in person, but don't forget to keep\nadding new subscribers as well.\n\nYou can easily do this by using social media and encouraging people to follow\nyour page, join your email list, or share posts with their own networks.\n\n### Segment the list\n\nOnce you have collected your emails, it's time to start segmenting.\nSegmentation is the process of dividing your list into separate categories\nbased on common characteristics.\n\nThis can be done using demographic data (such as age or location),\npsychographic data (lifestyle choices and interests), or any other criteria\nthat make sense for your travel agency.\n\nSegmenting your list allows you to create highly targeted campaigns that will\nbe better received by the people on your list. It also helps you to get more\naccurate insights into the performance of each campaign, so you can make\nadjustments and enhance the overall effectiveness of your marketing emails.\n\n### Decide on the type of content\n\nOnce you've segmented your list, it's time to decide what kind of content you\nwant to send out. Depending on the goal of the campaign, you may choose to\ninclude anything from stories about past experiences and tips for traveling\nsafely to promotional offers and discounts.\n\nIf possible, try to mix up the type of content that you're sending out to keep\nyour audience engaged and interested.\n\n### Craft the message\n\nNow, it's time to craft a powerful email message. Make sure that you include\nattractive subject lines, a captivating introduction, interesting content, and\na clear call to action (CTA).\n\nYour subject lines and CTA should direct people to where they can take the\ndesired action, such as visiting your website or booking a trip.\n\nMake sure to also include an unsubscribe link at the bottom of your emails and\nkeep in mind that all emails should comply with CAN-SPAM regulations.\n\n### Test and optimize\n\nWhen you're finished creating your message, it's time to test it out. Test\nboth the content and the design of the email to make sure that it looks good\nand that it is performing as expected.\n\nThen, track the results and adjust your strategy accordingly. This will help\nyou refine your travel email marketing campaigns over time and get more out of\neach message.\n\n## Wrap Up\n\nIn order to succeed in the online travel and hospitality industry, it is\nessential to have an effective email marketing strategy in place.\n\nAs a tour operator or travel agency, this will allow you to reach out to\npotential customers, build relationships, and ultimately increase travel\nbookings.\n\nBy setting clear objectives, building a mailing list, segmenting the contacts,\ncrafting compelling messages, and testing and optimizing your campaigns\nregularly, you will be able to maximize the impact of your email marketing\nefforts.\n\nNow go out there and start creating powerful email campaigns that will drive\ntravel bookings and increase revenue for your travel business!\n\nFollow Us\n\nSubscribe to updates\n\nGet the latest news and stay in touch with the industry secrets.\n\nForm Label\n\nBy clicking \"Subscribe\", you agree to our Privacy Policy and the data we do\ncollect.\n\nThanks for subscribing\n\nYou've been added to our mailing list. Learn more about the data we collect by\nreading our Privacy Policy\n\nOops! Something went wrong while submitting the form.\n\nRight Now\n\nMust-Have Online Booking System Integrations: Your Solution to More Time and a\nBetter Brand\n\nFebruary 21, 2024\n\n•\n\n10\n\nmin read\n\nDiscover the Most User Friendly Online Booking System\n\nFebruary 19, 2024\n\n•\n\n7\n\nmin read\n\nMaximizing Profits: How to Boost Charter Boat Tours\n\nFebruary 18, 2024\n\n•\n\n9\n\nmin read\n\nUnlocking Extra Earnings: Smart Ways to Help Tour Guides Earn More Tips\n\nFebruary 18, 2024\n\n•\n\n6\n\nmin read\n\n## Keep Reading\n\nBack to blog\n\nEN-US\n\n  * EN\n  * HE\n  * EN-UK\n  * ZH\n  * RU\n  * AR\n  * JA\n  * NL\n  * HU\n  * FR\n  * PL\n  * SV\n  * EL\n  * DA\n  * ES\n  * IT\n  * DE\n\n",
    "links": "[{\"link\": \"https://www.ticketinghub.com/\", \"text\": \"\"}, {\"link\": \"https://www.ticketinghub.com/product/sell\", \"text\": \"\"}, {\"link\": \"https://www.ticketinghub.com/product/manage\", \"text\": \"\"}, {\"link\": \"https://www.ticketinghub.com/product/grow\", \"text\": \"\"}, {\"link\": \"https://www.ticketinghub.com/features\", \"text\": \"All features\"}, {\"link\": \"https://www.ticketinghub.com/best-cloud-ticketing-and-reservation-system/for-attractions\", \"text\": \"Attractions\"}, {\"link\": \"https://www.ticketinghub.com/best-cloud-ticketing-and-reservation-system/for-tour-operators\", \"text\": \"Tour Operators\"}, {\"link\": \"https://www.ticketinghub.com/best-cloud-ticketing-and-reservation-system/for-event-organisers\", \"text\": \"Event Organisers\"}, {\"link\": \"https://www.ticketinghub.com/best-cloud-ticketing-and-reservation-system/for-cultural-sites-monuments\", \"text\": \"Cultural Sites\"}, {\"link\": \"https://www.ticketinghub.com/nbr-1-alternative-to/peek-pro\", \"text\": \"Peek Pro\"}, {\"link\": \"https://www.ticketinghub.com/nbr-1-alternative-to/fareharbor\", \"text\": \"FareHarbor\"}, {\"link\": \"https://www.ticketinghub.com/nbr-1-alternative-to/eventbrite\", \"text\": \"Eventbrite\"}, {\"link\": \"https://www.ticketinghub.com/nbr-1-alternative-to/softur\", \"text\": \"Softur\"}, {\"link\": \"https://www.ticketinghub.com/integrations\", \"text\": \"\"}, {\"link\": \"https://www.ticketinghub.com/blog\", \"text\": \"\"}, {\"link\": \"https://www.ticketinghub.com/case-studies\", \"text\": \"\"}, {\"link\": \"https://www.ticketinghub.com/about-us\", \"text\": \"\"}, {\"link\": \"https://www.ticketinghub.com/testimonials\", \"text\": \"\"}, {\"link\": \"https://www.ticketinghub.com/pricing\", \"text\": \"Pricing\"}, {\"link\": \"https://www.ticketinghub.com/ticketinghub-best-ticketing-and-reservation-system-landing-page\", \"text\": \"Book a demo\"}, {\"link\": \"https://www.ticketinghub.com/product/sell\", \"text\": \"\"}, {\"link\": \"https://www.ticketinghub.com/product/manage\", \"text\": \"\"}, {\"link\": \"https://www.ticketinghub.com/product/grow\", \"text\": \"\"}, {\"link\": \"https://www.ticketinghub.com/features\", \"text\": \"All features\"}, {\"link\": \"https://www.ticketinghub.com/best-cloud-ticketing-and-reservation-system/for-attractions\", \"text\": \"Attractions\"}, {\"link\": \"https://www.ticketinghub.com/best-cloud-ticketing-and-reservation-system/for-tour-operators\", \"text\": \"Tour Operators\"}, {\"link\": \"https://www.ticketinghub.com/best-cloud-ticketing-and-reservation-system/for-event-organisers\", \"text\": \"Event Organisers\"}, {\"link\": \"https://www.ticketinghub.com/best-cloud-ticketing-and-reservation-system/for-cultural-sites-monuments\", \"text\": \"Cultural Sites\"}, {\"link\": \"https://www.ticketinghub.com/nbr-1-alternative-to/peek-pro\", \"text\": \"Peek Pro\"}, {\"link\": \"https://www.ticketinghub.com/nbr-1-alternative-to/fareharbor\", \"text\": \"FareHarbor\"}, {\"link\": \"https://www.ticketinghub.com/nbr-1-alternative-to/eventbrite\", \"text\": \"Eventbrite\"}, {\"link\": \"https://www.ticketinghub.com/nbr-1-alternative-to/softur\", \"text\": \"Softur\"}, {\"link\": \"https://www.ticketinghub.com/integrations\", \"text\": \"\"}, {\"link\": \"https://www.ticketinghub.com/blog\", \"text\": \"\"}, {\"link\": \"https://www.ticketinghub.com/case-studies\", \"text\": \"\"}, {\"link\": \"https://www.ticketinghub.com/about-us\", \"text\": \"\"}, {\"link\": \"https://www.ticketinghub.com/testimonials\", \"text\": \"\"}, {\"link\": \"https://www.ticketinghub.com/pricing\", \"text\": \"Pricing\"}, {\"link\": \"https://www.ticketinghub.com/ticketinghub-best-ticketing-and-reservation-system-landing-page\", \"text\": \"Request a demo\"}, {\"link\": \"https://www.ticketinghub.com/topics/tour-booking-software-news\", \"text\": \"Tour Booking Software News\"}, {\"link\": \"https://www.ticketinghub.com/topics/tours-and-activities-we-love\", \"text\": \"Tours and Activities We Love\"}, {\"link\": \"https://www.ticketinghub.com/topics/getting-started\", \"text\": \"Getting Started\"}, {\"link\": \"https://www.ticketinghub.com/topics/ticketinghub-how-to\", \"text\": \"TicketingHub | How-To\"}, {\"link\": \"https://www.ticketinghub.com/topics/travel-marketing-trends\", \"text\": \"Travel Marketing Trends\"}, {\"link\": \"https://www.ticketinghub.com/\", \"text\": \"Home\"}, {\"link\": \"https://www.ticketinghub.com/blog\", \"text\": \"Blog\"}, {\"link\": \"https://www.ticketinghub.com/topics/ticketinghub-how-to\", \"text\": \"TicketingHub | How-To\"}, {\"link\": \"https://www.ticketinghub.com/blog/best-travel-review-sites-for-tour-operators\", \"text\": \"incorporating\"}, {\"link\": \"https://www.ticketinghub.com/blog/what-this-jaw-dropping-truth-really-tells-us-about-customer-reviews-using-elfsight-reviews\", \"text\": \"detailed guide\"}, {\"link\": \"https://www.ticketinghub.com/legal/privacy-policy\", \"text\": \"Privacy Policy\"}, {\"link\": \"https://www.ticketinghub.com/legal/privacy-policy\", \"text\": \"Privacy Policy\"}, {\"link\": \"https://www.ticketinghub.com/blog/online-booking-system-integrations\", \"text\": \"\"}, {\"link\": \"https://www.ticketinghub.com/blog/user-friendly-online-booking-system\", \"text\": \"\"}, {\"link\": \"https://www.ticketinghub.com/blog/how-to-boost-charter-boat-tours-bookings\", \"text\": \"\"}, {\"link\": \"https://www.ticketinghub.com/blog/help-tour-guides-earn-more-tips\", \"text\": \"\"}, {\"link\": \"https://www.ticketinghub.com/blog\", \"text\": \"Back to blog\"}, {\"link\": \"https://www.ticketinghub.com/blog/how-to-use-travel-email-marketing-to-boost-travel-bookings\", \"text\": \"\"}]"
}