{
    "summary": "Start for free\n\nProduct\n\nPricing\n\nSolutions\n\nPartners\n\nApps\n\nBlog\n\nSupport\n\nStart for free\n\nLog In\n\nYour Bitrix24\n\nAuthorize to enter  \nyour company's Bitrix24.\n\nEnter\n\nDon't have Bitrix24 yet?\n\nCreate your Bitrix24 now\n\nen\n\nAmerica\n\nUnited States (English)  América Latina (Español)  Brasil (Português)  México\n(Español)  Colombia (Español)\n\nEurope\n\nEurope (English)  Deutschland (Deutsch)  France (Français)  Polska (Polski)\nItalia (Italiano)  United Kingdom (English)\n\nAsia\n\nIndia (English)  Türkiye (Türkçe)  中国 (简体中文)  台灣 (繁體中文)  Indonesia (Bahasa\nIndonesia)  Malaysia (Bahasa Melayu)  ประเทศไทย (ภาษาไทย)  Việt Nam (Tiếng\nViệt)  日本 (日本語)\n\nYou can change your region here, if necessary\n\n# 7 Email Marketing Strategies for Travel Agencies\n\n17 min read\n\nVlad Kovalskiy\n\nJune 14, 2022\n\nLast updated: January 17, 2024\n\nThe travel industry is one of the best places to fully make the most of email\nmarketing. Offering aspirational content on travel is a far stretch from\ntrying to interest people in fixing pipes, so you can really get creative.\n\nHowever, creativity can only get you so far. Without solid, data-driven\nstrategies, you’ll fire emails out into the ether never to be seen by anyone,\nmuch less clicked on. However, by directing your creativity through tools, you\ncan streamline your internal processes and make your customer experience not\njust easy, but a pleasure.\n\nThat’s why we’ll be running through 7 email marketing strategies for travel\nagencies that will help you build strong relationships and increase sales.\n\n##  \n\n## FAQs\n\n  \n\n### What are travel email examples?\n\nTypical travel agency email to client examples are:  \n\n  * Welcome emails \n  * Newsletters \n  * Thank you emails \n  * Special offers \n  * Confirmation emails \n  * Notifications and updates \n  * Happy birthday emails\n\n### What are travel agent email ideas?\n\nSome ideas that support email marketing strategies for travel agencies\ninclude:  \n\n  * Do your market research \n  * Give your customers what they love\n  * Suggest destinations based on data\n  * Add testimonials from happy customers\n  * Offer incentives to slow movers\n\n### What are the best email marketing strategies for travel agencies?\n\nThe best email tips for travel agencies include:  \n\n  * Collate data on consumer behavior\n  * Personalize your communications\n  * Automate emails for fast response times\n  * Offer engaging guides and tips — not just sales\n  * Take advantage of engaging images\n  * Design mobile-first emails\n\n##  \n\n## 1\\. CRM: The bedrock of your email marketing\n\nThe first strategy on our list is to acquire and populate a super customer\nrelationship management (CRM) system. This is a database where you store all\nthe records of all your clients, from first and last name to email address,\ntelephone number, and social media handles.\n\nAll email marketing strategies for travel agencies will advise you to populate\nyour CRM with as much detail as possible. You can use sign up forms on your\nwebsite and social media to get the basics, and use follow-up forms to get a\ndeeper understanding of their interests. If you find yourself struggling for\ncustomers, incentivize leads with special offers to join your newsletter.\n\nOnce you’ve got your leads, all their interactions will be saved within the\nsystem. This means that every holiday booked, every link clicked, and every\ninteraction contributes to creating a clearer picture of every client.\n\nEmail marketing in the travel industry also relies heavily on segregating your\ncustomer database into smaller demographics. Travel email examples couples\nover 60 may focus more on cruises and romantic getaways, while those for young\nsingles may feature content on beach breaks and party cities. Each lead can be\nput into multiple different lists based on their dream destinations,\nnationality, age bracket, and much more.\n\nOne of our top tips for travel email marketing is to sort your customers as\nthey enter your database, rather than manually sorting them into groups at a\nlater date. With your CRM set up correctly, all incoming leads can be\nautomatically split into relevant mailing lists so you can concentrate on\ncreating those enticing messages.\n\n##  \n\n## 2\\. Get personal with your content\n\nOne of the top email marketing strategies for travel agencies is to add a\npersonal touch to your messages. It is well known that emails that are\ndirected at specific targets, rather than thrown out to everybody on your\nlist, perform far better. Furthermore, if your users feel your content isn’t\nrelevant to them, they’re likely to see emails as junk and unsubscribe.\n\nA few easy ways to personalize emails:\n\n  * Include first name in subject and body \n\n  * Sending emails based on interest \n\n  * Waking up dormant leads with special offers \n\nSo now, you can create four to five variations on a monthly newsletter, with\nsome content overlapping, and other sections specific to each mailing list.\nInclude a personalization tag to include each recipient’s name and you’re\nready to launch your emails.\n\nAs they’re personal, avoid overly corporate speech. A travel agency email to\nclient example subject could be “My top tips for travel in September”.\nCreating and curating a connection with your customers builds trust over time\nand sets you apart from every other company’s efforts. Therefore, send\nquality, personalized content often, and you’ll keep the fire burning.\n\nBut it’s not quite that easy! Even the best email marketing strategies for\ntravel agencies forget this one simple trick: Make sure your emails comply\nwith all local privacy legislation. Rules change depending on the country, but\nrespecting unsubscriptions and relying only on information voluntarily\nprovided are two big areas to work on.\n\nCompliance with personalization will also help your emails arrive safely at\ntheir destination (no pun intended). If you tick all the right boxes, you’ll\navoid landing in the spam folder and being missed altogether.\n\n##  \n\n## 3\\. Use automations to trigger emails\n\nWhile your newsletters should include fresh, exciting content every month,\nemail marketing in the travel industry also requires standardized emails that\nwork by themselves behind the scenes so you can spend more time on the\ncreative side.\n\nEmails that are ideal for automation include:\n\n  * Welcome emails \n\n  * Thank you emails \n\n  * Confirmations \n\n  * Reminders \n\n  * Alerts \n\n  * Happy birthday emails \n\n  * Drip-fed promotional campaigns \n\nTrigger emails are a life-saver for busy people. You simply set up an event as\nyour trigger, and when it is met, your CRM sends out a pre-written\npersonalized email. For example, you can drip feed reminders of a campaign\nevery two days. Set them up in a customer journey workflow to relieve stress\non your team and keep your customers engaged.\n\nConfirmation emails are among the most common triggered travel agency email\nexamples. You only need a brief message, such as “Hi, Sarah, here is your\nconfirmation for booking number 0800896.” All of the variable details, such as\nthe name and booking number, are automatically lifted from your CRM to\npopulate your email and before she knows it, Sarah has got her confirmation.\n\nThese days, the general public expects trigger emails as an assurance that\neverything is going to plan. Think of it like a physical ticket. Once your\ncustomer has their confirmation, they can rest easy until their holiday\napproaches.\n\nBut triggers can come in all shapes and sizes. You can monitor user\ninteraction with emails, and give them a nudge if you feel you’re losing them.\nAutomate a message to go out after six months of no clicks, and offer them a\nspecial discount to convince them to get back in the game.\n\n##  \n\n* * *\n\n####\n\n#### Powerful Email Marketing Software\n\nReplace all your current SaaS solutions with all in one CRM and marketing\nautomation software. Run marketing campaigns inside your Bitrix24 CRM \\- email\nmarketing, ad targeting, and more.  \n  \nTry Now\n\n* * *\n\n  \n\n##  \n\n## 4\\. Channel your content marketing\n\nContent is one of the most important email marketing strategies for travel\nagencies as it provides that inspirational backdrop that sparks customers into\naction. Email marketing for tourism relies more heavily than others on solid\ncontent as the costs involved in travel are much more than clothes, for\nexample.\n\nThe kind of content marketing that has been proven to work includes:\n\n  * City guides \n\n  * Tips on different types of travel \n\n  * Top places to eat listicles \n\n  * Things to do per month \n\nRather than travel agent email ideas that fill a message with an entire\narticle, consider writing a teaser that links to a longer article on your blog\nor videos and photo albums on social media. This is ideal for newsletters,\nwhere you want to include multiple articles or interesting features, but don’t\nwant to send a 5000-word email.\n\nThe copy within your email should therefore be short and snappy. Travel agency\nemail examples that link to longer content could include lines like “What’s\nNew York been hiding all these years? Find out here.”\n\nHowever, it’s really hard to get people to act without giving them a call to\naction (CTA). Your CTA can direct your users to anything you want, whether\nit’s a piece of content or a downloadable PDF that requires users to fill in a\nsurvey on their interests. With a powerful CRM combined with email marketing\nautomation, you can gather data on how well your emails are performing, and\nrun A/B tests to improve your approach.\n\n##  \n\n## 5\\. Go above and beyond slick text\n\nSure, your copy should be attractive, informal, and inspiring, but you can\nstill do much better. Email marketing strategies for travel agencies can take\nadvantage of mouth-watering imagery and videos. With no words at all, you can\ncreate a sense of adventure and get people desperate for a trip to a paradise\nbeach.\n\nMore than any other industry, images and video of travel can attract the eye.\nThis can be your secret weapon in grabbing your reader’s attention and getting\nbookings. Just like with other areas of email marketing strategies for travel\nagencies, you can run tests on your emails to find out which images gain\nclicks. Sure, you could spend time working on A/B tests, but why not gauge\nwhat works by checking out your Instagram page?\n\nMake sure any images you embed are of the highest quality — anything less\ngives a “cheap” feeling. However, embedded videos can often slow your\ndownloading speed, so it’s best to link to social media and leave a thumbnail\nas a teaser. A snippet of text underneath gives context and meaning to your\ncontent, and you’re ready to go.\n\nBut it’s not just enticing destinations you should be decorating your emails\nwith. Like in any other industry, travel email marketing can benefit hugely\nfrom branding that is clear, but that doesn’t distract from the message.\nDesign all your emails to follow the same theme — whether they’re automated\ntrigger emails or personal correspondence with your customers. It’s all part\nof building trust with your clients and is one of the easiest email tips for\ntravel agencies we can offer.\n\n##  \n\n## 6\\. Make your emails mobile-friendly\n\nIf you haven’t heard of mobile responsiveness yet, you must have been living\nunder a rock (or on a desert island). You’ve probably already been working on\na mobile responsive website and booking process, but designing emails for\nsmartphones needs the same treatment.\n\nIt’s one of the most important email marketing strategies for travel agencies,\nas a majority of users in the travel industry are turning to their phones for\nbrowsing, booking, and much more. For example, when you’re coming up to the\nsecurity desk at an airport, the last thing you want is a confirmation email\nthat won’t load properly.\n\nYour first strategy should therefore be to make all your emails compatible for\nmobile. A mobile-first mentality pushes you to craft dynamic messages that\nincrease your click-through-rate, rather than pedestrian, text-filled\nexplanations. Make sure to analyze how fast your animations and images load,\nand remember that not all phones respond the same.\n\nBut it’s not just designing. Your CRM will tell you when your customers are\ntraveling (hint: it’s between the start date and end date of their journey).\nThis is a perfect opportunity to send little extras during their trip. For\nexample, you could fire over an email with codes for city tours or authentic\nexperiences. They simply have to scan the code and get an unexpected, but very\npleasant, surprise.\n\n##  \n\n## 7\\. Get started with the right tools!\n\nGreat! You’ve got a bunch of email marketing strategies for travel agencies,\nbut how are you going to put them into practice?\n\nSure, you could download a CRM to store your contacts and an email designer to\ngo with your website builder, communications center, and everything else you\nneed. But there’s a better way! With Bitrix24, you get everything you need to\nput your email marketing for tourism into practice — all on one platform. No\nmore switching back and forth, hoping your fragile integrations will hold\nstrong. With everything fully connected on an easy-to-use interface, you can\ntake the stress out of your tech solutions.\n\nYour powerful CRM and analytics do all the hard work behind the scenes, so\nyour customers can enjoy their trip with no worries. As you monitor their\nbehavior, you can modify what you offer to provide the best experience\npossible.\n\nGet started with email templates and customize them to fit your brand and\noffering. As time goes on, you’ll create a backlog of your very own templates\nthat are ready to go at a moment's notice (when automations aren’t taking care\nof it, of course!)\n\nNow you might be wondering what coding languages you need to know to get the\nbest results. Answer? None. You can do absolutely everything using a drag-and-\ndrop tool for total ease of use.\n\nThe best part is you can get started today for free!\n\n  \n\nMost Popular\n\nAI\n\n7 Best AI Content Detector Tools\n\nSmall Business\n\n120 Small Business Ideas To Start in 2024\n\nAI\n\nGoogle Bard vs. ChatGPT: What's the difference?\n\nWork Efficiency\n\nImproving Project Delivery Times with Bitrix24 Tools\n\nAI\n\nBreaking Down AI: How It's Changing the Face of Modern Business\n\nTable of Content\n\nFAQs What are travel email examples? What are travel agent email ideas? What\nare the best email marketing strategies for travel agencies? 1\\. CRM: The\nbedrock of your email marketing 2\\. Get personal with your content 3\\. Use\nautomations to trigger emails 4\\. Channel your content marketing 5\\. Go above\nand beyond slick text 6\\. Make your emails mobile-friendly 7\\. Get started\nwith the right tools!\n\nYou may also like\n\nblog\n\nwebinars\n\nglossary\n\n## Free. Unlimited. Online.\n\nBitrix24 is a place where everyone can communicate, collaborate on tasks and\nprojects, manage clients and do much more.\n\nStart for free\n\nYou may also like\n\nSoftware\n\nTop 13 Wireframe Tools in 2023\n\n32 min read\n\nHR\n\n9 Crucial Tips to Reduce Employee Turnover\n\n17 min read\n\nSoftware\n\n7 Advantages of Mobile Task Management Software\n\n16 min read\n\nshow more\n\n123...7576 Next\n\nBitrix\n\n  * Bitrix24\n  * Pricing\n  * Media kit\n  * Contact us\n  * In the press\n\nSupport\n\n  * Helpdesk\n  * Webinars\n  * How-to videos\n  * Contact support\n  * Schedule a demo\n  * Status\n\nResources\n\n  * Blog\n  * Articles\n  * Solutions\n  * Testimonials\n  * Alternatives\n  * Uses\n  * Resources\n\nOn-premise\n\n  * On-premise edition\n  * Download\n  * Documentation\n\nCompare to\n\n  * Asana\n  * Clickup\n  * Monday\n  * Zoho\n  * Trello\n  * Hubspot\n  * Microsoft Project\n  * Deskera\n  * Sharepoint\n  * Odoo\n\nApps\n\n  * Market\n  * Mobile app\n  * Desktop app\n  * API/developers\n  * Google API Services\n\nPartners\n\n  * Find a partner\n  * Become a partner\n  * Partner login\n\n  * Legal\n  * Terms\n  * Privacy\n  * GDPR\n  * Security\n  * Abuse\n  * Do Not Sell or Share My Information\n\n© 2024 Bitrix24\n\n  *   *   *   *   *   *   * \n\nPrivacy Overview\n\n**Cookies:** This website uses cookies for analytical and technical reasons.\n‘Analytical Cookies’ are inserted by Google Analytics to help us understand\nwhich countries our visitors come from, which pages they visit and what\nactions they take on this site. ‘Strictly Necessary Cookies’, as the name\nimplies, are a type of cookies that are required for proper functioning of\ncertain features of this website, such as the ability to use live chat.\nDisabling these cookies will disable access to those features and degrade your\nwebsite experience.\n\nCookies of both types can be enabled or disabled within this plugin.\n\nCookie Settings\n\nStrictly Necessary Cookies\n\nDo Not Sell or Share My Information\n\nCookie Policy\n\nMore information about our Cookie Policy\n\nWe use cookies to enhance your browsing experience - Find out more. By\ncontinuing to browse this site you are agreeing to our use of cookies. Change\nyour cookie settings.\n\nGot it\n\n",
    "links": "[{\"link\": \"https://www.bitrix24.com/search/\", \"text\": \"\"}, {\"link\": \"https://www.bitrix24.com/tools/\", \"text\": \"Product\"}, {\"link\": \"https://www.bitrix24.com/prices/\", \"text\": \"Pricing\"}, {\"link\": \"https://www.bitrix24.com/solutions/\", \"text\": \"Solutions\"}, {\"link\": \"https://www.bitrix24.com/partners/\", \"text\": \"Partners\"}, {\"link\": \"https://www.bitrix24.com/applications.php\", \"text\": \"Apps\"}, {\"link\": \"https://www.bitrix24.com/about/blogs/\", \"text\": \"Blog\"}, {\"link\": \"https://www.bitrix24.com/search/\", \"text\": \"\"}, {\"link\": \"https://www.bitrix24.com/articles/7-email-marketing-strategies-for-travel-agencies.php?moved_from=US\", \"text\": \"\"}, {\"link\": \"https://www.bitrix24.com/about/authors/vlad-kovalskiy/\", \"text\": \"Vlad Kovalskiy\"}, {\"link\": \"https://www.bitrix24.com/solutions/industry/travel.php\", \"text\": \"travel industry\"}, {\"link\": \"https://www.bitrix24.com/solutions/tool/crm.php\", \"text\": \"customer relationship management\"}, {\"link\": \"https://www.bitrix24.com/solutions/sales/sales-workflow-management.php\", \"text\": \"customer journey workflow\"}, {\"link\": \"https://www.bitrix24.com/create.php?b24_type=crm\", \"text\": \"Try Now\"}, {\"link\": \"https://www.bitrix24.com/solutions/industry/travel.php\", \"text\": \"Email marketing for tourism\"}, {\"link\": \"https://www.bitrix24.com/tools/crm/free-crm-email-marketing-software.php\", \"text\": \"email marketing automation\"}, {\"link\": \"https://www.bitrix24.com/tools/websites/\", \"text\": \"mobile responsive website\"}, {\"link\": \"https://www.bitrix24.com/articles/7-best-ai-content-detector-tools.php\", \"text\": \"\"}, {\"link\": \"https://www.bitrix24.com/articles/26-small-business-ideas-to-start-in-2023.php\", \"text\": \"\"}, {\"link\": \"https://www.bitrix24.com/articles/google-bard-vs-chatgpt-what-s-the-difference.php\", \"text\": \"\"}, {\"link\": \"https://www.bitrix24.com/articles/improving-project-delivery-times-with-bitrix24-tools.php\", \"text\": \"\"}, {\"link\": \"https://www.bitrix24.com/articles/breaking-down-ai-how-it-s-changing-the-face-of-modern-business.php\", \"text\": \"\"}, {\"link\": \"https://www.bitrix24.com/about/blogs/\", \"text\": \"\"}, {\"link\": \"https://www.bitrix24.com/webinars/\", \"text\": \"\"}, {\"link\": \"https://www.bitrix24.com/glossary/\", \"text\": \"\"}, {\"link\": \"https://www.bitrix24.com/articles/top-13-wireframe-tools-in-2023.php\", \"text\": \"\"}, {\"link\": \"https://www.bitrix24.com/articles/software/\", \"text\": \"Software\"}, {\"link\": \"https://www.bitrix24.com/articles/top-13-wireframe-tools-in-2023.php\", \"text\": \"Top 13 Wireframe Tools in 2023\"}, {\"link\": \"https://www.bitrix24.com/articles/9-crucial-tips-to-reduce-employee-turnover.php\", \"text\": \"\"}, {\"link\": \"https://www.bitrix24.com/articles/hr/\", \"text\": \"HR\"}, {\"link\": \"https://www.bitrix24.com/articles/9-crucial-tips-to-reduce-employee-turnover.php\", \"text\": \"9 Crucial Tips to Reduce Employee Turnover\"}, {\"link\": \"https://www.bitrix24.com/articles/7-advantages-of-mobile-task-management-software.php\", \"text\": \"\"}, {\"link\": \"https://www.bitrix24.com/articles/software/\", \"text\": \"Software\"}, {\"link\": \"https://www.bitrix24.com/articles/7-advantages-of-mobile-task-management-software.php\", \"text\": \"7 Advantages of Mobile Task Management Software\"}, {\"link\": \"https://www.bitrix24.com/articles/7-email-marketing-strategies-for-travel-agencies.php?ELEMENT_CODE=7-email-marketing-strategies-for-travel-agencies&PAGEN_2=2\", \"text\": \"2\"}, {\"link\": \"https://www.bitrix24.com/articles/7-email-marketing-strategies-for-travel-agencies.php?ELEMENT_CODE=7-email-marketing-strategies-for-travel-agencies&PAGEN_2=3\", \"text\": \"3\"}, {\"link\": \"https://www.bitrix24.com/articles/7-email-marketing-strategies-for-travel-agencies.php?ELEMENT_CODE=7-email-marketing-strategies-for-travel-agencies&PAGEN_2=75\", \"text\": \"75\"}, {\"link\": \"https://www.bitrix24.com/articles/7-email-marketing-strategies-for-travel-agencies.php?ELEMENT_CODE=7-email-marketing-strategies-for-travel-agencies&PAGEN_2=76\", \"text\": \"76\"}, {\"link\": \"https://www.bitrix24.com/articles/7-email-marketing-strategies-for-travel-agencies.php?ELEMENT_CODE=7-email-marketing-strategies-for-travel-agencies&PAGEN_2=2\", \"text\": \"\"}, {\"link\": \"https://www.bitrix24.com/tools/\", \"text\": \"Bitrix24\"}, {\"link\": \"https://www.bitrix24.com/prices/\", \"text\": \"Pricing\"}, {\"link\": \"https://www.bitrix24.com/about/contacts.php\", \"text\": \"Contact us\"}, {\"link\": \"https://www.bitrix24.com/about/press.php\", \"text\": \"In the press\"}, {\"link\": \"https://www.bitrix24.com/support/webinars.php\", \"text\": \"Webinars\"}, {\"link\": \"https://www.bitrix24.com/partners/\", \"text\": \"Schedule a demo\"}, {\"link\": \"https://www.bitrix24.com/about/blogs/\", \"text\": \"Blog\"}, {\"link\": \"https://www.bitrix24.com/solutions/\", \"text\": \"Solutions\"}, {\"link\": \"https://www.bitrix24.com/testimonials/\", \"text\": \"Testimonials\"}, {\"link\": \"https://www.bitrix24.com/alternatives/\", \"text\": \"Alternatives\"}, {\"link\": \"https://www.bitrix24.com/uses/\", \"text\": \"Uses\"}, {\"link\": \"https://www.bitrix24.com/resources/\", \"text\": \"Resources\"}, {\"link\": \"https://www.bitrix24.com/self-hosted/\", \"text\": \"On-premise edition\"}, {\"link\": \"https://www.bitrix24.com/prices/30-day-trial.php\", \"text\": \"Download\"}, {\"link\": \"https://www.bitrix24.com/alternatives/free-asana-alternative.php\", \"text\": \"Asana\"}, {\"link\": \"https://www.bitrix24.com/alternatives/free-clickup-alternative.php\", \"text\": \"Clickup\"}, {\"link\": \"https://www.bitrix24.com/alternatives/free-monday-alternative.php\", \"text\": \"Monday\"}, {\"link\": \"https://www.bitrix24.com/alternatives/free-zoho-alternative.php\", \"text\": \"Zoho\"}, {\"link\": \"https://www.bitrix24.com/alternatives/free-trello-alternative.php\", \"text\": \"Trello\"}, {\"link\": \"https://www.bitrix24.com/alternatives/free-hubspot-crm-alternative.php\", \"text\": \"Hubspot\"}, {\"link\": \"https://www.bitrix24.com/alternatives/free-microsoft-project-alternative.php\", \"text\": \"Microsoft Project\"}, {\"link\": \"https://www.bitrix24.com/alternatives/free-deskera-alternative.php\", \"text\": \"Deskera\"}, {\"link\": \"https://www.bitrix24.com/alternatives/free-sharepoint-alternative.php\", \"text\": \"Sharepoint\"}, {\"link\": \"https://www.bitrix24.com/alternatives/free-odoo-alternative-openerp.php\", \"text\": \"Odoo\"}, {\"link\": \"https://www.bitrix24.com/apps/\", \"text\": \"Market\"}, {\"link\": \"https://www.bitrix24.com/apps/mobile-app.php\", \"text\": \"Mobile app\"}, {\"link\": \"https://www.bitrix24.com/apps/desktop.php\", \"text\": \"Desktop app\"}, {\"link\": \"https://www.bitrix24.com/apps/dev.php\", \"text\": \"API/developers\"}, {\"link\": \"https://www.bitrix24.com/privacy/google-integration-privacy-policy.php\", \"text\": \"Google API Services\"}, {\"link\": \"https://www.bitrix24.com/partners/\", \"text\": \"Find a partner\"}, {\"link\": \"https://www.bitrix24.com/legal.php\", \"text\": \"Legal\"}, {\"link\": \"https://www.bitrix24.com/terms/\", \"text\": \"Terms\"}, {\"link\": \"https://www.bitrix24.com/privacy/\", \"text\": \"Privacy\"}, {\"link\": \"https://www.bitrix24.com/gdpr/\", \"text\": \"GDPR\"}, {\"link\": \"https://www.bitrix24.com/security/\", \"text\": \"Security\"}, {\"link\": \"https://www.bitrix24.com/abuse/\", \"text\": \"Abuse\"}, {\"link\": \"https://www.bitrix24.com/about/cookie-policy/\", \"text\": \"Find out more\"}]"
}