{
    "summary": "##\n\nABC News\n\n## Video\n\n## Live\n\n## Shows\n\n## Election 2024\n\n## 538\n\nInterest Successfully Added\n\nWe'll notify you here with news about\n\nTurn on desktop notifications for breaking stories about interest?\n\nOffOn\n\nLOG IN\n\n## Stream on\n\n## Oops! Page unavailable.\n\nThis page either does not exist or is currently unavailable.\n\nFrom here you can either hit the \"back\" button on your browser to return to\nthe previous page, or visit the ABCNews.com Home Page. You can also search for\nsomething on our site below.\n\nSTATUS CODE: 404\n\nABC News Network\n\nAbout Nielsen Measurement\n\nChildren's Online Privacy Policy\n\nContact Us\n\nDo Not Sell or Share My Personal Information\n\nInterest-Based Ads\n\nPrivacy Policy\n\nTerms of Use\n\nYour US State Privacy Rights\n\n© 2024 ABC News\n\n## Notice of Right to Opt Out of Sale/Sharing\n\nSome states provide residents (or, in some cases, their authorized agents)\nwith the right to opt out of “targeted advertising,” “selling,” or “sharing”\nof personal information. Please visitYour US State Privacy Rights, including\ntheYour California Privacy Rights section, for more information about your\nrights and our privacy practices.\n\n###  Manage Consent Preferences\n\n#### Technically Necessary\n\nAlways Active\n\nThese cookies are necessary for our services to function and cannot be\nswitched off in our systems. They are usually only set in response to actions\nmade by you which amount to a request for services, such as setting your\nprivacy preferences, logging in, accessing, searching, or discovering content,\nor filling in forms. You can set your browser to block, or alert you about,\nthese cookies, but some parts of the site will not then work.\n\n#### Selling, Sharing, Targeted Advertising\n\nSelling, Sharing, Targeted Advertising\n\nWe may use personal information to support “targeted advertising,” “selling,”\nor “sharing,” as defined by applicable privacy laws, which may result in third\nparties receiving your personal information. **You or your legally authorized\nagent can move the toggle above to the left to opt out of these activities on\nthis digital property consistent with applicable law.** Please note that,\nbecause these activities are based on online cookies, your opt-out choice is\nspecific to this property. If you access other digital properties of the Walt\nDisney Family of Companies, you will need to make your election for each.\nAlso, if you clear your cookies on this browser or use another browser or\ndevice, you may need to opt out again on this property.  \n  \nIn addition to the above toggle, you may choose to provide the information\nrequested in this opt-out form, which may enable us to take action on your\nopt-out election more broadly than just on this digital property.  \n  \nYou may also choose to enable online, where available, a universal tool that\nautomatically communicates your opt-out preferences, such as the Global\nPrivacy Control (“GPC”). We will process the GPC signal as a request to opt\nout.  \n  \nIf you opt out, you may continue to see advertising, including ads that may be\nbased on personal information processed before you opted out.  \n  \nYou also may have rights to opt out from certain third parties selling and\nsharing your personal information. You will need to separately exercise your\nopt-out rights with regard to each, which you may do through this IAB opt-out\nlist. You may also wish to use other available online tools to limit various\ntypes of interest-based advertising or tracking. To learn more, visit \"Do Not\nSell or Share My Personal Information\" and \"Targeted Advertising\" Opt-Out\nRights.\n\nBack Button\n\n### Performance Cookies\n\nSearch Icon\n\nFilter Icon\n\nClear\n\ncheckbox label label\n\nApply Cancel\n\nConsent Leg.Interest\n\nSwitch Label label\n\nSwitch Label label\n\nSwitch Label label\n\nConfirm My Choices\n\n",
    "links": "[{\"link\": \"https://abcnews.go.com/\", \"text\": \"\"}, {\"link\": \"https://abcnews.go.com/Video\", \"text\": \"Video\"}, {\"link\": \"https://abcnews.go.com/Live\", \"text\": \"Live\"}, {\"link\": \"https://abcnews.go.com/elections\", \"text\": \"Election 2024\"}, {\"link\": \"https://abcnews.go.com/538\", \"text\": \"538\"}, {\"link\": \"https://abcnews.go.com/\", \"text\": \"ABCNews.com Home Page\"}, {\"link\": \"https://abcnews.go.com/\", \"text\": \"ABC News Network\"}]"
}