{
    "summary": "Menu  Search\n\nEnter search terms\n\nGo\n\nEnter search terms\n\n  * Main Sections \n  * Legislature Home \n  * House of Representatives \n  * Senate \n  * Find Your District  Find Your District \n  * Laws & Agency Rules \n  * Bill Information \n  * Agendas, Schedules, & Calendars \n  * Legislative Committees \n  * Legislative Agencies \n  * Legislative Information Center \n  * Email Updates (GovDelivery) \n  * View all links \n\n  * Legislature Home\n\n  * House of Representatives\n  * Senate\n  * Find Your District Find Your District\n  * Laws & Agency Rules\n  * Bill Information\n  * Agendas, Schedules, and Calendars\n  * Legislative Committees\n  * Coming to the Legislature\n  * Civic Education\n  * Legislative Agencies\n  * Legislative Information Center\n  * Email Updates (GovDelivery)\n  * View All Links\n\nPrint\n\nRCWs > Title 42 > Chapter 42.52 > Section 42.52.180  \n  \n\n42.52.170  <<  42.52.180 >>   42.52.185  \n  \n\n### PDFRCW 42.52.180\n\n### Use of public resources for political campaigns.\n\n(1) No state officer or state employee may use or authorize the use of\nfacilities of an agency, directly or indirectly, for the purpose of assisting\na campaign for election of a person to an office or for the promotion of or\nopposition to a ballot proposition. Knowing acquiescence by a person with\nauthority to direct, control, or influence the actions of the state officer or\nstate employee using public resources in violation of this section constitutes\na violation of this section. Facilities of an agency include, but are not\nlimited to, use of stationery, postage, machines, and equipment, use of state\nemployees of the agency during working hours, vehicles, office space,\npublications of the agency, and clientele lists of persons served by the\nagency.\n\n(2) This section shall not apply to the following activities:\n\n(a) Action taken at an open public meeting by members of an elected\nlegislative body to express a collective decision, or to actually vote upon a\nmotion, proposal, resolution, order, or ordinance, or to support or oppose a\nballot proposition as long as (i) required notice of the meeting includes the\ntitle and number of the ballot proposition, and (ii) members of the\nlegislative body or members of the public are afforded an approximately equal\nopportunity for the expression of an opposing view;\n\n(b) A statement by an elected official in support of or in opposition to any\nballot proposition at an open press conference or in response to a specific\ninquiry. For the purposes of this subsection, it is not a violation of this\nsection for an elected official to respond to an inquiry regarding a ballot\nproposition, to make incidental remarks concerning a ballot proposition in an\nofficial communication, or otherwise comment on a ballot proposition without\nan actual, measurable expenditure of public funds. The ethics boards shall\nadopt by rule a definition of measurable expenditure;\n\n(c)(i) The maintenance of official legislative websites throughout the year,\nregardless of pending elections. The websites may contain any discretionary\nmaterial which was also specifically prepared for the legislator in the course\nof his or her duties as a legislator, including newsletters and press\nreleases.\n\n(ii) The official legislative websites of legislators seeking reelection or\nelection to any office shall not be altered, other than during a special\nlegislative session, beginning on the first day of the declaration of\ncandidacy filing period specified in RCW 29A.24.050 through the date of\ncertification of the general election of the election year. As used in this\nsubsection, \"legislator\" means a legislator who is a \"candidate,\" as defined\nin RCW 42.17A.005, for any public office. \"Legislator\" does not include a\nmember of the legislature who has announced their retirement from elected\npublic office and who does not file a declaration of candidacy by the end of\nthe candidacy filing period specified in RCW 29A.24.050.\n\n(iii) The website shall not be used for campaign purposes;\n\n(d) Activities that are part of the normal and regular conduct of the office\nor agency, which include but are not limited to:\n\n(i) Communications by a legislator or appropriate legislative staff designee\ndirectly pertaining to any legislative proposal which has been introduced in\neither chamber of the legislature; and\n\n(ii) Posting, by a legislator or appropriate legislative staff designee,\ninformation to a legislator's official legislative website including an\nofficial legislative social media account, about:\n\n(A) Emergencies;\n\n(B) Federal holidays, state and legislatively recognized holidays established\nunder RCW 1.16.050, and religious holidays;\n\n(C) Information originally provided or published by other government entities\nwhich provide information about government resources; and\n\n(D) Achievements, honors, or awards of extraordinary distinction; and\n\n(e) De minimis use of public facilities by statewide elected officials and\nlegislators incidental to the preparation or delivery of permissible\ncommunications, including written and verbal communications initiated by them\nof their views on ballot propositions that foreseeably may affect a matter\nthat falls within their constitutional or statutory responsibilities.\n\n(3) As to state officers and employees, this section operates to the exclusion\nof RCW 42.17A.555.\n\n(4) As used in this section, \"official legislative website\" includes, but is\nnot limited to, a legislator's official legislative social media accounts.\n\n[ 2022 c 37 § 3; 2017 c 7 § 2; 2011 c 60 § 30; 2010 c 185 § 1; 1995 c 397 §\n30; 1994 c 154 § 118.]\n\n### NOTES:\n\nFinding—Intent—2017 c 7: \"The legislature finds that the prohibition on the\nuse of public resources for campaign purposes serves an important purpose, but\nthat the period prohibiting state legislators from communicating with\nconstituents at public expense is unnecessary once the election, and the\ncampaign itself, has ended. Furthermore, the delay in constituent outreach\nafter the election only hinders a legislator's ability to quickly and\neffectively respond to requests and keep the public informed about current\nstate issues, and the various deadlines relating to mailed, emailed, and\nwebsite communications are confusing and need to be harmonized. For these\nreasons, the legislature intends to change mailed, emailed, and website\ncommunication deadlines to the same time periods, in order to allow\nlegislators to actively engage with the public on official legislative\nbusiness in a timely and effective manner.\" [ 2017 c 7 § 1.]\n\nEffective date—2017 c 7: \"This act is necessary for the immediate preservation\nof the public peace, health, or safety, or support of the state government and\nits existing public institutions, and takes effect immediately [March 31,\n2017].\" [ 2017 c 7 § 4.]\n\nEffective date—2011 c 60: See RCW 42.17A.919.\n\nEffective date—Captions—1995 c 397: See RCW 42.17A.910 and 42.17A.911.\n\nSite Contents  \nSelected content listed in alphabetical order under each group\n\n  * Let Your Voice Be Heard \n  * Contact Your Legislators \n  * Comment on a Bill \n  * Participate in Committee Hearings \n  \n\n  * Find \n  * Bills \n  * Committee Meeting Schedules & Agendas \n  * District & Legislators \n  * Laws & Rules \n  * Member Information / Rosters \n  * Video & Audio on TVW \n\n  \n\n  * About the Legislature \n  * Committees \n  * House of Representatives \n  * Legislative Agencies \n  * Legislative Information Center \n  * Legislature Home \n  * Senate \n  \n\n  * Track Legislation \n  * Bills \n  * Email Updates (GovDelivery) \n  * RSS Feeds \n  * Web Services \n\n  \n\n  * Additional Information \n  * Accessibility Information \n  * Civic Education \n  * Comments about this site \n  * Contact Us \n  * Disclaimer \n  * Employment Opportunities \n  * Gift Center \n  * Glossary of Terms \n  * Help \n  * History of the State Legislature \n  * Privacy Notice \n  * Reports to the Legislature \n  * Search \n\n  * Outside the Legislature \n  * Contact Congress - the Other Washington \n  * Governor's Website \n  * OFM Fiscal Note Website \n  * Washington Courts \n\n  \n\nTranslate\n\nPowered by Translate\n\n# loading\n\nOriginal text\n\nRate this translation\n\nYour feedback will be used to help improve Google Translate\n\n",
    "links": "[]"
}