{
    "summary": "Skip to main content Bipartisan Policy Center logo\n\n  * Policy Areas \n    * Business \n    * Campus Free Expression \n    * Child Welfare \n    * Democracy \n    * Digital Democracy \n    * Early Childhood \n    * Economy \n    * Elections \n    * Energy \n    * Health \n    * Higher Education \n    * Housing \n    * Immigration \n    * Infrastructure \n    * Technology \n  * Resources \n    * All Resources \n    * New & Updated \n    * All Reports \n    * All Projects \n    * All Explainers \n    * All Blog Posts \n    * All Press Releases \n    * All Podcasts \n    * All Upcoming Events \n    * All Past Events \n  * Get Involved \n    * BPC Newsletter \n    * Attend an Event \n    * Work with Us \n    * Internships \n    * BPC Action \n  * About \n    * About Us \n    * Contact Us \n    * Media Center \n    * Our Team \n  * Give\n\nSearch Keywords Submit\n\n#### Policy Areas\n\n  * Business \n  * Campus Free Expression \n  * Child Welfare \n  * Democracy \n  * Digital Democracy \n  * Early Childhood \n  * Economy \n  * Elections \n  * Energy \n  * Health \n  * Higher Education \n  * Housing \n  * Immigration \n  * Infrastructure \n  * Technology \n\n#### Resources\n\n  * All Resources \n  * New & Updated \n  * All Reports \n  * All Projects \n  * All Explainers \n  * All Blog Posts \n  * All Press Releases \n  * All Podcasts \n  * All Upcoming Events \n  * All Past Events \n\n#### Get Involved\n\n  * BPC Newsletter \n  * Attend an Event \n  * Work with Us \n  * Internships \n  * BPC Action \n\n#### About\n\n  * About Us \n  * Contact Us \n  * Media Center \n  * Our Team \n\nGive\n\nNEW\n\nSpellings: Congress Must Stay Focused on Averting a Shutdown\n\n  * Digital Democracy \n\n# A Brief History of Tech and Elections: A 26-Year Journey\n\n  * By  Katie Harbath  , \n  * Collier Fernekes \n\nSep 28, 2022\n\nReport\n\n##### Share\n\n###### Downloads\n\n  * ### Download the Report\n\nDownload\n\nT  he first political campaigns to utilize the internet were President Bill\nClinton’s and Republican nominee Bob Dole’s in 1996. In the 26 years since,\ntechnology has had a huge impact on elections around the world – for better\nand for worse.\n\nWith the advent of social media in the early 2000s, new platforms emerged\nnearly every year that would transform how candidates communicated, voters\nengaged, and the media covered the day-to-day horse race.\n\nFor the first 20 years, many platforms embraced their role in the democratic\nprocess. They proactively touted their partnerships with media organizations\nin helping people get news and information. They boasted how candidates found\ntheir platforms indispensable in reaching voters. They co-hosted debates,\nshared data on how much people were talking about candidates and issues, and\nhelped register voters.\n\nThe 2016 elections changed everything. Donald Trump put companies’ content\npolicies to the test. Seemingly overnight, tech platforms turned from positive\nforces in democracy to negative ones after elections in the Philippines,\nBrexit in the United Kingdom, and the shock of Trump’s upset win in the United\nStates happened. Gone were the posts bragging about how Trump’s online\nstrategies helped him win (unlike when President Barack Obama won in 2012); in\ntheir place came announcements about preventing foreign interference,\nprotecting against mis- and disinformation, and building political ad\ndatabases.\n\nThis report analyzes the public announcements made by technology companies\nover the past 26 years. We chronologically catalog which companies were\nfounded during that timeframe and their public messaging about their election\nroles. We also document how platforms transitioned from touting their\nimportance to candidates’ voter outreach to the deplatforming of a sitting\npresident of the United States for violating their community standards.\n\nThis report is not a comprehensive examination at how campaigns used\ntechnology over the years; many online tools such as email, websites,\nfundraising platforms, and texting are not covered. We also do not go deep\ninto the effects of bloggers or the mainstream media on the political process.\nInstead, the report offers a snapshot of campaigns from the tech companies’\npoint of view.\n\nWe analyze a database of links released by the Bipartisan Policy Center in\nAugust 2022, and updated since. This task involved curating all the public\nannouncements from tech companies about their election work, and we\nsupplemented it with searches in LexisNexis and interviews with professionals\nwho worked on these efforts at various platforms – including one of this\nreport’s authors, Katie Harbath. Harbath was a public policy director at\nFacebook for 10 years, where she built the teams working with politicians and\ngovernments on how to use the platform. She also coordinated the company’s\nwork on elections around the globe from mid-2013 to late 2019. In addition,\nHarbath was a digital strategist for various Republican campaigns in the early\n2000s, including at the Republican National Committee and the National\nSenatorial Committee. Wherever we could, we linked the existing releases or\nnews stories, and where we could not, we provided a footnote with the\nappropriate citation from LexisNexis.\n\n## Overview\n\nIn the following pages, we provide a brief history that has many twists and\nturns as different platforms come on the scene and then both embrace and\ngrapple with their role in political discourse around the world. While much\nhas changed from the 1990s to today, some key themes emerge:\n\n  1. **Alphabet and Meta released the most announcements.** Alphabet (made up mainly of Google and YouTube) and Meta (consisting of Facebook, Instagram, and WhatsApp) originated the bulk of announcements over the years. Twitter was a close third.\n  2. **Meta became the most vocal starting in 2017.** Following the 2016 election and the questions around misinformation, Russian interference, and political ad transparency, Meta (then Facebook) became the most vocal platform about what it was doing to protect elections.\n  3. **The focus shifted from candidate use to integrity issues.** In the beginning, much of the platforms’ focus was either on highlighting how candidates were using their sites to communicate with voters or how they were helping people to vote. After the 2016 election, there was a clear shift to talking about integrity efforts, such as combating mis- and disinformation or providing transparency around political ads and less about what the candidates were doing.\n  4. **Authoritative information.** Despite those shifts, the one area that seems consistent across the years is platforms’ commitment to helping people get the information they need to participate in the political process.\n  5. **Most communication centered on U.S. elections.** Although the platforms, especially Meta, have communicated a lot about their work in international elections, the United States – especially in presidential election years – has been the focus of the platforms’ announcements.\n  6. **Shift to streaming.** More and more political campaigns are running ads on audio- and video-streaming services where they can use the same data-mining techniques they use elsewhere to target voters. However, these services have no transparency tools and are not regulated, making it extremely hard to track who is buying ads, what those ads are saying, and who they are targeting.\n\n  \n  \n\n## The Beginning …\n\n### Pre-2004\n\n#### Companies Founded:\n\n  * 1975 – Microsoft\n  * 1985 – AOL\n  * 1994 – Amazon\n  * 1994 – Yahoo\n  * 1997 – Netflix\n  * 1998 – Google\n  * 1999 – Blogger\n  * 2000 – Pandora\n  * 2002 – Meetup\n  * 2002 – Friendster\n  * 2003 – MySpace\n  * 2004 – Gmail\n  * 2004 – Facebook\n  * 2004 – Audioblog\n  * 2004 – Okrut\n\n#### Milestones:\n\n  * 1994 – First e-commerce transaction\n  * 1996 – Microsoft teams with NBC to launch Decision’96 website\n  * 1996 – First presidential campaign websites\n  * 1998 – First online political donation\n  * 2000 – First podcasts distributed through RSS\n  * 2000 – Google debuts Google Ad Words\n  * 2001 – Googlebombing\n\nIt is nearly impossible to find accessible links at this point to any tech\ncompany announcements in the late 1990s and early 2000s. Most of what we found\nwas either through LexisNexis or news stories that discussed the platforms’\nactivities. The first eight years of online campaigning, while significant,\nwere limited compared with today. Throughout 1996, news stories marveled at\nthe first presidential campaign websites and regularly discussed how news\norganizations were launching online versions of their coverage.\n\n  \nImage courtesy of 4President.us  \n  \nImage courtesy of 4President.us\n\nMicrosoft teamed with NBC to create MSNBC in the summer of 1996, bringing an\nonline presence along with it – including a Decision ’96 section where voters\ncould get information about the election. This is the earliest instance of a\ntech company announcement about elections that we could find.\n\nCompuServe hosted an online Q&A with House Speaker Newt Gingrich in 1996 that\nit said was one of the “best attended” chats that year.\n\nDespite the 2000 election’s importance to current-day American politics, the\n2000 election remained somewhat quiet on the tech company front – until\nreporting emerged in September 2000 on an interesting phenomenon called\nGooglebombing. An online humor magazine had manipulated Google’s search\nresults so that if you searched for “dumb motherf****r” [asterisks ours] you\nwould be redirected to a George W. Bush merchandise store. Google called the\nprank an anomaly and said it was working to improve online security. This\nexample is likely one of the first appearances of a political integrity issue\non a technology platform – a trend that would become an issue in the following\nyears.\n\nIt was also one of the first instances we could find of a discussion about the\nrole misinformation could play online. In a September 2000 issue of Searcher\nmagazine, Paul S. Piper, a librarian from Western Washington University,\noutlined how “counterfeit websites” could fool people into believing things\nthat weren’t true – including fake George W. Bush websites.\n\nIn the 2000 presidential campaign, for the first time ever, the technology\nplatforms sponsored the Democratic and Republican conventions, with AOL and\nPsuedo.com adding their logos to the festivities. A site called internet.com\nreported that candidates Bill Bradley and John McCain were beating Al Gore and\nGeorge W. Bush on internet searches.\n\nThe 2002 midterms were relatively quiet on the technology front, with most\ncampaigns focused on building websites, voter files, and fundraising\ntechnology to accept donations online.\n\nWe also found that some of the earliest social media platforms were founded\nduring this time. Meetup and Friendster came on the scene in 2002 and MySpace\na year later in 2003. Facebook debuted on February 4, 2004, at Harvard\nUniversity. Audioblog would also launch in 2004 as the first commercial\npodcast hosting service.\n\nOther than MySpace joining forces with Rock the Vote to mobilize young voters,\nthere were not many tech company announcements during this election. There\nwere, however, plenty of stories about how Howard Dean’s campaign was\ninnovative in using online platforms such as MeetUp and on John Kerry being on\nFriendster. The Republican National Committee created parody websites such as\n“Flipper Cam” to highlight John Kerry’s supposed “flip flops” on issues. These\nwere early signs of the technological wave about to change elections forever.\n\n### 2005 – 2006\n\n#### Companies Founded:\n\n  * 2005 – YouTube\n  * 2006 – Twitter\n\n#### Milestones:\n\n  * 2005 – President Bush Googlebombed\n  * 2006 – First Facebook political ads\n  * 2006 – Facebook launches news feed\n  * 2006 – George Allen gaffe posted to YouTube\n\nIn the wake of the 2004 presidential election, there was no doubt that\ninternet campaigning was here to stay: “eCampaign” departments started to be\nformalized inside the party committees. Congressional offices and campaigns\nbegan hiring digital directors and conducting meetings with bloggers.\n\nGoogle continued to face the growing threat of Googlebombing, accompanied by\naccusations from the right that the company was politically biased for failing\nto prevent the manipulation of search results. Marissa Mayer – then Google’s\ndirector of consumer web products – denied any bias, but instead blamed\nproblems with its algorithms. “We don’t condone the practice of Googlebombing\nor any other action that seeks to affect the integrity of our search results,”\nMayer said. “But we’re also reluctant to alter our results by hand in order to\nprevent such items from showing up.”\n\nTwo years after its founding, Facebook became a significant player on the\npolitical stage. This change began on college campuses as student candidates\ncreated Facebook groups for their campaigns, even buying ads. In 2006,\nFacebook announced various election issue groups, with Mark Zuckerberg stating\nthat “[i]n the upcoming election, the free, unrestricted and unmanipulated\nflow of information is also vital to democracy.” In November, Facebook posted\na blog post encouraging people to vote and shared an “election pulse”\ndashboard that listed how many users were supporting which candidates on their\nprofiles.\n\nMySpace, meanwhile, announced a voter registration campaign, and Virginia Gov.\nMark Warner made a brief appearance in the online virtual world Second Life.\n\nThe most significant milestone of the 2006 election era was a video of then-\nSen. George Allen of Virginia. Allen was seeking re-election and was\nconsidered a front-runner for the 2008 GOP presidential nomination, until a\ncritical day in August. Allen was followed on the campaign trail by a\n“tracker,” a person sometimes hired by an opponent who attends campaign events\nwith a video camera or audio recorder in hopes of catching the candidate\nsaying or doing something potentially embarrassing Allen called out this\ntracker using a racial slur, and the video was promptly uploaded to YouTube.\nAt the time, YouTube was still a nascent video-sharing platform created just a\nyear before, and the video of Allen promptly went viral. It was the first\nwarning sign to candidates that anything they say could immediately be seen by\nhundreds of thousands, if not millions, of people. YouTube did not comment on\nthe incident but would come to embrace candidates’ use of the platform in\n2008.\n\n  \nImage from YouTube\n\n## Optimistic Era\n\n### 2007 – 2008\n\n#### Companies Founded:\n\n  * 2007 – Tumblr\n\n#### Milestones:\n\n  * 2007 – iPhone Launch\n  * 2007 – Facebook launches pages and it’s ad platform\n  * 2007 – MySpace, YouTube, and Facebook hires to focus on supporting political figures political hires\n  * 2008 – YouTube/CNN presidential debate\n\nBy 2007, it was MySpace’s time to shine. At the time, MySpace was the largest\nsocial networking site and in March 2007, it announced a section dedicated to\npolitics with an emphasis on the 2008 presidential election. It partnered with\nMTV for a series of one-on-one dialogues with the leading presidential\ncandidates and America’s youth on college campuses. In 2008, MySpace was the\nfirst platform to link a partnership with the Committee on Presidential\nDebates to create MyDebates.org, a new website that would “house interactive\ntools for viewers to virally engage in the political process, including a\npersonalized issue scorecard, polling, reportable national statistics, live\nweb streaming and much more.” Candidates were flocking to set up accounts on\nthe site, as well as on Facebook and YouTube.\n\nThen-Sen. Barack Obama would revolutionize the use of the web similarly to how\nHoward Dean had in 2004. Chris Hughes – one of the Facebook co-founders – left\nthe company in 2007 to work on Obama’s presidential campaign and promptly\nincorporated many of the lessons he learned while building the social network.\n\nWith more candidates using MySpace, Google, YouTube, Facebook and other\nplatforms, the companies started pulling in more resources and people-power to\nprovide customer support to those campaigns, as well as identifying potential\npartnerships to get more political content on their sites.\n\nIn March of 2007, YouTube launched CitizenTube and invited the presidential\ncandidates to campus. In 2008, YouTube would be the first to start a regular\nseries of blog posts highlighting the content that candidates were posting to\nthe platform. It also started media partnerships, beginning with the New\nHampshire primary in January 2008. In addition, YouTube made a point to\nhighlight how the platform was being used around the world: This post about\nthe Kenyan election in 2008 was one of the earliest we could find. John\nEdwards announced his presidential candidacy on the platform in January 2007,\nand the company began a special section called YouChoose ’08. It was also the\nfirst to co-sponsor major primary debates for both the Democrats and\nRepublicans with CNN, where the candidates famously got a question from a\nsnowman.\n\n  \nImage courtesy of YouTube\n\nFacebook transformed in the middle of the 2008 campaign by announcing the\ncreation of pages and an ad platform in early November 2007 that allowed\ncandidates to better connect with voters. Later that month, it launched a\npartnership with ABC News to create a U.S. politics application where people\ncould share their support for their favorite candidate, learn how to register\nto vote, and join debate groups. Facebook also began ads to help people\nregister to vote and did the first “I Voted” Election Day reminder at the top\nof the news feed.\n\nFacebook had a presence at the Democratic and GOP conventions similar to\nMicrosoft, UStream.tv, and Google/YouTube. In another sign of tensions to come\nfor the company, Randi Zuckerberg – Mark’s sister and a Facebook employee at\nthe time – was outspoken about how Democrats embraced Facebook at their\nconvention and the Republicans did not at theirs. The GOP forcefully\ndisagreed, saying it had incorporated “new” media into its plans and that\nZuckerberg was wrong.\n\nRegardless, Barack Obama won in 2008 in what was heralded as the “Facebook\nelection” – the first election where “all candidates—presidential and\ncongressional—attempted to connect directly with American voters via online\nsocial networking sites like Facebook and MySpace.”\n\n### 2009 – 2010\n\n#### Companies Founded:\n\n  * 2009 – WhatsApp\n  * 2009 – Foursquare\n  * 2009 – Pinterest\n  * 2009 – Bitcoin\n  * 2010 – NextDoor\n\n#### Milestones:\n\n  * Google’s first transparency report\n\n2008 may have been dubbed the MySpace or Facebook election, but going into\n2009, YouTube was the platform that communicated the most about candidates\naround the globe. It also tracked the trends and insights on what candidates\nand issues people were searching for across its platform.\n\nYouTube highlighted televised election programming in Spain, the U.K., Greece,\nand Poland. In Israel, voters used the video platform to pose questions to\ncandidates for prime minister. Before the election in India, YouTube\nhighlighted the Google elections center where people could get news and\ninformation about the candidates running for Parliament. As the U.S. midterms\napproached, it highlighted the platform’s use for gubernatorial debates, as\nwell as trends and insights about the most-watched videos.\n\nAs Google and YouTube built up their teams, AOL also started to go after the\npolitical advertising funds that were expected to start flowing to the\nplatforms.\n\nThese platforms once again helped people to register to vote and see alerts\nabout Election Day details. For the first time, Foursquare and Twitter made\nannouncements highlighting their efforts. Foursquare created a way for people\nto check into their polling place to get an “I Voted” badge, while Twitter\nhighlighted different accounts and hashtags that people could follow to get\nthe latest election coverage.\n\nFoursquare polling place check-in\n\n### 2011 – 2012\n\n#### Companies Founded:\n\n  * 2011 – Snapchat\n  * 2012 – Medium\n  * 2012 – Oculus\n  * 2012 – Coinbase\n\n#### Milestones:\n\n  * Arab Spring\n  * Return of Santorum/Googlebombing controversy\n  * President Obama does Q&A with Zuckerberg\n  * Google and Facebook co-sponsor primary debates\n  * Official convention activations by companies\n  * Obama sets records with convention speech, thank-you post\n  * Facebook Nature Study shows value of the “I Voted” button\n  * First congressional hackathon\n\nEarly 2011 through 2012 was arguably the pinnacle of optimism over\ntechnology’s role in democracy. The Arab Spring – a series of anti-government\nuprisings that started in Tunisia and spread to Libya, Egypt, Yemen, Syria,\nand Bahrain – began early in the new year. Social media played a huge role in\nhelping the protesters to organize and to post minute-by-minute updates to the\nrest of the world. Someone in Egypt even named their baby “Facebook” to honor\nthe platform’s role in the revolution.\n\nBack in the United States, politicians such as President George W. Bush,\nPresident Barack Obama, and Reps. Eric Cantor, Paul Ryan, and Kevin McCarthy\nall headed to Facebook to be interviewed by executives. Obama also did a\nTwitter town hall. Congress held its first official “hackathon.” Digital music\nservice Pandora announced in 2011 it would host political ads. Google and\nFacebook sponsored GOP presidential primary debates in 2012 (the Democrats\nheld none with Obama running unopposed for re-election, .)\n\n  \n\nOne of the few controversies during this time was the resurrection of results\nwhen searching for Sen. Rick Santorum on Google, Yahoo, and Bing. The problem\nfirst surfaced in July 2006, when Dan Savage began an online campaign against\nSantorum. Despite its unflattering stance toward the senator, Savage’s website\npopped up first when users searched Santorum’s name. In 2011 when he was\nrunning for president, the senator became more vocal about how none of the\nsearch engines would fix the top results, and he accused them of bias.\n\nEntering the 2012 election year, these platforms – especially Google – once\nagain released data on how much people were talking about the candidates and\nissues as voters went to the polls in the primaries. Facebook put out tips for\nthe candidates on how to use the platform and announced an election app with\nCNN. Twitter debuted a political engagement map. Amazon released a heat map\nwhere people could see the most popular political books by state.\n\nThe platforms were present at both party conventions, with the media saying\nsocial media helped make the gatherings “a convention without walls.” The\nplatforms provided people with authoritative information again on how to vote,\nand Facebook even released a study in Nature magazine showing how its “I\nVoted” button helped to boost turnout.\n\n  \nFacebook and Twitter space at the 2012 convention.\n\nAfter President Obama declared victory on Election Day, he posted on Twitter\nand Facebook a photo of him and the first lady hugging that was simply titled\n“Four more years.” It became the most tweeted and liked posting to date.\nHundreds of stories ran before and after the campaign on the president’s\nrevolutionary use of technology.\n\n  \nEveryone wanted to know how they could do the same.\n\n### 2013 – 2014\n\n#### Companies Founded\n\n  * 2013 – Vine\n  * 2013 – Telegram\n  * 2014 – Justin.tv/Twitch\n  * 2014 – First non-fungible token\n\n#### Milestones:\n\n  * Facebook questioned about “I Voted” Button\n\n2013 was a somewhat quiet year for the companies on the elections front. In\nAustralia, the parties capitalized on the lessons learned from President\nObama’s 2012 campaign with the Liberal Party federal director saying in a\nspeech afterward, “Social media was more important in this election than any\nprevious one and the Liberal Party devoted a much greater proportion of our\ncampaign resources to it than we have in the past.”\n\nQuestions were raised about the Liberal Party’s use of a Facebook app and what\ndata it was collecting from users.\n\nSocial media – especially Facebook and Twitter – were also used in the 2013\nGerman elections. The U.S. Congress held its second hackathon.\n\nThen came 2014 – a year in which nearly half of the world went to the polls.\nFor many countries, social media was playing a big role in their elections for\nthe first time. In India, candidates embraced social media. Facebook and\nTwitter released data on what people were talking about on the platform, did a\nlivestream partnership with NDTV to interview the candidates, and launched\ntheir “I Voted” button for the first time overseas.\n\n  \n  \nThat work extended to many of the other major elections that year, including\nin the European Union, Colombia, Indonesia, the Scottish independence\nreferendum, Brazil, and New Zealand.  \n\nAhead of the U.S. midterms, the platforms were doing a lot of the same things\nthey had in 2012. Their efforts included providing people with authoritative\ninformation about how to vote, insight into what candidates and issues people\nwere talking about, and election results.\n\nFor one of the first times, Facebook faced pressure on its “I Voted” button\nand questions around what, if any, research it had done in 2012. This issue\nwas on people’s minds after the company was questioned earlier that year about\na study it had done to see which changes to the news feed could make people\nhappier or sadder – a controversy called “emotional contagion” after a phrase\nin the report.\n\n## The Reckoning\n\n### 2015 – 2016\n\n#### Companies Founded\n\n  * 2015 – Meerkat\n  * 2015 – Periscope\n  * 2015 – Discord\n  * 2016 – TikTok\n\n#### Milestones:\n\n  * The explosion of livestreaming – Meerkat, Periscope, Facebook Live\n  * Donald Trump’s Muslim ban comment\n  * Primary debate co-sponsorships by Facebook, Google, and Twitter\n  * Philippines and Brexit elections\n  * Trending topics controversy for Facebook\n  * Major party convention activations\n  * Onsite presence at general election debates\n  * Facebook’s launching of fact-checking program\n\nThe 2015-2016 period was a turning point for the companies. These were the\nlast years they co-sponsored debates or highlighted how politicians were using\ntheir platforms.\n\n2015 saw a series of elections in the United Kingdom, Canada, and Argentina.\nGoogle and YouTube highlighted how they were helping people get information\nfor the election in the United Kingdom while Facebook partnered with Sky News\nto livestream a series of debates on its platform. Facebook even partnered\nwith a design studio to light up the famous London Eye as a donut chart to\nshow how much people were talking about the political parties on the platform.\n\n  \nImage courtesy of Bompas and Parr\n\nLivestreaming exploded during these years. At the popular SXSW conference in\n2015, everyone was talking about an app called Meerkat where people could\nlivestream from their phones. Some went so far as to declare that 2016 would\nbe known as the “Meerkat election.” Although that app fizzled out once\nFacebook launched Facebook Live and Twitter introduced Periscope,\nlivestreaming was here to stay. Then-candidate Donald Trump was one of the\nfirst politicians to use it, livestreaming his arrival to the August 2015\nRepublican primary debate in Cleveland – of which Facebook was a co-sponsor\nalong with Fox News. Trump and the presidential candidates regularly\nlivestreamed their rallies. Trump even streamed the third debate on his\nwebsite with his own people providing commentary and analysis. Many wondered\nif it was a glimpse into what might become Trump TV.\n\nIn addition, Facebook sponsored a primary debate where it wove insights and\ndata about what people were discussing on the platform into moderator\nquestions. YouTube and Twitter also co-sponsored primary debates, doing\nsimilar things with their data.\n\nAround this time, questions about candidates and content moderation started to\nrise, starting with Donald Trump’s December 2015 statement and social media\nposts about supporting a ban on Muslims coming into the United States. It was\nthe beginning of a debate around politicians and speech that continues to this\nday.\n\nThis controversy did not stop the tech companies from coming out in full force\nfor the general election in 2016. YouTube, Twitter, Google, Facebook, and\nothers all had activations at both conventions and were sponsors helping to\nstream the proceedings on their sites. They provided behind-the-scenes\ncoverage as well as data on what people were talking about the conventions on\ntheir platforms.\n\nFor the first time in the general election debates, Facebook and Google\nprovided data to the moderators about what people were talking about online\nthat they could use when posing the questions. Facebook was on the ground to\nprovide journalists and others with the ability to go live from behind the\nscenes. Snap was onsite to cover each debate for its “Live Stories” product.\nThe first general election debate was, at the time, the most tweeted ever.\n\nInstagram got in on the action as well, partnering with CNN on a series of\nactivations, including a portrait series of the candidates and projecting the\nelection night results on the Empire State building.\n\n  \nImage courtesy of CNN\n\nIn addition, Microsoft was using predictive tools to forecast the election.\nVimeo, Pandora, Nextdoor, Twitch, Google, Facebook, and Twitter also provided\npeople with information on registering to vote and how to vote on Election\nDay.\n\nThings became rockier for the companies as 2016 went on. A controversial\nelection in the Philippines saw a candidate win who regularly utilized online\nharassment to silence his critics. Facebook was accused of suppressing\nconservative content in its trending topics section. The United Kingdom\nstunned the world by voting to leave the European Union, leading many to\nwonder how the Brexit campaign had used social media.\n\nBy fall, _The Economist_ was running stories about an era of post-truth\npolitics. And, after Donald Trump’s unexpected victory in the 2016\npresidential election, the platforms went overnight from being celebrated for\ntheir role in campaigning to being vilified. Stories surfaced of Macedonian\nteenagers spreading fake news to make money. The Trump campaign said Facebook\nwas the key tool for its victory – leaving many to wonder what sort of ads he\nactually ran, what they said, and who they targeted. Many were concerned that\nthe campaign had run ads to suppress the Black vote — an accusation campaign\nofficials denied.\n\nBy December Facebook launched the first version of its fact-checking program.\n\n### 2017 – 2018\n\n#### Companies Founded:\n\n  * 2018 – Parler\n\n#### Milestones:\n\n  * Russian interference found on platforms\n  * Company executives testify before Congress and other legislative bodies\n  * Cambridge Analytica news story broke\n  * Political and issue ad transparency dashboards appear\n  * Misinformation labels debut\n  * Integrity teams are formed\n  * Facebook changes its approach to the political sales team\n  * Election operation centers or war rooms\n  * Trump caravan ad is removed\n  * Instagram launches I Voted stickers\n  * Snapchat helps users to register to vote\n  * First coordinated inauthentic behavior reports\n  * Less political content is shown in the Facebook feed\n\n2017 and 2018 saw a dramatic shift in how technology companies approached\nelections. The focus was no longer on showcasing how their platforms could\nhelp candidates engage with voters, but rather on how they were addressing the\nharms that could appear on their platforms.\n\nIn early 2017, the focus was on people – such as those in Macedonia – who were\nspreading fake news for money. Critics began to urge platforms to make online\npolitical ads more transparent. In April, Facebook released a paper that\noutlined its understanding of organized attempts to misuse the platform.\n\nIt was not until early September 2017 that Facebook first released a statement\nshowing that it had found ads on the 2016 U.S. election originating in Russia.\n\nA flurry of activity followed as other platforms such as Google/YouTube,\nTumblr, and Twitter said that they too had found similar actions. Facebook,\nGoogle, and Twitter executives testified to Congress about the matter. The\ncompanies announced that they would launch political ad libraries to help\nbring more transparency to the advertising being run on the platforms –\nincluding verification efforts to ensure that foreign entities could not place\nads. Zuckerberg announced additional measures the company would take to\nprotect the integrity of elections, including working more closely with\nelection commissions and increasing the sharing of threat information with\nother companies and the government.\n\nMock-up of Facebook political ad transparency tools as announced in 2017\n\nIn 2018, the heat turned up for Facebook when it was revealed that a firm\ncalled Cambridge Analytica had used data from Facebook users to build voter\nfiles that were then used to place targeted ads. This development increased\nquestions about the role of data in campaigning and whether Facebook and other\nplatforms were doing enough to protect the security of elections on their\nplatforms. Mark Zuckerberg apologized for the incident on CNN.\n\nThe company also started a series of blog posts and briefings called “Hard\nQuestions” to address how the platform was trying to address some of these\ndifficult questions around protecting democracy. In this one from late March,\nexecutives focused on four areas that they were working on:\n\n  * Combating foreign interference,\n  * Removing fake accounts,\n  * Increasing ads transparency, and\n  * Reducing the spread of false news.\n\nMeanwhile, the midterms were underway in the United States, and Mexico went to\nthe polls in July and Brazil in October. Facebook launched its war room to\nhelp address problems in real-time.\n\n  \nImage courtesy of Facebook\n\nFacebook was the most outspoken during this time about all the things it was\ndoing, but the company was not alone. The platforms were still helping people\nto register to vote. Amazon began an election update feature on its Alexa\ndevices, Apple created a midterm news section, and YouTube was focusing on how\npeople could follow news organizations to get election updates.\n\nAs the year ended, the companies turned their attention to the elections\nhappening globally in 2019, such as in India. Facebook also announced an\nupdate to the Civil Rights Audit that it had committed to in May, including\nupdated content policies it had done that year around voting information.\n\n### 2019 – 2020\n\n#### Companies Founded:\n\n  * 2020 – Clubhouse\n  * 2020 – Meta (Facebook) Oversight Board\n\n#### **Milestones:**\n\n  * Twitter bans political ads\n  * TikTok does first election post about banning political ads\n  * Mark Zuckerberg gives Georgetown speech\n  * Mark Zuckerberg makes a donation to help election officials\n  * Labels with information about the election process are launched\n  * People are encouraged people to be poll workers\n  * Campaigns engage paid influencers\n  * Facebook civic integrity team is disbanded\n\nThe beginning of 2019 took most tech companies overseas to work on numerous\nelections, such as those in India, Indonesia, Thailand, Australia, Israel,\nAustralia, the EU parliament, Cameroon, Kenya, Nigeria, Senegal, and South\nAfrica.\n\nFor the United States, 2019 ushered in the lead-up to one of the most\nturbulent and polarizing elections in American history. Free speech issues\ncame into the spotlight. In September 2019, Nick Clegg, Meta’s vice president\nof global affairs and communications, spoke at the Atlantic Festival about\nFacebook’s approach to political speech – including the fact that content from\npoliticians was not eligible to be fact-checked on the platform. A few weeks\nlater, Mark Zuckerberg gave a speech at Georgetown University about “Standing\nfor Voice and Free Expression.”\n\n  \nMark Zuckerberg at Georgetown University\n\nThese speeches led to an intense discussion in the tech and political worlds\nabout the role of online political advertising – particularly microtargeting.\nSome wanted platforms to ban the targeting of political ads – valuable tools\nthat campaigns and political parties did not want to lose. This debate led to\nplatforms taking different approaches. Twitter chose to ban political ads,\nGoogle reduced the number of targeting options, and Facebook announced more\ntransparency and control over political ads.\n\nIn addition to announcements about political ads, in late 2019 platforms like\nMeta and Apple began to market their earlier updates to election integrity\nefforts to stay ahead of the game. Most content from tech companies focused on\npolitical ads, with even new companies like Tik Tok making their first\nannouncement about political ads on the platform.\n\nThe COVID-19 pandemic – declared in March 2020 – became a further catalyst for\nchange and adjustments surrounding election information from tech platforms.\nThe companies pushed out authoritative information on voting, with Google,\nYouTube and other companies releasing products showing how to vote in a user’s\nlocal jurisdiction. Meta faced controversy in June when it did not take down a\npost of President Trump’s in the aftermath of the George Floyd murder in\nMinneapolis. Also that month, Meta announced the creation of its Voter\nInformation Center, an interactive product with information from independent\nfact-checkers to provide authoritative information to voters. This involved\napplying labels created by multiple nonpartisan and bipartisan organizations –\nincluding the BPC – to certain posts when they included keywords or\ninformation about elections.\n\nOn July 29, 2020, tech executives found themselves again answering questions\nfrom members of Congress – this time from the House Judiciary Committee, which\nheld part 6 of a hearing series on online platforms and market power. Members\nasked questions about the company’s efforts around the election and content\nmoderation.\n\nMeanwhile, companies like Uber and Lyft were announcing efforts to help people\nget to the polls. Amazon, Twitch, Hulu, Discord, and Pandora all made\nannouncements about helping people to vote as well. Meta announced a new\nresearch initiative to “understand the impact of Facebook and Instagram on key\npolitical attitudes and behaviors during the U.S. 2020 elections.”\n\n  \nUber’s interface to help people get to the polls in 2020\n\nAs the primaries came to a close and former Vice President Joe Biden secured\nthe Democratic Party presidential nomination, activity became more contentious\non the platforms. Then-President Donald Trump had already made claims that the\nelection would be fraudulent if he did not win the general election. As\nElection Day approached, companies geared up for a slew of misinformation\nabout the election administration process and increased their efforts to get\nauthoritative information to the public, such as the fact that ballots would\ntake longer to count and the public would likely not have final results on\nelection night.\n\nOn November 7, the media declared Biden the winner of the 2020 election based\non projected Electoral College tallies, but President Trump refused to\nconcede. In fact, Trump posted on his social media accounts that he had won,\ncausing the platforms to add a label that Biden was the projected winner.\nFacebook and Google put a temporary ban on political ads that extended through\nthe inauguration. This became a challenge for the Senate runoff elections in\nGeorgia, causing the platforms to make an exception for ads about that race.\n\n## A New Era …\n\n### 2021 – 2022\n\n#### Companies Founded:\n\n  * 2021 – Gettr\n  * 2021 – Truth Social\n\n#### Milestones:\n\n  * January 6 insurrection\n  * Georgia Senate runoff\n  * President Trump is deplatformed \n    * Oversight Board and updated Facebook policies on deplatforming\n  * Facebook and Twitter whistleblowers\n  * Facebook’s Oversight Board accepts the case to look at Meta cross-check system\n  * First campaign NFTs and crypto donations\n\n2021 started with the Georgia Senate runoffs and immediately turned to the\ncongressional count of the electoral votes in the 2020 election on January 6,\n2021. As a group of Donald Trump’s supporters stormed the Capitol, several\nhigh-ranking members of Congress and the administration pleaded with the\npresident to call off his supporters; he eventually released a video on his\nsocial media accounts informing his supporters that they should leave the\nCapitol and go home.\n\nHowever, the platforms found the president’s continued rhetoric to be too\ninflammatory and, on the evening of the attack, many temporarily suspended\nTrump’s accounts. The next day, Twitter and Meta banned his accounts\nindefinitely due to the ongoing threat of his inciting further violence.\nMonths after deplatforming President Trump, Facebook asked its Oversight Board\nto revisit the decision; the board kicked the decision back to the platform\nfor Meta to come up with a policy for situations such as this. A few weeks\nlater, Meta released a policy that upheld the ban for two more years. This\nmeans the company will revisit the suspension in January 2023.\n\nThe decision to deplatform President Trump led to the founding or growth of\nnew conservative platforms such as Parler, Gettr, and Truth Social (which\nwould become President Trump’s new official online platform) that emerged as\nbastions for “free expression” and explicitly cater to those on the right.\n\nJanuary 6 also highlighted how the integrity challenges for the platforms have\nevolved from fighting foreign interference to trickier issues of rising\nnationalism, intolerance, and vitriol in the domestic political sphere.\nQuestions emerged following the insurrection on the role that social media\nplayed in helping protesters to organize and what the companies should have\ndone to prevent the violence.\n\nThe tech giants found themselves in front of Congress yet again when, in March\n2021, the House Committee on Energy and Commerce held a hearing on social\nmedia’s role in promoting extremism and misinformation. Another was held in\nJuly by the House Judiciary Committee. In October 2021, former Meta employee\nand whistleblower Francis Haugen called out the company for its approach to\nsafety and integrity issues on Facebook and Instagram, including how they\napproach speech by politicians as well as teen safety.\n\nIn 2022, tech companies have focused on preparations for the midterm\nelections. Eight companies — Meta, Twitter, Google, YouTube, Tik Tok,\nSalesforce, LinkedIn, and Nextdoor — have already made announcements. In those\nannouncements, they focused on how they are helping to promote authoritative\ninformation on where, when, and how to vote; their election content policies;\ntheir approach to political and issue ads; and the partners they work with.\n\nTech companies will keep updating their policies and products leading up to\nthe midterm elections, but the response will most likely not be as robust as\nduring presidential election years.\n\nMoreover, audio- and video-streaming companies are starting to get more into\nthe mix, as the New York Times reports that “powerful data-mining techniques\nthat campaigns routinely use to tailor political ads to consumers on sites and\napps are making the leap to streaming video.” Spotify earlier this year\nquietly brought back political ads on its platform, and Hulu recently faced\npressure to allow issue ads after it denied Democrats’ desire to run ads on\nthe Supreme Court abortion decision. Further complicating things is that these\nstreaming services have no ad transparency tools, so it is impossible to know\nwho is running ads, what those ads say, and who they are targeting.\n\nThe United States is not the only focus of these companies, with elections in\nFrance, India, Australia, Philippines, Brazil, and Kenya also top of mind.\nBrazil’s election in October is of utmost concern, given President Jair\nBolsonaro’s attempts to sow distrust in the electoral process – similar to\nthose of former President Trump.\n\n  \nInstagram voting stickers for the 2022 French election  \n  \nTikTok’s 2022 Kenyan Election Guide\n\nBack in the United States, in September 2022, Twitter’s former chief of\nsecurity Peiter “Mudge” Zatko came forward as a whistleblower in regard to\nTwitter’s alleged lack of protections for user data. He testified in a hearing\nbefore the Senate Judiciary Committee on September 13, 2022 about how he\nthinks Twitter has security failures. The day after, the Senate Committee on\nHomeland Security and Government Affairs held a hearing on Social Media’s\nImpact on Homeland Security.\n\nWhile there rightfully remains a strong focus on the existing social media\nplatforms, it is important to also look toward new and emerging technologies\nthat campaigns are utilizing. These include accepting donations in\ncryptocurrency and offering NFTs to donors as rewards.\n\nCoinbase – a cryptocurrency exchange platform – launched an app integration in\nSeptember, where users could see the positions on crypto that the politicians\nin their area have taken and how to register to vote; the platform hopes to\nfacilitate crypto donations for pro-crypto candidates.  \n  \nCoinbase’s new political integration into its app\n\n## Conclusion\n\nIn less than a generation, American voters have witnessed the novelty of\ncampaign sites on the web, a president of the United States being lauded for\nhis use of technology, and a president being kicked off technology platforms\nfor allegedly inciting violence. Much of this occurred in just the past 10\nyears.\n\nIt’ has been a dizzying ride. Although the introduction of technology\ninitially brought optimism about its potential to increase political\nparticipation, we are still in the middle of figuring out how to mitigate the\nreal harms that technology can inflict upon democracy. Although tech\nregulation at the federal level in the United States has been elusive, some\nstate governments as well as many overseas – including in Europe – have passed\nlegislation designed to rein in tech companies. Whether that legislation will\nbe impactful–or well targeted without significant unintended consequences– is\nyet to be seen.\n\nRegardless of regulation, the companies still face questions about what they\nare doing on their platforms to protect the integrity of not just elections\nbut also democracy as a whole. They continue to roll out policies, products,\nand initiatives meant to help people access accurate information about how to\nvote as well as prevent bad actors from exploiting the platforms.\n\nAs soon as the 2022 U.S. midterms conclude, the focus will land on whether\nMeta will allow Donald Trump back on the platform in January 2023. Candidates\nfor the 2024 presidential election will start announcing their campaigns and\ncontinue to use these platforms to reach voters. In 2023, people will go to\nthe polls in countries like Nigeria, Turkey, and Argentina. In 2024, there\nwill be a tsunami of elections never before seen in the world. For the first\ntime ever during the same year, people will not only participate in a U.S.\npresidential election but will also go to the polls in India, Indonesia,\nUkraine, Taiwan, Mexico, the United Kingdom, and the European Union. This will\nbe an unprecedented number of elections to protect online and offline – the\nsuccess of which could alter the geopolitical order.\n\nThis is a living history, and we will continue to update this brief history as\nwe make our way through crucial moments. In the meantime, we will continuously\nupdate our database as new efforts are announced or older reports are\ndiscovered. If you have anything to add, please reach out to either Katie\nHarbath at kharbath@bipartisanpolicy.org or Collier Fernekes at\ncfernekes@bipartisanpolicy.org.\n\n**Additional Resources**\n\nTech and Elections History Database\n\nPinterest Boards (with images from tech and elections)\n\n  * 2004 \n\n  * 2005: No pins yet for this year. \n  * 2006 \n  * 2007 \n  * 2008 \n  * 2009 \n  * 2010 \n  * 2011  \n  * 2012 \n  * 2013 \n  * 2014 \n  * 2015 \n  * 2016 \n  * 2017 \n  * 2018 \n  * 2019 \n  * 2020 \n  * 2021 \n  * 2022 \n\n**Acknowledgments**  \nWe want to thank numerous people who have helped to put together the database\nof links as well as write this report. John Hill did the first pass at finding\nthe links and helped to provide us with a very solid foundation on which to\nkeep building. Lia Joseph, Oliver Hyman-Metzger, Elise Scott, Alejandro\nMarquez, Chyna Bottoms, Devashri Khadke, and Pamela Larkin of the Bipartisan\nPolicy Center were crucial for helping to find data, and to edit the report\nand coordinate its compilation. A big thanks also to the leadership of the\nBipartisan Policy Center, including Matthew Weil, Lisel Loy, and Jason Grumet.\nSagnik Ghosh of the Integrity Institute helped with some of the initial data\nvisualizations and other members of the Institute – including co-founders Jeff\nAllen and Sahar Massachi – helped with edits and comments.\n\n##### Share\n\n###### Read Next\n\n  * Election Officials Worry Court Case Puts Critical Partnerships At Risk \n  * A Look at the Political Policies of AI Tools \n  * History of the Cambridge Analytica Controversy \n\n###### Downloads and Resources\n\nDownload the Report\n\n#### Support Research Like This\n\nWith your support, BPC can continue to fund important research like this by\ncombining the best ideas from both parties to promote health, security, and\nopportunity for all Americans.\n\nGive Now\n\n### Related Articles\n\n  * Blog Post\n  * 5 months ago \n\n####  Election Officials Worry Court Case Puts Critical Partnerships At Risk\n\n  * Blog Post\n  * 6 months ago \n\n####  A Look at the Political Policies of AI Tools\n\n  * Blog Post\n  * 9 months ago \n\n####  History of the Cambridge Analytica Controversy\n\n##### Tags\n\n  * Digital Democracy \n\nCurrently Reading A Brief History of Tech and Elections: A 26-Year Journey\nSubscribe Share\n\n#### Connect With BPC\n\n  *   *   *   *   * \n\n#### BPC Policy Areas\n\n  * Business \n  * Campus Free Expression \n  * Child Welfare \n  * Democracy \n  * Digital Democracy \n  * Early Childhood \n  * Economy \n  * Elections \n  * Energy \n  * Health \n  * Higher Education \n  * Housing \n  * Immigration \n  * Infrastructure \n  * Technology \n\n#### About BPC\n\n  * About Us \n  * Contact Us \n  * Media Center \n  * Team \n  * Events \n  * Careers \n\n#### Our Location\n\n1225 Eye Street, NW Suite 1000  \nWashington, DC 20005\n\n#### Contact\n\n  * 202 - 204 - 2400 \n  * bipartisaninfo@bipartisanpolicy.org \n\n© 2024 Bipartisan Policy Center All Rights Reserved\n\nPrivacy\n\n",
    "links": "[{\"link\": \"https://bipartisanpolicy.org/\", \"text\": \"\"}, {\"link\": \"https://bipartisanpolicy.org/policy-area/business/\", \"text\": \"\"}, {\"link\": \"https://bipartisanpolicy.org/policy-area/campus-free-expression/\", \"text\": \"\"}, {\"link\": \"https://bipartisanpolicy.org/policy-area/child-welfare/\", \"text\": \"\"}, {\"link\": \"https://bipartisanpolicy.org/policy-area/democracy/\", \"text\": \"\"}, {\"link\": \"https://bipartisanpolicy.org/policy-area/digital-democracy/\", \"text\": \"\"}, {\"link\": \"https://bipartisanpolicy.org/policy-area/early-childhood/\", \"text\": \"\"}, {\"link\": \"https://bipartisanpolicy.org/policy-area/economy/\", \"text\": \"\"}, {\"link\": \"https://bipartisanpolicy.org/policy-area/elections/\", \"text\": \"\"}, {\"link\": \"https://bipartisanpolicy.org/policy-area/energy/\", \"text\": \"\"}, {\"link\": \"https://bipartisanpolicy.org/policy-area/health/\", \"text\": \"\"}, {\"link\": \"https://bipartisanpolicy.org/policy-area/higher-education/\", \"text\": \"\"}, {\"link\": \"https://bipartisanpolicy.org/policy-area/housing-terwilliger/\", \"text\": \"\"}, {\"link\": \"https://bipartisanpolicy.org/policy-area/immigration/\", \"text\": \"\"}, {\"link\": \"https://bipartisanpolicy.org/policy-area/infrastructure/\", \"text\": \"\"}, {\"link\": \"https://bipartisanpolicy.org/policy-area/technology/\", \"text\": \"\"}, {\"link\": \"https://bipartisanpolicy.org/all-content/\", \"text\": \"\"}, {\"link\": \"https://bipartisanpolicy.org/all-content/?recent=30\", \"text\": \"\"}, {\"link\": \"https://bipartisanpolicy.org/all-content/?type%5B%5D=Report\", \"text\": \"\"}, {\"link\": \"https://bipartisanpolicy.org/all-content/?type%5B%5D=Project\", \"text\": \"\"}, {\"link\": \"https://bipartisanpolicy.org/all-content/?type%5B%5D=Explainer\", \"text\": \"\"}, {\"link\": \"https://bipartisanpolicy.org/all-content/?type%5B%5D=Blog+Post\", \"text\": \"\"}, {\"link\": \"https://bipartisanpolicy.org/all-content/?type%5B%5D=Press+Release\", \"text\": \"\"}, {\"link\": \"https://bipartisanpolicy.org/all-content/?type%5B%5D=Podcast+Episode\", \"text\": \"\"}, {\"link\": \"https://bipartisanpolicy.org/events/\", \"text\": \"\"}, {\"link\": \"https://bipartisanpolicy.org/all-content?type[]=Event&dates=2010-01-01+to+2024-01-11\", \"text\": \"\"}, {\"link\": \"https://bipartisanpolicy.org/subscribe/\", \"text\": \"\"}, {\"link\": \"https://bipartisanpolicy.org/events/\", \"text\": \"\"}, {\"link\": \"https://bipartisanpolicy.org/internships/\", \"text\": \"\"}, {\"link\": \"https://bipartisanpolicy.org/about/\", \"text\": \"\"}, {\"link\": \"https://bipartisanpolicy.org/contact/\", \"text\": \"\"}, {\"link\": \"https://bipartisanpolicy.org/media-center/\", \"text\": \"\"}, {\"link\": \"https://bipartisanpolicy.org/team/\", \"text\": \"\"}, {\"link\": \"https://bipartisanpolicy.org/donate\", \"text\": \"\"}, {\"link\": \"https://bipartisanpolicy.org/policy-area/business/\", \"text\": \"\\nBusiness\\n\"}, {\"link\": \"https://bipartisanpolicy.org/policy-area/campus-free-expression/\", \"text\": \"\\nCampus Free Expression\\n\"}, {\"link\": \"https://bipartisanpolicy.org/policy-area/child-welfare/\", \"text\": \"\\nChild Welfare\\n\"}, {\"link\": \"https://bipartisanpolicy.org/policy-area/democracy/\", \"text\": \"\\nDemocracy\\n\"}, {\"link\": \"https://bipartisanpolicy.org/policy-area/digital-democracy/\", \"text\": \"\\nDigital Democracy\\n\"}, {\"link\": \"https://bipartisanpolicy.org/policy-area/early-childhood/\", \"text\": \"\\nEarly Childhood\\n\"}, {\"link\": \"https://bipartisanpolicy.org/policy-area/economy/\", \"text\": \"\\nEconomy\\n\"}, {\"link\": \"https://bipartisanpolicy.org/policy-area/elections/\", \"text\": \"\\nElections\\n\"}, {\"link\": \"https://bipartisanpolicy.org/policy-area/energy/\", \"text\": \"\\nEnergy\\n\"}, {\"link\": \"https://bipartisanpolicy.org/policy-area/health/\", \"text\": \"\\nHealth\\n\"}, {\"link\": \"https://bipartisanpolicy.org/policy-area/higher-education/\", \"text\": \"\\nHigher Education\\n\"}, {\"link\": \"https://bipartisanpolicy.org/policy-area/housing-terwilliger/\", \"text\": \"\\nHousing\\n\"}, {\"link\": \"https://bipartisanpolicy.org/policy-area/immigration/\", \"text\": \"\\nImmigration\\n\"}, {\"link\": \"https://bipartisanpolicy.org/policy-area/infrastructure/\", \"text\": \"\\nInfrastructure\\n\"}, {\"link\": \"https://bipartisanpolicy.org/policy-area/technology/\", \"text\": \"\\nTechnology\\n\"}, {\"link\": \"https://bipartisanpolicy.org/all-content/\", \"text\": \"\\nAll Resources\\n\"}, {\"link\": \"https://bipartisanpolicy.org/all-content/?recent=30\", \"text\": \"\\nNew & Updated\\n\"}, {\"link\": \"https://bipartisanpolicy.org/all-content/?type%5B%5D=Report\", \"text\": \"\\nAll Reports\\n\"}, {\"link\": \"https://bipartisanpolicy.org/all-content/?type%5B%5D=Project\", \"text\": \"\\nAll Projects\\n\"}, {\"link\": \"https://bipartisanpolicy.org/all-content/?type%5B%5D=Explainer\", \"text\": \"\\nAll Explainers\\n\"}, {\"link\": \"https://bipartisanpolicy.org/all-content/?type%5B%5D=Blog+Post\", \"text\": \"\\nAll Blog Posts\\n\"}, {\"link\": \"https://bipartisanpolicy.org/all-content/?type%5B%5D=Press+Release\", \"text\": \"\\nAll Press Releases\\n\"}, {\"link\": \"https://bipartisanpolicy.org/all-content/?type%5B%5D=Podcast+Episode\", \"text\": \"\\nAll Podcasts\\n\"}, {\"link\": \"https://bipartisanpolicy.org/events/\", \"text\": \"\\nAll Upcoming Events\\n\"}, {\"link\": \"https://bipartisanpolicy.org/all-content?type[]=Event&dates=2010-01-01+to+2024-01-11\", \"text\": \"\\nAll Past Events\\n\"}, {\"link\": \"https://bipartisanpolicy.org/subscribe/\", \"text\": \"\\nBPC Newsletter\\n\"}, {\"link\": \"https://bipartisanpolicy.org/events/\", \"text\": \"\\nAttend an Event\\n\"}, {\"link\": \"https://bipartisanpolicy.org/internships/\", \"text\": \"\\nInternships\\n\"}, {\"link\": \"https://bipartisanpolicy.org/about/\", \"text\": \"\\nAbout Us\\n\"}, {\"link\": \"https://bipartisanpolicy.org/contact/\", \"text\": \"\\nContact Us\\n\"}, {\"link\": \"https://bipartisanpolicy.org/media-center/\", \"text\": \"\\nMedia Center\\n\"}, {\"link\": \"https://bipartisanpolicy.org/team/\", \"text\": \"\\nOur Team\\n\"}, {\"link\": \"https://bipartisanpolicy.org/give\", \"text\": \"\\nGive\\n\"}, {\"link\": \"https://bipartisanpolicy.org/subscribe\", \"text\": \"Subscribe\"}, {\"link\": \"https://bipartisanpolicy.org/policy-area/business/\", \"text\": \"\\nBusiness\\n\"}, {\"link\": \"https://bipartisanpolicy.org/policy-area/campus-free-expression/\", \"text\": \"\\nCampus Free Expression\\n\"}, {\"link\": \"https://bipartisanpolicy.org/policy-area/child-welfare/\", \"text\": \"\\nChild Welfare\\n\"}, {\"link\": \"https://bipartisanpolicy.org/policy-area/democracy/\", \"text\": \"\\nDemocracy\\n\"}, {\"link\": \"https://bipartisanpolicy.org/policy-area/digital-democracy/\", \"text\": \"\\nDigital Democracy\\n\"}, {\"link\": \"https://bipartisanpolicy.org/policy-area/early-childhood/\", \"text\": \"\\nEarly Childhood\\n\"}, {\"link\": \"https://bipartisanpolicy.org/policy-area/economy/\", \"text\": \"\\nEconomy\\n\"}, {\"link\": \"https://bipartisanpolicy.org/policy-area/elections/\", \"text\": \"\\nElections\\n\"}, {\"link\": \"https://bipartisanpolicy.org/policy-area/energy/\", \"text\": \"\\nEnergy\\n\"}, {\"link\": \"https://bipartisanpolicy.org/policy-area/health/\", \"text\": \"\\nHealth\\n\"}, {\"link\": \"https://bipartisanpolicy.org/policy-area/higher-education/\", \"text\": \"\\nHigher Education\\n\"}, {\"link\": \"https://bipartisanpolicy.org/policy-area/housing-terwilliger/\", \"text\": \"\\nHousing\\n\"}, {\"link\": \"https://bipartisanpolicy.org/policy-area/immigration/\", \"text\": \"\\nImmigration\\n\"}, {\"link\": \"https://bipartisanpolicy.org/policy-area/infrastructure/\", \"text\": \"\\nInfrastructure\\n\"}, {\"link\": \"https://bipartisanpolicy.org/policy-area/technology/\", \"text\": \"\\nTechnology\\n\"}, {\"link\": \"https://bipartisanpolicy.org/about/\", \"text\": \"\\nAbout Us\\n\"}, {\"link\": \"https://bipartisanpolicy.org/contact/\", \"text\": \"\\nContact Us\\n\"}, {\"link\": \"https://bipartisanpolicy.org/media-center/\", \"text\": \"\\nMedia Center\\n\"}, {\"link\": \"https://bipartisanpolicy.org/team/\", \"text\": \"\\nTeam\\n\"}, {\"link\": \"https://bipartisanpolicy.org/events/\", \"text\": \"\\nEvents\\n\"}, {\"link\": \"https://bipartisanpolicy.org/privacy-policy/\", \"text\": \"Privacy\"}]",
    "priceAndPlans": "Error: Timeout 30000ms exceeded. =========================== logs\n=========================== navigating to\n\"http://web.archive.org/web/20240111104953/https://bipartisanpolicy.org/\",\nwaiting until \"load\"\n============================================================\n\n"
}