{
    "summary": "Skip to content\n\nHarvard Law School shield\n\nHarvard Law School\n\nBernard Koteen Office of Public Interest Advising\n\nGuide to Working on Political Campaigns\n\nOpen menu\n\n## Main Menu\n\nClose menu\n\nSearch\n\n  * Admissions & Aid\n\n    * J.D. Admissions\n    * J.D. Student Financial Services\n    * Graduate Admissions & Aid\n\n#### Resources\n\n    * Why HLS\n    * Apply to the J.D. Program\n    * J.D. Admissions Blog\n    * Apply to the Graduate Program\n    * The Need-Based Aid Philosophy\n\n  * Academics\n\n    * Academics Overview\n    * Areas of Interest\n    * Degree Programs\n    * Curriculum\n    * Writing at HLS\n    * International Legal Studies & Opportunities\n    * Winter Term\n    * Fellowships and Prizes\n\n#### Resources\n\n    * Academic Calendar\n    * Course Catalog\n    * Handbook of Academic Policies\n    * Syllabi, Exam and Course Evaluation Archive\n    * HELIOS\n    * Office of the Registrar\n    * Office of Academic Affairs\n\n  * Clinics & Experiential Learning\n\n    * Clinical Programs\n    * Experiential Learning\n    * Pro Bono Program and SPOs\n    * Registering for Clinics\n    * Policies and FAQs\n    * Clinical Travel Funding\n\n#### Resources\n\n    * Clinical Staff Resource Center\n    * I'm Looking for Legal Support\n    * Advising\n    * Student Stories\n\n  * Faculty & Research\n\n    * Faculty Directory\n    * Faculty Bibliography\n    * Research Programs\n\n#### Resources\n\n    * For Faculty\n    * Media Relations\n\n  * Student Life\n\n    * Student Life\n    * Student Organizations\n    * Student Journals\n    * Health & Wellness (The Well)\n    * Academic Advising & Mentorship\n    * Student Support\n    * Inclusion & Belonging\n    * Living in Cambridge\n    * HLS Housing\n\n#### Resources\n\n    * Accessibility Services\n    * Student Services Offices\n    * Administrative Updates (AdUp)\n    * Amicus\n\n  * Career Planning\n\n    * Career Planning at HLS\n    * 1L Career Advising\n    * Private Sector Career Services\n    * Public Interest Career Services\n    * Clerkships\n    * Law Teaching\n    * Bar Exam\n\n#### Resources\n\n    * Private Sector Jobs\n    * Public Sector Jobs\n    * For Employers: Career Resources\n    * Recent Employment Data\n\n  * Professional & Lifelong Learning\n\n    * Professional & Lifelong Learning\n    * Executive Education\n    * Program on Negotiation\n    * Online Courses and Casebooks\n    * Pre-law Programs\n\n  * Library\n\n    * HLS Library\n    * Research Services\n    * Use the Library\n    * Historical & Special Collections\n    * About the Library\n    * Faculty Services\n\n#### Resources\n\n    * HOLLIS Catalog\n    * Guides & Videos\n    * Legal Databases\n    * Library Staff Directory\n\n  * Alumni\n\n    * HLS Alumni\n    * Giving to HLS\n    * Reunions\n    * Harvard Law School Association\n    * Alumni Events\n    * Networking & Careers\n    * Alumni News & Profiles\n    * Contact the Alumni Center\n\n#### Resources\n\n    * How to Make Your Gift\n    * HLS Amicus: Alumni Directory\n    * Submit a Class Note\n    * Transcript Requests\n    * SCOTUS Bar Admission\n\n  * News\n\n    * Harvard Law Today News\n    * Harvard Law Bulletin: Current Issue\n    * Harvard Law Bulletin: Archive\n    * Media Relations\n\n#### Resources\n\n    * Sign Up for the Harvard Law Today Newsletter\n    * Sign Up for News@Law\n\n  * Events Calendar\n  * About HLS\n  * Department Directory & Campus Resources\n  * Staff Dashboard\n  * Make a Gift\n\n# Guide to Working on Political Campaigns\n\n**Bernard Koteen Office of Public Interest Advising  \n**4039 Wasserstein Hall (WCC)  \n1585 Massachusetts Avenue  \nCambridge, MA 02138\n\n617-495-3108\n\nopia@law.harvard.edu\n\n## On this page\n\n  * Introduction\n  * On What Type of Campaign Could I Work?\n  * What Is Campaign Work?\n  * The Hiring Process\n  * Getting Involved as a Student\n  * Post-Grad Opportunities\n  * Common Functions on Political Campaigns\n  * Work Involving the Practice of Law\n  * Work Other Than the Practice of Law\n  * Conclusion\n  * Resources\n  * Credits\n\n## On this page\n\n  * Introduction\n  * On What Type of Campaign Could I Work?\n  * What Is Campaign Work?\n  * The Hiring Process\n  * Getting Involved as a Student\n  * Post-Grad Opportunities\n  * Common Functions on Political Campaigns\n  * Work Involving the Practice of Law\n  * Work Other Than the Practice of Law\n  * Conclusion\n  * Resources\n  * Credits\n\n## **Introduction**\n\nPolitical campaigns offer the opportunity to develop and refine a wide\nassortment of skills in an extremely fast-paced and flexible environment.\nMoreover, they give a unique perspective into the electoral process, as well\nas the cares and concerns of elected officials and the American public.\nCampaign work can often lead directly or indirectly to government employment\ndown the road.\n\nCampaign work is certainly not for everyone. There is usually little formal\nmentoring, little structured feedback, little administrative support, and\nlittle free time – and given the finite nature of the campaign cycle, often\nlittle long-term stability. But for those with a passion for political\ncampaigns or for getting a unique perspective on our democratic process,\ngetting involved in one can be an incredibly rewarding and fruitful\nexperience. And as in other career arenas, getting involved in one campaign is\nusually the best way to get involved in others down the road.\n\n## On What Type of Campaign Could I Work?\n\nWhen you think of a campaign, you may first picture the presidential races\nmost highlighted by the media. But there are thousands of campaign experiences\nand opportunities _,  _whether you are committed to a geographical region, a\nspecific candidate, or a certain political party’s platform.\n\nThere are 435 members of the U.S. House of Representatives (not including non-\nvoting delegates from Washington, D.C. or the U.S. territories); 100 U.S.\nSenators; tens of thousands of state legislators, elected state judges,\nmayors, and city councilmembers; and hundreds of state governors, auditors,\nattorneys general, treasurers, and secretaries of state. The vast majority of\nelections to fill these offices feature some form of campaign.\n\nBeyond elected officials, there is also a wide array of issue-oriented ballot\ninitiatives or referenda which generate campaigns of their own, ranging from\nlocal school bonds to national hot-button issues such as abortion.\n\n### How Do I Decide Which Campaign is Right for Me?\n\nDeciding on a campaign means evaluating your own constraints and identifying\nexactly what you want to get out of a political campaign experience, as well\nas thinking about how such an experience would fit into plans for your future.\nYou should ask yourself questions along these lines:\n\n  * What level of responsibility are you seeking?\n\nWith little experience but a high level of motivation and competency, you may\nfind yourself in a relatively senior post on a small campaign – perhaps even\nrunning it. Good campaigns are meritocracies, and you can rise quickly if you\nearn it. However, it can be more challenging to secure a position with a lot\nof responsibility for one of the major parties’ presidential campaigns.\n\n  * Can you get by with limited funding?\n\nLarger campaigns will be more likely to support paid campaign positions,\nthough even they may ask or expect you to work as a volunteer for a while. On\nthe flip side, the biggest campaigns can also rely on a steady flow of\nvolunteers and have less need to bring on non-essential paid staff.\n\n  * How geographically flexible are you? \n\nDo you want to stay close to home or are you willing to relocate?\n\nAre you willing to travel, and if so, how frequently?\n\nDo you prefer to work at campaign headquarters or in the field?\n\n  * How much time do you want to devote to the campaign enterprise? \n\nAny campaign will want to know that you are in it for the long haul before\ngiving you a position of responsibility, but the “long haul” on a local\ncampaign may be just a month or two, while the presidential “long haul” can be\nas many as two years. And there are ways to assist campaigns without working\non them full-time; part time options amount to a distinct and valuable set of\nroles.\n\n  * How sharp are your elbows? \n\nThere may be more competition and jostling for choice spots on a larger\ncampaign, whereas a smaller campaign may experience less turmoil.\nUnfortunately, though, the degree of competition sometimes depends less on the\nsize of the campaign and more on the quirks of an individual campaign\nstructure.\n\n\n\n### How Do I Choose a Candidate?\n\nTip O’Neill is credited with explaining that “all politics is local,” and many\nindividuals find it easier to land a position with a hometown or home-state\ncandidate. Hometown status is no guarantee of a position, however, and many\ncampaign staff work for public officials from thousands of miles away. If\ngeography is a concern for you, you may want to consider where a candidate is\nbased and whether you want to work at their campaign headquarters or occupy a\nmore mobile role, like field organizing or advance work, in a particular\ncampaign state.\n\nThe candidate’s popularity may also be a consideration, as the most popular\ncandidates are also likely to foster the most competitive environments for job\nseeking.  For example, it may be easier to secure a more prominent position\nwith a candidate other than the frontrunner.\n\nDon’t spend too much of your energy trying to guess who will win a campaign.\nGo where there is a candidate for whom you are passionate, and where there are\nopportunities that interest you. It’s also common for party nominees to hire\nstaff from their former competitors’ campaigns after the losing candidates\ndrop out of the primary process, so as you build skills, experience,\nrelationships and reputation, you may be rolled up into a winning campaign. In\nsome cases, it could be more advantageous over the long-term to have a more\nsenior position with a losing candidate and be hired over to the eventual\nnominee’s senior team, than to have a very junior position with the winner. An\nexception to this rule is that some campaigns can turn incredibly nasty, and\nthe winning campaign might not consider hiring anyone from a campaign that\ncast aspersions on their candidate.\n\n### Will Working for a Losing Candidate Impair My Chances for Professional\nOpportunities Down the Road?\n\nThere are usually too many moving parts for success or failure to be\nattributed to one particular individual. As long as you have acquitted\nyourself well and commanded the respect of your supervisors and colleagues,\nthere is little to no stigma attached to working for a losing candidate. In\nterms of your future job search, the experience is much more important than\nthe result. In fact, many prominent lawyers have made valuable connections\nworking on “failed” campaigns.\n\n## What Is Campaign Work?\n\n### Can Someone With a Legal Background Do Legal Work, or Can They Be Used\nEffectively in Other Ways On a Campaign?\n\nIf you mention that you are an attorney when you first present yourself to a\ncampaign, it might be assumed that you want to do legal or policy work. There\nis certainly some legal work that will take advantage of your training on most\ncampaigns. This could include: ensuring ballot access; evaluating election\nlaws to help design absentee and get-out-the-vote strategies; surveying\ncommunications for compliance with various legal requirements; processing\ncontributions and structuring fundraising events; reviewing contracts for\npersonnel, field offices, equipment, and data; and helping to prepare\nreporting documents for submission to federal and/or state regulatory bodies.\nHowever, keep in mind that most campaigns, especially during primary\nelections, do have attorneys on staff who take on the various legal issues\nthat might arise.\n\nPolicy jobs are often among the most sought after in a campaign. That being\nsaid, you don’t have to limit yourself to jobs with “policy” in the title to\ndo policy-related work. Keep in mind that many forms of campaign\nwork—including field organizing work such as canvassing, where you engage with\nthe public to explain your candidate’s goals and ideas—include policy work and\ntraining as a part of messaging and voter engagement.\n\nIt is important to note that most attorneys do not necessarily do legal or\npolicy work on campaigns. They work in virtually every capacity, including\nthose that do not require legal skills.  Lawyers have been fundraisers,\npolitical desk representatives, speechwriters, constituent liaisons,\nschedulers, advance team leaders, field organizers or field managers,\nvolunteer coordinators, technology managers, spokespersons, communications\nconsultants, media buyers, convention organizers, event planners, and even\ncampaign managers. Detailed descriptions of various campaign functions are\navailable at the end of this guide.\n\nMany of the same skills that contribute to good lawyering—like the ability to\nwork under pressure, synthesize information, and give attention to detail, to\nname just a few—are invaluable on the campaign trail, and many lawyers are\nsufficiently versatile that they are able to pick up wholly unfamiliar skills\nin the fast-paced campaign environment. Keep in mind that there are also\nfrequent opportunities to try out different kinds of jobs across campaigns—you\nare by no means locked into whichever role you may start with.\n\nRemember also that having a law degree or being a law student does not make\nyou more qualified to work on a campaign than someone who has no legal\nexperience. Employers value  _campaign  _experience. Even when the work\ninvolved is quintessentially lawyering, lawyering in the campaign context is\nmore prized than fancy lawyering in another arena. That’s not meant to be\ndiscouragement: you can provide substantial value even without deep campaign\nbackground. If you do not have any campaign experience, show up and be willing\nto work hard at whatever is required.\n\n## The Hiring Process\n\n### How Do I Get Involved, or How Do I Make Connections if I Do Not Already\nHave Them?\n\nAlthough some campaign jobs are posted on online job boards, networking will\nalways be a crucial way to obtain a job in the political field. Even if you\ndon’t have inside connections, these can be surprisingly simple to cultivate.\nMore so than most jobs, a spot on a campaign is rarely secured through the\ncover letter and interview process alone. Instead, someone you know will get\nin touch with someone they know to get the ball rolling. If you do not know\nanyone currently working on a particular campaign, reach out to campaign\nalums; many campaign workers are repeat players, and if a friend has worked on\na campaign before, chances are good that he or she may know someone now\nworking on the campaign that has caught your interest.\n\nUse your college or law school alumni connections. Identify alumni working on\ncampaigns or otherwise affiliated with partisan work ( _i.e._ , groups such as\nthe National Republican Senatorial Committee or Democratic Senatorial Campaign\nCommittee). Also, student groups often have an inside track on the campaigns.\nContact the presidents of the law school GOP or Dems, or the American\nConstitution Society or Federalist Society; they should be able to help you or\nput you in touch with someone who can. If they do not have any contacts, they\ncould refer you to undergraduate partisan groups.\n\nIf you do not have a particular connection, you might simply show up at a\ncampaign office or event, introduce yourself, and ask how you can help. If you\ncan volunteer for a period of time, or are willing to travel, you may be put\nto work after just one visit to the campaign office with resume in hand. Watch\nsocial media, read the newspaper, and be on the lookout for ways to get\ninvolved with a campaign of interest to you.\n\nFew high-profile jobs are parceled out to sudden volunteers, but you might be\nable to parlay a volunteer spot secured early in a campaign’s life cycle into\nsomething with more stability as the campaign gathers steam and takes on more\npeople. Senior campaign staff will look to the people who are already involved\nwith the campaign to take on positions of greater responsibility. If you can\nvolunteer, put in the hours that the staff are putting in; they will respect\nyour commitment and be more likely to consider you as one of their own. (More\ntime = more connections.) But be careful not to act as though you are there\njust to “make connections”. Keep your head down and get your work done. Being\ngood at what you do is one of the best ways to get noticed.\n\nThe second-best solution requires a bit of moxie and a bit of homework: look\nat regulatory disclosure records (the Federal Election Commission [FEC] for\nfederal races, and equivalent state bodies for state races) to find out if a\npartner at a law firm with which you are affiliated was a major donor to a\npast campaign in the same party. Occasionally, major donors may know of\navailable routes to campaign work even if they have not themselves worked\nfull-time on a campaign. Also, research the campaign’s consultant\ndisbursements to identify the outside people and firms involved in the\ncampaign; these consultants can be another avenue to making connections on a\ncampaign.\n\n### Do I Have a Realistic Shot at High-Profile Campaigns if I Do Not Have an\nInside Connection?\n\nThat depends on what you want to do. If you do not have an inside connection,\nyou are not going to be the campaign manager of a presidential campaign, or\neven a highly-placed deputy. But if you do not mind a position that is\nconsidered less glamorous in the campaign world, a high-profile campaign is\nnot out of reach, especially if you start early. Communications and policy\nwork tend to be the most highly sought after, and therefore the first to go to\npeople with inside connections. Other functions—especially field positions\nsuch as organizers, which are often more commonly available—may be more open\nto those without such a connection. Even in presidential campaigns, many\npeople start as volunteers in the primary season.\n\n### To Whom Would I Direct My Application?\n\n_ _ It is not always easy to figure out where to send a campaign application.\nFirst, of course, check the campaign website for job postings, and follow\napplication instructions for any that interest you. If there are no such\npostings, then on a smaller campaign, you might send your application directly\nto the candidate, or to the campaign manager. On a larger campaign, you may be\nable to determine the functional or geographic head of the department you want\nto work for from press reports or from the campaign website. There may be a\ncentral volunteer coordinator tasked with placing campaign volunteers. If you\ncannot determine the appropriate addresses from public sources, simply send\nyour materials to someone whom you know to be affiliated with the campaign,\nand ask that they forward your materials to the appropriate individual.\n\n### What Materials Should Be in a Campaign Packet?\n\nIf you are submitting your application cold, you should prepare a resume,\nemphasizing any political or campaign experience, and a succinct cover letter.\nThis may be a different resume than you would have for other legal jobs; if\nyou’ve had two or three campaign- or policy-related experiences, consider\nhighlighting them in a separate section near the top.  In your cover letter,\nyou should state as clearly as possible what you would like to do on the\ncampaign and how flexible you are willing to be. Keep in mind, as mentioned\nabove, that there are not many policy or communications jobs on a campaign,\nespecially for someone with no close connections.  The most numerous and\navailable jobs are often in the field—field organizers or field managers—so\nincluding a willingness to do this could help.\n\nOften, campaign personnel are too overburdened to give much thought to placing\nnew hires or volunteers, and may sit on an application simply because they do\nnot have time to think of an appropriate placement. To the extent that your\ncover letter can save them the mental effort, it will be processed more\nquickly.  **Do not get so busy boasting about experience and qualifications in\nyour cover letter that you fail to explicitly mention the candidate and your\nsupport of them.**\n\nAlong the same lines, demonstrating your own competence will often speak\nlouder than a resume. If you want to do a particular type of work that\nrequires written output (briefing papers, policy papers, talking points,\nspeechwriting), include an example of what you would produce for the campaign:\nnot a generic writing sample, but something tailored for your position in your\nchosen campaign. The bigger the campaign, the more useful this approach will\nbe. If you are living in Minneapolis and want to work on the gubernatorial\nrace (or any other state or local race), writing out a stump speech is not\ngoing to be as effective as going down to a campaign office and introducing\nyourself.  However, if you are from Cedar Rapids and write up a precinct-by-\nprecinct field plan backed with data for a presidential front-runner, they\njust may get back to you.\n\n### Am I Going to Be Paid?\n\nMaybe. Especially if you have had similar campaign experience before, you may\nbe hired for a particular spot at a particular salary. If not, you may be\nexpected to work as a volunteer first, especially if the campaign is just\ngetting its fundraising operation started.\n\nMost paid positions are paid weekly, and except for experienced and high-\nprofile senior operatives, the compensation will be fairly meager. Depending\non the structure of the campaign and your particular role, you may also be\nhired as an independent consultant, without medical insurance or other\nbenefits.  **Few people take entry-level campaign positions for the immediate\nmonetary rewards.**  Most realize that working for free will provide them with\nconnections that will pay off later in their career, especially if they have\npolitical aspirations or aspirations in political law.\n\nSome campaigns provide different forms of support for their volunteers, which\ncan cut down your living costs. You may not have to pay rent if you can\narrange campaign housing with supporters. Additionally, depending on your\nrole, you might have access to a campaign vehicle. And certain jobs, such as\nadvance work, will cover traveling expenses.\n\n## Getting Involved as a Student\n\n### Is Full-Time Work for a Candidate the Only Way to Get Involved?\n\n_ _ There are many ways to get involved with a campaign without giving up your\nday job or taking a leave from school. (Important note: some government or\nnonprofit “day jobs” may limit the extent to which employees can be involved\nwith campaigns. Make sure you check on your legal limitations or ethical\nobligations before signing up for a campaign). For example, you might help a\ncampaign with fundraising, after-work voter outreach through phone banking,\nweekend canvassing, or get-out-the-vote operations closer to Election Day. You\ncould also take on election protection work part-time, or for a limited pre-\nelection period (election protection ensures that eligible voters are readily\nable to cast ballots that count).\n\nSince every day on a campaign can feel like a fire drill, staffs often\nappreciate someone outside the office who can do long-term research (often\nopposition or legal research).  “Long-term” in this context can mean days or\n(sometimes) weeks, not months. In order to succeed in such a role, you must be\ngood with self-managed work and timelines.\n\nThere are also campaign jobs that do not involve dedicating yourself to only\none candidate. You could work for one of the umbrella party organizations,\nlike the Democratic National Committee or Republican National Committee, or\nfor one of the blanket campaign organizations, like the National Republican\nCongressional Committee (NRCC) or Democratic Congressional Campaign Committee\n(DCCC, often referred to as the “D-triple-C” or “D-trip”).  You could work for\nan independent political entity, like the political fund of a union or trade\norganization or issue-oriented nonprofit, or for a PAC or SuperPAC or other\n“527” organization (like Progress for America or The Club for Growth). You\ncould work for a campaign vendor that services multiple candidates, or for a\nlaw firm with an election law or campaign practice, or a nonprofit that works\non electoral issues from a nonpartisan perspective. Working with such\norganizations can help enrich your understanding of party structures and the\nissues at the center of a given campaign.\n\n### I Do Not Want to Work in Politics, But I Feel Strongly About This\nCandidate. If I Spend a Summer Working on Their Campaign, Will I Jeopardize my\nChances of Finding Post-Grad Employment by “Wasting” a Summer?\n\n_ _ This move can be a bit risky (though see the note about leaves of absence\nbelow: the calculations are different for a “gap semester” than for a summer\non the normal track). The wisdom of such a choice will depend on many factors,\nincluding what you would be doing for the campaign, with whom you would be\nworking, what other job experience you have, and what your post-graduate goals\nare. HLS students should talk to a career counselor in the OPIA office before\ncommitting to this route. Another important note is that campaign work may not\nqualify for HLS’ Summer Public Interest Funding (SPIF); see discussion below.\n\n### If I Can Only Work in the Summer, How Can I Maintain My Contacts So That\nif the Candidate is Elected, I Could Have the Chance to Work for Them Post-\nGrad?\n\nThe best way to maintain your contacts is to continue working for the\ncandidate in a limited capacity up through the election. Students have\nvolunteered their time to canvass, make persuasion calls to voters, organize\ntheir school or local geographic community, organize fundraisers in the area,\nspread the word about local events, write letters to the editors of local\npapers, help produce drafts of policy papers, and dedicate election day to\ngetting-out-the-vote. Especially if you have become a valued employee or\nvolunteer over the summer, the campaign will be eager to have the (likely\nunpaid) extra help through the remainder of the year.\n\nEven if you are not able to continue working with the candidate, however, do\nnot assume that you will be shut out of a job further down the road. If your\ngoal is to work for a candidate post-election, let the campaign manager know\nwhen you head back to school.  It is true that non-civil service government\npositions are often filled on a first-come, first-serve basis from the ranks\nof the campaign staff, but trusted summer employees may also be in the mix. If\nyou are in the position to later apply for a position on an elected official’s\nstaff, simply note your campaign experience – along with the specific role\nthat you played on the campaign – in the cover letter.\n\n### Would a Campaign Accept My Help Exclusively During the Winter Term?\n\nYes, but do not expect the work to be either glamorous or paid. Short-term\nvolunteers generally spend their time in jobs such as: administrative\nprocessing; responding to campaign mail and email; and, especially in January,\ncontacting constituents in early primary states, either in person or by phone.\nDuring January of a presidential election year, presidential campaigns need\nvolunteers to travel to Iowa, New Hampshire, Nevada, or South Carolina to\nknock on doors or do advance work. Unless you happen to be a credentialed and\nestablished expert in a particular subject area, it will ordinarily not be\nworth a campaign’s energy to develop the trust needed for in-depth policy work\nif you are only going to be around for a month. That said, particularly if you\nhave little other campaign experience, these sorts of short-term volunteer\nstints are excellent first steps for positions with more responsibility later\nin your career.\n\n### How Could I Work for a Candidate During the Academic Year?\n\nSee the answer on summer work above: many tasks performed during the academic\nyear are similar to summer tasks, but happen on a smaller scale. Examples\ninclude doing voter outreach through phone calls or canvassing, organizing\nhouse parties, reaching out to political organizations across campus, and\nresearching narrow issues. You can also join local City, Town, or Ward Party\nCommittees for the various political parties.\n\nYou can also help to maintain a candidate’s web presence, either by blogging\nofficially or unofficially for the candidate, or by maintaining or bolstering\nsupporter websites. Or you could start or run a local political organization.\nFor example, one of our HLS advisors started Republicans International with a\nfew partners abroad to help overseas U.S. citizens with voter registration and\nabsentee ballots.\n\nAnd again, in presidential campaign years, Cambridge-based supporters are\nalways needed to head up to New Hampshire during the academic fall to make\ncontact with potential voters.\n\n### Does Summer Campaign Work Qualify for HLS Summer Public Interest Funding\n(SPIF)?\n\nCampaign work is typically not eligible for HLS Summer Public Interest Funding\n(SPIF), as SPIF is a legal training program, for which campaign work does not\nqualify. Positions which are law related will be considered on a case by case\nbasis by the SPIF Committee. If a student would like their position reviewed\nthey should email a job description to spif@law.harvard.edu.\n\n### Does Summer or Term-Time Campaign Work Qualify for Clinical Credit?\n\nCampaign work cannot be done for clinical credit. Further questions on\nclinical credit can be directed to the Office of Clinical and Pro Bono\nprograms at HLS.\n\n### Should I Ever Take a Leave of Absence From Law School to Work on a\nCampaign?\n\nOne of the greatest luxuries of being a student is the ability to press\n“pause” in your education and take advantage of some experiences that you can\nonly afford to do at this stage of your life. This is the kind of opportunity\nthat may rarely come around when you are already working full-time and settled\ninto a rhythm with family and friends.\n\nIf campaign work is something you are truly interested in and passionate\nabout, taking a gap semester could be a great way to get involved at a level\nthat otherwise might not be possible during the academic year. Before taking a\ngap semester, take some time to consider your personal, professional, and\nfinancial situation, as well as the possibilities that are available to you.\nAs always, OPIA advisors are here to help you.\n\n### Are There Other Ways to Do Campaign-Related Work as a Student?\n\nWorking on a campaign, or with political organizations, is a unique\nexperience.  But as mentioned above, there may also be ways to engage in\npolitical law or election law as a student, beyond a campaign.  In each state,\nthere are a few law firms (or political law groups at firms) that will serve\nofficeholders, candidates, and partisan organizations with ballot access and\ncampaign finance compliance; there are also a few firms that do the same\nnationally.  And there are some nonpartisan nonprofits that work on voters’\naccess to the electoral process.  These entities may offer internships or\nexternships; competition for such positions is substantial, particularly\nduring a presidential election year.\n\n## Post-Grad Opportunities\n\n### Does Campaign Work Qualify for the Low Income Protection Plan (LIPP)?\n\nCampaign work is considered eligible employment for LIPP as long as it is at\nleast part-time (17.5 hours/week minimum) and compensated at a rate of at\nleast minimum wage. However, LIPP does not cover people who are running for\noffice because candidates are not compensated for their time.\n\n### What Kind of Position Could a New Law School Graduate Expect to Have on a\nCampaign?\n\nThe answer will depend greatly on the size of the campaign and on your\nprevious experience. A law degree on its own does not make anyone qualified to\nwork as a senior strategist or policy advisor. On a national campaign, the bad\nnews is that you can expect to start at the bottom. The good news is that\ntalent is often rewarded quickly and there is room for advancement. New law\nschool graduates have filled many campaign positions not associated with the\npractice of law.\n\nIf you want to work for a campaign in a legal capacity, of course, you will\nhave to ensure that you are appropriately licensed to do so. Although a recent\nlaw graduate will not usually be the final arbiter of legal issues on a\ncampaign, it is not at all unusual for recent graduates to do the preliminary\nlegal work, submitting more difficult questions to senior lawyers either\nemployed directly by the campaign or serving the campaign as outside counsel.\n\n### What Will Taking a Year to Work on a Campaign After Law School Do to/for a\nNew Graduate’s Ability to Get a Job Down the Road?\n\nCampaign work – even campaign work that does not involve the practice of law –\nhelps to develop not only an individual attorney’s skills, but also their\ncontacts in government service. Many campaign staffers go on to work in\ngovernment after the campaign season, some in high-profile political\nappointments. A year of campaign work will thus put you in touch with many\nindividuals who could further a job search related to the public sphere,\nwhether on Capitol Hill or in the State House, or in private sector positions\nthat focus on government-related work. Campaign work is certainly no guarantee\nthat you will be swept into the corridors of power if your candidate is\nsuccessful, and you shouldn’t stake your involvement in a political campaign\non the likelihood of securing a job afterwards, but it can help to ensure that\ndoors open quicker and wider, in a variety of settings:\n\n  * _On Capitol Hill or in the Administration:_ If you work for a winning Congressional or Senate campaign, you could secure a job with the newly elected Representative or Senator for whom you worked, particularly if your candidate is new to Congress. However, a re-elected incumbent will have both a campaign staff and a preexisting Washington staff; the entire campaign staff will not go to Washington. Also, if you worked on a presidential or other federal race, other elected representatives on Capitol Hill likely backed your candidate, and this may be a boost to a job application in their offices — or in a political role in a federal agency in an Administration of the same party. Even if your candidate loses, you may still have success applying to officials who backed your former employer’s candidacy.  Finally, if your end goal is to work on the Hill, you might consider interning on the Hill in lieu of working for a campaign, since Capitol Hill values prior Hill experience, even if unpaid.\n  *  _In the private sector:  _Most firms (especially in D.C.) are filled with Republicans and Democrats alike. Firms are going to care most about the narrative for “why private practice” and your overall credentials rather than the fact that you worked for a particular candidate, though firms with political law or government relations practices may well welcome campaign experience (for any candidate) as an added bonus. Importantly, campaign work also develops a set of skills that are highly valued in the private sector in many different practice areas. Your resume and cover letter should speak to your ability to manage projects, work under pressure, get results, be a team player, and interact with a diverse group of people.\n  *  _For Nonprofits:  _Nonprofits will value many of the same skills as the private sector. Nonprofits also appreciate a specialized skill set. If you worked in the policy shop of a campaign, you will have impressive work product to refer to in interviews with an issue-oriented nonprofit.\n\n### If I’m Already Employed, How Do I Talk To My Firm About a Leave?\n\nThere are no set rules for asking leave from a firm to work on a campaign.\nWhether or not to grant such a leave, and under what conditions to do so, is\nwithin the firm’s discretion and its decision will depend on a number of\nfactors, which may include how long the associate has been with the firm,\nwhether the firm would be unhappy to lose that person, and how big an impact\nthe associate’s leave would have on their practice group.\n\n## Common Functions on Political Campaigns\n\nBefore you approach a campaign to ask about a position, you should give\nserious thought both to the type of position you would optimally prefer, and\nto the types of positions you would be willing to take. Campaign workers\nusually begin with field, advance, or fundraising work, and later “graduate”\nto doing policy or political work–but the hierarchy is not rigid, and\ndepending on your particular connections, it may be possible to enter the\ncampaign process at a different point.\n\nThe lists below are arranged alphabetically, rather than in hierarchical\norder, as the relative hierarchy may depend entirely on the nature of a\nparticular campaign. Finally, depending on the size of the campaign, several\nof these functions may be unnecessary, or handled by a single person.\n\n## Work Involving the Practice of Law\n\n  * Ballot Access \n\nBallot access laws are often cumbersome and esoteric, with fees and/or\nsignature requirements from certain populations, all with their own deadlines.\nLawyers have to review these requirements to ensure that a candidate or ballot\nmeasure is able to get on the ballot.\n\n  * Communications Compliance \n\nCampaign finance law places certain restrictions on campaign communications.\nLawyers have to ensure that the communications comply with the statutory and\nregulatory requirements.\n\n  * Election Administration \n\nEach jurisdiction will have its own idiosyncrasies in terms of voter\nregistration, absentee ballot, early vote, vote by mail and poll site\nregulations.  Parsing these requirements is necessary to inform a campaign’s\nregistration and/or get-out-the-vote (GOTV) strategy and resource allocation.\nThese same laws can also form the basis of an election protection effort, to\nensure that eligible voters are able to cast an effective vote.\n\n  * Fundraising Compliance \n\nCampaign finance laws also restrict the sources of funds and require\ndisclosure of some donations and expenses. Lawyers ensure compliance by\nreviewing checks coming in the door and reports going out.\n\n  * Transactional Review \n\nCampaigns are essentially mini-nonprofit businesses, ramping up and shutting\ndown with extraordinary speed. As in the case of any business, a campaign\norganization must be formed and organized in compliance with legal\nrequirements. Campaigns will very quickly generate many contracts – including\ncontracts for personnel, field offices, equipment, and data – that should be\nreviewed by an attorney. And campaigns produce legal disputes around\nemployment and torts claims just like any other nonprofit.\n\n## Work Other Than the Practice of Law\n\n  * Advance \n\nBefore a candidate appears in public, an advance team will scout the location,\narrange logistics, and assist in drumming up an appropriate audience. Many\nadvance teams have at least one staff member present during an event to\noversee logistics. Advance work involves lots of travel; you could be on the\nroad twenty days out of the month on a national or statewide campaign.  This\nwork is less sensitive and is more likely to go to campaign novices who\nexhibit independence, self-confidence, imagination, and good judgment.\n\n  * Campaign Management \n\nCampaign managers and their deputies integrate all campaign functions,\nsometimes doing, and sometimes directing traffic. It is ultimately their job\nto make sure that the entire campaign runs as smoothly as possible.\n\n  * Communications \n\nThe communications staff is responsible for public manifestations of the\ncampaign’s message and is a very politically sensitive area. Staff members\nwrite speeches, prepare and place ads (“paid media”), create media events\n(“free media”), and respond to press inquiries. The official campaign\nspokesperson or spokespeople will be members of the communications staff. As\nElection Day nears, communications generally takes on a lot of low-level hires\nto staff war rooms (which consists of watching a lot of television screens in\nshifts 24 hours a day).\n\nSocial media and digital communications management also play an increasingly\nimportant role in political campaigns, and campaigns recruit heavily for\nsocial media directors, digital strategists and digital organizers. Roles in\nthis area may include monitoring candidates’ presence on social media,\ncreating digital content (which can range from graphic design to writing for\nsocial media platforms), overseeing digital strategy and messaging across\ndifferent platforms, coordinating with team members out in the field and at\nHeadquarters, and tracking performance data and analytics. The presence of\nsocial media has turned a 24-hour news cycle into a half-hourly or hourly news\ncycle, and has accelerated the pace of all communications work, online and\nnot.\n\n  * Constituent Liaison\n\nConstituent liaison work involves conducting outreach to the local leadership\nof particular interest-group communities, which are sometimes organized along\nracial or ethnic lines and sometimes along professional or issue lines (e.g.,\n“lawyers for XX”, “environmentalists for XX”). The political sensitivity of\nconstituent liaison work can vary from campaign to campaign, and even within a\ncampaign’s lifespan, but at times it can be quite high.\n\n  * Convention Support \n\nFor major statewide or national campaigns, political parties may celebrate the\nend of the primary process with a formal nominating convention. Often, parties\nor campaigns will have their own team hired specifically to plan and\ncoordinate these conventions. Important functions leading up to the convention\nmay include addressing rules and platform issues and organizing delegate\nselection and support, as well as assisting with the substantial logistics of\nan especially visible gathering quite important to crucial party supporters.\n\n  * Data and Analysis \n\nPolitical campaigns increasingly rely on fast and rigorous iterative data\nanalysis to guide a vast array of campaign activities, including voter\ntargeting, fundraising, and research, to name just a few. Roles in this\ncapacity can include gathering, analyzing and/or modeling data, or preparing\nit for visualization and presentation to a candidate or the public. Campaigns\nwill value previous experience with digital marketing, online campaigns and/or\ncoding. Work in this high-demand area can be a creative way to merge interests\nin technology and politics.\n\n  * Field \n\nField teams contact voters, assemble supporters, and create events in\nparticular geographic regions. They help register voters, deliver campaign\nliterature and other information, call potential voters to inform or persuade,\ntrack information from potential voters on prevailing issues or levels of\nsupport, and above all, are responsible for getting supporters to the polls on\nelection day. In some campaigns, as election day approaches, many workers in\nother areas will get pulled into an “all hands on deck” field effort.\n\n  * Fundraising \n\nFundraisers generate the cash that lets the candidate spread their message,\nwhich often serves independently as a test of the candidate’s credibility.\nFundraising can involve big events, extended web campaigns, small house\nparties, group-based incentives or individual contributions. In any guise, it\nis welcome. Staff tends to consist of very young people, especially at the\nlower rungs.\n\n  * Information Technology \n\nA designated IT staff is critical, especially on a larger campaign. They keep\nthe back office running, manage phone service, and ensure that the campaign’s\ncomputer network functions. More advanced campaigns need staff to tend the\ninfrastructure for volunteer coordination programs or voter contact programs.\n\nCampaign IT staff also perform other crucial tasks, like managing data\nsecurity and ensuring that field offices and other more mobile teams are\nsecurely and properly equipped to perform their tasks. IT supports and works\nclosely with many teams on a campaign, especially operations and data, and\ninteracts with campaign staff to manage help desks and ensure smooth\nonboarding of new hires. Other specialized tech skills that can be of great\nuse to a campaign include software engineering and web development.\n\n  * Policy \n\nThe policy shop prepares policy and position statements, responds to issue-\nbased questionnaires sponsored by interest groups (usually in the context of a\ngroup’s pending endorsement), and helps prepare talking points and position\npapers for the candidate on particular issues, ranging from education, health\ncare, economic development and crime to international relations.\n\nIn a large campaign, these jobs are likely to go only to those with\nsubstantial experience in a substantive policy area.  You can develop this\nexperience through work either by developing deep expertise in a practice\narea, or more broadly at think tanks such as the Heritage Foundation, the\nBrookings Institution, and the Center for American Progress.  Policy\nexperience can also be developed on a smaller scale while at law school\nthrough intensive classroom or clinical experience, or through participation\nin groups such as the Federalist Society or the American Constitutional\nSociety.\n\n  * Political \n\nThe political desks of a campaign usually have three primary functions:\nbriefing the candidate on particular political terrain, securing the goodwill\nor endorsement (or tacit non-interference) of other political leaders, and\nmaintaining a close liaison with the campaign’s field workers.  Political\ndesks are usually arranged by geographic territories. This is very sensitive\nwork, but campaigns occasionally hire newcomers, particularly those who are\nfamiliar with the local coverage area, if they are politically savvy.\n\n  * Research \n\n“Opposition research” (the art and science of finding out as much as possible\nabout the opponent) is extremely important and the most notorious research\nfunction, but by no means the only role of research staff.  Staff also\nresearches their own candidate. This rapid response can be exciting for\nsomeone who loves the political game, but the hours can be grueling and\nboring. Expect twelve to sixteen hour days of Googling and Nexis research.\n\nResearch staff keep the campaign informed: they may vet would-be staff or\nvolunteers, dig up details on particular policy proposals, or track media\nappearances by their own candidate, surrogates, and opponents. Research is one\nof the most sensitive areas of a campaign, but if the staff trusts you, it\ndoes not require a lot of experience. Research is a great introductory job in\na campaign if you are willing to put in the hours.\n\n  * Scheduling \n\nThe competing demands on the candidate’s time can be tremendous, and someone\non the campaign has to be responsible for negotiating the competing priorities\nand setting the candidate’s schedule. In the complicated internal dynamic of a\ncampaign, the schedulers are among those with the most internal clout because\nthey guard the campaign’s scarcest resource. Scheduling is very sensitive work\nwith the need for staff to be on call 24/7.\n\n  * Surrogate Management \n\nThe candidate can only be in one place at a time; for everything else, there\nare surrogates. Surrogates are public or quasi-public figures enlisted to\nspeak or appear on the candidate’s behalf – they may be members of the\ncandidate’s family, prominent public figures, or other elected officials.\nLarger campaigns will have staff specifically devoted to scheduling and\nmanaging surrogate appearances, including providing speech materials and\ntalking points that are closely coordinated with what the candidate is saying.\nSurrogate management is politically sensitive work and is quite interesting\nbecause you will get to meet some of the heaviest hitters in the business.\n\n  * Targeting \n\nCampaigns must figure out how best to deploy their resources; though it may\nfeel like the country is saturated toward the end of a campaign cycle,\ncampaigns cannot possibly hope to reach everyone all the time. The targeting\nstaff is tasked with determining which voters the campaign should prioritize\ncontacting through different means – both in terms of general groups and\nspecific individuals.  In many campaigns, this responsibility falls under the\npolitical shop and requires people who love campaigns and data management. If\nyou want to groom yourself for this position, put Excel, statistical modeling,\ndata analysis, and digital outreach skills on your resume.\n\n  * Volunteers \n\nMany campaigns are so awash in volunteers that they must find a way to\nproductively harness this energy. Some will employ campaign staff specifically\nto find and manage volunteers and to deploy the talents of campaign supporters\nwhere they can do the most good. This is generally less sensitive work, but\nrequires a lot of patience.\n\n### Presidential Transition and New Administration Resources\n\nWe have aggregated a sampling of frequently asked questions and resources to\nhelp you understand hiring processes for Presidential transitions and new\nadministrations, and perhaps participate in them.\n\nExplore the Resources\n\n## Conclusion\n\nIf you have any inclination to be involved in a political campaign, do it! The\npace can be challenging, but the work is rarely boring, and individual effort\nmakes a difference every day. In addition to the satisfaction that comes from\nworking for someone you respect and whose positions you support, there is a\nsense of gratification that comes from working on a project where there will\nbe demonstrable winners, losers, and an end date. You will also build\ncamaraderie and relationships with individuals that can be beneficial far into\nthe future. Campaigns can provide a host of experiences and levels of\nexcitement that are difficult to match in any other environment.\n\n## Resources\n\n**Ballotpedia **  \nList of the campaign staff for the 2020 Presidential candidates.\n\n### Organizations That Focus on Campaign Work\n\n**Arena**  \nArena aims to convene, train, and support the next generation of candidates\nand campaign staff. It hosts the Arena Summit, which brings together\ncandidates, staff, and activists; offers training through the Arena Academy,\nand helps recruit and match talent to progressive campaigns.\n\n**Campaigns& Elections **  \nNon-partisan website that tracks all things political.  You can subscribe to\ntheir print magazine that is published ten times a year.  They also sponsor\nseveral conferences a year on specific election issues. Contact them for\nupcoming training events or see their website. On their site, you can\nsubscribe to Campaign Insider, which will email political job opportunities as\nwell as the latest inside scoop on campaigns around the country.\n\n**Campaign Jobs**  \nHere you can find a job board focused exclusively on campaign-related work.\n\n**Campaign Management Institute**  \n _Washington, D.C.  \n_ American University sponsors an intensive two-week semiannual training\nsession in January and May on all aspects of political campaigning, taught by\nexperts from both political parties. Non-degree-seeking students can apply to\nattend.\n\n**Congressional Progressive Caucus Center Legislative Fellowship**  \n _Washington, D.C.  \n_ The Congressional Progressive Caucus Center Legislative Fellowship is\ndesigned for emerging leaders who want to develop their own professional\nskills in policymaking and social change through learning from and working\nwithin a strong legislative operation on Capitol Hill. Fellows are placed in\nthe offices of active members of the Congressional Progressive Caucus. Fellows\nwork closely with CPC member offices to gain substantive legislative and\nfederal policy experience in their issue focus.\n\n**Center for Digital Strategy**  \nThe Digital Plan offers online and in-person trainings on digital strategy for\nnonprofits and political campaigns. Topics range from media engagement and\ndigital planning to data management and adapting email use to a particular\ncampaign. There are also templates, blueprints, and worksheets on many of\nthese topics.\n\n**Fair Elections Center**  \nFair Elections Center is a national, nonpartisan voting rights and election\nreform organization that works to improve election administration, protect\naccess to the ballot through litigation, and provide expertise and advice to\nvoter mobilization organizations.\n\n**GOP Training Resources**  \nThis GOP page highlights political education programs including the RNC\nCampaign Management College, Campaign Finance College and Campaign Data\nCollege. The programs are open to individuals with a wide range of experience.\n\n**Harvard Kennedy School Institute of Politics**  \n _Cambridge, MA_  \nThe Kennedy School’s Institute of Politics has many programs and centers that\ncan help you develop your skills and knowledge about a variety of topics\nrelated to campaigns, advocacy and voting rights. See for example the Campaign\n& Advocacy Program, Community Action Committee, the National Campaign for\nPolitical and Civic Engagement conference, the Campaign Managers Conference\nand the Harvard Votes Challenge.\n\n**Inclusv**  \nInclusv works to ensure that staff, consultants, and vendors of color are\nfound at every professional level within advocacy, policy, and campaigns and\nelections. It helps to amplify available job opportunities from employer\npartners, elevate relevant training opportunities, and provide culturally\ncompetent career development trainings for staffs or conference attendees of\npartners.\n\n**The Leadership Institute**  \n _Arlington, VA  \n_ The Leadership Institutes provides training on campaigns, fundraising,\ngrassroots organizing, and general politics to conservatives of all ages. It\nis also present on many college campuses and collects relevant job\nopportunities on its website.\n\n**The Mobilisation Lab**  \nThe Mobilisation Lab offers training and coaching on advocacy campaigns,\nincluding an accelerator, workshops, and online courses. You can also find\ntoolkits and frameworks on pressing campaign-related issues like digital voter\nengagement, security and storytelling strategy.\n\n**The National Democratic Training Committee**  \nThe National Democratic Training Committee offers a free interactive, online\ncampaign school with trainings on communications, digital campaign skills,\nfield work, and fundraising.\n\n**National Federation of Republican Women**  \n _Alexandria, VA  \n_ The National Federation of Republican Women runs a Campaign Management\nSchool covering topics from budgeting to media strategy, with events held\nacross the United States.\n\n**The New Politics Leadership Academy**  \nNew Politics Leadership Academy is a nonpartisan non-profit organization\ndedicated to recruiting and supporting servant leaders (veterans and\nAmericorps and Peace Corps alumni) to serve through politics. It offers\nleadership development experiences, educational programming, and networking\nevents focused on political campaigning.\n\n**Political& Leadership Resource Map **  \nThis website from Rutgers University’s Center for American Women and Politics\ncompiles resources and organizations, categorized by state, for women who are\ninterested in running for office or in working on campaigns more broadly.\n\n**Re: Power**  \nThrough a framework of inclusive politics, re:power holds multiple trainings\nfor individuals interested in campaign work, including a Data and Analytics\nCamp, a Digital Organizer School, and an Advanced Campaign Management School.\n\n**VoteRunLead**  \nFocused on helping women run for and win political office, VoteRunLead also\nhas trainings for communications and fundraising and hosts a network of women\ninvolved in politics and campaigns. _ _\n\n### Organizations That Focus on Voting Rights Issues\n\nThis list is not exhaustive; many other civil rights organizations engage, to\na greater or lesser degree, in voting rights work.\n\n**All Voting is Local  \n** _Washington, D.C. and Nationwide_  \nAll Voting is Local fights to eliminate needless and discriminatory barriers\nto voting before they happen, to build a democracy that works for us all. It\nis a collaborative campaign housed at The Leadership Conference Education\nFund, in conjunction with the American Civil Liberties Union Foundation; the\nAmerican Constitution Society; the Campaign Legal Center; and the Lawyers’\nCommittee for Civil Rights Under Law.\n\n**ACLU Voting Rights Project**  \n _New York, NY  \n_ Established in 1965, the ACLU Voting Rights Project has worked to protect\nthe gains in political participation won by racial and language minorities\nsince passage of the 1965 Voting Rights Act. The ACLU is currently litigating\nvoter suppression and minority vote dilution cases in over a dozen states,\nfrom coast to coast, in every region of the country.\n\n**Advancement Project**  \n _Washington, D.C.  \n_ The Advancement Project is a next-generation, multi-racial civil rights\norganization that uses innovative tools and strategies to strengthen social\nmovements and achieve high-impact policy change. It focuses on issues\nincluding voting rights, the school-to-prison pipeline, education justice and\nimmigrant justice.\n\n**Brennan Center for Justice**  \n _Washington, D.C. and New York, NY  \n_ The Brennan Center for Justice at NYU School of Law is a nonpartisan law and\npolicy institute dedicated to protecting the rule of law and the values of\nConstitutional democracy. It focuses on voting rights, campaign finance\nreform, ending mass incarceration, and preserving our liberties while also\nmaintaining our national security.\n\n**Campaign Legal Center**  \n _Washington, D.C.  \n_ Campaign Legal Center (CLC) is a nonpartisan, nonprofit organization based\nin Washington, D.C. CLC watchdogs government officials, provides expert\nanalysis and helps journalists uncover violations. CLC also participates in\nlegal proceedings across the country to defend the right to vote and ensure\nfair redistricting.\n\n**Declaration for American Democracy **  \n_Washington, D.C._  \nThe Declaration for American Democracy is a coalition of over 240 member\norganizations committed to the protection of voting rights through national\nlegislative initiatives to combat gerrymandering and government corruption.\n\n**DNC Civic Engagement and Voter Protection**  \n _Washington, D.C._  \nThe Civic Engagement and Voter Protection department is concerned with\nsafeguarding the right to vote by ensuring fair, accessible elections.\n\n**Demos**  \n _Washington, D.C. and New York, NY  \n_ Demos is a dynamic “think-and-do” tank that powers the movement for a just,\ninclusive, multiracial democracy. Through cutting-edge policy research,\ninspiring litigation and deep relationships with grassroots organizations,\nDemos champions solutions that will create a democracy and economy rooted in\nracial equity.\n\n**Let American Vote**  \n _Washington, D.C.  \n_ Let America Vote is an organization that fights back against proposals\nacross the country that make it harder for eligible voters to exercise their\nconstitutional right to cast a ballot. _ _\n\n### Books and Publications Providing Both Practical Advice as Well as Personal\nPerspectives and Anecdotes; See Also Publications by the RNC, DNC, and Local\nState Committees\n\n**Campaign for President: The Managers Look at 2016  \n** by The Institute of Politics at the Harvard Kennedy School  \nPublished by Rowman & Littlefield Publishers, 2017\n\n**The Campaign Manager: Running and Winning Local Elections 5th Edition  \n** by Catherine Shaw  \nPublished by Routledge, 2014\n\n**The Victory Lab: The Secret Science of Winning Campaigns  \n** by Sasha Issenberg  \nPublished by Broadway Books, 2013\n\n## Credits\n\n### Created by:\n\n**Sharon Kelly McBride ’04**  is Senior Vice President of Advocacy at Human\nRights First. Before joining Human Rights First, she was Research Director and\nPolicy Advisor for Senate Majority Leader Harry Reid’s Senate Democratic\nCommunications Center.\n\n**Justin Levitt ’02**  is Associate Dean for Research and Professor of Law at\nLoyola Law School, Los Angeles. Before joining the faculty of Loyola Law\nSchool, he was Counsel at the Brennan Center for Justice at NYU School of Law;\nhe has also worked with multiple candidates, including serving as the National\nVoter Protection Counsel for a major presidential campaign. While at HLS, he\nreceived a Masters of Public Administration from the Kennedy School of\nGovernment.\n\n**Amanda Tammen Peterson (former 1L Advising Initiative Coordinator)**  is a\ntransplanted Westerner with extensive experience in local and state political\ncampaigns. Amanda, a registered Democrat, brokered her first bipartisan deal\nwhen she married her husband, a registered Republican.\n\n### Many thanks to the following for their guidance:\n\n**James Flug ‘** **63** : Former Senior Heyman Fellow, Bernard Koteen Office\nof Public Interest Advising  \n **Virginia Greiman** : Attorney Advisor, Bernard Koteen Office of Public\nInterest Advising  \n **Sarah Isgur ‘** **08** : Political Analyst, CNN  \n **Rachel Pemstein:  **Assistant Director for Alumni Advising, Bernard Koteen\nOffice of Public Interest Advising  \n **Joan Ruttenberg ‘** **82** : Director of the Heyman Fellowship Program and\nAssistant Director for Government Advising, Bernard Koteen Office of Public\nInterest Advising  \n **Alexa Shabecoff** : Former Assistant Dean for Public Service, Bernard\nKoteen Office of Public Interest Advising  \n **Missi Sousa** : Former Intern Coordinator, John McCain for President  \n **Gabriella Elanbeck** : Summer Public Interest Fellow 2019\n\n## Modal Gallery\n\nClose modal gallery\n\nof\n\nPrevious Next\n\nHarvard Law School home\n\n**Harvard Law School** provides unparalleled opportunities to study law with\nextraordinary colleagues in a rigorous, vibrant, and collaborative\nenvironment.\n\n## Explore\n\n  * Harvard Law Today News\n  * Course Catalog\n  * Faculty Directory\n  * Law Library\n  * Alumni\n  * Work at HLS\n\n## Resources\n\n  * Events Calendar\n  * Campus Map and Directions\n  * Department Directory\n  * Media Relations\n  * Make a Gift to HLS\n  * Emergency Information\n  * Consumer Information (ABA Required Disclosures)\n\n1585 Massachusetts Ave.  \nCambridge, MA 02138\n\nHarvard University\n\n  * Accessibility\n  * Digital Accessibility\n  * Trademark Notice\n  * Privacy and Copyright\n\n© 2022 The President and Fellows of Harvard College\n\n## Follow\n\n  * Facebook\n  * Twitter\n  * Instagram\n  * Youtube\n\n© 2022 The President and Fellows of Harvard College\n\n",
    "links": "[{\"link\": \"https://hls.harvard.edu/areas-of-interest/\", \"text\": \"\"}, {\"link\": \"https://hls.harvard.edu/faculty/\", \"text\": \"\"}, {\"link\": \"https://hls.harvard.edu/bibliography/\", \"text\": \"\"}, {\"link\": \"https://hls.harvard.edu/for-faculty/\", \"text\": \"\"}, {\"link\": \"https://hls.harvard.edu/library/\", \"text\": \"\"}, {\"link\": \"https://hls.harvard.edu/alumni/\", \"text\": \"\"}, {\"link\": \"https://hls.harvard.edu/today/\", \"text\": \"\"}, {\"link\": \"https://hls.harvard.edu/today/bulletin/\", \"text\": \"\"}, {\"link\": \"https://hls.harvard.edu/calendar/\", \"text\": \"\"}, {\"link\": \"https://hls.harvard.edu/about/\", \"text\": \"\"}, {\"link\": \"https://hls.harvard.edu/today/\", \"text\": \"Harvard Law Today News\"}, {\"link\": \"https://hls.harvard.edu/courses/\", \"text\": \"Course Catalog\"}, {\"link\": \"https://hls.harvard.edu/faculty/\", \"text\": \"Faculty Directory\"}, {\"link\": \"https://hls.harvard.edu/library/\", \"text\": \"Law Library\"}, {\"link\": \"https://hls.harvard.edu/alumni/\", \"text\": \"Alumni\"}, {\"link\": \"https://hls.harvard.edu/calendar/\", \"text\": \"Events Calendar\"}]"
}