{
    "summary": "Menu\n\n  * Election  \nData Guide\n\n  * Data  \nInventory\n\n  * Data  \nAcademy\n\n  * Assessment  \nGuide\n\nSign up for updates\n\nEnglish\n\n  * English\n  * Español\n  * Français\n  * عربى\n  * Українська\n  * မြန်မာ\n\n## Table of Contents\n\n  1. Introduction\n  2. Section 1: Electoral Integrity\n  3. Section 2: Open Election Data Principles\n  4. Section 3: Key Election Process Categories\n    * Legal Framework for Elections\n    * Electoral Boundaries (Districts)\n    * Election Management Body and Administration\n    * Election Management Body Processes\n    * Election Security\n    * Political Party Registration\n    * Ballot Qualification\n    * Election Campaigns\n    * Campaign Finance\n    * Voter Registration\n    * Voter Lists\n    * Voter Education\n    * Polling Stations\n    * Election Results\n    * Electronic Voting and Counting\n    * Electoral Complaints, Disputes and Resolution\n  5. Section 4: Open Election Data in Practice: Examples from Latin America\n  6. Acknowledgments\n\n# Election Campaigns\n\n### What are election campaigns?\n\nElection campaigns are the means by which candidates and political parties\nprepare and present their ideas and positions on issues to the voters in the\nperiod preceding election day. Contestants use a variety of techniques to\nreach voters and deliver their messages, including through traditional and new\nmedia, public events, written materials, or other means. In some countries,\npublic media and/or space are allocated to contestants for these purposes\n(considered indirect public campaign financing). The dates of an official\nelection campaign period, usually a period of a month or several months\nleading up to election day, are often legally defined. In many countries, the\nlegal window for campaigning will end a day or two prior to election day,\nproviding a so-called \"black-out period\" immediately before voting begins.\nParties and candidates will establish physical premises from which they carry\nout campaign activities and overall operations.\n\n### Why do election campaigns matter?\n\nDemocratic elections require an informed as well as a free vote and a fair\nchance for contestants to win support and motivate supporters to help them\ngain office. Election campaigns are vital to achieving those goals. Elections\nthat are genuinely competitive offer equitable opportunities for contestants\nto convey their positions to citizens and compete for votes. Election\ncampaigns provide candidates and political parties with opportunities to\npresent their message to citizens, helping voters make educated and informed\ndecisions on election day. In order to help ensure an even playing-field and\nan election that ultimately reflects the will of citizens, any public\nresources allocated to election contestants must be equitable. Decision-making\nprocesses about how those resources are allocated should be transparent, so\ncontestants and the broader public can understand and trust the outcomes. With\naccess to information about election campaigns, including the official\ncampaign window and public resource allocations, parties and candidates can\ndesign their campaign activities and understand what they are entitled to from\nthe state, if anything. Access to data about election campaigns allows\ncontestants and civil society to explore whether candidates have equitable\naccess to whatever public campaign resources are provided in a given context,\nif any, including media and space for campaign events like rallies. Where\npublic media is allocated to contestants, then parties, candidates and\ncitizens can consider whether the allocation process was credible and the\nresulting allocations, equitable. Even in contexts in which there is no\nallocation of public resources for campaigns, contestants and civil society\ncan examine whether there was any unfair or biased treatment in how\ncontestants were allowed to conduct their operations. This might include\nwhether party offices were permitted to operate, or whether permits were\ndistributed in an unbiased manner for rallies or other campaign events.\nTransparency in these areas boosts confidence in the election process on the\npart of contestants and voters, and may serve to shed light on any unfair\npractices or potential abuses of state power where they exist.\n\n### Example election campaign data\n\nElection campaign data includes information about the timetable for official\nelection campaigns, as well as campaign regulations or restrictions.\nInformation also includes official data on party and candidate operations,\nsuch as their ability to rent space. Additional campaign data includes\ninformation about how contestants are allocated public resources for\ncampaigning, such as media or use of public spaces. Data about media\nallocations includes information relating to the decision-making process (the\nsystem used for the allotment, such as a lottery) and outcomes (i.e. who has\nwhich slots). Relevant data can also include information about applications\nfor rally permits -- including who applied, when, why, whether the application\nwas accepted or denied, and, if denied, why.\n\n  * __Ballot Qualification\n  * Campaign Finance __\n\n# Sign up for updates\n\n×  Please enter your email to receive updates when new modules or tools are\nadded Sign up\n\n  * Election  \nData Guide\n\n  * Data  \nInventory\n\n  * Data  \nAcademy\n\n  * Assessment  \nGuide\n\n  * Contact\n\n  *   *   * \n\n  * __\n  * __\n  * __\n  * __\n\n— Content licensed under a CC Attribution 4.0 International License\n\n",
    "links": "[{\"link\": \"https://openelectiondata.net/en/\", \"text\": \"\"}, {\"link\": \"https://openelectiondata.net/en/guide/\", \"text\": \"\"}, {\"link\": \"https://openelectiondata.net/en/inventory/\", \"text\": \"\"}, {\"link\": \"https://openelectiondata.net/en/academy/\", \"text\": \"\"}, {\"link\": \"https://openelectiondata.net/en/assessment/\", \"text\": \"\"}, {\"link\": \"https://openelectiondata.net/en/guide/key-categories/election-campaigns/\", \"text\": \"English\"}, {\"link\": \"https://openelectiondata.net/es/guide/key-categories/election-campaigns/\", \"text\": \"Español\"}, {\"link\": \"https://openelectiondata.net/fr/guide/key-categories/election-campaigns/\", \"text\": \"Français\"}, {\"link\": \"https://openelectiondata.net/ar/guide/key-categories/election-campaigns/\", \"text\": \"عربى\"}, {\"link\": \"https://openelectiondata.net/uk/guide/key-categories/election-campaigns/\", \"text\": \"Українська\"}, {\"link\": \"https://openelectiondata.net/my/guide/key-categories/election-campaigns/\", \"text\": \"မြန်မာ\"}, {\"link\": \"https://openelectiondata.net/en/guide/introduction/\", \"text\": \"Introduction\"}, {\"link\": \"https://openelectiondata.net/en/guide/electoral-integrity/\", \"text\": \"Section 1: Electoral Integrity\"}, {\"link\": \"https://openelectiondata.net/en/guide/principles/\", \"text\": \"Section 2: Open Election Data Principles\"}, {\"link\": \"https://openelectiondata.net/en/guide/key-categories/\", \"text\": \"Section 3: Key Election Process Categories\"}, {\"link\": \"https://openelectiondata.net/en/guide/key-categories/legal-framework/\", \"text\": \"Legal Framework for Elections\"}, {\"link\": \"https://openelectiondata.net/en/guide/key-categories/electoral-boundaries/\", \"text\": \"Electoral Boundaries (Districts)\"}, {\"link\": \"https://openelectiondata.net/en/guide/key-categories/emb-administration/\", \"text\": \"Election Management Body and Administration\"}, {\"link\": \"https://openelectiondata.net/en/guide/key-categories/emb-processes/\", \"text\": \"Election Management Body Processes\"}, {\"link\": \"https://openelectiondata.net/en/guide/key-categories/security/\", \"text\": \"Election Security\"}, {\"link\": \"https://openelectiondata.net/en/guide/key-categories/political-party-registration/\", \"text\": \"Political Party Registration\"}, {\"link\": \"https://openelectiondata.net/en/guide/key-categories/ballot-qualification/\", \"text\": \"Ballot Qualification\"}, {\"link\": \"https://openelectiondata.net/en/guide/key-categories/election-campaigns/\", \"text\": \"Election Campaigns\"}, {\"link\": \"https://openelectiondata.net/en/guide/key-categories/campaign-finance/\", \"text\": \"Campaign Finance\"}, {\"link\": \"https://openelectiondata.net/en/guide/key-categories/voter-registration/\", \"text\": \"Voter Registration\"}, {\"link\": \"https://openelectiondata.net/en/guide/key-categories/voter-lists/\", \"text\": \"Voter Lists\"}, {\"link\": \"https://openelectiondata.net/en/guide/key-categories/voter-education/\", \"text\": \"Voter Education\"}, {\"link\": \"https://openelectiondata.net/en/guide/key-categories/polling-stations/\", \"text\": \"Polling Stations\"}, {\"link\": \"https://openelectiondata.net/en/guide/key-categories/election-results/\", \"text\": \"Election Results\"}, {\"link\": \"https://openelectiondata.net/en/guide/key-categories/electronic-voting/\", \"text\": \"Electronic Voting and Counting\"}, {\"link\": \"https://openelectiondata.net/en/guide/key-categories/complaints-and-disputes/\", \"text\": \"Electoral Complaints, Disputes and Resolution\"}, {\"link\": \"https://openelectiondata.net/en/guide/country-examples/\", \"text\": \"Section 4: Open Election Data in Practice: Examples from Latin America\"}, {\"link\": \"https://openelectiondata.net/en/guide/acknowledgments/\", \"text\": \"Acknowledgments\"}, {\"link\": \"https://openelectiondata.net/en/guide/key-categories/campaign-finance/\", \"text\": \"indirect public campaign financing\"}, {\"link\": \"https://openelectiondata.net/en/guide/key-categories/ballot-qualification/\", \"text\": \"\"}, {\"link\": \"https://openelectiondata.net/en/guide/key-categories/campaign-finance/\", \"text\": \"\"}, {\"link\": \"https://openelectiondata.net/en/guide/\", \"text\": \"\"}, {\"link\": \"https://openelectiondata.net/en/inventory/\", \"text\": \"\"}, {\"link\": \"https://openelectiondata.net/en/academy/\", \"text\": \"\"}, {\"link\": \"https://openelectiondata.net/en/assessment/\", \"text\": \"\"}, {\"link\": \"https://openelectiondata.net/en/contact\", \"text\": \"Contact\"}]",
    "priceAndPlans": "Menu\n\n  * Election  \nData Guide\n\n  * Data  \nInventory\n\n  * Data  \nAcademy\n\n  * Assessment  \nGuide\n\nSign up for updates\n\nEnglish\n\n  * English\n  * Español\n  * Français\n  * عربى\n  * Українська\n  * မြန်မာ\n\n## Table of Contents\n\n  1. Introduction\n  2. 1\\. Define the Overall Observation Strategy\n  3. 2\\. Assessing the Availability of Open Election Data\n  4. 3\\. Develop an Analysis Strategy and Finalize Your Observation Plan\n  5. 4\\. Advocating for Open Election Data\n  6. 5\\. Being a Good Consumer of Open Data\n  7. 6\\. Measuring Success and Impact\n  8. Supplementary Materials: Illustrative Datasets and Assessment Forms\n  9. Acknowledgements\n\n# Campaign Finance\n\nDownload as PDF\n\n## General\n\n  1. Is campaign finance data centralized at the national level? If not, at what sub-national level(s) is it consolidated?\n  2. Are there any legal barriers preventing CSOs from accessing campaign finance data from the government?\n  3. What government body is in charge of collecting and disseminating campaign finance information?\n\n## Timely\n\n  4. Is the timeline for campaign finance reporting and review clear and well-known? What is it?\n  5. Is campaign finance data released as it is reported to the government, or only after filing deadlines?\n  6. If the EMB plans on consolidating campaign finance data, how long will that take?\n  7. Do you anticipate receiving at least some campaign finance data with enough time to analyze it and report findings while they are still relevant? For instance, in time to identify non-compliance issues while the campaign is ongoing, or to include analysis in election statements while the public is still interested?\n\n## Granularity\n\n  8. Will the EMB consolidate campaign finance data, or release raw data? Or both?\n  9. Will information regarding donations be available? In what detail? (ie: individual donors, amount, donation type, locations, etc)\n  10. Will information regarding campaign expenditures be available? In what detail? (ie: individual expenditures, cost breakouts, locations, etc)\n  11. What information regarding government review of campaign finance will be available?\n\n## Availability\n\n  12. What is the likelihood that all campaign finance data will be available for free on the internet? Will at least some data be available online?\n  13. If some data is not available for free on the internet, where can you find it?\n  14. Will any data have to be collected in person, or can it be emailed or otherwise accessed electronically? If so, what data will have to be collected in person?\n  15. Do you have to pay for access to any campaign finance data?\n\n## Completeness\n\n  16. Will data regarding campaign donations be made available all together? Or on an individual or time frame basis?\n  17. Will data regarding campaign donations be consolidated for all campaigns, or will each campaign have its own dataset?\n  18. Will data regarding campaign expenditures be made available altogether in one dataset?\n  19. Will data regarding campaign expenditures of all campaigns be consolidated, or will each campaign have its own dataset?\n  20. Will data regarding campaign finance reporting completion, violations, and sanctions be available in a consolidated format? Reported by campaign? Or reported by individual instances?\n\n## Analyzable\n\n  21. In what format will campaign donation data be available? Is this machine readable?\n  22. In what format will campaign expenditure data be available? Is this machine readable?\n  23. In what format will campaign monitoring and regulatory data be available? Is this machine readable?\n\n## Non-Proprietary\n\n  24. Is there any proprietary software associated with the campaign finance data?\n\n## Non-Discriminatory\n\n  25. Do you have to go through any application or registration process to obtain campaign finance data?\n  26. Is there any reason some organizations or stakeholders would be granted access to campaign finance information but not others? If so, why?\n\n## Licensing\n\n  27. Are there any prescribed limits to using campaign finance data that groups must adhere to? If so, what and by whom?\n  28. Do you have to agree to any terms of use before accessing campaign finance data? If so, what and by whom?\n\n## Permanently Available\n\n  29. Are you able to access campaign finance data from previous elections? If not, why not?\n  30. Will access to campaign finance data during this election “expire” at any time?\n  31. What happens to campaign finance data after a reporting period is over? (if applicable)\n  32. What happens to campaign finance data after an election is over?\n\n  * Assessment Guide __\n\n# Sign up for updates\n\n×  Please enter your email to receive updates when new modules or tools are\nadded Sign up\n\n  * Election  \nData Guide\n\n  * Data  \nInventory\n\n  * Data  \nAcademy\n\n  * Assessment  \nGuide\n\n  * Contact\n\n  *   *   * \n\n  * __\n  * __\n  * __\n  * __\n\n— Content licensed under a CC Attribution 4.0 International License\n\n"
}