{
    "summary": "__\n\n  * Product __ __\n    *       * NGP\n        * Fundraising\n        * Online Contributions\n        * Compliance Reporting\n        * Contact Management\n        * Event Management\n        * Call Time Mobile\n    *       * DIGITAL\n        * Digital 8\n        * Data Visualization\n        * Targeted Email\n        * Online Actions\n        * Online Contributions\n        * Social Network Integration\n        * Website\n      * VAN\n        * SmartVAN\n        * Casework\n        * MiniVAN Manager\n        * Paid Phones\n        * Votebuilder\n  * Resources __ __\n    * Blog\n    * Case Studies\n    * Webinars\n  * About __ __\n    * About Us\n    * Careers\n  * Get a Demo\n\n __Close\n\nGet a Demo\n\n# Launch a Winning Campaign: 10 Political Campaign Strategies\n\nSeptember 4, 2023 | Brandon Blumenherst\n\nVictories in the 2020 and 2022 elections have inspired Democratic and\nprogressive candidates across the country to step up and run for office in\ntheir communities. Launching a campaign is exciting, but it also requires a\nwell-thought-out plan.\n\nYour launch day should be one of the biggest fundraising and outreach days of\nyour campaign. To start strong and keep that momentum going, candidates should\nequip themselves with the best tools and strategies around.\n\nFollow these ten steps to get your campaign ready for launch day and run a\nwinning campaign.\n\n## 1\\. Define Your “Why”\n\nThe number one question you will likely get asked on the campaign trail is,\n“Why are you running for office?”\n\nWhile you likely have many reasons, your answer needs to be a concise elevator\npitch. Answers that are short, snappy, and impactful are easy to repeat and\ncan help you establish your brand in voters’ minds.\n\nWhen defining your “why,” try answering these questions:\n\n  * Is there a local issue that you’re running to resolve? \n  * Are you running to bring more representation to your local government? \n  * Are you frustrated by the passage of conservative policies? \n\nConsider both your personal reasons and what answers are likely to resonate\nwith your base. For example, if the previous holder of the office you’re\nrunning for has low approval ratings, speaking to how you can bring change or\nbetter represent your community’s interests has the potential to win over\nfrustrated voters.\n\nHave your “why” ready before launch day so you can answer the public’s\nquestions easily and have consistent framing for the rest of your campaign.\n\n## 2\\. Determine Your Target Voters\n\nWho is your campaign’s target audience? At first glance, the answer might be\nvoters in your district. However, getting in touch with every eligible voter\nis rarely possible and may not be the most effective or efficient way to use\nyour campaign’s limited resources.\n\nInstead, consider your target audience by answering these questions:\n\n### **How many votes do you need to win?**\n\nUse data from past campaigns to determine how many voters are in your district\nand what percentage of them are likely to vote in this election cycle. This\nwill help you calculate your win number and decide which voters you need to\nfocus on to win your election. Let’s say you expect 10,000 voters to vote in\nyour election and there are only two candidates in your race, so you need 50%\nof the vote plus one (5,001 votes) to win. Now, we can figure out how to reach\nthat win number.\n\n### **Who is likely to vote for you?**\n\nEvery campaign will have a unique path to identify how to hit their win number\nfor a general election, but there will be a base of supporters that should\nvote for your campaign. For instance, in some states, voters are required to\nregister their party affiliation while other states allow voters to vote in\neither party’s primary election. However, both registered party affiliation,\npast primary voting history, and partisanship scores can be good indicators of\nlikely support for your campaign. You will want to segment these voters into\nyour Get Out the Vote (GOTV) universe as you want to mobilize them to vote for\nyour campaign. If that universe is 4,000 voters, you only need to win 1,001\nvotes from independent voters or voters who are registered with or likely to\nsupport another party. While you may want to add a cushion to contact more\nthan those 1,001 voters to win, those voters are the base for your persuasion\nuniverse (the voters you need to convince to support your campaign).\n\n### **Who is likely to vote at all?**\n\nAnother factor to consider is whether someone is likely to vote at all. You\ncan pull lists in VAN of voters based on their past voting history or use\nscores to determine who is likely to vote in the upcoming election. Again,\nyour campaign should have a specific win number, and you’ll need to figure out\nhow to achieve it. That path to victory may include encouraging voters who are\nunlikely to vote in the election to cast their ballots in support of your\ncampaign. However, you’ll need to determine that based on your available\nresources.\n\nBased on the path to hit your win number, you can frame your campaign\nmessaging to sway or mobilize the voters you need to win. If you need to\nenergize your base of likely and identified supporters to win, do that. If you\nneed to convince more voters to support your campaign, shape your messaging\naround the issues that matter most to the community and start persuading\nvoters to support your campaign.\n\n**Tip:** Your win number should drive nearly all of the decisions you make on\nyour campaign. It’s critical to calculate this number early to determine how\nmany voters you need to win your election which will then help determine how\nmuch money you need to raise, how many doors you need to knock, how many\nmailers you need to send, and much more.\n\n## 3\\. Build a Communications Plan\n\nOnce you’ve established why you’re running and which voters you need to\ntarget, it’s time to get your topline messaging and talking points in order.\nWhile you don’t need to have every element of your platform in place for\nlaunch day, your stance on major issues should be solid.\n\nMeet with your core team and make sure everyone understands where you stand on\nyourcore issues and is prepared to think on their feet when it comes to\nanswering questions. Get ahead of potential challenges and smear campaigns by\ncreating a rapid-response plan with your team so that you’re prepared to shut\ndown false narratives and deliver a focused, consistent message.\n\nIn terms of media outreach, write an op-ed announcing why you’re running and\nhave your communications team work on getting placements in local newspapers\nor other local publications. This op-ed can be similar to your announcement\nspeech but with a few tweaks for publication.\n\nAdditionally, your launch day, along with the days after, will be when you get\nthe most free press (otherwise known as earned media), so be ready to maximize\nit. If a local news or radio station wants to interview you, make time for it,\nbecause that opportunity might not come up again. Have a press kit ready with\na media advisory and background materials, including a short biography, list\nof accomplishments, and professional photos.\n\n## 4\\. Have a Website\n\nThe phrase “if you’re not on the internet, you don’t exist” is truer than ever\non a campaign’s launch day. A website allows voters and supporters to find\nmore information about your campaign, accept online donations, recruit\nvolunteers, control the narrative about your campaign, and much more.\n\nWeb design can be a lengthy and complicated process, but not every page needs\nto be finalized by launch day. On the first days of your campaign, a simple\nbut engaging website with a short biography and summary of where you stand on\nimportant issues along with forms to sign up for your email list, volunteer\nfor the campaign, and donate will work well enough while you build out more\ndetailed pages.\n\nThe five important pages you will want to develop early for your website are:\n\n  * **A homepage**. Ensure this page makes a positive first impression with an appealing design and working links. Whether someone comes to your website to donate or learn more about your campaign, your website should be easy to navigate and encourage additional action. \n\n  * **An “About” page.** Include your headshot, photos of you interacting with your community, and a biography. In your biography, highlight your professional career, any community groups you’re involved in, and how your background impacts your “why.” After stating that connection, explain your “why” in detail. You should add options for people to take additional action, like filling out a volunteer form, signing up for your email list, or reading where you stand on the issues.\n\n  * **An “Issues” page**. Even with complex issues, explain your stances with plain language as straightforwardly as possible. Many candidates choose to summarize their stances in bullet points and then offer a longer explanation below or on a different page. You can also create a form for people to ask questions about specific issues that are important to them. On this page, you can add a call to action (CTA) to encourage people to help you spread the word by volunteering and linking out to your volunteer sign-up form!\n\n  * **A “Take Action” page.** Create a form people can fill out to express interest in volunteering for your campaign. Typically, this form lists volunteering options like canvassing, phone banking, texting, hosting a fundraiser, and supporting events. Add calls to action to your donation page as well, as supporters dedicated enough to volunteer may also be interested in making a financial contribution.\n\n  * **A “Donation” page.** This is one of your website’s most important pages and it must work at your campaign’s launch. You can also add a lightbox (or pop-up) window that asks everyone who visits your website to donate. Some donation platforms also allow you to redirect traffic after donations are made. If that is possible, send donors to your “Take Action” page so they can sign up to volunteer as well! \n\nEach of those pages should have a tab in your website’s menu. You can also\nbuild out your footer with contact information and an email subscription form\nso supporters can easily sign up or contact you wherever they’re on your\nwebsite.\n\nFinally, make sure to design your website with mobile visitors in mind. Over\nhalf of your web visitors will likely view your webpage from their phones.\nEnsure that everyone visiting your website has a good experience, and if you\nneed help building your campaign website, our team at NGP VAN can help.\n\n## 5\\. Get a CRM for Organizing and Managing Data\n\nEven before your campaign launch, you’ll likely start building your list of\nsupporters, volunteers, and donors, and your campaign needs to be ready for\nthem. To collect and organize your supporters’ data, you need a CRM designed\nfor political campaigns like NGP VAN’s Digital 8. NGP VAN is trusted by\nthousands of Democratic and progressive campaigns to raise more money and\ndrive more action every year.\n\nFeatures like Targeted Email, Online Actions, hundreds of integrations, and\nmore set us apart from the rest. Having all these tools within a centralized\nplatform allows campaigns to easily create comprehensive supporter profiles,\nengage with those individuals, and add more valuable contact history, notes,\nand more to their supporter profiles.\n\n**Tip:** Investing early in this software can make it easier for your campaign\nto learn how to use it before the election season heats up. It also allows you\nto build your database right from the start of your campaign, allowing you to\nstart building comprehensive profiles and multichannel outreach campaigns to\nyour supporters early to help drive more action and raise more money.\n\n## 6\\. Use High-Quality Photographs\n\nEvery political campaign needs a logo, color scheme, and some high-quality\nphotos. Usually, your logo contains your name, the office or district you’re\nrunning for, and some graphic elements like stripes and stars. Use your\ncampaign’s primary colors, then keep colors consistent so your campaign is\ninstantly recognizable.\n\nIn addition to your logo and color scheme, get photos taken by a professional\nphotographer to use on your website, campaign literature, and social media. By\nhaving high-quality images available, you can create a better visual identity\nfor yourself and your campaign.\n\nHere are a few pictures that are helpful to have on hand:\n\n  * A professional headshot\n  * Photos with constituents \n  * Family photos \n  * Photos of you at notable landmarks or neighborhoods in your community \n\nOnce you have these photos, there are a ton of uses for them. You can send\nthem to local media when they need additional imagery for earned media hits.\nGroups may use them to announce their endorsement of your candidacy. And most\nimportantly, your campaign can use them for mailers, social media posts,\ncampaign literature, and more.\n\n**Tip:** When you send the logo to local media and other promotional groups,\nit should be in vector (.ai or .eps) format, so it won’t be pixelated or\nstretched. Additionally, make sure you have a logo with a transparent\nbackground in a .png format.\n\n## 7\\. Prepare Your Social Media Accounts\n\nYour campaign should start off with whatever social media accounts you can\nkeep updated consistently with quality content. Most campaigns start off with\nFacebook and X (formerly known as Twitter) accounts. But, with the rise of new\nsocial media platforms, you may want to consider others if you think you can\nproduce consistent and quality content. Having extra support for social media\nfrom volunteers or staff can make it easier to branch out to other platforms\nlike Instagram, Threads, or TikTok. Having a trusted member of your team who\nis savvy on social media to manage your accounts can be incredibly helpful.\n\nThis trusted member of your team should be social media savvy and will be\nresponsible for generating engaging ideas for content, creating content, and\nposting to your social media accounts on a regular basis. There will likely be\nan uptick in activity on your social media pages around launch day, so be\nready to engage with supporters, like their comments, and thank them for their\nsupport to generate additional engagement and boost your ranking in social\nmedia algorithms.\n\nAlso, don’t use your personal social media accounts for your campaign. While\nyou should share your campaign content to your personal accounts frequently,\nyou should create campaign accounts specifically to share campaign updates,\ngain new followers, and help drive action for your campaign.\n\n## 8\\. Establish SMS and Mobile Programs\n\nSMS is one of the most effective ways to connect and mobilize people, whether\nit’s volunteers for canvassing or voters on Election Day. The key to building\na mobile list is starting early and getting them to opt-in to receive updates\nfrom the campaign.\n\nTell your supporters to sign up for updates in your announcement speech and at\nother events. When you speak in front of a podium have a sign with your logo,\nwebsite, and a phone number (if one is available) voters can text to receive\nSMS updates.\n\nWhen it’s time to get out the vote, you’ll be grateful you invested in\nbuilding out a strong mobile program.\n\n## 9\\. Run Digital Ads\n\nOn launch day, you may want to run digital advertising to boost your\ncampaign’s visibility. Plan to have digital ads run for at least two to three\nweeks after your launch. These ads are useful for the entire campaign cycle\nbut are especially important at launch to build initial momentum that you can\ncarry through to Election Day.\n\nHere’s a breakdown of the types of ads you should invest in:\n\n  * **Google Search:** Voters are going to look up candidates. Make it so they can find you easily with search results ads. These ads appear at the top of the Google search results page for search queries relevant to your campaign. For example, you might create ads targeting keywords like, “Jane Smith congress” or “jane smith democrat.” When people search your name, your website will be at the very top of the results page.\n\n  * **Google Display Ads:** These are the ‘banner’ ads you see on the sidebars of websites. While these have a lower click-through rate than search results ads, they are great at raising awareness about your campaign. \n\n  * **Facebook Acquisition:** If you’re looking to build your email list, Facebook is great for attracting potential donors at a relatively low cost. Facebook Acquisition ads are placed on people’s newsfeeds. When voters click on them, direct them to your email sign-up page with entry fields for their name, email address, and zip code. Be sure to redirect them to a fundraising page after they finish subscribing to encourage them to take their support a step further by financially supporting the campaign.\n\nFor NGP users, check out our integration with Facebook Ads Manager to help\nbuild awareness around your target issues, grow a supporter base, and inspire\nindividuals to take action.\n\n## 10\\. Host Your Political Campaign Launch\n\nAfter taking these other steps, it’s time to plan your political campaign\nlaunch.\n\nStart by choosing your event venue, date, and time. Estimate how many people\nmay attend, and begin looking at venues with that audience size in mind. If\nyou’re going to have a big crowd, think about using a speaker system so that\neveryone can hear you. Buy decorations, get campaign literature printed, and\nsort out all needed event logistics.\n\nTypically, campaign launches last about an hour or two (but event setup and\nteardown add time before and after the event). While the timelines can shift,\nhere’s an example of what a campaign launch could look like:\n\n  * 4 p.m. – Set up begins \n  * 6 p.m. – Campaign launch starts \n  * 6:15 p.m. – Speaker lineup starts \n  * 6:30 p.m. – Candidate speaks \n  * 6:45 p.m. – Candidate’s speech concludes and they move to speak to the media\n  * 7 p.m. – Candidate moves to speak with supporters and volunteers \n  * 7:30 p.m. – Launch concludes and tear down begins \n\nHave volunteers available to support your political campaign launch. Whether\nthey set up the event, process donations, or pick up last-minute supplies,\nvolunteers are essential for a smooth campaign launch.\n\n**Tip:** Be sure to train volunteers for more sensitive tasks, like collecting\ndonations. While it’s typically best to direct voters to donate online so you\ncan gather their emails and other donor information, some may prefer to write\nyou a check. Make sure your volunteers are aware of any information that needs\nto be collected with check donations, so your campaign follows all relevant\ncompliance laws.\n\n## Feel Confident in Your Campaign Launch\n\nStart your campaign off right with a launch that gets voters excited,\ngenerates donations, and spreads your name throughout your community. Back up\nyour campaign launch with the right tools from NGP VAN to collect and act on\nthe data you need to make informed, strategic decisions throughout the entire\ncampaign cycle.\n\n## Explore more from our blog\n\nPolitical Fundraising Emails: A Guide to Better Fundraising\n\nIt’s no secret that political fundraising emails are a vital source of revenue\nfor…\n\nRead more\n\nCanvassing with MiniVAN: A Complete Guide for Users\n\nMiniVAN is the leading mobile canvassing app for Democratic and progressive\ncampaigns and causes.\n\nRead more\n\n7 Ad Targeting Strategies to Support Your Political Campaign\n\nTo run a successful political campaign, you need a comprehensive digital\nstrategy that…\n\nRead more\n\n(202) 686-9330\n\n655 15th St. NW, Suite 650  \nWashington, DC 20005\n\nNGP\n\n  * Targeted Email\n  * Fundraising\n  * Online Actions\n  * Online Contributions\n  * Compliance Reporting\n  * Social Network Integration\n  * Contact Management\n  * Website\n  * Event Management\n  * Call Time Mobile\n\nVAN\n\n  * Casework\n  * MiniVAN Manager\n  * Paid Phones\n  * VoteBuilder\n  * SmartVAN\n\nDigital\n\n  * Digital 8\n  * Data Visualization\n\nAbout NGP VAN\n\n  * About\n  * Blog\n  * Developers\n  * Legal\n  * Privacy\n  * Your Privacy Choices\n\nPrograms\n\n  * DLCC GO\n  * DMO Go\n  * Votebuilder\n  * Run for Something\n\nWe use cookies on our website to give you the most relevant experience by\nremembering your preferences and repeat visits. By clicking “Accept”, you\nconsent to the use of ALL the cookies. However you may visit Cookie Settings\nto provide a controlled consent.\n\nCookie settingsAccept\n\nManage consent\n\nClose\n\n#### Privacy Overview\n\nThis website uses cookies to improve your experience while you navigate\nthrough the website. Out of these cookies, the cookies that are categorized as\nnecessary are stored on your browser as they are essential for the working of\nbasic functionalities...\n\nNecessary\n\nNecessary\n\nAlways Enabled\n\nNecessary cookies are absolutely essential for the website to function\nproperly. These cookies ensure basic functionalities and security features of\nthe website, anonymously. Cookie| Duration| Description  \n---|---|---  \ncookielawinfo-checbox-analytics| 11 months| This cookie is set by GDPR Cookie\nConsent plugin. The cookie is used to store the user consent for the cookies\nin the category \"Analytics\".  \ncookielawinfo-checbox-functional| 11 months| The cookie is set by GDPR cookie\nconsent to record the user consent for the cookies in the category\n\"Functional\".  \ncookielawinfo-checbox-others| 11 months| This cookie is set by GDPR Cookie\nConsent plugin. The cookie is used to store the user consent for the cookies\nin the category \"Other.  \ncookielawinfo-checkbox-necessary| 11 months| This cookie is set by GDPR Cookie\nConsent plugin. The cookies is used to store the user consent for the cookies\nin the category \"Necessary\".  \ncookielawinfo-checkbox-performance| 11 months| This cookie is set by GDPR\nCookie Consent plugin. The cookie is used to store the user consent for the\ncookies in the category \"Performance\".  \nviewed_cookie_policy| 11 months| The cookie is set by the GDPR Cookie Consent\nplugin and is used to store whether or not user has consented to the use of\ncookies. It does not store any personal data.  \n  \nFunctional\n\nfunctional\n\nFunctional cookies help to perform certain functionalities like sharing the\ncontent of the website on social media platforms, collect feedbacks, and other\nthird-party features.\n\nPerformance\n\nperformance\n\nPerformance cookies are used to understand and analyze the key performance\nindexes of the website which helps in delivering a better user experience for\nthe visitors.\n\nAnalytics\n\nanalytics\n\nAnalytical cookies are used to understand how visitors interact with the\nwebsite. These cookies help provide information on metrics the number of\nvisitors, bounce rate, traffic source, etc.\n\nAdvertisement\n\nadvertisement\n\nAdvertisement cookies are used to provide visitors with relevant ads and\nmarketing campaigns. These cookies track visitors across websites and collect\ninformation to provide customized ads.\n\nOthers\n\nothers\n\nOther uncategorized cookies are those that are being analyzed and have not\nbeen classified into a category as yet.\n\nSave & Accept\n\nPowered by\n\n",
    "links": "[{\"link\": \"https://www.ngpvan.com/get-elected/\", \"text\": \"Get a Demo\"}, {\"link\": \"https://www.ngpvan.com/get-elected/\", \"text\": \"Get a Demo\"}, {\"link\": \"https://www.ngpvan.com/cookie-policy/\", \"text\": \"cookies\"}]"
}