{
    "summary": "Skip to main content\n\n  * About the Universities of Wisconsin\n  * All In Wisconsin\n  * Our Campuses\n  * Offices\n  * Information for\n  * News\nSearch\n\nGo to...About the Universities of WisconsinAll In WisconsinOur\nCampusesOfficesInformation forNewsSearch\n\nBrowse all sites Search for:\n\nSearch Submit Cancel Search\n\n##  Government Relations\n\n### Guidance on Political Campaign Activities\n\nToggle navigation\n\n  * Federal Relations\n  * State Relations\n  * Newsletter\n  * Contacts\n\n  1. University of Wisconsin System\n  2. Government Relations\n  3. Guidance on Political Campaign Activities\n\n# Guidance on Political Campaign Activities\n\nThe University of Wisconsin System is committed to the free and open\ndiscussion of ideas and encourages active civic engagement including\nparticipation in the electoral process.  As a state entity, the UW System does\nnot engage in political campaign activity and state time or resources may not\nbe used for that purpose either. But, on their own time and with their own\nresources, employees and students may become involved with a political\ncampaign.  However, it’s important for employees and students interested in\nbecoming involved with a political campaign to understand their\nresponsibilities as state employees or members of a student organization\nbefore becoming involved. The higher your position, the more likely you are\nsubject to greater regulation such as lobbying requirements.\n\nBelow are frequently asked questions (“FAQs”).  The FAQs should be treated as\ngeneral guidelines not legal advice which is dependent on the specific details\nof your situation.  Please direct specific questions regarding political\ncampaign issues to your campus Office of Legal Affairs or the UW System Office\nof General Counsel.\n\n### FAQs for UW Employees\n\nOpen All\n\n#### What is political campaign activity?\n\nPolitical campaign activity can include activities such as:\n\n  * solicitation of campaign contributions\n  * advocating, volunteering, or working for candidates, political parties, or political action committees\n  * advocating a particular position on a referendum.\n\nFurther, there should be awareness that comments regarding the specific\nactions, positions, or records of a particular candidate may be perceived as\nsupport or endorsement by the institution of a particular candidate or\npolitical party.\n\nThere are other “political” activities that might not fall within the scope of\n“political campaign” activities described above. For example, advocating for\ngovernmental action or legislative change at a local, state or federal level\nmay be political although not related to a political campaign. While this\nguidance does not cover those activities in detail, because of restrictions on\nstate lobbying and personal use of state resources, individual employees\nshould not use state work time or state resources to engage in political\nactivities unless expressly designated with this responsibility on behalf of\nthe employing institution.\n\n#### As a university employee, are there restrictions on my political campaign\nactivities?\n\nYes. Your political campaign activities are restricted by Regent policy and\nstate law in three significant ways.  You may not:\n\n  * engage in political campaign activities during your work time\n  * use state resources to engage in political campaign activities at any time\n  * solicit contributions or services for a political purpose from other university employees while they are engaged in their official duties. Wis. Stat. § 11.1207.\n\nSome examples of state resources include:\n\n  * institutional letterhead and logos\n  * office space and other facilities\n  * office supplies\n  * photocopiers\n  * telephones or fax machines\n  * electronic resources including email, websites, on-line discussion boards, cell phones, or other similar resources\n\nAs a private citizen, you are free to engage in political activities on your\nown time and with your own resources.\n\n#### As a university employee, may I run for state office?\n\nYes, but this may affect your employment. Wisconsin law restricts elected\nstate officials from holding any other paid positions with a state agency\nduring their term. Wis. Stat. § 16.417(2)(b). There are narrow exceptions for\nunpaid positions. The University of Wisconsin System and its constituent\ncolleges, universities, and extension service is a “state agency,” and\ntherefore an individual elected to state office may not hold a paid position\nin the University of Wisconsin System.\n\nWhile the law does not prevent university employees from running for office,\nit does prevent you from continuing to work at the university if elected. You\nmay not hold a paid position at the university while serving in an elective\nstate office. Check your campus policies regarding leaves of absence to engage\nin public service.\n\nIf you wish to be a candidate in a primary election, you should first consult\nwith both your department chair and your dean or director to determine whether\nyour campaign activity will impair the performance of your university duties.\nIf it is determined the activity will produce some adverse effect, then a\nreduced-time appointment or a leave of absence would be appropriate for the\nduration of the campaign.\n\nIf you are a candidate in a general election, upon consultation with the\nappropriate department chair and dean or director, a reduced-time appointment\nor leave of absence should be arranged.\n\nYou may also run for local office. However, your university appointment may be\nsubject to change, depending on the particular office you are seeking.\n\nServing as an elected official for activities that occur outside the workday\n(e.g., school boards, city councils, county boards, or commissions) would not\nnormally require a reduced appointment or leave of absence but may require the\nuse of vacation/personal holiday time to cover any activities during the\nworkday.\n\n#### As a university employee, may I host a political fundraiser off-campus\n(at my home, for example)?\n\nYes. This is permissible if you do so on your own time and do not use state\nresources in connection with this event. In addition, you may not promote the\nfundraiser or engage in fundraising activities on state time, or in state\noffice buildings. See Wis. Stat. § 11.1207.\n\n#### As a university employee, may I use a university conference facility or\nmeeting room for political campaign activities?\n\nNo. You may not use your university position to secure an on-campus conference\nor meeting room for the purpose of political campaign activities. However, an\norganization you are affiliated with may rent campus facilities consistent\nwith the rules that apply to facilities rented by any other private\norganization. Note that state law strictly prohibits the use of state\nfacilities for political fundraising. See Wis. Stat.§ 11.1207(3); See also the\nfirst FAQ for UW Students and Recognized Groups.\n\n#### As a university employee, may I make contributions to a political\ncampaign?\n\nYes, but only outside of work hours and university facilities. All UW System\nemployees, including legislative liaisons and other employees who attempt to\ninfluence legislation, may contribute to and participate in political\ncampaigns at any time during the election cycle. Pursuant to state campaign\nfinance laws, however, campaign contributions cannot be solicited or collected\non state time or in state office buildings. See Wis. Stat.§ 11.1207; Wis.\nAdmin. Code § UWS 21.\n\n#### May I permit an organization to list my name and employment title as a\nsupporter in its political campaign literature—for example, in a letter to a\nnewspaper, a brochure or a fundraiser invitation?\n\nYes. Care should be taken, however, about using your official title to promote\none candidate over another. Generally speaking, you should seek to clarify\nthat the use of your name indicates neither support nor endorsement by the\nuniversity of a particular candidate and that you are acting solely in your\nrole as a private citizen.\n\n#### May I support a candidate or referendum position by wearing political\nidentification or buttons on campus or when working remotely? May I\ndemonstrate my support for a candidate or referendum position in my office or\nclassroom or when I work from a remote location by displaying stickers,\nslogans, or signs in those places?\n\nIt is a violation of state law for university employees to engage in political\ncampaign activities while at work. Consistent with this principle, the State\nOffice of Employment Relations has previously advised that state employees are\nprohibited from “the wearing of a political identification while on duty where\nit could impair the effectiveness of the state agency operation.” See\nDPM-0433-MRS State Employee Political Activity (Classified Civil Service).\nAlthough the university currently operates under its own personnel system\nrather than OSER, we still believe that university employees should carefully\nconsider the impact of wearing such political identifications while on duty.\n\nThe same goes for displaying partisan political signs that advocate a\ncandidate, political party, or referendum outcome in a current election in the\nworkplace regardless of whether in a University Office or when working\nremotely. Wisconsin Administrative Code UWS section 18.08(9), provides that no\nperson may erect, post or attach any signs, posters, pictures or any similar\nitem in or on a university building, except as authorized under institutional\npolicies. Employees in remote work settings should ensure that such political\nsigns are not visible in work-related videoconferencing or other virtual\nmeeting platforms. See also guidance on the posting of political signs in\nresidence hall rooms in the FAQs for UW Students and Recognized Student\nGroups.\n\nThe display of bumper stickers on privately-owned vehicles parked in\nuniversity parking facilities, however, does not raise concerns about improper\nor illegal political campaign activities.\n\n### FAQs for UW Students and Recognized Student Groups\n\nOpen All\n\n#### As a university student or university-recognized student group, may I\norganize a political event to be hosted on my campus?\n\nYes. Political events may be sponsored by either recognized or independent\nstudent organizations under certain circumstances. In fact, institutions and\nstudent groups are particularly encouraged to arrange non-partisan events such\nas campus tours for legislators and candidates, as well as to sponsor forums\nin which political figures or candidates may debate one another.\n\nStudent groups wishing to organize such events should contact the appropriate\nfacilities administrator to ensure compliance with UW System policies on use\nof university facilities, Wis. Admin. Code UWS § 21.03, and applicable\ninstitutional policies.\n\nPlease note state law strictly prohibits the use of state-owned buildings for\npolitical fundraising. See Wis. Stat. § 11.1207. In addition, student\norganizations that have federal tax-exempt status may be subject to additional\nrestrictions on political activity. See IRS Publication “Election Year Issues”\n(http://www.irs.gov/pub/irs-tege/eotopici02.pdf).\n\n#### Can student groups utilize segregated fees or university resources to\ncontribute to a political campaign?\n\nNo. In accordance with UW System Financial and Administrative Policy\nSegregated University Fees (UWS 820) and consistent with campaign finance law,\nstudent groups may not use segregated fees to make direct gifts,\ncontributions, or donations of any kind. See UW System Administrative Policy\n820 I.B(3)(e).\n\n#### May segregated fees be used to fund the printing of posters, political\nadvertisements, or t-shirts indicating our group’s support of a candidate or\npolitical party?\n\nAs discussed above, student organizations may not use segregated fees in a\nmanner which would constitute making a direct gift, contribution, or donation\nof any kind. Accordingly, if the funding of these materials constitutes a\ngift, contribution or donation to a candidate or party, it would not be\npermitted. See UW System Administrative Policy 820 I.B(3)(e). Student\norganizations may, however, use segregated fees to support their own\nexpressive activities and views on public policy issues and other interests.\n\nQuestions about appropriate uses of segregated fees should be referred to\ncampus student affairs officers and/or legal counsel.\n\n#### Can student organizations urge students to vote? What about voting for a\nparticular party or for a particular candidate?\n\nYes. Student organizations are encouraged to help educate and inform students\nabout upcoming elections, including urging students to exercise their right to\nvote. Student organizations are also free to express their views about the\nparties and candidates, and to urge voting for particular parties or\ncandidates, and–as noted above–to sponsor events for candidates so long as\nthey comply with rules governing the use of university facilities.\n\nPlease note state law strictly prohibits the use of state-owned buildings for\npolitical fundraising. See Wis. Stat. § 11.1207. In addition, student\norganizations that have federal tax-exempt status may be subject to additional\nrestrictions on political activity. See IRS Publication “Election Year Issues”\n(http://www.irs.gov/pub/irs-tege/eotopici02.pdf).\n\n#### As a university student, may I display a partisan political sign in my\nresidence hall room?\n\nYes. So long as you comply with university and residence hall policies\ngoverning the posting of signs in dormitory rooms, and any other applicable\ntime, place, and manner restrictions, such activity would be permissible. See,\nWis. Admin. Code UWS § 18.08(9).\n\n\n\n### FAQs for Political Activity on Campus\n\nOpen All\n\n#### What types of educational events may the campus engage in to encourage\nvoter education and participation?\n\nThe campus may host non-partisan events to encourage voter education and\nparticipation, such as candidate forums and voter registration efforts. These\nactivities must be non-partisan for the sole purpose of voter education. If\ncandidates are invited on campus, all legally qualified candidates must be\ninvited and given an equal opportunity to speak and participate. Permissible\nactivities include speeches, question-and-answer sessions, debates, or similar\nactivities. A statement should be given that the university does not endorse\nnor oppose any of the candidates. The UW System policy on the use of\nuniversity facilities, Wis. Admin. Code UWS § 21, and relevant institutional\npolicies apply. Please note that state law strictly prohibits the use of\nstate-owned buildings for political fundraising. Wis. Stat. § 11.1207.\n\nElectronic resources may also be used for non-partisan voter education\npurposes. For example, a university web page with current election information\nmay include a link to candidates’ websites if the web page includes all\nlegally qualified candidates and excludes any commentary in support or against\na candidate, express or implied. Again, a statement should be included that\nthe university does not endorse nor oppose any of the candidates. If\ndiscussion space is provided, the university should include a disclaimer that\nthe opinions expressed on the discussion board do not represent those of the\nuniversity. Websites used for voter education purposes should be regularly\nmonitored to ensure that they are not modified for the purposes of advocating\nfor a particular candidate or political party.\n\n#### Is it important that institutions sponsor political events that offer\nopportunities to all candidates seeking election to the same political office?\n\nYes. A balanced approach is required. For example, all campaigns of candidates\nseeking election to the same political office should be offered the same or a\nsimilar opportunity to participate in a university-sponsored event. However,\nif when offered the opportunity, one or more candidates decline, it is still\nappropriate to host the event for those who have accepted the invitation.\nDuring the event a statement should be made indicating that all candidates\nwere provided with an equal opportunity to participate.\n\nIt should be noted, however, that the same principle does not necessarily\napply to candidates who speak to a class at the invitation of an instructor.\nFor example, a professor who invites a Republican legislator to speak to a\nclass on the history of the Republican Party is not obligated to invite the\nlegislator’s Democratic opponent. The invitation, however, should relate to\nthe course material and should not be for the purpose of advancing one\npolitical candidate over another.\n\n#### May individuals or candidates distribute campaign literature on campus?\n\nYes. Campaigning is permitted in public areas at UW institutions, subject to\ninstitutional policies concerning the time, place, and manner for conducting\nsuch activities. Similarly, distribution of political literature and\ncampaigning may be conducted in residence halls, subject to institutional\npolicies governing the time, place, and manner for engaging in such\nactivities.\n\n#### Do candidates and political organizations have access to mailing lists of\nfaculty, students, and staff?\n\nYes, to the extent that this information is available to the public. Some\ncampuses provide this information in their staff and student directories that\nare available for purchase by the public. Other campuses may supply employee\nand student mailing lists upon request, with a fee charged at the time of\nrequest in order to cover the costs of generating the lists.\n\nUniversity employees and students who choose not to have this information\ndisclosed are annually offered the opportunity to have their names and home\naddresses withheld from these mailing lists.\n\n#### Are institutions required to charge candidates who attend campus\nreceptions? What about legislators who are currently in office?\n\nThe general rule for those currently holding office is that university-\nsponsored functions are a benefit to the UW System and not to a particular\nlegislator or party. Accordingly, there should generally be no charge to state\nlegislators or officials who attend campus receptions. However, care should be\ntaken to comply with applicable ethical and legal requirements (see generally,\nWis. Stats. §§ 19.45(3m) and 19.56(3)), including restrictions on the use of\nfederal funds for lobbying purposes and limits on the circumstances in which\nlegislators and state officials may receive hospitality such as food or\nathletic tickets in connection with events or parties hosted by a campus.\n\nLast updated: July 2022\n\n### Universities of Wisconsin\n\n  * About the Universities of Wisconsin\n  * All In Wisconsin\n  * Our Campuses\n  * Board of Regents\n  * Office of the President\n  * Offices\n  * News\n  * Contact Us\n  * Explore Our Work\n\n### Government Relations\n\n  * Federal Relations\n  * State Relations\n  * Newsletter\n  * Contacts\n\nOffice of Government Relations  \n1700 Van Hise Hall  \n1220 Linden Dr.  \nMadison, WI 53706  \n\n© 2024 Board of Regents - University of Wisconsin System. All Rights Reserved\n\nAll Sites | Accessibility | Privacy | Contact Webmaster\n\n",
    "links": "[]",
    "priceAndPlans": "Error: Timeout 30000ms exceeded. =========================== logs\n=========================== navigating to\n\"http://web.archive.org/web/20240111214041/https://www.wisconsin.edu/\",\nwaiting until \"load\"\n============================================================\n\n"
}