{
    "summary": "Accessibility links\n\n  * Skip to main content\n  * Keyboard shortcuts for audio player\n\n  * Open Navigation Menu \n  *   *   * Newsletters\n\n  *   * NPR Shop\n  * \n\nClose Navigation Menu\n\n  * Home\n\n  * News Expand/collapse submenu for News\n\n    * National\n    * World\n    * Politics\n    * Business\n    * Health\n    * Science\n    * Climate\n    * Race\n  * Culture Expand/collapse submenu for Culture\n\n    * Books\n    * Movies\n    * Television\n    * Pop Culture\n    * Food\n    * Art & Design\n    * Performing Arts\n    * Life Kit\n    * Gaming\n  * Music Expand/collapse submenu for Music\n\n    * Best Music Of 2023 \n    * Tiny Desk \n    * Hip-Hop 50 \n    * All Songs Considered \n    * Music Features \n  * Podcasts & Shows Expand/collapse submenu for Podcasts & Shows\n\nDaily\n\n    * Morning Edition \n    * Weekend Edition Saturday \n    * Weekend Edition Sunday \n    * All Things Considered \n    * Fresh Air \n    * Up First \nFeatured\n\n    * Trump's Trials \n    * State of the World from NPR \n    * Pop Culture Happy Hour \n    * Embedded \n    * More Podcasts & Shows\n\n  * Search\n\n  * Newsletters\n\n  *   * NPR Shop\n\n  *   * Best Music Of 2023 \n  * Tiny Desk \n  * Hip-Hop 50 \n  * All Songs Considered \n  * Music Features \n\n  * About NPR\n  * Diversity\n  * Organization\n  * NPR Network\n  * Support\n  * Careers\n  * Connect\n  * Press\n  * Ethics\n\n**Money, money, money: it's how political campaigns run and how candidates\nwin** **Elections are becoming more expensive as candidates vie for voters'\nattention. But there are strict rules about how money is raised, how it can be\nused and how to prove you're following the laws.**\n\n###  Elections\n\n# It takes lots of money to win elections. Here's what you need to know\n\nNovember 1, 20235:01 AM ET\n\nXimena Bustillo\n\nEnlarge this image\n\nThis photo illustration shows the mugshot of former President Donald Trump\nnext to a website called Trump Save America JFC, a joint fundraising committee\non behalf of Donald J. Trump for President 2024, which is selling merchandise\nbearing his mugshot. **Stefani Reynolds/AFP via Getty Images** ****hide\ncaption****\n\n****toggle caption****\n\nStefani Reynolds/AFP via Getty Images\n\nThis photo illustration shows the mugshot of former President Donald Trump\nnext to a website called Trump Save America JFC, a joint fundraising committee\non behalf of Donald J. Trump for President 2024, which is selling merchandise\nbearing his mugshot.\n\nStefani Reynolds/AFP via Getty Images\n\nTelevision ads, logos, stickers, staplers and staffers. They are all needed to\nrun political campaigns. And they all cost money.\n\nFundraising is one of the key components of political campaigns. Candidates\nspend a significant period of time talking to donors and mobilizing grassroots\ndonations in order to keep their campaigns alive.\n\n\"Campaign finance matters,\" said Michael Kang, law professor at Northwestern\nUniversity who specializes in campaign finance, among other matters. \"It's the\nway that candidates fund their outreach and messaging to voters.\"\n\nAnd the dollars add up. In the 2020 election, political spending topped $14\nbillion, according to OpenSecrets, doubling what was spent in the 2016\npresidential election, making it the most expensive election cycle.\n\n\"We just see money in politics growing every year,\" said Shanna Ports, senior\nlegal counsel for campaign finance at Campaign Legal Center. \"There are new\nmethods of technology, especially around the internet and digital platforms\nthat campaigns want to be able to spend a lot of money on to reach voters and\nto micro-target people with their messages.\"\n\nMedia advertising accounts for a large part of spending, according to Kang.\nIt's a race to the top.\n\n\"That's really what drives up the costs and the fact that everyone's pretty\nwell funded and spends a lot of time fundraising,\" Kang said. \"So you have to\nkeep up with your opposition to get your message out.\"\n\nEnlarge this image\n\nA worker sets up signs at the Dallas County Fairgrounds for a rally with\nRepublican presidential candidate and former President Donald Trump on Oct. 16\nin Adel, Iowa. **Scott Olson/Getty Images** ****hide caption****\n\n****toggle caption****\n\nScott Olson/Getty Images\n\nA worker sets up signs at the Dallas County Fairgrounds for a rally with\nRepublican presidential candidate and former President Donald Trump on Oct. 16\nin Adel, Iowa.\n\nScott Olson/Getty Images\n\n### Why raise money?\n\nThe advertisements that propel a candidate's message to voters on various\nmedia platforms take money to produce and to run.\n\n\"There's only so much you can do without paying for some sort of advertising,\nwhether it's TV, radio, print, the internet. All of those things require money\nand they're very expensive,\" Kang explained.\n\nBut he said there are also plenty of other expenses that don't go to media\noutreach such as paying for pollsters, hiring campaign staff and printing yard\nsigns and posters.\n\nFor the Republican contest there is added incentive from the Republican\nNational Committee, which has set thresholds for a minimum number of unique\ndonors as one of the metrics for qualifying for the debates. So, candidates\nfor the 2024 election cycle have already gotten creative.\n\nFormer Arkansas Gov. Asa Hutchinson barely qualified for the first GOP\npresidential debate. But he did, thanks to the help of college students,\naccording to POLITICO.\n\nCurrent GOP front-runner Donald Trump has used his recent legal troubles as a\nway to garner financial support, sending out emails and texts requesting\ndonations following several indictments and court appearances. He is even\nselling merch with his own mug shot.\n\nConversely, Biden, who is the Democratic front-runner, has boasted high\nfundraising totals in the first two quarters compared to his GOP rivals,\nrunning a more traditional fundraising operation.\n\nEnlarge this image\n\nPresident Biden greets Democratic National Committee staff and volunteers\nafter speaking at DNC headquarters in Washington, D.C., on Oct. 24. **Drew\nAngerer/Getty Images** ****hide caption****\n\n****toggle caption****\n\nDrew Angerer/Getty Images\n\nPresident Biden greets Democratic National Committee staff and volunteers\nafter speaking at DNC headquarters in Washington, D.C., on Oct. 24.\n\nDrew Angerer/Getty Images\n\n### What is the FEC?\n\nThe Federal Election Commission is the sole federal agency tasked with\nenforcing campaign finance laws.\n\nThere are six FEC commissioners and, according to law, no more than three can\nbe from the same political party. Ideally, this makes decisions from the\ncommission bipartisan because it takes four to make a decision.\n\nThe commissioners oversee who is spending money and how, ensuring political\ncommittees and candidates are filing accurate and complete reports which are\nlater posted by the FEC, and they investigate allegations of illegal activity.\n\n\"But in practice, especially in recent years, that has been resulting in a lot\nof stalemates, a lot of split decisions, where the three Democratically\nappointed commissioners, three Republican-appointed commissioners disagree,\"\nPorts said, adding that a 3-3 split means no penalty is assessed to someone\nwho is alleged to have broken the law. \"And when that happens, the law doesn't\nget enforced.\"\n\nIt has also stalled the FEC's ability to issue guidance to those asking how to\nbest follow the law, Ports said.\n\n\"A political committee or a campaign can come to the FEC and ask for what's\ncalled an advisory opinion where it basically will say, 'I want to do X thing.\nIs that OK?'\" Ports said. The FEC writes an opinion saying yes or no and why.\n\"But when there's a 3-to-3 split, the commission says there's nothing, there's\nno opinion rendered.\"\n\nCommissioners have argued before lawmakers in Congress that despite the\npartisan divides, it has reached a consensus on 90% of enforcement matters\nsince January 2021. But lawmakers during a hearing last month said that on\nhigher level issues, such as enforcement allegations related to Trump,\npartisan splits persist.\n\nEnlarge this image\n\nChair of the Federal Election Commission Dara Lindenbaum, center, listens\nduring an Aug. 10 FEC public meeting on whether it should regulate the use of\nAI-generated political campaign advertisements. **Stephanie Scarbrough/AP**\n****hide caption****\n\n****toggle caption****\n\nStephanie Scarbrough/AP\n\nChair of the Federal Election Commission Dara Lindenbaum, center, listens\nduring an Aug. 10 FEC public meeting on whether it should regulate the use of\nAI-generated political campaign advertisements.\n\nStephanie Scarbrough/AP\n\n### Ins and outs of the law\n\nFederal laws apply to those running for federal office. But each state has its\nown set of laws for those running in elections within each state.\n\nThese laws can govern contribution limits, or how much an entity looking to\ngive can give.\n\nThey also govern the disclosure of the money, meaning candidates or\nadvertisers have to report how much they have received and from who.\n\nBut one thing that does hold true across all jurisdictions: people can't be\nstopped from spending.\n\nThe Supreme Court in 2010 decided that political action committees are able to\ntake unlimited contributions from donors, except foreign nationals and federal\ncontractors. Widely known as the _Citizens United_ decision, it also allowed\ncorporations and nonprofits to spend money on political campaigns and\nexplicitly back a candidate as long as they don't directly coordinate with\ncandidates.\n\nPorts and Kang say that this decision led to the rise of the use of political\naction committees.\n\n### What are PACs and super PACs?\n\nA political action committee, or PAC, is organized for the purpose of raising\nand spending money to elect and defeat candidates. PACs tend to represent\nspecific interests such as business, unions or ideologies.\n\n\"The basic difference is that super PACs engage only in independent\nexpenditures. That is, they don't give money to candidates or to parties, and\nthey don't coordinate with parties or candidates in how they use their money,\"\nKang said. \"That distinction allows them to raise money without contribution\nlimits. And so that's what makes them super.\"\n\nIn 2022 there were 2,476 super PACs formed by a wide variety of interests.\nTogether they raised over $2.7 billion and spent over $1.3 billion.\n\nPACs, meanwhile, are subject to contribution limits and can coordinate with\ncandidates. Often, presidential candidates will announce super PACs related to\ntheir individual ideology before announcing they are jumping into the race.\n\n### Elections\n\n### Three months out, the Iowa Caucus is Trump's to lose\n\n### Elections\n\n### New campaign fundraising numbers have been released for the 2024\npresidential race\n\n### Does money increase the chances of a win?\n\nFundraising is a contributor to a campaign's success, said Kang, but so are\nother issues like candidate quality.\n\n\"Usually if you're spending a lot of money, often the opponent is also\nspending a lot of money and they kind of cancel out,\" Kang said. \"That's not\nto say that having money is not important or doesn't help you win, because if\nthe opponent is spending a lot of money, you're better off spending a lot of\nmoney too.\"\n\nFor presidential elections, candidates have to meet deadlines for their\nreporting. During presidential election years, such as 2024, candidates will\nhave to file each month. The first report of the year will include all of 2023\nfundraising and it is due Jan. 31, 2024.\n\n  * political action\n  * pacs\n  * 2024 campaign\n  * candidates\n  * 2024 GOP primary\n  * super pacs\n  * spending\n  * 2024 Republican Presidential Primary\n  * 2024 election\n  * Federal Elections Commission\n  * campaign funding\n  * campaign finance\n  * Republicans\n\n  * **Facebook**\n  * **Flipboard**\n  * **Email**\n\n###### Read & Listen\n\n  * Home\n  * News\n  * Culture\n  * Music\n  * Podcasts & Shows\n\n###### Connect\n\n  * Newsletters\n  * Facebook\n  * Instagram\n  * Press\n  * Public Editor\n  * Corrections\n  * Contact & Help\n\n###### About NPR\n\n  * Overview\n  * Diversity\n  * NPR Network\n  * Accessibility\n  * Ethics\n  * Finances\n\n###### Get Involved\n\n  * Support Public Radio\n  * Sponsor NPR\n  * NPR Careers\n  * NPR Shop\n  * NPR Events\n  * NPR Extra\n\n  * Terms of Use\n  * Privacy\n  * Your Privacy Choices\n  * Text Only\n  * \n\nSponsor Message\n\nBecome an NPR sponsor\n\n## Cookie Settings\n\nWhen you visit our website, we store cookies on your browser to collect\ninformation. The information collected might relate to you, your preferences\nor your device, and is mostly used to make the site work as you expect it to\nand to provide a more personalized web experience. However, you can choose not\nto allow certain types of cookies, which may impact your experience of the\nsite and the services we are able to offer. Click on the different category\nheadings to find out more and change our default settings according to your\npreference. You may opt out of the sharing of your information with our\nsponsorship vendors for delivery of personalized sponsorship credits and\nmarketing messages on our website or third-party sites by turning off \"Share\nData for Targeted Sponsorship\" below. If you opt out, our service providers or\nvendors may continue to serve you non-personalized, non-\"interest-based\"\nsponsorship credits and marketing messages on our website or third-party\nsites, and those sponsorship credits and marketing message may come with\ncookies that are used to control how often you encounter those credits and\nmessages, to prevent fraud, and to do aggregate reporting. You cannot opt-out\nof our First Party Strictly Necessary Cookies as they are deployed in order to\nensure the proper functioning of our website (such as prompting the cookie\nbanner and remembering your settings, to log into your account, to redirect\nyou when you log out, etc.). For more information about the First and Third\nParty Cookies used please follow this link.\n\nAllow All\n\n###  Manage Consent Preferences\n\n#### Strictly Necessary or Essential Cookies\n\nAlways Active\n\nThese cookies are essential to provide you with services available through the\nNPR Services and to enable you to use some of their features. For example,\nthese cookies allow NPR to remember your registration information while you\nare logged in. Local station customization, the NPR Shop, and other\ninteractive features also use cookies. Without these cookies, the services\nthat you have asked for cannot be provided, and we only use these cookies to\nprovide you with those services.\n\n#### Share Data for Targeted Sponsorship\n\nShare Data for Targeted Sponsorship\n\nYou may opt out of the sharing of your information with our sponsorship\nvendors for delivery of personalized sponsorship credits and marketing\nmessages on our website or third-party sites by turning off \"Share Data for\nTargeted Sponsorship.\" If you opt out, our service providers or vendors may\ncontinue to serve you non-personalized, non-\"interest-based\" sponsorship\ncredits and marketing messages on our website or third-party sites, and those\nsponsorship credits and marketing message may come with cookies that are used\nto control how often you encounter those credits and messages, to prevent\nfraud, and to do aggregate reporting.\n\n  * ##### Performance and Analytics Cookies\n\nSwitch Label\n\nThese cookies are used to collect information about traffic to our Services\nand how users interact with the NPR Services. The information collected\nincludes the number of visitors to the NPR Services, the websites that\nreferred visitors to the NPR Services, the pages that they visited on the NPR\nServices, what time of day they visited the NPR Services, whether they have\nvisited the NPR Services before, and other similar information. We use this\ninformation to help operate the NPR Services more efficiently, to gather broad\ndemographic information and to monitor the level of activity on the NPR\nServices.\n\n  * ##### Functional Cookies\n\nSwitch Label\n\nThese cookies allow our Services to remember choices you make when you use\nthem, such as remembering your Member station preferences and remembering your\naccount details. The purpose of these cookies is to provide you with a more\npersonal experience and to prevent you from having to re-enter your\npreferences every time you visit the NPR Services.\n\n  * ##### Targeting and Sponsor Cookies\n\nSwitch Label\n\nThese cookies track your browsing habits or other information, such as\nlocation, to enable us to show sponsorship credits which are more likely to be\nof interest to you. These cookies use information about your browsing history\nto group you with other users who have similar interests. Based on that\ninformation, and with our permission, we and our sponsors can place cookies to\nenable us or our sponsors to show sponsorship credits and other messages that\nwe think will be relevant to your interests while you are using third-party\nservices.\n\nBack Button\n\n### Cookie List\n\nSearch Icon\n\nFilter Icon\n\nClear\n\ncheckbox label label\n\nApply Cancel\n\nConsent Leg.Interest\n\ncheckbox label label\n\ncheckbox label label\n\ncheckbox label label\n\nConfirm My Choices\n\n",
    "links": "[{\"link\": \"https://www.npr.org/\", \"text\": \"\"}, {\"link\": \"https://www.npr.org/newsletters/\", \"text\": \"Newsletters\"}, {\"link\": \"https://www.npr.org/\", \"text\": \"Home\"}, {\"link\": \"https://www.npr.org/sections/news/\", \"text\": \"News\"}, {\"link\": \"https://www.npr.org/sections/national/\", \"text\": \"National\"}, {\"link\": \"https://www.npr.org/sections/world/\", \"text\": \"World\"}, {\"link\": \"https://www.npr.org/sections/politics/\", \"text\": \"Politics\"}, {\"link\": \"https://www.npr.org/sections/business/\", \"text\": \"Business\"}, {\"link\": \"https://www.npr.org/sections/health/\", \"text\": \"Health\"}, {\"link\": \"https://www.npr.org/sections/science/\", \"text\": \"Science\"}, {\"link\": \"https://www.npr.org/sections/climate/\", \"text\": \"Climate\"}, {\"link\": \"https://www.npr.org/sections/codeswitch/\", \"text\": \"Race\"}, {\"link\": \"https://www.npr.org/sections/culture/\", \"text\": \"Culture\"}, {\"link\": \"https://www.npr.org/books/\", \"text\": \"Books\"}, {\"link\": \"https://www.npr.org/sections/movies/\", \"text\": \"Movies\"}, {\"link\": \"https://www.npr.org/sections/television/\", \"text\": \"Television\"}, {\"link\": \"https://www.npr.org/sections/pop-culture/\", \"text\": \"Pop Culture\"}, {\"link\": \"https://www.npr.org/sections/food/\", \"text\": \"Food\"}, {\"link\": \"https://www.npr.org/sections/art-design/\", \"text\": \"Art & Design\"}, {\"link\": \"https://www.npr.org/sections/performing-arts/\", \"text\": \"Performing Arts\"}, {\"link\": \"https://www.npr.org/lifekit/\", \"text\": \"Life Kit\"}, {\"link\": \"https://www.npr.org/sections/gaming/\", \"text\": \"Gaming\"}, {\"link\": \"https://www.npr.org/music/\", \"text\": \"Music\"}, {\"link\": \"https://www.npr.org/podcasts-and-shows/\", \"text\": \"Podcasts & Shows\"}, {\"link\": \"https://www.npr.org/programs/morning-edition/\", \"text\": \"\"}, {\"link\": \"https://www.npr.org/programs/weekend-edition-saturday/\", \"text\": \"\"}, {\"link\": \"https://www.npr.org/programs/weekend-edition-sunday/\", \"text\": \"\"}, {\"link\": \"https://www.npr.org/programs/all-things-considered/\", \"text\": \"\"}, {\"link\": \"https://www.npr.org/programs/fresh-air/\", \"text\": \"\"}, {\"link\": \"https://www.npr.org/podcasts/510318/up-first/\", \"text\": \"\"}, {\"link\": \"https://www.npr.org/podcasts-and-shows/\", \"text\": \"More Podcasts & Shows\"}, {\"link\": \"https://www.npr.org/search/\", \"text\": \"Search\"}, {\"link\": \"https://www.npr.org/newsletters/\", \"text\": \"Newsletters\"}, {\"link\": \"https://www.npr.org/music/\", \"text\": \"\"}, {\"link\": \"https://www.npr.org/about/\", \"text\": \"About NPR\"}, {\"link\": \"https://www.npr.org/diversity/\", \"text\": \"Diversity\"}, {\"link\": \"https://www.npr.org/organization/\", \"text\": \"Organization\"}, {\"link\": \"https://www.npr.org/network/\", \"text\": \"NPR Network\"}, {\"link\": \"https://www.npr.org/support/\", \"text\": \"Support\"}, {\"link\": \"https://www.npr.org/careers/\", \"text\": \"Careers\"}, {\"link\": \"https://www.npr.org/connect/\", \"text\": \"Connect\"}, {\"link\": \"https://www.npr.org/press/\", \"text\": \"Press\"}, {\"link\": \"https://www.npr.org/ethics/\", \"text\": \"Ethics\"}, {\"link\": \"https://www.npr.org/\", \"text\": \"Home\"}, {\"link\": \"https://www.npr.org/sections/news/\", \"text\": \"News\"}, {\"link\": \"https://www.npr.org/sections/culture/\", \"text\": \"Culture\"}, {\"link\": \"https://www.npr.org/music/\", \"text\": \"Music\"}, {\"link\": \"https://www.npr.org/podcasts-and-shows\", \"text\": \"Podcasts & Shows\"}, {\"link\": \"https://www.npr.org/newsletters/\", \"text\": \"Newsletters\"}, {\"link\": \"https://www.npr.org/press/\", \"text\": \"Press\"}, {\"link\": \"https://www.npr.org/sections/publiceditor/\", \"text\": \"Public Editor\"}, {\"link\": \"https://www.npr.org/corrections/\", \"text\": \"Corrections\"}, {\"link\": \"https://www.npr.org/about/\", \"text\": \"Overview\"}, {\"link\": \"https://www.npr.org/diversity/\", \"text\": \"Diversity\"}, {\"link\": \"https://www.npr.org/network/\", \"text\": \"NPR Network\"}, {\"link\": \"https://www.npr.org/about-npr/1136563345/accessibility\", \"text\": \"Accessibility\"}, {\"link\": \"https://www.npr.org/ethics/\", \"text\": \"Ethics\"}, {\"link\": \"https://www.npr.org/about-npr/178660742/public-radio-finances\", \"text\": \"Finances\"}, {\"link\": \"https://www.npr.org/support/\", \"text\": \"Support Public Radio\"}, {\"link\": \"https://www.npr.org/about-npr/186948703/corporate-sponsorship\", \"text\": \"Sponsor NPR\"}, {\"link\": \"https://www.npr.org/careers/\", \"text\": \"NPR Careers\"}, {\"link\": \"https://www.npr.org/sections/npr-extra/\", \"text\": \"NPR Extra\"}, {\"link\": \"https://www.npr.org/about-npr/179876898/terms-of-use\", \"text\": \"Terms of Use\"}, {\"link\": \"https://www.npr.org/about-npr/179878450/privacy-policy\", \"text\": \"Privacy\"}, {\"link\": \"https://www.npr.org/about-npr/179878450/privacy-policy#yourchoices\", \"text\": \"Your Privacy Choices\"}, {\"link\": \"https://www.npr.org/about-npr/186948703/corporate-sponsorship\", \"text\": \"Become an NPR sponsor\"}]"
}