{
    "summary": "Skip to Main Content\n\nMenu\n\n  * Explore Products\n  * Claims\n  * About Us\n  * Resources\n\n  * 1-855-347-3939, call us\n  * Log In\n\n# Life Insurance\n\nA $250,000 policy costs as little as $16 per month.*Read the associated\ndisclosure for this claim. Get a life insurance quote today.\n\nProduct Life\n\nPlus+\n\nChoice Select a policy type\n\nTerm\n\nChoice Select a policy type\n\n  * +Add Final Expense\n  * +Add Short-Term - One-Year\n  * +Added Term\n  * +Add Universal\n  * +Add Whole\n\nZIP Code\n\nLoading\n\n  *   *   * \n\nQS State Label\n\nLoading\n\n  *   *   * \n\nQS State Label\n\n1-877-777-1783\n\nLife insurance rates and coverages are provided and serviced by either an\naffiliated insurer or non-affiliated third parties. Read more.\n\nBundle and save an average of 5% on auto!Δ\n\n  * Auto + Home , Selected\n  * Auto + Condo , Selected\n  * Auto + Renters , Selected\n\n* * *\n\nOr, quote another product\n\n  * ATV/UTV , Selected\n  * Auto , Selected\n  * Boat , Selected\n  * Car Loan Refinancing , Selected\n  * Car Shopping , Selected\n  * Classic Car , Selected\n  * Commercial , Selected\n  * Condo , Selected\n  * Dental , Selected\n  * Electronic Device , Selected\n  * Flood , Selected\n  * Golf Cart , Selected\n  * Health , Selected\n  * Homeowners , Selected\n  * Home Loans , Selected\n  * Home Security , Selected\n  * Home Warranty , Selected\n  * ID Theft , Selected\n  * Jewelry , Selected\n  * Life , Selected\n  * Mechanical Repair , Selected\n  * Mexico Auto , Selected\n  * Mexico Boat & Watercraft Insurance , Selected\n  * Mobile Home , Selected\n  * Mortgage Refinance & Home Equity Loans , Selected\n  * Motorcycle , Selected\n  * Online Banking , Selected\n  * Personal Loans , Selected\n  * Pet , Selected\n  * Renters , Selected\n  * RV/Trailer , Selected\n  * Segway , Selected\n  * Snowmobile , Selected\n  * Travel , Selected\n  * Umbrella , Selected\n  * Vision , Selected\n  * Wedding & Event , Selected\n\n  * Final Expense, Selected\n  * Short-Term - One-Year, Selected\n  * Term, Selected\n  * Universal, Selected\n  * Whole, Selected\n\nExplore Life Insurance\n\nPlans, info, & more\n\n  * Life Insurance \n    * Term ›\n      * Compare Rates ›\n    * Final Expense ›\n    * Short-Term - One-Year ›\n    * Permanent - Whole ›\n    * Permanent - Universal ›\n\nClose Section Menu\n\n  1.   2. Insurance\n  3. Life Insurance\n\n## What is life insurance?\n\nPurchasing life insurance allows you to provide a safety net for your loved\nones in case you pass away. A life insurance policy is a contract stating\nthat, as long as your premium is paid and the policy is active when you die,\nyour beneficiaries can receive a death benefit payout to be used however they\nlike — for final expenses, paying off outstanding debt, and even everyday\ncosts.\n\n## Types of life insurance products\n\nLife insurance policies generally fall into three categories: term, permanent,\nand final expense. Once you understand the difference, you can easily\ndetermine which is right for your beneficiaries' needs and your budget.\n\n  * **Term policies** last a set timeframe (often 1, 10, 15, 20, or 30 years) and are affordable. They're typically for supporting your loved ones in case you pass away unexpectedly. In some states, we also offer a \"flexible term\" policy via Progressive Life Insurance Company — it allows you to adjust your coverage amount (up or down) without having to re-apply or get a new policy. †Read the associated disclosure for this claim.\n  * **Permanent policies** last your entire lifetime, have cash value that grows, and are more expensive.\n  * **Final expense policies** are a more affordable type of permanent life insurance with a lower death benefit that's designed to cover your end-of-life costs.\n\nExplore the types of life insurance we offer.\n\n  * ### Term life insurance›\n\n**Term**. Popular and affordable, traditional term life insurance is for\nprotecting your loved ones in case you pass while they still depend on your\nincome. Get coverage for 10, 15, 20, or 30 years.\n\n  * ### Final expense insurance›\n\n**Final expense**. Also known as burial insurance, it's designed to cover your\nfuneral, health care bills, and other costs after you pass away. It's an\naffordable policy with no medical exam.\n\n  * ### Short-term life insurance›\n\n**Term**. Starting out with life insurance or have a temporary need? This\nunique policy provides one year of inexpensive coverage. There's no medical\nexam so you can quickly get a policy online.\n\n  * ### Whole life insurance›\n\n**Permanent**. The most popular permanent policy, whole life provides coverage\nfor your entire life at a fixed premium. Plus, it builds cash value at a fixed\nrate over time, which you can borrow from.\n\n  * ### Universal life insurance›\n\n**Permanent**. Universal life lets you change your payment and death benefit\namount over time. Its cash value depends more on the market than whole life\nand can grow into a no-cost policy.\n\nSee more types See less types\n\n## Which life insurance policy is right for me?\n\nConsider your budget and your reasons for getting life insurance when\ndetermining which type of life policy is best for you. Do you want to make\nsure your income is replaced in case you die before you retire? Or do you need\ncoverage no matter when you pass? Explore these quick tips for narrowing down\nyour options.\n\nPOLICY TYPES\n\n### Term life\n\nTerm life insurance with a term of 10, 15, 20, or 30 years makes sense if:\n\n  * You support a partner, spouse, or children\n  * You're paying off debt, like a mortgage\n  * Your loved ones depend on your income\n\n **Example:** You're married, in your 20s, and a new homeowner with a 30-year\n$250,000 mortgage. You get a 30-year term life insurance policy with $250,000\nof coverage and name your spouse as the beneficiary. In case you pass away in\nthe next 30 years, they can use the death benefit to pay off the mortgage and\ncover other costs.\n\n### Final expense\n\nFinal expense or burial life insurance makes sense if:\n\n  * You're between 50 and 85 years old\n  * You want an affordable policy\n  * You only want your funeral and other final expenses covered\n\n **Example:** You're 55 and planning for your retirement years. You want to\nmake sure your loved ones don't have to pay for your burial and funeral costs\nwhen you pass away, so you estimate your final expenses and purchase an\naffordable policy for that amount.\n\n### Short-term (one year)\n\nOne year of term life insurance coverage makes sense if:\n\n  * You want to try out life insurance\n  * You only want temporary coverage\n  * You're in between jobs and temporarily without employer-provided coverage\n\n **Example:** You are 25, have a child, and aren't sure where to start with\nlife insurance. You decide to get one year of highly affordable coverage so\nyou can decide if you want to commit to a longer-term policy.\n\n### Whole life\n\nA permanent, whole life insurance policy makes sense if:\n\n  * You want to be covered no matter when you pass away\n  * You want the cash value feature and the option to take out a life insurance loan\n  * You want a fixed premium and hands-off cash value growth\n\n **Example:** You have long-term dependents that will rely on you until you\npass away, so you purchase whole life insurance to make sure they can claim\nthe death benefit no matter when you die.\n\n### Universal life\n\nA permanent, universal life insurance policy makes sense if:\n\n  * You want to be covered no matter when you pass away\n  * You want the potential of a zero-cost policy or an adjustable premium\n  * You want the benefit of cash value and can afford the higher fees and risks associate with universal life's cash value growth setup\n\n **Example:** You want to make sure your kids are covered even if you die well\ninto your senior years. While universal life has higher costs, fees, and risks\nthan whole life, you can afford it and you like the potential of an adjustable\npremium or a no-cost policy.\n\n## How much does life insurance cost?\n\nGenerally, the younger and healthier you are, the more affordable your life\ninsurance can be — starting at just $16 per month through Progressive Life by\neFinancial.*Read the associated disclosure for this claim. Coverage options\nbegin at $5,000 and go up to $2 million or more through eFinancial. Through\nProgressive Life Insurance Company, coverage options range from $50,000 to $1\nmillion.\n\nKeep in mind that permanent life policies generally cost more than term life\npolicies. And the longer a term policy lasts, the more you'll pay. Learn more\nabout how much life insurance costs and compare term life insurance rates\nthrough Progressive Life by eFinancial to find a policy that fits your needs\nand budget.\n\neFinancial works with highly rated life insurance companies to help bring you\ncompetitive rates and a variety of simplified life insurance options, such as\nRAPIDecision® Life — giving you the possibility to purchase life insurance\nwith no exam. Progressive Life Insurance Company also offers term life\npolicies that don't require a medical exam.\n\nDID YOU KNOW?\n\nAccording to the 2023 Insurance Barometer Study, over half of survey\nrespondents guessed that a 20-year, $250,000 term life insurance policy for a\nhealthy 30-year-old would cost $500 per year or more. But the average cost is\nactually much lower — under $200 per year. Case in point, don't put off buying\nlife insurance because you think it'll be too expensive. Get a quote and see\nfor yourself how affordable it can be.\n\n## Common questions about life insurance\n\n### How much life insurance do I need?\n\nAccording to eFinancial, a common recommendation is to carry life insurance\nwith a death benefit that's 7 to 10 times your annual income, but that doesn't\ntake into account your unique financial situation. Use our life insurance\ncalculator to get more precise with how much life insurance you need.\n\n### What age should you buy life insurance?\n\nGenerally, the younger you are the more affordable your coverage will be, but\nyou can find life insurance that fits your financial needs at almost any age.\nBesides age, you should consider buying life insurance if you have a family or\ndebt that your estate would be responsible for. Learn more about when to get\nlife insurance.\n\n### What does life insurance cover?\n\nYour beneficiaries can use the death benefit from your life insurance policy\nfor any expenses they have. Some common uses for these funds include paying\nfor funeral services, child tuition, mortgage payments, and other everyday\nexpenses that would be a considerable burden with the loss of your income.\nOthers may use their life insurance to leave an inheritance for their children\nand to settle any debt their estate holds once they pass away.\n\n### Are there any medical exams required to purchase a life insurance policy?\n\nInsurers typically require a medical exam when buying a traditional life\ninsurance policy. The exam allows them to evaluate your physical health and\nmedical history, determining the overall risk of issuing a life insurance\npolicy to you. However, there are other types of life insurance that don't\nrequire a medical exam , called simplified or guaranteed issue life insurance.\nThese may be a good option if you have health conditions that make you\nineligible for traditional life insurance.\n\n## Learn more about life insurance\n\nHave additional questions? Progressive Answers is your resource for all things\ninsurance. See all our life insurance tips and resources.\n\n  * How does life insurance work?›\n\nExplore an easy, five-minute guide to life insurance\n\n  * When should you get life insurance?›\n\nGet help determining the right time and age to get a policy\n\n  * What is a life insurance rider?›\n\nBrowse the different riders that can be added to a life policy\n\n  * Types of life insurance explained›\n\nLearn what's different about the policy types so you can choose\n\n### Get a free life insurance quote online in minutes\n\nGet a quote **Or, call 1-866-912-2477**\n\n### Auto\n\nEnter ZIP Code\n\nBundle discount! Save on auto when you add property\n\n+Add Home +Add Condo +Add Renters\n\nSave an average of 5% on auto when you add to propertyΔ\n\n+Add Auto\n\nLoading\n\n  *   *   * \n\nQS State Label\n\nBundle discount! Save on auto when you add property\n\n+Add Home +Add Condo +Add Renters\n\nSave an average of 5% on auto when you add to propertyΔ\n\n+Add Auto\n\nLoading\n\n  *   *   * \n\nQS State Label\n\n1-877-777-1783\n\nMonday - Friday: 8:00am to 8:00pm Eastern Time\n\nOr, see all products Or, learn more\n\nBundle and save an average of 5% on auto!Δ\n\n  * Selected, Auto + Home\n  * Selected, Auto + Condo\n  * Selected, Auto + Renters\n\nOr, quote another product\n\n  * Selected, ATV/UTV\n  * Selected, Auto\n  * Selected, Boat\n  * Selected, Car Loan Refinancing\n  * Selected, Car Shopping\n  * Selected, Classic Car\n  * Selected, Commercial\n  * Selected, Condo\n  * Selected, Dental\n  * Selected, Electronic Device\n  * Selected, Flood\n  * Selected, Golf Cart\n  * Selected, Health\n  * Selected, Homeowners\n  * Selected, Home Loans\n  * Selected, Home Security\n  * Selected, Home Warranty\n  * Selected, ID Theft\n  * Selected, Jewelry\n  * Selected, Life\n  * Selected, Mechanical Repair\n  * Selected, Mexico Auto\n  * Selected, Mexico Boat & Watercraft Insurance\n  * Selected, Mobile Home\n  * Selected, Mortgage Refinance & Home Equity Loans\n  * Selected, Motorcycle\n  * Selected, Online Banking\n  * Selected, Personal Loans\n  * Selected, Pet\n  * Selected, Renters\n  * Selected, RV/Trailer\n  * Selected, Segway\n  * Selected, Snowmobile\n  * Selected, Travel\n  * Selected, Umbrella\n  * Selected, Vision\n  * Selected, Wedding & Event\n\nBack\n\nBundle discount! Save on auto when you add property\n\n+Add Home +Add Condo +Add Renters\n\nSave an average of 5% on auto when you add to propertyΔ\n\n+Add Auto\n\nEnter ZIP Code\n\nLoading\n\n  *   *   * \n\nQS State Label\n\nBundle discount! Save on auto when you add property\n\n+Add Home +Add Condo +Add Renters\n\nSave an average of 5% on auto when you add to propertyΔ\n\n+Add Auto\n\nLoading\n\n  *   *   * \n\nQS State Label\n\nOr, see all products Or, learn more\n\nDisclosures\n\nBack to quote\n\nClose\n\nSite Navigation\n\n  * Explore Products\n  * Claims\n  * About Us\n  * Resources\n\nExplore Products\n\nVehicle\n\n  * ATV/UTV\n  * Auto\n  * Boat\n  * Classic Car\n  * Golf Cart\n  * Mechanical Breakdown\n  * Mexico Auto\n  * Motorcycle\n  * PWC\n  * RV/Trailer\n  * Segway\n  * Snowmobile\n\nProperty\n\n  * Condo\n  * Flood\n  * Homeowners\n  * Home Security\n  * Home Warranty\n  * Mobile Home\n  * Renters\n\nBundling\n\n  * Auto + Property\n\nFinance\n\n  * Car Loan Refinancing\n  * Car Shopping Service\n  * Home Loans\n  * Mortgage Refinancing\n  * Online Checking\n  * Personal Loans\n\nCommercial\n\n  * Business Insurance\n  * Business Owners Policy\n  * Commercial Auto\n  * General Liability\n  * Professional Liability\n  * Workers’ Compensation\n\nPersonal\n\n  * Dental\n  * Electronic Device\n  * Health\n  * ID Theft\n  * Jewelry\n  * Life\n  * Pet\n  * Travel\n  * Umbrella\n  * Vision\n  * Wedding & Event\n\nView all products›\n\nWays to Save\n\n  * Save with Snapshot›\n  * Name Your Price® Tool›\n  * Compare Auto Rates›\n\nClaims\n\nClaims\n\n  * Claims Overview\n  * Auto Process\n  * Claims FAQ\n  * Catastrophe\n\nHelp on the Road\n\n  * Roadside Assistance\n  * If You're in an Accident\n  * How to Jump a Battery\n\nReport a new claim or view the status of an existing claim\n\n  * Account log in\n\nContinue as a guest to report a claim or view my claim\n\nAbout Us\n\nAbout Progressive\n\nWhether you’re looking for a new career or simply want to learn more about\nProgressive, you can find all the information you need to get started here.\n\nWho We Are›\n\nGet to know our culture and people\n\nInvestors›\n\nLearn about our goals and how we achieve them\n\nCorporate Responsibility›\n\nDiscover how we live our core values within our communities\n\nLocal Agents›\n\nFind an agent near you\n\nNewsroom›\n\nSee what we’re up to, as well as what we’ve accomplished\n\nProgressive Art Collection›\n\nTour our art installations, collection highlights, and more\n\nCareers›\n\nLearn about our teams, apply for a job, and more\n\n  * View job openings\n  * Careers login\n\nResources\n\nProgressive resources\n\nFind answers to your insurance questions, insights into current trends, and\ntools for navigating life in our resource center.\n\nAnswers›\n\nInsurance doesn't have to be complicated. Get easy explanations for all your\nquestions.\n\nInsights›\n\nExplore our data-based deep dives to understand the latest trends on and off\nthe road.\n\nLife Lanes›\n\nGet quick tips for navigating life, from car- and home-ownership to going on\nadventures.\n\nTools & Calculators›\n\nA little prep goes a long way. Calculate how much you can afford.\n\nCommercials & Campaigns›\n\nCatch what's new from Progressive – online, on TV, and on the road.\n\nLooking for more resources?\n\nChat now to ask Flo anything or explore commonly asked questions.\n\n  * Log In\n  * Contact us\n\nClose Menu\n\n  * Insurance Insurance\n\n    * Car Insurance\n    * Home Insurance\n    * Progressive Answers\n    * Explore All Products\n\n  * Our Company Our Company\n\n    * About Us\n    * Careers\n    * Investors\n    * Newsroom\n\n  * Quick Links Quick Links\n\n    * Continue Previous Quote\n    * Report a Claim\n    * Make a Payment\n    * PerkShare\n\n  * Connect Connect\n\n    * 1-855-347-3939\n    * Contact Us\n    * Progressive App\n    * Become a Partner\n\nSearch / Keywords\n\nLoading\n\n  *   *   * \n\n  * Facebook\n  * Instagram\n  * YouTube\n  * TikTok\n  * X, Formerly Twitter\n  * Lifelanes\n\n  * Contact Us\n  * Site Map\n  * Accessibility Services\n  * Technical Help\n  * Privacy & Security\n  * Terms of Use\n  * CA Notice at Collection\n  * Insurance Resources\n  * Do Not Sell or Share My Personal Information (CA Residents Only)\n\n**THE #1 INSURANCE WEBSITE**\n\nCopyright 1995 - 2024. Progressive Casualty Insurance Company. All Rights\nReserved.\n\nWe offer insurance by phone, online and through independent agents. Prices\nvary based on how you buy.\n\nCertain term life insurance policies for Arizona, Indiana, Louisiana,\nMaryland, Michigan, Missouri, Ohio, Pennsylvania and Virginia residents are\nunderwritten by Progressive Life Insurance Company.\n\nProgressive Advantage Agency, Inc. refers all other consumers seeking life\ninsurance to Efinancial, LLC for placement with insurers offering that\ncoverage. eFinancial and the insurers are not affiliated with Progressive. PAA\nand Progressive are not responsible for insurer or coverage selections,\npolicies issued, claims, the content or operation of others' websites, or how\nothers handle or use your information. Information you provide to others is\nsubject to their privacy policies and website terms of use, and may be shared\nwith us.\n\nPAA receives compensation from eFinancial or its affiliate that may vary based\non the number of applications taken by eFinancial and the policy you buy.\nContact us for more details.\n\nPrice, coverage, and coverage terms and conditions may vary between insurers.\nAvailability may vary by state.\n\nProgressive Advantage Agency, Inc. (PAA) will transfer you to Efinancial, LLC\nfor placement with insurers offering this coverage. eFinancial and the\ninsurers are not affiliated with Progressive and are solely responsible for\ntheir websites, products, and services. Information about you is subject to\ntheir privacy policies and may be shared with PAA and its affiliates for their\nmarketing and other uses. PAA receives compensation from eFinancial or its\naffiliate that may vary based on the number of applications taken by\neFinancial and the policy you buy. Contact us for more details.\n\nPrice and coverage may vary by insurer. May not be available in all states.\nPAA (CA Lic #0F50053, TX Lic #1394132) is domiciled in Ohio and has its\nprincipal place of business at 6300 Wilson Mills Road, Mayfield Village, Ohio\n44143.\n\nThis material is for informational purposes only and should not be considered\ntax or legal advice. Please consult a professional advisor for any tax and/or\nlegal advice to fit your particular circumstances.\n\n*Life insurance rate quotes referenced in eFinancial's materials are based on a composite of participating carriers’ best-published monthly premium rates for 10-year, term life policies with face amounts of $250,000 as of 6/8/2022. Unless noted otherwise, the comparison rates are made for male, preferred plus, non-tobacco user, and female, preferred plus, non-tobacco user – age 19-34. Rates and products available may vary by state. All policies are subject to underwriting approval. Also, the rates and time taken to purchase a policy vary by product. Quotes are provided for information purposes only and do not constitute an offer of insurance.\n\n†Progressive Life Insurance's Flexible policy is a term life policy that\nallows the insured to request an increase in the coverage amount within the\nfirst 10 years of the policy for the following covered life events: marriage,\ndivorce, adding a child to your family through birth, adoption or marriage, or\npurchasing a home. Coverage amount increases must be between $25,000 and\n$200,000 (in $1,000 increments), and are subject to overall policy and company\nlimitations. Coverage amount increase requests require proof of the qualifying\nlife event but do not require a new application, medical exams or testing, or\na new medical questionnaire. With the health status freeze feature, the new\nincreased coverage amount will be rated at the age and health status of the\ninsured at the time of the initial policy application. Coverage amount\ndecrease are subject to Progressive Life's minimum coverage amount.\n\n ****\n\n",
    "links": "[{\"link\": \"https://www.progressive.com/life-insurance/term-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.progressive.com/life-insurance/term-insurance/compare-life-insurance-rates/\", \"text\": \"\"}, {\"link\": \"https://www.progressive.com/life-insurance/final-expense/\", \"text\": \"\"}, {\"link\": \"https://www.progressive.com/life-insurance/1-year-short-term-life-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.progressive.com/life-insurance/whole-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.progressive.com/life-insurance/universal-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.progressive.com/life-insurance/term-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.progressive.com/life-insurance/final-expense/\", \"text\": \"\"}, {\"link\": \"https://www.progressive.com/life-insurance/1-year-short-term-life-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.progressive.com/life-insurance/whole-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.progressive.com/life-insurance/universal-insurance/\", \"text\": \"\"}, {\"link\": \"https://www.progressive.com/life-insurance/term-insurance/ \", \"text\": \"Term life insurance\"}, {\"link\": \"https://www.progressive.com/life-insurance/final-expense/\", \"text\": \"Final expense or burial life insurance\"}, {\"link\": \"https://www.progressive.com/life-insurance/1-year-short-term-life-insurance/\", \"text\": \"One year of term life insurance\"}, {\"link\": \"https://www.progressive.com/life-insurance/whole-insurance/\", \"text\": \"whole life insurance policy\"}, {\"link\": \"https://www.progressive.com/life-insurance/universal-insurance/\", \"text\": \"universal life insurance policy\"}, {\"link\": \"https://www.progressive.com/life-insurance/term-insurance/compare-life-insurance-rates/\", \"text\": \"compare term life insurance rates\"}, {\"link\": \"https://www.progressive.com/answers/life-insurance-rider/\", \"text\": \"\"}, {\"link\": \"https://www.progressive.com/life-insurance/\", \"text\": \"Life\"}]"
}